{
    "000617.SZ": {
        "short_name": "CNPC CAPITAL COMPA",
        "long_name": "CNPC Capital Company Limited",
        "summary": "CNPC Capital Company Limited operates as a financial company in China. It is involved in the banking, financial leasing, trust, insurance, insurance brokerage, securities, and other financial activities. The company was formerly known as Jinan Diesel Engine Co., Ltd. and changed its name to CNPC Capital Company Limited in February 2017. The company was founded in 1996 and is based in Beijing, China. CNPC Capital Company Limited is a subsidiary of China National Petroleum Corporation.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "002423.SZ": {
        "short_name": "COFCO CAPITAL HOLD",
        "long_name": "COFCO Capital Holdings Co., Ltd.",
        "summary": "Zhongyuan Special Steel Co., Ltd. engages in the research, development, production, sale, and servicing of industrial special equipment and special steel precision forgings in China. Its industrial special equipment products include oil drilling tools, dynamic mandrels, fan main shafts, cast pipe molds, ultra high pressure containers, forged steel cold rolls, hydraulic cylinders, etc.; and special steel precision forgings comprise mold steel, stainless steel, bearing steel, and special products. The company's products are used in petroleum, electric power, chemical, shipbuilding, metallurgy, machinery, military, and other equipment manufacturing industries. It also exports its products to Europe, the United States, Japan, South Korea, Africa, South Asia, and Southeast Asia countries and regions. The company is based in Jiyuan, China. COFCO Capital Holdings Co., Ltd. operates as a subsidiary of COFCO Corporation",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Jiyuan"
    },
    "002647.SZ": {
        "short_name": "RENDONG HOLDINGS C",
        "long_name": "Rendong Holdings Co., Ltd.",
        "summary": "Rendong Holdings Co., Ltd. provides financial services. It offers third-party payment, credit information, big data, inclusive finance, supply chain, factoring, asset management, etc. The company is also involved in traditional financial services, such as banking, trust, securities, insurance, etc.; and supply chain finance, factoring, micro finance, and leasing businesses. The company was formerly known as Meson Fintech Co., Ltd. and changed its name to Rendong Holdings Co., Ltd. in August 2018. Rendong Holdings Co., Ltd. was founded in 1998 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "002670.SZ": {
        "short_name": "GUOSHENG FINANCIAL",
        "long_name": "Guosheng Financial Holding Inc.",
        "summary": "Guosheng Financial Holding Inc. together with its subsidiaries, provides diversified financial services in China. It engages in the securities business through 200 branches in 30 provinces and autonomous regions, as well as operates a financial platform; and investment business, including funds, management, and business cooperation services to various enterprises. The company is also involved in the financial technology business comprising big data, cloud computing, artificial intelligence, blockchain, and other technologies; and development of financial industry information collaboration solutions, regulatory technologies, intelligent data services, and digital currency platforms. Guosheng Financial Holding Inc. was founded in 1995 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "0613.HK": {
        "short_name": "PLANETREE INT'L",
        "long_name": "Planetree International Development Limited",
        "summary": "Planetree International Development Limited, an investment holding company, engages in treasury management, financial, and money lending businesses in Hong Kong. The company is involved in trading and holding debt and equity securities; financing and securities investment activities; property leasing; dealing in futures contracts; and securities investment activities. It also offers corporate management services; securities brokerage and financial services; and asset management services. The company was formerly known as Yugang International Limited and changed its name to Planetree International Development Limited in July 2019. Planetree International Development Limited is headquartered in North Point, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "North Point"
    },
    "1945.HK": {
        "short_name": "ZERO2IPO",
        "long_name": "Zero2IPO Holdings Inc.",
        "summary": "Zero2IPO Holdings Inc., an investment holding company, provides integrated equity investment services in the People's Republic of China. It operates an integrated service platform that offers data, consulting, marketing, and training services to participants in the equity investment industry. The company provides PEdata Database and research report services that enable convenient and easy-to-navigate access to industry data and informed decision-making. It also offers omni-channel marketing services through its online information platforms, such as PEdaily; and offline industry events, which track industry trends and facilitate intra- and inter-industry networking. In addition, the company connects entrepreneurs and growth enterprises with investors through its online investor-entrepreneur matching platform and offline consulting services. Further, it provides various equity investment-related online and offline training courses through SandHill University, SandHill College, and Investment College. The company provides its services through online and offline channels for participants in the equity investment industry, including investors, entrepreneurs, growth enterprises, and government agencies. Zero2IPO Holdings Inc. was founded in 2001 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "3329.HK": {
        "short_name": "BOCOM INTL",
        "long_name": "BOCOM International Holdings Company Limited",
        "summary": "BOCOM International Holdings Company Limited, an investment holding company, provides securities and related financial services in Hong Kong and Mainland China. It operates through Brokerage, Corporate Finance and Underwriting, Asset Management and Advisory, Margin Financing, and Investment and Loans segments. The Brokerage segment trades in stocks, bonds, futures, options, and other marketable securities. The Corporate Finance and Underwriting segment provides corporate finance services, including equity underwriting, debt underwriting, sponsor services, and financial advisory services to institutional clients. The Asset Management and Advisory segment offers traditional asset management products and services to third party clients; and investment advisory, portfolio management, and transaction execution services. The Margin Financing segment provides securities-backed financial leverage for retail and institutional clients. The Investment and Loans segment engages in direct investment business, including investments in various debt and equity securities, investment in companies, and investment in loans. The company was formerly known as BOCOM Securities Company Limited and changed its name to BOCOM International Holdings Company Limited in May 2007. BOCOM International Holdings Company Limited was incorporated in 1998 and is headquartered in Central, Hong Kong. BOCOM International Holdings Company Limited is a subsidiary of Bank of Communications Co., Ltd.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "3623.HK": {
        "short_name": "C SUCCESS FIN",
        "long_name": "China Success Finance Group Holdings Limited",
        "summary": "China Success Finance Group Holdings Limited, an investment holding company, provides financial and non-financial guarantee, financial leasing, and financial consultancy services in the People's Republic of China. The company offers financial guarantees, such as corporate financial, individual credit, financial leasing equipment, trusteeship, joint bond, corporate bond issuance, non-financing, and performance guarantees, as well as letter of guarantee for construction, and financing/financial consultancy and financial technology services. It also provides asset management services, including investment and financing management, asset/debt restructuring, special asset acquisition, corporate financial management, and financial consultancy services. In addition, the company offers fund management services for asset management, investment advisories, and private equity funds; investment and acquisition; capital; real estate finance; and micro credit services. Further, it provides financial leasing services comprising direct leasing, sale-leaseback, trusted leasing, joint leasing, and bank factoring. China Success Finance Group Holdings Limited was founded in 1996 and is headquartered in Wanchai, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "5871.TW": {
        "short_name": "CHAILEASE HOLDING COMPANY LIMIT",
        "long_name": "Chailease Holding Company Limited",
        "summary": "Chailease Holding Company Limited, an investment holding company, provides various leasing and financing services in Taiwan, China, ASEAN countries, and internationally. It offers leasing services for a range of assets, including transportation, industrial, medical, and information and office-related equipment, as well as aircraft; and installment sales service to corporate customers in various industries, such as transportation, storage and communications, wholesale and retail, and construction, as well as to individual consumers. The company also provides import/export factoring services; direct financing services, such as corporate loans to SMEs, and micro and large size enterprises; and debt collection and management, debt and collateral appraisal, auctioning, and past-due accounts receivable management services to financial institutions. In addition, it is involved in the life and property insurance brokerage; engineering, procurement, construction, operations, and maintenance of solar power plants; and real estate development businesses. Further, the company provides house property leasing and management services; financial consulting and investment activities; mortgage services; and cloud products software. Chailease Holding Company Limited was founded in 1977 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "5871A.TW": {
        "short_name": "CHAILEASE HOLDING COMPANY LIMIT",
        "long_name": "Chailease Holding Company Limited",
        "summary": "Chailease Holding Company Limited, an investment holding company, provides various leasing and financing services in Taiwan, China, ASEAN countries, and internationally. It offers leasing services for a range of assets, including transportation, industrial, medical, and information and office-related equipment, as well as aircraft; and installment sales service to corporate customers in various industries, such as transportation, storage and communications, wholesale and retail, and construction, as well as to individual consumers. The company also provides import/export factoring services; direct financing services, such as corporate loans to SMEs, and micro and large size enterprises; and debt collection and management, debt and collateral appraisal, auctioning, and past-due accounts receivable management services to financial institutions. In addition, it is involved in the life and property insurance brokerage; engineering, procurement, construction, operations, and maintenance of solar power plants; and real estate development businesses. Further, the company provides house property leasing and management services; financial consulting and investment activities; mortgage services; and cloud products software. Chailease Holding Company Limited was founded in 1977 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "597.F": {
        "short_name": "BOCOM INT.HLDGS CO. LTD",
        "long_name": "BOCOM International Holdings Company Limited",
        "summary": "BOCOM International Holdings Company Limited, an investment holding company, provides securities and related financial services in Hong Kong and Mainland China. It operates through Brokerage, Corporate Finance and Underwriting, Asset Management and Advisory, Margin Financing, and Investment and Loans segments. The Brokerage segment trades in stocks, bonds, futures, options, and other marketable securities. The Corporate Finance and Underwriting segment provides corporate finance services, including equity underwriting, debt underwriting, sponsor services, and financial advisory services to institutional clients. The Asset Management and Advisory segment offers traditional asset management products and services to third party clients; and investment advisory, portfolio management, and transaction execution services. The Margin Financing segment provides securities-backed financial leverage for retail and institutional clients. The Investment and Loans segment engages in direct investment business, including investments in various debt and equity securities, investment in companies, and investment in loans. The company was formerly known as BOCOM Securities Company Limited and changed its name to BOCOM International Holdings Company Limited in May 2007. BOCOM International Holdings Company Limited was incorporated in 1998 and is headquartered in Central, Hong Kong. BOCOM International Holdings Company Limited is a subsidiary of Bank of Communications Co., Ltd.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "600390.SS": {
        "short_name": "MINMETALS CAPITAL COMPANY LIMIT",
        "long_name": "Minmetals Capital Company Limited",
        "summary": "Minmetals Capital Company Limited engages in the investment, finance, leasing, trusts, securities, futures, and insurance and other businesses in China. The company offers trust, investment fund, investment banking, wealth management, an others services. It also provides direct finance, after-sale, vendor, and operating leasing services; and a range of brokerage, fixed income, asset management, and securities brokerage and investment advisory services. In addition, the company offers derivatives integrated service platform and futures brokerage services; and commercial banking services. It operates 68 business outlets in Mianyang City. The company was formerly known as Kingray New Materials Science & Technology Co., Ltd and changed its name to Minmetals Capital Company Limited in March 2017. Minmetals Capital Company Limited was incorporated in 1999 and is based in Changsha, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Changsha"
    },
    "600621.SS": {
        "short_name": "SHANGHAI CHINAFORTUNE CO LTD",
        "long_name": "Shanghai Chinafortune Co., Ltd.",
        "summary": "Shanghai Chinafortune Co., Ltd., through its subsidiaries, operates in the financial services industry. It engages in securities, funds, and futures; and financial leasing businesses. The company was formerly known as Shanghai Jinling Co., Ltd. and changed its name to Shanghai Chinafortune Co., Ltd. in January 2013. Shanghai Chinafortune Co., Ltd. was founded in 1952 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "ABCAPITAL.NS": {
        "short_name": "ADITYA BIRLA CAPIT",
        "long_name": "Aditya Birla Capital Limited",
        "summary": "Aditya Birla Capital Limited, through its subsidiaries, provides various financial products and services in India and internationally. It offers life insurance products, such as protection, wealth with protection, children's future, health, retirement, and savings with protection insurance; health; wellness; motor, damage, natural calamities, personal accident cover, and third party legal liability; and travel insurance products. The company also provides financing solutions, such as home loans, loans against property, and personal loans; lines of credit, business loans, working capital demand loans, and supply chain financing solutions for small and medium enterprises; and loans against shares, mutual funds, and life insurance policy, as well as ESOP and IPO financing, and promoter and margin trade funding services. In addition, it offers investment services, such as mutual funds, pension funds, stocks and securities, real estate investment, wealth management, and portfolio management services. Further, the company provides financial and IT enabled services; private equity investment, and advisory and management services; stock broking and depository services; and risk advisory, fund management, asset management, and trustee services, as well as other business support and value added services. Additionally, it offers advising solutions, such as MoneyForLife Planner, an online tool that offers personalized financial planning solution; and ABC of Money, which provides money solutions. The company was formerly known as Aditya Birla Financial Services Limited and changed its name to Aditya Birla Capital Limited in June 2017. The company was incorporated in 2007 and is based in Mumbai, India. Aditya Birla Capital Limited is a subsidiary of Grasim Industries Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "AFH.JO": {
        "short_name": "Alexander Forbes Grp Hldgs",
        "long_name": "Alexander Forbes Group Holdings Limited",
        "summary": "Alexander Forbes Group Holdings Limited provides integrated retirement and investment solutions for individuals and businesses in South Africa and internationally. The company's solutions for individuals cover money management, budgeting, and savings services; goal based, unit trusts, endowments, and offshore investment; retirement pension or provident, and annuity funds; healthcare solutions and support, and consulting services; life and risk cover; and wills and estate planning services, as well as private wealth management services. Its solutions for businesses cover consulting and actuarial services; retirement fund services; healthcare consulting, health management solutions, and technical advisory services; group and business insurance services that cover assets, earnings, and the legal liabilities of business against loss or damage; services that cover emerging markets in Arica; and trust and beneficiary services that cover the management of death benefits for beneficiaries of deceased retirement fund members and employees. The company was formerly known as Alexander Forbes Equity Holdings Proprietary Limited and changed its name to Alexander Forbes Group Holdings Limited in June 2014. Alexander Forbes Group Holdings Limited was founded in 1935 and is headquartered in Sandton, South Africa.",
        "currency": "ZAc",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "city": "Sandton"
    },
    "BICECORP.SN": {
        "short_name": "BICECORP SA",
        "long_name": "Bicecorp S.A.",
        "summary": "BICECORP S.A., through its subsidiaries, provides various financial products and services in Chile. It offers commercial banking products and services, such as finance, cash management, foreign trade, payments and collections, lines of credit, credit cards, means of payment, treasury, and insurance brokerage. The company provides life insurance products, including pension and private annuities, individual and group life and health insurance, disability and survival insurance, and consumer loans. It is also involved in the real estate business; and providing consulting, investment, development, and business administration services. In addition, the company offers automotive financing; financial instruments backed by flows from assets; mutual and investment funds, asset management, third-party funds, financial intermediation, and corporate finance; and mutual mortgages. The company was founded in 1978 and is based in Santiago, Chile. BICECORP S.A. is a subsidiary of Servicios Y Consultoria Ltda.",
        "currency": "CLP",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "Chile",
        "city": "Santiago de Chile"
    },
    "BOI7.F": {
        "short_name": "IMAGI INTL NEW  HD-,04",
        "long_name": "Imagi International Holdings Limited",
        "summary": "Imagi International Holdings Limited, an investment holding company, engages in the financial services, computer graphic imaging (CGI), and cultural and entertainment businesses in Hong Kong. The company operates through Securities Brokerage and Asset Management, Trading of Securities, Provision of Finance, and Entertainment segments. It offers financial services, such as securities investments and proprietary trading, securities brokerage, margin financing, and money lending services; and invests in movie business and film rights. The company also holds and licenses intellectual property rights of CGI animation picture; and provides administrative services. Imagi International Holdings Limited is headquartered in North Point, Hong Kong.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "North Point"
    },
    "BOI7.SG": {
        "short_name": "Imagi Intl Holdings Ltd. Regist",
        "long_name": "Imagi International Holdings Limited",
        "summary": "Imagi International Holdings Limited, an investment holding company, engages in the financial services, computer graphic imaging (CGI), and cultural and entertainment businesses in Hong Kong. The company operates through Securities Brokerage and Asset Management, Trading of Securities, Provision of Finance, and Entertainment segments. It offers financial services, such as securities investments and proprietary trading, securities brokerage, margin financing, and money lending services; and invests in movie business and film rights. The company also holds and licenses intellectual property rights of CGI animation picture; and provides administrative services. Imagi International Holdings Limited is headquartered in North Point, Hong Kong.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "North Point"
    },
    "BRGE11.SA": {
        "short_name": "ALFA CONSORCPNE",
        "long_name": "Consórcio Alfa de Administração S.A.",
        "summary": "ConsÃ³rcio Alfa de AdministraÃ§Ã£o S.A., through its subsidiaries, provides financing, insurance, and technology and services in Brazil. It operates through Retail, Insurance and Pension, and Services segments. The company was formerly known as ConsÃ³rcio Real Brasileiro de AdministraÃ§Ã£o S.A. and changed its name to ConsÃ³rcio Alfa de AdministraÃ§Ã£o S.A. in 1999. The company was founded in 1952 and is headquartered in SÃ£o Paulo, Brazil. Consorcio Alfa de AdministraÃ§Ã£o S.A. is a subsidiary of Administradora Fortaleza Ltda.",
        "currency": "BRL",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "city": "SÃ£o Paulo"
    },
    "BRGE12.SA": {
        "short_name": "ALFA CONSORCPNF",
        "long_name": "Consórcio Alfa de Administração S.A.",
        "summary": "ConsÃ³rcio Alfa de AdministraÃ§Ã£o S.A., through its subsidiaries, provides financing, insurance, and technology and services in Brazil. It operates through Retail, Insurance and Pension, and Services segments. The company was formerly known as ConsÃ³rcio Real Brasileiro de AdministraÃ§Ã£o S.A. and changed its name to ConsÃ³rcio Alfa de AdministraÃ§Ã£o S.A. in 1999. The company was founded in 1952 and is headquartered in SÃ£o Paulo, Brazil. Consorcio Alfa de AdministraÃ§Ã£o S.A. is a subsidiary of Administradora Fortaleza Ltda.",
        "currency": "BRL",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "city": "SÃ£o Paulo"
    },
    "BRGE3.SA": {
        "short_name": "ALFA CONSORCON",
        "long_name": "Consórcio Alfa de Administração S.A.",
        "summary": "ConsÃ³rcio Alfa de AdministraÃ§Ã£o S.A., through its subsidiaries, provides financing, insurance, and technology and services in Brazil. It operates through Retail, Insurance and Pension, and Services segments. The company was formerly known as ConsÃ³rcio Real Brasileiro de AdministraÃ§Ã£o S.A. and changed its name to ConsÃ³rcio Alfa de AdministraÃ§Ã£o S.A. in 1999. The company was founded in 1952 and is headquartered in SÃ£o Paulo, Brazil. Consorcio Alfa de AdministraÃ§Ã£o S.A. is a subsidiary of Administradora Fortaleza Ltda.",
        "currency": "BRL",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "city": "SÃ£o Paulo"
    },
    "BRGE5.SA": {
        "short_name": "ALFA CONSORCPNA",
        "long_name": "Consórcio Alfa de Administração S.A.",
        "summary": "ConsÃ³rcio Alfa de AdministraÃ§Ã£o S.A., through its subsidiaries, provides financing, insurance, and technology and services in Brazil. It operates through Retail, Insurance and Pension, and Services segments. The company was formerly known as ConsÃ³rcio Real Brasileiro de AdministraÃ§Ã£o S.A. and changed its name to ConsÃ³rcio Alfa de AdministraÃ§Ã£o S.A. in 1999. The company was founded in 1952 and is headquartered in SÃ£o Paulo, Brazil. Consorcio Alfa de AdministraÃ§Ã£o S.A. is a subsidiary of Administradora Fortaleza Ltda.",
        "currency": "BRL",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "city": "SÃ£o Paulo"
    },
    "BRGE8.SA": {
        "short_name": "ALFA CONSORCPND",
        "long_name": "Consórcio Alfa de Administração S.A.",
        "summary": "ConsÃ³rcio Alfa de AdministraÃ§Ã£o S.A., through its subsidiaries, provides financing, insurance, and technology and services in Brazil. It operates through Retail, Insurance and Pension, and Services segments. The company was formerly known as ConsÃ³rcio Real Brasileiro de AdministraÃ§Ã£o S.A. and changed its name to ConsÃ³rcio Alfa de AdministraÃ§Ã£o S.A. in 1999. The company was founded in 1952 and is headquartered in SÃ£o Paulo, Brazil. Consorcio Alfa de AdministraÃ§Ã£o S.A. is a subsidiary of Administradora Fortaleza Ltda.",
        "currency": "BRL",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "city": "SÃ£o Paulo"
    },
    "BROOK-R.BK": {
        "short_name": "THE BROOKER GROUP PUBLIC COMPAN",
        "long_name": "The Brooker Group Public Company Limited",
        "summary": "The Brooker Group Public Company Limited, together with its subsidiaries, engages in business and financial consulting, and investment activities in Thailand and internationally. The company provides investment banking and financial consulting services, such as mergers and acquisitions, loan refinancing, rehabilitation, and other capital raising on equity and debt securities; planning and negotiations services; and company valuation and advisory services on investments and joint ventures to multinational companies. It also offers capital for growing companies and leveraged buy-outs; and research services, including industrial market research, B2B market survey, customer satisfaction research, industry and trade surveys, market feasibility study, acquisition research, customized market intelligence/in-depth research, and product and service concept/development test. In addition, the company provides real estate consultancy services comprising specialized services in industrial and commercial real estate properties; transaction, advisory, location consulting, asset recovery, and special property services; and disposition and acquisition, advisory and consulting, and property management services. Further, it offers feasibility study, business plan and strategy, company structure and financing, management consultancy, and financial restructuring services for SME firms; and capital management services. Additionally, the company provides fund management services for foreign investors. The Brooker Group Public Company Limited was incorporated in 1994 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "BROOK.BK": {
        "short_name": "THE BROOKER GROUP PUBLIC COMPAN",
        "long_name": "The Brooker Group Public Company Limited",
        "summary": "The Brooker Group Public Company Limited, together with its subsidiaries, engages in business and financial consulting, and investment activities in Thailand and internationally. The company provides investment banking and financial consulting services, such as mergers and acquisitions, loan refinancing, rehabilitation, and other capital raising on equity and debt securities; planning and negotiations services; and company valuation and advisory services on investments and joint ventures to multinational companies. It also offers capital for growing companies and leveraged buy-outs; and research services, including industrial market research, B2B market survey, customer satisfaction research, industry and trade surveys, market feasibility study, acquisition research, customized market intelligence/in-depth research, and product and service concept/development test. In addition, the company provides real estate consultancy services comprising specialized services in industrial and commercial real estate properties; transaction, advisory, location consulting, asset recovery, and special property services; and disposition and acquisition, advisory and consulting, and property management services. Further, it offers feasibility study, business plan and strategy, company structure and financing, management consultancy, and financial restructuring services for SME firms; and capital management services. Additionally, the company provides fund management services for foreign investors. The Brooker Group Public Company Limited was incorporated in 1994 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "CASA.JK": {
        "short_name": "Capital Financial Indonesia Tbk",
        "long_name": "PT Capital Financial Indonesia Tbk",
        "summary": "PT Capital Financial Indonesia Tbk, together with its subsidiaries, engages in financial services and investment business in Indonesia. It offers management consulting, asset management, life and sharia life insurance, and Fintech peer-to-peer lending services, as well as engages in venture capital activities. The company was founded in 2009 and is based in Jakarta, Indonesia. PT Capital Financial Indonesia Tbk is a subsidiary of PT Capital Strategic Invesco.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "CENTRUM.NS": {
        "short_name": "CENTRUM CAPITAL",
        "long_name": "Centrum Capital Limited",
        "summary": "Centrum Capital Limited, together with its subsidiaries, provides various financial services for institutions and individuals in India. It operates through Institutional Business, Wealth Management & Distribution, Housing Finance Business, and SME / Micro Credit Lending Business segments. The company offers investment banking services, including equity initial public offerings (IPO), follow-on public offerings and rights issues, pre-IPO placements, qualified institutional placements, American depository receipts, global depository receipts, convertible issuances, buybacks and delisting, open offers and takeovers, and valuation advisory services, as well as alternative investment markets; and mergers and acquisitions, private equity, and structured finance advisory services. It also provides services in the areas of working capital, term loans/corporate loans, project finance, and external commercial borrowings/foreign currency loans; and housing finance, SME and MSME finance, and micro finance. In addition, the company offers private debt, public equity, venture capital, and real estate advisory services; money changing, portfolio management, retail broking, and defense and infrastructure advisory services, as well as trades in bonds. Further, it offers wealth management, stock broking, and insurance services. Centrum Capital Limited was incorporated in 1977 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "CREST.NS": {
        "short_name": "CREST VENTURES",
        "long_name": "Crest Ventures Limited",
        "summary": "Crest Ventures Limited operates as a non-banking finance company in India. It operates through three segments: Real Estate, Financial Services, and Investment and Credit. The company develops various real estate projects, such as residential and commercial projects, malls, hotel, and townships. It also provides financial services, including asset management; mutual fund distribution services; and investment management services to family offices and high net worth individuals, as well as deals in wholesale debt markets, foreign exchange markets, interest rate swaps, and currency options. In addition, the company offers destination and event management services, such as tours; meetings, incentives, conferencing, and exhibitions; events; and online services. The company was formerly known as Sharyans Resources Limited and changed its name to Crest Ventures Limited in September 2014. Crest Ventures Limited was incorporated in 1982 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "CRIV3.SA": {
        "short_name": "ALFA FINANC ON",
        "long_name": "Financeira Alfa S.A. - Crédito, Financiamento e Investimentos",
        "summary": "Financeira Alfa S.A. - CrÃ©dito, Financiamento e Investimentos provides credit solutions in Brazil. It offers direct consumer credit, discount on receivables, special financing, personal credit, payroll loans, vehicle financing, aircraft, and boat credit solutions. The company was founded in 1925 and is based in SÃ£o Paulo, Brazil.",
        "currency": "BRL",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "city": "SÃ£o Paulo"
    },
    "CRIV4.SA": {
        "short_name": "ALFA FINANC PN",
        "long_name": "Financeira Alfa S.A. - Crédito, Financiamento e Investimentos",
        "summary": "Financeira Alfa S.A. - CrÃ©dito, Financiamento e Investimentos provides credit solutions in Brazil. It offers direct consumer credit, discount on receivables, special financing, personal credit, payroll loans, vehicle financing, aircraft, and boat credit solutions. The company was founded in 1925 and is based in SÃ£o Paulo, Brazil.",
        "currency": "BRL",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "city": "SÃ£o Paulo"
    },
    "CVW.AX": {
        "short_name": "CLEARVIEW FPO",
        "long_name": "ClearView Wealth Limited",
        "summary": "ClearView Wealth Limited provides life insurance, wealth management, and financial advisory solutions in Australia. It operates through three segments: Life Insurance, Wealth Management, and Financial Advice. The Life Insurance segment provides life insurance products, including term life, permanent disability, trauma and critical illness benefits, child cover, accident covers, income protection, and business expense covers through financial advisers, third parties, and external advisers. The Wealth Management segment offers life investment contracts, including ordinary savings, superannuation, and allocated pension products; superannuation and retirement income wraps, and investor directed portfolio service wraps; and managed investment schemes. The Financial Advice segment provides financial advisory services, which include licensing and dealer services, as well as LaVista licensee solutions that provide outsourced B2B licensee services to other Australian financial services licensees. ClearView Wealth Limited was founded in 1976 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "DEFI.NE": {
        "short_name": "DEFI TECHNOLOGIES INC.",
        "long_name": "DeFi Technologies Inc.",
        "summary": "DeFi Technologies Inc. engages in the building and management of assets in the decentralized finance sector in Canada. It focuses on the enhancement of shareholder value through various investments, including the acquisition of DeFi protocols, equity, debt, or other securities of publicly traded or private companies, or other entities. The company was formerly known as Routemaster Capital Inc. and changed its name to DeFi Technologies Inc. in February 2021. DeFi Technologies Inc. is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "NEO",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "DEFTF": {
        "short_name": "DEFI TECHNOLOGIES INC",
        "long_name": "DeFi Technologies Inc.",
        "summary": "DeFi Technologies Inc. engages in the building and management of assets in the decentralized finance sector in Canada. It focuses on the enhancement of shareholder value through various investments, including the acquisition of DeFi protocols, equity, debt, or other securities of publicly traded or private companies, or other entities. The company was formerly known as Routemaster Capital Inc. and changed its name to DeFi Technologies Inc. in February 2021. DeFi Technologies Inc. is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "ELEKTRA.MX": {
        "short_name": "GRUPO ELEKTRA SAB DE CV",
        "long_name": "Grupo Elektra, S.A.B. de C.V.",
        "summary": "Grupo Elektra, S.A.B. de C.V. operates as a financial services and specialty retailing company in Latin America, as well as a short-term non-bank loan provider in the United States. The company's Retail Business segment engages in the sale of motorcycles, cell phones, small household and major appliances, electronics, furniture, car batteries, computers, mattresses, entertainment systems, fashion goods and accessories, beauty and personal care products, and sporting goods, as well as films, music, and books. It is also involved in the provision of wire transfers, extended guarantees, airtime, mobile virtual network operation, and long distance services, as well as in the e-commerce activities. Its Financial Business segment provides banking and financial products and services comprising consumer credit, personal loans, commercial loans, savings and investment accounts, term deposits, debit cards, credit cards, life and casualty insurance, medical and liability insurance, retirement fund management options, credit information, lease-financing services, group and secured loans, and short-term non-bank loans. The company operates approximately 7,000 points of contact in Mexico, the United States, Guatemala, Honduras, Panama, and Peru. Grupo Elektra, S.A.B. de C.V. was founded in 1950 and is headquartered in Mexico City, Mexico.",
        "currency": "MXN",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Mexico",
        "city": "Mexico City"
    },
    "FNQ.CN": {
        "short_name": "FineqiaIntl",
        "long_name": "Fineqia International Inc.",
        "summary": "Fineqia International Inc., through its subsidiaries, operates a regulated crowdfunding platform that focuses on debt instruments. It provides an online platform and associated services to support security issuances and manage the administration of debt securities. The company was formerly known as NanoStruck Technologies Inc. and changed its name to Fineqia International Inc. in August 2016. Fineqia International Inc. was incorporated in 2006 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "FNQA.F": {
        "short_name": "FINEQIA INTERN. INC. O.N.",
        "long_name": "Fineqia International Inc.",
        "summary": "Fineqia International Inc., through its subsidiaries, operates a regulated crowdfunding platform that focuses on debt instruments. It provides an online platform and associated services to support security issuances and manage the administration of debt securities. The company was formerly known as NanoStruck Technologies Inc. and changed its name to Fineqia International Inc. in August 2016. Fineqia International Inc. was incorporated in 2006 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "FNQQF": {
        "short_name": "FINEQIA INT INC",
        "long_name": "Fineqia International Inc.",
        "summary": "Fineqia International Inc., through its subsidiaries, operates a regulated crowdfunding platform that focuses on debt instruments. It provides an online platform and associated services to support security issuances and manage the administration of debt securities. The company was formerly known as NanoStruck Technologies Inc. and changed its name to Fineqia International Inc. in August 2016. Fineqia International Inc. was incorporated in 2006 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "FOAF.PA": {
        "short_name": "FIN.OUEST AFRICAIN",
        "long_name": "Fin.Ouest Africain",
        "summary": "Fin.Ouest Africain provides various financial services. It offers car, personal, business risk, transportation, and other property and casualty insurance products; and life insurance products for individuals, private and public companies, and organizations. It also invests in bonds and shares in listed and unlisted companies; and provides wealth management services, including building and managing real estate assets. The company was founded in 1951 and is based in Dakar, Senegal.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "Senegal",
        "city": "Dakar"
    },
    "GDG.AX": {
        "short_name": "GEN DEV FPO",
        "long_name": "Generation Development Group Limited",
        "summary": "Generation Development Group Limited manages and markets life insurance and life investment products and services to the retail sector in Australia. It offers investment bond product solutions; and administration services, including unit pricing, fund valuation, investment and fund accounting, fund administration, and business registry. The company was formerly known as Austock Group Limited and changed its name to Generation Development Group Limited in March 2018. Generation Development Group Limited was founded in 1991 and is headquartered in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "IBI.TA": {
        "short_name": "IBI INV HOUSE",
        "long_name": "I.B.I Investment House Ltd.",
        "summary": "I.B.I Investment House Ltd. is a publicly owned holding investment firm with approximately NIS 11 billion ($2.63 billion) in assets under management. The firm provides its services to individuals and institutional clients. Through its subsidiaries, it provides securities trading and brokerage, financial consultancy, and investment management services. The firm manages investment portfolios, mutual fund, underwriting services, provident funds, and investments. It was formerly known as Gachelet Investment Co. I.B.I Investment House Ltd. was founded in 1971 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel-Aviv"
    },
    "INV.AX": {
        "short_name": "INVESTSGRP FPO",
        "long_name": "InvestSMART Group Limited",
        "summary": "InvestSMART Group Limited provides financial services and products under general advice to retail investors in Australia. It primarily offers wealth and funds management, and personal insurance services. The company was formerly known as Australasian Wealth Investments Limited and changed its name to InvestSMART Group Limited in May 2016. InvestSMART Group Limited was founded in 1999 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "IVC.NS": {
        "short_name": "IL & FS INVESTMENT",
        "long_name": "IL&FS Investment Managers Limited",
        "summary": "IL&FS Investment Managers Limited is the private equity, venture capital, and real estate investment arm of Infrastructure Leasing & Financial Services Limited. The firm specializes in seed capital, late venture, growth capital, expansions, middle market, restructuring, stressed assets, recapitalizations, buyouts investments, and real estate investments in high-growth real estate assets including office, residential, retail, integrated townships, special economic zones, hospitality, and mixed-use properties. It also makes debt investments as well as investment banking led private equity transactions focused on opportunities arising from stressed assets. The firm seeks to invest in energy, materials, logistics, agricultural services, auto components, textiles, healthcare, power, waste management, toll roads and cable infrastructure, biotechnology, niche manufacturing, retail, media, consumer services, consumer brands, pharmaceuticals, manufacturing, airport services, highways and rail tracks, marine ports and services, infrastructure and related services, telecom, city gas distribution, shipyards, life sciences, real estate, waste water treatment, information technology, and information technology enabled services companies. It seeks to invest in Middle East, Asian markets with a focus on India, Tamil Nadu, and Delhi; and China. It seeks to invest between $15 million and $100 million in companies with market capitalization of $50 million and $150 million. The firm prefers to make seed capital funding in infrastructure projects in the range of $2 million and $10 million. In the real estate sector, it seeks to invest between $20 million and $50 million. The firm seeks to hold its investments for a period between three years and five years. It seeks to make private equity investments in post revenue companies. The firm prefers to take a seat on the board of directors of its portfolio companies. IL&FS Investment Managers Limited was founded in 1989 and is based in Mumbai, India with additional offices in Bengaluru, India and Mauritius.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "J1EF34.SA": {
        "short_name": "JEFFERIES FIDRN",
        "long_name": "Jefferies Financial Group Inc.",
        "summary": "Jefferies Financial Group Inc. engages in the investment banking and capital markets, asset management, and direct investing businesses in the Americas, Europe, the Middle East, Africa, and Asia. It operates through Investment Banking and Capital Markets, Asset Management, Merchant Banking, and Corporate segments. The company offers financial advisory, equity underwriting, and debt underwriting, as well as corporate lending services; equities research, sales, and trading services; equity finance services comprising financing, securities lending, and other prime brokerage services; and wealth management services to high net worth individuals, their families and businesses, private equity and venture funds, and small institutions. It also provides clients with sales and trading of investment grade corporate bonds, U.S. and European government and agency securities, municipal bonds, mortgage-backed and asset-backed securities, leveraged loans, consumer loans, high yield and distressed securities, emerging markets debt, interest rate, and credit derivative products, as well as foreign exchange trade execution and securitization; and manages, invests in, and provides services to a diverse group of alternative asset management platforms across a spectrum of investment strategies and asset classes. The company was formerly known as Leucadia National Corporation and changed its name to Jefferies Financial Group Inc. in May 2018. Jefferies Financial Group Inc. was founded in 1968 and is headquartered in New York, New York.",
        "currency": "BRL",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "New York"
    },
    "JEF": {
        "short_name": "Jefferies Financial Group Inc.",
        "long_name": "Jefferies Financial Group Inc.",
        "summary": "Jefferies Financial Group Inc. engages in the investment banking and capital markets, asset management, and direct investing businesses in the Americas, Europe, the Middle East, Africa, and Asia. It operates through Investment Banking and Capital Markets, Asset Management, Merchant Banking, and Corporate segments. The company offers financial advisory, equity underwriting, and debt underwriting, as well as corporate lending services; equities research, sales, and trading services; equity finance services comprising financing, securities lending, and other prime brokerage services; and wealth management services to high net worth individuals, their families and businesses, private equity and venture funds, and small institutions. It also provides clients with sales and trading of investment grade corporate bonds, U.S. and European government and agency securities, municipal bonds, mortgage-backed and asset-backed securities, leveraged loans, consumer loans, high yield and distressed securities, emerging markets debt, interest rate, and credit derivative products, as well as foreign exchange trade execution and securitization; and manages, invests in, and provides services to a diverse group of alternative asset management platforms across a spectrum of investment strategies and asset classes. The company was formerly known as Leucadia National Corporation and changed its name to Jefferies Financial Group Inc. in May 2018. Jefferies Financial Group Inc. was founded in 1968 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "KSL.AX": {
        "short_name": "KINA FPO",
        "long_name": "Kina Securities Limited",
        "summary": "Kina Securities Limited, together with its subsidiaries, provides commercial banking, financial, fund administration, investment management, and share brokerage services in Papua New Guinea. The company operates through two segments, Bank and Wealth Management. It also offers savings, cheque and business cheque, cash management, fixed deposit accounts; debit cards; and insurance products, such as business assets and income, and business liability, theft and burglary, and workers compensation insurance. In addition, the company provides personal, home, business, and residential investment property loans; overdrafts; equipment and trade finance; insurance premium funding; bank guarantees products. Further, it offers fund management and administration; treasury management; stockbroking; and money market services. Additionally, the company provides trustee services, including retail and wholesale trusts, debt securities, custodial, and nominee services, as well as internet and mobile banking services. Kina Securities Limited was founded in 1985 and is headquartered in Port Moresby, Papua New Guinea.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Papua New Guinea",
        "city": "Port Moresby"
    },
    "LEON.SW": {
        "short_name": "LEONTEQ N",
        "long_name": "Leonteq AG",
        "summary": "Leonteq AG provides structured investment products and long-term savings and retirement solutions in Switzerland and internationally. It operates through Investment Solutions and Insurance & Wealth Planning Solutions segments. The company manufactures and distributes structured investment products. It also offers savings, investment, and drawdown products; and digital platform that enables unit-linked retail products with financial guarantees, as well as hedging for structured products. The company offers its services to platform partners under the terms of cooperation agreements, as well as distributes its products to retail investors through institutional and financial intermediaries. The company was formerly known as EFG Financial Products Holding AG and changed its name to Leonteq AG in June 2013. Leonteq AG was incorporated in 2007 and is headquartered in Zurich, Switzerland.",
        "currency": "CHF",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Zurich"
    },
    "LN3.F": {
        "short_name": "JEFFERIES FINL GRP  DL 1",
        "long_name": "Jefferies Financial Group Inc.",
        "summary": "Jefferies Financial Group Inc. engages in the investment banking and capital markets, asset management, and direct investing businesses in the Americas, Europe, the Middle East, Africa, and Asia. It operates through Investment Banking and Capital Markets, Asset Management, Merchant Banking, and Corporate segments. The company offers financial advisory, equity underwriting, and debt underwriting, as well as corporate lending services; equities research, sales, and trading services; equity finance services comprising financing, securities lending, and other prime brokerage services; and wealth management services to high net worth individuals, their families and businesses, private equity and venture funds, and small institutions. It also provides clients with sales and trading of investment grade corporate bonds, U.S. and European government and agency securities, municipal bonds, mortgage-backed and asset-backed securities, leveraged loans, consumer loans, high yield and distressed securities, emerging markets debt, interest rate, and credit derivative products, as well as foreign exchange trade execution and securitization; and manages, invests in, and provides services to a diverse group of alternative asset management platforms across a spectrum of investment strategies and asset classes. The company was formerly known as Leucadia National Corporation and changed its name to Jefferies Financial Group Inc. in May 2018. Jefferies Financial Group Inc. was founded in 1968 and is headquartered in New York, New York.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "New York"
    },
    "MGOM": {
        "short_name": "MIGOM GLOBAL CORP",
        "long_name": "Migom Global Corp.",
        "summary": "Migom Global Corp. focuses on building synergistic ventures in international banking, securities brokerage, electronic money distribution, digital assets origination and market making sectors. Previously, it provided video editing services to professional video production companies and private end consumers. The company was formerly known as Alfacourse Inc. and changed its name to Migom Global Corp. in November 2019. Migom Global Corp. was founded in 2016 and is based in New York, New York. Migom Global Corp. is a subsidiary of Heritage Equity Fund LP.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "NFPH.F": {
        "short_name": "THANACHART CAP.-FGN-BA 10",
        "long_name": "Thanachart Capital Public Company Limited",
        "summary": "Thanachart Capital Public Company Limited, an investment holding company, provides various financial services in Thailand. It operates through six segments: Company, Securities Business, Life Insurance Business, Non-Life Insurance Business, Asset Management Business, and Hire Purchase and Leasing Business. The company offers commercial banking and asset management services; securities brokerage and analysis, proprietary trading, borrowing and lending, and investment and financial advisory services, as well as operates as an underwriter and securities registrar. It also provides non-life insurance products in the areas of fire, automobile, marine and transportation, and miscellaneous; life and health insurance products to individuals, institution clients, and general organizations; hire purchase services for trucks, pick-up cars, taxies, and big bikes; and lending services for cranes, fork lifts, motorcycles, excavators, etc. The company was formerly known as National Finance Public Company Limited and changed its name to Thanachart Capital Public Company Limited in April 2006. Thanachart Capital Public Company Limited was founded in 1959 and is based in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "NVAK.F": {
        "short_name": "THANACHART CAP.-NVDR-BA10",
        "long_name": "Thanachart Capital Public Company Limited",
        "summary": "Thanachart Capital Public Company Limited, an investment holding company, provides various financial services in Thailand. It operates through six segments: Company, Securities Business, Life Insurance Business, Non-Life Insurance Business, Asset Management Business, and Hire Purchase and Leasing Business. The company offers commercial banking and asset management services; securities brokerage and analysis, proprietary trading, borrowing and lending, and investment and financial advisory services, as well as operates as an underwriter and securities registrar. It also provides non-life insurance products in the areas of fire, automobile, marine and transportation, and miscellaneous; life and health insurance products to individuals, institution clients, and general organizations; hire purchase services for trucks, pick-up cars, taxies, and big bikes; and lending services for cranes, fork lifts, motorcycles, excavators, etc. The company was formerly known as National Finance Public Company Limited and changed its name to Thanachart Capital Public Company Limited in April 2006. Thanachart Capital Public Company Limited was founded in 1959 and is based in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "P1B.F": {
        "short_name": "PSG GRP LTD.  RC-,01",
        "long_name": "PSG Group Ltd",
        "summary": "PSG Group Ltd, an investment holding company, engages in the banking, education, financial services, and food and related businesses in South Africa and internationally. It operates through seven segments: Capitec, PSG Konsult, PSG Alpha, Zeder, Curro, Dipeo, and PSG Corporate. The company provides retail and business banking solutions; and funeral insurance covers; wealth and asset management, financial planning, insurance, stockbroking and portfolio management, and estate and trust advisory services; and investment management and treasury services. It also operates private schools; and invests in selected growth sectors. The company was formerly known as PAG Ltd. PSG Group Ltd was founded in 1995 and is based in Stellenbosch, South Africa.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "city": "Stellenbosch"
    },
    "PPE.JO": {
        "short_name": "Purple Group Ltd",
        "long_name": "Purple Group Limited",
        "summary": "Purple Group Limited, a financial services company, through its subsidiaries, engages in trading, investing, and asset management businesses in South Africa. It operates through GT247.com and Emperor Asset Management; and EasyEquities segments. The company operates EasyEquities, a web-based investment platform; GT247.com, a trading platform that provides a range of tradable instruments, such as 153 JSE equity contracts for differences, 5 commodities, 5 crypto currencies, 135 currency pairs, and 12 major indices, as well as private broking and do it yourself trading services; and EasyProperties, an online property investment platform. It also offers managed portfolios on the EasyEquities platform; and secures institutional asset management and consults mandates. The company was formerly known as Purple Capital Limited and changed its name to Purple Group Limited in December 2013. Purple Group Limited was incorporated in 1998 and is based in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "city": "Johannesburg"
    },
    "RELCAPITAL.NS": {
        "short_name": "RELIANCE CAPITAL",
        "long_name": "Reliance Capital Limited",
        "summary": "Reliance Capital Limited, a non-banking financial company, primarily engages in lending and investing activities in India. It operates through Finance & Investment, General Insurance, Life Insurance, Commercial Finance, Home Finance, and Others segments. The company offers life, health, and general insurance products; brokerage and distribution services, including equities, commodities and derivatives, wealth management services, portfolio management services, and financial products; and commercial and home finance services, such affordable housing, mortgages, loans against property, SME loans, loans for vehicles, loans for construction equipment, business loans, infrastructure financing, and retail finance. It also provides asset reconstruction, and proprietary investments services, as well as other financial and allied services. The company was formerly known as Reliance Capital & Finance Trust Limited and changed its name to Reliance Capital Limited in January 1995. Reliance Capital Limited was founded in 1986 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "RILY": {
        "short_name": "B. Riley Financial, Inc.",
        "long_name": "B. Riley Financial, Inc.",
        "summary": "B. Riley Financial, Inc., through its subsidiaries, provides collaborative financial services and solutions in North America, Australia, and Europe. The Capital Markets segments offers range of investment banking, corporate finance, consulting, financial advisory, research, securities lending, wealth management, and sales and trading services to corporate, institutional, and high net worth clients. This segment also provides merger and acquisitions, restructuring advisory, initial and secondary public offerings, and institutional private placements services; asset management services; manages various private and public funds for institutional and individual investors; and trades in equity securities. The Auction and Liquidation Segment offers retail store liquidation, and wholesale and industrial assets disposition services. The Financial Consulting segment provides bankruptcy, financial advisory, forensic accounting, litigation support, real estate consulting, and valuation and appraisal services. The Principal Investments - United Online and magicJack segment provides consumer subscription services consisting of Internet access services and devices under the NetZero and Juno brands, as well as voice over IP cloud-based technology and communication services. The Brands segments provides licensing of a brand investment portfolio, including Catherine Malandrino, English Laundry, Joan Vass, Kensie Girl, Limited Too, and Nanette Lepore. In addition, it offers advisory services to private funds, and institutional and high net worth investors; brokerage services; senior secured and second lien secured loans to middle market public and the private U.S. companies; and consulting services to shareholders, creditors, and companies. The company was formerly known as Great American Group, Inc. and changed its name to B. Riley Financial, Inc. in November 2014. B. Riley Financial, Inc. was founded in 1973 and is headquartered in Los Angeles, California.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Los Angeles"
    },
    "RILYL": {
        "short_name": "B. Riley Financial, Inc. - Depo",
        "long_name": "B. Riley Financial, Inc.",
        "summary": "B. Riley Financial, Inc., through its subsidiaries, provides collaborative financial services and solutions in North America, Australia, and Europe. The Capital Markets segments offers range of investment banking, corporate finance, consulting, financial advisory, research, securities lending, wealth management, and sales and trading services to corporate, institutional, and high net worth clients. This segment also provides merger and acquisitions, restructuring advisory, initial and secondary public offerings, and institutional private placements services; asset management services; manages various private and public funds for institutional and individual investors; and trades in equity securities. The Auction and Liquidation Segment offers retail store liquidation, and wholesale and industrial assets disposition services. The Financial Consulting segment provides bankruptcy, financial advisory, forensic accounting, litigation support, real estate consulting, and valuation and appraisal services. The Principal Investments - United Online and magicJack segment provides consumer subscription services consisting of Internet access services and devices under the NetZero and Juno brands, as well as voice over IP cloud-based technology and communication services. The Brands segments provides licensing of a brand investment portfolio, including Catherine Malandrino, English Laundry, Joan Vass, Kensie Girl, Limited Too, and Nanette Lepore. In addition, it offers advisory services to private funds, and institutional and high net worth investors; brokerage services; senior secured and second lien secured loans to middle market public and the private U.S. companies; and consulting services to shareholders, creditors, and companies. The company was formerly known as Great American Group, Inc. and changed its name to B. Riley Financial, Inc. in November 2014. B. Riley Financial, Inc. was founded in 1973 and is headquartered in Los Angeles, California.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "city": "Los Angeles"
    },
    "RILYP": {
        "short_name": "B. Riley Financial, Inc. - Depo",
        "long_name": "B. Riley Financial, Inc.",
        "summary": "B. Riley Financial, Inc., through its subsidiaries, provides collaborative financial services and solutions in North America, Australia, and Europe. The Capital Markets segments offers range of investment banking, corporate finance, consulting, financial advisory, research, securities lending, wealth management, and sales and trading services to corporate, institutional, and high net worth clients. This segment also provides merger and acquisitions, restructuring advisory, initial and secondary public offerings, and institutional private placements services; asset management services; manages various private and public funds for institutional and individual investors; and trades in equity securities. The Auction and Liquidation Segment offers retail store liquidation, and wholesale and industrial assets disposition services. The Financial Consulting segment provides bankruptcy, financial advisory, forensic accounting, litigation support, real estate consulting, and valuation and appraisal services. The Principal Investments - United Online and magicJack segment provides consumer subscription services consisting of Internet access services and devices under the NetZero and Juno brands, as well as voice over IP cloud-based technology and communication services. The Brands segments provides licensing of a brand investment portfolio, including Catherine Malandrino, English Laundry, Joan Vass, Kensie Girl, Limited Too, and Nanette Lepore. In addition, it offers advisory services to private funds, and institutional and high net worth investors; brokerage services; senior secured and second lien secured loans to middle market public and the private U.S. companies; and consulting services to shareholders, creditors, and companies. The company was formerly known as Great American Group, Inc. and changed its name to B. Riley Financial, Inc. in November 2014. B. Riley Financial, Inc. was founded in 1973 and is headquartered in Los Angeles, California.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Los Angeles"
    },
    "RMJ.F": {
        "short_name": "DEFI TECHNOLOGIES INC.",
        "long_name": "DeFi Technologies Inc.",
        "summary": "DeFi Technologies Inc. engages in the building and management of assets in the decentralized finance sector in Canada. It focuses on the enhancement of shareholder value through various investments, including the acquisition of DeFi protocols, equity, debt, or other securities of publicly traded or private companies, or other entities. The company was formerly known as Routemaster Capital Inc. and changed its name to DeFi Technologies Inc. in February 2021. DeFi Technologies Inc. is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "ROMSB.OL": {
        "short_name": "ROMSDAL SPAREBANK",
        "long_name": "Romsdal Sparebank",
        "summary": "Romsdal Sparebank operates as a savings bank that provides various financial products and services to retail and corporate customers primarily in Romsdal and southern parts of NordmÃ¸re. Its personal banking products and services include BSU and other savings accounts, fund savings plans, and retirement savings plans; bank cards and payment solutions; and mortgages, car and other vehicle loans, and small loans and refinancing. The company's business banking products and services comprise corporate accounts; financing solutions, such as bank guarantees, construction loans, overdrafts, leasing, and corporate loans; and savings and pension plans. It also offers debit and credit cards, payment solutions, Internet and mobile banking services, and insurance agency services. Romsdal Sparebank was formerly known as Bud FrÃ¦na og Hustad Sparebank and changed its name to Romsdal Sparebank in January 2018. The company was incorporated in 1971 and is based in ElnesvÃ¥gen, Norway with branch offices in Bud, EidsvÃ¥g, Farstad, and Molde, Norway.",
        "currency": "NOK",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Norway",
        "city": "ElnesvÃ¥gen"
    },
    "SEQ.AX": {
        "short_name": "SEQUOIA FPO",
        "long_name": "Sequoia Financial Group Limited",
        "summary": "Sequoia Financial Group Limited, an integrated financial services company, provides financial products and services to retail and wholesale clients, and third party professional service firms primarily in Australia. The company operates through Sequoia Wealth Group, Sequoia Professional Services Group, Sequoia Equity Markets Group, and Sequoia Direct Investment Group segments. It offers products and services, such as adviser market licensing and support, merger and acquisitions, and corporate advisory services to financial planners, wealth managers, equity advisers, and corporate advisory business units. The company also provides self-managed super fund (SMSF) solutions, general insurance broking, and legal document establishment services to financial planners, stock brokers, mortgage brokers, and accountants. In addition, it offers stockbroking and specialized investment solutions to third party institutional and adviser networks; general advisory services for investors on portfolio management and SMSF management share trading, superannuation, products, and insurance; and market data, robo advice, and trading tools through independent news services specializing in finance and business news updates, events, and investor communication for ASX-listed companies. The company was formerly known as MDS Financial Group Limited and changed its name to Sequoia Financial Group Limited in November 2015. Sequoia Financial Group Limited is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "SKT.F": {
        "short_name": "STOREBRAND ASA  NK 5",
        "long_name": "Storebrand ASA",
        "summary": "Storebrand ASA, through its subsidiaries, primarily provides insurance products and services in Norway and Sweden. The company operates through four segments: Savings, Insurance, Guaranteed Pension, and Other. The Savings segment offers retirement savings, defined contribution pensions, asset management, and retail banking products. The Insurance segment provides health insurance, property and casualty insurance, personal risk products, and employee-related and pension-related insurance products. The Guaranteed Pension segment offers long-term pension savings products, such as defined benefit pensions, paid-up policies, and individual capital and pension insurance products. The Other segment provides life insurance products. It also offers securities, and banking and investment services. The company serves private individuals, corporate and retail markets, companies, municipalities, and public sector. Storebrand ASA was founded in 1767 and is headquartered in Lysaker, Norway.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Norway",
        "city": "Lysaker"
    },
    "SMMA.JK": {
        "short_name": "Sinarmas Multiartha Tbk.",
        "long_name": "PT Sinar Mas Multiartha Tbk",
        "summary": "PT Sinar Mas Multiartha Tbk provides various financial services to individual and corporate clients in Indonesia. The company's services include banking, insurance, financing, capital markets, asset management, share administration, security, and information technology. It offers savings accounts; call, time, and demand deposits; foreign exchange; mutual funds; bancassurance; corporate and personal credit cards; bank guarantee; loan products, including micro, working capital, investment, non-collateral, agricultural, and multi-purpose loan; supply chain financing; consumer financing; import and export bill; telegraphic transfer; and mobile and internet banking, as well as automatic teller machine, safe deposit box, payroll, and money transfer services. The company also provides life and general insurance, insurance agency, securities and share registry, asset management, commodity trading, factoring, leasing, investment financing, and fund management services. In addition, it is involved in trading and service, auction house, property, clinic, and workshop activities. The company was formerly known as PT Internas Artha Finance Company and changed its name to PT Sinar Mas Multiartha Tbk in February 1995. The company was founded in 1982 and is headquartered in Jakarta, Indonesia. PT Sinar Mas Multiartha Tbk is a subsidiary of PT Sinar Mas Cakrawala.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "SRAC.TA": {
        "short_name": "S.R ACCORD LTD",
        "long_name": "S.R. Accord Ltd.",
        "summary": "S.R. Accord Ltd. provides credit and non-bank financing services to small and medium-sized businesses in Israel. The company offers direct financing in the forms of loans; and financing against discounting checks and bills, as well as repayments against the provision of adequate collateral. The company was formerly known as Shrem Fudim Group Ltd. and changed its name to S.R. Accord Ltd. in December 2010. S.R. Accord Ltd. was founded in 1991 and is headquartered in Ramla, Israel.",
        "currency": "ILA",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Ramla"
    },
    "SREDF": {
        "short_name": "STOREBRAND ASA",
        "long_name": "Storebrand ASA",
        "summary": "Storebrand ASA, through its subsidiaries, primarily provides insurance products and services in Norway and Sweden. The company operates through four segments: Savings, Insurance, Guaranteed Pension, and Other. The Savings segment offers retirement savings, defined contribution pensions, asset management, and retail banking products. The Insurance segment provides health insurance, property and casualty insurance, personal risk products, and employee-related and pension-related insurance products. The Guaranteed Pension segment offers long-term pension savings products, such as defined benefit pensions, paid-up policies, and individual capital and pension insurance products. The Other segment provides life insurance products. It also offers securities, and banking and investment services. The company serves private individuals, corporate and retail markets, companies, municipalities, and public sector. Storebrand ASA was founded in 1767 and is headquartered in Lysaker, Norway.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Norway",
        "city": "Lysaker"
    },
    "STB.OL": {
        "short_name": "STOREBRAND ASA",
        "long_name": "Storebrand ASA",
        "summary": "Storebrand ASA, through its subsidiaries, primarily provides insurance products and services in Norway and Sweden. The company operates through four segments: Savings, Insurance, Guaranteed Pension, and Other. The Savings segment offers retirement savings, defined contribution pensions, asset management, and retail banking products. The Insurance segment provides health insurance, property and casualty insurance, personal risk products, and employee-related and pension-related insurance products. The Guaranteed Pension segment offers long-term pension savings products, such as defined benefit pensions, paid-up policies, and individual capital and pension insurance products. The Other segment provides life insurance products. It also offers securities, and banking and investment services. The company serves private individuals, corporate and retail markets, companies, municipalities, and public sector. Storebrand ASA was founded in 1767 and is headquartered in Lysaker, Norway.",
        "currency": "NOK",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Norway",
        "city": "Lysaker"
    },
    "STJ.L": {
        "short_name": "ST. JAMES'S PLACE PLC ORD 15P",
        "long_name": "St. James's Place plc",
        "summary": "St. James's Place plc is a publicly owned investment manager. The firm launches and manages equity, fixed income, and balanced mutual funds for its clients. It invests in public equity and fixed income market across the globe. The firm was formerly known as St. James's Place Capital plc. St. James's Place plc was founded in 1991 and is based in Cirencester, United Kingdom.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Cirencester"
    },
    "STJPF": {
        "short_name": "ST JAMES'S PLACE",
        "long_name": "St. James's Place plc",
        "summary": "St. James's Place plc is a publicly owned investment manager. The firm launches and manages equity, fixed income, and balanced mutual funds for its clients. It invests in public equity and fixed income market across the globe. The firm was formerly known as St. James's Place Capital plc. St. James's Place plc was founded in 1991 and is based in Cirencester, United Kingdom.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Cirencester"
    },
    "SYG.JO": {
        "short_name": "Sygnia Limited",
        "long_name": "Sygnia Limited",
        "summary": "Sygnia Limited provides investment management and administration services to institutional and retail clients in South Africa. The company offers multi-manager investment, index-tracking investment, and umbrella retirement funds; and transition management, and stockbroking and securities lending services, as well as manages and administers custom-designed investment strategies. It also provides investment administration services, such as multi-tier unitization, monthly administration reporting, consolidated financial accounting information, monitoring of compliance with mandates and legislation, regulatory reporting, performance and risk analysis reporting, and asset liability modelling. In addition, the company offers liability administration and consulting, digital financial advisory, and treasury services; and a range of savings products, including retirement annuities, living annuities, preservation pension and provident funds, tax-free savings accounts, and direct unit trust investments. Sygnia Limited was incorporated in 2007 and is headquartered in Cape Town, South Africa.",
        "currency": "ZAc",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "city": "Cape Town"
    },
    "TCAP-R.BK": {
        "short_name": "THANACHART CAPITAL PUBLIC COMPA",
        "long_name": "Thanachart Capital Public Company Limited",
        "summary": "Thanachart Capital Public Company Limited, an investment holding company, provides various financial services in Thailand. It operates through six segments: Company, Securities Business, Life Insurance Business, Non-Life Insurance Business, Asset Management Business, and Hire Purchase and Leasing Business. The company offers commercial banking and asset management services; securities brokerage and analysis, proprietary trading, borrowing and lending, and investment and financial advisory services, as well as operates as an underwriter and securities registrar. It also provides non-life insurance products in the areas of fire, automobile, marine and transportation, and miscellaneous; life and health insurance products to individuals, institution clients, and general organizations; hire purchase services for trucks, pick-up cars, taxies, and big bikes; and lending services for cranes, fork lifts, motorcycles, excavators, etc. The company was formerly known as National Finance Public Company Limited and changed its name to Thanachart Capital Public Company Limited in April 2006. Thanachart Capital Public Company Limited was founded in 1959 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "TCAP.BK": {
        "short_name": "THANACHART CAPITAL PUBLIC COMPA",
        "long_name": "Thanachart Capital Public Company Limited",
        "summary": "Thanachart Capital Public Company Limited, an investment holding company, provides various financial services in Thailand. It operates through six segments: Company, Securities Business, Life Insurance Business, Non-Life Insurance Business, Asset Management Business, and Hire Purchase and Leasing Business. The company offers commercial banking and asset management services; securities brokerage and analysis, proprietary trading, borrowing and lending, and investment and financial advisory services, as well as operates as an underwriter and securities registrar. It also provides non-life insurance products in the areas of fire, automobile, marine and transportation, and miscellaneous; life and health insurance products to individuals, institution clients, and general organizations; hire purchase services for trucks, pick-up cars, taxies, and big bikes; and lending services for cranes, fork lifts, motorcycles, excavators, etc. The company was formerly known as National Finance Public Company Limited and changed its name to Thanachart Capital Public Company Limited in April 2006. Thanachart Capital Public Company Limited was founded in 1959 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "TH.BK": {
        "short_name": "TONG HUA HOLDING PUBLIC COMPANY",
        "long_name": "Tong Hua Holding Public Company Limited",
        "summary": "Tong Hua Holding Public Company Limited, through its subsidiaries, produces and distributes newspapers in Thailand. The company also provides publishing and printing services; and short-term funds in the form of factoring, loans, and leasing services. In addition, it offers space rental for products and services business; and engages in the investment business. The company was formerly known as Tong Hua Communications Public Company Limited and changed its name to Tong Hua Holding Public Company Limited in May 2016. Tong Hua Holding Public Company Limited was founded in 1960 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "THNUY": {
        "short_name": "THANACHART CAPITAL PCL",
        "long_name": "Thanachart Capital Public Company Limited",
        "summary": "Thanachart Capital Public Company Limited, an investment holding company, provides various financial services in Thailand. It operates through six segments: Company, Securities Business, Life Insurance Business, Non-Life Insurance Business, Asset Management Business, and Hire Purchase and Leasing Business. The company offers commercial banking and asset management services; securities brokerage and analysis, proprietary trading, borrowing and lending, and investment and financial advisory services, as well as operates as an underwriter and securities registrar. It also provides non-life insurance products in the areas of fire, automobile, marine and transportation, and miscellaneous; life and health insurance products to individuals, institution clients, and general organizations; hire purchase services for trucks, pick-up cars, taxies, and big bikes; and lending services for cranes, fork lifts, motorcycles, excavators, etc. The company was formerly known as National Finance Public Company Limited and changed its name to Thanachart Capital Public Company Limited in April 2006. Thanachart Capital Public Company Limited was founded in 1959 and is based in Bangkok, Thailand.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "V0Y.F": {
        "short_name": "VOYA FINANCIAL INC.DL-,01",
        "long_name": "Voya Financial, Inc.",
        "summary": "Voya Financial, Inc. operates as a retirement, investment, and employee benefits company in the United States. The company's Retirement segment offers tax-deferred employer-sponsored retirement savings plans and administrative services; and individual retirement accounts, and other retail financial products and financial services, as well as financial planning and advisory services. This segment serves corporate, education, healthcare, and other non-profit and government entities, as well as institutional and individual customers. Its Investment Management segment provides fixed income, equity, multi-asset, and alternative products and solutions to individual investors and institutional clients through its direct sales force, consultant channel, banks, broker-dealers, and independent financial advisers. The company's Employee Benefits segment offers stop loss, group life, voluntary employee-paid, and disability products through consultants, brokers, third-party administrators, enrollment firms, and technology partners to mid-sized and large businesses. The company was formerly known as ING U.S., Inc. and changed its name to Voya Financial, Inc. in April 2014. Voya Financial, Inc. was incorporated in 1999 and is based in New York, New York.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "New York"
    },
    "VOYA-PB": {
        "short_name": "Voya Financial, Inc. Depositary",
        "long_name": "Voya Financial, Inc.",
        "summary": "Voya Financial, Inc. operates as a retirement, investment, and employee benefits company in the United States. The company's Retirement segment offers tax-deferred employer-sponsored retirement savings plans and administrative services; and individual retirement accounts, and other retail financial products and financial services, as well as financial planning and advisory services. This segment serves corporate, education, healthcare, and other non-profit and government entities, as well as institutional and individual customers. Its Investment Management segment provides fixed income, equity, multi-asset, and alternative products and solutions to individual investors and institutional clients through its direct sales force, consultant channel, banks, broker-dealers, and independent financial advisers. The company's Employee Benefits segment offers stop loss, group life, voluntary employee-paid, and disability products through consultants, brokers, third-party administrators, enrollment firms, and technology partners to mid-sized and large businesses. The company was formerly known as ING U.S., Inc. and changed its name to Voya Financial, Inc. in April 2014. Voya Financial, Inc. was incorporated in 1999 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "VOYA": {
        "short_name": "Voya Financial, Inc.",
        "long_name": "Voya Financial, Inc.",
        "summary": "Voya Financial, Inc. operates as a retirement, investment, and employee benefits company in the United States. The company's Retirement segment offers tax-deferred employer-sponsored retirement savings plans and administrative services; and individual retirement accounts, and other retail financial products and financial services, as well as financial planning and advisory services. This segment serves corporate, education, healthcare, and other non-profit and government entities, as well as institutional and individual customers. Its Investment Management segment provides fixed income, equity, multi-asset, and alternative products and solutions to individual investors and institutional clients through its direct sales force, consultant channel, banks, broker-dealers, and independent financial advisers. The company's Employee Benefits segment offers stop loss, group life, voluntary employee-paid, and disability products through consultants, brokers, third-party administrators, enrollment firms, and technology partners to mid-sized and large businesses. The company was formerly known as ING U.S., Inc. and changed its name to Voya Financial, Inc. in April 2014. Voya Financial, Inc. was incorporated in 1999 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "XEKT.MC": {
        "short_name": "GRUPO ELEKTRA, S.A. DE CV, ORDI",
        "long_name": "Grupo Elektra, S.A.B. de C.V.",
        "summary": "Grupo Elektra, S.A.B. de C.V. operates as a financial services and specialty retailing company in Latin America, as well as a short-term non-bank loan provider in the United States. The company's Retail Business segment engages in the sale of motorcycles, cell phones, small household and major appliances, electronics, furniture, car batteries, computers, mattresses, entertainment systems, fashion goods and accessories, beauty and personal care products, and sporting goods, as well as films, music, and books. It is also involved in the provision of wire transfers, extended guarantees, airtime, mobile virtual network operation, and long distance services, as well as in the e-commerce activities. Its Financial Business segment provides banking and financial products and services comprising consumer credit, personal loans, commercial loans, savings and investment accounts, term deposits, debit cards, credit cards, life and casualty insurance, medical and liability insurance, retirement fund management options, credit information, lease-financing services, group and secured loans, and short-term non-bank loans. The company operates approximately 7,000 points of contact in Mexico, the United States, Guatemala, Honduras, Panama, and Peru. Grupo Elektra, S.A.B. de C.V. was founded in 1950 and is headquartered in Mexico City, Mexico.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "MCE",
        "market": "es_market",
        "country": "Mexico",
        "city": "Mexico City"
    },
    "YBR.AX": {
        "short_name": "YELLOWBRIC FPO",
        "long_name": "Yellow Brick Road Holdings Limited",
        "summary": "Yellow Brick Road Holdings Limited provides lending services in Australia. It offers mortgage broking, aggregation, and management services; investment and wealth management services; and general insurance services. The company was formerly known as ITS Capital Investments Limited and changed its name to Yellow Brick Road Holdings Limited in May 2011. Yellow Brick Road Holdings Limited was founded in 2007 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "YBRHF": {
        "short_name": "YELLOW BRICK ROAD HOLDINGS LIMI",
        "long_name": "Yellow Brick Road Holdings Limited",
        "summary": "Yellow Brick Road Holdings Limited provides lending services in Australia. It offers mortgage broking, aggregation, and management services; investment and wealth management services; and general insurance services. The company was formerly known as ITS Capital Investments Limited and changed its name to Yellow Brick Road Holdings Limited in May 2011. Yellow Brick Road Holdings Limited was founded in 2007 and is based in Sydney, Australia.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "YUIA.F": {
        "short_name": "PLANETREE INTL.DEV.HD-,10",
        "long_name": "Planetree International Development Limited",
        "summary": "Planetree International Development Limited, an investment holding company, provides various financial services in Hong Kong. It operates through Financial Services, Credit and Lending Services, Other Financial Services, Property Investment and Leasing, and Tactical and Strategic Investment segments. The Financial Services segment deals in securities and futures contracts; and offers corporate finance and asset management advisory, and margin financing services. The Credit and Lending Services segment provides money lending services. The Other Financial Services segment offers corporate advisory related services. The Property Investment and Leasing segment engages in properties leasing activities. The Tactical and Strategic Investment segment trades in and holds debt and equity securities. It also provides securities brokerage and investment services. The company was formerly known as Yugang International Limited and changed its name to Planetree International Development Limited in July 2019. Planetree International Development Limited was incorporated in 1993 and is headquartered in North Point, Hong Kong.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "North Point"
    }
}