{
    "0YL.F": {
        "short_name": "ELSE NUTRITION HLDG",
        "long_name": "Else Nutrition Holdings Inc.",
        "summary": "Else Nutrition Holdings Inc. focuses on the research, development, manufacturing, marketing, and sale of plant-based food and nutrition products to infant, toddler, children, and adult markets. The company offers baby snacks products; baby feeding accessories, such as feeding bottles and disposable sterile nipples (teats); baby formulas; and toddlers/kids nutritional drinks. The company offers its products under the HEART brand. Else Nutrition Holdings Inc. is headquartered in Tel Aviv-Yafo, Israel.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "ALBA.TA": {
        "short_name": "ALBAAD MASSUOT YIT",
        "long_name": "Albaad Massuot Yitzhak Ltd",
        "summary": "Albaad Massuot Yitzhak Ltd produces and sells wipes worldwide. It offers cotton soft wipes; cosmetic products, such as body, and facial and feet care wipes; feminine hygiene products comprising tampons and sanitary products, as well as baby, mom, toddler, and home care wipes; and adult bed and bath wipes. The company also provides personal care wipes consisting of intimate care wipes; para-pharma wipes; professional wipes, such as para-medical, veterinary cow and pet, automotive, and restaurant wipes, as well as sachets; and flushable moist toilet papers. In addition, it offers contract, private label, and institutional manufacturing services. The company was founded in 1985 and is based in Massuot Yitzhak, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Massuot Yitzhak"
    },
    "ANGL.TA": {
        "short_name": "SALOMON A.ANGEL",
        "long_name": "Salomon A. Angel Ltd.",
        "summary": "Salomon A. Angel Ltd. owns and operates bakeries in Israel. The company produces and markets sliced breads, light breads, wholemeal bread, rolls, challahs, pita bread, and others. It also exports its products to the United States and various European countries. It serves fast food chains. Salomon A. Angel Ltd. was founded in 1927 and is based in Jerusalem, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Jerusalem"
    },
    "ARDM.TA": {
        "short_name": "AERODROME GRP LTD",
        "long_name": "Aerodrome Group Ltd",
        "summary": "Aerodrome Group Ltd provides unmanned aerial systems for security and agriculture. Its multispectral sensor technologies are designed to gather information from agricultural fields, detect anomalies, and optimize farms' work plans. The company is headquartered in Rosh Haayin, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Rosh Haayin"
    },
    "BABY.V": {
        "short_name": "ELSE NUTRITION HOLDINGS INC",
        "long_name": "Else Nutrition Holdings Inc.",
        "summary": "Else Nutrition Holdings Inc. focuses on the research, development, manufacturing, marketing, and sale of plant-based food and nutrition products to infant, toddler, children, and adult markets. The company offers baby snacks products; baby feeding accessories, such as feeding bottles and disposable sterile nipples (teats); baby formulas; and toddlers/kids nutritional drinks. The company offers its products under the HEART brand. Else Nutrition Holdings Inc. is headquartered in Tel Aviv-Yafo, Israel.",
        "currency": "CAD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "BABYF": {
        "short_name": "ELSE NUTRITION HOLDINGS INC",
        "long_name": "Else Nutrition Holdings Inc.",
        "summary": "Else Nutrition Holdings Inc. focuses on the research, development, manufacturing, marketing, and sale of plant-based food and nutrition products to infant, toddler, children, and adult markets. The company offers baby snacks products; baby feeding accessories, such as feeding bottles and disposable sterile nipples (teats); baby formulas; and toddlers/kids nutritional drinks. The company offers its products under the HEART brand. Else Nutrition Holdings Inc. is headquartered in Tel Aviv-Yafo, Israel.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "CLBV.TA": {
        "short_name": "CLAL INDUSTRI.&.B",
        "long_name": "Clal Industries And Beverages Ltd",
        "summary": "Clal Industries And Beverages Ltd manufactures and markets soft drinks and water. The company was incorporated in 2018 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Beverages—Non-Alcoholic",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "CRMT.TA": {
        "short_name": "CARMIT CANDY IND",
        "long_name": "Carmit Candy Industries Ltd.",
        "summary": "Carmit Candy Industries Ltd. manufactures and supplies gluten free foods and confectionery products for food companies and retailers worldwide. It offers gluten free candies and snacks, including clusters and wafers; dairy free and vegan chocolate bars, chocolate coins, and wafer fingers; and no added sugar wafers, clusters, and chocolate bars. The company was founded in 1973 and is based in Rishon LeZion, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Rishon LeZion"
    },
    "FRSM.TA": {
        "short_name": "FRESHMARKET LTD",
        "long_name": "Freshmarket Ltd.",
        "summary": "Freshmarket Ltd. operates a chain of supermarkets in Israel. It operates 31 supermarket branches. The company was founded in 2002 and is based in Herzliya, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Herzliya"
    },
    "GSFI.TA": {
        "short_name": "GAN SHMUEL FOODS",
        "long_name": "Gan Shmuel Foods Ltd.",
        "summary": "Gan Shmuel Foods Ltd. produces and sells citrus fruits for the beverage and food industry in Israel. It also offers fruit and vegetable solutions. The company was formerly known as Gan Shmuel Foods Industries (1993) Ltd. and changed its name to Gan Shmuel Foods Ltd. in August 1993. Gan Shmuel Foods Ltd. was founded in 1941 and is based in Gan Shmuel, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Beverages—Non-Alcoholic",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Gan Shmuel"
    },
    "HMAM.TA": {
        "short_name": "HAMAMA MEIR TRADIN",
        "long_name": "Hamama Meir Trading (1996) Ltd.",
        "summary": "Hamama Meir Trading (1996) Ltd. engages in the import and distribution of raw materials for the food industry in Israel. The company offers grains, pulses, nuts, dried fruits, seeds and herbs, coffee, and animal feed. It serves food conglomerates, wholesalers and distributors, small and medium-sized natural food stores, and health food shops. The company was founded in 1996 and is headquartered in Bnei Brak, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Bnei Brak"
    },
    "KRUR.TA": {
        "short_name": "KERUR HOLDINGS LTD",
        "long_name": "Kerur Holdings Ltd.",
        "summary": "Kerur Holdings Ltd., through its subsidiaries, operates in the food sector in Israel. It produces and markets soft drinks and mineral water; and frozen potato and onion fries, as well as plant products. The company was formerly known as The Israeli Company Cooling & Supply Co. Ltd. and changed its name to Kerur Holdings Ltd. in 2006. The company was incorporated in 1929 and is based in Or Yehuda, Israel. Kerur Holdings Ltd. is a subsidiary of Israel Lighterage & Supply Co. Ltd.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Or Yehuda"
    },
    "MEAT.TA": {
        "short_name": "MEAT-TECH 3D LTD",
        "long_name": "Meat-Tech 3D Ltd",
        "summary": "Meat-Tech 3D Ltd develops a 3D printing technology for edible meat tissue using cellular agriculture. It develops technologies, processes, and machines for cultivating, producing, and printing cultured meat. The company was formerly known as Ophectra Real Estate & Investments Ltd and changed its name to Meat-Tech 3D Ltd in October 2019. The company is based in Ness Ziona, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Ness Ziona"
    },
    "MIFT.TA": {
        "short_name": "MILLENNIUM FOOD-TE",
        "long_name": "Millennium Food Tech Limited Partnership",
        "summary": "Millennium Food Tech Limited Partnership operates as a food technology company in Israel. It develops food substitutes and foods, as well as information technologies for food industry. The company was founded in 2019 and is based in Jaffa, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Jaffa"
    },
    "MTTCF": {
        "short_name": "MEAT-TECH 3D LTD",
        "long_name": "Meat-Tech 3D Ltd",
        "summary": "Meat-Tech 3D Ltd develops a 3D stem cell printing technology for cell based meat production. The company was formerly known as Ophectra Real Estate & Investments Ltd and changed its name to Meat-Tech 3D Ltd in October 2019. The company is based in Petah Tikva, Israel.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Petah Tikva"
    },
    "NGS.AX": {
        "short_name": "NGSLTD FPO",
        "long_name": "Nutritional Growth Solutions Ltd.",
        "summary": "Nutritional Growth Solutions Ltd. develops, produces, and sells pediatric protein supplements products in the United States, Asia, and the Middle East. It offers its products under the Healthy Height, Horlicks Growth Plus, and Pro Up brand names. The company was formerly known as N. G. Solutions Ltd. and changed its name to Nutritional Growth Solutions Ltd. in June 2020. The company was founded in 2013 and is headquartered in Tel Aviv, Israel.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "NTML.TA": {
        "short_name": "NETO MALINDA",
        "long_name": "Neto Malinda Trading Ltd.",
        "summary": "Neto Malinda Trading Ltd. manufactures, imports, markets, and distributes kosher and edible products. It offers grilled meat products, such as hamburgers, kebabs, steaks, sausages, skewers, and others; ground meat products, including beef, lamb, veal, turkey, and chicken; meat products for cooking include calf goulash, roasted veal, faux-filet, kishke, roast beef, and other products; and instant meals, such as shawarma, readymade schnitzel, chicken rings, and others under the Tibon Veal brand. The company also provides whole fish, fish fillet, and various fish steak, including coated and readymade fish products; seafood products and fish cutlets; and fish salads, such as herring and ikra under the Delidag brand. In addition, it offers frozen bourekas, ethnic meat, pastries, and pizzas under the Three Bakers brand; and operates chain of restaurant, as well as provides catering services under the El Gaucho brand. Further, the company produces, packages, and sells canned tuna and frozen smoked salmon; imports and sells finished grocery products, such as canned mushrooms, fruits, sauces, and vegetables; and imports various pasta, rice, and granola products under the Williger brand. Additionally, it provides cooking and baking products, which include cooking and cream bases, whipped cream bases, coffee rich creamer, and others under the Rich's brand; and ready-to-eat noodle meals under the Magic brand. The company was formerly known as Food Hamashbir Ltd. and changed its name to Neto Malinda Trading Ltd. in September 2003. Neto Malinda Trading Ltd. was founded in 1992 and is based in Kiryat Malachi, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Kiryat Malakhi"
    },
    "NTO.TA": {
        "short_name": "NETO M.E HOLDINGS",
        "long_name": "Neto M.E Holdings Ltd",
        "summary": "Neto M.E Holdings Ltd. produces, imports, markets, and distributes a range of food products in Israel. The company offers frozen, refrigerated, fresh, and processed meat, including chicken and turkey under the brand Tibon Veal; frozen, fresh, live, and smoked fish under the Delidag brand; and canned tuna and frozen smoked salmon, canned mushrooms, fruits, sauces, vegetables, pasta, rice, and granola products under the Williger brand name. It also provides frozen bakery products comprising bourekas, meat and dairy pastries, pastries from the Yemenite cuisine, pizzas, and others under the Three Bakers brand; ready-to-eat noodle meals under the brand Magic; and non-dairy and whipped creams, as well as cakes under the Rich's brand name. In addition, the company offers catering services, rural accommodations, meat workshops, and meals for carnivores, as well as frozen meat products under the El Gaucho brand; and fresh fruits and vegetables under the Bikorey Hasade brand, as well as operates grill restaurant chain under the El Gaucho name. Neto M.E Holdings Ltd. was founded in 1940 and is headquartered in Kiryat Malachi, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Kiryat Malachi"
    },
    "NXFR.TA": {
        "short_name": null,
        "long_name": "NextFerm Technologies Ltd",
        "summary": "NextFerm Technologies Ltd, a food-tech company, develops and produces active ingredients based on in-house yeast development and fermentation, and for human nutrition. It offers Astaferm, a fermented-astaxanthin; and ProteVin, a vegan protein. The company was founded in 2013 and is based in Yokneam Illit, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Yokneam Illit"
    },
    "RMLI.TA": {
        "short_name": "RAMI LEVI CHAIN",
        "long_name": "Rami Levi Chain Stores Hashikma Marketing 2006 Ltd",
        "summary": "Rami Levi Chain Stores Hashikma Marketing 2006 Ltd operates a chain of retail stores with a format of discount network in Israel. Its stores offer breads and pastries, fruits and vegetables, milk, eggs, salads fish meats, pulses and cereals, snacks and sweets, drinks, and disposables, as well as organic and health, frozen, canning, cooking and baking, home and animal maintenance, skin and babies care, clothing, and electrical and electronic products. The company was founded in 1976 and is based in Jerusalem, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Jerusalem"
    },
    "SAE.TA": {
        "short_name": "SHUFERSAL LTD",
        "long_name": "Shufersal Ltd.",
        "summary": "Shufersal Ltd. operates a chain of supermarkets under the Shufersal brand name in Israel. It operates through three segments: Retail, Real Estate, and Credit Card Customer Club Management. The company's stores provides vegetables, fruits, grains, legumes, dairy products, and other products; and general grocery and food products, toiletries and home care, pharma and cosmetic products, baked goods, beverages, frozen and chilled products, and meat and fish products. It also operates an online shopping website that offers home and garden furniture, electrical and kitchen appliances, textile and home design products, travel and leisure products, and food products. In addition, the company provides credit cards and customer club services. Further, it is also involved in the real estate business; and logistic activities. The company was founded in 1958 and is based in Rishon LeZion, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Rishon LeZion"
    },
    "SANO1.TA": {
        "short_name": "SANO-BRUNO'S ENTER",
        "long_name": "Sano Bruno's Enterprises Ltd",
        "summary": "Sano Bruno's Enterprises Ltd manufactures and sells laundry products, home care products, cleaning and hygiene products, kitchen accessories, air fresheners, insecticides, and paper products under the Sano brand worldwide. It offers mosquito repellents; insecticide killers; paper products, including toilet paper, napkins, paper towels, and nose wipes; and cooking and cleaning accessories, such as tools cleaning, floor cleaning, cooking and baking, and general cleaning accessories, as well as garbage and food bags. The company also provides home fragrance products; laundry supplies, fabric softeners, stain removers, laundry fragrances, and auxiliary materials for laundry and ironing; dishwashing products; and home cleaning products. The company was founded in 1965 and is based in Hod HaSharon, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Hod HaSharon"
    },
    "SMNIN.TA": {
        "short_name": "SHEMEN INDUSTRIES",
        "long_name": "Shemen Industries Ltd",
        "summary": "Shemen Industries Ltd manufactures, markets, and sells industrial products and raw materials for industry and livestock customers in Israel. The company operates in two segments, Food and Agro Food Sector. It offers edible oils and other food products to the consumer, domestic, and institutional markets; and tuna products under the Olive Tree brand. The company was founded in 1919 and is based in Haifa, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Haifa"
    },
    "STRS.TA": {
        "short_name": "STRAUSS GROUP LTD",
        "long_name": "Strauss Group Ltd.",
        "summary": "Strauss Group Ltd., together with its subsidiaries, develops, manufactures, markets, and sells various food and beverage products in Israel, North America, Europe, and internationally. The company primarily operates through six segments: Health & Wellness; Fun & Indulgence; Israel Coffee; International Coffee; International Dips & Spreads; and Strauss Water. The Health & Wellness segment provides yogurts, dairy desserts, soft cheeses, flavored milk beverages, chilled salads, cut vegetables, fresh pasta products, cereal and granola bars, honey products, olive oils, fruit preserves, cooking sauces, lemon juices, and natural maple syrups. This segment also sells and distributes natural juices, butter spreads, sheep yogurt, and plant-based probiotic desserts The Fun & Indulgence segment offers sweet snack bars, chocolate tablets, sweet spreads, candies, chewing gums, cakes and cookies, biscuits, wafers, and salty snacks. The Israel Coffee segment develops, manufactures, sells, markets, and distributes a range of coffee products, chocolate powders, and other drink powders; and retails coffee products. The International Coffee segment develops and manufactures various coffee products and powder drinks; markets and distributes coffee machines; and purchases and processes green coffee, corn products, and juice powders. The International Dips & Spreads segment develops, manufactures, markets, and sells refrigerated dips and spreads under the Sabra, Obela, and Florentin brands. The Strauss Water segment also develops, manufactures, and sells drinking water filtration, purification, and carbonation devices. The company was formerly known as Strauss-Elite Ltd. and changed its name to Strauss Group Ltd. in February 2007. Strauss Group Ltd. was founded in 1933 and is headquartered in Petach Tikva, Israel. Strauss Group Ltd. is a subsidiary of Strauss Holdings Ltd.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Petach Tikva"
    },
    "SVRT.TA": {
        "short_name": "SAVOREAT LTD",
        "long_name": "SavorEat Ltd.",
        "summary": "SavorEat Ltd. develops plant-based meat alternative products using 3D printing technology for fast-moving kitchens. Its product is a combination of 3D printing technology, an automatic cooking machine, and plant-based ingredients that allow the creation of various textures and designs that characterize meat. The company was founded in 2018 and is based in Ness Ziona, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Ness Ziona"
    },
    "TTAM.TA": {
        "short_name": "TIV TAAM HLDGS 1",
        "long_name": "Tiv Taam Holdings 1 Ltd.",
        "summary": "Tiv Taam Holdings 1 Ltd. owns and operates a chain of food retail stores in Israel. The company provides fruits and vegetables, meat and chicken products, fish and sea fruits, eggs, milk, salads, cheese products, sausages, breads and pastries, canned food pasta dressing and spreads, nuts, seeds, snacks, dried fruits, spices, cereal snacks and sweets, frozen vegetables and fruits, frozen food and concentrates, beverages, wine/beer and alcohol products, cigarettes, bath and cosmetics, housewares, kitchen products, toys, stationery and office products, leisure products, electrical and lighting accessories, and home care and animal products. It also offers its products through online. The company was formerly known as World Group Holdings Ltd. and changed its name to Tiv Taam Holdings 1 Ltd. in May 2007. The company was founded in 1965 and is based in Hadera, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Hadera"
    },
    "VCTR.TA": {
        "short_name": "VICTORY SUPERMARKE",
        "long_name": "Victory Supermarket Chain Ltd",
        "summary": "Victory Supermarket Chain Ltd operates supermarkets in Israel. It sells kosher products. The company operates 58 supermarket stores with 5 branches in the city of Tel Aviv. It also sells its products through victoryonline.co.il website. Victory Supermarket Chain Ltd was founded in 1986 and is based in Yavne, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Yavne"
    },
    "WILC": {
        "short_name": "G. Willi-Food International,  L",
        "long_name": "G. Willi-Food International Ltd.",
        "summary": "G. Willi-Food International Ltd. develops, imports, exports, markets, and distributes food products worldwide. It offers mushroom, artichoke, bean, asparagu, caper, corn kernel, baby corn, palm heart, vine leave, sour pickle, mixed pickled vegetable, pickled pepper, olives, garlic, roasted eggplant sun, and dried tomato products; and canned fish comprising tuna, sardine, anchovies, smoked and pressed cod liver, herring, fish paste, and salmon products. The company also provides pineapple, peach, apricot, pear, mango, cherry, litchi, and fruit cocktail products; edible oils comprising olive, sunflower, soybean, corn, and rapeseed oils; dairy and dairy substitutes consisting of cheese, feta, Bulgarian cubes, goat cheese, fetina, butter, butter spread, margarine, melted cheese, cheese alternative, condensed milk, whipped cream, yogurt, frozen pizza, and other products; and dried fruits, nuts, and beans, such as figs, apricots, organic chestnuts, sunflower seeds, walnuts, pine nuts, cashews, banana chips, pistachios, and peanuts. In addition, it offers instant noodle soup, frozen edamame soybean, freeze dried instant coffee, bagel, breadstick, coffee creamer, lemon juice, halva, Turkish delight, cookie, vinegar, sweet pastry and cracker, sauce, corn flour, rice, rice stick, pasta, organic pasta, spaghetti and noodle, breakfast cereal, corn flake, rusk, tortilla, dried apples snack, desert, ice cream, and light and alcoholic beverage products. It markets its products under the Willi-Food, Donna Rozza, Manchow, Gold Frost, Tifeeret, the Chef Dish, Art Coffe, Mr Chang, Muchi, Euro Butter, Euro Spread, Euro Cheese, Euro Cream, Euro Dessert, Euro Veg, Ha-Bulgaria, Gelato, and Emma brand names. The company was formerly known as G. Willi-Food Ltd. and changed its name to G. Willi-Food International Ltd. in June 1996. The company was founded in 1994 and is headquartered in Yavne, Israel. G. Willi-Food International Ltd. is a subsidiary of Willi-Food Investments Ltd.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Yavne"
    },
    "WLFD.TA": {
        "short_name": "WILLY FOOD INVSTM.",
        "long_name": "Willy-Food Investments Ltd",
        "summary": "Willy-Food Investments Ltd imports, exports, markets, and sells food products in Israel. It offers canned fruits, vegetables, and fish; coconut milk, rice vermicelli, mushrooms, roasted/in brine vegetables, vinegar, prepared meal, and milk alternative drink products; oil, sauces, rice, pasta, noodles, juices, cereals, and snacks products; tortillas, toasts, crackers, and corn flour; and dry, chilled, and frozen food products. The company also provides butter, margarine, whipped cream, cheese, and dairy products; and cookies and sweets, and tea and others. It offers its products under Willi-Food, Del Monte, DAAWAT, Completa, Sera, Zanetti, NOBLEZA GAUCHA, and El Pastor brands. The company was formerly known as T.K.D Investment Ltd. and changed its name to Willi-Food Investments Ltd in January 1995. Willy-Food Investments Ltd was founded in 1992 and is based in Yavne, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Yavne"
    },
    "YHNF.TA": {
        "short_name": "M YOCHANANOF & SON",
        "long_name": "M.Yochananof and Sons (1988) Ltd",
        "summary": "M.Yochananof and Sons (1988) Ltd operates a chain of Yohananof supermarkets in Israel. It has 26 branches. The company was founded in 1992 and is based in Rehovot, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Rehovot"
    }
}