{
    "BKRY.TA": {
        "short_name": "BIKUREY HASADE HOL",
        "long_name": "Bikurey Hasade (Holdings) Ltd",
        "summary": "Bikurey Hasade (Holdings) Ltd. engages in growing, marketing, and distributing fresh vegetables and fruits in Israel and internationally. The company offers dried fruits, fresh fruits and vegetables, organic produce, and packaged and chilled products. It also provides logistics distribution and collection, packaging and pallets, and accounting services. The company is based in Kiryat Malakhi, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Kiryat Malakhi",
        "zipcode": "8310902",
        "website": "http://www.bikurey.co.il",
        "full_time_employees": 1349
    },
    "BSD.L": {
        "short_name": "B.S.D CROWN LTD ORD NIS0.01 (DI",
        "long_name": "B.S.D Crown Ltd.",
        "summary": "B.S.D Crown Ltd., through its subsidiaries, imports, markets, and distributes various food products to retail chains, supermarkets, wholesalers, and institutions primarily in Israel. It is also involved in the credit activities, including provision of loans to others. The company was formerly known as Emblaze Ltd. and changed its name to B.S.D Crown Ltd. in August 2014. B.S.D Crown Ltd. was founded in 1994 and is headquartered in Ramat Gan, Israel.",
        "currency": "GBp",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Israel",
        "state": null,
        "city": "Ramat Gan",
        "zipcode": "5268102",
        "website": "http://www.bsd-c.com",
        "full_time_employees": 166
    },
    "DIPL.TA": {
        "short_name": "DIPLOMAT HOLDINGS",
        "long_name": "Diplomat Holdings Ltd",
        "summary": "Diplomat Holdings Ltd operates as a sales and distribution company in the fast-moving consumer goods sector. The company primarily sells personal and household care, and food products. It operates in Israel, Georgia, South Africa, Cyprus, and New Zealand. The company was founded in 1968 and is based in Airport City, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Airport City",
        "zipcode": "701000",
        "website": "http://www.diplomat-global.com/israel/",
        "full_time_employees": 2350
    },
    "NTO.TA": {
        "short_name": "NETO M.E HOLDINGS",
        "long_name": "Neto M.E Holdings Ltd",
        "summary": "Neto M.E Holdings Ltd. produces, imports, markets, and distributes a range of food products in Israel. The company offers frozen, refrigerated, fresh, and processed meat, including chicken and turkey under the brand Tibon Veal; frozen, fresh, live, and smoked fish under the Delidag brand; and canned tuna and frozen smoked salmon, canned mushrooms, fruits, sauces, vegetables, pasta, rice, and granola products under the Williger brand name. It also provides frozen bakery products comprising bourekas, meat and dairy pastries, pastries from the Yemenite cuisine, pizzas, and others under the Three Bakers brand; ready-to-eat noodle meals under the brand Magic; and non-dairy and whipped creams, as well as cakes under the Rich's brand name. In addition, the company offers catering services, rural accommodations, meat workshops, and meals for carnivores, as well as frozen meat products under the El Gaucho brand; and fresh fruits and vegetables under the Bikorey Hasade brand, as well as operates grill restaurant chain under the El Gaucho name. Neto M.E Holdings Ltd. was founded in 1940 and is headquartered in Kiryat Malachi, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Kiryat Malachi",
        "zipcode": "75864",
        "website": "http://www.neto.org.il",
        "full_time_employees": 1355
    },
    "TTAM.TA": {
        "short_name": "TIV TAAM HLDGS 1",
        "long_name": "Tiv Taam Holdings 1 Ltd.",
        "summary": "Tiv Taam Holdings 1 Ltd. owns and operates a chain of food retail stores in Israel. The company provides fruits and vegetables, meat and chicken products, fish and sea fruits, eggs, milk, salads, cheese products, sausages, breads and pastries, canned food pasta dressing and spreads, nuts, seeds, snacks, dried fruits, spices, cereal snacks and sweets, frozen vegetables and fruits, frozen food and concentrates, beverages, wine/beer and alcohol products, cigarettes, bath and cosmetics, housewares, kitchen products, toys, stationery and office products, leisure products, electrical and lighting accessories, and home care and animal products. It also offers its products through online. The company was formerly known as World Group Holdings Ltd. and changed its name to Tiv Taam Holdings 1 Ltd. in May 2007. The company was founded in 1965 and is based in Hadera, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Hadera",
        "zipcode": null,
        "website": "http://www.tivtaam.co.il",
        "full_time_employees": 1596
    },
    "VCTR.TA": {
        "short_name": "VICTORY SUPERMARKE",
        "long_name": "Victory Supermarket Chain Ltd",
        "summary": "Victory Supermarket Chain Ltd operates supermarkets in Israel. It sells kosher products. The company operates 58 supermarket stores with 5 branches in the city of Tel Aviv. It also sells its products through victoryonline.co.il website. Victory Supermarket Chain Ltd was founded in 1986 and is based in Yavne, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Yavne",
        "zipcode": "70800",
        "website": "http://www.victory.co.il",
        "full_time_employees": 1278
    },
    "WILC": {
        "short_name": "G. Willi-Food International,  L",
        "long_name": "G. Willi-Food International Ltd.",
        "summary": "G. Willi-Food International Ltd. develops, imports, exports, markets, and distributes food products worldwide. It offers mushrooms, artichoke, beans, asparagus, capers, corn kernels, baby corn, palm hearts, vine leaves, sour pickles, mixed pickled vegetables, pickled peppers, olives, garlic, roasted eggplant sun, and dried tomatoes; and canned fish comprising tuna, sardine, anchovies, smoked and pressed cod liver, herring, fish paste, and salmon products. The company also provides pineapples, peaches, apricots, pears, mangos, cherries, litchis, and fruit cocktail; edible oils comprising olive, sunflower, soybean, corn, and rapeseed oils; dairy and dairy substitutes consisting of cheese, feta, Bulgarian cubes, goat cheese, fetina, butter, butter spread, margarine, melted cheese, cheese alternative, condensed milk, whipped cream, yogurt, frozen pizza, and other products; and dried fruits, nuts, and beans, such as figs, apricots, organic chestnuts, sunflower seeds, walnuts, pine nuts, cashews, banana chips, pistachios, and peanuts. In addition, it offers instant noodle soup, frozen edamame soybean, freeze dried instant coffee, bagel, breadstick, coffee creamer, lemon juice, halva, Turkish delight, cookies, vinegar, sweet pastry and crackers, sauce, corn flour, rice, rice sticks, pasta, organic pasta, spaghetti and noodles, breakfast cereals, corn flakes, rusks, tortilla, dried apples snacks, desert, ice cream, and light and alcoholic beverages. It markets its products under the Willi-Food, Donna Rozza, Manchow, Gold Frost, Tifeeret, the Chef Dish, Art Coffe, Mr Chang, Muchi, Euro Butter, Euro Spread, Euro Cheese, Euro Cream, Euro Dessert, Euro Veg, Ha-Bulgaria, Gelato, and Emma brand names. The company was formerly known as G. Willi-Food Ltd. and changed its name to G. Willi-Food International Ltd. in June 1996. The company was incorporated in 1994 and is headquartered in Yavne, Israel. G. Willi-Food International Ltd. is a subsidiary of Willi-Food Investments Ltd.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Yavne",
        "zipcode": "81106",
        "website": "http://www.willi-food.com",
        "full_time_employees": 181
    }
}