{
    "FRSM.TA": {
        "short_name": "FRESHMARKET LTD",
        "long_name": "Freshmarket Ltd.",
        "summary": "Freshmarket Ltd. operates a chain of supermarkets in Israel. It operates 31 supermarket branches. The company was founded in 2002 and is based in Herzliya, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Herzliya",
        "zipcode": "4690500",
        "website": null,
        "market_cap": null
    },
    "RMLI.TA": {
        "short_name": "RAMI LEVI CHAIN",
        "long_name": "Rami Levi Chain Stores Hashikma Marketing 2006 Ltd",
        "summary": "Rami Levi Chain Stores Hashikma Marketing 2006 Ltd operates a chain of retail stores with a format of discount network in Israel. Its stores offer breads and pastries, fruits and vegetables, milk, eggs, salads fish meats, pulses and cereals, snacks and sweets, drinks, and disposables, as well as organic and health, frozen, canning, cooking and baking, home and animal maintenance, skin and babies care, clothing, and electrical and electronic products. The company was founded in 1976 and is based in Jerusalem, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Jerusalem",
        "zipcode": "9334210",
        "website": "http://www.rami-levy.co.il",
        "market_cap": null
    },
    "SAE.TA": {
        "short_name": "SHUFERSAL LTD",
        "long_name": "Shufersal Ltd.",
        "summary": "Shufersal Ltd. operates a chain of supermarkets under the Shufersal brand name in Israel. It operates through three segments: Retail, Real Estate, and Credit Card Customer Club Management. The company's stores provides vegetables, fruits, grains, legumes, dairy products, and other products; and general grocery and food products, toiletries and home care, pharma and cosmetic products, baked goods, beverages, frozen and chilled products, and meat and fish products. It also operates an online shopping website that offers home and garden furniture, electrical and kitchen appliances, textile and home design products, travel and leisure products, and food products. In addition, the company provides credit cards and customer club services. Further, it is also involved in the real estate business; and logistic activities. The company was founded in 1958 and is based in Rishon LeZion, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Rishon LeZion",
        "zipcode": "7505002",
        "website": "http://www.shufersal.co.il",
        "market_cap": null
    },
    "YHNF.TA": {
        "short_name": "M YOCHANANOF & SON",
        "long_name": "M.Yochananof and Sons (1988) Ltd",
        "summary": "M.Yochananof and Sons (1988) Ltd operates a chain of Yohananof supermarkets in Israel. It has 26 branches. The company was founded in 1992 and is based in Rehovot, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Rehovot",
        "zipcode": null,
        "website": "http://www.yochananof.co.il",
        "market_cap": null
    }
}