{"ALBA.TA": {"short_name": "ALBAAD MASSUOT YIT", "long_name": "Albaad Massuot Yitzhak Ltd", "summary": "Albaad Massuot Yitzhak Ltd produces and sells wipes worldwide. It offers cotton soft wipes; cosmetic products, such as body, and facial and feet care wipes; feminine hygiene products comprising tampons and sanitary products, as well as baby, mom, toddler, and home care wipes; and adult bed and bath wipes. The company also provides personal care wipes consisting of intimate care wipes; para-pharma wipes; professional wipes, such as para-medical, veterinary cow and pet, automotive, and restaurant wipes, as well as sachets; and flushable moist toilet papers. In addition, it offers contract, private label, and institutional manufacturing services. The company was founded in 1985 and is based in Massuot Yitzhak, Israel.", "currency": "ILA", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Massuot Yitzhak"}, "SANO1.TA": {"short_name": "SANO-BRUNO'S ENTER", "long_name": "Sano Bruno's Enterprises Ltd", "summary": "Sano Bruno's Enterprises Ltd manufactures and sells laundry products, home care products, cleaning and hygiene products, kitchen accessories, air fresheners, insecticides, and paper products under the Sano brand worldwide. It offers mosquito repellents; insecticide killers; paper products, including toilet paper, napkins, paper towels, and nose wipes; and cooking and cleaning accessories, such as tools cleaning, floor cleaning, cooking and baking, and general cleaning accessories, as well as garbage and food bags. The company also provides home fragrance products; laundry supplies, fabric softeners, stain removers, laundry fragrances, and auxiliary materials for laundry and ironing; dishwashing products; and home cleaning products. The company was founded in 1965 and is based in Hod HaSharon, Israel.", "currency": "ILA", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Hod HaSharon"}}