{
  "OIBRQN.MX": {
    "city": "Rio de Janeiro",
    "country": "Brazil",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Wireless Communications",
    "long_name": "Oi S.A.",
    "market": "mx_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "OI SA",
    "state": "RJ",
    "summary": "Oi S.A., a switched fixed-line telephony services concessionaire, provides integrated telecommunication services in Brazil. The company offers fixed telephony services, including voice, data communication, and pay TV services; local and intraregional long-distance carrier services; domestic and international long-distance services; and mobile voice and data telecommunications services, as well as value-added services. It also provides wholesale interconnection, network usage, and traffic transportation services to other telecommunications providers. In addition, the company offers financial, payment and credit systems, network, data traffic, call center and telemarketing, and Wi-Fi Internet services; and business consulting and management services, as well as preparation of projects and economic studies. Further, the company is involved in raising funds in the international market; telephone directory publishing and operation of related databases; investment management, property investment, and receivables portfolio management activities; and the purchase and sale of real estate. As of December 31, 2019, it had 7.0 million residential fixed lines in service customers; 4.2 million asymmetric digital subscriber line subscribers; 1.45 million residential pay TV subscribers; and 36.8 million mobile subscribers. It serves residential, subscription and prepaid, and mobile broadband customers, as well as small, medium-sized, and large corporate customers. The company was formerly known as Brasil Telecom S.A. and changed its name to Oi S.A. in February 2012. Oi S.A. was founded in 1998 and is headquartered in Rio de Janeiro, Brazil. On June 20, 2016, Oi S.A. along with its subsidiaries filed for bankruptcy protection.",
    "website": "http://www.oi.com.br",
    "zipcode": "22430-190"
  }
}
