{
    "ENRGA.PR": {
        "short_name": "ENERGOAQUA",
        "long_name": "ENERGOAQUA, a.s.",
        "summary": "ENERGOAQUA, a.s. engages in the manufacture, distribution, and sale of energy media and services in the electricity, thermal energy, industrial gases, and water management in the Czech Republic. The company produces and distributes potable and industrial water; operates and manages sewage and storm sewers; and produces and distributes chilled water for cooling of technological equipment, chilled water for the purpose of air conditioning and refrigeration special circuits technologist equipment, and demineralized water. It also supplies thermal energy for heating and hot-water to the industrial zones and residential areas; and produces, treats, stores, and distributes compressed air, warehouse technology gas, hydrogen gas, liquid and gaseous nitrogen, and natural gas, as well as operates regulating stations, stores liquid, and distributes gaseous oxygen. In addition, the company is involved in operating and maintaining HVAC and industrial refrigeration equipment; measuring environmental cleanliness in air conditioned spaces, and microclimate environmental parameter; and auditing fire dampers of buildings, as well as provides metrology services for measuring devices, sensors, thermometers, pressure gauages, etc. Further, it operates and manages waste water treatment plants, chemical sewer system, and storage tanks and drains for treating wastewater disposal of chemical waste water produced in the industrial areas. Additionally, the company provides machinery and building maintenance works, such as metalworking, locksmith, plumbing, construction, painting, excavation, trucking freight and passenger, and car-repairing works; and installs, maintains, and services telecommunications and network equipment. It also rents and sells production entities; and constructs and develops residential and civic facilities. ENERGOAQUA, a.s. was founded in 1992 and is based in Roznov pod Radhostem, the Czech Republic.",
        "currency": "CZK",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "PRA",
        "market": "cz_market",
        "country": "Czech Republic",
        "state": null,
        "city": "Roznov pod Radhostem",
        "zipcode": "756 61",
        "website": "http://www.energoaqua.cz",
        "market_cap": "Micro Cap"
    }
}