{
    "GTSO": {
        "short_name": "GREEN TECHNOLOGY SOLUTIONS INC",
        "long_name": "Green Technology Solutions, Inc.",
        "summary": "Green Technology Solutions, Inc. focuses on providing business support services to the horticultural and medical cannabis markets. It intends to provide payment processing, security, and transport support services; hemp delivery systems; and specialty organic soils and fertilizers, lighting systems, and methods to produce other cannabinoid products. The company was formerly known as Sunrise Energy Resources, Inc. and changed its name to Green Technology Solutions, Inc. in October 2010. Green Technology Solutions, Inc. was incorporated in 1991 and is based in San Jose, California.",
        "currency": "USD",
        "sector": "Conglomerates",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "San Jose"
    },
    "PRLX": {
        "short_name": "PARALLAX HEALTH SCIENCES INC",
        "long_name": "Parallax Health Sciences, Inc.",
        "summary": "Parallax Health Sciences, Inc. builds and expands an integrated digital healthcare network with products and services that provide remote communication, diagnosis, treatment, and monitoring of patients. The company offers remote healthcare products, including patent pending software and mobile apps, and other services, as well as electronic kits and devices from third-party licensed platforms that are designated towards a patient's primary health concern, such as diabetes, blood pressure, cardiovascular, general monitoring, etc.; and audio and video options that interface with the patient's healthcare providers. It also provides prescription medication dosage monitoring services; and behavioral health products comprising REBOOT, a proprietary behavioral health technology for an individual or an organization to transform the cost of treating and managing chronic illnesses that include pulmonary-COPD-asthma, diabetes, and cardiovascular diseases by effecting the modification of behavior in patients being treated for these chronic diseases. In addition, the company offers diagnostics products, which comprise Target System, a proprietary POC diagnostic immunoassay testing platform; and test cartridges for the areas of infectious diseases, cardiac markers, drugs of abuse, and various other medical conditions, as well as VT-1000 desktop analyzers, target antigen detection systems, and other products. Further, it provides SPARKS Mobile, a target system hand-held analyzer; COMPASS for behavioral modification; Fotodigm platform for remote patient monitoring, telehealth, and POC diagnostic testing services; and Intrinsic Code technology for actionable insights to behavior modification. The company was formerly known as Endeavor Power Corporation and changed its name to Parallax Health Sciences, Inc. in January 2014. Parallax Health Sciences, Inc. was founded in 2005 and is headquartered in Santa Monica, California.",
        "currency": "USD",
        "sector": "Conglomerates",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Santa Monica"
    },
    "PTPF": {
        "short_name": "ALL MARKETING SOLUTIONS INC",
        "long_name": "All Marketing Solutions, Inc.",
        "summary": "All Marketing Solutions, Inc. provides patent consulting and technology transfer services. It focuses on assisting small business and entrepreneurs that have developed patentable novel products or services but does not have the financial resources to fund their own patent application. The company was formerly known as Patents Professional, Inc. All Marketing Solutions, Inc. was founded in 2008 and is based in Carson City, Nevada.",
        "currency": "USD",
        "sector": "Conglomerates",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Carson City"
    },
    "TSTS": {
        "short_name": "THAT MARKETING SOLUTION INC",
        "long_name": "That Marketing Solution, Inc.",
        "summary": "That Marketing Solution, Inc., a development stage company, focuses on the development, manufacturing, advertising, sale, and marketing of nutritional products. It acquired the rights to a proprietary formula for a blend of nutritional supplements called Low-T capsules that are intended to be a natural, non-FDA regulated, and over-the-counter supplement, which addresses the primary contributing factors of decreased levels of testosterone in males over the age of 30. The company was formerly known as Vista Holding Group, Corp. and changed its name to That Marketing Solution, Inc. in September 2014. That Marketing Solution, Inc. was founded in 2012 and is based in Salt Lake City, Utah.",
        "currency": "USD",
        "sector": "Conglomerates",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Salt Lake City"
    }
}