{"MX": {"short_name": "MagnaChip Semiconductor Corpora", "long_name": "MagnaChip Semiconductor Corporation", "summary": "MagnaChip Semiconductor Corporation, together with its subsidiaries, designs, manufactures, and sells analog and mixed-signal semiconductor platform solutions for communications, Internet of Things, consumer, industrial, and automotive applications. The company operates through two segments, Foundry Services Group and Standard Products Group. The Foundry Services Group segment provides analog and mixed-signal foundry services for fabless and integrated device manufacturer semiconductor companies to manufacture a range of products, including display drivers, light emitting diode (LED) drivers, audio encoding and decoding devices, microcontrollers, touch screen controllers, RF switches, park distance control sensors for automotive, electronic tag memories, and power management semiconductors. The Standard Products Group segment offers display solutions, including source and gate drivers, and timing controllers that cover a range of flat panel displays used in ultra-high definition, high definition, full high definition, LED, 3D and organic light emitting diodes televisions and displays, notebooks, and mobile communications and entertainment devices. This segment also offers power management semiconductor products, such as metal oxide semiconductor field effect transistors, insulated gate bipolar transistors, DC-DC converters, LED drivers, SSD PMIC products, and switching and linear regulators for televisions, smartphones, mobile phones, desktop PCs, notebooks, tablet PCs, other consumer electronics, and consumer appliances, as well as for industrial applications. It serves consumer, computing, and industrial electronics original equipment manufacturers; original design manufacturers; and electronics manufacturing services companies, as well as subsystem designers. The company sells its products through a direct sales force, as well as through a network of agents and distributors worldwide. MagnaChip Semiconductor Corporation is based in Luxembourg City, Luxembourg.", "currency": "USD", "sector": "Technology", "industry": "Semiconductors", "exchange": "NYQ", "market": "us_market", "country": "Luxembourg", "city": "Luxembourg City"}}