{
  "HALS.ME": {
    "city": "Moscow",
    "country": "Russia",
    "currency": "RUB",
    "exchange": "MCX",
    "industry": "Real Estate - Diversified",
    "long_name": "Public Joint Stock Company SG-Development",
    "market": "ru_market",
    "market_cap": "Micro Cap",
    "sector": "Real Estate",
    "short_name": "SG-DEVELOPMENT PJS",
    "state": null,
    "summary": "Public Joint Stock Company SG-Development engages in the development and rental of real estate properties in Russia. The company develops residential and commercial projects. Its projects portfolio includes residential complexes, business quarters, shopping centers, mixed-use complexes, and landmark urban facilities, including Children's Dreamhouse Mall, SkyLight Business Center, and Danilovsky Fort Business Center. The company is based in Moscow, Russia. Public Joint Stock Company SG-Development is a subsidiary of VTB Bank public joint-stock company.",
    "website": "http://en.hals-development.ru",
    "zipcode": "115184"
  },
  "INGR.ME": {
    "city": "Moscow",
    "country": "Russia",
    "currency": "RUB",
    "exchange": "MCX",
    "industry": "Real Estate - Development",
    "long_name": "Public Joint Stock Company \"INGRAD\"",
    "market": "ru_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "INGRAD PJSC",
    "state": null,
    "summary": "JSC OPIN, together with its subsidiaries, engages in investing in, developing, managing, and disposing real estate projects in Russia. It focuses on office buildings, large-scale residential communities, middle-class residential real estate, and retail centers and hotels. The company's property portfolio comprises Pavlovo project, Pavlovo Podvorye project, Pavlovo I project, Domnikov project, Pestovo project, Martemianovo project, Sochi Hotel and Residential Complex, Lukino project, Gorki-10 project, Lukino project, Large Pestovo project, and Zavidovo project, as well as project assets in Klinsky district, Dmitrovsky district, and Tver region. It also engages in the production and distribution of fabricated homes, as well as provides hotel services. JSC OPIN serves contractors, buyers/sellers of property, tenants, and banks. The company was founded in 2002 and is based in Moscow, the Russian Federation.\n  JSC OPIN, together with its subsidiaries, engages in investing in, developing, managing, and disposing real estate projects in Russia. It focuses on office buildings, large-scale residential communities, middle-class residential real estate, and retail centers and hotels. The company's property portfolio comprises Pavlovo project, Pavlovo Podvorye project, Pavlovo I project, Domnikov project, Pestovo project, Martemianovo project, Sochi Hotel and Residential Complex, Lukino project, Gorki-10 project, Lukino project, Large Pestovo project, and Zavidovo project, as well as project assets in Klinsky district, Dmitrovsky district, and Tver region. It also engages in the production and distribution of fabricated homes, as well as provides hotel services. JSC OPIN serves contractors, buyers/sellers of property, tenants, and banks. The company was founded in 2002 and is based in Moscow, the Russian Federation. Public Joint Stock Company \"INGRAD\" operates as a subsidiary of Limited Liability Company Concern ROSSIUM",
    "website": "http://www.opin.ru",
    "zipcode": "123104"
  },
  "LSRG.ME": {
    "city": "Saint Petersburg",
    "country": "Russia",
    "currency": "RUB",
    "exchange": "MCX",
    "industry": "Real Estate - Development",
    "long_name": "PJSC LSR Group",
    "market": "ru_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "LSR GROUP PJSC",
    "state": null,
    "summary": "PJSC LSR Group, together with its subsidiaries, engages in the real estate development, homebuilding, and construction materials businesses. The company operates through Building Materials, Real Estate Development and Construction, and Other segments. It produces and sells bricks, concrete and reinforced concrete items, ready-mix concrete and mortars, aerated concrete blocks, crushed stone products, crushed granite, and land-based and marine-dredged sand extraction products; and provides tower cranes services. The company also develops residential and commercial real estate properties; and offers prefabricated panel construction, contracting, subcontracting, and engineering services in civil and industrial construction. In addition, it provides construction contracting services; and transports construction materials. The company primarily operates in Saint Petersburg, the Leningrad region, Moscow, and Yekaterinburg. PJSC LSR Group was founded in 1993 and is based in Saint Petersburg, Russia.",
    "website": "http://www.lsrgroup.ru",
    "zipcode": "190031"
  },
  "PIKK.ME": {
    "city": "Moscow",
    "country": "Russia",
    "currency": "RUB",
    "exchange": "MCX",
    "industry": "Real Estate - Diversified",
    "long_name": "Public Joint Stock Company PIK-specialized homebuilder",
    "market": "ru_market",
    "market_cap": "Mid Cap",
    "sector": "Real Estate",
    "short_name": "PIK SHB PJSC",
    "state": null,
    "summary": "Public Joint Stock Company PIK-specialized homebuilder develops, constructs, and sells residential real estate properties in Russia. It operates through six segments: Development, Commercial Construction, Maintenance, Industrial, Proptech, and Others. It engages in the construction of residential buildings and areas; production of construction materials, including concrete panels, window frames, and other construction elements; prefabricated panel buildings; and production and sale of IoT-devices. The company also provides maintenance and management of residential buildings and other properties; technical maintenance services for utility systems, and rendering heat, water, and electricity supply services; and internet services, as well as construction services for third party. In addition, it provides apartment rental, repair of premises, and agency services for the sale of residential apartments, as well as implementation of IT solutions. The company was founded in 1994 and is headquartered in Moscow, Russia.",
    "website": "http://www.pik.ru",
    "zipcode": "123242"
  },
  "SMLT.ME": {
    "city": "Moscow",
    "country": "Russia",
    "currency": "RUB",
    "exchange": "MCX",
    "industry": "Real Estate - Development",
    "long_name": "Samolet Group Public Joint Stock Company",
    "market": "ru_market",
    "market_cap": null,
    "sector": "Real Estate",
    "short_name": "SAMOLET GROUP",
    "state": null,
    "summary": "Samolet Group Public Joint Stock Company engages in the real estate development business in the Russian Federation. It develops, constructs, and sells commercial and residential spaces in Moscow and Leningrad Regions. The company was founded in 2012 and is based in Moscow, Russia.",
    "website": "http://samoletgroup.ru",
    "zipcode": "121108"
  },
  "WTCM.ME": {
    "city": "Moscow",
    "country": "Russia",
    "currency": "RUB",
    "exchange": "MCX",
    "industry": "Real Estate Services",
    "long_name": "Joint Stock Company \"World Trade Center Moscow\"",
    "market": "ru_market",
    "market_cap": "Micro Cap",
    "sector": "Real Estate",
    "short_name": "WORLD TRADE CENTER",
    "state": null,
    "summary": "Joint Stock Company \"World Trade Center Moscow\" operates as a multifunctional business complex in Russia. It provides congress, exhibition, office, hotel, and restaurant services. The company also offers events development services, including the planning, development, and organization of corporate and special events; and operates venues for international conventions, forums and conferences, meetings, exhibitions, dance and sports festivals, weddings, private events, team building, fashion shows, and car demonstrations. In addition, it operates Crowne Plaza, a business hotel; Mezhdunarodnaya, an apartment hotel; Erydan apartment blocks; Holiday Inn Express Moscow  Khovrino hotel; and restaurants, cafes, and bars. The company is based in Moscow, Russia.",
    "website": "http://www.wtcmoscow.ru",
    "zipcode": "123610"
  }
}
