{
    "HALS.ME": {
        "short_name": "SG-DEVELOPMENT PJS",
        "long_name": "Public Joint Stock Company SG-Development",
        "summary": "Public Joint Stock Company HALS-Development engages in the development and rental of real estate properties in Russia. The company develops residential and commercial projects. Its projects portfolio includes residential complexes, business quarters, shopping centers, mixed-use complexes, and landmark urban facilities, including Children's Dreamhouse Mall, SkyLight Business Center, and Danilovsky Fort Business Center. The company is based in Moscow, Russia. Public Joint Stock Company HALS-Development is a subsidiary of VTB Bank public joint-stock company.",
        "currency": "RUB",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Moscow"
    },
    "PIKK.ME": {
        "short_name": "PIK GROUP PJSC",
        "long_name": "PIK Group Public Joint Stock Company",
        "summary": "PIK Group Public Joint Stock Company develops, constructs, and sells residential real estate properties in Russia. It operates through six segments: Development, Commercial Construction, Maintenance, Industrial, Proptech, and Others. The company engages in the construction of houses and neighborhoods; production of building materials, including reinforced concrete house panels, window frames, and other construction elements; prefabricated panel buildings; and production and sale of IoT-devices. It also provides maintenance and technical support services for residential buildings and other properties; technical maintenance services for utility systems and rendering heating, water supply, water discharge, and electricity; and internet access services. The company provides apartment rental, repair of premises, and agency services for the sale of residential apartments, as well as construction services for third party. The company was founded in 1994 and is headquartered in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Moscow"
    }
}