{"4LJ.F": {"short_name": "UOB-KAY HIAN  SD-,10", "long_name": "UOB-Kay Hian Holdings Limited", "summary": "UOB-Kay Hian Holdings Limited, an investment holding company, provides various financial services in Singapore, Hong Kong, Thailand, and internationally. It offers corporate finance services ranging from financial advisory and investment banking to underwriting and placement services in primary and secondary listings; and acts as financers and arrangers for principals acquiring strategic stakes in regional listed companies. The company also provides Internet trading, leveraged foreign exchange, wealth management and investment trading, margin financing and trading, stock and futures broking, and structured lending services; and inventory of shares traded on various exchanges, as well as nominee and research, and money lending services. In addition, it offers investment consulting and research services. The company was formerly known as Kay Hian Holdings Ltd. and changed its name to UOB-Kay Hian Holdings Limited in October 2000. UOB-Kay Hian Holdings Limited was incorporated in 2000 and is headquartered in Singapore.", "currency": "EUR", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "FRA", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "5NK.SI": {"short_name": "$ Artivision Tech", "long_name": "Artivision Technologies Ltd.", "summary": "Artivision Technologies Ltd. does not have any significant business operations. Previously, it provided contract manufacturing services for disk drive technology products. Artivision Technologies Ltd. was founded in 2004 and is based in Singapore.", "currency": "SGD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "ABD.L": {"short_name": "ABERDEEN NEW DAWN INVESTMENT TR", "long_name": "Aberdeen New Dawn Investment Trust PLC", "summary": "Aberdeen New Dawn Investment Trust PLC is a closed ended equity mutual fund launched and managed by Aberdeen Fund Managers Limited. The fund is co-managed by Aberdeen Standard Investments (Asia) Limited. It invests in the public equity markets of the Asia Pacific region, excluding Japan. The fund seeks to invest in stocks of companies operating across diversified sectors. It invests in stocks of companies across all market capitalizations. The fund employs fundamental analysis with a bottom-up stock selection approach, focusing on such factors as direct company visits, management, business focus, balance sheet, corporate governance, financial ratios, and peer group business prospects to create its portfolio. It benchmarks the performance of its portfolio against the MSCI All Countries Asia Pacific ex Japan Index. Aberdeen New Dawn Investment Trust plc was formed on May 12, 1989 and is domiciled in the United Kingdom.", "currency": "GBp", "sector": "Financial Services", "industry": "Asset Management", "exchange": "LSE", "market": "gb_market", "country": "Singapore", "city": "Singapore"}, "ASPL": {"short_name": "Aspirational Consumer Lifestyle", "long_name": "Aspirational Consumer Lifestyle Corp.", "summary": "Aspirational Consumer Lifestyle Corp. focuses on effecting a merger, share exchange, asset acquisition, share purchase, reorganization or similar business combination with one or more businesses or entities. The company was founded in 2020 and is based in Singapore.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "NYQ", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "ASPL-UN": {"short_name": "Aspirational Consumer Lifestyle", "long_name": "Aspirational Consumer Lifestyle Corp.", "summary": "Aspirational Consumer Lifestyle Corp. focuses on effecting a merger, share exchange, asset acquisition, share purchase, reorganization or similar business combination with one or more businesses or entities. The company was founded in 2020 and is based in Singapore.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "NYQ", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "ATB.SG": {"short_name": "Artivision Technologies Ltd. Re", "long_name": "Artivision Technologies Ltd.", "summary": "Artivision Technologies Ltd. does not have any significant business operations. Previously, it provided contract manufacturing services for disk drive technology products. Artivision Technologies Ltd. was founded in 2004 and is based in Singapore.", "currency": "EUR", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "STU", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "D05.SI": {"short_name": "DBS", "long_name": "DBS Group Holdings Ltd", "summary": "DBS Group Holdings Ltd provides financial products and services in Singapore, Hong Kong, rest of Greater China, South and Southeast Asia, and internationally. It operates through Consumer Banking/Wealth Management, Institutional Banking, Treasury Markets, and Others segments. The Consumer Banking/Wealth Management segment offers banking and related financial services, including current and savings accounts, fixed deposits, loans and home finance, cards, payments, investment, and insurance products for individual customers. The Institutional Banking segment provides financial services and products for bank and non-bank financial institutions, government-linked companies, large corporates, and small and medium sized businesses. Its products and services comprise short-term working capital financing and specialized lending; cash management, trade finance, and securities and fiduciary services; treasury and markets products; and corporate finance and advisory banking, as well as capital markets solutions. The Treasury Markets segment is involved in structuring, market-making, and trading in a range of treasury products. The Others segment offers Islamic banking services. DBS Group Holdings Ltd was founded in 1968 and is headquartered in Singapore.", "currency": "SGD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "DBSDF": {"short_name": "DBS GROUP HLDGS LTD", "long_name": "DBS Group Holdings Ltd", "summary": "DBS Group Holdings Ltd provides financial products and services in Singapore, Hong Kong, rest of Greater China, South and Southeast Asia, and internationally. It operates through Consumer Banking/Wealth Management, Institutional Banking, Treasury Markets, and Others segments. The Consumer Banking/Wealth Management segment offers banking and related financial services, including current and savings accounts, fixed deposits, loans and home finance, cards, payments, investment, and insurance products for individual customers. The Institutional Banking segment provides financial services and products for bank and non-bank financial institutions, government-linked companies, large corporates, and small and medium sized businesses. Its products and services comprise short-term working capital financing and specialized lending; cash management, trade finance, and securities and fiduciary services; treasury and markets products; and corporate finance and advisory banking, as well as capital markets solutions. The Treasury Markets segment is involved in structuring, market-making, and trading in a range of treasury products. The Others segment offers Islamic banking services. DBS Group Holdings Ltd was founded in 1968 and is headquartered in Singapore.", "currency": "USD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "PNK", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "DBSDY": {"short_name": "DBS GROUP HLDGS LTD", "long_name": "DBS Group Holdings Ltd", "summary": "DBS Group Holdings Ltd provides financial products and services in Singapore, Hong Kong, rest of Greater China, South and Southeast Asia, and internationally. It operates through Consumer Banking/Wealth Management, Institutional Banking, Treasury Markets, and Others segments. The Consumer Banking/Wealth Management segment offers banking and related financial services, including current and savings accounts, fixed deposits, loans and home finance, cards, payments, investment, and insurance products for individual customers. The Institutional Banking segment provides financial services and products for bank and non-bank financial institutions, government-linked companies, large corporates, and small and medium sized businesses. Its products and services comprise short-term working capital financing and specialized lending; cash management, trade finance, and securities and fiduciary services; treasury and markets products; and corporate finance and advisory banking, as well as capital markets solutions. The Treasury Markets segment is involved in structuring, market-making, and trading in a range of treasury products. The Others segment offers Islamic banking services. DBS Group Holdings Ltd was founded in 1968 and is headquartered in Singapore.", "currency": "USD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "PNK", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "DEVL.F": {"short_name": "DBS GRP HLDGS  SD 1", "long_name": "DBS Group Holdings Ltd", "summary": "DBS Group Holdings Ltd provides financial products and services in Singapore, Hong Kong, rest of Greater China, South and Southeast Asia, and internationally. It operates through Consumer Banking/Wealth Management, Institutional Banking, Treasury Markets, and Others segments. The Consumer Banking/Wealth Management segment offers banking and related financial services, including current and savings accounts, fixed deposits, loans and home finance, cards, payments, investment, and insurance products for individual customers. The Institutional Banking segment provides financial services and products for bank and non-bank financial institutions, government-linked companies, large corporates, and small and medium sized businesses. Its products and services comprise short-term working capital financing and specialized lending; cash management, trade finance, and securities and fiduciary services; treasury and markets products; and corporate finance and advisory banking, as well as capital markets solutions. The Treasury Markets segment is involved in structuring, market-making, and trading in a range of treasury products. The Others segment offers Islamic banking services. DBS Group Holdings Ltd was founded in 1968 and is headquartered in Singapore.", "currency": "EUR", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "FRA", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "EMF": {"short_name": "Templeton Emerging Markets Fund", "long_name": "Templeton Emerging Markets Fund", "summary": "Templeton Emerging Markets Fund is a closed-ended equity mutual fund launched by Franklin Resources Inc. The fund is managed by Templeton Asset Management Ltd. It invests in the public equity markets of emerging market countries across the globe. The fund seeks to invest in stocks of companies operating across diversified sectors. It primarily invests in value stocks of companies. The fund employs fundamental analysis with a focus on such factors as long-term earnings, asset value, and cash flow potential to create its portfolio. It benchmarks the performance of its portfolio against the MSCI Emerging Markets Index. Templeton Emerging Markets Fund was formed on February 26, 1987 and is domiciled in the United States.", "currency": "USD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "NYQ", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "FAX": {"short_name": "592314", "long_name": "Aberdeen Asia-Pacific Income Fund, Inc.", "summary": "Aberdeen Asia-Pacific Income Fund, Inc. is a close ended fixed income mutual fund launched and managed by Aberdeen Standard Investments (Asia) Limited. It is co-managed by Aberdeen Standard Investments Australia Limited and Aberdeen Asset Managers Limited. The fund invests in fixed income markets of Asia, Australia, and New Zeland. It primarily invests in debt securities issued by governmental entities, banks, companies, and other entities. Aberdeen Asia-Pacific Income Fund, Inc. was formed on March 14, 1986 and is domiciled in the United States.", "currency": "USD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "NYQ", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "G41.SI": {"short_name": "G K Goh", "long_name": "G. K. Goh Holdings Limited", "summary": "G. K. Goh Holdings Limited, an investment holding company, provides corporate services in Singapore, Australia, Malaysia, Hong Kong, and China. The company offers share registry, corporate secretarial work, accounting, tax and payroll, governance, risk and compliance, and employee share plan management services; and management consultancy services. It also provides residential aged care and healthcare related services; and operates nursing homes. The company was founded in 1979 and is based in Singapore. G. K. Goh Holdings Limited is a subsidiary of GKG Investment Holdings Pte Ltd.", "currency": "SGD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "GEHDY": {"short_name": "GREAT EASTERN HLDGS LTD", "long_name": "Great Eastern Holdings Limited", "summary": "Great Eastern Holdings Limited, an investment holding company, provides insurance products in Singapore, Malaysia, and other Asian countries. It operates through Life Insurance, Non-Life Insurance, and Shareholders segments. The Life Insurance segment offers life, long-term health and accident, annuity, and unit-linked insurance products. The Non-Life Insurance segment provides short term property and casualty products, including fire or burglary insurance contracts and/or business interruption contracts, and public liability insurance contracts; and short term medical and personal accident non-life insurance contracts. The Shareholders segment offers fund management services for absolute return/balanced mandates; and manages various products, such as the Asia Pacific equities, and Asian and global fixed income securities portfolios for Singapore statutory boards, government-linked corporations, public and private companies, insurance companies, and charity organizations. Great Eastern Holdings Limited is also involved in composite insurance, asset management, property investment, family Takaful business, and funds activities. The company was founded in 1908 and is headquartered in Singapore. Great Eastern Holdings Limited operates as a subsidiary of Oversea-Chinese Banking Corporation Limited.", "currency": "USD", "sector": "Financial Services", "industry": "Insurance—Diversified", "exchange": "PNK", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "I49.SI": {"short_name": "IFS Capital", "long_name": "IFS Capital Limited", "summary": "IFS Capital Limited, together with its subsidiaries, provides commercial, alternative, and structured finance services in Singapore and Southeast Asia. It operates through three segments: Credit Financing, Insurance, and Other Investments. The company offers factoring, accounts receivable financing, trade financing, mortgage financing, working capital, financing for overseas operations, asset-based and direct financing, operating leasing and consumer financing, and hire purchase services; and participates in financing by SPRING under Local Enterprise Finance scheme, as well as in financing by International Enterprise Singapore under Internationalization Finance scheme. It also provides credit insurance facilities to Singapore exporters; and issues performance bonds and guarantees, domestic maid insurance, property and casualty insurance, marine cargo and motor insurance, political risks and contractors' all risks insurance, engineering insurance, and work injury compensation insurance, as well as holds equity securities and bonds under the regulated insurance fund. In addition, the company is involved in the provision of development capital in the form of convertible debt instruments, and direct private equity investments, as well as venture capital investment activities. The company was founded in 1975 and is based in Singapore. IFS Capital Limited is a subsidiary of Phillip Assets Pte. Ltd.", "currency": "SGD", "sector": "Financial Services", "industry": "Credit Services", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "IFN": {"short_name": "India Fund, Inc. (The)", "long_name": "The India Fund, Inc.", "summary": "The India Fund, Inc. is a close ended equity mutual fund launched and managed by Aberdeen Standard Investments (Asia) Limited. The fund invests in public equity markets of India. It seeks to invest in stocks of small-cap, mid-cap, and large-cap companies. The fund employs a quantitative and fundamental analysis with a bottom-up stock picking and asset allocation approach to create its portfolio. It benchmarks the performance of its portfolio against the IFC Investable India Index. The India Fund, Inc. was formed on December 27, 1993 and is domiciled in the Singapore.", "currency": "USD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "NYQ", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "IVAN-UN": {"short_name": "Ivanhoe Capital Acquisition Cor", "long_name": "Ivanhoe Capital Acquisition Corp.", "summary": "Ivanhoe Capital Acquisition Corp. focuses on effecting a merger, share exchange, asset acquisition, share purchase, reorganization, or other business combination with one or more businesses. The company was founded in 2020 and is based in Singapore.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "NYQ", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "IZB.F": {"short_name": "UTD. OVERS. INSUR.  SD 1", "long_name": "United Overseas Insurance Limited", "summary": "United Overseas Insurance Limited underwrites general insurance products in Singapore, ASEAN countries, and internationally. It offers personal insurance products that include travel, personal accident, home protection, foreign domestic worker, and motor insurance products. The company provides commercial general insurance products, such as fire, business interruption, machinery/equipment all risks, burglary and theft, money, marine cargo, fidelity guarantee, plate glass, public liability, work injury compensation, and group personal accident insurance products. It also offers directors' and officers' insurance; contractors' all risks/erection all risks insurance; and Takaful, an Islamic financial assurance to address misfortunes, accidents, or disasters. The company was founded in 1971 and is based in Singapore. United Overseas Insurance Limited is a subsidiary of United Overseas Bank Limited.", "currency": "EUR", "sector": "Financial Services", "industry": "Insurance—Property & Casualty", "exchange": "FRA", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "JEQ": {"short_name": "Aberdeen Japan Equity Fund, Inc", "long_name": "Aberdeen Japan Equity Fund, Inc.", "summary": "Aberdeen Japan Equity Fund, Inc. is a close ended equity mutual fund launched and managed by Aberdeen Standard Investments (Asia) Limited. It invests in the public equity markets of Japan. The fund invests in stocks of companies operating across diversified sectors. It employs quantitative analysis to build its portfolio. The fund employs a quantitative analysis to create its portfolio. It benchmarks the performance of its portfolio against the TOPIX Index. The fund was previously known as Japan Equity Fund, Inc. Aberdeen Japan Equity Fund, Inc. was formed on July 12, 1990 and is domiciled in the United States.", "currency": "USD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "NYQ", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "OCBA.F": {"short_name": "OVERS.-CHINESE  SD-,50", "long_name": "Oversea-Chinese Banking Corporation Limited", "summary": "Oversea-Chinese Banking Corporation Limited provides financial services in Singapore, Malaysia, Indonesia, Greater China, other parts of the Asia Pacific, and internationally. The company's Global Consumer/Private Banking segment provides products and services to individual customers, including checking accounts, and savings and fixed deposits; housing and other personal loans; credit cards; wealth management products consisting of unit trusts, banc assurance products, and structured deposits; and brokerage services. This segment also offers investment advice and portfolio management, estate and trust planning, and wealth structuring services for high net worth individuals. Its Global Corporate/Investment Banking segment provides project financing, overdrafts, trade financing, and deposit accounts; fee-based services, such as cash management and custodian services; investment banking services, including financing solutions, syndicated loans and advisory services, corporate finance services for initial public offerings, secondary fund-raising, and takeovers and mergers; and customized and structured equity-linked financing services. This segment serves corporates, public sector, and small and medium enterprises. The company's Global Treasury and Markets segment is involved in the foreign exchange activities, money market operations, and fixed income and derivatives trading, as well as provision of structured treasury products and financial solutions. Its OCBC Wing Hang segment offers commercial banking, consumer financing, share brokerage, and insurance services. The company's Insurance segment provides fund management services, and life and general insurance products. Its Others segment is involved in property and investment holding activities. The company has approximately 540 branches and representative offices in 19 countries and regions. Oversea-Chinese Banking Corporation Limited was founded in 1912 and is headquartered in Singapore.", "currency": "EUR", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "FRA", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "OCBB.F": {"short_name": "OVERSEA-CHIN.UNSP.ADR/2", "long_name": "Oversea-Chinese Banking Corporation Limited", "summary": "Oversea-Chinese Banking Corporation Limited provides financial services in Singapore, Malaysia, Indonesia, Greater China, other parts of the Asia Pacific, and internationally. The company's Global Consumer/Private Banking segment provides products and services to individual customers, including checking accounts, and savings and fixed deposits; housing and other personal loans; credit cards; wealth management products consisting of unit trusts, banc assurance products, and structured deposits; and brokerage services. This segment also offers investment advice and portfolio management, estate and trust planning, and wealth structuring services for high net worth individuals. Its Global Corporate/Investment Banking segment provides project financing, overdrafts, trade financing, and deposit accounts; fee-based services, such as cash management and custodian services; investment banking services, including financing solutions, syndicated loans and advisory services, corporate finance services for initial public offerings, secondary fund-raising, and takeovers and mergers; and customized and structured equity-linked financing services. This segment serves corporates, public sector, and small and medium enterprises. The company's Global Treasury and Markets segment is involved in the foreign exchange activities, money market operations, and fixed income and derivatives trading, as well as provision of structured treasury products and financial solutions. Its OCBC Wing Hang segment offers commercial banking, consumer financing, share brokerage, and insurance services. The company's Insurance segment provides fund management services, and life and general insurance products. Its Others segment is involved in property and investment holding activities. The company has approximately 540 branches and representative offices in 19 countries and regions. Oversea-Chinese Banking Corporation Limited was founded in 1912 and is headquartered in Singapore.", "currency": "EUR", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "FRA", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "OVCHF": {"short_name": "OVERSEA-CHINESE BANKING CORP", "long_name": "Oversea-Chinese Banking Corporation Limited", "summary": "Oversea-Chinese Banking Corporation Limited provides financial services in Singapore, Malaysia, Indonesia, Greater China, other parts of the Asia Pacific, and internationally. The company's Global Consumer/Private Banking segment provides products and services to individual customers, including checking accounts, and savings and fixed deposits; housing and other personal loans; credit cards; wealth management products consisting of unit trusts, banc assurance products, and structured deposits; and brokerage services. This segment also offers investment advice and portfolio management, estate and trust planning, and wealth structuring services for high net worth individuals. Its Global Corporate/Investment Banking segment provides project financing, overdrafts, trade financing, and deposit accounts; fee-based services, such as cash management and custodian services; investment banking services, including financing solutions, syndicated loans and advisory services, corporate finance services for initial public offerings, secondary fund-raising, and takeovers and mergers; and customized and structured equity-linked financing services. This segment serves corporates, public sector, and small and medium enterprises. The company's Global Treasury and Markets segment is involved in the foreign exchange activities, money market operations, and fixed income and derivatives trading, as well as provision of structured treasury products and financial solutions. Its OCBC Wing Hang segment offers commercial banking, consumer financing, share brokerage, and insurance services. The company's Insurance segment provides fund management services, and life and general insurance products. Its Others segment is involved in property and investment holding activities. The company has approximately 540 branches and representative offices in 19 countries and regions. Oversea-Chinese Banking Corporation Limited was founded in 1912 and is headquartered in Singapore.", "currency": "USD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "PNK", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "OVCHY": {"short_name": "OVERSEA-CHINESE BANKING CORP", "long_name": "Oversea-Chinese Banking Corporation Limited", "summary": "Oversea-Chinese Banking Corporation Limited provides financial services in Singapore, Malaysia, Indonesia, Greater China, other parts of the Asia Pacific, and internationally. The company's Global Consumer/Private Banking segment provides products and services to individual customers, including checking accounts, and savings and fixed deposits; housing and other personal loans; credit cards; wealth management products consisting of unit trusts, banc assurance products, and structured deposits; and brokerage services. This segment also offers investment advice and portfolio management, estate and trust planning, and wealth structuring services for high net worth individuals. Its Global Corporate/Investment Banking segment provides project financing, overdrafts, trade financing, and deposit accounts; fee-based services, such as cash management and custodian services; investment banking services, including financing solutions, syndicated loans and advisory services, corporate finance services for initial public offerings, secondary fund-raising, and takeovers and mergers; and customized and structured equity-linked financing services. This segment serves corporates, public sector, and small and medium enterprises. The company's Global Treasury and Markets segment is involved in the foreign exchange activities, money market operations, and fixed income and derivatives trading, as well as provision of structured treasury products and financial solutions. Its OCBC Wing Hang segment offers commercial banking, consumer financing, share brokerage, and insurance services. The company's Insurance segment provides fund management services, and life and general insurance products. Its Others segment is involved in property and investment holding activities. The company has approximately 540 branches and representative offices in 19 countries and regions. Oversea-Chinese Banking Corporation Limited was founded in 1912 and is headquartered in Singapore.", "currency": "USD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "PNK", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "PFQ.F": {"short_name": "PAC.CENT.REG.D.-LOC.SD-10", "long_name": "Pacific Century Regional Developments Limited", "summary": "Pacific Century Regional Developments Limited, an investment holding company, provides business management and consultancy services. It holds interests in the telecommunications, media, IT solutions, logistics, and property development and investment businesses in the Asia-Pacific region. The company was formerly known as Seapower Asia Investments Limited and changed its name to Pacific Century Regional Developments Limited in November 1994. The company was incorporated in 1963 and is headquartered in Singapore. Pacific Century Regional Developments Limited is a subsidiary of Pacific Century Group (Cayman Islands) Limited.", "currency": "EUR", "sector": "Financial Services", "industry": "Asset Management", "exchange": "FRA", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "S41.SI": {"short_name": "Hong Leong Fin", "long_name": "Hong Leong Finance Limited", "summary": "Hong Leong Finance Limited provides various financial services for business enterprises and retail customers in Singapore. It accepts savings and business current accounts, as well as fixed deposits. The company also offers new and used car, home, and private housing loans, as well as mortgage equity and share financing services. In addition, it provides small and medium enterprise (SME) loans, including accounts receivable financing, equipment loans, HDB SME loans, hire purchase, loan insurance schemes, medical asset financing, property development loans, SME care programmes, SME property loans, suppliers' invoice financing/letters of credit, and term loans/credit lines, as well as enterprise finance schemes, such as SME fixed assets, SME working capital, and trade schemes. Further, the company offers corporate finance services, including issuing management and sponsoring services; corporate advisory services in the areas of financial advisory, independent financial advisory, mergers and acquisitions, and restructuring; and Equity Fund Raising services, such as initial public offering, secondary fund raising, and underwriting of shares. It operates through a network of 28 branches and 12 SME centers. The company was founded in 1961 and is based in Singapore.", "currency": "SGD", "sector": "Financial Services", "industry": "Credit Services", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "SCPE": {"short_name": "SC Health Corporation", "long_name": "SC Health Corporation", "summary": "SC Health Corporation focuses on effecting a merger, share exchange, asset acquisition, share purchase, reorganization, or related business combination with one or more businesses. The company was founded in 2018 and is based in Singapore.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "NYQ", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "SCPE-UN": {"short_name": "SC Health Corporation", "long_name": "SC Health Corporation", "summary": "SC Health Corporation focuses on effecting a merger, share exchange, asset acquisition, share purchase, reorganization, or related business combination with one or more businesses. The company was founded in 2018 and is based in Singapore.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "NYQ", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "SOUU.F": {"short_name": "SINGAPORE EX.UNSP.ADR/15", "long_name": "Singapore Exchange Limited", "summary": "Singapore Exchange Limited, together with its subsidiaries, operates an integrated securities exchange and derivatives exchange, and related clearing houses in Singapore.  The company's Fixed Income, Currencies, and Commodities segment offers fixed income issuer, trading and clearing, and collateral management services. Its Equities segment provides issuer, securities trading and clearing, securities settlement and depository management, derivatives trading and clearing, and collateral management services. The company's Data, Connectivity, and Indices segment offers market data, connectivity, and indices services. It also provides counterparty guarantee, and depository and related services for securities and derivatives transactions; bond trading services; front-line regulatory functions; computer and software maintenance; and management consultancy services for index activities. In addition, the company offers membership and management services to related corporations; distributes bulk freight market indices and information; and operates an electricity market, as well as provides administration services for index calculation, risk analyses, and financial research. The company has an agreement in relation to a global partnership to grow New Zealand's Exchange's dairy derivatives market together. Singapore Exchange Limited was incorporated in 1999 and is headquartered in Singapore.", "currency": "EUR", "sector": "Financial Services", "industry": "Financial Data & Stock Exchanges", "exchange": "FRA", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "SPXCF": {"short_name": "SINGAPORE EXCHANGE", "long_name": "Singapore Exchange Limited", "summary": "Singapore Exchange Limited, together with its subsidiaries, operates an integrated securities exchange and derivatives exchange, and related clearing houses in Singapore.  The company's Fixed Income, Currencies, and Commodities segment offers fixed income issuer, trading and clearing, and collateral management services. Its Equities segment provides issuer, securities trading and clearing, securities settlement and depository management, derivatives trading and clearing, and collateral management services. The company's Data, Connectivity, and Indices segment offers market data, connectivity, and indices services. It also provides counterparty guarantee, and depository and related services for securities and derivatives transactions; bond trading services; front-line regulatory functions; computer and software maintenance; and management consultancy services for index activities. In addition, the company offers membership and management services to related corporations; distributes bulk freight market indices and information; and operates an electricity market, as well as provides administration services for index calculation, risk analyses, and financial research. The company has an agreement in relation to a global partnership to grow New Zealand's Exchange's dairy derivatives market together. Singapore Exchange Limited was incorporated in 1999 and is headquartered in Singapore.", "currency": "USD", "sector": "Financial Services", "industry": "Financial Data & Stock Exchanges", "exchange": "PNK", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "SPXCY": {"short_name": "SINGAPORE EXCHANGE", "long_name": "Singapore Exchange Limited", "summary": "Singapore Exchange Limited, together with its subsidiaries, operates an integrated securities exchange and derivatives exchange, and related clearing houses in Singapore.  The company's Fixed Income, Currencies, and Commodities segment offers fixed income issuer, trading and clearing, and collateral management services. Its Equities segment provides issuer, securities trading and clearing, securities settlement and depository management, derivatives trading and clearing, and collateral management services. The company's Data, Connectivity, and Indices segment offers market data, connectivity, and indices services. It also provides counterparty guarantee, and depository and related services for securities and derivatives transactions; bond trading services; front-line regulatory functions; computer and software maintenance; and management consultancy services for index activities. In addition, the company offers membership and management services to related corporations; distributes bulk freight market indices and information; and operates an electricity market, as well as provides administration services for index calculation, risk analyses, and financial research. The company has an agreement in relation to a global partnership to grow New Zealand's Exchange's dairy derivatives market together. Singapore Exchange Limited was incorporated in 1999 and is headquartered in Singapore.", "currency": "USD", "sector": "Financial Services", "industry": "Financial Data & Stock Exchanges", "exchange": "PNK", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "TCU.SI": {"short_name": "CreditBureauAsia", "long_name": "Credit Bureau Asia Limited", "summary": "Credit Bureau Asia Limited, an investment holding company, provides credit and risk information solutions. The company offers credit and risk information reports, credit scores, monitoring services, data trends and analytics, and client-specific tailored solutions. It operates in two segments, Financial Institution Data Business (FI Data Business) and Non-Financial Institution Data Business (Non-FI Data Business). The FI Data Business segment provides credit reporting, data analytics, and customer and portfolio monitoring services, as well as customized solutions and products. The Non-FI Data Business segment offers risk management, sales and marketing solutions, receivables management, and business education services. The company serves banks, financial institutions, multinational corporations, telecommunication companies, government bodies and public agencies, local enterprises, and individuals in Singapore, Malaysia, Cambodia, and Myanmar. Credit Bureau Asia Limited was founded in 1993 and is based in Singapore.", "currency": "SGD", "sector": "Financial Services", "industry": "Financial Data & Stock Exchanges", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "TDF": {"short_name": "Templeton Dragon Fund, Inc.", "long_name": "Templeton Dragon Fund, Inc.", "summary": "Templeton Dragon Fund, Inc. is a closed ended equity mutual fund launched by Franklin Resources, Inc. The fund is managed by Templeton Asset Management Ltd. It invests in the public equity markets of China. The fund seeks to invest in stocks of companies operating across diversified sectors. It primarily invests in value stocks of companies. The fund employs fundamental analysis focusing on factors like growth prospects, competitive positions in export markets, technologies, research and development, productivity, labor costs, raw material costs and sources, profit margins, returns on investment, capital resources, government regulation, and management to create its portfolio. It is actively managed. Templeton Dragon Fund, Inc. was formed on September 20, 1994 and is domiciled in the United States.", "currency": "USD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "NYQ", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "TINV": {"short_name": "Tiga Acquisition Corp.", "long_name": "Tiga Acquisition Corp.", "summary": "Tiga Acquisition Corp., a blank check company, incorporated for the purpose of effecting a merger, share exchange, asset acquisition, share purchase, reorganization, and business combination. The company was incorporated in 2020 and is based in Singapore.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "NYQ", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "TINV-UN": {"short_name": "Tiga Acquisition Corp.", "long_name": "Tiga Acquisition Corp.", "summary": "Tiga Acquisition Corp., a blank check company, incorporated for the purpose of effecting a merger, share exchange, asset acquisition, share purchase, reorganization, and business combination. The company was incorporated in 2020 and is based in Singapore.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "NYQ", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "U10.SI": {"short_name": "UOB Kay Hian", "long_name": "UOB-Kay Hian Holdings Limited", "summary": "UOB-Kay Hian Holdings Limited, an investment holding company, provides various financial services in Singapore, Hong Kong, Thailand, and internationally. It offers corporate finance services ranging from financial advisory and investment banking to underwriting and placement services in primary and secondary listings; and acts as financers and arrangers for principals acquiring strategic stakes in regional listed companies. The company also provides Internet trading, leveraged foreign exchange, wealth management and investment trading, margin financing and trading, stock and futures broking, and structured lending services; and inventory of shares traded on various exchanges, as well as nominee and research, and money lending services. In addition, it offers investment consulting and research services. The company was formerly known as Kay Hian Holdings Ltd. and changed its name to UOB-Kay Hian Holdings Limited in October 2000. UOB-Kay Hian Holdings Limited was incorporated in 2000 and is headquartered in Singapore.", "currency": "SGD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "UOB.F": {"short_name": "UTD OV. BK  SD 1", "long_name": "United Overseas Bank Limited", "summary": "United Overseas Bank Limited, together with its subsidiaries, provides banking products and services. The company's Group Retail segment provides deposits, insurance, card, wealth management, investment, and loan and trade financing products for personal and small enterprise customers. Its Group Wholesale Banking segment provides financing, trade services, cash management, capital markets solutions, and advisory and treasury products for medium and large enterprises, local corporations, multi-national corporations, financial institutions, government-linked entities, and financial sponsors. The company's Global Markets segment offers foreign exchange, interest rate, credit, commodities, equities, and structured investment products; and manages funding and liquidity. Its Other segment provides investment management, property, and insurance services. The company also provides mobile and internet banking services. The company operates through a network of approximately 500 branches, including wealth and privilege banking centres, private bank suites, business and commercial banking centres, and offices in 19 countries and territories in the Asia Pacific, Europe, and North America; and 1.3 million automated teller machines. It also provides management consultancy services, as well as technical support, development and implementation of software, and other data processing services. The company was formerly known as United Chinese Bank and changed its name to United Overseas Bank Limited in 1965. United Overseas Bank Limited was founded in 1935 and is headquartered in Singapore.", "currency": "EUR", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "FRA", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "UOVEF": {"short_name": "UNITED OVERSEAS BANK LTD", "long_name": "United Overseas Bank Limited", "summary": "United Overseas Bank Limited, together with its subsidiaries, provides banking products and services. The company's Group Retail segment provides deposits, insurance, card, wealth management, investment, and loan and trade financing products for personal and small enterprise customers. Its Group Wholesale Banking segment provides financing, trade services, cash management, capital markets solutions, and advisory and treasury products for medium and large enterprises, local corporations, multi-national corporations, financial institutions, government-linked entities, and financial sponsors. The company's Global Markets segment offers foreign exchange, interest rate, credit, commodities, equities, and structured investment products; and manages funding and liquidity. Its Other segment provides investment management, property, and insurance services. The company also provides mobile and internet banking services. The company operates through a network of approximately 500 branches, including wealth and privilege banking centres, private bank suites, business and commercial banking centres, and offices in 19 countries and territories in the Asia Pacific, Europe, and North America; and 1.3 million automated teller machines. It also provides management consultancy services, as well as technical support, development and implementation of software, and other data processing services. The company was formerly known as United Chinese Bank and changed its name to United Overseas Bank Limited in 1965. United Overseas Bank Limited was founded in 1935 and is headquartered in Singapore.", "currency": "USD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "PNK", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "UOVEY": {"short_name": "UNITED OVERSEAS BANK LTD", "long_name": "United Overseas Bank Limited", "summary": "United Overseas Bank Limited, together with its subsidiaries, provides banking products and services. The company's Group Retail segment provides deposits, insurance, card, wealth management, investment, and loan and trade financing products for personal and small enterprise customers. Its Group Wholesale Banking segment provides financing, trade services, cash management, capital markets solutions, and advisory and treasury products for medium and large enterprises, local corporations, multi-national corporations, financial institutions, government-linked entities, and financial sponsors. The company's Global Markets segment offers foreign exchange, interest rate, credit, commodities, equities, and structured investment products; and manages funding and liquidity. Its Other segment provides investment management, property, and insurance services. The company also provides mobile and internet banking services. The company operates through a network of approximately 500 branches, including wealth and privilege banking centres, private bank suites, business and commercial banking centres, and offices in 19 countries and territories in the Asia Pacific, Europe, and North America; and 1.3 million automated teller machines. It also provides management consultancy services, as well as technical support, development and implementation of software, and other data processing services. The company was formerly known as United Chinese Bank and changed its name to United Overseas Bank Limited in 1965. United Overseas Bank Limited was founded in 1935 and is headquartered in Singapore.", "currency": "USD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "PNK", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "VCKAU": {"short_name": "Vickers Vantage Corp. I", "long_name": "Vickers Vantage Corp. I", "summary": "Vickers Vantage Corp. I intends to acquire assets and businesses through a merger, share exchange, share purchase, recapitalization, reorganization, or similar business combination. The company was founded in 2020 and is based in Singapore.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "NCM", "market": "us_market", "country": "Singapore", "city": "Singapore"}}