{
    "ABD.L": {
        "short_name": "ABERDEEN NEW DAWN INVESTMENT TR",
        "long_name": "Aberdeen New Dawn Investment Trust PLC",
        "summary": "Aberdeen New Dawn Investment Trust PLC is a closed ended equity mutual fund launched and managed by Aberdeen Fund Managers Limited. The fund is co-managed by Aberdeen Standard Investments (Asia) Limited. It invests in the public equity markets of the Asia Pacific region, excluding Japan. The fund seeks to invest in stocks of companies operating across diversified sectors. It invests in stocks of companies across all market capitalizations. The fund employs fundamental analysis with a bottom-up stock selection approach, focusing on such factors as direct company visits, management, business focus, balance sheet, corporate governance, financial ratios, and peer group business prospects to create its portfolio. It benchmarks the performance of its portfolio against the MSCI All Countries Asia Pacific ex Japan Index. Aberdeen New Dawn Investment Trust plc was formed on May 12, 1989 and is domiciled in the United Kingdom.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "EMF": {
        "short_name": "Templeton Emerging Markets Fund",
        "long_name": "Templeton Emerging Markets Fund",
        "summary": "Templeton Emerging Markets Fund is a closed-ended equity mutual fund launched by Franklin Resources Inc. The fund is managed by Templeton Asset Management Ltd. It invests in the public equity markets of emerging market countries across the globe. The fund seeks to invest in stocks of companies operating across diversified sectors. It primarily invests in value stocks of companies. The fund employs fundamental analysis with a focus on such factors as long-term earnings, asset value, and cash flow potential to create its portfolio. It benchmarks the performance of its portfolio against the MSCI Emerging Markets Index. Templeton Emerging Markets Fund was formed on February 26, 1987 and is domiciled in the United States.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "FAX": {
        "short_name": "592314",
        "long_name": "Aberdeen Asia-Pacific Income Fund, Inc.",
        "summary": "Aberdeen Asia-Pacific Income Fund, Inc. is a close ended fixed income mutual fund launched and managed by Aberdeen Standard Investments (Asia) Limited. It is co-managed by Aberdeen Standard Investments Australia Limited and Aberdeen Asset Managers Limited. The fund invests in fixed income markets of Asia, Australia, and New Zeland. It primarily invests in debt securities issued by governmental entities, banks, companies, and other entities. Aberdeen Asia-Pacific Income Fund, Inc. was formed on March 14, 1986 and is domiciled in the United States.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "IFN": {
        "short_name": "India Fund, Inc. (The)",
        "long_name": "The India Fund, Inc.",
        "summary": "The India Fund, Inc. is a close ended equity mutual fund launched and managed by Aberdeen Standard Investments (Asia) Limited. The fund invests in public equity markets of India. It seeks to invest in stocks of small-cap, mid-cap, and large-cap companies. The fund employs a quantitative and fundamental analysis with a bottom-up stock picking and asset allocation approach to create its portfolio. It benchmarks the performance of its portfolio against the IFC Investable India Index. The India Fund, Inc. was formed on December 27, 1993 and is domiciled in the Singapore.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "JEQ": {
        "short_name": "Aberdeen Japan Equity Fund, Inc",
        "long_name": "Aberdeen Japan Equity Fund, Inc.",
        "summary": "Aberdeen Japan Equity Fund, Inc. is a close ended equity mutual fund launched and managed by Aberdeen Standard Investments (Asia) Limited. It invests in the public equity markets of Japan. The fund invests in stocks of companies operating across diversified sectors. It employs quantitative analysis to build its portfolio. The fund employs a quantitative analysis to create its portfolio. It benchmarks the performance of its portfolio against the TOPIX Index. The fund was previously known as Japan Equity Fund, Inc. Aberdeen Japan Equity Fund, Inc. was formed on July 12, 1990 and is domiciled in the United States.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "PFQ.F": {
        "short_name": "PAC.CENT.REG.D.-LOC.SD-10",
        "long_name": "Pacific Century Regional Developments Limited",
        "summary": "Pacific Century Regional Developments Limited, an investment holding company, provides business management and consultancy services. It holds interests in the telecommunications, media, IT solutions, logistics, and property development and investment businesses in the Asia-Pacific region. The company was formerly known as Seapower Asia Investments Limited and changed its name to Pacific Century Regional Developments Limited in November 1994. The company was incorporated in 1963 and is headquartered in Singapore. Pacific Century Regional Developments Limited is a subsidiary of Pacific Century Group (Cayman Islands) Limited.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "TDF": {
        "short_name": "Templeton Dragon Fund, Inc.",
        "long_name": "Templeton Dragon Fund, Inc.",
        "summary": "Templeton Dragon Fund, Inc. is a closed ended equity mutual fund launched by Franklin Resources, Inc. The fund is managed by Templeton Asset Management Ltd. It invests in the public equity markets of China. The fund seeks to invest in stocks of companies operating across diversified sectors. It primarily invests in value stocks of companies. The fund employs fundamental analysis focusing on factors like growth prospects, competitive positions in export markets, technologies, research and development, productivity, labor costs, raw material costs and sources, profit margins, returns on investment, capital resources, government regulation, and management to create its portfolio. It is actively managed. Templeton Dragon Fund, Inc. was formed on September 20, 1994 and is domiciled in the United States.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    }
}