{"A41.F": {"short_name": "ADDUS HOMECARE CP.DL-,001", "long_name": "Addus HomeCare Corporation", "summary": "Addus HomeCare Corporation provides personal care services to elderly, chronically ill, disabled persons, and individuals who are at risk of hospitalization or institutionalization in the United States. It operates in three segments: Personal Care, Hospice, and Home Health. The Personal Care segment provides non-medical assistance with activities of daily living. This segment's services include assistance with bathing, grooming, oral care, feeding and dressing, medication reminders, meal planning and preparation, housekeeping, and transportation services. The Hospice segment provides palliative nursing care, social work, spiritual counseling, homemaker, and bereavement counseling services for people who are terminally ill, as well as related services for their families. The Home Health segment offers skilled nursing and physical, occupational, and speech therapy for the individuals who requires assistance during an illness or after hospitalization. The company's payor clients include federal, state, and local governmental agencies; managed care organizations; commercial insurers; and private individuals. As of June 30, 2020, the company served consumers through 190 offices located in 25 states. Addus HomeCare Corporation was founded in 1979 and is based in Frisco, Texas.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Frisco"}, "ACGI": {"short_name": "AMACORE GROUP INC", "long_name": "The Amacore Group, Inc.", "summary": "The Amacore Group, Inc. provides and markets healthcare-related membership products for individuals and families. Its products include limited and major medical insurance programs, supplemental medical insurance, and discount dental and vision programs. The company also provides and markets lifestyle membership programs, including insurance discounts, discount benefit savings, ID theft, legal counsel, credit management, automotive warranties, employment protection, and a host of others. The company serves insurance carriers, financial institutions, affiliate marketers, direct marketers, insurance agents, and fortune 500 companies. It distributes its products and services through various distribution methods, such as its agent network, inbound call center, in-house sales representatives, network marketing, and affinity marketing partners, as well as through third-party direct response marketers. The Amacore Group, Inc. was formerly known as Eye Care International Inc. and changed its name to The Amacore Group, Inc. in April 2005. The company was founded in 1993 and is based in Maitland, Florida.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Maitland"}, "ACHC": {"short_name": "Acadia Healthcare Company, Inc.", "long_name": "Acadia Healthcare Company, Inc.", "summary": "Acadia Healthcare Company, Inc. develops and operates inpatient psychiatric facilities, residential treatment centers, group homes, substance abuse facilities, and outpatient behavioral healthcare facilities to serve the behavioral health and recovery needs of communities in the United States, the United Kingdom, and Puerto Rico. The company operates acute inpatient psychiatric facilities, which cares to stabilize patients that are either threat to themselves or others by hourly observation, daily intervention, and monitoring by psychiatrists; and specialty treatment facilities, including residential recovery and eating disorder facilities, and comprehensive treatment centers that provide continuum care for adults with addictive disorders and co-occurring mental disorders. It also provides residential treatment centers, which treat patients with behavioral disorders in a non-hospital setting, including outdoor programs; and outpatient community-based services, such as community-based programs that are designed to offer therapeutic treatment to children and adolescents who have a clinically-defined emotional, psychiatric, or chemical dependency disorders. In addition, the company provides mental health rehabilitation services comprising relapse prevention and social integration services, as well as vocational opportunities; acute services for patients at risk to themselves or others, as well as crisis intervention and treatment of behavioral emergencies; and long-term and non-acute care services for adults suffering from mental illness, addiction, learning disability, or brain injury. Further, it provides education and children's services for children and young people with special educational needs; adult care services; and care first services for employees. As of December 31, 2019, the company operated a network of 585 behavioral healthcare facilities with 18,200 beds. The company was founded in 2005 and is headquartered in Franklin, Tennessee.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Franklin"}, "ADUS": {"short_name": "Addus HomeCare Corporation", "long_name": "Addus HomeCare Corporation", "summary": "Addus HomeCare Corporation provides personal care services to elderly, chronically ill, disabled persons, and individuals who are at risk of hospitalization or institutionalization in the United States. It operates in three segments: Personal Care, Hospice, and Home Health. The Personal Care segment provides non-medical assistance with activities of daily living. This segment's services include assistance with bathing, grooming, oral care, feeding and dressing, medication reminders, meal planning and preparation, housekeeping, and transportation services. The Hospice segment provides palliative nursing care, social work, spiritual counseling, homemaker, and bereavement counseling services for people who are terminally ill, as well as related services for their families. The Home Health segment offers skilled nursing and physical, occupational, and speech therapy for the individuals who requires assistance during an illness or after hospitalization. The company's payor clients include federal, state, and local governmental agencies; managed care organizations; commercial insurers; and private individuals. As of June 30, 2020, the company served consumers through 190 offices located in 25 states. Addus HomeCare Corporation was founded in 1979 and is based in Frisco, Texas.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Frisco"}, "ADY.F": {"short_name": "AMEDISYS INC.  DL-,001", "long_name": "Amedisys, Inc.", "summary": "Amedisys, Inc., together with its subsidiaries, provides healthcare services in the United States. It operates through three segments: Home Health, Hospice, and Personal Care. The Home Health segment offers a range of services in the homes of individuals for the recovery of patients from surgery, chronic disability, or terminal illness, as well as prevents avoidable hospital readmissions through its skilled nurses; rehabilitation therapists specialized in physical, speech, and occupational therapy; and social workers and aides for assisting its patients. The Hospice segment offers services that is designed to provide comfort and support for those who are dealing with a terminal illness, including heart disease, pulmonary disease, Alzheimer's, or cancer. The Personal Care segment provides assistance for patients with the activities of daily living. As of February 18, 2020, the company owned and operated 479 care centers in 38 states and the District of Columbia. Amedisys, Inc. was founded in 1982 and is headquartered in Baton Rouge, Louisiana.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Baton Rouge"}, "AFN.SG": {"short_name": "Tivity Health Inc. Registered S", "long_name": "Tivity Health, Inc.", "summary": "Tivity Health, Inc. provides fitness, nutrition, and social connection solutions in the United States. It operates through two segments, Healthcare and Nutrition. The Healthcare segment offers SilverSneakers senior fitness program to the members of Medicare advantage and Medicare supplement programs; Prime fitness, a fitness facility access program through commercial health plans, employers, and other sponsoring organizations; health plans through WholeHealth Living program; and health services, such as chiropractic care, acupuncture, physical therapy, occupational therapy, speech therapy, and others. The Nutrition segment provides weight management products and services under the Nutrisystem, South Beach Diet, and Wisely Well names. This segment sells pre-packaged foods comprising frozen and non-frozen, and shelf-stable products directly to weight loss program participants primarily through the Internet and telephone; QVC, a television shopping network; and retailers. The company was formerly known as Healthways, Inc. and changed its name to Tivity Health, Inc. in January 2017. Tivity Health, Inc. was founded in 1981 and is headquartered in Franklin, Tennessee.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "STU", "market": "dr_market", "country": "United States", "city": "Franklin"}, "AMBD": {"short_name": "AMERICAN MOBILE DENTAL CORP", "long_name": "American Mobile Dental Corp.", "summary": "American Mobile Dental Corp. engages in the ownership and operation of mobile dental offices in the northeast region of the United States. These mobile dental offices provide dental and health management services for consumers in economic development areas in New York. The company provides various services, including oral examinations, X-rays, dental prophylaxes, nutrition counseling, fluoride treatments, sealant, amalgam and composite restorations, stainless steel crowns, polycarbonate anterior crowns, root canal therapy for primary and permanent teeth, and extractions and minor oral surgery. It also manages dental centers that offer treatments, such as crown and bridge, molar root canals, orthodontics, and TMJ therapy, as well as various cosmetic procedures. In addition, American Mobile Dental provides dental screenings and educational materials to individuals at inner city schools, malls, health fairs, college campuses, senior citizen centers, convalescent homes, and elementary schools. The company was founded in 2000. It was formerly known as Tradepubz.com, Inc. and changed its name to American Mobile Dental Corp. in 2004. American Mobile Dental is headquartered in Mamaroneck, New York.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Mamaroneck"}, "AMED": {"short_name": "Amedisys Inc", "long_name": "Amedisys, Inc.", "summary": "Amedisys, Inc., together with its subsidiaries, provides healthcare services in the United States. It operates through three segments: Home Health, Hospice, and Personal Care. The Home Health segment offers a range of services in the homes of individuals for the recovery of patients from surgery, chronic disability, or terminal illness, as well as prevents avoidable hospital readmissions through its skilled nurses; rehabilitation therapists specialized in physical, speech, and occupational therapy; and social workers and aides for assisting its patients. The Hospice segment offers services that is designed to provide comfort and support for those who are dealing with a terminal illness, including heart disease, pulmonary disease, Alzheimer's, or cancer. The Personal Care segment provides assistance for patients with the activities of daily living. As of February 18, 2020, the company owned and operated 479 care centers in 38 states and the District of Columbia. Amedisys, Inc. was founded in 1982 and is headquartered in Baton Rouge, Louisiana.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Baton Rouge"}, "AMED.MX": {"short_name": "AMEDISYS INC", "long_name": "Amedisys, Inc.", "summary": "Amedisys, Inc., together with its subsidiaries, provides healthcare services in the United States. It operates through three segments: Home Health, Hospice, and Personal Care. The Home Health segment offers a range of services in the homes of individuals for the recovery of patients from surgery, chronic disability, or terminal illness, as well as prevents avoidable hospital readmissions through its skilled nurses; rehabilitation therapists specialized in physical, speech, and occupational therapy; and social workers and aides for assisting its patients. The Hospice segment offers services that is designed to provide comfort and support for those who are dealing with a terminal illness, including heart disease, pulmonary disease, Alzheimer's, or cancer. The Personal Care segment provides assistance for patients with the activities of daily living. As of February 18, 2020, the company owned and operated 479 care centers in 38 states and the District of Columbia. Amedisys, Inc. was founded in 1982 and is headquartered in Baton Rouge, Louisiana.", "currency": "MXN", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Baton Rouge"}, "AMEH": {"short_name": "Apollo Medical Holdings, Inc.", "long_name": "Apollo Medical Holdings, Inc.", "summary": "Apollo Medical Holdings, Inc., a physician-centric technology-powered healthcare management company, provides medical care services. The company, leveraging its proprietary population health management and healthcare delivery platform, operates an integrated, value-based healthcare model which empowers the providers in its network to deliver quality care to its patients. It offers care coordination services to patients, families, primary care physicians, specialists, acute care hospitals, alternative sites of inpatient care, physician groups, and health plans. The company's physician network consists of primary care physicians, specialist physicians, and hospitalists. It caters to patients, primarily covered by private or public insurance, such as Medicare, Medicaid, and health maintenance organization plans; and non-insured patients in California. Apollo Medical Holdings, Inc. was founded in 1994 and is headquartered in Alhambra, California.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NCM", "market": "us_market", "country": "United States", "city": "Alhambra"}, "AMN": {"short_name": "AMN Healthcare Services Inc AMN", "long_name": "AMN Healthcare Services, Inc.", "summary": "AMN Healthcare Services, Inc. provides healthcare workforce solutions and staffing services to hospitals and healthcare facilities in the United States. It operates through three segments: Nurse and Allied Solutions, Locum Tenens Solutions, and Other Workforce Solutions. It offers travel nurse staffing under the American Mobile, Onward Healthcare, Nurses Rx, Advanced, and O'Grady-Peyton brands; nurse staffing and labor disruption services, a staffing solution under the NurseChoice and HealthSource Global Staffing brands; local, or per diem, staffing for daily shift work under the Nursefinders brand; and locum tenens staffing for specialties, clinicians, and dentists on an independent contractor basis on temporary assignments under the Staff Care and Locum Leaders brands. It also provides allied staffing services, such as skilled nursing facilities, rehabilitation clinics, and retail and mail-order pharmacies under the Med Travelers and Club Staffing brands; physician permanent placement services to hospitals, healthcare facilities, and physician practice groups under the Merritt Hawkins brand, as well as physician executive leadership search services under the B.E. Smith brand; and executive and clinical leadership interim staffing, healthcare executive search, and advisory services. In addition, it offers managed services programs; vendor management systems, including ShiftWise and Medefis technologies; recruitment process outsourcing for permanent hiring needs; workforce optimization services comprising consulting, data analytics, predictive modeling, and SaaS-based scheduling technology under the Smart Square brand; medical coding, clinical documentation improvement, case management, clinical data registry, and auditing and advisory services; digital staffing services; flex pool management; and credentialing software solutions to clinicians and healthcare enterprises. AMN Healthcare Services, Inc. was founded in 1985 and is based in Dallas, Taxas.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Dallas"}, "AMS": {"short_name": "American Shared Hospital Servic", "long_name": "American Shared Hospital Services", "summary": "American Shared Hospital Services leases radiosurgery and radiation therapy equipment to health care providers. The company offers radiosurgery equipment for the Gamma Knife stereotactic radiosurgery, a non-invasive procedure to treat malignant and benign brain tumors, and arteriovenous malformations, as well as for trigeminal neuralgia. It also provides image guided radiation therapy (IGRT) systems that integrate imaging and detection components into an accelerator, which allows clinicians to plan treatment, verify positioning, and deliver treatment. In addition, the company offers financing services for Leksell Gamma Knife units. Further, it provides proton beam therapy equipment (PBRT) and services in Orlando, Florida and Long Beach, California, as well as offers planning, installation, reimbursement, and marketing support services to its customers. As of March 1, 2020, it operated 15 Gamma Knife units in 14 states of the United States and one in Lima, Peru. It also operates one PBRT system and one IGRT machine. American Shared Hospital Services was founded in 1980 and is headquartered in San Francisco, California.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "San Francisco"}, "ARHH": {"short_name": "ASSURE HOLDINGS CORP", "long_name": "Assure Holdings Corp.", "summary": "Assure Holdings Corp., together with its subsidiaries, provides technical and professional intraoperative neuromonitoring surgical support services primarily associated with spine and head surgeries. The company is based in Denver, Colorado.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Denver"}, "ASSF": {"short_name": "ASSISTED 4 LIVING INC", "long_name": "Assisted 4 Living, Inc.", "summary": "Assisted 4 Living, Inc. operates as an assisted living consulting company in the United States. It provides services in the areas of acquiring, licensing, staffing, and operating assisted living facilities. The company was founded in 2017 and is based in North Port, Florida.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "North Port"}, "AVCO": {"short_name": "Avalon GloboCare Corp.", "long_name": "Avalon GloboCare Corp.", "summary": "Avalon GloboCare Corp., together with its subsidiaries, owns and operates commercial real estate properties in the United States and the People's Republic of China. The company offers medical related consulting services, including research studies, executive education, daily online executive briefings, tailored expert advisory services, and consulting and management services in the areas of immunotherapy and second opinion/referral services. It also develops Avalon Cell and Avalon Rehab platforms that cover the areas of regenerative medicine, cell-based immunotherapy, and exosome technology. In addition, the company develops proprietary diagnostic and therapeutic products leveraging exosome technology; and provides development services for hospitals. The company has a strategic partnership with Weill Cornell Medical College to co-develop bio-production and standardization procedures for chimeric antigen receptor (CAR)-T Therapy; GensKey Medical Technology Co. Ltd. to co-develop and commercialize point-of-care, rapid detection antibody tests to identify whether a patient has been exposed to and has developed antibodies against SARS-CoV-2; GE Healthcare to enhance standardized automation and bio-production for cellular medicines; and HydroPeptide, LLC to co-develop and commercialize various clinical-grade, exosome-based cosmeceutical and orthopedic products, as well as research agreement with Massachusetts Institute of Technology to develop CAR technology. Avalon GloboCare Corp. is headquartered in Freehold, New Jersey.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Freehold"}, "AZS.F": {"short_name": "AMER. SHARED HOSP. SERV.", "long_name": "American Shared Hospital Services", "summary": "American Shared Hospital Services leases radiosurgery and radiation therapy equipment to health care providers. The company offers radiosurgery equipment for the Gamma Knife stereotactic radiosurgery, a non-invasive procedure to treat malignant and benign brain tumors, and arteriovenous malformations, as well as for trigeminal neuralgia. It also provides image guided radiation therapy (IGRT) systems that integrate imaging and detection components into an accelerator, which allows clinicians to plan treatment, verify positioning, and deliver treatment. In addition, the company offers financing services for Leksell Gamma Knife units. Further, it provides proton beam therapy equipment (PBRT) and services in Orlando, Florida and Long Beach, California, as well as offers planning, installation, reimbursement, and marketing support services to its customers. As of March 1, 2020, it operated 15 Gamma Knife units in 14 states of the United States and one in Lima, Peru. It also operates one PBRT system and one IGRT machine. American Shared Hospital Services was founded in 1980 and is headquartered in San Francisco, California.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "San Francisco"}, "BBAL": {"short_name": "NEW YORK HEALTH CARE INC", "long_name": "New York Health Care, Inc.", "summary": "New York Health Care, Inc. operates as a home care services agency primarily in New York. The company offers various home care services, such as companionship services, homemaker/housekeeper staff, professional and practical nurses, home health aides, care givers, geriatric care, and dementia and alzheimer care services. It also provides insurance services. The company was founded in 1983 and is based in Valley Stream, New York.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Valley Stream"}, "BDYS": {"short_name": "BODYSCAN CORP", "long_name": "BodyScan Corp.", "summary": "BodyScan Corp. offers medical imaging services that include GE-Imatron Electron Beam Tomography (EBT) scanning for coronary artery disease (CAD), lung diseases, tumors, and stones detection. The company is based in Irvine, California.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Irvine"}, "BICX": {"short_name": "BIOCORRX INC", "long_name": "BioCorRx Inc.", "summary": "BioCorRx Inc., through its subsidiaries, provides alcoholism and opioid addiction treatment program for use in rehabilitation and treatment centers in the United States. It distributes and licenses BioCorRx recovery program, a medication-assisted treatment program that includes a counseling program coupled with its proprietary naltrexone implant. The company is also developing BICX101, an injectable naltrexone product; and BICX102, an implantable naltrexone implant for the treatment of alcohol and opioid addiction. It distributes its program to healthcare providers, independent licensed clinics, and licensed healthcare professionals. The company was formerly known as Fresh Start Private Management, Inc. and changed its name to BioCorRx Inc. in January 2014. BioCorRx Inc. is headquartered in Anaheim, California.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Anaheim"}, "BKD": {"short_name": "Brookdale Senior Living Inc.", "long_name": "Brookdale Senior Living Inc.", "summary": "Brookdale Senior Living Inc. owns and operates senior living communities in the United States. It operates through five segments: Independent Living, Assisted Living and Memory Care, CCRCs, Health Care Services, and Management Services. The Independent Living segment owns or leases communities comprising independent and assisted living units in a single community that are primarily designed for middle to upper income senior citizens. The Assisted Living and Memory Care segment owns or leases communities consisting of freestanding multi-story communities and freestanding single story communities, which offer housing and 24-hour assistance with activities of daily life to mid-acuity frail and elderly residents. This segment also operates memory care communities for residents with Alzheimer's and other dementias. The CCRCs segment owns or leases communities that offer various living arrangements, such as independent and assisted living, and skilled nursing; and services to accommodate various levels of physical ability and health. The Health Care Services segment provides home health, hospice, and outpatient therapy services, as well as education and wellness programs to residents of its communities, as well as to other senior living outside of the its communities. The Management Services segment operates communities under the management agreements. As of February 01, 2020, the company owned 356 communities, leased 307 communities, managed 77 communities on behalf of third parties, and three communities for which it have equity interest. Brookdale Senior Living Inc. is headquartered in Brentwood, Tennessee.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Brentwood"}, "BNYN": {"short_name": "BANYAN CORP(OREGON)", "long_name": "Banyan Corp.", "summary": "Banyan Corp., through its subsidiaries, engages in the franchising of chiropractic clinics in North America. It provides practice development training and assistance to chiropractors, as well as offers franchise support and related services to franchisees and licensees. The company also offers diagnostic testing services. Banyan Corporation provides nerve conduction velocity (NCV) testing to patients through health care professionals, such as doctors and chiropractors. The NCV testing measures the transmission of nerve impulses through the body, identifies problems in the nervous system, and enables to substantiate the cost of treatment to patients and their insurers. In addition, it manufactures and markets the VT3000, a nerve testing system for the diagnosis of neuropathies, which are diseases of the peripheral nerves and parts of the spine, as well as nerve irritation and other damage to the nervous system of a patient. The company was founded in 1978 and is based in Beverly Hills, California.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Beverly Hills"}, "CCEL": {"short_name": "CRYO-CELL INTERNATIONAL INC", "long_name": "Cryo-Cell International, Inc.", "summary": "Cryo-Cell International, Inc. engages in the cellular processing and cryogenic cellular storage with a focus on the collection and preservation of umbilical cord blood stem cells for family use. It provides cord tissue service that stores a section of the umbilical cord tissue, a source of mesenchymal stem cells that are used in regenerative medicine to treat a range of conditions, including heart, kidney, ALS, wound healing, and auto-immune diseases. The company also manufactures and sells PrepaCyte CB processing system, a technology used to process umbilical cord blood stem cells. It stores approximately 500,000 cord blood and cord tissue stem cells worldwide. The company markets its cord blood stem cell preservation services directly to expectant parents, as well as by distributing information through obstetricians, pediatricians, childbirth educators, certified nurse-midwives, and other related healthcare professionals. Cryo-Cell International, Inc. was founded in 1989 and is headquartered in Oldsmar, Florida.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Oldsmar"}, "CEVE": {"short_name": "CERES VENTURES INC", "long_name": "Ceres Ventures, Inc.", "summary": "Ceres Ventures, Inc., a development stage company, focuses on the research, development, and commercialization of clean technologies for the remediation of polluted water, soil, and air. Its technologies include BluFlow Nanoparticles, a proprietary system for formulating, producing, and deploying customizable absorbent nanoparticles to specific functionality for contaminant/chemical removal and extraction of valuable elements and compounds from water based solutions; BluFlow Advanced Ultrafiltration Technology, an automated process to recover water from waste or impure streams; and BluFlow Treatment System a water and wastewater treatment solution, which incorporates the BluFlow Nanoparticles and the BluFlow Advanced Ultrafiltration Technology to remove target elements, compounds, and pollutants, as well as purify water that may be suitable for reuse. Ceres Ventures, Inc.'s products are used in water and wastewater treatment and purification, contaminated groundwater treatment, industrial wastewater treatment, and valuable elements and compounds extraction applications. The company was formerly known as PhytoMedical Technologies, Inc. and changed its name to Ceres Ventures, Inc. in November 2011. Ceres Ventures, Inc. is based in New York, New York.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "New York"}, "CHCR": {"short_name": "COMPREHENSIVE CARE CORP", "long_name": "Advanzeon Solutions, Inc.", "summary": "Advanzeon Solutions, Inc., through its subsidiary, Pharmacy Value Management Solutions, Inc., administers and operates a sleep apnea program known as SleepMaster Solutions. The company was formerly known as Comprehensive Care Corporation and changed its name to Advanzeon Solutions, Inc. in January 2014. Advanzeon Solutions, Inc. was founded in 1969 and is headquartered in Tampa, Florida. On September 7, 2020, Advanzeon Solutions, Inc. filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the Middle District of Florida.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Tampa"}, "CHE": {"short_name": "Chemed Corp", "long_name": "Chemed Corporation", "summary": "Chemed Corporation provides hospice and palliative care services to patients through a network of physicians, registered nurses, home health aides, social workers, clergy, and volunteers in the United States. It operates in two segments, VITAS and Roto-Rooter. The company also offers plumbing, drain cleaning, water restoration, and other related services to residential and commercial customers through company-owned branches and independent contractors, and franchised locations. The company was incorporated in 1970 and is headquartered in Cincinnati, Ohio.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Cincinnati"}, "CPAI": {"short_name": "CHAMPION PAIN CARE CORP", "long_name": "Champion Pain Care Corporation", "summary": "Champion Pain Care Corporation operates as a pain management company in the United States. It offers the Champion Pain Care Protocol, a proprietary pain management protocol for the treatment and management of chronic pain. The company's protocol includes various treatment plans comprising physical examination by the attending doctor, blood testing, and urine drug screening; education for patients about the nature of their chronic pain; on-going interaction to support patient adherence to beneficial behavioral changes; relaxation training to reduce the effects or stress and anxiety, which can aggravate pain; amino acids and other dietary supplements to restore and maintain normal brain chemistry; and the reduction of cellular and joint inflammation. Its treatment plans also consists of the day and night time regimens to promote restorative sleep; use of electrotherapy stimulation to promote production and release of endorphin; topical medications for pain relief; and on-going counseling, telephone and on-line support, and checkups. The company was formerly known as OICCO Acquisition I, Inc. and changed its name to Champion Pain Care Corporation in August 2014. Champion Pain Care Corporation was incorporated in 2009 and is based in New York, New York.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "New York"}, "CSU": {"short_name": "Capital Senior Living Corporati", "long_name": "Capital Senior Living Corporation", "summary": "Capital Senior Living Corporation develops, owns, operates, and manages senior housing communities in the United States. The company provides independent living services, which include daily meals, transportation, social and recreational activities, laundry, housekeeping, and 24-hour staffing; and access to health screenings, periodic special services, and dietary and similar programs, as well as exercise and fitness classes. It also offers assisted living services consist of personal care services, such as assistance with activities of daily living, including ambulation, bathing, dressing, eating, grooming, personal hygiene, and monitoring or assistance with medications; support services, including meals, assistance with social and recreational activities, laundry, general housekeeping, maintenance, and transportation services; and supplemental services, which include extra transportation, personal maintenance, and extra laundry, as well as special care services for residents with various forms of dementia. In addition, the company provides memory care services; and home care services through third-party providers. As of December 31, 2019, it operated 126 senior housing communities in 23 states with an aggregate capacity of approximately 16,000 residents, including 80 owned and 46 leased senior housing communities. Capital Senior Living Corporation was founded in 1990 and is headquartered in Dallas, Texas.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Dallas"}, "CXM.F": {"short_name": "CHEMED CORP.  DL 1", "long_name": "Chemed Corporation", "summary": "Chemed Corporation provides hospice and palliative care services to patients through a network of physicians, registered nurses, home health aides, social workers, clergy, and volunteers in the United States. It operates in two segments, VITAS and Roto-Rooter. The company also offers plumbing, drain cleaning, water restoration, and other related services to residential and commercial customers through company-owned branches and independent contractors, and franchised locations. The company was incorporated in 1970 and is headquartered in Cincinnati, Ohio.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Cincinnati"}, "CYH": {"short_name": "Community Health Systems, Inc.", "long_name": "Community Health Systems, Inc.", "summary": "Community Health Systems, Inc., through its subsidiaries, owns, leases, and operates general acute care hospitals in the United States. The company offers general acute care, emergency room, general and specialty surgery, critical care, internal medicine, obstetrics, diagnostic, psychiatric, and rehabilitation services, as well as skilled nursing and home care services. It also provides outpatient services at urgent care centers, occupational medicine clinics, imaging centers, cancer centers, and ambulatory surgery centers. As of December 31, 2019, it owned or leased 102 hospitals, including 100 general acute care hospitals and two stand-alone rehabilitation or psychiatric hospitals with an aggregate of 16,240 licensed beds. Community Health Systems, Inc. was founded in 1985 and is headquartered in Franklin, Tennessee.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Franklin"}, "DPAT": {"short_name": "DENTAL PATIENT CARE AMERICA INC", "long_name": "Dental Patient Care America, Inc.", "summary": "Dental Patient Care America, Inc., through its subsidiaries, provides services to dentists and the dental industry. The company organizes dentists into a co-operative model of contractually networked dental practices, allowing member dentists to access various benefits, such as programs to purchase supplies, laboratory and operating services, insurance and employee benefits programs, opportunities for profit sharing, preferential business financing, and dental practice transition funding opportunities. It also offers various dental patient marketing programs, such as organization of member dentists into a network, which offers dental care plans to employers and groups. In addition, Dental Patient Care America, Inc. offers dental benefit plans. The company was founded in 1998 and is based in Salt Lake City, Utah.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Salt Lake City"}, "DRWN": {"short_name": "A CLEAN SLATE INC", "long_name": "Quantum Medical Transport, Inc.", "summary": "Quantum Medical Transport, Inc., doing business as Quantum Medical Data Services, operates as a medical blockchain data services company. It is developing a medical blockchain technology for secure data storage and data transfer. The company was formerly known as A Clean Slate, Inc. and changed its name to Quantum Medical Transport, Inc. in August 2015. Quantum Medical Transport, Inc. is based in Sugar Land, Texas.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Sugar Land"}, "DVA": {"short_name": "DaVita Inc.", "long_name": "DaVita Inc.", "summary": "DaVita Inc. provides kidney dialysis services for patients suffering from chronic kidney failure or end stage renal disease (ESRD). The company operates kidney dialysis centers and provides related lab services in outpatient dialysis centers. It also provides outpatient, hospital inpatient, and home-based hemodialysis services; owns clinical laboratories that provide routine laboratory tests for dialysis and other physician-prescribed laboratory tests for ESRD patients; and management and administrative services to outpatient dialysis centers. In addition, the company provides disease management services; vascular access services; clinical research programs; physician services; and comprehensive care services. As of December 31, 2019, it provided dialysis and administrative services in the United States through a network of 2,753 outpatient dialysis centers serving approximately 206,900 patients; and operated 259 outpatient dialysis centers located in 10 countries outside of the United States serving approximately 28,700 patients. Further, the company provides acute inpatient dialysis services in approximately 900 hospitals and related laboratory services in the United States. The company was formerly known as DaVita HealthCare Partners Inc. and changed its name to DaVita Inc. in September 2016. DaVita Inc. was founded in 1994 and is headquartered in Denver, Colorado.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Denver"}, "DVAI34.SA": {"short_name": "DAVITA INC  DRN", "long_name": "DaVita Inc.", "summary": "DaVita Inc. provides kidney dialysis services for patients suffering from chronic kidney failure or end stage renal disease (ESRD). The company operates kidney dialysis centers and provides related lab services in outpatient dialysis centers. It also provides outpatient, hospital inpatient, and home-based hemodialysis services; owns clinical laboratories that provide routine laboratory tests for dialysis and other physician-prescribed laboratory tests for ESRD patients; and management and administrative services to outpatient dialysis centers. In addition, the company provides disease management services; vascular access services; clinical research programs; physician services; and comprehensive care services. As of December 31, 2019, it provided dialysis and administrative services in the United States through a network of 2,753 outpatient dialysis centers serving approximately 206,900 patients; and operated 259 outpatient dialysis centers located in 10 countries outside of the United States serving approximately 28,700 patients. Further, the company provides acute inpatient dialysis services in approximately 900 hospitals and related laboratory services in the United States. The company was formerly known as DaVita HealthCare Partners Inc. and changed its name to DaVita Inc. in September 2016. DaVita Inc. was founded in 1994 and is headquartered in Denver, Colorado.", "currency": "BRL", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "SAO", "market": "br_market", "country": "United States", "city": "Denver"}, "DVCR": {"short_name": "DIVERSICARE HEALTHCARE SERVICES", "long_name": "Diversicare Healthcare Services, Inc.", "summary": "Diversicare Healthcare Services, Inc. provides post-acute care services to skilled nursing centers, patients, and residents primarily in the Southeast, Midwest, and Southwest United States. The company offers skilled nursing health care services, including nutrition, recreational therapy, social, housekeeping, and laundry services; the delivery of ancillary medical services at the nursing centers; rehabilitation therapy services, such as audiology, speech, occupational, and physical therapies; and medical supplies, nutritional support, infusion therapies, and related clinical services. As of December 31, 2019, it operated 62 nursing centers with 7,329 licensed nursing beds. The company was formerly known as Advocat Inc. and changed its name to Diversicare Healthcare Services, Inc. in March 2013. Diversicare Healthcare Services, Inc. was founded in 1994 and is based in Brentwood, Tennessee.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Brentwood"}, "EGB.F": {"short_name": "ENSIGN GROUP INC. DL-,001", "long_name": "The Ensign Group, Inc.", "summary": "The Ensign Group, Inc. provides health care services in the post-acute care continuum and other ancillary businesses. The company offers transitional and skilled services, which include short and long-term nursing care services for patients with chronic conditions, prolonged illness, and the elderly. It also provides standard services, such as room and board, special nutritional program, social, recreational, entertainment, and other services. In addition, the company offers senior living, as well as mobile diagnostics services; leases real estate properties; and provides other ancillary services consisting of digital x-ray, ultrasound, electrocardiogram, laboratory, sub-acute, and patient transportation services to people in their homes or at long-term care facilities. As of December 31, 2019, it operated 223 skilled nursing and senior living facilities in Arizona, California, Colorado, Idaho, Iowa, Kansas, Massachusetts, Nebraska, Nevada, South Carolina, Texas, Utah, Washington, and Wisconsin. The Ensign Group, Inc. was founded in 1999 and is based in San Juan Capistrano, California.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "San Juan Capistrano"}, "EHC": {"short_name": "Encompass Health Corporation", "long_name": "Encompass Health Corporation", "summary": "Encompass Health Corporation provides facility-based and home-based post-acute healthcare services in the United States. The company operates through two segments, Inpatient Rehabilitation, and Home Health and Hospice. The Inpatient Rehabilitation segment provides specialized rehabilitative treatment on an inpatient and outpatient basis to patients who are recovering from conditions, such as stroke and other neurological disorders, cardiac and pulmonary conditions, brain and spinal cord injuries, complex orthopedic conditions, and amputations. The Home Health and Hospice segment provides home health and hospice services primarily in the Southeast and Texas. Its home health services include a range of Medicare-certified home nursing services to adult patients in need of care comprising skilled nursing, medical social work, and home health aide services, as well as physical, occupational, speech therapy, and others. This segment's hospice services comprise in-home services to terminally ill patients and their families to address patients' physical needs, including pain control and symptom management, and to provide emotional and spiritual support. As of November 16, 2020, Encompass Health Corporation operated 137 hospitals, 242 home health locations, and 83 hospice locations in 39 states and Puerto Rico. The company was formerly known as HealthSouth Corporation and changed its name to Encompass Health Corporation in January 2018. Encompass Health Corporation was founded in 1983 and is based in Birmingham, Alabama.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Birmingham"}, "ENSG": {"short_name": "The Ensign Group, Inc.", "long_name": "The Ensign Group, Inc.", "summary": "The Ensign Group, Inc. provides health care services in the post-acute care continuum and other ancillary businesses. The company offers transitional and skilled services, which include short and long-term nursing care services for patients with chronic conditions, prolonged illness, and the elderly. It also provides standard services, such as room and board, special nutritional program, social, recreational, entertainment, and other services. In addition, the company offers senior living, as well as mobile diagnostics services; leases real estate properties; and provides other ancillary services consisting of digital x-ray, ultrasound, electrocardiogram, laboratory, sub-acute, and patient transportation services to people in their homes or at long-term care facilities. As of December 31, 2019, it operated 223 skilled nursing and senior living facilities in Arizona, California, Colorado, Idaho, Iowa, Kansas, Massachusetts, Nebraska, Nevada, South Carolina, Texas, Utah, Washington, and Wisconsin. The Ensign Group, Inc. was founded in 1999 and is based in San Juan Capistrano, California.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "San Juan Capistrano"}, "FCHS": {"short_name": "FIRST CHOICE HEALTHCARE SOLUTIO", "long_name": "First Choice Healthcare Solutions, Inc.", "summary": "First Choice Healthcare Solutions, Inc., through its subsidiaries, provides healthcare services in the United States. Its network of non-physician-owned medical centers offer musculoskeletal and rehabilitative care services specializing in orthopaedics, spine surgery, interventional pain management, and ambulatory surgical care. The company also provides ancillary and diagnostic services comprising magnetic resonance imaging, X-ray, durable medical equipment, and physical/occupational therapy. In addition, it subleases 29,629 square feet of commercial office space to affiliated and nonaffiliated tenants. The company is headquartered in Melbourne, Florida.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Melbourne"}, "FPCG": {"short_name": "FIRST PHYSICIANS CAPITAL GROUP ", "long_name": "First Physicians Capital Group, Inc.", "summary": "First Physicians Capital Group, Inc., through its subsidiaries, provides management, financial, and ancillary healthcare and IT services to the rural and community hospital market in the United States. The company offers hospital administration, billing and revenue cycle management, insurance, and medical supplies services, as well as finance, accounting, and tax services. It also provides physician and nurse staffing services, as well as administrative staffing, including hospital administrator, billing and coding, and non-healthcare provider personnel; and ancillary healthcare and IT services comprising electronic health and medical records solutions, radiology and diagnostic imaging, pathology and laboratory, emergency room care, and physical therapy and rehabilitation services. In addition, the company invests in, manages, and develops properties associated with the delivery of healthcare services consisting of critical access and physician-owned hospitals; federally and state-funded medical clinics; outpatient facilities, including ambulatory surgery centers, outpatient surgical centers, and ancillary services facilities; medical office buildings; and medical equipment, such as CT, MRI, X-ray, ultrasound, and surgical equipment. Further, it owns a medical clinic in Oklahoma. The company was formerly known as Tri-Isthmus Group, Inc. and changed its name to First Physicians Capital Group, Inc. in September 2009. First Physicians Capital Group, Inc. was founded in 1980 and is based in Beverly Hills, California.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Beverly Hills"}, "FVE": {"short_name": "Five Star Senior Living Inc.", "long_name": "Five Star Senior Living Inc.", "summary": "Five Star Senior Living Inc. operates and manages senior living communities in the United States. It operates through Senior Living Communities, and Rehabilitation and Wellness segments. Its senior living communities comprise independent living communities, assisted living communities, continuing care retirement communities (CCRCs), and skilled nursing facilities (SNFs). The company offers nursing and healthcare services; and rehabilitation and wellness services. As of December 31, 2019, it operated 268 senior living communities consisting of 31,285 living units comprising 257 primarily independent and assisted living communities with 30,021 living units, and 11 SNFs with 1,264 living units located in 32 states. The company was formerly known as Five Star Quality Care, Inc. and changed its name to Five Star Senior Living Inc. in March 2017. Five Star Senior Living Inc. was founded in 2001 and is headquartered in Newton, Massachusetts.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Newton"}, "GEN": {"short_name": "Genesis Healthcare, Inc.", "long_name": "Genesis Healthcare, Inc.", "summary": "Genesis Healthcare, Inc., together with its subsidiaries, owns and operates skilled nursing facilities and assisted/senior living facilities in the United States. The company operates through three segments: Inpatient Services; Rehabilitation Therapy Services; and Other Services. It also provides a range of rehabilitation therapy services, including speech-language pathology, physical therapy, occupational therapy, and respiratory therapy. In addition, the company offers other specialty medical services, such as physician, staffing, and other healthcare related services. As of April 23, 2020, it provided inpatient services through a network of approximately 400 skilled nursing facilities and assisted/senior living communities in 25 states; and supplied rehabilitation and respiratory therapy to approximately 1,200 healthcare locations in 44 states, the District of Columbia and China. The company was formerly known as FC-GEN Operations Investment, LLC and changed its name to Genesis HealthCare, Inc. in February 2015. Genesis HealthCare, Inc. was founded in 2003 and is headquartered in Kennett Square, Pennsylvania.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Kennett Square"}, "GNOW": {"short_name": "AMERICAN CARESOURC", "long_name": "American Caresource Holdings, Inc.", "summary": "American CareSource Holdings, Inc. provides urgent and primary care services in the United States. The company operates healthcare centers that offer non-life-threatening out-patient medical care for the treatment of acute, episodic, and chronic medical conditions. Its healthcare centers provide treatment of general medical problems, including colds, flus, ear infections, hypertension, asthma, pneumonia, urinary tract infections, and other conditions; treatment of injuries, such as fractures, dislocations, sprains, bruises, and cuts; minor non-emergent surgical procedures; diagnostic tests, such as X-rays, electrocardiograms, complete blood counts, and urinalyses; and occupational and industrial medical services, including drug testing, workers' compensation cases, and pre-employment physical examinations. It owns and operates 13 urgent and primary care centers, including 2 in Georgia, 2 in Florida, 3 in Alabama, 4 in North Carolina, and 2 in Virginia. The company was founded in 1995 and is headquartered in Atlanta, Georgia.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Atlanta"}, "GRST": {"short_name": "ETHEMA HEALTH CORPORATION", "long_name": "Ethema Health Corporation", "summary": "Ethema Health Corporation, together with its subsidiaries, operates substance abuse treatment center. The company operates in two segments, Rental Operations and In-Patient Services. It also operates Addiction Recovery Institute of America in West Palm Beach, Florida. The company was formerly known as GreeneStone Healthcare Corporation and changed its name to Ethema Health Corporation in April 2017. Ethema Health Corporation is based in West Palm Beach, Florida.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "West Palm Beach"}, "HAHI": {"short_name": "HELP AT HOME INC", "long_name": "Help At Home, LLC", "summary": "Help At Home, LLC provides home care services to seniors and persons with disabilities in the United States. Its services include home care and personal care; nursing; and drug testing services. The company was founded in 1975 and is based in Chicago, Illinois. It has additional locations in Alabama, Georgia, Illinois, Indiana, Iowa, Kansas, Kentucky, Michigan, Mississippi, Missouri, Pennsylvania, South Carolina, and Tennessee. Help At Home, LLC is a former subsidiary of HAH Holdings, LLC.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Chicago"}, "HCA": {"short_name": "HCA Healthcare, Inc.", "long_name": "HCA Healthcare, Inc.", "summary": "HCA Healthcare, Inc., through its subsidiaries, operates as a health care services company in the United States. The company operates general, acute care hospitals that offer medical and surgical services, including inpatient care, intensive care, cardiac care, diagnostic, and emergency services; and outpatient services, such as outpatient surgery, laboratory, radiology, respiratory therapy, cardiology, and physical therapy services. It also operates psychiatric hospitals, which provide therapeutic programs comprising child, adolescent and adult psychiatric care, and adolescent and adult alcohol and drug abuse treatment and counseling. In addition, the company operates outpatient health care facilities consisting of freestanding ambulatory surgery centers, freestanding emergency care facilities, urgent care facilities, walk-in clinics, diagnostic and imaging centers, rehabilitation and physical therapy centers, radiation and oncology therapy centers, physician practices, and various other facilities. As of December 31, 2019, it operated 184 hospitals and 123 freestanding surgery centers located in 21 states and England. HCA Healthcare Inc. has collaboration with Truli to give small and medium-size employers a new option for funding health care coverage in Florida markets. The company was formerly known as HCA Holdings, Inc. HCA Healthcare, Inc. was founded in 1968 and is headquartered in Nashville, Tennessee.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Nashville"}, "HCQ.F": {"short_name": "AMN HEALTHCARE SVS DL-,01", "long_name": "AMN Healthcare Services, Inc.", "summary": "AMN Healthcare Services, Inc. provides healthcare workforce solutions and staffing services to hospitals and healthcare facilities in the United States. It operates through three segments: Nurse and Allied Solutions, Locum Tenens Solutions, and Other Workforce Solutions. It offers travel nurse staffing under the American Mobile, Onward Healthcare, Nurses Rx, Advanced, and O'Grady-Peyton brands; nurse staffing and labor disruption services, a staffing solution under the NurseChoice and HealthSource Global Staffing brands; local, or per diem, staffing for daily shift work under the Nursefinders brand; and locum tenens staffing for specialties, clinicians, and dentists on an independent contractor basis on temporary assignments under the Staff Care and Locum Leaders brands. It also provides allied staffing services, such as skilled nursing facilities, rehabilitation clinics, and retail and mail-order pharmacies under the Med Travelers and Club Staffing brands; physician permanent placement services to hospitals, healthcare facilities, and physician practice groups under the Merritt Hawkins brand, as well as physician executive leadership search services under the B.E. Smith brand; and executive and clinical leadership interim staffing, healthcare executive search, and advisory services. In addition, it offers managed services programs; vendor management systems, including ShiftWise and Medefis technologies; recruitment process outsourcing for permanent hiring needs; workforce optimization services comprising consulting, data analytics, predictive modeling, and SaaS-based scheduling technology under the Smart Square brand; medical coding, clinical documentation improvement, case management, clinical data registry, and auditing and advisory services; digital staffing services; flex pool management; and credentialing software solutions to clinicians and healthcare enterprises. AMN Healthcare Services, Inc. was founded in 1985 and is based in Dallas, Taxas.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Dallas"}, "HCSG": {"short_name": "Healthcare Services Group, Inc.", "long_name": "Healthcare Services Group, Inc.", "summary": "Healthcare Services Group, Inc. provides management, administrative, and operating services to the housekeeping, laundry, linen, facility maintenance, and dietary service departments of nursing homes, retirement complexes, rehabilitation centers, and hospitals in the United States. The company operates through two segments, Housekeeping and Dietary. The Housekeeping segment engages in the cleaning, disinfecting, and sanitizing of resident rooms and common areas of client's facility, as well as laundering and processing of the bed linens, uniforms, resident personal clothing, and other assorted linen items utilized at a client's facility. The Dietary segment provides food purchasing, meal preparation, and professional dietitian services, which include the development of menus that meet the dietary needs of residents. This segment also offers clinical consulting services to facilities. As of December 31, 2019, the company provided its services to approximately 3,000 facilities. Healthcare Services Group, Inc. was founded in 1976 and is headquartered in Bensalem, Pennsylvania.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Bensalem"}, "HNGR": {"short_name": "Hanger, Inc.", "long_name": "Hanger, Inc.", "summary": "Hanger, Inc. provides orthotic and prosthetic (O&P) services; and distributes O&P devices and components, manages O&P networks, and provides therapeutic solutions to patients and businesses in acute, post-acute, and clinic settings in the United States. It operates through two segments, Patient Care and Products & Services. The Patient Care segment owns and operates Hanger clinic, which specializes in the design, fabrication, and delivery of custom O&P devices through patient care clinics and satellite locations; and provides payor network contracting services to other O&P providers. The Products & Services segment procures and distributes O&P parts, componentry, and devices to independent O&P providers; and develops specialized rehabilitation technologies and provides evidence-based clinical programs for post-acute rehabilitation to patients at approximately 4,000 skilled nursing and post-acute providers. This segment also manufactures and sells therapeutic footwear for diabetic patients in the podiatric market. As of December 31, 2019, the company operated approximately 701 patient care clinics, and 111 satellite locations in 46 states and the District of Columbia. The company was formerly known as Hanger Orthopedic Group, Inc. and changed its name to Hanger, Inc. in June 2012. Hanger, Inc. was founded in 1861 and is headquartered in Austin, Texas.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Austin"}, "HQDA": {"short_name": "HQDA ELDERLY LIFE NETWORK CORP", "long_name": "HQDA Elderly Life Network Corp.", "summary": "HQDA Elderly Life Network Corp. focuses on providing senior housing and retirement services and products in China. The company was formerly known as Hartford Retirement Network Corp. and changed its name to HQDA Elderly Life Network Corp. in June 2018. The company was founded in 2004 and is headquartered in Rosemead, California. HQDA Elderly Life Network Corp. is a subsidiary of HQDA International Holdings Ltd.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Rosemead"}, "HSOA.F": {"short_name": "ENCOMP.HEALT.CORP. DL-,01", "long_name": "Encompass Health Corporation", "summary": "Encompass Health Corporation provides facility-based and home-based post-acute healthcare services in the United States. The company operates through two segments, Inpatient Rehabilitation, and Home Health and Hospice. The Inpatient Rehabilitation segment provides specialized rehabilitative treatment on an inpatient and outpatient basis to patients who are recovering from conditions, such as stroke and other neurological disorders, cardiac and pulmonary conditions, brain and spinal cord injuries, complex orthopedic conditions, and amputations. The Home Health and Hospice segment provides home health and hospice services primarily in the Southeast and Texas. Its home health services include a range of Medicare-certified home nursing services to adult patients in need of care comprising skilled nursing, medical social work, and home health aide services, as well as physical, occupational, speech therapy, and others. This segment's hospice services comprise in-home services to terminally ill patients and their families to address patients' physical needs, including pain control and symptom management, and to provide emotional and spiritual support. As of November 16, 2020, Encompass Health Corporation operated 137 hospitals, 242 home health locations, and 83 hospice locations in 39 states and Puerto Rico. The company was formerly known as HealthSouth Corporation and changed its name to Encompass Health Corporation in January 2018. Encompass Health Corporation was founded in 1983 and is based in Birmingham, Alabama.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Birmingham"}, "HTW.MU": {"short_name": "NATL HEALTHCARE CORP.", "long_name": "National HealthCare Corporation", "summary": "National HealthCare Corporation operates, manages, and provides services to skilled nursing facilities, assisted living facilities, independent living facilities, and home health care programs. Its skilled nursing facilities offer licensed therapy services, nutrition services, social services, activities, and housekeeping and laundry services, as well as medical services prescribed by physicians; and rehabilitative services, such as physical, speech, respiratory, and occupational therapy for patients recovering from strokes, heart attacks, orthopedic conditions, neurological illnesses, or other illnesses, injuries, or disabilities. The company's medical specialty units comprise memory care units and subacute nursing units that provide specialized care and programs for persons with Alzheimer's or related disorders; and assisted living centers offer personal care services and assistance with general activities of daily living, such as dressing, bathing, meal preparation, and medication management. It also owns, leases, and manages independent living facilities that provide specially designed residential units for the active and ambulatory elderly, as well as offers various ancillary services for its residents, including restaurants, activity rooms, and social areas. In addition, it provides health care programs that offer skilled services, such as infusion, wound care and physical, occupational, and speech therapies; operates pharmacies; offers management, accounting, financial, and insurance services; and leases its properties to third party operators. As of December 31, 2019, the company operated 75 skilled nursing facilities with 9,513 licensed beds; 25 assisted living facilities; 5 independent living facilities; 35 homecare programs; and 4 pharmacy locations. National HealthCare Corporation was founded in 1971 and is based in Murfreesboro, Tennessee.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "MUN", "market": "dr_market", "country": "United States", "city": "Murfreesboro"}, "HY1N.F": {"short_name": "ONTRAK INC.  DL -,0001", "long_name": "Ontrak, Inc.", "summary": "Ontrak, Inc. operates as an artificial intelligence powered, virtualized outpatient healthcare treatment company that provides in-person or telehealth intervention services to health plans and other third-party payors. Its Ontrak PRE (Predict-Recommend-Engage) platform predicts people whose chronic disease will improve with behavior change, recommends care pathways that people are willing to follow, and engages people who aren't getting the care they need. The company's technology-enabled, OnTrak, program is designed to treat health plan members with unaddressed behavioral health conditions that cause or exacerbate chronic medical diseases, such as diabetes, hypertension, coronary artery disease, COPD, and congestive heart failure. The OnTrak integrates evidence-based psychosocial and medical interventions delivered in-person or via telehealth along with care coaching and in-market community care coordinators who address the social and environmental determinants of health. The company was formerly known as Catasys, Inc. and changed its name to Ontrak, Inc. in July 2020. The company was founded in 2003 and is headquartered in Santa Monica, California.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Santa Monica"}, "I02.F": {"short_name": "IMAC HOLDINGS  DL-,001", "long_name": "IMAC Holdings, Inc.", "summary": "IMAC Holdings, Inc. provides orthopedic therapies through a chain of innovative medical advancements and care regeneration centers in the United States. Its outpatient medical clinics provide regenerative, orthopedic, and minimally invasive procedures and therapies to patients with sports injuries, back pain, knee pain, joint pain, ligament and tendon damage, and other related soft tissue conditions. As of March 26, 2020, the company owned or managed 14 outpatient clinics in Kentucky, Missouri, Tennessee, and Illinois. IMAC Holdings, Inc. was founded in 2000 and is based in Brentwood, Tennessee.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Brentwood"}, "IMAC": {"short_name": "IMAC Holdings, Inc.", "long_name": "IMAC Holdings, Inc.", "summary": "IMAC Holdings, Inc. provides orthopedic therapies through a chain of innovative medical advancements and care regeneration centers in the United States. Its outpatient medical clinics provide regenerative, orthopedic, and minimally invasive procedures and therapies to patients with sports injuries, back pain, knee pain, joint pain, ligament and tendon damage, and other related soft tissue conditions. As of March 26, 2020, the company owned or managed 14 outpatient clinics in Kentucky, Missouri, Tennessee, and Illinois. IMAC Holdings, Inc. was founded in 2000 and is based in Brentwood, Tennessee.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Brentwood"}, "IOM.V": {"short_name": "ASSURE HOLDINGS CORP", "long_name": "Assure Holdings Corp.", "summary": "Assure Holdings Corp., together with its subsidiaries, provides technical and professional intraoperative neuromonitoring surgical support services primarily associated with spine and head surgeries. The company is based in Denver, Colorado.", "currency": "CAD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "VAN", "market": "ca_market", "country": "United States", "city": "Denver"}, "JYNT": {"short_name": "The Joint Corp.", "long_name": "The Joint Corp.", "summary": "The Joint Corp. develops, owns, operates, supports, and manages chiropractic clinics in the United States. The company operates through two segments, Corporate Clinics and Franchise Operations. It operates through direct ownership, management arrangements, franchising and the sale of regional developer rights. As of December 31, 2019, the company operated approximately 513 clinics in the United States. The company was founded in 2010 and is headquartered in Scottsdale, Arizona.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NCM", "market": "us_market", "country": "United States", "city": "Scottsdale"}, "KSQR": {"short_name": "KENDALL SQUARE RESEARCH CORPORA", "long_name": "Kendall Square Research Corp", "summary": "Kendall Square Research Corp, through its subsidiary, Luxury Kitchen Hoods LLC, manufactures specialty equipment for residential home customers. It primarily offers ventilation hoods. Kendall Square Research Corp was incorporated in 2005 and is based in Salt Lake City, Utah.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Salt Lake City"}, "LHCG": {"short_name": "LHC Group", "long_name": "LHC Group, Inc.", "summary": "LHC Group, Inc., a health care provider, specializes in the post-acute continuum of care primarily for Medicare beneficiaries in the United States. The company's Home Health Services segment offers home nursing services, including wound care and dressing changes, cardiac rehabilitation, infusion therapy, pain management, pharmaceutical administration, skilled observation and assessment, and patient education; medically-oriented social services; and physical, occupational, and speech therapy services. Its Hospice Services segment provides pain and symptom management accompanied by palliative medication, emotional and spiritual support, inpatient and respite care, homemaker services, dietary counseling, family bereavement counseling, and social worker visits. The company's Home and Community-Based Services segment offers services, such as assistance with grooming, medication reminders, meal preparation, assistance with feeding, light housekeeping, respite care, transportation, and errand services to patients in their home or in a medical facility. Its Facility-Based Services segment serves patients suffering from respiratory failure, neuromuscular disorders, cardiac disorders, non-healing wounds, renal disorders, cancer, head and neck injuries, and mental disorders, as well as treats patients diagnosed with musculoskeletal impairments; and operates institutional pharmacy, a family health center, a rural health clinic, and a retail pharmacy, as well as offers physical therapy services. The company's Healthcare Innovations (HCI) Services segment provides strategic health management services to Accountable Care Organizations. As of December 31, 2019, it operated 553 home health services locations, 110 hospice locations, 107 community-based service locations, 11 long-term acute care hospitals with 13 locations, and 10 HCI locations. The company was founded in 1994 and is based in Lafayette, Louisiana.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Lafayette"}, "MAHN": {"short_name": "MID-ATLANTIC HOME HEALTH NETWOR", "long_name": "Mid-Atlantic Home Health Network, Inc.", "summary": "Mid-Atlantic Home Health Network, Inc. provides integrated home health products and services for the home health care industry in Virginia, Maryland, and the District of Columbia. It also provides healthcare staffing and private duty nursing services to hospitals, nursing homes, and other facilities, such as clinics, correctional facilities, and schools. Mid-Atlantic was incorporated as U-Can Resources, Inc. in 1979. The company changed its name to Petro-Sers Corporation in 1993 and to Mid-Atlantic Home Health Network, Inc. in 1994. The company is based in Manassas, Virginia. Mid-Atlantic Home Health Network, Inc. is 80% owned by Oak Springs NursingHome Limited Liability Company.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Manassas"}, "MD": {"short_name": "Mednax, Inc.", "long_name": "MEDNAX, Inc.", "summary": "MEDNAX, Inc., together with its subsidiaries, provides newborn, anesthesia, maternal-fetal, radiology and teleradiology, pediatric cardiology, and other pediatric subspecialty physician services in the United States and Puerto Rico. It offers neonatal care services, such as clinical care to babies born prematurely or with complications within specific units at hospitals through neonatal physician subspecialists, neonatal nurse practitioners, and other pediatric clinicians; anesthesia and anesthesia subspecialty care services; and acute and chronic pain management services. The company also provides maternal-fetal care services, including inpatient and office-based clinical care to expectant mothers and their unborn babies through affiliated maternal-fetal medicine subspecialists, as well as obstetricians and other clinicians. In addition, it offers pediatric cardiology care services comprising inpatient and office-based pediatric cardiology care of the fetus, infant, child, and adolescent patients with congenital heart defects and acquired heart disease, as well as adults with congenital heart defects through affiliated pediatric cardiologist subspecialists and other related clinical professionals. Further, the company provides other pediatric subspecialty care services through pediatric subspecialists, such as pediatric intensivists, pediatric hospitalists, pediatric surgeons, pediatric ophthalmology, other newborn pediatric care, and newborn hearing screening program, as well as pediatric ear, nose, and throat physicians; and support services in the areas of hospitals, primarily in the pediatric emergency rooms, labor and delivery areas, and nursery and pediatric departments. Additionally, it offers consulting services to healthcare facilities and physicians. As of March 12, 2020, the company operated a network of approximately 4,325 physicians. MEDNAX, Inc. was founded in 1979 and is based in Sunrise, Florida.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Sunrise"}, "MIHI": {"short_name": "MEDICAL INNOVATION HOLDINGS INC", "long_name": "Medical Innovation Holdings, Inc.", "summary": "Medical Innovation Holdings, Inc. focuses on establishing a multi-disciplinary medical specialist provider/practice network to serve rural patient population through telemedicine program. Its integrated practice management system provides electronic medical records/electronic health records, patient scheduling, real time insurance verification, billing, video conferencing, and various systems in an end to end technology platform coupled with the components of a telehealth delivery system. The company is based in Duluth, Georgia.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Duluth"}, "MODV": {"short_name": "ModivCare Inc.", "long_name": "ModivCare Inc.", "summary": "ModivCare Inc., a technology-enabled healthcare services company, provides a suite of integrated supportive care solutions for public and private payors and patients. It offers non-emergency medical transportation services for Medicaid or Medicare eligible members, whose limited mobility or financial resources hinder their ability to access necessary healthcare and social services. The company also provides in-home care optimization services, including comprehensive health assessments through a network of community-based clinicians and a fleet of mobile health clinics. The company was formerly known as The Providence Service Corporation and changed its name to ModivCare Inc. in January 2021.The company was founded in 1996 and is headquartered in Denver, Colorado.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Denver"}, "MSGP": {"short_name": "MEDSMART GROUP INC", "long_name": "MedSmart Group Inc.", "summary": "MedSmart Group Inc. owns and operates a professional network of MedSmart wellness centers specializing in anti-aging treatments. Its services include testosterone replacement therapy, cryogen therapy, hormone restoration, hypothyroidism, allergies, high cholesterol, hypertension, diabetes, Smart Diet, vein treatment, laser hair removal, hair loss treatment, Medi-Fast program, and erectile dysfunction treatment. MedSmart Group Inc. is based in Bay Harbor Islands, Florida.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Bay Harbor Islands"}, "NAFS": {"short_name": "NORTH AMERICA FRAC SAND INC", "long_name": "North America Frac Sand, Inc.", "summary": "North America Frac Sand, Inc., doing business as Voycare, provides telemedicine and medical tourism services in the United States. It enables overseas patients gain access to health care primarily in the fields of oncology, in vitro fertilization, cosmetic surgery, and wellness. The company primarily serves Chinese outbound travelers to North and South America. The company was founded in 2019 and is based in Covina, California with office in Shanghai, China.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Covina"}, "NHC": {"short_name": "National HealthCare Corporation", "long_name": "National HealthCare Corporation", "summary": "National HealthCare Corporation operates, manages, and provides services to skilled nursing facilities, assisted living facilities, independent living facilities, and home health care programs. Its skilled nursing facilities offer licensed therapy services, nutrition services, social services, activities, and housekeeping and laundry services, as well as medical services prescribed by physicians; and rehabilitative services, such as physical, speech, respiratory, and occupational therapy for patients recovering from strokes, heart attacks, orthopedic conditions, neurological illnesses, or other illnesses, injuries, or disabilities. The company's medical specialty units comprise memory care units and subacute nursing units that provide specialized care and programs for persons with Alzheimer's or related disorders; and assisted living centers offer personal care services and assistance with general activities of daily living, such as dressing, bathing, meal preparation, and medication management. It also owns, leases, and manages independent living facilities that provide specially designed residential units for the active and ambulatory elderly, as well as offers various ancillary services for its residents, including restaurants, activity rooms, and social areas. In addition, it provides health care programs that offer skilled services, such as infusion, wound care and physical, occupational, and speech therapies; operates pharmacies; offers management, accounting, financial, and insurance services; and leases its properties to third party operators. As of December 31, 2019, the company operated 75 skilled nursing facilities with 9,513 licensed beds; 25 assisted living facilities; 5 independent living facilities; 35 homecare programs; and 4 pharmacy locations. National HealthCare Corporation was founded in 1971 and is based in Murfreesboro, Tennessee.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Murfreesboro"}, "NHLG": {"short_name": "NATIONAL HEALTHCARE LOGISTICS", "long_name": "National Healthcare Logistics Inc.", "summary": "National Healthcare Logistics Inc. engages in contracting with healthcare providers to reengineer logistical processes for supply chain management. The company, formerly known as BCH Systems, Inc, was incorporated in 1999 and changed its name to National Healthcare Logistics Inc. in 2005. National Healthcare Logistics Inc. is based in Cleveland, Tennessee.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Cleveland"}, "NMSCA": {"short_name": "NUTRITION MANAGEMENT SERVICES C", "long_name": "Nutrition Management Services Company", "summary": "Nutrition Management Services Company provides food, nutrition, and facilities management services in the United States. The company offers environmental management support solutions and cook/chill operation services. It serves long-term care facilities, independent and assisted living facilities, continuing care retirement communities, acute care hospitals, rehabilitation centers, and psychiatric and chemical dependency facilities, as well as nursing care centers and private schools. The company was founded in 1979 and is based in Kimberton, Pennsylvania.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Kimberton"}, "NOVC": {"short_name": "NOVATION COMPANIES INC", "long_name": "Novation Companies, Inc.", "summary": "Novation Companies, Inc., through its subsidiary, Healthcare Staffing, Inc., provides outsourced health care staffing and related services in Georgia. It also provides its services to hospitals, schools, crisis units, clinics, doctor's offices, prisons, and various privately owned businesses. The company was formerly known as NovaStar Financial, Inc. and changed its name to Novation Companies, Inc. in May 2012. Novation Companies, Inc. was founded in 1996 and is based in Kansas City, Missouri.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Kansas City"}, "NRTSF": {"short_name": "NOBILIS HEALTH CORPORATION", "long_name": "Nobilis Health Corp.", "summary": "Nobilis Health Corp. owns and manages ambulatory surgical centers (ASCs), and acute-care and surgical hospitals in the United States. It operates through two segments, Medical Services and Marketing. The company's healthcare facilities provides surgical procedures in various clinical specialties, including orthopedic surgery, podiatric, vein and vascular, pain management, gastro- intestinal, gynecology, and general, as well as ear, nose, and throat. It also provides marketing services, patient education services, and patient care co-ordination management services to third party facilities and physicians. As of December 4, 2017, it operated 32 locations, including 5 hospitals, 14 ASCs, and 13 multi-specialty clinics. The company was formerly known as Northstar Healthcare Inc. and changed its name to Nobilis Health Corp. in December 2014. Nobilis Health Corp. was founded in 2007 and is based in Houston, Texas. On October 21, 2019, Nobilis Health Corp. filed a voluntary petition for liquidation under Chapter 7 in the U.S. Bankruptcy Court for the District of Delaware. It is in joint administration with Northstar Healthcare Holdings, Inc.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "NVOS": {"short_name": "NOVO INTEGRATED SCIENCES INC", "long_name": "Novo Integrated Sciences, Inc.", "summary": "Novo Integrated Sciences, Inc., together with its subsidiaries, provides primary healthcare services. It offers physiotherapy, chiropractic care, manual/manipulative therapy, occupational therapy, eldercare, massage therapy, acupuncture and functional dry needling, chiropody, stroke and traumatic brain injury/neurological rehabilitation, kinesiology, vestibular therapy, concussion management and baseline testing, trauma sensitive yoga and meditation for concussion-acquired brain injury and occupational stress-PTSD, women's pelvic health program, sports medicine therapy, assistive devices, dietitian, holistic nutrition, fall prevention education, sports team conditioning program, and private personal training services. The company also engages in the assessment, diagnosis, treatment, pain management, rehabilitation, education, and prevention of various orthopedic, musculoskeletal, sports injury, and neurological conditions. In addition, it offers specialty treatment and recovery programs derived from motor vehicle accident injuries, long-term disability cases, corporate wellness, and job-site injuries. Further, the company provides cold laser therapeutics, shockwave therapy, custom bracing and orthotics, custom compression therapy/stockings, and lymphatic drainage treatment. It operates 16 owned clinics, a contracted network of 102 affiliate clinics, and 220 eldercare related care homes, as well as retirement homes and community-based locations in Canada. The company is based in Bellevue, Washington. Novo Integrated Sciences, Inc. is a subsidiary of ALMC-ASAP Holdings, Inc.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Bellevue"}, "NXGT": {"short_name": "NEXTELIGENT HOLDINGS INC", "long_name": "Nexteligent Holdings, Inc.", "summary": "Nexteligent Holdings, Inc. operates as an aggregator of healthcare professional services and technology firms. The company provides professional services in telemedicine, consulting, and financial management. Its Telemedicine Solutions division develops and manages remote care and technology programs aimed at containing costs, improving productivity, and enhancing the quality of medical encounters at healthcare institutions serving the eldercare sector, as well as municipalities and not-for-profit organizations. The company's Financial Services division provides end-to-end revenue cycle management solutions and denials recovery for hospital systems, doctor groups, clinics, and long term care operators. This division also offers turnkey solutions for preventative care services, such as chronic care management, annual wellness visit, transitional care management, behavioral health, and remote telemonitoring. Nexteligent Holdings, Inc. is headquartered in Avon, Connecticut.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Avon"}, "OHAQ": {"short_name": "ORACLE HEALTHCARE ACQUISITION C", "long_name": "Oracle Healthcare Acquisition Corp.", "summary": "Oracle Healthcare Acquisition Corp. does not have significant operations. It intends to acquire an operating business in the healthcare industry through a merger, capital stock exchange, asset acquisition, or other similar business combination. The company focuses its search for an acquisition candidate in the segments, such as healthcare services, medical devices and products, healthcare information technology, pharmaceuticals, diagnostics, biotechnology therapeutics, and life sciences. Oracle Healthcare Acquisition Corp. was founded in 2005 and is headquartered in Greenwich, Connecticut.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Greenwich"}, "OPCH": {"short_name": "Option Care Health, Inc.", "long_name": "Option Care Health, Inc.", "summary": "Option Care Health, Inc. offers independent home and alternate site infusion services in the United States. The company provides immunoglobulin infusion therapy designed for the treatment of immune deficiencies; anti-infective therapy and services; infusion therapies for bleeding disorders; and other infusion therapies to treat various conditions, including heart failure, pain management, chemotherapy, and respiratory medications. It also offers home parenteral nutrition and enteral nutrition support services for numerous acute and chronic conditions, such as stroke, cancer, and gastrointestinal diseases, as well as offers nursing services. Option Care Health, Inc. has a collaboration with Amedisys, Inc. to provide COVID antibody infusion therapy within skilled nursing and assisted living facilities. The company is headquartered in Bannockburn, Illinois.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Bannockburn"}, "OPMC": {"short_name": "OPTIMUMCARE CORP", "long_name": "Optimum Care Corporation", "summary": "Optimum Care Corporation provides healthcare services. The company offers various inpatient and partial hospitalization behavioral health services for patients with acute mental illness through a network of affiliated hospitals, medical centers, and community mental health centers. It also provides assisted living services in a resort atmosphere. The company was founded in 1986 and is headquartered in Laguna Niguel, California.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Laguna Niguel"}, "OSH": {"short_name": "Oak Street Health, Inc.", "long_name": "Oak Street Health, Inc.", "summary": "Oak Street Health, Inc., through its subsidiaries, offers healthcare services to the patients in the United States. The company operates primary care centers for Medicare beneficiaries. As of September 30, 2020, it operated 67 centers in Illinois, Indiana, Michigan, North Carolina, Ohio, Pennsylvania, Rhode Island, Tennessee, and Texas. The company was founded in 2012 and is headquartered in Chicago, Illinois.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Chicago"}, "OTRK": {"short_name": "Ontrak, Inc.", "long_name": "Ontrak, Inc.", "summary": "Ontrak, Inc. operates as an artificial intelligence powered, virtualized outpatient healthcare treatment company that provides in-person or telehealth intervention services to health plans and other third-party payors. Its Ontrak PRE (Predict-Recommend-Engage) platform predicts people whose chronic disease will improve with behavior change, recommends care pathways that people are willing to follow, and engages people who aren't getting the care they need. The company's technology-enabled, OnTrak, program is designed to treat health plan members with unaddressed behavioral health conditions that cause or exacerbate chronic medical diseases, such as diabetes, hypertension, coronary artery disease, COPD, and congestive heart failure. The OnTrak integrates evidence-based psychosocial and medical interventions delivered in-person or via telehealth along with care coaching and in-market community care coordinators who address the social and environmental determinants of health. The company was formerly known as Catasys, Inc. and changed its name to Ontrak, Inc. in July 2020. The company was founded in 2003 and is headquartered in Santa Monica, California.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Santa Monica"}, "OTRKP": {"short_name": "Ontrak, Inc. - 9.50% Series A C", "long_name": "Ontrak, Inc.", "summary": "Ontrak, Inc. operates as an artificial intelligence powered, virtualized outpatient healthcare treatment company that provides in-person or telehealth intervention services to health plans and other third-party payors. Its Ontrak PRE (Predict-Recommend-Engage) platform predicts people whose chronic disease will improve with behavior change, recommends care pathways that people are willing to follow, and engages people who aren't getting the care they need. The company's technology-enabled, OnTrak, program is designed to treat health plan members with unaddressed behavioral health conditions that cause or exacerbate chronic medical diseases, such as diabetes, hypertension, coronary artery disease, COPD, and congestive heart failure. The OnTrak integrates evidence-based psychosocial and medical interventions delivered in-person or via telehealth along with care coaching and in-market community care coordinators who address the social and environmental determinants of health. The company was formerly known as Catasys, Inc. and changed its name to Ontrak, Inc. in July 2020. The company was founded in 2003 and is headquartered in Santa Monica, California.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Santa Monica"}, "PAOG": {"short_name": "PAO GROUP INC", "long_name": "PAO Group, Inc.", "summary": "PAO Group, Inc. focuses on alternative patient care treatments. The company, through its subsidiaries, engages in the development, sale, and distribution of premium medical cannabis products for treatment of chronic and terminal patients. The company is headquartered in Sandusky, Ohio.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Sandusky"}, "PDC.F": {"short_name": "MEDNAX INC.  DL-,01", "long_name": "MEDNAX, Inc.", "summary": "MEDNAX, Inc., together with its subsidiaries, provides newborn, anesthesia, maternal-fetal, radiology and teleradiology, pediatric cardiology, and other pediatric subspecialty physician services in the United States and Puerto Rico. It offers neonatal care services, such as clinical care to babies born prematurely or with complications within specific units at hospitals through neonatal physician subspecialists, neonatal nurse practitioners, and other pediatric clinicians; anesthesia and anesthesia subspecialty care services; and acute and chronic pain management services. The company also provides maternal-fetal care services, including inpatient and office-based clinical care to expectant mothers and their unborn babies through affiliated maternal-fetal medicine subspecialists, as well as obstetricians and other clinicians. In addition, it offers pediatric cardiology care services comprising inpatient and office-based pediatric cardiology care of the fetus, infant, child, and adolescent patients with congenital heart defects and acquired heart disease, as well as adults with congenital heart defects through affiliated pediatric cardiologist subspecialists and other related clinical professionals. Further, the company provides other pediatric subspecialty care services through pediatric subspecialists, such as pediatric intensivists, pediatric hospitalists, pediatric surgeons, pediatric ophthalmology, other newborn pediatric care, and newborn hearing screening program, as well as pediatric ear, nose, and throat physicians; and support services in the areas of hospitals, primarily in the pediatric emergency rooms, labor and delivery areas, and nursery and pediatric departments. Additionally, it offers consulting services to healthcare facilities and physicians. As of March 12, 2020, the company operated a network of approximately 4,325 physicians. MEDNAX, Inc. was founded in 1979 and is based in Sunrise, Florida.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Sunrise"}, "PHMB": {"short_name": "PHARMACOM BIOVET INC", "long_name": "PharmaCom BioVet, Inc.", "summary": "PharmaCom BioVet, Inc. focuses on operating a network of companion animal cancer treatment centers in the United States. The company focuses on developing bone marrow transplantation and other cancer treatment procedures to benefit companion animals that are diagnosed with lymphoma, other different types of cancers, and other diseases that are incurable. It has licensed a series of proprietary devices and compounds that would reduce suffering in animals with cancer. The company was formerly known as ABV Gold Inc. and changed its name to PharmaCom BioVet, Inc. in August 2008. PharmaCom BioVet, Inc. was incorporated in 1995 and is headquartered in Raleigh, North Carolina.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Raleigh"}, "PNTG": {"short_name": "The Pennant Group, Inc.", "long_name": "The Pennant Group, Inc.", "summary": "The Pennant Group, Inc. provides healthcare services in Arizona, California, Colorado, Idaho, Iowa, Montana, Nevada, Oklahoma, Oregon, Texas, Utah, Washington, Wisconsin, and Wyoming. It operates in two segments, Home Health and Hospice Services, and Senior Living Services. The company offers home health services, including clinical services, such as nursing, speech, occupational and physical therapy, medical social work, and home health aide services; and hospice services comprising clinical care, education, counseling, and palliative services for the physical, spiritual, and psychosocial needs of terminally ill patients and their families. It also provides senior living services, such as residential accommodations, activities, and meals, as well as housekeeping and assistance in the activities of daily living to seniors, who are independent or who require some support. As of November 5, 2020, the company operated 75 home health and hospice agencies; and 54 senior living communities. The Pennant Group, Inc. was founded in 2019 and is headquartered in Eagle, Idaho.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Eagle"}, "PPRG": {"short_name": "PATIENT PORTAL TECHNOLOGIES INC", "long_name": "Patient Portal Technologies, Inc.", "summary": "Patient Portal Technologies, Inc. provides patient relationship management solutions for healthcare facilities, patients and families, and medical personnel. It offers HEALTHCAST, a multi-channel, television network for the delivery of customized information and education to patients, visitors, and staff; MEDEX PRESCRIPTION DELIVERY, a free prescription medication delivery solution; and PHONE & TV RENTAL, an interactive communication center, and billing and collection platform. The company also provides TELCIERGE INSTANT RESPONSE that puts patients in control of non-medical needs through a single phone call; QUICK PULSE SURVEYS that provide feedback for improved operations; and MEDCLIPS, which provide condition specific video clips for internal or remote viewing before or after hospital stay. Patient Portal Technologies, Inc. is based in Baldwinsville, New York.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Baldwinsville"}, "PRF0.F": {"short_name": "MODIVCARE INC. DL-,001", "long_name": "ModivCare Inc.", "summary": "ModivCare Inc., a technology-enabled healthcare services company, provides a suite of integrated supportive care solutions for public and private payors and patients. It offers non-emergency medical transportation services for Medicaid or Medicare eligible members, whose limited mobility or financial resources hinder their ability to access necessary healthcare and social services. The company also provides in-home care optimization services, including comprehensive health assessments through a network of community-based clinicians and a fleet of mobile health clinics. The company was formerly known as The Providence Service Corporation and changed its name to ModivCare Inc. in January 2021.The company was founded in 1996 and is headquartered in Denver, Colorado.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Denver"}, "RHE": {"short_name": "Regional Health Properties, Inc", "long_name": "Regional Health Properties, Inc.", "summary": "Regional Health Properties, Inc., through its subsidiaries, operates as a self-managed healthcare real estate investment company that invests primarily in real estate purposed for long-term and senior living. The company's facilities offer a range of health care and related services to patients and residents, including skilled nursing and assisted living services, social services, various therapy services, and other rehabilitative and healthcare services for long-term and short-stay patients and residents. As of April 2, 2020, it owned, leased, or managed 24 facilities for third parties comprising 2,517 operational beds/units in Alabama, Georgia, North Carolina, Ohio, and South Carolina. The company was founded in 1988 and is headquartered in Suwanee, Georgia.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Suwanee"}, "SCAL": {"short_name": "STEM CELL AUTHORITY LTD", "long_name": "Stem Cell Authority, Ltd.", "summary": "Stem Cell Authority, Ltd., a technology development company, focuses on the collection and cryogenic preservation of stem cells. It specializes in the collection and cryogenic preservation of the hematopoietic stem cells from the umbilical cord blood; and the Miracle Mesenchymal stem cells from the Wharton's jelly inside the umbilical cord of a newborn child. The company's technology enables birthing professionals with a stem cell preservation program to serve their maternity patients in the United States. Stem Cell Authority, Ltd. is based in Fairlawn, Ohio.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Fairlawn"}, "SEM": {"short_name": "Select Medical Holdings Corpora", "long_name": "Select Medical Holdings Corporation", "summary": "Select Medical Holdings Corporation, through its subsidiary, Select Medical Corporation, operates critical illness recovery hospitals, rehabilitation hospitals, outpatient rehabilitation clinics, and occupational health centers in the United States. The company's Critical Illness Recovery Hospital segment consists of hospitals that provide services for heart failure, infectious disease, respiratory failure and pulmonary disease, surgery requiring prolonged recovery, renal disease, neurological events, and trauma. Its Rehabilitation Hospital segment offers therapy and rehabilitation treatments, including rehabilitative services for brain and spinal cord injuries, strokes, amputations, neurological disorders, orthopedic conditions, pediatric congenital or acquired disabilities, and cancer. The company's Outpatient Rehabilitation segment operates rehabilitation clinics that provide physical, occupational, and speech rehabilitation programs and services; and specialized programs, such as functional programs for work related injuries, hand therapy, post-concussion rehabilitation, pediatric and cancer rehabilitation, and athletic training services. Its Concentra segment operates and provides occupational health centers and contract services at employer worksites that deliver occupational medicine, physical therapy, and consumer health services, as well as provides veterans' healthcare services. As of December 31, 2019, the company operated 101 critical illness recovery hospitals in 29 states; 29 rehabilitation hospitals in 12 states; 1,740 outpatient rehabilitation clinics in 37 states and the District of Columbia; and 521 occupational health centers, 131 onsite clinics at employer worksites, and 32 Department of Veterans Affairs CBOCs in 43 states. Select Medical Holdings Corporation was founded in 1996 and is headquartered in Mechanicsburg, Pennsylvania.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Mechanicsburg"}, "SETO": {"short_name": "SETO HLDGS INC", "long_name": "SETO Holdings, Inc.", "summary": "SETO Holdings, Inc., a development stage company, provides healthcare services. Its Health division offers health care services throughout the Mid-Atlantic region of the United States. The company is developing a surgical center in Maryland and 4 diabetes clinics through its existing locations and in association with other health practitioners. The company's Hearing Care Group provides hearing health care through its 15 clinics in the Mid Atlantic region. SETO Holdings is also engaged in helping to establish a hospital facility in India. The company was founded in 2004 and is based in Hanover, Maryland.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Hanover"}, "SGRY": {"short_name": "Surgery Partners, Inc.", "long_name": "Surgery Partners, Inc.", "summary": "Surgery Partners, Inc., through its subsidiaries, owns and operates a network of surgical facilities and related services in the United States. The company operates through three segments: Surgical Facility Services, Ancillary Services, and Optical Services. Its surgical facilities comprise ambulatory surgery centers and surgical hospitals that offer non-emergency surgical procedures in various specialties, including gastroenterology, general surgery, ophthalmology, orthopedics, and pain management. The company's surgical hospitals also provide ancillary services, such as diagnostic imaging, pharmacy, laboratory, obstetrics, oncology, physical therapy, and wound care; and ancillary services, which consist of a diagnostic laboratory, multi-specialty physician practices, urgent care facilities, anesthesia services, and optical services. It also operates optical laboratory that manufactures eyewear. As of March 31, 2020, the company owned or operated a portfolio of 127 surgical facilities, including 111 ambulatory surgical centers and 16 surgical hospitals in 30 states. Surgery Partners, Inc. was founded in 2004 and is headquartered in Brentwood, Tennessee.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Brentwood"}, "SMTI": {"short_name": "Sanara MedTech Inc.", "long_name": "Sanara MedTech Inc.", "summary": "Sanara MedTech Inc. develops, markets, and distributes wound and skin care products to physicians, hospitals, clinics, and post-acute care settings in the United States. The company offers CellerateRX Surgical Activated Collagen Adjuvant powder that helps in the natural wound healing process; BiakoÂ¯s Antimicrobial Skin & Wound Cleanser, a patented wound cleansing spray that disrupts extracellular polymeric substances to eradicate biofilm; and BiakoÂ¯s Antimicrobial Skin & Wound Irrigation Solution that works to irrigate and remove microbes from the wound bed to help eliminate planktonic, immature, and mature biofilms. It also provides BiakoÂ¯s Antimicrobial Wound Gel, a patented gel that synergistically disrupts extracellular polymeric substances to help eliminate biofilm microbes in the gel to help in wound healing; HYCOL Hydrolyzed Collagen, an additive free Type I bovine collagen that offers hydrolyzed collagen fragments to the wound bed that are a fraction of the size of native collagen; and PULSAR II Advanced Wound Irrigation Debridement System, a portable and no touch hydro-mechanical debridement system that removes bacteria and necrotic tissue without disrupting healthy tissue. The company was formerly known as WNDM Medical Inc. and changed its name to Sanara MedTech Inc. in May 2019. Sanara MedTech Inc. was incorporated in 2001 and is based in Fort Worth, Texas.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Fort Worth"}, "SPIN": {"short_name": "SPINE INJURY SOLUTIONS INC", "long_name": "Spine Injury Solutions, Inc.", "summary": "Spine Injury Solutions, Inc., together with its subsidiaries, operates as a technology, marketing, billing, and collection company that provides diagnostic services for patients with spine injuries resulting from traumatic accidents. The company offers turnkey solutions to spine surgeons, orthopedic surgeons, and other healthcare providers for the treatment of musculo-skeletal spine injuries resulting from automobile and work-related accidents. It manages four spine injury diagnostic centers located in Houston, Odessa, and Tyler, Texas; and Las Cruces, New Mexico. The company was formerly known as Spine Pain Management Inc. and changed its name to Spine Injury Solutions, Inc. in October 2015. Spine Injury Solutions, Inc. was founded in 1998 and is based in Houston, Texas.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "THC": {"short_name": "Tenet Healthcare Corporation", "long_name": "Tenet Healthcare Corporation", "summary": "Tenet Healthcare Corporation operates as a diversified healthcare services company. The company operates through three segments: Hospital Operations and Other, Ambulatory Care, and Conifer. Its general hospitals offer acute care services, operating and recovery rooms, radiology and respiratory therapy services, clinical laboratories, and pharmacies. The company also provides intensive and critical care, and coronary care units; cardiovascular, digestive disease, neurosciences, musculoskeletal, and obstetrics services; outpatient services, including physical therapy; cardiothoracic surgery, complex spinal surgery, neonatal intensive care, and neurosurgery services; quaternary care services in heart and kidney transplants; and limb-salvaging vascular procedures, acute level 1 trauma services, intravascular stroke care, minimally invasive cardiac valve replacement, imaging technology, and telemedicine access for various medical specialties. In addition, it operates ambulatory surgery and urgent care centers, imaging centers, surgical, off-campus emergency, and micro-hospitals; and offers healthcare business process services in the areas of hospital and physician revenue cycle management, as well as value-based care solutions to healthcare systems, individual hospitals, physician practices, self-insured organizations, health plans, and other entities. As of December 31, 2019, the company operated 65 hospitals, 24 surgical hospitals, and approximately 159 outpatient centers, as well as 260 ambulatory surgery, 39 urgent care, and 23 imaging centers in the United States. Tenet Healthcare Corporation was incorporated in 1975 and is headquartered in Dallas, Texas.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Dallas"}, "THC1.F": {"short_name": "TENET HEALTHCARE  DL-,05", "long_name": "Tenet Healthcare Corporation", "summary": "Tenet Healthcare Corporation operates as a diversified healthcare services company. The company operates through three segments: Hospital Operations and Other, Ambulatory Care, and Conifer. Its general hospitals offer acute care services, operating and recovery rooms, radiology and respiratory therapy services, clinical laboratories, and pharmacies. The company also provides intensive and critical care, and coronary care units; cardiovascular, digestive disease, neurosciences, musculoskeletal, and obstetrics services; outpatient services, including physical therapy; cardiothoracic surgery, complex spinal surgery, neonatal intensive care, and neurosurgery services; quaternary care services in heart and kidney transplants; and limb-salvaging vascular procedures, acute level 1 trauma services, intravascular stroke care, minimally invasive cardiac valve replacement, imaging technology, and telemedicine access for various medical specialties. In addition, it operates ambulatory surgery and urgent care centers, imaging centers, surgical, off-campus emergency, and micro-hospitals; and offers healthcare business process services in the areas of hospital and physician revenue cycle management, as well as value-based care solutions to healthcare systems, individual hospitals, physician practices, self-insured organizations, health plans, and other entities. As of December 31, 2019, the company operated 65 hospitals, 24 surgical hospitals, and approximately 159 outpatient centers, as well as 260 ambulatory surgery, 39 urgent care, and 23 imaging centers in the United States. Tenet Healthcare Corporation was incorporated in 1975 and is headquartered in Dallas, Texas.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Dallas"}, "TLIF": {"short_name": "TOCCA LIFE HLDGS INC", "long_name": "TOCCA Life Holdings, Inc.", "summary": "TOCCA Life Holdings, Inc. operates sober living facilities in Lake Worth, Lantana, and Boynton Beach, Florida. The company provides clinical toxicology testing services to monitor the illicit drug use and transforms sobriety addicted clients and the community into productive members of society. It offers sober support services; operates an addiction treatment center; provides sober life coaching and transitional living programs; conducts sports events and fitness activities; and operates house recovery residence facilities and sober living recovery residences. It offers equipment, materials, and demonstrations in the areas of cooking, cleaning, household maintenance, business etiquette, basic math, basic banking, computer skills, writing skills, life coaching, transitional living management, graphic art, information technology, marketing, television production, interest rate theories, credit cost valuation, mortgage banking, career opportunities, business models, business infrastructures, business ethics, and entrepreneurship. It also offers prepaid services, which include hygiene, linen, grocery, and other products and services online. The company was formerly known as TOCCA Life Coaching, Inc. and changed its name to TOCCA Life Holdings, Inc. in January 2015. TOCCA Life Holdings, Inc. was founded in 2013 and is based in Lake Worth, Florida.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Lake Worth"}, "TLMD": {"short_name": "SOC Telemed, Inc.", "long_name": "SOC Telemed, Inc.", "summary": "SOC Telemed, Inc. provides telemedicine technology and solutions to hospitals, health systems, post-acute providers, physician networks, and value-based care organizations in the United States. The company's technology platform, Telemed IQ, provides telemedicine programs. Its telemedicine solutions include teleNeurology, telePsychiatry, and teleICU. The company was founded in 2004 and is based in Reston, Virginia.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Reston"}, "TRL.F": {"short_name": "DAVITA INC.  DL -,001", "long_name": "DaVita Inc.", "summary": "DaVita Inc. provides kidney dialysis services for patients suffering from chronic kidney failure or end stage renal disease (ESRD). The company operates kidney dialysis centers and provides related lab services in outpatient dialysis centers. It also provides outpatient, hospital inpatient, and home-based hemodialysis services; owns clinical laboratories that provide routine laboratory tests for dialysis and other physician-prescribed laboratory tests for ESRD patients; and management and administrative services to outpatient dialysis centers. In addition, the company provides disease management services; vascular access services; clinical research programs; physician services; and comprehensive care services. As of December 31, 2019, it provided dialysis and administrative services in the United States through a network of 2,753 outpatient dialysis centers serving approximately 206,900 patients; and operated 259 outpatient dialysis centers located in 10 countries outside of the United States serving approximately 28,700 patients. Further, the company provides acute inpatient dialysis services in approximately 900 hospitals and related laboratory services in the United States. The company was formerly known as DaVita HealthCare Partners Inc. and changed its name to DaVita Inc. in September 2016. DaVita Inc. was founded in 1994 and is headquartered in Denver, Colorado.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Denver"}, "TVTY": {"short_name": "Tivity Health, Inc.", "long_name": "Tivity Health, Inc.", "summary": "Tivity Health, Inc. provides fitness, nutrition, and social connection solutions in the United States. It operates through two segments, Healthcare and Nutrition. The Healthcare segment offers SilverSneakers senior fitness program to the members of Medicare advantage and Medicare supplement programs; Prime fitness, a fitness facility access program through commercial health plans, employers, and other sponsoring organizations; health plans through WholeHealth Living program; and health services, such as chiropractic care, acupuncture, physical therapy, occupational therapy, speech therapy, and others. The Nutrition segment provides weight management products and services under the Nutrisystem, South Beach Diet, and Wisely Well names. This segment sells pre-packaged foods comprising frozen and non-frozen, and shelf-stable products directly to weight loss program participants primarily through the Internet and telephone; QVC, a television shopping network; and retailers. The company was formerly known as Healthways, Inc. and changed its name to Tivity Health, Inc. in January 2017. Tivity Health, Inc. was founded in 1981 and is headquartered in Franklin, Tennessee.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Franklin"}, "UDHI": {"short_name": "UNION DENTAL HOLDINGS INC", "long_name": "Union Dental Holdings, Inc.", "summary": "Union Dental Holdings, Inc., through its subsidiaries, provides detal services in the United States. The company operates a network of dental providers, the Dental Referral, who provide dental services through the network to union members in accordance with arrangements between UDC and various labor unions. It also manages the operation of a general dental practice. The company is based in Coral Springs, Florida.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Coral Springs"}, "UHS": {"short_name": "Universal Health Services, Inc.", "long_name": "Universal Health Services, Inc.", "summary": "Universal Health Services, Inc., through its subsidiaries, owns and operates acute care hospitals, outpatient facilities, and behavioral health care facilities. The company operates through Acute Care Hospital Services, Behavioral Health Care Services, and Other segments. Its hospital offer general and specialty surgery, internal medicine, obstetrics, emergency room care, radiology, oncology, diagnostic care, coronary care, pediatric services, pharmacy services, and/or behavioral health services. As of June 30, 2020, it owned and/or operated 356 inpatient facilities, and 41 outpatient and other facilities located in 37 states, Washington, D.C., the United Kingdom, and Puerto Rico. The company also provides commercial health insurance services. Universal Health Services, Inc. founded in 1978 and is headquartered in King of Prussia, Pennsylvania.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "King of Prussia"}, "UHS.F": {"short_name": "UNIV. HEALTH SERV.B DL-01", "long_name": "Universal Health Services, Inc.", "summary": "Universal Health Services, Inc., through its subsidiaries, owns and operates acute care hospitals, outpatient facilities, and behavioral health care facilities. The company operates through Acute Care Hospital Services, Behavioral Health Care Services, and Other segments. Its hospital offer general and specialty surgery, internal medicine, obstetrics, emergency room care, radiology, oncology, diagnostic care, coronary care, pediatric services, pharmacy services, and/or behavioral health services. As of June 30, 2020, it owned and/or operated 356 inpatient facilities, and 41 outpatient and other facilities located in 37 states, Washington, D.C., the United Kingdom, and Puerto Rico. The company also provides commercial health insurance services. Universal Health Services, Inc. founded in 1978 and is headquartered in King of Prussia, Pennsylvania.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "King of Prussia"}, "UPH.F": {"short_name": "US PHYSIC.THERAPY  DL-,01", "long_name": "U.S. Physical Therapy, Inc.", "summary": "U.S. Physical Therapy, Inc., through its subsidiaries, operates outpatient physical therapy clinics that provide pre-and post-operative care and treatment for orthopedic-related disorders, sports-related injuries, preventative care, rehabilitation of injured workers, and neurological-related injuries. The company provides industrial injury prevention services, including onsite injury prevention and rehabilitation, performance optimization, post-offer employment testing, functional capacity evaluations, and ergonomic assessments through physical therapists and specialized certified athletic trainers for Fortune 500 companies, and other clients comprising insurers and their contractors. As of October 9, 2020, it operated 549 outpatient physical therapy clinics in 39 states; and managed 38 physical therapy facilities for unaffiliated third parties, including hospitals and physician groups. The company was founded in 1990 and is based in Houston, Texas.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Houston"}, "USNU": {"short_name": "U S NEUROSURGICAL HOLDINGS INC", "long_name": "U.S. NeuroSurgical Holdings, Inc.", "summary": "U.S. NeuroSurgical Holdings, Inc., through its subsidiaries, owns and operates stereotactic radiosurgery centers that utilize gamma knife technology. The gamma knife is a stereotactic radiosurgical device used to treat brain tumors and other malformations of the brain without invasive surgery. It owns and operates Leksell PERFEXION gamma knife center in the Tisch Hospital of New York University Langone Medical Center in New York, New York; and the Southern California Regional Gamma Knife Center at the San Antonio Regional Hospital in Upland, California. U.S. NeuroSurgical Holdings, Inc. was founded in 1993 and is based in Rockville, Maryland.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Rockville"}, "USPH": {"short_name": "U.S. Physical Therapy, Inc.", "long_name": "U.S. Physical Therapy, Inc.", "summary": "U.S. Physical Therapy, Inc., through its subsidiaries, operates outpatient physical therapy clinics that provide pre-and post-operative care and treatment for orthopedic-related disorders, sports-related injuries, preventative care, rehabilitation of injured workers, and neurological-related injuries. The company provides industrial injury prevention services, including onsite injury prevention and rehabilitation, performance optimization, post-offer employment testing, functional capacity evaluations, and ergonomic assessments through physical therapists and specialized certified athletic trainers for Fortune 500 companies, and other clients comprising insurers and their contractors. As of October 9, 2020, it operated 549 outpatient physical therapy clinics in 39 states; and managed 38 physical therapy facilities for unaffiliated third parties, including hospitals and physician groups. The company was founded in 1990 and is based in Houston, Texas.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Houston"}, "VLXC": {"short_name": "VELTEX CORP", "long_name": "Veltex Corporation", "summary": "Veltex Corporation focuses on the development and acquisition of companies that have modalities in the areas of health, wellness, and recovery. Its target markets include rehab and treatment centers. The company was founded in 1987 and is headquartered in Chicago, Illinois.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Chicago"}, "WEQL": {"short_name": "WELLQUEST MED & WELLNESS CORP", "long_name": "WellQuest Medical & Wellness Corporation", "summary": "WellQuest Medical & Wellness Corporation provides an integrated medical delivery site with family physician healthcare, preventive/wellness, and medical skin-care services. It operates medical center that provides physician-directed medical service for families and businesses, which offers a range of medical care for adults and children with digital diagnostic tests, including laboratory, X-ray, EKG, and others. The company also offers various immunizations for all ages; and weight loss program, nutritional counseling, allergy testing, fitness consulting, hormone therapy, and therapeutic massage services, as well as designs personalized treatment plans. In addition, it manufactures and sells heart support; bone and joint support; stress, mood, and sleep support; immune support; and vitamins and minerals capsules. Further, the company provides aesthetic services, which include medical spa, laser skin renewal, botox and dermal fillers, skin print technology, facials and derma sweep, Glo minerals, and teeth whitening services. Additionally, it offers corporate wellness, occupational and executive health, genetic testing, and tobacco cessation services. The company was formerly known as HQHealthQuest Medical & Wellness Centers, Ltd. and changed its name to WellQuest Medical & Wellness Corporation in April 2008. WellQuest Medical & Wellness Corporation was incorporated in 2004 and is based in Bentonville, Arkansas.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Bentonville"}}