{
    "0205.HK": {
        "short_name": "SEEC MEDIA",
        "long_name": "SEEC Media Group Limited",
        "summary": "SEEC Media Group Limited, an investment holding company, provides advertising agency services in the People's Republic of China. It also distributes books and magazines; offers securities broking services, including brokerage, financing, underwriting, and placement; and provides money lending and e-commerce platform services. The company is based in Yau Ma Tei, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Yau Ma Tei"
    },
    "0888.HK": {
        "short_name": "BISON FINANCE",
        "long_name": "Bison Finance Group Limited",
        "summary": "Bison Finance Group Limited, an investment holding company, engages in design and production of advertisements for transit vehicle exteriors and interiors, online portals, mobile apps, shelters, billboards, and outdoor signages in Hong Kong and Mainland China. The company also engages in media sales; BUS-BODY advertising, BUS-INTERIOR advertising, BUS-SHELTER advertising, BILLBOARDS advertising services. In addition, it provides investment advisory services; securities brokerage and securities margin financing services; asset management services; securities underwriting and placing services; fund management and loan financing services; and insurance brokerage services. Further, the company is involved in the provision of employment agency services; events production business; integrated marketing services for advertising platforms; and management services. The company was formerly known as RoadShow Holdings Limited and changed its name to Bison Finance Group Limited in March 2018. The company was founded in 2000 and is based in North Point, Hong Kong. Bison Finance Group Limited is a subsidiary of Bliss Chance Global Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "North Point"
    },
    "1716.HK": {
        "short_name": "MOST KWAI CHUNG",
        "long_name": "Most Kwai Chung Limited",
        "summary": "Most Kwai Chung Limited, an investment holding company, provides integrated advertising and media services in Hong Kong. The company operates in three segments: Digital Media Services, Print Media Services, and Other Media Services. It offers digital media services, such as video, online banner, newsfeed, and advertorial advertising through digital media platforms, third parties' TV channels, and Internet and physical advertising spaces. The company also provides print media services, including advertorial production and advertisement placement services; and publication of periodicals and books. In addition, it offers events organization and artistes management, multimedia, and advertising campaign and promotion services. The company was incorporated in 2017 and is headquartered in Kwai Chung, Hong Kong. Most Kwai Chung Limited is a subsidiary of Blackpaper Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kwai Chung"
    },
    "1993.HK": {
        "short_name": "ASIARAY",
        "long_name": "Asiaray Media Group Limited",
        "summary": "Asiaray Media Group Limited, an investment holding company, operates as an out-of-home media company in Mainland China and Hong Kong. It operates through Airports Business, and Metro and Billboards Business segments. The company develops and operates out-of-home advertising media, including advertising in airports, metro lines, and billboards and building solutions. It also provides design, consultancy, construction, and maintenance services; and advertising production, installation, and dismantling services. The company was founded in 1993 and is headquartered in Quarry Bay, Hong Kong. Asiaray Media Group Limited is a subsidiary of Media Cornerstone Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Quarry Bay"
    },
    "8091.HK": {
        "short_name": "OOH HOLDINGS",
        "long_name": "OOH Holdings Limited",
        "summary": "OOH Holdings Limited provides out-of-home advertising space and services in Hong Kong and Taiwan. It offers advertising display services on minibuses, taxis, and inside hospitals, clinics, and health and beauty retail stores, as well as digital and online media platforms, and self-pickup lockers platforms. The company also provides design and production, advertisement logistics, installation, and dismantling services on various advertising platforms; and printing services. In addition, it sells food and beverage products under the Mizimamei brand name. The company serves customers in various markets, such as pharmaceutical, healthcare, beauty, food and beverage, home design and furniture industries, etc. The company was founded in 2004 and is based in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kwun Tong"
    },
    "8130.HK": {
        "short_name": "DADI INTL GROUP",
        "long_name": "Dadi International Group Limited",
        "summary": "Dadi International Group Limited, an investment holding company, provides advertising and media related services in the People's Republic of China. It operates through Advertising and Media Related Services; Financial Leasing and Other Financial Services; and Publication, Purchase and Distribution of Books segments. The company engages in the designing, production, and placement of advertisements; and provision of information consulting and marketing planning services, as well as advertisement agency services. It is also involved in securities investment activities. The company was formerly known as Zhi Cheng Holdings Limited and changed its name to Dadi International Group Limited in May 2019. Dadi International Group Limited was incorporated in 2001 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "8153.HK": {
        "short_name": "FARNOVA GROUP",
        "long_name": "Farnova Group Holdings Limited",
        "summary": "Farnova Group Holdings Limited, an investment holding company, provides advertising, and movie production and distribution services in the People's Republic of China. The company operates through three segments: Advertising, Money Lending, and Securities Investments. It offers short-term personal and property mortgage loans, as well as invests and trades in securities. The company was formerly known as Code Agriculture (Holdings) Limited and changed its name to Farnova Group Holdings Limited in May 2020. Farnova Group Holdings Limited was founded in 2000 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "8429.HK": {
        "short_name": "ICICLE GROUP",
        "long_name": "Icicle Group Holdings Limited",
        "summary": "Icicle Group Holdings Limited, an investment holding company, provides marketing production services in Hong Kong, the People's Republic of China, and internationally. It offers brand identity and brand asset development; design and art direction for various media formats; print and packaging design and engineering services; gifts and promotional items; confidential data printing and direct mailing services; eDM and e-newsletter solutions; e-commerce solutions; and digital brand asset production services. The company also designs, develops, and implements Web and mobile UX/UI; creates and designs materials and content for visual merchandising, retail merchandising, and venue decoration; and designs and produces window displays, signs, interior displays, and special promotional displays. In addition, it provides video and photography solutions, as well as social media marketing solutions. Further, the company operates multi-brand lifestyle platform for women's; and creates, produces, and licenses TV contents, formats, and intellectual property rights. It serves brand owners, including global financial institutions, luxury brand retailers, and local retail chain stores. The company was incorporated in 2017 and is headquartered in North Point, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "North Point"
    },
    "I9CA.SG": {
        "short_name": "IClick Interactive Asia Group R",
        "long_name": "iClick Interactive Asia Group Limited",
        "summary": "iClick Interactive Asia Group Limited, together with its subsidiaries, provides online marketing services in the People's Republic of China and internationally. It offers iAudience, an audience identification solution that allows marketers to search, identify, and customize their targeted audience to generate or enhance brand awareness; iAccess and iActivation, an audience engagement and activation solution tailored for brand awareness-driven and performance-driven campaigns; iExpress, the lite version of iAccess solution for small and medium-sized enterprises; iNsights, an online campaign results monitoring and measurement solution; and iExperience, a content creation solution. The company also provides mobile marketing solutions, which are non-search engine marketing solutions to identify, engage, and activate audience on mobile apps, as well as monitor and measure the results of online marketing activities on such channels; and other solutions that focuses on identifying, engaging, and activating audience on non-mobile app content distribution channels comprising PC banner displays, PC video advertisements, and search engine marketing. In addition, it offers enterprise solutions that help clients collate information from various consumer touchpoints and integrate them into a single data management platform to drive sales and marketing decisions to new retail, online education, real estate, and other sectors. The company sells its solutions by entering into sales contracts with entities or marketing agencies, including marketing campaign contracts. It has a strategic collaboration with Tencent International Business Group to co-develop Smart Retail and Smart Travel SaaS solutions. The company was formerly known as Optimix Media Asia Limited and changed its name to iClick Interactive Asia Group Limited in March 2017. iClick Interactive Asia Group Limited was founded in 2009 and is headquartered in Quarry Bay, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Quarry Bay"
    },
    "ICLK": {
        "short_name": "iClick Interactive Asia Group L",
        "long_name": "iClick Interactive Asia Group Limited",
        "summary": "iClick Interactive Asia Group Limited, together with its subsidiaries, provides online marketing services in the People's Republic of China and internationally. It offers iAudience, an audience identification solution that allows marketers to search, identify, and customize their targeted audience to generate or enhance brand awareness; iAccess and iActivation, an audience engagement and activation solution tailored for brand awareness-driven and performance-driven campaigns; iExpress, the lite version of iAccess solution for small and medium-sized enterprises; iNsights, an online campaign results monitoring and measurement solution; and iExperience, a content creation solution. The company also provides mobile marketing solutions, which are non-search engine marketing solutions to identify, engage, and activate audience on mobile apps, as well as monitor and measure the results of online marketing activities on such channels; and other solutions that focuses on identifying, engaging, and activating audience on non-mobile app content distribution channels comprising PC banner displays, PC video advertisements, and search engine marketing. In addition, it offers enterprise solutions that help clients collate information from various consumer touchpoints and integrate them into a single data management platform to drive sales and marketing decisions to new retail, online education, real estate, and other sectors. The company sells its solutions by entering into sales contracts with entities or marketing agencies, including marketing campaign contracts. It has a strategic collaboration with Tencent International Business Group to co-develop Smart Retail and Smart Travel SaaS solutions. The company was formerly known as Optimix Media Asia Limited and changed its name to iClick Interactive Asia Group Limited in March 2017. iClick Interactive Asia Group Limited was founded in 2009 and is headquartered in Quarry Bay, Hong Kong.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Quarry Bay"
    },
    "NWCN": {
        "short_name": "NETWORK CN INC",
        "long_name": "Network CN Inc.",
        "summary": "Network CN Inc., together with its subsidiaries, provides out-of-home advertising services to corporate customers in the People's Republic of China. It operates an advertising network of roadside light emitting diode (LED) digital video panels, mega-size LED digital video billboards, and light boxes. The company also offers administrative and management services. It provides its services through direct sales force and advertising agencies. The company was formerly known as Teda Travel Group Inc. and changed its name to Network CN Inc. in August 2006. Network CN Inc. is headquartered in Kwun Tong, Hong Kong.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Kwun Tong"
    },
    "RECC.F": {
        "short_name": "KK CULTURE HLDGS  HD-,20",
        "long_name": "KK Culture Holdings Limited",
        "summary": "KK Culture Holdings Limited, an investment holding company, provides advertising services in and Hong Kong. It offers Recruit magazine; as well as advertising agency services through paper media and digital media. The company also engages in publishing and investment trading activities; and providing website development and information technology services, as well as property investment business. The company was formerly known as Cinderella Media Group Limited and changed its name to KK Culture Holdings Limited in August 2017. KK Culture Holdings Limited was founded in 1992 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    }
}