{
    "0232.HK": {
        "short_name": "AVIC INT'L",
        "long_name": "AVIC International Holding (HK) Limited",
        "summary": "AVIC International Holding (HK) Limited, an investment holding company, engages in the design, development, and production of general aviation aircraft piston engines and spare parts in the United States, Europe, and internationally. It also provides repair and maintenance services for aircraft engines, as well as supports for piston engines. The company was formerly known as CATIC International Holdings Limited and changed its name to AVIC International Holding (HK) Limited in June 2009. AVIC International Holding (HK) Limited was incorporated in 1992 and is headquartered in Hong Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "0439.HK": {
        "short_name": "KUANGCHI",
        "long_name": "KuangChi Science Limited",
        "summary": "KuangChi Science Limited, an investment holding company, engages in the research and development, manufacture, and sale of future technology products in the People's Republic of China and Hong Kong. The company provides KC N901 Smart Helmet for traffic police bayonet, hospitals, airport/rail transit/bus, pedestrian zone, scenic spots and parks, and office buildings. It also offers Cloud, a cloud platform that offers communication, internet access, and big data collection and analysis with applications in the field of monitoring system; ship and aircraft automatic identification system; radio and television broadcasting and Internet system; and private communication and command system. In addition, the company provides the traveler, a research and space services platform. Further, it offers administrative services, as well as trades in chips. The company was formerly known as Climax International Company Limited and changed its name to KuangChi Science Limited in September 2014. KuangChi Science Limited is headquartered in Causeway Bay, Hong Kong. KuangChi Science Limited is a subsidiary of New Horizon Wireless Technology Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.kuangchiscience.com",
        "market_cap": "Small Cap"
    },
    "CTQ.F": {
        "short_name": "AVIC INTL HLDG(HK) HD-,10",
        "long_name": "AVIC International Holding (HK) Limited",
        "summary": "AVIC International Holding (HK) Limited, an investment holding company, engages in the design, development, and production of general aviation aircraft piston engines and spare parts in the United States, Europe, and internationally. It also provides repair and maintenance services for aircraft engines, as well as supports for piston engines. The company was formerly known as CATIC International Holdings Limited and changed its name to AVIC International Holding (HK) Limited in June 2009. AVIC International Holding (HK) Limited was incorporated in 1992 and is headquartered in Hong Kong, Hong Kong.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "TIPGF": {
        "short_name": "TITAN PETROCHEMICALS GROUP LIMI",
        "long_name": "Titan Petrochemicals Group Limited",
        "summary": "Titan Petrochemicals Group Limited, together with its subsidiaries, engages in trading various bulk commodities in the People Republic of China and other Asia Pacific countries. It offers petroleum, petrochemical, and other related products, as well as manufactures steel structure. The company also engages in the ship building and repairing; manufacture and sale of offshore engineering and vessel auxiliary equipment; trading of oil products; and provision of consulting and financing services. The company was formerly known as Titan (Holdings) Limited and changed its name to Titan Petrochemicals Group Limited in May 2004. The company was incorporated in 1998 and is headquartered in Wanchai, Hong Kong. Titan Petrochemicals Group Limited is a subsidiary of Fame Dragon International Investment Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.petrotitan.com",
        "market_cap": "Small Cap"
    }
}