{
    "2078.HK": {
        "short_name": "PANASIALUM",
        "long_name": "PanAsialum Holdings Company Limited",
        "summary": "PanAsialum Holdings Company Limited, an investment holding company, manufactures and trades in aluminum products. It operates through three segments: Electronics Parts; Construction and Industrial Products; and Door and Window Frames Systems. The Electronics Parts segment offers aluminum parts for consumer electronic products, including unibody chassis for multimedia tablets and laptop computers; and heat sinks for personal computers or other electronic devices. The Construction and Industrial Products segment provides components and materials used for exterior and interior architectural decoration and furnishings; and parts and components used in various other industries. Its products comprise window and door frames, curtain walls, guardrails, and body parts for transportation, mechanical and electrical equipment, and consumer durable goods. The Door and Window Frames Systems segment provides mid-to-high end integrated aluminum door and window systems primarily for end-customers through distributors under the OPLV brand. The company also provides aluminum paste and foil products, as well as aluminum alloy plates, sheets, and coils. It has operations in the People's Republic of China, Australia, North America, Honk Kong, and internationally. PanAsialum Holdings Company Limited was founded in 1997 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kwun Tong"
    },
    "MNSF": {
        "short_name": "MANSFELDER METALS LTD",
        "long_name": "Mansfelder Metals Ltd.",
        "summary": "Mansfelder Metals, Ltd., through its subsidiaries, engages in the manufacture and trading of aluminum products. The company's products include aluminum sheets, foils, strips, and blanks for use by industrial and commercial fabricators of aluminum products. It also produces aluminum foil for food and beverage packaging, pharmaceutical packaging, and technical applications. Mansfelder Metals, Ltd. was formerly known as Cathay Merchant Group, Inc. and it changed its name to Mansfelder Metals, Ltd. in 2004. The company was incorporated in 1977 and is based in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    }
}