{
    "0359.HK": {
        "short_name": "HAISHENG JUICE",
        "long_name": "China Haisheng Juice Holdings Co., Ltd",
        "summary": "China Haisheng Juice Holdings Co., Ltd., an investment holding company, manufactures and sells fruit juice concentrates and other related products. It is also involved in the plantation and sale of apple saplings, apples, and other fruits; production and sale of feed; and manufacture and sale of pectin and bottled fruit juice. The company operates in the People's Republic of China, the United States, Canada, South Africa, Saudi Arabia, Japan, Australia, Russia, Germany, the Netherlands, Turkey, and internationally. China Haisheng Juice Holdings Co., Ltd. is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Beverages - Non-Alcoholic",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.chinahaisheng.com",
        "market_cap": "Small Cap"
    },
    "1115.HK": {
        "short_name": "TIBET WATER",
        "long_name": "Tibet Water Resources Ltd.",
        "summary": "Tibet Water Resources Ltd., an investment holding company, manufactures fast-consuming beverages in the People's Republic of China. It operates in two segments, Water and Beer. The Water segment manufactures and sells a range of water products through wholesales under the 5100 Glacial Water and Gesang Spring brand names; sells raw materials and consumables to associates and third parties; leases production lines and a plant to associates; and provides lending services to third parties in Hong Kong with relevant license. The Beer segment offers various beer products through wholesales under the Tibet Green Barley Beer brand name. The company also engages in the marketing, promotion, distribution, and retailing of water products; and investment in culture, entertainment, consumer product, retail business, and related industries. Tibet Water Resources Ltd. sells its products through retail outlets, hotels, bars, restaurants, supermarkets, convenience, and entertainment outlets, as well as through e-commerce platforms. The company was formerly known as Tibet 5100 Water Resources Holdings Ltd. and changed its name to Tibet Water Resources Ltd. in December 2015. Tibet Water Resources Ltd. was founded in 2006 and is headquartered in Wong Chuk Hang, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Beverages - Non-Alcoholic",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wong Chuk Hang",
        "zipcode": null,
        "website": "http://www.twr1115.net",
        "market_cap": "Small Cap"
    },
    "1446.HK": {
        "short_name": "HUNGFOOKTONG",
        "long_name": "Hung Fook Tong Group Holdings Limited",
        "summary": "Hung Fook Tong Group Holdings Limited, an investment holding company, engages in the production, retail, wholesale, and distribution of bottled drinks and other herbal products in the People's Republic of China, Hong Kong, and internationally. It offers Chinese herbal drinks and other drink products, Chinese-style soups, herbal tortoise plastron jelly, and other food products under the Hung Fook Tong brand name; and snacks, desserts, rice, noodles, and food products for Chinese festivals and other occasions. The company is also involved in the manufacturing, trading, importing, wholesaling, and distribution of bottled drinks; coupons wholesaling, catering, and plastics bottles manufacturing activities; and provision of logistics and trading services, and training courses. As of December 31, 2020, it operated 119 retail shops, including two Handmade Bakery shops in Hong Kong. The company also sells its wellness drinks to distributors in Mainland China, the United States, Canada, Malaysia, Australia, Singapore, the Philippines, New Zealand, Britain, the Netherlands, Spain, etc. Hung Fook Tong Group Holdings Limited was founded in 1986 and is based in Tai Po, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Beverages - Non-Alcoholic",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tai Po",
        "zipcode": null,
        "website": "http://www.hungfooktong.com",
        "market_cap": "Small Cap"
    },
    "2119.HK": {
        "short_name": "TSIT WING INTL",
        "long_name": "Tsit Wing International Holdings Limited",
        "summary": "Tsit Wing International Holdings Limited, an investment holding company, provides beverages and food products in Hong Kong, Mainland China, Canada, Australia, the United States, Taiwan, the Philippines, Malaysia, and internationally. It operates in two segments, Beverage Solutions and Food Products. The Beverage Solutions segment processes and distributes coffee, tea, and related complementary products; sells food and beverages, coffee machines, and other related products; operates food and beverage stores; and leases coffee and tea machines. The Food Products segment trades in frozen meat and frozen processed food. The company also engages in the processing of coffee beans. In addition, it provides catering training services. The company was founded in 1932 and is headquartered in Kwai Chung, Hong Kong. Tsit Wing International Holdings Limited is a subsidiary of Hero Valour Limited.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Beverages - Non-Alcoholic",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.twcoffee.com",
        "market_cap": "Small Cap"
    },
    "CFH.F": {
        "short_name": "CHINA FOODS LTD.  HD-,10",
        "long_name": "China Foods Limited",
        "summary": "China Foods Limited, an investment holding company, manufactures, distributes, markets, and sells Coca-Cola series products in the People's Republic of China. It offers sparkling drinks, juices, water, milk drinks, energy drinks, tea, coffee, functional nutrition drinks, and sports and plant-based protein drinks. The company is also involved in the production, sale, and distribution of beverage bottles; wholesale and retail of prepackaged foods, and raw and auxiliary materials; provision of supply chain information consultation, management services, and others; and wholesale of packaged foods. In addition, it provides enterprise management and consulting, business information consulting, and marketing planning services, as well as computer information system development, consulting, promotion, and other services. The company was formerly known as COFCO International Limited. China Foods Limited was founded in 1990 and is based in Causeway Bay, Hong Kong. China Foods Limited is a subsidiary of China Foods (Holdings) Limited.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Beverages - Non-Alcoholic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.chinafoodsltd.com",
        "market_cap": "Small Cap"
    },
    "CFH0.F": {
        "short_name": "CHINA FOODS  UNSP.ADR/20",
        "long_name": "China Foods Limited",
        "summary": "China Foods Limited, an investment holding company, manufactures, distributes, markets, and sells Coca-Cola series products in the People's Republic of China. It offers sparkling drinks, juices, water, milk drinks, energy drinks, tea, coffee, functional nutrition drinks, and sports and plant-based protein drinks. The company is also involved in the production, sale, and distribution of beverage bottles; wholesale and retail of prepackaged foods, and raw and auxiliary materials; provision of supply chain information consultation, management services, and others; and wholesale of packaged foods. In addition, it provides enterprise management and consulting, business information consulting, and marketing planning services, as well as computer information system development, consulting, promotion, and other services. The company was formerly known as COFCO International Limited. China Foods Limited was founded in 1990 and is based in Causeway Bay, Hong Kong. China Foods Limited is a subsidiary of China Foods (Holdings) Limited.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Beverages - Non-Alcoholic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.chinafoodsltd.com",
        "market_cap": "Small Cap"
    }
}