{
    "3681.HK": {
        "short_name": "SINOMAB BIO-B",
        "long_name": "SinoMab BioScience Limited",
        "summary": "SinoMab BioScience Limited, a biopharmaceutical company, engages in the research, development, manufacture, and commercialization of therapeutics for the treatment of immunological diseases, primarily mAb-based biologics. Its flagship product is SM03, a first-in-target anti-CD22 mAb, which is in Phase III clinical trial for the treatment of rheumatoid arthritis (RA), as well as in various clinical stages for other immunological diseases, such as systemic lupus erythematosus (SLE), Sjogren's syndrome (SS), and non-Hodgkin's lymphoma (NHL). The company also focuses on developing SN1011, a BTK inhibitor, which is Phase I clinical trial for the treatment of RA, SLE, pemphigus, and other immunological diseases. Its products under preclinical stage comprise SM17 for the treatment of asthma and idiopathic pulmonary fibrosis; SM09 that is used for the treatment of NHL and RA; SM06 for use in treating RA, NHL, SLE, and SS; and TNF2 for the treatment of RA. The company operates in Mainland China and Hong Kong. SinoMab BioScience Limited was incorporated in 2001 and is headquartered in Pak Shek Kok, Hong Kong.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tai Po",
        "zipcode": null,
        "website": "http://www.sinomab.com",
        "full_time_employees": null
    },
    "8158.HK": {
        "short_name": "CRMI",
        "long_name": "China Regenerative Medicine International Limited",
        "summary": "China Regenerative Medicine International Limited, an investment holding company, engages in the research and development of bio-medical and healthcare products, and medical techniques. It operates through Cell Products and Services, Cosmetic Products and Services, and Healthcare Products and Services segments. The company offers health management services, such as assessment of health situation, treatment for detox, balance of inner body, nourishing organs, and enhancement of immune system; and beauty services comprising non-surgical medical aesthetic services, basic skincare, solutions for youthful skin, hair revitalizing, lines firming, partial remodelling, and intimate repairing services. It also provides skincare and cosmetic products, including facial and eye creams, serums, moisturizing spray, tonic water, etc., under the Ascara brand. In addition, the company engages in the research and development, and applications of cell culture equipment and cell products; provision of cell-related outsourcing technical services; human cell separation, purification, cultivation, amplification, storage, and transportation; development and production of automated closed cell bioreactors; cellular therapy, cell storage, genetic testing, and biological agents manufacturing; cell preparation processes; technology platforms for clinical application transformation; developing of cell culture devices; separation, isolation, expansion, cryo-storage, and transportation of human cells; development and production of automated closed system cell expansion equipment. Further, it provides bio-engineered cornea, tissue engineering skin related products, and stem cell operation services. The company was formerly known as China Bio-Med Regeneration Technology Limited and changed its name to China Regenerative Medicine International Limited in March 2015. China Regenerative Medicine International Limited was founded in 1995 and is headquartered in Tsim Sha Tsui, Hong Kong.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.crmi.hk",
        "full_time_employees": 172
    },
    "H7T1.F": {
        "short_name": "HUTCHMED (CHINA)  LS-,10",
        "long_name": "HUTCHMED (China) Limited",
        "summary": "HUTCHMED (China) Limited discovers, develops, and commercializes targeted therapeutics and immunotherapies for cancer and immunological diseases worldwide. It operates in two segments, Oncology/Immunology and Other Ventures. It manufactures, distributes, markets, and sells prescription and over-the-counter pharmaceutical, and consumer health products. The company is developing Savolitinib, an inhibitor for non-small cell lung cancer (NSCLC), papillary and clear cell renal cell carcinoma, colorectal cancer (CRC), and gastric cancer (GC); and Fruquintinib, an inhibitor for CRC, breast cancer, GC, endometrial cancer (EMC), NSCLC, hepatocellular carcinoma, and gastrointestinal and solid tumors. It also develops Surufatinib, an inhibitor for neuroendocrine tumors (NET), pancreatic NET, non-pancreatic NET, biliary tract cancer, sarcoma, neuroendocrine neoplasm, esophageal cancer, small cell lung cancer, GC, thyroid cancer, EMC, NSCLC, and solid tumors; HMPL-523, an inhibitor for indolent non-Hodgkin's lymphoma (NHL), B-cell malignancies, and immune thrombocytopenic purpura; and HMPL-689 for indolent non-Hodgkin's, follicular, marginal zone, mantle cell, diffuse large B cell, chronic lymphocytic leukemia/small lymphocytic, and Hodgkin's lymphoma. The company is developing HMPL-453, an inhibitor for intrahepatic cholangiocarcinoma; HMPL-306, an inhibitor for hematological malignancies, gliomas, and solid tumors; HMPL-295 for solid tumors; and HMPL-813 and HMPL-309 EGFR inhibitors. HUTCHMED (China) Limited has collaboration agreements with AstraZeneca AB (publ), Lilly (Shanghai) Management Company Limited, BeiGene, Inmagene Biopharmaceuticals Co. Ltd., Innovent Biologics (Suzhou) Co., Inc., Genor Biopharma Co. Ltd., and Shanghai Junshi Biosciences Co. Ltd. The company was formerly known as Hutchison China MediTech Limited and changed its name to HUTCHMED (China) Limited in May 2021. HUTCHMED (China) Limited was incorporated in 2000 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hutch-med.com",
        "full_time_employees": 1280
    },
    "H7T2.F": {
        "short_name": "HUTCHMED (CHINA)  LS-,1",
        "long_name": "HUTCHMED (China) Limited",
        "summary": "HUTCHMED (China) Limited discovers, develops, and commercializes targeted therapeutics and immunotherapies for cancer and immunological diseases worldwide. It operates in two segments, Oncology/Immunology and Other Ventures. It manufactures, distributes, markets, and sells prescription and over-the-counter pharmaceutical, and consumer health products. The company is developing Savolitinib, an inhibitor for non-small cell lung cancer (NSCLC), papillary and clear cell renal cell carcinoma, colorectal cancer (CRC), and gastric cancer (GC); and Fruquintinib, an inhibitor for CRC, breast cancer, GC, endometrial cancer (EMC), NSCLC, hepatocellular carcinoma, and gastrointestinal and solid tumors. It also develops Surufatinib, an inhibitor for neuroendocrine tumors (NET), pancreatic NET, non-pancreatic NET, biliary tract cancer, sarcoma, neuroendocrine neoplasm, esophageal cancer, small cell lung cancer, GC, thyroid cancer, EMC, NSCLC, and solid tumors; HMPL-523, an inhibitor for indolent non-Hodgkin's lymphoma (NHL), B-cell malignancies, and immune thrombocytopenic purpura; and HMPL-689 for indolent non-Hodgkin's, follicular, marginal zone, mantle cell, diffuse large B cell, chronic lymphocytic leukemia/small lymphocytic, and Hodgkin's lymphoma. The company is developing HMPL-453, an inhibitor for intrahepatic cholangiocarcinoma; HMPL-306, an inhibitor for hematological malignancies, gliomas, and solid tumors; HMPL-295 for solid tumors; and HMPL-813 and HMPL-309 EGFR inhibitors. HUTCHMED (China) Limited has collaboration agreements with AstraZeneca AB (publ), Lilly (Shanghai) Management Company Limited, BeiGene, Inmagene Biopharmaceuticals Co. Ltd., Innovent Biologics (Suzhou) Co., Inc., Genor Biopharma Co. Ltd., and Shanghai Junshi Biosciences Co. Ltd. The company was formerly known as Hutchison China MediTech Limited and changed its name to HUTCHMED (China) Limited in May 2021. HUTCHMED (China) Limited was incorporated in 2000 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hutch-med.com",
        "full_time_employees": 1280
    },
    "HCM.L": {
        "short_name": "HUTCHMED (CHINA) LIMITED ORD US",
        "long_name": "HUTCHMED (China) Limited",
        "summary": "HUTCHMED (China) Limited discovers, develops, and commercializes targeted therapeutics and immunotherapies for cancer and immunological diseases worldwide. It operates in two segments, Oncology/Immunology and Other Ventures. It manufactures, distributes, markets, and sells prescription and over-the-counter pharmaceutical, and consumer health products. The company is developing Savolitinib, an inhibitor for non-small cell lung cancer (NSCLC), papillary and clear cell renal cell carcinoma, colorectal cancer (CRC), and gastric cancer (GC); and Fruquintinib, an inhibitor for CRC, breast cancer, GC, endometrial cancer (EMC), NSCLC, hepatocellular carcinoma, and gastrointestinal and solid tumors. It also develops Surufatinib, an inhibitor for neuroendocrine tumors (NET), pancreatic NET, non-pancreatic NET, biliary tract cancer, sarcoma, neuroendocrine neoplasm, esophageal cancer, small cell lung cancer, GC, thyroid cancer, EMC, NSCLC, and solid tumors; HMPL-523, an inhibitor for indolent non-Hodgkin's lymphoma (NHL), B-cell malignancies, and immune thrombocytopenic purpura; and HMPL-689 for indolent non-Hodgkin's, follicular, marginal zone, mantle cell, diffuse large B cell, chronic lymphocytic leukemia/small lymphocytic, and Hodgkin's lymphoma. The company is developing HMPL-453, an inhibitor for intrahepatic cholangiocarcinoma; HMPL-306, an inhibitor for hematological malignancies, gliomas, and solid tumors; HMPL-295 for solid tumors; and HMPL-813 and HMPL-309 EGFR inhibitors. HUTCHMED (China) Limited has collaboration agreements with AstraZeneca AB (publ), Lilly (Shanghai) Management Company Limited, BeiGene, Inmagene Biopharmaceuticals Co. Ltd., Innovent Biologics (Suzhou) Co., Inc., Genor Biopharma Co. Ltd., and Shanghai Junshi Biosciences Co. Ltd. The company was formerly known as Hutchison China MediTech Limited and changed its name to HUTCHMED (China) Limited in May 2021. HUTCHMED (China) Limited was incorporated in 2000 and is headquartered in Central, Hong Kong.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hutch-med.com",
        "full_time_employees": 1280
    },
    "HCM": {
        "short_name": "Hutchison China MediTech Limite",
        "long_name": "Hutchison China MediTech Limited",
        "summary": "Hutchison China MediTech Limited, a commercial-stage biopharmaceutical company, discovers, develops, and commercializes targeted therapeutics and immunotherapies for cancer and immunological diseases worldwide. It operates in two segments, Oncology/Immunology and Other Ventures. It offers research and development services; and manufactures, distributes, markets, and sells prescription and over-the-counter pharmaceutical, and consumer health products. The company is developing Savolitinib, an inhibitor for non-small cell lung cancer (NSCLC), papillary and clear cell renal cell carcinoma, colorectal cancer (CRC), and gastric cancer (GC); and Fruquintinib, an inhibitor for CRC, breast cancer, GC, endometrial cancer (EMC), NSCLC, hepatocellular carcinoma, and gastrointestinal and solid tumors. It also develops Surufatinib, an inhibitor for neuroendocrine tumors (NET), pancreatic NET, non-pancreatic NET, biliary tract cancer, sarcoma and soft tissue sarcoma, neuroendocrine neoplasms, esophageal cancer, small cell lung cancer, GC, thyroid cancer, EMC, NSCLC, and solid tumors; HMPL-523, an inhibitor for indolent non-Hodgkin's lymphoma (NHL), B-cell malignancies, and immune thrombocytopenic purpura; and HMPL-689 for indolent non-Hodgkin's, follicular, marginal zone, mantle cell, diffuse large B cell, chronic lymphocytic leukemia/small lymphocytic, and Hodgkin's lymphoma. The company is developing HMPL-453, an inhibitor for intrahepatic cholangiocarcinoma; HMPL-306, an inhibitor for hematological malignancies, gliomas, and solid tumors; HMPL-295 for solid tumors; and HMPL-813 and HMPL-309 EGFR inhibitors. Hutchison China MediTech Limited has collaboration agreement with AstraZeneca AB (publ), Lilly (Shanghai) Management Company Limited, BeiGene, Inmagene Biopharmaceuticals Co. Ltd., Innovent Biologics (Suzhou) Co., Inc., Genor Biopharma Co. Ltd., and Shanghai Junshi Biosciences Co. Ltd. The company was incorporated in 2000 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hutch-med.com",
        "full_time_employees": 1280
    },
    "LSI.F": {
        "short_name": "CK LIFE SCIENCES  HD-,10",
        "long_name": "CK Life Sciences Int'l., (Holdings) Inc.",
        "summary": "CK Life Sciences Int'l., (Holdings) Inc., an investment holding company, researches, develops, manufactures, commercializes, markets, and sells health and agriculture-related products in the Asia Pacific and North America. It manufactures and markets plant protection products and soluble fertilizers; manufactures, blends, distributes, and sells fertilizers, pesticides, and related agricultural products; manufactures and distributes horticultural products for the home gardening market; and produces non-sterile prescription and over-the-counter medicines. The company is also involved in the contract manufacturing of complementary healthcare medicines, vitamins, nutritional supplements, and cosmetics; licensing of registration activities and the importation of finished agricultural goods; holding land and building; financing activities; investment in financial instruments and vineyards; trading of biotechnology products and nutritional supplements; and manufacturing, wholesaling, retailing, and distribution of nutraceutical products. In addition, it distributes turf management machinery, hardware, equipment, and accessories, as well as turf fertilizers, chemicals, and professional pest products; produces, refines, and distributes salt products; and provides research and development services for biotechnology and life sciences technology products. Further, it researches, develops, manufactures, and commercializes drug products to treat pain and melanoma; and supplies raw materials for nutritional health, pharmaceutical, cosmetics, personal care, and food segments. Additionally, the company offers packing and asset management services. CK Life Sciences Int'l., (Holdings) Inc. was founded in 1999 and is headquartered in Tai Po, Hong Kong.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tai Po",
        "zipcode": null,
        "website": "http://www.ck-lifesciences.com",
        "full_time_employees": 1809
    },
    "SBHMY": {
        "short_name": "SINO BIOPHARMACEUTICAL",
        "long_name": "Sino Biopharmaceutical Limited",
        "summary": "Sino Biopharmaceutical Limited, an investment holding company, together with its subsidiaries, operates as a research and development pharmaceutical conglomerate in the People's Republic of China. It operates in three segments: Modernised Chinese Medicines and Chemical Medicines, Investment, and Others. The company's principal products include hepatitis medicines, such as Tianqingganmei injections and Tianqingganping enteric capsules; oncology medicines comprising Saiweijian injections, Qingkeshu tablets, Qianping injections, Anxian capsules, Yinishu tablets, Genike capsules, Shoufu tablets, Jizhi tablets, and Leweixin injection; cardio-cerebral medicines, including Yilunping tablets, Tuotuo tablets, Sacubatro/Valsartan tablets, Tolvaptan tablets, Rivaroxaban tablets, Edaravone injections, Esmolol Hydrochloride injections, Esmolol Hydrochloride and Sodium Chloride injections, Polidocanol injections, Sacubitril Valsartan Sodium tablets, Urapidil Hydrochloride injections, and Kaina tablets; and orthopedic medicines, such as Gaisanchun capsules, Taiyan tablets, Zoledronic Acid injections, and Yigu injections. Its principal products also comprise digestive system medicines that consists of Aisuping injections, Getai tablets, and Deyou granules; anti-infectious medicines that include Tianjie injections, Fengruineng injections, Tianli injections, and Tianming injections; respiratory system medicines, such as Tianqingsule inhalation powder; and others comprising Debaian cataplasms, and Qingliming injections. In addition, the company engages in property holding activities; the retail and distribution of pharmaceutical products; optometry for optical glasses and sale of ophthalmic products; the provision of medical management consultancy services; and outpatient and surgical procedure. Further, it manufactures, sells, and distributes health food; and develops medical technology. The company was incorporated in 2000 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.sinobiopharm.com",
        "full_time_employees": 24108
    },
    "SBMFF": {
        "short_name": "SINO BIOPHARMACEUTICAL",
        "long_name": "Sino Biopharmaceutical Limited",
        "summary": "Sino Biopharmaceutical Limited, an investment holding company, together with its subsidiaries, operates as a research and development pharmaceutical conglomerate in the People's Republic of China. It operates in three segments: Modernised Chinese Medicines and Chemical Medicines, Investment, and Others. The company's principal products include hepatitis medicines, such as Tianqingganmei injections and Tianqingganping enteric capsules; oncology medicines comprising Saiweijian injections, Qingkeshu tablets, Qianping injections, Anxian capsules, Yinishu tablets, Genike capsules, Shoufu tablets, Jizhi tablets, and Leweixin injection; cardio-cerebral medicines, including Yilunping tablets, Tuotuo tablets, Sacubatro/Valsartan tablets, Tolvaptan tablets, Rivaroxaban tablets, Edaravone injections, Esmolol Hydrochloride injections, Esmolol Hydrochloride and Sodium Chloride injections, Polidocanol injections, Sacubitril Valsartan Sodium tablets, Urapidil Hydrochloride injections, and Kaina tablets; and orthopedic medicines, such as Gaisanchun capsules, Taiyan tablets, Zoledronic Acid injections, and Yigu injections. Its principal products also comprise digestive system medicines that consists of Aisuping injections, Getai tablets, and Deyou granules; anti-infectious medicines that include Tianjie injections, Fengruineng injections, Tianli injections, and Tianming injections; respiratory system medicines, such as Tianqingsule inhalation powder; and others comprising Debaian cataplasms, and Qingliming injections. In addition, the company engages in property holding activities; the retail and distribution of pharmaceutical products; optometry for optical glasses and sale of ophthalmic products; the provision of medical management consultancy services; and outpatient and surgical procedure. Further, it manufactures, sells, and distributes health food; and develops medical technology. The company was incorporated in 2000 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.sinobiopharm.com",
        "full_time_employees": 24108
    },
    "SMZ1.F": {
        "short_name": "SINO BIOPH.SUBDIV.HD-,025",
        "long_name": "Sino Biopharmaceutical Limited",
        "summary": "Sino Biopharmaceutical Limited, an investment holding company, together with its subsidiaries, operates as a research and development pharmaceutical conglomerate in the People's Republic of China. It operates in three segments: Modernised Chinese Medicines and Chemical Medicines, Investment, and Others. The company's principal products include hepatitis medicines, such as Tianqingganmei injections and Tianqingganping enteric capsules; oncology medicines comprising Saiweijian injections, Qingkeshu tablets, Qianping injections, Anxian capsules, Yinishu tablets, Genike capsules, Shoufu tablets, Jizhi tablets, and Leweixin injection; cardio-cerebral medicines, including Yilunping tablets, Tuotuo tablets, Sacubatro/Valsartan tablets, Tolvaptan tablets, Rivaroxaban tablets, Edaravone injections, Esmolol Hydrochloride injections, Esmolol Hydrochloride and Sodium Chloride injections, Polidocanol injections, Sacubitril Valsartan Sodium tablets, Urapidil Hydrochloride injections, and Kaina tablets; and orthopedic medicines, such as Gaisanchun capsules, Taiyan tablets, Zoledronic Acid injections, and Yigu injections. Its principal products also comprise digestive system medicines that consists of Aisuping injections, Getai tablets, and Deyou granules; anti-infectious medicines that include Tianjie injections, Fengruineng injections, Tianli injections, and Tianming injections; respiratory system medicines, such as Tianqingsule inhalation powder; and others comprising Debaian cataplasms, and Qingliming injections. In addition, the company engages in property holding activities; the retail and distribution of pharmaceutical products; optometry for optical glasses and sale of ophthalmic products; the provision of medical management consultancy services; and outpatient and surgical procedure. Further, it manufactures, sells, and distributes health food; and develops medical technology. The company was incorporated in 2000 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.sinobiopharm.com",
        "full_time_employees": 24108
    },
    "SMZU.F": {
        "short_name": "SINO BIOPHARM. UNS.ADR/20",
        "long_name": "Sino Biopharmaceutical Limited",
        "summary": "Sino Biopharmaceutical Limited, an investment holding company, together with its subsidiaries, operates as a research and development pharmaceutical conglomerate in the People's Republic of China. It operates in three segments: Modernised Chinese Medicines and Chemical Medicines, Investment, and Others. The company's principal products include hepatitis medicines, such as Tianqingganmei injections and Tianqingganping enteric capsules; oncology medicines comprising Saiweijian injections, Qingkeshu tablets, Qianping injections, Anxian capsules, Yinishu tablets, Genike capsules, Shoufu tablets, Jizhi tablets, and Leweixin injection; cardio-cerebral medicines, including Yilunping tablets, Tuotuo tablets, Sacubatro/Valsartan tablets, Tolvaptan tablets, Rivaroxaban tablets, Edaravone injections, Esmolol Hydrochloride injections, Esmolol Hydrochloride and Sodium Chloride injections, Polidocanol injections, Sacubitril Valsartan Sodium tablets, Urapidil Hydrochloride injections, and Kaina tablets; and orthopedic medicines, such as Gaisanchun capsules, Taiyan tablets, Zoledronic Acid injections, and Yigu injections. Its principal products also comprise digestive system medicines that consists of Aisuping injections, Getai tablets, and Deyou granules; anti-infectious medicines that include Tianjie injections, Fengruineng injections, Tianli injections, and Tianming injections; respiratory system medicines, such as Tianqingsule inhalation powder; and others comprising Debaian cataplasms, and Qingliming injections. In addition, the company engages in property holding activities; the retail and distribution of pharmaceutical products; optometry for optical glasses and sale of ophthalmic products; the provision of medical management consultancy services; and outpatient and surgical procedure. Further, it manufactures, sells, and distributes health food; and develops medical technology. The company was incorporated in 2000 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.sinobiopharm.com",
        "full_time_employees": 24108
    }
}