{
    "0030.HK": {
        "short_name": "BAN LOONG HOLD",
        "long_name": "Ban Loong Holdings Limited",
        "summary": "Ban Loong Holdings Limited, an investment holding company, engages in the money lending, and trading of goods and commodities in Hong Kong and the People's Republic of China. The company operates through Money Lending and Trading Segments. It provides short-term personal and corporate loans; and trades in refined edible oil, sugar, cosmetic, and personal care products. The company was formerly known as ABC Communications (Holdings) Limited and changed its name to Ban Loong Holdings Limited in October 2015. Ban Loong Holdings Limited is based in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wanchai",
        "zipcode": null,
        "website": "http://www.0030hk.com",
        "market_cap": "Mid Cap"
    },
    "0064.HK": {
        "short_name": "GET NICE",
        "long_name": "Get Nice Holdings Limited",
        "summary": "Get Nice Holdings Limited engages in financial, property investment and development, money lending, and real estate brokerage service businesses. It provides mortgage financing, personal loans for professionals, and SME corporate loans; invests in industrial property, commercial shops and buildings, residential properties, and hotel property. The company also offers securities and futures broking services, securities margin financing services, placing and underwriting of securities, and corporate finance advisory services. In addition, it provides real estate broking services, including buy-and-sell and rental transactions in residential and commercial sectors in Hong Kong. The company was founded in 1988 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.getnice.com.hk",
        "market_cap": "Small Cap"
    },
    "0111.HK": {
        "short_name": "CINDA INTL HLDG",
        "long_name": "Cinda International Holdings Limited",
        "summary": "Cinda International Holdings Limited, an investment holding company, provides asset management services in Hong Kong and Mainland China. The company operates through Asset Management, Sales and Trading Business, and Corporate Finance segments. The Asset Management segment provides advisory service and related auxiliary services on fund management, as well as other related proprietary investment services; and manages private funds. The Sales and Trading Business segment offers broking services in securities, equity linked products, unit trusts, stock options, and commodities and futures contracts, as well as underwriting, placing, and margin financing services to broking clients. This segment also acts as an agent for the sale of savings plans, general and life insurance, and other investment linked insurance products. The Corporate Finance segment offers corporate finance and advisory services on equity and debt financing to companies listed or seeking listing on Hong Kong or other stock exchanges; and other unlisted corporates. The company also offers fund management, financial planning, and private equity investment services; and administrative support, research, and consultancy services, as well as acts as a money lender. It serves individuals, corporates, enterprises, and institutional customers. The company was formerly known as Hantec Investment Holdings Limited and changed its name to Cinda International Holdings Limited in November 2008. Cinda International Holdings Limited was incorporated in 2000 and is headquartered in Central, Hong Kong. Cinda International Holdings Limited is a subsidiary of Cinda Securities Co., Ltd.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.cinda.com.hk",
        "market_cap": "Small Cap"
    },
    "0188.HK": {
        "short_name": "SUNWAH KINGSWAY",
        "long_name": "Sunwah Kingsway Capital Holdings Limited",
        "summary": "Sunwah Kingsway Capital Holdings Limited, an investment holding company, provides various financial services in Hong Kong, the People's Republic of China, and internationally. It operates through Proprietary Investment, Property Investment, Brokerage and Financing, Corporate Finance and Capital Markets, Asset Management, and Others segments. The Proprietary Investment segment invests in securities for treasury and liquidity management, as well as in structured deals, including listed and unlisted equities, debt securities, and investment funds. The Property Investment segment invests in properties for rental income. The Brokerage and Financing segment offers securities, options, funds, futures, and commodities brokerage services; and margin and other financing, factoring, and other related services. The Corporate Finance and Capital Markets segment provides financial advisory services to corporate clients; and acts as an underwriting and placing agent in the equity capital market. The Asset Management segment offers asset management and related advisory services to private equity funds and private clients. The Others segment provides management, administrative, and corporate secretarial services, as well as loan financing and leasing services. The company was formerly known as SW Kingsway Capital Holdings Limited and changed its name to Sunwah Kingsway Capital Holdings Limited in September 2011. The company was founded in 1990 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.sunwahkingsway.com",
        "market_cap": "Small Cap"
    },
    "0211.HK": {
        "short_name": "STYLAND HOLD",
        "long_name": "Styland Holdings Limited",
        "summary": "Styland Holdings Limited, an investment holding company, engages in the financial services, mortgage financing, property development and investment, and securities trading businesses in Hong Kong. The company's Financial Services segment offers securities and futures dealing, brokerage financing, corporate finance, asset management, and other financing services, as well as other equity and debt financing solutions. This segment also provides margin financing services for trading stocks and other listed securities, and for subscribing to new shares in initial public offerings; and stock broking and online stock trading services for Hong Kong listed companies, institutional investors, professionals, and individual investors. Its Mortgage Financing segment provides loans to individuals, corporations, and institutions that are secured by real properties. The company's Property Development and Investment segment is involved in the property redevelopment activities, as well as properties letting business. Its Securities Trading segment trades in securities and derivative products. The company also provides management and strategic investment services. Styland Holdings Limited was founded in 1977 and is based in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.styland.com",
        "market_cap": "Small Cap"
    },
    "0217.HK": {
        "short_name": "CHINA CHENGTONG",
        "long_name": "China Chengtong Development Group Limited",
        "summary": "China Chengtong Development Group Limited, an investment holding company, engages in the bulk commodity trading, property development, leasing, hotel and marine recreation, and property investment businesses in the People's Republic of China. Its Bulk Commodity Trade segment engages in the trading of coal, steel, and non-ferrous metals. The company's Property Development segment holds land for property development projects. Its Leasing segment provides finance leasing services, including arranging sales and leaseback transactions, as well as operates lease services. The company's Marine Recreation Services and Hotel Segment provides hotel and marine recreation services. Its Property Investment segment provides rental services; and holds investment properties for appreciation. The company is based in Wan Chai, Hong Kong. China Chengtong Development Group Limited is a subsidiary of World Gain Holdings Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.hk217.com",
        "market_cap": "Small Cap"
    },
    "0218.HK": {
        "short_name": "SWHYHK",
        "long_name": "Shenwan Hongyuan (H.K.) Limited",
        "summary": "Shenwan Hongyuan (H.K.) Limited, an investment holding company, engages in brokerage, corporate finance, asset management, financing and loan, and investment and other businesses in Hong Kong. The company operates in five segments: Enterprise Finance, Personal Finance and Wealth Management, Institutional Services and Trading, Investment Management, and Others. It offers stock underwriting sponsor, bond underwriting, and financial advisory services for corporate clients; and external equity investment, debt investment, other investments, and structured financing solutions. The company also provides securities, futures, and options brokerage services; and wealth management, OTC, and securities margin financing products to individual customers and non-professional institutional investors. In addition, it provides stock brokerage and trading services; research advisory, and investment and financing solutions; and sales, trading, hedging, and over-the-counter derivative services to institutional clients, as well as sells and trades in fixed income bonds, currencies, and commodities. Further, the company offers asset management, investment advisory, and public and private fund management services. Additionally, it offers management and treasury, and share custodian and nominee services; leases computer equipment; and holds properties. The company was formerly known as Shenyin Wanguo (H.K.) Limited and changed its name to Shenwan Hongyuan (H.K.) Limited in May 2015. Shenwan Hongyuan (H.K.) Limited was incorporated in 1972 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.swhyhk.com",
        "market_cap": "Small Cap"
    },
    "0223.HK": {
        "short_name": "ELIFE HLDGS",
        "long_name": "Elife Holdings Limited",
        "summary": "Elife Holdings Limited, an investment holding company, provides commodities trading and esmart digital services in China, Hong Kong, and internationally. The company operates through three segments: Unconventional Gas Business, Commodities Trading Business, and Esmart Digital Services. It offers unconventional gas related services, as well as imports technical equipment for the unconventional gas industry; and commodities trading and agency services. The company also provides cloud data smart platform and commercial terminals for shop management. It serves retail stores, convenience stores, small-to-medium sized supermarkets, gas stations, pharmacies, tobacco and wine specialty shops, China Post network, small servicing spots, apparel chain stores, etc. The company was formerly known as Sino Resources Group Limited and changed its name to Elife Holdings Limited in November 2016. Elife Holdings Limited was incorporated in 2001 and is headquartered in Hong Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.elife.com.hk",
        "market_cap": "Small Cap"
    },
    "0281.HK": {
        "short_name": "RIVERA (HOLD)",
        "long_name": "Rivera (Holdings) Limited",
        "summary": "Rivera (Holdings) Limited, an investment holding company, engages in property development and investment, and securities trading and investment businesses in Hong Kong, Macau, and Mainland China. The company develops, sells, and leases residential and commercial cum-office development projects; and holds, sells, and leases approximately 300 car parking spaces. It also provides investment management services. The company was incorporated in 1964 and is based in Central, Hong Kong. Rivera (Holdings) Limited is considered a Red Chip company due to its listing on the Hong Kong Stock Exchange.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.rivera.com.hk",
        "market_cap": "Small Cap"
    },
    "0299.HK": {
        "short_name": "GLORY SUN LAND",
        "long_name": "Glory Sun Land Group Limited",
        "summary": "Glory Sun Land Group Limited, an investment holding company, engages in property development and investment business in the People's Republic of China. It operates through Yacht Club; Training; Real Estate and Property Investment; Trading of Commodities; Construction; and Others segments. The company also operates a yacht club and golf practice court, children playrooms, and fitness rooms; provides training services; and trades in commodities, seafood, and home appliances. It also involved in the provision of construction works. The company was formerly known as New Sports Group Limited and changed its name to Glory Sun Land Group Limited in September 2015. Glory Sun Land Group Limited was founded in 1995 and is based in Admiralty, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.hk0299.com",
        "market_cap": "Small Cap"
    },
    "0335.HK": {
        "short_name": "UPBEST GROUP",
        "long_name": "Upbest Group Limited",
        "summary": "Upbest Group Limited, an investment holding company, provides a range of financial services primarily in Hong Kong and Macau. The company operates through seven segments: Broking, Financing, Corporate Finance, Assets Management, Property Investment, Precious Metal Trading, and Investment Holding. Its activities include securities and futures brokerage; securities margin financing and money lending; corporate finance advisory, placing, and underwriting; assets management for listed and unlisted companies, and high net worth individuals; precious metal trading; and share investments. The company is also involved in the property rental, management, and related businesses. Upbest Group Limited was founded in 1988 and is based in Central, Hong Kong. Upbest Group Limited is a subsidiary of CCAA Group Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.upbest.com",
        "market_cap": "Mid Cap"
    },
    "0376.HK": {
        "short_name": "YUNFENG FIN",
        "long_name": "Yunfeng Financial Group Limited",
        "summary": "Yunfeng Financial Group Limited, an investment holding company, provides insurance products in Hong Kong and Macau. The company operates in two segments, Insurance Products, and Other Financial Services and Corporate. It provides life and medical insurance, annuities, pension, and mandatory provident fund schemes. The company also provides fund and asset management services, as well as financing and investing solutions; and corporate advisory, and securities placing and underwriting advisory services. In addition, it engages in the provision of employee stock ownership plan administration and principal investment. Further, the company provides administrative, trustee, and general services; agency services to non-life insurers; marketing and promoting products, and public relations services; Internet and multimedia systems, and application development services; and technological development of computer software and hardware, technical consulting, technology services, and database and computer network services. The company was formerly known as REORIENT GROUP LIMITED and changed its name to Yunfeng Financial Group Limited in October 2016. The company was incorporated in 1982 and is based in Central, Hong Kong. Yunfeng Financial Group Limited is a subsidiary of Yunfeng Financial Holdings Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.yff.com",
        "market_cap": "Large Cap"
    },
    "0412.HK": {
        "short_name": "CSFG",
        "long_name": "China Shandong Hi-Speed Financial Group Limited",
        "summary": "China Shandong Hi-Speed Financial Group Limited, an investment holding company, provides various financial services in the People's Republic of China. The company operates through four segments: Investments in Securities, Money Lending, Financial Leasing, and Financial Technology. The Investments in Securities segment purchases and sells securities and derivatives; and holds equity and debt investments. The Money Lending segment provides money lending and advisory services. The Financial Leasing segment primarily is involved in the provision of direct financial leasing and advisory services, as well as operation of an asset trading platform. The Financial Technology segment offers online investment and technology enabled lending services; and online new media services. It also provides corporate, business factoring, securities brokerage, asset management, financial investments, investment management, and related financial services; and issues guaranteed bonds and perpetual securities. The company was formerly known as China Innovative Finance Group Limited and changed its name to China Shandong Hi-Speed Financial Group Limited in October 2017. China Shandong Hi-Speed Financial Group Limited is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.csfg.com.hk",
        "market_cap": "Large Cap"
    },
    "0428.HK": {
        "short_name": "COCOON HOLDINGS",
        "long_name": "Cocoon Holdings Limited",
        "summary": "Cocoon Holdings Limited is a principal investment firm specializing in investments in listed and unlisted companies. The firm typically invests in the fields of resources, technology enabled manufacturing, food and retail and healthcare. It also offers other investment services that include money market instruments, capital syndication, and arranging strategic corporate deals, with an emphasis on financial restructuring and capital infusion. The firm invests in Asia and the Greater China region. Cocoon Holdings Limited, formerly known as Huge China Holdings Limited, was founded in 1993 and is based in Hong Kong with additional office in Hamilton, Bermuda.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.cocoon.holdings",
        "market_cap": "Small Cap"
    },
    "0622.HK": {
        "short_name": "OSHIDORI",
        "long_name": "Oshidori International Holdings Limited",
        "summary": "Oshidori International Holdings Limited, an investment holding company, provides financial services in Hong Kong. It offers securities brokerage, placing and underwriting, consultancy and corporate finance advisory, money lending, investment advisory, asset management, margin financing, and trading services, as well as engages in trading and investment of securities. The company also provides credit and lending services; and holds yachts and motor vehicles. The company was formerly known as Enerchina Holdings Limited and changed its name to Oshidori International Holdings Limited in April 2019. Oshidori International Holdings Limited is based in North Point, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "North Point",
        "zipcode": null,
        "website": "http://www.oshidoriinternational.com",
        "market_cap": "Mid Cap"
    },
    "0665.HK": {
        "short_name": "HAITONG INT'L",
        "long_name": "Haitong International Securities Group Limited",
        "summary": "Haitong International Securities Group Limited provides financial products and services to corporate, institutional, and retail clients worldwide. The Wealth Management segment offers financial services and investment solutions to retail and high net-worth clients. This segment engages in securities broking and dealing, futures, and options contracts; foreign exchange trading; over the counter products and risk management instruments sales; securities margin financing; and the provision of investment advisory, financial planning, and investment funds distribution services, as well and custodian services. The Corporate Finance segment provides sponsoring and underwriting services for fund raising activities in equity and debt capital markets. This segment also provides advisory services and financing solutions for corporate actions, such as mergers and acquisitions, assets restructuring, etc. The Asset Management segment offers investment management services, including public funds, private funds, and mandatory provident funds to individual, corporate, and institutional clients. The Institutional Clients segment provides cash equities sales and trading; brokerage; stock borrowing and lending; equity research; investment and financing solutions; and financial instruments, such as fixed income products, currency and commodity products, futures and options, exchange traded funds, and derivative products in financial centers for institutional clients. The Investment segment invests in investment funds and private equity investments. The company was formerly known as Taifook Securities Group Limited and changed its name to Haitong International Securities Group Limited in November 2010. The company was founded in 1973 and is headquartered in Central, Hong Kong. Haitong International Securities Group Limited is as a subsidiary of Haitong International Holdings Limited",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.htisec.com",
        "market_cap": "Large Cap"
    },
    "0717.HK": {
        "short_name": "EMPEROR CAPITAL",
        "long_name": "Emperor Capital Group Limited",
        "summary": "Emperor Capital Group Limited, an investment holding company, provides a range of financial services in Hong Kong, the United States, and internationally. The company operates through Financing, Brokerage, Placing and Underwriting, and Corporate Finance segments. It offers commercial and personal loans comprising short-term unsecured loans, such as tax loans, bridging loans, term loans, and personal loans, as well as long-term secured loans, including property mortgage loans; and margin and initial public offering (IPO) financing. The company also provides brokerage services for securities, futures, and options traded on the exchanges in Hong Kong, Mainland China, and overseas countries; wealth management services, such as providing advice regarding an array of investment services, including securities, mutual funds, insurance-linked products, and real estate investment; asset management services; and discretionary investment services. In addition, it offers placing and underwriting services, as well as acts as a placing agents and underwriters for various Hong Kong listed companies; and corporate finance advisory services on takeovers code related transactions and undertakes sponsor work for IPOs, as well as provides advisory for corporate transactions, including placing, rights issue, corporate restructuring, and merger and acquisition services. Further, the company provides promotion and marketing, and insurance and other brokerage services. Emperor Capital Group Limited was founded in 1993 and is headquartered in Wanchai, Hong Kong. Emperor Capital Group Limited is a subsidiary of Emperor Capital Group Holdings Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wanchai",
        "zipcode": null,
        "website": "http://www.emperorcapital.com",
        "market_cap": "Small Cap"
    },
    "0804.HK": {
        "short_name": "PINESTONE",
        "long_name": "Pinestone Capital Limited",
        "summary": "Pinestone Capital Limited, an investment holding company, provides bespoke financial services to individual and corporate clients in Hong Kong. It offers securities brokerage services; securities-backed lending services, including margin financing and money lending services; and placing and underwriting services. The company was incorporated in 2015 and is headquartered in Central, Hong Kong. Pinestone Capital Limited is a subsidiary of HCC & Co Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.pinestone.com.hk",
        "market_cap": "Small Cap"
    },
    "0821.HK": {
        "short_name": "VC HOLDINGS",
        "long_name": "Value Convergence Holdings Limited",
        "summary": "Value Convergence Holdings Limited, an investment holding company, provides financial services in Hong Kong. It operates through five segments: Brokerage and Financing, Corporate Finance and Other Advisory, Asset Management, Insurance Brokerage, and Proprietary Trading. The company offers securities, as well as futures and options brokering and dealing; and margin financing and money lending; placing and underwriting;, as well as trades in equity and debt securities, futures, options, derivatives, and structured products. It also provides mergers and acquisitions, research, insurance brokerage, asset management, financial advisory, and company secretarial services. The company was founded in 1986 and is based in Wanchai, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.vcgroup.com.hk",
        "market_cap": "Small Cap"
    },
    "0952.HK": {
        "short_name": "TONGHAI FIN",
        "long_name": "China Tonghai International Financial Limited",
        "summary": "China Tonghai International Financial Limited, an investment holding company, provides various financial services in Hong Kong. It operates through Brokerage and Interest Income, Corporate Finance, Asset Management, Investments, and Others segments. The Brokerage and Interest Income segment provides discretionary and non-discretionary dealing services for securities, futures, and options; margin financing and money lending services; and insurance broking and wealth management services, as well as earns interest income from debt instruments. The corporate finance offers securities placing, underwriting, and corporate finance and general advisory services. The Asset Management segment provides fund management, discretionary portfolio management, and portfolio management advisory services. The Investments segment invests in and trades in various investment products. The Others segment offers financial media services. It also provides import/export trading, and Website management and other related services. The company was formerly known as China Oceanwide International Financial Limited and changed its name to China Tonghai International Financial Limited in May 2018. China Tonghai International Financial Limited was incorporated in 1997 and is headquartered in Central, Hong Kong. China Tonghai International Financial Limited is a subsidiary of Oceanwide Holdings International Financial Development Co., Ltd.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.tonghaifinancial.com",
        "market_cap": "Small Cap"
    },
    "0993.HK": {
        "short_name": "HUARONG INT FIN",
        "long_name": "Huarong International Financial Holdings Limited",
        "summary": "Huarong International Financial Holdings Limited, an investment holding company, provides financial services in Hong Kong and the People's Republic of China. The company operates through Securities, Corporate Finance, and Asset Management and Direct Investment segments. The Securities segment engages in the broking and dealing of securities, futures, and options contracts; and provision of margin financing services. The Corporate Finance segment offers securities underwriting and sponsoring, and financial advisory services to institutional clients. The Asset Management and Direct Investment segment provides asset management services; and makes direct investments in equities, bonds, funds, derivative instruments, and other financial products. Huarong International Financial Holdings Limited also offers sub-leasing arrangement, money lending, and consultancy services. The company was formerly known as Simsen International Corporation Limited and changed its name to Huarong International Financial Holdings Limited in October 2015. The company is headquartered in Central, Hong Kong. Huarong International Financial Holdings Limited is a subsidiary of Camellia Pacific Investment Holding Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hrif.com.hk",
        "market_cap": "Small Cap"
    },
    "1004.HK": {
        "short_name": "C SMARTERENERGY",
        "long_name": "China Smarter Energy Group Holdings Limited",
        "summary": "China Smarter Energy Group Holdings Limited, an investment holding company, engages in the solar energy business in the People's Republic of China. The company operates through four segments: Clean Energy, Trading in Securities, Investments, and Trading of Bulk Commodities. It operates solar power plants and distributed solar power stations. As of December 31, 2019, the company had generated electricity volume of 356,940 megawatt hours. It also trades in listed equity securities; and invests in unlisted equities. In addition, the company trades in solid, liquid, and gaseous fuels, as well as other related products; and bulk commodities derivatives. The company was formerly known as Rising Development Holdings Limited and changed its name to China Smarter Energy Group Holdings Limited in February 2015. China Smarter Energy Group Holdings Limited was incorporated in 1997 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.cse1004.com",
        "market_cap": "Small Cap"
    },
    "1031.HK": {
        "short_name": "KINGSTON FIN",
        "long_name": "Kingston Financial Group Limited",
        "summary": "Kingston Financial Group Limited, an investment holding company, provides a range of financial services in Hong Kong and Macau. The company operates through Securities Brokerage, Underwriting, and Placements; Margin and Initial Public Offering (IPO) Financing; Other Financial Services; Hotel Operations; Food and Beverage; Gaming; and Securities Investment segments. It offers brokerage, underwriting, and placements services for dealings in securities on stock exchanges; margin and IPO financing; and corporate finance advisory, futures brokerage, and asset management services. The company also operates hotels and restaurants, as well as casinos in hotels; and trades in listed securities. As of March 31, 2020, it had 69 tables in the mass market halls, 15 tables in the VIP rooms, and 262 slot machines. The company was incorporated in 1996 and is based in Central, Hong Kong. Kingston Financial Group Limited is a subsidiary of Active Dynamic Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.kingston.com.hk",
        "market_cap": "Mid Cap"
    },
    "1104.HK": {
        "short_name": "APAC RESOURCES",
        "long_name": "APAC Resources Limited",
        "summary": "APAC Resources Limited, an investment holding company, engages in commodity trading and natural resource investment businesses in the People's Republic of China. It operates through Commodity Business; Resource Investment; and Principal Investment and Financial Services segments. The company trades and invests in listed and unlisted securities; provides loan financing services; and invest in loan notes, convertible notes, and other financial assets, as well as invests in and develops mineral resources. It also provides management services; consultancy services in corporate management; and metallurgy technology services. APAC Resources Limited is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.apacresources.com",
        "market_cap": "Small Cap"
    },
    "1141.HK": {
        "short_name": "CMBC CAPITAL",
        "long_name": "CMBC Capital Holdings Limited",
        "summary": "CMBC Capital Holdings Limited, an investment holding company, provides loan financing services primarily in Hong Kong. It operates through Securities; Investment and Financing; and Asset Management, Corporate Finance and Advisory segments. The Securities segment offers brokerage, securities margin financing, futures and options contracts dealing, and securities underwriting/placing services. The Investment and Financing segment invests and trades in equity and debt securities, bonds, and funds. The Asset Management and Advisory segment provides asset management, sponsorship, and financial advisory and arrangement services. It also offers corporate financing services. The company was formerly known as Skyway Securities Group Limited and changed its name to CMBC Capital Holdings Limited in May 2017. The company is headquartered in Kowloon, Hong Kong. CMBC Capital Holdings Limited is a subsidiary of CMBC International Investment Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.cmbccap.com",
        "market_cap": "Mid Cap"
    },
    "1469.HK": {
        "short_name": "GET NICE FIN",
        "long_name": "Get Nice Financial Group Limited",
        "summary": "Get Nice Financial Group Limited, an investment holding company, provides financial services in Hong Kong. It operates through three segments: Broking, Securities Margin Financing, and Corporate Finance. The company offers securities dealing and broking, futures and options broking, and underwriting and placement services; securities margin financing; and corporate finance and advisory services. In addition, it is involved in the provision of asset management services, as well as property and yacht holding activities. The company is headquartered in Central, Hong Kong. Get Nice Financial Group Limited operates as a subsidiary of Get Nice Holdings Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.getnicefg.com.hk",
        "market_cap": "Mid Cap"
    },
    "1788.HK": {
        "short_name": "GUOTAI JUNAN I",
        "long_name": "Guotai Junan International Holdings Limited",
        "summary": "Guotai Junan International Holdings Limited, an investment holding company, provides wealth management, brokerage, corporate finance, asset management, loans and financing, financial products, and market making and investment services in Hong Kong and internationally. The company's Brokerage segment is involved in securities, futures, options, and leveraged foreign exchange dealing and brokerage; and the provision of insurance brokerage services. Its Corporate Finance segment provides advisory services; and placing and underwriting services of debt and equity securities. The company's Asset Management segment offers asset management services comprising fund management and investment advisory services. Its Loans and Financing segment provides margin financing products, securities borrowing and lending to margin customers, initial public offering loans, other loans to customers, and bank deposits. The company's Financial Products, Market Making and Investments segment offers funds, fixed income securities, and equity investments, as well as structuring of financial products; and trades in and markets debt securities, exchange traded funds, and derivatives. Its Other segment provides information channel services. The company was founded in 1995 and is based in Central, Hong Kong. Guotai Junan International Holdings Limited is a subsidiary of Guotai Junan Holdings Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.gtja.com",
        "market_cap": "Large Cap"
    },
    "2263.HK": {
        "short_name": "FU SHEK FIN",
        "long_name": "Fu Shek Financial Holdings Limited",
        "summary": "Fu Shek Financial Holdings Limited, through its subsidiary, Sinomax Securities Limited provides securities trading, placing, and underwriting services in the People's Republic of China. It offers securities dealing, brokerage, and ancillary services; and margin financing and investment advisory services. The company was founded in 2001 and is headquartered in Admiralty, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.hkfsfinance.com",
        "market_cap": "Small Cap"
    },
    "2680.HK": {
        "short_name": "INNOVAX HLDGS",
        "long_name": "Innovax Holdings Limited",
        "summary": "Innovax Holdings Limited, an investment holding company, operates as a financial and securities services provider in Hong Kong. It offers corporate finance advisory services, such as IPO sponsorship, financial and independent financial advisory, and compliance advisory services; and securities dealing and brokerage services. The company also provides securities financing services, including margin financing for purchasing securities on the secondary market, as well as IPO financing for subscribing shares offered under public tranche of IPOs; and asset management services comprising fund and discretionary account management services, as well as future dealing services. In addition, it acts as a placing or sub-placing agent for the issue of new shares by listed companies; and global coordinator or bookrunner or lead manager or underwriter for IPOs of listing applicants. The company was founded in 2014 and is headquartered in Wan Chai, Hong Kong. Innovax Holdings Limited is a subsidiary of Billion Shine International Investment Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.innovax.hk",
        "market_cap": "Small Cap"
    },
    "4C3.F": {
        "short_name": "CMBC CAP. HLDGS CONS.",
        "long_name": "CMBC Capital Holdings Limited",
        "summary": "CMBC Capital Holdings Limited, an investment holding company, provides loan financing services primarily in Hong Kong. It operates through Securities; Investment and Financing; and Asset Management, Corporate Finance and Advisory segments. The Securities segment offers brokerage, securities margin financing, futures and options contracts dealing, and securities underwriting/placing services. The Investment and Financing segment invests and trades in equity and debt securities, bonds, and funds. The Asset Management and Advisory segment provides asset management, sponsorship, and financial advisory and arrangement services. It also offers corporate financing services. The company was formerly known as Skyway Securities Group Limited and changed its name to CMBC Capital Holdings Limited in May 2017. The company is headquartered in Kowloon, Hong Kong. CMBC Capital Holdings Limited is a subsidiary of CMBC International Investment Limited.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.cmbccap.com",
        "market_cap": "Small Cap"
    },
    "616A.F": {
        "short_name": "DIGINEX LTD",
        "long_name": "Diginex Limited",
        "summary": "Diginex Limited, a digital asset financial services and advisory company, provides products, architecture, and infrastructure for the financial markets in the areas of digital asset ecosystem in Singapore and internationally. The company operates EQUOS, a cryptocurrency exchange for the professional and individual investors; an over-the-counter trading platform; Digivault, a hot and cold custodian platform for the custody of digital assets for institutional investors; and Diginex Access, a front-to-back integrated trading platform that provides trading and portfolio management solutions to institutional and professional retail clients. It also provides asset management services under the Bletchley Park Asset Management name; and securitization advisory, origination, and distribution services. The company was founded in 2017 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.diginex.com",
        "market_cap": "Small Cap"
    },
    "6877.HK": {
        "short_name": "CLSA PREMIUM",
        "long_name": "CLSA Premium Limited",
        "summary": "CLSA Premium Limited, an investment holding company, provides leveraged foreign exchange, trading, cash dealing, and other services. It offers commodity and index trading, and margin dealing services, as well as precious metals trading and settlement services. The company also provides securities brokerage and management services. It primarily operates in Hong Kong, New Zealand, Australia, and the People's Republic of China. The company was formerly known as KVB Kunlun Financial Group Limited and changed its name to CLSA Premium Limited in November 2019. CLSA Premium Limited was incorporated in 2010 and is headquartered in Kowloon, Hong Kong. CLSA Premium Limited is a subsidiary of Citic Securities Overseas Investment Company Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.clsapremium.com",
        "market_cap": "Small Cap"
    },
    "8072.HK": {
        "short_name": "ROMA GROUP",
        "long_name": "Roma Group Limited",
        "summary": "Roma Group Limited, an investment holding company, provides valuation and technical advisory services in Hong Kong. The company offers valuation services for business and intangible assets, such as business contracts, mining and exploration rights, customer relationships, franchises, distribution and publicity rights, technology and software applications, trademarks, patents, copyrights, domain names, Websites, and publication rights; and natural resources valuation and technical advisory services, including exploration planning, project feasibility study, resource estimation, evaluation, environmental and social, and risk management services. It also provides valuation services for financial instruments comprising accumulators/decumulators, call and put options, convertible bonds, convertible preference shares, equity-linked investments, financial guarantees, forward/futures contracts, share options, structured products, swap contracts, and warrants; property valuation services for various types of properties; credit and risk evaluation services; biological assets valuation services; and purchase price allocation services, as well as various services for clients' antiques, work of art, and collectables. In addition, the company offers machineries and equipment valuation services for manufacturing processes and industrial facility installations; various technical advisory services; and corporate advisory services, such as business planning, feasibility studies, fairness opinions, risk control and management, alliance with other professional parties, advisory before issuance of financial instruments, and advisory on regulatory and accounting standards, as well as valuation-related consultancy services related to mergers and acquisitions, initial public offerings, private placements, and others. It provides marketing and event organization, financing, property investment, and ESG and credit reporting services. The company is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.romagroup.com",
        "market_cap": "Small Cap"
    },
    "8123.HK": {
        "short_name": "SINOFORTUNE FIN",
        "long_name": "Sinofortune Financial Holdings Limited",
        "summary": "Sinofortune Financial Holdings Limited, an investment holding company, engages in the selling of motor vehicles and provision of agency services in the People's Republic of China and Hong Kong. The company offers securities and futures brokerage, and securities margin financing services; and precious metals spot trading and brokerage services. It also provides securities and futures contract trading and wealth management services; electronic trading platform; and stock information and analysis services. In addition, the company is involved in the trading and principal investment activities; and provision of education information and consultancy service. Further, it sells medicines, and calligraphy and painting. The company was formerly known as First China Financial Network Holdings Limited and changed its name to Sinofortune Financial Holdings Limited in June 2017. Sinofortune Financial Holdings Limited was incorporated in 2001 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.sinofortune.hk",
        "market_cap": "Small Cap"
    },
    "8168.HK": {
        "short_name": "AMASSE CAPITAL",
        "long_name": "Amasse Capital Holdings Limited",
        "summary": "Amasse Capital Holdings Limited, an investment holding company, provides corporate finance and investment advisory services in Hong Kong. The company offers financial advisory services to listed companies and investors seeking to control or invest in public listed companies, as well as independent board committees and/or independent shareholders of public listed companies. It also acts as an underwriter and/or placing agent not holding client assets in dealing activities for its clients. The company was incorporated in 2017 and is headquartered in Central, Hong Kong. Amasse Capital Holdings Limited is a subsidiary of Access Cheer Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.amasse.com.hk",
        "market_cap": "Small Cap"
    },
    "8226.HK": {
        "short_name": "KOALA FIN GP",
        "long_name": "KOALA Financial Group Limited",
        "summary": "KOALA Financial Group Limited, an investment holding company, engages in securities brokerage, share placements, underwriting, and money lending activities in Hong Kong. The company operates in four segments: Securities Brokerage, Underwriting and Placements; Money Lending; Securities Investment; and Investment in Properties. It also leases investment properties and provides asset management services. The company was formerly known as Sunrise (China) Technology Group Limited and changed its name to KOALA Financial Group Limited in June 2017. KOALA Financial Group Limited is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.koala8226.com.hk",
        "market_cap": "Small Cap"
    },
    "8295.HK": {
        "short_name": "ZJ TECH SERVICE",
        "long_name": "Zhongjin Technology Services Group Company Limited",
        "summary": "Zhongjin Technology Services Group Company Limited, an investment holding company, provides corporate advisory services in the People's Republic of China and internationally. It also offers investment advisory and asset management, and proprietary investment services. The company also engages in securities dealing activities; and provision of investment funds. In addition, it offers various financing and financial advisory to corporate customers, such as issuance of bonds and preference shares, secondary market placement, issuance of convertible bonds, merger and acquisition financial advisory, and private placement services. Further, the company provides information technology outsourcing, data centre, and call centre solutions, as well as marketing services. The company was formerly known as ZZ Capital International Limited and changed its name to Zhongjin Technology Services Group Company Limited in April 2021. The company was incorporated in 2010 and is headquartered in Central, Hong Kong. Zhongjin Technology Services Group Company Limited is a subsidiary of Zhong Zhi Xin Zhuo Capital Company Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.zhongjintechnology.com",
        "market_cap": "Mid Cap"
    },
    "8333.HK": {
        "short_name": "ASTRUM FIN",
        "long_name": "Astrum Financial Holdings Limited",
        "summary": "Astrum Financial Holdings Limited, an investment holding company, provides securities brokerage services in Hong Kong. It offers securities dealing and brokerage services; online brokerage services; placing and underwriting services; corporate finance advisory services; financing services, including securities and initial public offering financing; and asset management services, as well as futures contracts dealing services. The company was incorporated in 2015 and is headquartered in Admiralty, Hong Kong. Astrum Financial Holdings Limited is a subsidiary of Autumn Ocean Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.astrum-capital.com",
        "market_cap": "Small Cap"
    },
    "8340.HK": {
        "short_name": "VINCO FINANCIAL",
        "long_name": "Vinco Financial Group Limited",
        "summary": "Vinco Financial Group Limited, an investment holding company, provides various financial services in Hong Kong. The company offers its clients with initial public offerings (IPO) on the Main Board and GEM Board of The Stock Exchange of Hong Kong Limited; underwriting and distribution of IPO's shares; corporate finance advisory; mergers and acquisitions; corporate restructuring; arranging loan syndication; and convertible bonds issuance. It also facilitates corporate fund raising in equity capital market and debt market; provides professional advice on the structure of the fund raising; and assists private companies in pre-IPO private placement activities. In addition, the company advises clients on various transactions comprising fundraising activities of share placements, rights issues, and warrants issuance; share split/consolidation, privatization, and scheme of arrangement; capital restructuring; convertible bonds issuance; and formation of strategic partnership. Further, it acts as a financial advisor and independent financial advisor for transactions related to takeovers codes, connected transactions, and notifiable transactions; and as a financial advisor for corporate mergers and acquisitions, and asset and business acquisition/disposal transactions for listed and non-listed companies. The company was incorporated in 2008 and is headquartered in Central, Hong Kong. Vinco Financial Group Limited is a subsidiary of Vinco Asia Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.vinco.com.hk",
        "market_cap": "Small Cap"
    },
    "8350.HK": {
        "short_name": "EXCALIBURGLOBAL",
        "long_name": "Excalibur Global Financial Holdings Limited",
        "summary": "Excalibur Global Financial Holdings Limited, through its subsidiaries, provides brokerage services for futures, securities, and options traded on the exchanges in Hong Kong, the United States, Japan, Singapore, and the United Kingdom. It also offers money lending and investment consulting services. The company was founded in 1993 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.excalibur.com.hk",
        "market_cap": "Small Cap"
    },
    "8439.HK": {
        "short_name": "SOMERLEY CAP",
        "long_name": "Somerley Capital Holdings Limited",
        "summary": "Somerley Capital Holdings Limited, an investment holding company, provides corporate finance advisory services in Hong Kong. The company acts as a financial adviser to Hong Kong public listed companies, various shareholders, and investors, as well as parties seeking to control or invest in listed companies in Hong Kong; and financial adviser to independent board committees and/or independent shareholders of listed companies in Hong Kong. It also acts as a compliance adviser primarily for newly listed companies in Hong Kong; a sponsor to initial public offerings and listings of shares of companies on the Stock Exchange in Hong Kong; and an advisor for the cross-border mergers and acquisitions, as well as provides advisory services on secondary equity issues and asset management services. The company offers advisory services related to takeovers of listed companies, acquisitions and disposals, connected transactions, spin-offs and reorganizations, privatizations, initial public offerings, and secondary issues. It serves the conglomerate, consumer, energy, natural resources and infrastructure, renewables, financial institutions and insurance, industrial, property and construction, gaming and hospitality, and TMT industries. The company was incorporated in 2016 and is headquartered in Central, Hong Kong. Somerley Capital Holdings Limited is a subsidiary of Somerley Group Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.somerleycapital.com",
        "market_cap": "Small Cap"
    },
    "93W.F": {
        "short_name": "HUARONG INTL FI.H.HD-,001",
        "long_name": "Huarong International Financial Holdings Limited",
        "summary": "Huarong International Financial Holdings Limited, an investment holding company, provides financial services in Hong Kong and the People's Republic of China. The company operates through Securities, Corporate Finance, and Asset Management and Direct Investment segments. The Securities segment engages in the broking and dealing of securities, futures, and options contracts; and provision of margin financing services. The Corporate Finance segment offers securities underwriting and sponsoring, and financial advisory services to institutional clients. The Asset Management and Direct Investment segment provides asset management services; and makes direct investments in equities, bonds, funds, derivative instruments, and other financial products. Huarong International Financial Holdings Limited also offers sub-leasing arrangement, money lending, and consultancy services. The company was formerly known as Simsen International Corporation Limited and changed its name to Huarong International Financial Holdings Limited in October 2015. The company is headquartered in Central, Hong Kong. Huarong International Financial Holdings Limited is a subsidiary of Camellia Pacific Investment Holding Limited.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hrif.com.hk",
        "market_cap": "Small Cap"
    },
    "9AM1.F": {
        "short_name": "AMTD INT.  SP.ADR/1 CL.A",
        "long_name": "AMTD International Inc.",
        "summary": "AMTD International Inc., an investment holding company, engages in investment banking activities in Hong Kong, Mainland China, the United States, and internationally. The company operates through three segments: Investment Banking, Asset Management, and Strategic Investment. It offers a range of investment banking services, including equity underwriting, debt underwriting, securities brokerage, institutional sales and distribution, and research, as well as advisory services on credit rating, financing, and mergers and acquisitions transactions. The company also provides professional investment management and advisory services primarily to corporate and other institutional clients. In addition, it makes long-term strategic investments focusing on Asia's financial and new economy sectors. The company was formerly known as AMTD Inc. AMTD International Inc. was incorporated in 2019 and is headquartered in Central, Hong Kong. AMTD International Inc. is as subsidiary of AMTD Group Company Limited.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.amtdinc.com",
        "market_cap": "Mid Cap"
    },
    "AEEX": {
        "short_name": "ASIA EQUITY EXCHANGE GROUP INC",
        "long_name": "Asia Equity Exchange Group, Inc.",
        "summary": "Asia Equity Exchange Group, Inc. provides listing assistance, equity investment financing information, and public relationship services to the enterprises primarily in China. The company offers its services through an international equity assistance and information service platform. It also provides investment and corporate management consulting services. The company is based in Kowloon Bay, Hong Kong.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon Bay",
        "zipcode": null,
        "website": "http://www.asiaotcmarkets.com",
        "market_cap": "Small Cap"
    },
    "CCO.F": {
        "short_name": "CHINA CHENGTONG",
        "long_name": "China Chengtong Development Group Limited",
        "summary": "China Chengtong Development Group Limited, an investment holding company, engages in the bulk commodity trading, property development, leasing, hotel and marine recreation, and property investment businesses in the People's Republic of China. Its Bulk Commodity Trade segment engages in the trading of coal, steel, and non-ferrous metals. The company's Property Development segment holds land for property development projects. Its Leasing segment provides finance leasing services, including arranging sales and leaseback transactions, as well as operates lease services. The company's Marine Recreation Services and Hotel Segment provides hotel and marine recreation services. Its Property Investment segment provides rental services; and holds investment properties for appreciation. The company is based in Wan Chai, Hong Kong. China Chengtong Development Group Limited is a subsidiary of World Gain Holdings Limited.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.hk217.com",
        "market_cap": "Small Cap"
    },
    "CQT1.F": {
        "short_name": "DA YU FINANCI.HLD.HD -,10",
        "long_name": "Da Yu Financial Holdings Limited",
        "summary": "Da Yu Financial Holdings Limited provides corporate finance advisory and asset management services. It acts as a financial adviser to advise listed issuers, shareholders, and investors of listed issuers, as well as entities on specific transactions. The company also acts as independent financial adviser to listed issuers to provide independent advice required under the listing rules, the takeovers code, or other specific circumstances. In addition, it acts as financial adviser to listed issuers on retainer basis to advise listed issuers on corporate strategies and compliance with the listing rules, the GEM listing rules, and the takeovers code. The company was formerly known as China Agrotech Holdings Limited and changed its name to Da Yu Financial Holdings Limited in June 2019. Da Yu Financial Holdings Limited was incorporated in 1999 and is headquartered in Wanchai, Hong Kong.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "EBML": {
        "short_name": "EBULLION INC",
        "long_name": "eBullion, Inc.",
        "summary": "eBullion, Inc. provides precious metals spot contract trading services for gold and silver trading through electronic trading platform located in Hong Kong. The company was incorporated in 2013 and is based in Tsim Sha Tsui, Hong Kong.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": "10004",
        "website": "http://www.ebulliongroup.com",
        "market_cap": "Small Cap"
    },
    "EQOS": {
        "short_name": "Diginex Limited",
        "long_name": "Diginex Limited",
        "summary": "Diginex Limited, a digital asset financial services and advisory company, provides products, architecture, and infrastructure for the financial markets in the areas of digital asset ecosystem in Singapore and internationally. The company operates EQUOS, a cryptocurrency exchange for the professional and individual investors; an over-the-counter trading platform; Digivault, a hot and cold custodian platform for the custody of digital assets for institutional investors; and Diginex Access, a front-to-back integrated trading platform that provides trading and portfolio management solutions to institutional and professional retail clients. It also provides asset management services under the Bletchley Park Asset Management name; and securitization advisory, origination, and distribution services. The company was founded in 2017 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.diginex.com",
        "market_cap": "Small Cap"
    },
    "FUTU": {
        "short_name": "Futu Holdings Limited",
        "long_name": "Futu Holdings Limited",
        "summary": "Futu Holdings Limited operates an online brokerage and wealth management platform in Hong Kong and internationally. The company provides trading, clearing, and settlement services; margin financing and securities lending services; and stock yield enhancement program. It also offers online wealth management services under the Futu Money Plus brand, which gives access to mutual funds, private funds, and bonds; market data and information services; and NiuNiu Community, which serves as an open forum for users and clients to share insights, ask questions, and exchange ideas. In addition, the company provides initial public offering subscription and employee share option plan solution services to corporate clients under the Futu I&E brand; and services, including trade execution, as well as margin financing and securities lending, which allow its clients to trade securities, such as stocks, ETFs, warrants, options and futures, across different markets. Futu Holdings Limited was founded in 2007 and is headquartered in Hong Kong, Hong Kong.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.futuholdings.com",
        "market_cap": "Large Cap"
    },
    "FZV1.F": {
        "short_name": "APAC RES LTD  HD 1",
        "long_name": "APAC Resources Limited",
        "summary": "APAC Resources Limited, an investment holding company, engages in commodity trading and natural resource investment businesses in the People's Republic of China. It operates through Commodity Business; Resource Investment; and Principal Investment and Financial Services segments. The company trades and invests in listed and unlisted securities; provides loan financing services; and invest in loan notes, convertible notes, and other financial assets, as well as invests in and develops mineral resources. It also provides management services; consultancy services in corporate management; and metallurgy technology services. APAC Resources Limited is headquartered in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.apacresources.com",
        "market_cap": "Small Cap"
    },
    "GUE.F": {
        "short_name": "GUOTAI JUNAN INTL.",
        "long_name": "Guotai Junan International Holdings Limited",
        "summary": "Guotai Junan International Holdings Limited, an investment holding company, provides wealth management, brokerage, corporate finance, asset management, loans and financing, financial products, and market making and investment services in Hong Kong and internationally. The company's Brokerage segment is involved in securities, futures, options, and leveraged foreign exchange dealing and brokerage; and the provision of insurance brokerage services. Its Corporate Finance segment provides advisory services; and placing and underwriting services of debt and equity securities. The company's Asset Management segment offers asset management services comprising fund management and investment advisory services. Its Loans and Financing segment provides margin financing products, securities borrowing and lending to margin customers, initial public offering loans, other loans to customers, and bank deposits. The company's Financial Products, Market Making and Investments segment offers funds, fixed income securities, and equity investments, as well as structuring of financial products; and trades in and markets debt securities, exchange traded funds, and derivatives. Its Other segment provides information channel services. The company was founded in 1995 and is based in Central, Hong Kong. Guotai Junan International Holdings Limited is a subsidiary of Guotai Junan Holdings Limited.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.gtja.com",
        "market_cap": "Small Cap"
    },
    "HKB.SI": {
        "short_name": "AMTD IB OV",
        "long_name": "AMTD International Inc.",
        "summary": "AMTD International Inc., an investment holding company, engages in investment banking activities in Hong Kong, Mainland China, the United States, and internationally. The company operates through three segments: Investment Banking, Asset Management, and Strategic Investment. It offers a range of investment banking services, including equity underwriting, debt underwriting, securities brokerage, institutional sales and distribution, and research, as well as advisory services on credit rating, financing, and mergers and acquisitions transactions. The company also provides professional investment management and advisory services primarily to corporate and other institutional clients. In addition, it makes long-term strategic investments focusing on Asia's financial and new economy sectors. The company was formerly known as AMTD Inc. AMTD International Inc. was incorporated in 2019 and is headquartered in Central, Hong Kong. AMTD International Inc. is as subsidiary of AMTD Group Company Limited.",
        "currency": "SGD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.amtdinc.com",
        "market_cap": "Mid Cap"
    },
    "HKIB": {
        "short_name": "AMTD International Inc.",
        "long_name": "AMTD International Inc.",
        "summary": "AMTD International Inc., an investment holding company, engages in investment banking activities in Hong Kong, Mainland China, the United States, and internationally. The company operates through three segments: Investment Banking, Asset Management, and Strategic Investment. It offers a range of investment banking services, including equity underwriting, debt underwriting, securities brokerage, institutional sales and distribution, and research, as well as advisory services on credit rating, financing, and mergers and acquisitions transactions. The company also provides professional investment management and advisory services primarily to corporate and other institutional clients. In addition, it makes long-term strategic investments focusing on Asia's financial and new economy sectors. The company was formerly known as AMTD Inc. AMTD International Inc. was incorporated in 2019 and is headquartered in Central, Hong Kong. AMTD International Inc. is as subsidiary of AMTD Group Company Limited.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.amtdinc.com",
        "market_cap": "Mid Cap"
    },
    "HQF.F": {
        "short_name": "EMPEROR CAPITAL GRP HD-01",
        "long_name": "Emperor Capital Group Limited",
        "summary": "Emperor Capital Group Limited, an investment holding company, provides a range of financial services in Hong Kong, the United States, and internationally. The company operates through Financing, Brokerage, Placing and Underwriting, and Corporate Finance segments. It offers commercial and personal loans comprising short-term unsecured loans, such as tax loans, bridging loans, term loans, and personal loans, as well as long-term secured loans, including property mortgage loans; and margin and initial public offering (IPO) financing. The company also provides brokerage services for securities, futures, and options traded on the exchanges in Hong Kong, Mainland China, and overseas countries; wealth management services, such as providing advice regarding an array of investment services, including securities, mutual funds, insurance-linked products, and real estate investment; asset management services; and discretionary investment services. In addition, it offers placing and underwriting services, as well as acts as a placing agents and underwriters for various Hong Kong listed companies; and corporate finance advisory services on takeovers code related transactions and undertakes sponsor work for IPOs, as well as provides advisory for corporate transactions, including placing, rights issue, corporate restructuring, and merger and acquisition services. Further, the company provides promotion and marketing, and insurance and other brokerage services. Emperor Capital Group Limited was founded in 1993 and is headquartered in Wanchai, Hong Kong. Emperor Capital Group Limited is a subsidiary of Emperor Capital Group Holdings Limited.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wanchai",
        "zipcode": null,
        "website": "http://www.emperorcapital.com",
        "market_cap": "Small Cap"
    },
    "MB01.F": {
        "short_name": "SCULLY ROYALTY LTD.",
        "long_name": "Scully Royalty Ltd.",
        "summary": "Scully Royalty Ltd. operates as a merchant banking company worldwide. The company operates through Iron Ore Royalty, Industrial Equity, and Merkanti Holding segments. The Iron Ore Royalty segment includes interest in a Scully iron ore mine. The Industrial Equity segment consists of various projects in resources and services, including hydrocarbon production and processing assets in Canada, as well as a mining sub-lease of the lands upon which the Scully iron ore mine is situated in Newfoundland and Labrador, Canada. The Merkanti Holding segment regulates trade finance and merchant banking businesses. The company engages in manufacturing, natural resources and medical supplies and services. The company was formerly known as MFC Bancorp Ltd. and changed its name to Scully Royalty Ltd. in June 2019. Scully Royalty Ltd. was incorporated in 2017 and is based in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.scullyroyalty.com",
        "market_cap": "Small Cap"
    },
    "MG3B.F": {
        "short_name": "KINGSTON FIN.GR.LTD.HD-02",
        "long_name": "Kingston Financial Group Limited",
        "summary": "Kingston Financial Group Limited, an investment holding company, provides a range of financial services in Hong Kong and Macau. The company operates through Securities Brokerage, Underwriting, and Placements; Margin and Initial Public Offering (IPO) Financing; Other Financial Services; Hotel Operations; Food and Beverage; Gaming; and Securities Investment segments. It offers brokerage, underwriting, and placements services for dealings in securities on stock exchanges; margin and IPO financing; and corporate finance advisory, futures brokerage, and asset management services. The company also operates hotels and restaurants, as well as casinos in hotels; and trades in listed securities. As of March 31, 2020, it had 69 tables in the mass market halls, 15 tables in the VIP rooms, and 262 slot machines. The company was incorporated in 1996 and is based in Central, Hong Kong. Kingston Financial Group Limited is a subsidiary of Active Dynamic Limited.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.kingston.com.hk",
        "market_cap": "Small Cap"
    },
    "MH9D.SG": {
        "short_name": "Sheng Yuan Holdings Ltd. Regist",
        "long_name": "Sheng Yuan Holdings Limited",
        "summary": "Sheng Yuan Holdings Limited, an investment holding company, provides various financial services in Hong Kong and Mainland China. It operates through: Securities Brokerage and Financial Services, Asset Management Services, Proprietary Trading, and Trading Business segments. The company offers discretionary and non-discretionary dealing services for securities and futures contracts; securities placing and underwriting services; margin financing and money lending services; and corporate finance advisory and general advisory services. It is also involved in the provision of fund management and discretionary portfolio management, and investment advisory services; securities trading; and trading of chemical products and energy and minerals products. Sheng Yuan Holdings Limited serves professional investors and retail investors. The company is based in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.shengyuan.hk",
        "market_cap": "Small Cap"
    },
    "MNA1.F": {
        "short_name": "YUNFENG FINANCIAL GRP LTD",
        "long_name": "Yunfeng Financial Group Limited",
        "summary": "Yunfeng Financial Group Limited, an investment holding company, provides insurance products in Hong Kong and Macau. The company operates in two segments, Insurance Products, and Other Financial Services and Corporate. It provides life and medical insurance, annuities, pension, and mandatory provident fund schemes. The company also provides fund and asset management services, as well as financing and investing solutions; and corporate advisory, and securities placing and underwriting advisory services. In addition, it engages in the provision of employee stock ownership plan administration and principal investment. Further, the company provides administrative, trustee, and general services; agency services to non-life insurers; marketing and promoting products, and public relations services; Internet and multimedia systems, and application development services; and technological development of computer software and hardware, technical consulting, technology services, and database and computer network services. The company was formerly known as REORIENT GROUP LIMITED and changed its name to Yunfeng Financial Group Limited in October 2016. The company was incorporated in 1982 and is based in Central, Hong Kong. Yunfeng Financial Group Limited is a subsidiary of Yunfeng Financial Holdings Limited.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.yff.com",
        "market_cap": "Small Cap"
    },
    "RIA.F": {
        "short_name": "RIVERA (HLDGS)LTD",
        "long_name": "Rivera (Holdings) Limited",
        "summary": "Rivera (Holdings) Limited, an investment holding company, engages in property development and investment, and securities trading and investment businesses in Hong Kong, Macau, and Mainland China. The company develops, sells, and leases residential and commercial cum-office development projects; and holds, sells, and leases approximately 300 car parking spaces. It also provides investment management services. The company was incorporated in 1964 and is based in Central, Hong Kong. Rivera (Holdings) Limited is considered a Red Chip company due to its listing on the Hong Kong Stock Exchange.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.rivera.com.hk",
        "market_cap": "Small Cap"
    },
    "SHK.SG": {
        "short_name": "SUN HUNG KAI & CO. LTD. Registe",
        "long_name": "Sun Hung Kai & Co. Limited",
        "summary": "Sun Hung Kai & Co. Limited, an investment holding company, provides financial services in Hong Kong and China. The company operates through Consumer Finance, Specialty Finance, Mortgage Loans, Investment Management, and Group Management and Support segments. It offers unsecured loan to individuals and businesses through branches and online platforms; and funding solutions to corporates, investment funds, and high net worth individuals. The company also provides structured and specialty financing; mortgage loan financing; consumer, SME, and other financing; portfolio investments; alternative investments; and liquidity services. In addition, it offers secretarial, financial consultancy, nominee, loan guarantee, money lending, asset management, property investment, securities trading, and fund management services. The company was incorporated in 1969 and is headquartered in Causeway Bay, Hong Kong. Sun Hung Kai & Co. Limited is a subsidiary of AP Emerald Limited.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.shkco.com",
        "market_cap": "Small Cap"
    },
    "SRL": {
        "short_name": "Scully Royalty Ltd.",
        "long_name": "Scully Royalty Ltd.",
        "summary": "Scully Royalty Ltd. operates as a merchant banking company worldwide. The company operates through Iron Ore Royalty, Industrial Equity, and Merkanti Holding segments. The Iron Ore Royalty segment includes interest in a Scully iron ore mine. The Industrial Equity segment consists of various projects in resources and services, including hydrocarbon production and processing assets in Canada, as well as a mining sub-lease of the lands upon which the Scully iron ore mine is situated in Newfoundland and Labrador, Canada. The Merkanti Holding segment regulates trade finance and merchant banking businesses. The company engages in manufacturing, natural resources and medical supplies and services. The company was formerly known as MFC Bancorp Ltd. and changed its name to Scully Royalty Ltd. in June 2019. Scully Royalty Ltd. was incorporated in 2017 and is based in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.scullyroyalty.com",
        "market_cap": "Small Cap"
    },
    "TFZ.F": {
        "short_name": "HAITONG INTL SEC.GR.HD-10",
        "long_name": "Haitong International Securities Group Limited",
        "summary": "Haitong International Securities Group Limited provides financial products and services to corporate, institutional, and retail clients worldwide. The Wealth Management segment offers financial services and investment solutions to retail and high net-worth clients. This segment engages in securities broking and dealing, futures, and options contracts; foreign exchange trading; over the counter products and risk management instruments sales; securities margin financing; and the provision of investment advisory, financial planning, and investment funds distribution services, as well and custodian services. The Corporate Finance segment provides sponsoring and underwriting services for fund raising activities in equity and debt capital markets. This segment also provides advisory services and financing solutions for corporate actions, such as mergers and acquisitions, assets restructuring, etc. The Asset Management segment offers investment management services, including public funds, private funds, and mandatory provident funds to individual, corporate, and institutional clients. The Institutional Clients segment provides cash equities sales and trading; brokerage; stock borrowing and lending; equity research; investment and financing solutions; and financial instruments, such as fixed income products, currency and commodity products, futures and options, exchange traded funds, and derivative products in financial centers for institutional clients. The Investment segment invests in investment funds and private equity investments. The company was formerly known as Taifook Securities Group Limited and changed its name to Haitong International Securities Group Limited in November 2010. The company was founded in 1973 and is headquartered in Central, Hong Kong. Haitong International Securities Group Limited is as a subsidiary of Haitong International Holdings Limited",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.htisec.com",
        "market_cap": "Small Cap"
    },
    "TJV.F": {
        "short_name": "SOUTH.SECS INTL SECS",
        "long_name": "Southwest Securities International Securities Limited",
        "summary": "Southwest Securities International Securities Limited, together with its subsidiaries, provides various financial services in Hong Kong. It operates through Brokerage and Margin Financing, Corporate Finance, Asset Management, and Proprietary Trading segments. It acts as financial advisor for mergers and acquisitions, reorganizations, general offers, acquisition financing, and private equity transactions; and a compliance and independent financial adviser. The company also offers debt products, including investment-grade, high-yield, convertible, preferred stock, and panda bonds; equity capital market services; asset management services and advice on securities for corporations, institutions, and high-net-worth individuals. In addition, it is involved in the stock brokerage, securities margin financing and underwriting, subscription of initial public offering, placement of shares, local and overseas bonds brokerage, and exchange traded fund activities, as well as the trading of real estate investment trust, stock warrants, stock options, and CBBCs. Further, the company offers consultation and trading services in the futures market, as well as custodian services; cash management and financing, investment management, wealth planning, and insurance planning services; investment products, such as equity, fixed income, and alternative assets; insurance products; and investment immigration services. Additionally, it distributes unit trusts, mutual funds, investment- linked, and mandatory provident fund products; and provides personal financial consulting and planning, and insurance broking services. The company was formerly known as Tanrich Financial Holdings Limited and changed its name to Southwest Securities International Securities Limited in May 2015. The company was founded in 1990 and is headquartered in Wan Chai, Hong Kong. Southwest Securities International Securities Limited is a subsidiary of Southwest Securities International Investment Limited.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.swsc.hk",
        "market_cap": "Small Cap"
    },
    "TP7.F": {
        "short_name": "RENCO HOLDINGS GRP HD-,10",
        "long_name": "Renco Holdings Group Limited",
        "summary": "Renco Holdings Group Limited, an investment holding company, manufactures and sells printed circuit boards. The company operates through three segments: Manufacturing, Treasury Investments, and Financial Services. It is also involved in the investment and trading of securities and related treasury activities; and provision of securities advisory and asset management services. In addition, the company engages in the provision of information system management services; consultancy and corporate solution services; fund management and investment services; and equity and debt investments. It operates in the People's Republic of China, Singapore, Thailand, Malaysia, Germany, Poland, other European countries, the United States, Korea, Japan, and internationally. The company was formerly known as HKBridge Financial Holdings Limited and changed its name to Renco Holdings Group Limited in July 2020. Renco Holdings Group Limited was founded in 1985 and is based in Hong Kong, Hong Kong.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.renco.com.hk",
        "market_cap": "Small Cap"
    },
    "WAY.F": {
        "short_name": "SHENWAN HONGYUAN (HK)LTD.",
        "long_name": "Shenwan Hongyuan (H.K.) Limited",
        "summary": "Shenwan Hongyuan (H.K.) Limited, an investment holding company, engages in brokerage, corporate finance, asset management, financing and loan, and investment and other businesses in Hong Kong. The company operates in five segments: Enterprise Finance, Personal Finance and Wealth Management, Institutional Services and Trading, Investment Management, and Others. It offers stock underwriting sponsor, bond underwriting, and financial advisory services for corporate clients; and external equity investment, debt investment, other investments, and structured financing solutions. The company also provides securities, futures, and options brokerage services; and wealth management, OTC, and securities margin financing products to individual customers and non-professional institutional investors. In addition, it provides stock brokerage and trading services; research advisory, and investment and financing solutions; and sales, trading, hedging, and over-the-counter derivative services to institutional clients, as well as sells and trades in fixed income bonds, currencies, and commodities. Further, the company offers asset management, investment advisory, and public and private fund management services. Additionally, it offers management and treasury, and share custodian and nominee services; leases computer equipment; and holds properties. The company was formerly known as Shenyin Wanguo (H.K.) Limited and changed its name to Shenwan Hongyuan (H.K.) Limited in May 2015. Shenwan Hongyuan (H.K.) Limited was incorporated in 1972 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.swhyhk.com",
        "market_cap": "Small Cap"
    }
}