{
    "0505.HK": {
        "short_name": "XINGYE ALLOY",
        "long_name": "Xingye Alloy Materials Group Limited",
        "summary": "Xingye Alloy Materials Group Limited manufactures, sells, and trades in high precision copper plates and strips in Mainland China, Thailand, Taiwan, and internationally. It operates through Copper Products and Online Games segments. The company's products include high precision tin-phosphor bronze strips, copper tin zinc alloys, brass strips, zinc copper strips, multicomponent copper alloys, copper alloy strips, copper alloys, and red copper strips. It also trades in raw materials; develops, publishes, and operates online games and provides related services; and provides processing and property services. The company's products are used in electronic equipment, automobile, and electric power and household appliances. It also exports its products to Southeast Asia, India, and other countries. The company was formerly known as Huan Yue Interactive Holdings Limited and changed its name to Xingye Alloy Materials Group Limited in July 2020. Xingye Alloy Materials Group Limited was founded in 1985 and is headquartered in Kowloon, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kowloon"
    },
    "0661.HK": {
        "short_name": "CDAYENONFER",
        "long_name": "China Daye Non-Ferrous Metals Mining Limited",
        "summary": "China Daye Non-Ferrous Metals Mining Limited, an investment holding company, engages in the exploration, development, mining, and processing of mineral ores in the People's Republic of China, Hong Kong, and the Republic of Mongolia. It explores for copper, gold, silver, iron, and molybdenum deposits. The company holds interests in the Tonglvshan and Tongshankou mines located in Daye City; Fengshan and Chimashan mines located in Yangxin County; and Sareke copper mine located in Wuqia County. It is also involved in the trading of metals, minerals, and concentrates; quality testing of construction projects; and provision of research and development services. The company is headquartered in Kowloon, Hong Kong. China Daye Non-Ferrous Metals Mining Limited is a subsidiary of China Times Development Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kowloon"
    },
    "2362.HK": {
        "short_name": "JINCHUAN INTL",
        "long_name": "Jinchuan Group International Resources Co. Ltd",
        "summary": "Jinchuan Group International Resources Co. Ltd, an investment holding company, engages in the development and operation of mining resources projects in the Central African countries. The company operates through Mining Operations, and Trading of Mineral and Metal Products. It primarily operates various copper and cobalt mines and projects in the Republic of Zambia and the Democratic Republic of the Congo. The company also trades in copper concentrates, cathode, and blister; cobalt; and other related raw materials. In addition, it has operations in Hong Kong, South Africa, the Democratic Republic of the Congo, the People's Republic of China, and Switzerland. The company was incorporated in 2001 and is headquartered in Admiralty, Hong Kong. Jinchuan Group International Resources Co. Ltd operates as a subsidiary of Jinchuan (BVI) Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Admiralty"
    },
    "DPY3.SG": {
        "short_name": "Global Strategic Group Ltd. Reg",
        "long_name": "Global Strategic Group Limited",
        "summary": "Global Strategic Group Limited, an investment holding company, supplies natural gas in the People's Republic of China. The company operates in three segments: Natural Gas Operations, Leasing business, and Independent Financial Advisory. It also invests in natural gas projects; sells natural gas cooking appliances and accessories; and provides pipeline installation services. In addition, the company offers leasing services for steel support axial force servo system and technology support; and independent financial advisory and insurance brokerage services. Further, it provides commodity trading services; and designs and constructs energy power generation equipment, energy storage systems, and power equipment, as well as provides technology development, technical, and technology transfer services. The company was formerly known as DIGITALHONGKONG.COM and changed its name to Global Strategic Group Limited in January 2015. Global Strategic Group Limited was incorporated in 2000 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "GDZD.F": {
        "short_name": "JINCHUAN GR.INT.RES.HD-01",
        "long_name": "Jinchuan Group International Resources Co. Ltd",
        "summary": "Jinchuan Group International Resources Co. Ltd, an investment holding company, engages in the development and operation of mining resources projects in the Central African countries. The company operates through Mining Operations, and Trading of Mineral and Metal Products. It primarily operates various copper and cobalt mines and projects in the Republic of Zambia and the Democratic Republic of the Congo. The company also trades in copper concentrates, cathode, and blister; cobalt; and other related raw materials. In addition, it has operations in Hong Kong, South Africa, the Democratic Republic of the Congo, the People's Republic of China, and Switzerland. The company was incorporated in 2001 and is headquartered in Admiralty, Hong Kong. Jinchuan Group International Resources Co. Ltd operates as a subsidiary of Jinchuan (BVI) Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Admiralty"
    },
    "TFTB.F": {
        "short_name": "CN DAYE NON-FE.M.M.HD-,05",
        "long_name": "China Daye Non-Ferrous Metals Mining Limited",
        "summary": "China Daye Non-Ferrous Metals Mining Limited, an investment holding company, engages in the exploration, development, mining, and processing of mineral ores in the People's Republic of China, Hong Kong, and the Republic of Mongolia. It explores for copper, gold, silver, iron, and molybdenum deposits. The company holds interests in the Tonglvshan and Tongshankou mines located in Daye City; Fengshan and Chimashan mines located in Yangxin County; and Sareke copper mine located in Wuqia County. It is also involved in the trading of metals, minerals, and concentrates; quality testing of construction projects; and provision of research and development services. The company is headquartered in Kowloon, Hong Kong. China Daye Non-Ferrous Metals Mining Limited is a subsidiary of China Times Development Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Kowloon"
    }
}