{
    "TBET": {
        "short_name": "TIBET PHARMACEUTICALS INC",
        "long_name": "Tibet Pharmaceuticals, Inc.",
        "summary": "Tibet Pharmaceuticals, Inc., a specialty pharmaceutical company, engages in the research, development, manufacture, marketing, and sale of traditional Tibetan medicines. The company, through its operational entity, Yunnan Shangri-La Tibetan Pharmaceutical Group Limited (YSTP), develops products in China for promoting health in human respiratory, digestive, urinary, and reproductive systems. Its commercialized products include 25 Ingredients Mandrake Pill, which is used to regulate menses to treat endometritis, pelvic inflammations, and women's anemia; 15 Ingredients Gentiana Pill to treat bronchitis, emphysema, asthma, and hoarseness; 28 Ingredients Pinang Pill for treating cold waist hip pain, pus hematuria, and testis swelling; 18 Ingredients Chebulic (Myrobalan) Frusemide Pill for the treatment of kidney problems, lumbar and kidney pain, frequent urination, turbid urine, diabetes, and spermatorrhea; and Pomegranate Nichirin Pill to treat indigestion, back and leg pain, frequent urination, foot edema, impotence, and nocturnal emission. The company also develops Xuezang Guben pill indicated for the treatment of neurasthenia, insomnia, frequent urination, nocturnal emission, and women's menopausal symptoms; Shengke I that is in Phase III clinical testing for treating type II diabetes; Shengke II, which is in Phase II clinical testing for treating impotence and premature ejaculation, prostrate disease, and memory loss; Jiuzan pill that is in Phase II clinical testing for the treatment of chronic gastroenteritis and peptic ulcers; and Antai pill, a pre-clinical stage product for treating hepatitis B. In addition, it focuses to commercialize Wupeng Pill for treating echimococosis, pandora tingling disease, diphtheria, anthrax, yellow water disease, and leprosy. The company was formerly known as Shangri-La Tibetan Pharmaceuticals, Inc. and changed its name to Tibet Pharmaceuticals Inc. in July 2010. Tibet Pharmaceuticals, Inc. is headquartered in Wanchai, Hong Kong.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drugs - Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wanchai",
        "zipcode": null,
        "website": null,
        "market_cap": "Nano Cap"
    }
}