{
    "0724.HK": {
        "short_name": "RUIXIN INT'L",
        "long_name": "Ruixin International Holdings Limited",
        "summary": "Ruixin International Holdings Limited, an investment holding company, manufactures and trades in electronic and electrical parts and components in People's Republic of China, the Asia Pacific, and internationally. It also provides management, consulting, and construction and related services, as well as general trading services. The company was formerly known as Sino-Tech International Holdings Limited and changed its name to Ruixin International Holdings Limited in July 2016. Ruixin International Holdings Limited is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": null,
        "market_cap": 43689048
    },
    "0725.HK": {
        "short_name": "PERENNIAL INT'L",
        "long_name": "Perennial International Limited",
        "summary": "Perennial International Limited, an investment holding company, manufactures and trades in electric cables and wire products. It offers power cords, power cord sets, cables and solid wires, wire harnesses and accessories, and plastic resins and compounds. The company also engages in property holding and license activities. It serves multi-national producers of electrical and electronic products primarily in the United States, Europe, Australia, Mainland China, Japan, and Southeast Asia. The company was founded in 1989 and is headquartered in Tsimshatsui, Hong Kong. Perennial International Limited is a subsidiary of Spector Holdings Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://perennial.todayir.com/en/index.php",
        "market_cap": 159166400
    },
    "1166.HK": {
        "short_name": "SOLARTECH INT'L",
        "long_name": "Solartech International Holdings Limited",
        "summary": "Solartech International Holdings Limited, an investment holding company, manufactures and trades in cables and wires, and copper rods in the People's Republic of China, the Americas, Europe, Hong Kong, and other Asian regions. It offers cables and wires primarily to the manufacturers of white goods appliances. The company is also involved in the manufacture and trade of plastic products; trading of frozen foods; property holding; provision of financing and management services; holding of mining rights; and trademark holding activities. Solartech International Holdings Limited is headquartered in Tsim Sha Tsui, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.1166hk.com",
        "market_cap": 213707712
    },
    "1366.HK": {
        "short_name": "JIANGNAN GP",
        "long_name": "Jiangnan Group Limited",
        "summary": "Jiangnan Group Limited, an investment holding company, manufactures and trades in wires and cables in the People's Republic of China. It operates through Power Cables, Wires and Cables for Electrical Equipment, Bare Wires, and Special Cables segments. The company offers power cables primarily for the use in power transmission and distribution systems; and wires and cables for use in the supply and distribution of electricity for various applications, such as industrial machinery, instruments, meters, and household appliances, as well as wires in the buildings. It also provides bare wires, including aluminum reinforced wires, aluminum conductor steel reinforced wires, and aluminum alloy conductors that are used as overhead power lines for power transmission; and special cables and wires for the ship building, wind power generation, and mining industries, as well as rubber, fire proof, and other cables. In addition, the company is involved in the trading of copper conductors, and wires and cables; and engineering, procurement, and construction of electric power related projects. Its products are used in power and general industries, including metals and mining, oil and gas, transportation, shipbuilding, and construction industries. Jiangnan Group Limited also exports its products to approximately 100 countries. The company was founded in 1997 and is based in Shatin, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sha Tin",
        "zipcode": null,
        "website": "http://www.jiangnangroup.com",
        "market_cap": 2416728576
    },
    "1399.HK": {
        "short_name": "VESON HLDG",
        "long_name": "Veson Holdings Limited",
        "summary": "Veson Holdings Limited, an investment holding company, engages in the research, development, manufacture, and sale of lithium-ion battery modules and related accessories for mobile phones, tablets, and digital electronic appliances in the People's Republic of China. The company operates through Original Design Manufacturing Business, Own-Brand Business, Bare Battery Cell Business, and Others segments. It offers power banks, motive batteries and related accessories, power management modules, smart wearable device batteries and related accessories, and lithium-ion bare battery cells, as well as chargers and network terminal products. The company also provides corporate management services. It markets its products through sales network integrating distributors, agents, retailers, and e-commerce. The company was formerly known as SCUD Group Limited and changed its name to Veson Holdings Limited in November 2020. Veson Holdings Limited was founded in 1997 and is headquartered in Causeway Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.vesonhldg.com",
        "market_cap": 277949984
    },
    "1539.HK": {
        "short_name": "SYNERGY GROUP",
        "long_name": "Synergy Group Holdings International Limited",
        "summary": "Synergy Group Holdings International Limited, an investment holding company, primarily engages in the trading of energy saving products. The company operates through Leasing Service of Energy Saving Systems, Trading of Energy Saving Products, and Consultancy Service segments. It also provides energy management systems solutions; and leases and maintains cooling systems. The company operates in Hong Kong, Japan, Australia, Malaysia, Indonesia, Singapore, Macau, and internationally. Synergy Group Holdings International Limited was founded in 2008 and is headquartered in North Point, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "North Point",
        "zipcode": null,
        "website": "http://www.synergy-group.com",
        "market_cap": 422400000
    },
    "1608.HK": {
        "short_name": "VPOWER GROUP",
        "long_name": "VPower Group International Holdings Limited",
        "summary": "VPower Group International Holdings Limited designs, integrates, and sells gas-fired and diesel-fired gen-sets and power generation systems in Hong Kong, Mainland China, other Asian countries, and internationally. The company operates through two segments, System Integration; and Investment, Building, and Operating. The System Integration segment designs, integrates, sells, and installs engine-based electricity generation units. The Investment, Building, and Operating segment designs, invests in, builds, and operates distributed power generation stations to provide distributed power solutions. In addition, the company engages in the sale and installation of power generation systems; trading of engines and components; and management and technical services. It serves customers in various sectors, including industry-grade and utility-grade DGP stations, governmental, residential and commercial buildings, data centers, hotels, construction works, mining operations, and railway and telecommunications projects. The company was founded in 2001 and is headquartered in Hung Hom, Hong Kong. VPower Group International Holdings Limited is a subsidiary of Energy Garden Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hung Hom",
        "zipcode": null,
        "website": "http://vpower.com",
        "market_cap": 4817394176
    },
    "1710.HK": {
        "short_name": "TRIO IND ELEC",
        "long_name": "Trio Industrial Electronics Group Limited",
        "summary": "Trio Industrial Electronics Group Limited, an investment holding company, operates as an electronic manufacturing service provider for industrial electronic components and products in Europe, the People's Republic of China, South East Asia, North America, and internationally. It provides electro-mechanical products; smart chargers; switch-mode power supplies; and smart vending systems. The company also offers automatic testing equipment, as well as manufacturing management system, tools, and equipment; and sells and develops printed circuit boards and electronics subassemblies. Its products are applied in various industrial electronic equipment, such as renewable energy facilities, telecommunications equipment, commercial freight equipment, medical devices, and security systems. The company was founded in 1983 and is headquartered in Hung Hom, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hung Hom",
        "zipcode": null,
        "website": "http://www.trio-ieg.com",
        "market_cap": 245000000
    },
    "1729.HK": {
        "short_name": "TIME INTERCON",
        "long_name": "Time Interconnect Technology Limited",
        "summary": "Time Interconnect Technology Limited, an investment holding company, manufactures and sells cable assembly products in the People's Republic of China, the United States, the Netherlands, Hong Kong, and internationally. The company offers copper and optical fiber cable assemblies; and manufactures and trades in robotic products. It serves customers in the telecommunication, data center, and industrial and medical equipment sectors. The company was founded in 1992 and is headquartered in Shatin, Hong Kong. Time Interconnect Technology Limited is a subsidiary of Time Interconnect Holdings Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sha Tin",
        "zipcode": null,
        "website": "http://www.time-interconnect.com",
        "market_cap": 791384896
    },
    "2V3.F": {
        "short_name": "VPOWER GR.INT.HLDGS.HD-,1",
        "long_name": "VPower Group International Holdings Limited",
        "summary": "VPower Group International Holdings Limited designs, integrates, and sells gas-fired and diesel-fired gen-sets and power generation systems in Hong Kong, Mainland China, other Asian countries, and internationally. The company operates through two segments, System Integration; and Investment, Building, and Operating. The System Integration segment designs, integrates, sells, and installs engine-based electricity generation units. The Investment, Building, and Operating segment designs, invests in, builds, and operates distributed power generation stations to provide distributed power solutions. In addition, the company engages in the sale and installation of power generation systems; trading of engines and components; and management and technical services. It serves customers in various sectors, including industry-grade and utility-grade DGP stations, governmental, residential and commercial buildings, data centers, hotels, construction works, mining operations, and railway and telecommunications projects. The company was founded in 2001 and is headquartered in Hung Hom, Hong Kong. VPower Group International Holdings Limited is a subsidiary of Energy Garden Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hung Hom",
        "zipcode": null,
        "website": "http://vpower.com",
        "market_cap": 508789408
    },
    "3393.HK": {
        "short_name": "WASION HOLDINGS",
        "long_name": "Wasion Holdings Limited",
        "summary": "Wasion Holdings Limited, an investment holding company, researches, develops, produces, and sells energy metering and energy efficiency management for energy supply industries in the China and internationally. The company operates through Power Advanced Metering Infrastructure, Communication and Fluid Advanced Metering Infrastructure, and Advanced Distribution Operations segments. It offers smart meters, smart water meters, smart gas meters, and ultrasonic calorimeters; various meters and power quality monitoring devices; energy data collection terminals, load management terminals, and user management devices; and measurement automation systems and various application systems, services, and energy data mining, as well as system solution and communication terminals solution services. The company also offers high voltage switchgears, smart switchgears, circuit breakers, power distribution automation terminals, electrical and electronic devices for power quality control, and smart distribution systems, as well as engineering, energy-saving services, etc. In addition, it provides smart power distribution devices and energy efficiency solution services; and power meters and heat meters, as well as trades in electronic components. The company was formerly known as Wasion Group Holdings Limited and changed its name to Wasion Holdings Limited in June 2018. The company was founded in 2000 and is headquartered in Sheung Wan, Hong Kong. Wasion Holdings Limited is a subsidiary of Star Treasure Investments Holdings Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sheung Wan",
        "zipcode": "410205",
        "website": "http://www.wasion.com",
        "market_cap": 2639081984
    },
    "8137.HK": {
        "short_name": "HONBRIDGE",
        "long_name": "Honbridge Holdings Limited",
        "summary": "Honbridge Holdings Limited, an investment holding company, engages in the research, development, production, and sale of lithium battery in the People's Republic of China, Belgium, and Sweden. It operates through Mineral Resources Exploration and Trading; Lithium Battery Production; and Battery Swapping Service segments. The company also researches and explores mineral resources; trades in copper and steel; and provides power exchange services. In addition, the company researches and explores for iron ores in Brazil. The company is headquartered in Wanchai, Hong Kong. Honbridge Holdings Limited is a subsidiary of Hong Bridge Capital Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wanchai",
        "zipcode": null,
        "website": "http://www.8137.hk",
        "market_cap": 4680901632
    },
    "JGA.F": {
        "short_name": "JIANGNAN GROUP LTD HD-,01",
        "long_name": "Jiangnan Group Limited",
        "summary": "Jiangnan Group Limited, an investment holding company, manufactures and trades in wires and cables in the People's Republic of China. It operates through Power Cables, Wires and Cables for Electrical Equipment, Bare Wires, and Special Cables segments. The company offers power cables primarily for the use in power transmission and distribution systems; and wires and cables for use in the supply and distribution of electricity for various applications, such as industrial machinery, instruments, meters, and household appliances, as well as wires in the buildings. It also provides bare wires, including aluminum reinforced wires, aluminum conductor steel reinforced wires, and aluminum alloy conductors that are used as overhead power lines for power transmission; and special cables and wires for the ship building, wind power generation, and mining industries, as well as rubber, fire proof, and other cables. In addition, the company is involved in the trading of copper conductors, and wires and cables; and engineering, procurement, and construction of electric power related projects. Its products are used in power and general industries, including metals and mining, oil and gas, transportation, shipbuilding, and construction industries. Jiangnan Group Limited also exports its products to approximately 100 countries. The company was founded in 1997 and is based in Shatin, Hong Kong.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sha Tin",
        "zipcode": null,
        "website": "http://www.jiangnangroup.com",
        "market_cap": 244519200
    },
    "W1U.F": {
        "short_name": "WASION HOLDINGS  HD-,01",
        "long_name": "Wasion Holdings Limited",
        "summary": "Wasion Holdings Limited, an investment holding company, researches, develops, produces, and sells energy metering and energy efficiency management for energy supply industries in the China and internationally. The company operates through Power Advanced Metering Infrastructure, Communication and Fluid Advanced Metering Infrastructure, and Advanced Distribution Operations segments. It offers smart meters, smart water meters, smart gas meters, and ultrasonic calorimeters; various meters and power quality monitoring devices; energy data collection terminals, load management terminals, and user management devices; and measurement automation systems and various application systems, services, and energy data mining, as well as system solution and communication terminals solution services. The company also offers high voltage switchgears, smart switchgears, circuit breakers, power distribution automation terminals, electrical and electronic devices for power quality control, and smart distribution systems, as well as engineering, energy-saving services, etc. In addition, it provides smart power distribution devices and energy efficiency solution services; and power meters and heat meters, as well as trades in electronic components. The company was formerly known as Wasion Group Holdings Limited and changed its name to Wasion Holdings Limited in June 2018. The company was founded in 2000 and is headquartered in Sheung Wan, Hong Kong. Wasion Holdings Limited is a subsidiary of Star Treasure Investments Holdings Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sheung Wan",
        "zipcode": "410205",
        "website": "http://www.wasion.com",
        "market_cap": 287728000
    }
}