{
    "0380.HK": {
        "short_name": "SOFTPOWER INT",
        "long_name": "Softpower International Limited",
        "summary": "Softpower International Limited, an investment holding company, trades in construction materials in Hong Kong, Macau, and Mainland China. The company operates in two segments, Trading of Pipes and Fittings, and Biomass Pellet Fuel Products. It engages in the wholesale, retail, warehouse, and logistics of pipes, fittings, related products, and services and solutions to the contractors, designers, consultants, and government agencies. The company offers copper tube, ductile iron, and steel pipes. It also manufactures and sells biomass pellet fuel products. The company was formerly known as China Pipe Group Limited and changed its name to Softpower International Limited in December 2015. Softpower International Limited was founded in 1949 and is headquartered in Tsim Sha Tsui, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Home Improvement Retail",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.softpower.hk",
        "market_cap": 183853248
    },
    "EBN.F": {
        "short_name": "E.BON HOLDINGS  HD-,10",
        "long_name": "E. Bon Holdings Limited",
        "summary": "E. Bon Holdings Limited, an investment holding company, imports, wholesales, retails, and installs architectural builders' hardware, bathroom and kitchen collections, and furniture in the Hong Kong and the People's Republic of China. The company also provides interior decoration project management services for property development, consulting services for interior design, and human resources planning services, as well as fitting out works. In addition, it engages in the property holding activities. The company serves contractors, property developers, and dealers. E. Bon Holdings Limited was founded in 1976 and is headquartered in Causeway Bay, Hong Kong.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Home Improvement Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.ebon.com.hk",
        "market_cap": 27131274
    }
}