{
    "0318.HK": {
        "short_name": "VONGROUP",
        "long_name": "Vongroup Limited",
        "summary": "Vongroup Limited, an investment holding company, engages in the technology and management, financial services, property, and securities businesses in Hong Kong, the People's Republic of China, and Macau. The company's Technology & Management segment offers technology and management related services, including fintech, cloud, distance business, and virtual technologies. This segment also provides services to analyze, design, develop, operate, and maintain integrated e-commerce and other online commercials, educational, and biotech platforms and products. Its Financial Services segment provides consumer finance and other financial/business related services. The company's Property segment engages in acquiring, managing, operating, and renting undervalued commercial, residential, and carpark properties. The company's Securities segment trades in securities and related activities. Vongroup Limited is headquartered in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kwun Tong"
    },
    "0771.HK": {
        "short_name": "AUTOMATED SYS",
        "long_name": "Automated Systems Holdings Limited",
        "summary": "Automated Systems Holdings Limited, an investment holding company, provides information technology (IT) services to corporate customers. It operates in two divisions, IT Products and IT Services. The company sells computer products and solutions. It also offers hardware services, including installation and maintenance; and software services, such as software development, consulting, and professional services. In addition, the company provides systems integration, engineering support for products and solutions, and managed services. Further, it is involved in the property holding, international trading, fund investment, and treasury management activities. Automated Systems Holdings Limited operates in Hong Kong, Mainland China, Macau, Thailand, and Taiwan. The company was founded in 1973 and is headquartered in Sha Tin, Hong Kong. Automated Systems Holdings Limited is a subsidiary of Teamsun Technology (HK) Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Sha Tin"
    },
    "1037.HK": {
        "short_name": "MAXNERVA TECH",
        "long_name": "Maxnerva Technology Services Limited",
        "summary": "Maxnerva Technology Services Limited, an investment holding company, operates in the industrial solution, smart office, and new retail businesses in Hong Kong, Mainland China, North America, and other Asian countries. The company provides a range of smart manufacturing solutions, including system design, digital factory implementation, and advanced automation; and other Internet-of-Things and system integration solutions. It also offers information technology infrastructure services, including cloud services; planning, design, deployment, and maintenance services; and related equipment procurement services. In addition, the company engages in the provision of video conference and display-related solutions; and brand licensing and supply chain management of smart office equipment. Further, it is involved in the advertising business in the alcohol industry and other opportunities. The company was formerly known as Daiwa Associate Holdings Limited and changed its name to Maxnerva Technology Services Limited in April 2016. Maxnerva Technology Services Limited was incorporated in 1994 and is based in Tsim Sha Tsui East, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui East"
    },
    "1059.HK": {
        "short_name": "KANTONE HOLDING",
        "long_name": "Kantone Holdings Limited",
        "summary": "Kantone Holdings Limited, an investment holding company, engages in the sale and leasing of systems products and software licensing and customisation businesses in the People's Republic of China and Europe. It also researches, develops, trades in, and sells cultural products; and designs, manufactures, and distributes communication systems and equipment, as well as offers consulting services. The company is based in Hong Kong, Hong Kong. Kantone Holdings Limited is a subsidiary of Champion Technology Holdings Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "1686.HK": {
        "short_name": "SUNEVISION",
        "long_name": "SUNeVision Holdings Ltd.",
        "summary": "SUNeVision Holdings Ltd., an investment holding company, engages in the data center business in Hong Kong. The company is involved in the provision of facilities management and value added services. It also engages in the design, installation, operation, laying, and cabling of extra-low voltage and information technology systems, as well as building access, voice, data, power supply systems and network, and other infrastructure networks; and provision of related repair and maintenance services. In addition, the company offers IT and optical fiber network, and related maintenance services; treasury services; and financing, management, and company secretary services. Further, it is involved in property and trademark holding activities. The company is headquartered in Kwun Tong, Hong Kong. SUNeVision Holdings Ltd. is a subsidiary of Sunco Resources Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kwun Tong"
    },
    "1985.HK": {
        "short_name": "MICROWARE",
        "long_name": "Microware Group Limited",
        "summary": "Microware Group Limited, an investment holding company, provides information technology (IT) infrastructure solutions and IT managed services for the governments, educational institutions, public bodies, and commercial organizations in Hong Kong. The company offers servers, data storage, and networking equipment; and connectivity, app management, and automation solutions, as well as app and data protection solutions. It also provides email, network, and cloud security solutions, as well as client devices and secure access solutions to protect sensitive data, account information, intellectual property and network operations; and managed services, such as service desk, technical specialist, and onboarding services. In addition, it provides consultancy and advisory services; and engages in the management and maintenance of the IT infrastructure solutions, as well as cyber securities training programs. The company was incorporated in 2016 and is headquartered in Kwun Tong, Hong Kong. Microware Group Limited is a subsidiary of Microware International Holdings Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kwun Tong"
    },
    "1UK.F": {
        "short_name": "CLPS INC.  DL-,0001",
        "long_name": "CLPS Incorporation",
        "summary": "CLPS Incorporation provides information technology, consulting, and solutions services to institutions operating in banking, insurance, and financial sectors in the People's Republic of China and internationally. It offers IT consulting services in credit card business areas, such as credit card application, account setup, authorization and activation, settlement, collection, promotion, point system, anti-fraud, statement, reporting, and risk management. The company also provides core banking services, including business analysis, system design, development, testing, system maintenance, and operation support; and services in loans, deposit, general ledger, wealth management, debit card, anti-money-laundering, statement and reporting, and risk management, as well as architecture consulting services for core banking systems, and online and mobile banking. In addition, it offers solutions in the field of wealth management; e-Commerce solutions in online platforms, cross-border e-commerce, logistics, and back-end technology, such as big data analysis, and intelligent decision-making among others; and driving, automatic control, and other AI-driven technology solutions for the automotive industry. Further, the company provides IT consulting services to its clients in the banking, wealth management, e-commerce, and automotive industries, among others; and software project development, maintenance, and testing solution services, including COBOL, Java, .NET, Mobile, and other technology applications. Additionally, it offers CLPS Virtual Banking Platform, a training platform for IT talents owned by CLPS; recruitment and headhunting, as well as fee-for-service training services; and sells product and third-party software. The company was founded in 2005 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Kwun Tong"
    },
    "5EK.SI": {
        "short_name": "$ SinoCloud",
        "long_name": "SinoCloud Group Limited",
        "summary": "SinoCloud Group Limited, an investment holding company, provides Internet data center services in the People's Republic of China. It also offers cloud computing and big data services. The company was formerly known as Armarda Group Limited and changed its name to SinoCloud Group Limited in August 2015. SinoCloud Group Limited was founded in 2003 and is based in Tsim Sha Tsui, Hong Kong.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "8050.HK": {
        "short_name": "QUANTUM THINK",
        "long_name": "Quantum Thinking Limited",
        "summary": "Quantum Thinking Limited, an investment holding company, engages in the provision of system development and other value-added technical consultation services, and hardware-related businesses in the People's Republic of China. It operates through System Development, Consultancy, Maintenance and Other Services; and Sales of Hardware Products segments. The company engages in developing and establishing integrated online platforms for the distribution of mobile products, as well as online network systems; and technical and software development of identity authentication services related products. In addition, it provides IT network consultation services; and trades in residential gateway products. The company was formerly known as Yunbo Digital Synergy Group Limited and changed its name to Quantum Thinking Limited in December 2017. The company was incorporated in 2000 and is headquartered in Wan Chai, Hong Kong. Quantum Thinking Limited is a subsidiary of Happy On Holdings Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "8103.HK": {
        "short_name": "HMVOD",
        "long_name": "hmvod Limited",
        "summary": "hmvod Limited, an investment holding company, engages in the provision of professional services, proprietary trading activities, and over-the-top (OTT) services in the People's Republic of China. The company's Professional Services segment offers information technology engineering and technical support services, including financial valuation and IT services. Its Proprietary Trading segment is involved in trading listed securities. The company's OTT services segment produces and distributes films, television programs, and music production on OTT platforms. In addition, it provides provision of services and solutions on cyber security; and multi-media related and content services. The company was formerly known as Trillion Grand Corporate Company Limited and changed its name to hmvod Limited in October 2018. hmvod Limited is based in Cheung Sha Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Cheung Sha Wan"
    },
    "8148.HK": {
        "short_name": "AURUM PACIFIC",
        "long_name": "Aurum Pacific (China) Group Limited",
        "summary": "Aurum Pacific (China) Group Limited, an investment holding company, engages in the development and marketing of server based technology, and provision of communications software platform and software related services in Hong Kong, Mainland China, and internationally. The company operates through three segments: Software Platform, Money Lending, and Mobile Gaming and Applications. It also engages in the money lending business. In addition, the company is involved in the development and publishing of mobile games and applications, and related intellectual property and platform; development of mobile data solutions; and provision of IT related solutions. Further, it offers custom-made software development services. The company was formerly known as S & D International Development Group Limited and changed its name to Aurum Pacific (China) Group Limited in November 2008. Aurum Pacific (China) Group Limited is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "8319.HK": {
        "short_name": "EXPERT SYS",
        "long_name": "Expert Systems Holdings Limited",
        "summary": "Expert Systems Holdings Limited, an investment holding company, provides information technology (IT) infrastructure solutions in Hong Kong and Macau. The company's IT infrastructure solutions include server and storage consolidation, virtualization, backup and recovery, disaster recovery, software-defined data center, hyper-convergence, confidential mail, email and file archive, enterprise content management and collaboration, and high performance computing services; and directory and email services setup, upgrade, and migration services. Its IT infrastructure solutions also comprise networking and wireless infrastructure and management, campus and enterprise networking, unified communication, network optimization, and software-defined networking and WAN services, as well as PC migration, edge management, virtual desktop infrastructure, enterprise mobility management, point of sales, managed printing, and passbook printing services. In addition, the company offers private and public cloud, hybrid and multiple cloud, cross cloud architecture, hybrid cloud extension, and container services; and IoT, data, cloud, Web and email, endpoint and mobile, system, and network security services, as well as finance leasing services. It serves medium-sized and large multinational, and local business enterprises in various industries, such as banking, finance, insurance, telecommunications, information technology, and media; fashion, jewelry, and accessories; property and construction; and entertainment, hotel, and travel, as well as government, education institutions, and NGOs. The company was founded in 1985 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kwun Tong"
    },
    "8606.HK": {
        "short_name": "KINETIX SYSTEMS",
        "long_name": "Kinetix Systems Holdings Limited",
        "summary": "Kinetix Systems Holdings Limited, an investment holding company, provides information technology (IT) services in Hong Kong and Macau. The company operates through four segments: IT Infrastructure Solutions Services, IT Development Solutions Services, IT Maintenance and Support Services, and Trading of Entertainment Products. It provides IT infrastructure solutions services to its clients by advising them the hardware and/or software that their IT systems would require and procuring the hardware and/or software from a range of authorized distributors or third party suppliers and integrating them with clients' IT systems. The company also offers IT development solutions services, including system analysis and design, software development, and technology consultancy services; and IT maintenance and support services. In addition, it engages in the e-commerce business, which includes the trading of entertainment products. It serves customers in private and public sectors, including government and statutory bodies, banks and financial institutions, technology, media, telecom companies, transportation and logistics companies, etc. The company was founded in 1998 and is headquartered in Kwun Tong, Hong Kong. Kinetix Systems Holdings Limited is a subsidiary of Vigorous King Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kwun Tong"
    },
    "8645.HK": {
        "short_name": "NOMAD TECH",
        "long_name": "Nomad Technologies Holdings Limited",
        "summary": "Nomad Technologies Holdings Limited, an investment holding company, provides managed internet services in Malaysia. The company offers network support services, including network infrastructure design and hardware installation, and network management and security services. It also provides network connectivity services, such as intranet and internet connectivity solutions and value-added services. Nomad Technologies Holdings Limited was founded in 2007 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "BBW.SI": {
        "short_name": "Azeus",
        "long_name": "Azeus Systems Holdings Ltd.",
        "summary": "Azeus Systems Holdings Ltd., an investment holding company, provides information technology (IT) products and services in Hong Kong, the United Kingdom, Australia, New Zealand, North America, the Middle East, Europe, and internationally. It operates through two segments, IT Services and Azeus Products. The company's application services include application development, and maintenance and support of packaged applications; custom application/IT outsourcing services, such as maintenance and support for custom built applications; and application portfolio management services. Its business process outsourcing services comprise business process management and business technology solutions; and consulting services, such as IT strategy formulation and planning, technology selection and planning, feasibility study, technical study, and infrastructure plan. In addition, the company offers solutions, such as AzeusCare, an integrated system for managing and delivering social care; Convene, a mobile application for meetings, document access, and collaboration; electronic record keeping system, a web-based document management solution; CENTROPURCHASE, an online system for purchasing process; and ICUBED, a proprietary technology solution for intellectual property information access. Further, it provides systems implementation and enhancement services. The company was founded in 1991 and is based in North Point, Hong Kong. Azeus Systems Holdings Ltd. is a subsidiary of Mu Xia Ltd.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Hong Kong",
        "city": "North Point"
    },
    "CLPS": {
        "short_name": "CLPS Incorporation",
        "long_name": "CLPS Incorporation",
        "summary": "CLPS Incorporation provides information technology, consulting, and solutions services to institutions operating in banking, insurance, and financial sectors in the People's Republic of China and internationally. It offers IT consulting services in credit card business areas, such as credit card application, account setup, authorization and activation, settlement, collection, promotion, point system, anti-fraud, statement, reporting, and risk management. The company also provides core banking services, including business analysis, system design, development, testing, system maintenance, and operation support; and services in loans, deposit, general ledger, wealth management, debit card, anti-money-laundering, statement and reporting, and risk management, as well as architecture consulting services for core banking systems, and online and mobile banking. In addition, it offers solutions in the field of wealth management; e-Commerce solutions in online platforms, cross-border e-commerce, logistics, and back-end technology, such as big data analysis, and intelligent decision-making among others; and driving, automatic control, and other AI-driven technology solutions for the automotive industry. Further, the company provides IT consulting services to its clients in the banking, wealth management, e-commerce, and automotive industries, among others; and software project development, maintenance, and testing solution services, including COBOL, Java, .NET, Mobile, and other technology applications. Additionally, it offers CLPS Virtual Banking Platform, a training platform for IT talents owned by CLPS; recruitment and headhunting, as well as fee-for-service training services; and sells product and third-party software. The company was founded in 2005 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Kwun Tong"
    },
    "CPIHF": {
        "short_name": "CHAMPION TECHNOLOGY HOLDINGS LT",
        "long_name": "Champion Technology Holdings Limited",
        "summary": "Champion Technology Holdings Limited, an investment holding company, primarily engages in the renewable energy projects, trading and transportation of gasoil, and oil tanker chartering businesses in the People's Republic of China, the United Kingdom, and Germany. The company operates through seven segments: Sales of Cultural Products, Systems Sales including Software Licensing and Services, Leasing of Systems Products, Renewable Energy, Trading for Gasoil and Others, Strategic Investments, and Shipping Business. It sells cultural products, systems, surveillance equipment, gasoil, and leather products and face masks; provides software licensing, and installation and maintenance services; leases system products; designs and sells renewable energy products and solutions; and charters vessels. The company also offers e-shopping and internet-based, as well as e-commerce and m-commerce services; invests in and leases properties; provides advertising and recruitment agency services; and trades in pagers, as well as telecommunication system and products. In addition, it provides documentation, and arrangement and business consultant services; messaging services; and consulting, research and development, and telecommunication services. Further, the company designs, manufactures, and distributes communication systems and equipment; offers money lending services; and provides engineering works. Champion Technology Holdings Limited is based in Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "CVB.F": {
        "short_name": "COMPUTER+TECHN.HLDG.HD-10",
        "long_name": "Computer And Technologies Holdings Limited",
        "summary": "Computer And Technologies Holdings Limited, an investment holding company, provides information technology (IT) solutions for enterprises, multinational corporations, and government organizations in Hong Kong, Mainland China, and internationally. It operates in three segments: Application Services, Solutions and Integration Services, and Investments. The Application Services segment primarily provides enterprise applications software and e-business services for enterprises, including the provision of enterprise application software with implementation and ongoing support services; and government electronic trading services, cloud services, and other related value-added services. The Solutions and Integration Services segment offers IT solutions implementation and application software development; provision of IT and related operation/infrastructure outsourcing services; business process outsourcing services; and IT systems and network infrastructure with related design, implementation, and ongoing support services. The Investments segment engages in various types of investing activities, such property investment for rental income and/or for capital appreciation, and treasury investment in securities. The company also provides system and network integration services; computer support and programming services; products, solutions, and consulting services for cyber intelligence and security; human resources management software products; enterprise information management, retail management, and procurement management software products; and human resources management services, as well as sale of computer networks and system platforms, trading of computer software licenses, provision of training, and implementation and maintenance of software services. Computer And Technologies Holdings Limited was founded in 1991 and is headquartered in Hong Kong, Hong Kong.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "DCHIF": {
        "short_name": "DIGITAL CHINA HLDGS",
        "long_name": "Digital China Holdings Limited",
        "summary": "Digital China Holdings Limited, an investment holding company, provides information technology (IT) services primarily in Mainland China. The company operates through five segments: DCITS, Smart Industry Chain Business, Sm@rt City Business, Investing Business, and Other Business. The DCITS segment provides system development, maintenance, industry cloud, and infrastructure development services for the banking industry; and technical, application software development, and industry cloud construction and operation services for government, enterprises, and agriculture clients. The Smart Industry Chain Business segment offers logistics and e-commerce supply chain services. The Sm@rt City Business segment builds a city-wide big data platform for the city to solve medical, transportation, energy supply, and social security issues. The Investing Business segment provides mergers and acquisitions, equity investment, and specialized capital operations, such as investment incubation. The Other Business engages in the investment and sale of properties; financial licensing; integration of resources of financial institutions, such as banking, insurance, securities, and trusts; and provision of financial services, such as micro-credit loan, leasing, factoring, etc. to internal and external customers. It also engages in data integration and management software sales businesses; development and construction of science and technology park; provision of systems integration and network optimization services; and sale of financial specialized equipment and surveying service software. Digital China Holdings Limited was incorporated in 2000 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "DIN.F": {
        "short_name": "DIGITAL CHINA HLDGS HD-10",
        "long_name": "Digital China Holdings Limited",
        "summary": "Digital China Holdings Limited, an investment holding company, provides information technology (IT) services primarily in Mainland China. The company operates through five segments: DCITS, Smart Industry Chain Business, Sm@rt City Business, Investing Business, and Other Business. The DCITS segment provides system development, maintenance, industry cloud, and infrastructure development services for the banking industry; and technical, application software development, and industry cloud construction and operation services for government, enterprises, and agriculture clients. The Smart Industry Chain Business segment offers logistics and e-commerce supply chain services. The Sm@rt City Business segment builds a city-wide big data platform for the city to solve medical, transportation, energy supply, and social security issues. The Investing Business segment provides mergers and acquisitions, equity investment, and specialized capital operations, such as investment incubation. The Other Business engages in the investment and sale of properties; financial licensing; integration of resources of financial institutions, such as banking, insurance, securities, and trusts; and provision of financial services, such as micro-credit loan, leasing, factoring, etc. to internal and external customers. It also engages in data integration and management software sales businesses; development and construction of science and technology park; provision of systems integration and network optimization services; and sale of financial specialized equipment and surveying service software. Digital China Holdings Limited was incorporated in 2000 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "ECG.AX": {
        "short_name": "ECARGO CDI 1:1",
        "long_name": "eCargo Holdings Limited",
        "summary": "eCargo Holdings Limited, together with its subsidiaries, engages in the development and provision of e-commerce technologies, integrated offline and online supply chain operations, and digital commerce solutions and services in China and Australia. It operates as e-commerce and Offline sales enabler that provide various solutions to brands in the field of high-end fashion, consumer goods, beauty and healthcare, and other products. The company provides marketing, trademarking, and TP Management services, as well as a brand growth program that focuses on providing a minimum risk platform for new brands. It also offers ECG services, such as sales and trading, and online and offline distribution; eCoreOS, a proprietary platform for brands and merchants to manage their online orders in multiple channels; eCWMS, a cloud-based warehouse management system for business or logistics company; and JuJiaXuan, an online B2B distribution platform. In addition, eCargo Holdings Limited trades in fast-moving consumer goods. The company was incorporated in 2014 and is headquartered in Kwai Chung, Hong Kong. eCargo Holdings Limited is a subsidiary of JL Enterprises Holdings Limited.",
        "currency": "AUD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Hong Kong",
        "city": "Kwai Chung"
    },
    "IO5A.F": {
        "short_name": "SINO-I TECHNOL. NEW",
        "long_name": "Sino-i Technology Limited",
        "summary": "Sino-i Technology Limited, an investment holding company, provides enterprise cloud services to small and medium enterprises in Mainland China and Hong Kong. The company also offers software as a service (SaaS) mode e-commerce and information application services, such as website construction, B2C online shopping mall, corporate mailbox, online marketing and promotions, etc.; and Internet services, including domain name registration, virtual server hosting, and self-service station building services. It offers its products through online direct sales and agent channels. The company is based in Tsuen Wan, Hong Kong. Sino-i Technology Limited is a subsidiary of Nan Hai Corporation Limited.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Tsuen Wan"
    },
    "KTHGF": {
        "short_name": "KANTONE HLDGS",
        "long_name": "Kantone Holdings Limited",
        "summary": "Kantone Holdings Limited, an investment holding company, engages in the sale and leasing of systems products and software licensing and customisation businesses in the People's Republic of China and Europe. It also researches, develops, trades in, and sells cultural products; and designs, manufactures, and distributes communication systems and equipment, as well as offers consulting services. The company is based in Hong Kong, Hong Kong. Kantone Holdings Limited is a subsidiary of Champion Technology Holdings Limited.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "UTO.F": {
        "short_name": "AUTOMATED SYS HLDGS HD-10",
        "long_name": "Automated Systems Holdings Limited",
        "summary": "Automated Systems Holdings Limited, an investment holding company, provides information technology (IT) services to corporate customers. It operates in two divisions, IT Products and IT Services. The company sells computer products and solutions. It also offers hardware services, including installation and maintenance; and software services, such as software development, consulting, and professional services. In addition, the company provides systems integration, engineering support for products and solutions, and managed services. Further, it is involved in the property holding, international trading, fund investment, and treasury management activities. Automated Systems Holdings Limited operates in Hong Kong, Mainland China, Macau, Thailand, and Taiwan. The company was founded in 1973 and is headquartered in Sha Tin, Hong Kong. Automated Systems Holdings Limited is a subsidiary of Teamsun Technology (HK) Limited.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Sha Tin"
    },
    "VEII": {
        "short_name": "VALUE EXCHANGE INTL INC",
        "long_name": "Value Exchange International, Inc.",
        "summary": "Value Exchange International, Inc. provides customer-centric technology solutions to the retail industries in the People's Republic of China, Hong Kong, Malaysia, and the Philippines. The company provides systems maintenance and related services, including software patches and software code revisions; installing, testing, and implementing software; training of customer personnel for the use of software; and technical support for software systems. It also offers system installation and implementation services, including project planning, and system analysis and design; and systems development and integration services, as well as software development and IT consulting services. The company also sells hardware and consumables products; and markets, sells, and maintains point of sale (POS) software under the edgePOS brand, as well as sells third party POS software programs. The company was formerly known as Sino Payments, Inc. and changed its name to Value Exchange International, Inc. in December 2017. Value Exchange International, Inc. was incorporated in 2007 and is headquartered in Sha Tin, Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Sha Tin"
    },
    "VI6.SG": {
        "short_name": "SUNEVISION HOLDINGS LTD. Regist",
        "long_name": "SUNeVision Holdings Ltd.",
        "summary": "SUNeVision Holdings Ltd., an investment holding company, engages in the data center business in Hong Kong. The company is involved in the provision of facilities management and value added services. It also engages in the design, installation, operation, laying, and cabling of extra-low voltage and information technology systems, as well as building access, voice, data, power supply systems and network, and other infrastructure networks; and provision of related repair and maintenance services. In addition, the company offers IT and optical fiber network, and related maintenance services; treasury services; and financing, management, and company secretary services. Further, it is involved in property and trademark holding activities. The company is headquartered in Kwun Tong, Hong Kong. SUNeVision Holdings Ltd. is a subsidiary of Sunco Resources Limited.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Kwun Tong"
    }
}