{
  "0150.HK": {
    "city": "Kwai Chung",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Internet Content & Information",
    "long_name": "Hypebeast Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "HYPEBEAST",
    "state": null,
    "summary": "Hypebeast Limited, through its subsidiaries, operates as a digital media and e-commerce company in Hong Kong, the People's Republic of China, Japan, the United States, the United Kingdom, and internationally. It operates through Digital Media and E-commerce segments. The company produces and distributes youth focused digital content, which reports the latest trends on fashion, lifestyle, technology, entertainment, culture, and music to its visitors and followers, as well as offers agency services under Hypemaker brand. It also engages in online retail of third-party branded footwear, apparel, and accessories on its e-commerce platform; provision of advertising spaces; and publication of magazines. The company was founded in 2005 and is headquartered in Kwai Chung, Hong Kong. Hypebeast Limited is a subsidiary of CORE Capital Group Limited.",
    "website": "http://www.hypebeast.com",
    "zipcode": null
  },
  "MOXC": {
    "city": "Hong Kong",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Internet Content & Information",
    "long_name": "Moxian, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "Moxian, Inc.",
    "state": null,
    "summary": "Moxian, Inc. operates a social network platform that integrates social media and business into a single platform in China. The company's products and services focuses on creating interaction between users and merchant clients by allowing merchant clients to study consumer behavior. It serves small and medium sized enterprises. The company was formerly known as Moxian China, Inc. and changed its name to Moxian, Inc. in July 2015. Moxian, Inc. was founded in 2010 and is based in Hong Kong, Hong Kong.",
    "website": "http://www.moxianglobal.com",
    "zipcode": null
  },
  "ZZLL": {
    "city": "North Point",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Internet Content & Information",
    "long_name": "ZZLL Information Technology, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "ZZLL INFORMATION TECHNOLOGY INC",
    "state": null,
    "summary": "ZZLL Information Technology, Inc., through its subsidiaries, provides consumer-to-consumer, business-to-consumer, and business-to-business-sales services via web portals. Its online media syndicates video in a cloud-based, multimedia conduit serving a growing, global community of content creators, news outlets, and leading brands. ZZLL Information Technology, Inc. is based in North Point, Hong Kong.",
    "website": "http://www.zzlliti.com",
    "zipcode": null
  }
}
