{
    "0636.HK": {
        "short_name": "KERRY LOG NET",
        "long_name": "Kerry Logistics Network Limited",
        "summary": "Kerry Logistics Network Limited, an investment holding company, provides logistics services in Hong Kong, Mainland China, Taiwan, the rest of Asia, and internationally. The company operates through Logistics Operations, Hong Kong Warehouse, and International Freight Forwarding segments. It offers integrated logistics services, including storage and value-added, trucking and distribution, returns management, and various ancillary services, as well as leases warehousing space. The company also provides international freight forwarding services to transport cargo using air freight, ocean freight, and cross-border road freight forwarding services primarily in intra-Asia and between Asia and Europe. In addition, it offers express services; transportation and distribution services; supply chain and cold chain solutions; and fast moving consumer goods (FMCG) trading and distribution, food servicing, catering, and forth-party logistics services to gourmet shops, fast food chains, hotels, clubhouses, restaurants, supermarkets and convenience stores, pharmacies, bakeries, institutions, airline caterers, schools, and wholesalers. Further, the company provides documents storage and management services; seaport services; semi-automated raw meat processing and packing services; courier services; and engineering and consultancy services, as well as owns the warehouse and operates as an insurance broker. It serves fashion and lifestyle, electronics and technology, food and beverage, FMCG, industrial and material sciences, automotive, wine and spirit, and pharmaceutical and healthcare industries. Kerry Logistics Network Limited was founded in 1981 and is headquartered in Kwai Chung, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kwai Chung"
    },
    "1292.HK": {
        "short_name": "CMA LOGISTICS",
        "long_name": "Changan Minsheng APLL Logistics Co., Ltd.",
        "summary": "Changan Minsheng APLL Logistics Co., Ltd., together with its subsidiaries, provides supply chain management services for automobiles and automobile raw materials, components, and parts in Mainland China. It is involved in the integrated transportation of domestic and foreign spare parts; transportation of bulk cargo and large equipment; provision of suppliers warehouse management, production-distribution, modular subpackage, commercial vehicle warehouse management and shipment, after-sales parts warehouse and shipment, bonded warehousing, logistics solution designing, logistics advisory and training, and other services; and packaging of knocked down kits. The company also engages in the sale of packaging materials, as well as processing of tires. In addition, it offers sea, air, river, railway, and road transport services for import and export of cargos, as well as conducts door-to-door services. The company was formerly known as CMA Logistics Co., Ltd. and changed its name to Changan Minsheng APLL Logistics Co., Ltd. in December 2006. Changan Minsheng APLL Logistics Co., Ltd. was incorporated in 2001 and is headquartered in Hong Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "1308.HK": {
        "short_name": "SITC",
        "long_name": "SITC International Holdings Company Limited",
        "summary": "SITC International Holdings Company Limited, a shipping logistics company, provides integrated transportation and logistics solutions in Mainland China, Hong Kong, Taiwan, Japan, Southeast Asia, and internationally. It operates in two segments, Container Shipping and Logistics; and Dry Bulk and Others. The Container Shipping and Logistics segment offers container transportation, freight forwarding, shipping agency, depot and warehousing, etc. The Dry Bulk and Others segment provides dry bulk vessel and land leasing, as well as air freight forwarding services. As of December 31, 2020, the company operated a fleet of 90 vessels with a total capacity of 129,652 TEU, including 64 self-owned vessels with a capacity of 94,475 TEU and 26 chartered vessels with a capacity of 35,177 TEU; and 6 dry bulk vessels with a total tonnage of 439,039 tons. It also offers container and vessel holding, and chartering; technology support; container maintenance; customs declaration; and multimodal transportation services. The company was founded in 1991 and is headquartered in Causeway Bay, Hong Kong. SITC International Holdings Company Limited is a subsidiary of Resourceful Link Management Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Causeway Bay"
    },
    "2130.HK": {
        "short_name": "CN LOGISTICS",
        "long_name": "CN Logistics International Holdings Limited",
        "summary": "CN Logistics International Holdings Limited provides logistics solutions worldwide. It operates through three segments: Air Freight, Distribution and Logistics Services, and Ocean Freight. The Air Freight segment offers air freight forwarding services, which include arranging for consignment upon receipt of booking instructions from customers, cargo pick up, obtaining cargo space, preparation of freight documentation, arranging for customs clearance, and cargo handling at origin and destination, as well as other related logistics services comprising supporting transportation for freight forwarding purposes. The Distribution and Logistics Services segment provides a range of logistics services, such as managing vendor inventory, picking and packing finished goods, delivery, quality control and various ancillary value-added services, such as supply chain management and storage services; and distribution and logistics services for wine, as well as branded packaging, polymorph repacking, same day local door-to-door, and temperature-controlled delivery services. The Ocean Freight Forwarding Services segment offers ocean freight forwarding services primarily to its air freight forwarding services and other customers. It serves direct and freight forwarder customers, and high-end fashion retailers and brand owners, as well as wholesalers and retailers of wine. CN Logistics International Holdings Limited was founded in 1991 and is headquartered in Kwai Chung, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kwai Chung"
    },
    "3399.HK": {
        "short_name": "YUEYUN TRANS",
        "long_name": "Guangdong Yueyun Transportation Company Limited",
        "summary": "Guangdong Yueyun Transportation Company Limited, an investment holding company, provides integrated transportation and logistics services in the People's Republic of China. The company offers road passenger transportation and auxiliary services, such as urban passenger transportation, public transportation, cross-border transportation, and passenger and freight station services. It also operates gas stations, charging stations, and retail convenience stores. In addition, the company engages in expressway toll collection business; advertising media business; and suppling construction materials. Further, it is involved in the advertising, real estate leasing, fuel retail, general freight, property management, vehicle inspection and testing, and motor driver training businesses; and sale of vehicle spare parts. Additionally, the company offers logistics, tourism, commercial, hotel, and business services, as well as develops and sells smart cards and electronic payment systems. The company was formerly known as Guangdong Nan Yue Logistics Company Limited and changed its name to Guangdong Yueyun Transportation Company Limited in August 2013. Guangdong Yueyun Transportation Company Limited was founded in 1999 and is based in Hong Kong, Hong Kong. Guangdong Yueyun Transportation Company Limited is a subsidiary of Guangdong Provincial Communication Group Company Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "6123.HK": {
        "short_name": "YTO EXP INTL",
        "long_name": "YTO Express (International) Holdings Limited",
        "summary": "YTO Express (International) Holdings Limited, an investment holding company, provides freight forwarding services in the People's Republic of China, Europe, North America, and other Asian regions. It operates through five segments: Air Freight, Ocean Freight, Logistics, International Express and Parcel, and Others. The company offers freight forwarding services through air, sea, land, and trucking services. It also provides other services, including warehousing, distribution, customs clearance, general sales agency, hand-carry, and ancillary and contract logistics services, as well as package delivery solutions. In addition, the company is involved in the issuing of bills of lading and provision of freight forwarding brokerage services activities. It serves customers in various sectors, including fashion and lifestyle, e-commerce, aviation, food and beverage, special projects, and high-tech. The company was founded in 1995 and is headquartered in Kowloon Bay, Hong Kong. YTO Express (International) Holdings Limited is a subsidiary of YTO Express Group Co., Ltd.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kowloon Bay"
    },
    "7S8.F": {
        "short_name": "SITC INTL HLDG.REGS HD-10",
        "long_name": "SITC International Holdings Company Limited",
        "summary": "SITC International Holdings Company Limited, a shipping logistics company, provides integrated transportation and logistics solutions in Mainland China, Hong Kong, Taiwan, Japan, Southeast Asia, and internationally. It operates in two segments, Container Shipping and Logistics; and Dry Bulk and Others. The Container Shipping and Logistics segment offers container transportation, freight forwarding, shipping agency, depot and warehousing, etc. The Dry Bulk and Others segment provides dry bulk vessel and land leasing, as well as air freight forwarding services. As of December 31, 2020, the company operated a fleet of 90 vessels with a total capacity of 129,652 TEU, including 64 self-owned vessels with a capacity of 94,475 TEU and 26 chartered vessels with a capacity of 35,177 TEU; and 6 dry bulk vessels with a total tonnage of 439,039 tons. It also offers container and vessel holding, and chartering; technology support; container maintenance; customs declaration; and multimodal transportation services. The company was founded in 1991 and is headquartered in Causeway Bay, Hong Kong. SITC International Holdings Company Limited is a subsidiary of Resourceful Link Management Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Causeway Bay"
    },
    "8310.HK": {
        "short_name": "DAFENG PORT",
        "long_name": "Dafeng Port Heshun Technology Company Limited",
        "summary": "Dafeng Port Heshun Technology Company Limited, an investment holding company, engages in trading business in Hong Kong, the People's Republic of China, and internationally. The company operates through Trading Business, and Petrochemical Products Storage Business segments. It engages in trading and import and export businesses of electronic products, petrochemical products, medical treatment and food disinfection products, and various other products. The company also engages in the petrochemical products storage business. The company was formerly known as Gamma Logistics Corporation and changed its name to Dafeng Port Heshun Technology Company Limited in May 2015. Dafeng Port Heshun Technology Company Limited was founded in 1992 and is headquartered in Kowloon Bay, Hong Kong. Dafeng Port Heshun Technology Company Limited is a subsidiary of Dafeng Port Overseas Investment Holdings Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kowloon Bay"
    },
    "DVNHF": {
        "short_name": "FRONTIER SERVICES GROUP LIMITED",
        "long_name": "Frontier Services Group Limited",
        "summary": "Frontier Services Group Limited, an investment holding company, provides aviation, logistics, security, insurance, and infrastructure related services. It operates through Aviation, Logistics and Other Business; Financial Market Information Business; and Direct Investments segments. It also provides online financial market information. Its security services include protective services and specialized training services; logistics services comprise engineering project logistics services and special logistics services, such as transportation of valuables; and infrastructure solutions include project planning, business consulting, investment and financing, engineering design, project implementation, project operation, and support services. The company serves the oil and gas, mining, finance, energy, and infrastructure industries, as well as organizations. It operates in Africa, Europe, Mainland China, and Hong Kong. The company was formerly known as DVN (Holdings) Limited and changed its name to Frontier Services Group Limited in March 2014. Frontier Services Group Limited is headquartered in Admiralty, Hong Kong.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Admiralty"
    },
    "KYL.F": {
        "short_name": "KERRY LOG.NETWORK  HD-,50",
        "long_name": "Kerry Logistics Network Limited",
        "summary": "Kerry Logistics Network Limited, an investment holding company, provides logistics services in Hong Kong, Mainland China, Taiwan, the rest of Asia, and internationally. The company operates through Logistics Operations, Hong Kong Warehouse, and International Freight Forwarding segments. It offers integrated logistics services, including storage and value-added, trucking and distribution, returns management, and various ancillary services, as well as leases warehousing space. The company also provides international freight forwarding services to transport cargo using air freight, ocean freight, and cross-border road freight forwarding services primarily in intra-Asia and between Asia and Europe. In addition, it offers express services; transportation and distribution services; supply chain and cold chain solutions; and fast moving consumer goods (FMCG) trading and distribution, food servicing, catering, and forth-party logistics services to gourmet shops, fast food chains, hotels, clubhouses, restaurants, supermarkets and convenience stores, pharmacies, bakeries, institutions, airline caterers, schools, and wholesalers. Further, the company provides documents storage and management services; seaport services; semi-automated raw meat processing and packing services; courier services; and engineering and consultancy services, as well as owns the warehouse and operates as an insurance broker. It serves fashion and lifestyle, electronics and technology, food and beverage, FMCG, industrial and material sciences, automotive, wine and spirit, and pharmaceutical and healthcare industries. Kerry Logistics Network Limited was founded in 1981 and is headquartered in Kwai Chung, Hong Kong.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Kwai Chung"
    },
    "SITIY": {
        "short_name": "SITC INTERNATIONAL HLDGS CO LTD",
        "long_name": "SITC International Holdings Company Limited",
        "summary": "SITC International Holdings Company Limited, a shipping logistics company, provides integrated transportation and logistics solutions in Mainland China, Hong Kong, Taiwan, Japan, Southeast Asia, and internationally. It operates in two segments, Container Shipping and Logistics; and Dry Bulk and Others. The Container Shipping and Logistics segment offers container transportation, freight forwarding, shipping agency, depot and warehousing, etc. The Dry Bulk and Others segment provides dry bulk vessel and land leasing, as well as air freight forwarding services. As of December 31, 2020, the company operated a fleet of 90 vessels with a total capacity of 129,652 TEU, including 64 self-owned vessels with a capacity of 94,475 TEU and 26 chartered vessels with a capacity of 35,177 TEU; and 6 dry bulk vessels with a total tonnage of 439,039 tons. It also offers container and vessel holding, and chartering; technology support; container maintenance; customs declaration; and multimodal transportation services. The company was founded in 1991 and is headquartered in Causeway Bay, Hong Kong. SITC International Holdings Company Limited is a subsidiary of Resourceful Link Management Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Causeway Bay"
    }
}