{
    "0286.HK": {
        "short_name": "AIDIGONG",
        "long_name": "Aidigong Maternal & Child Health Limited",
        "summary": "Aidigong Maternal & Child Health Limited, an investment holding company, provides postpartum care and healthcare services in the People's Republic of China. It operates through Postpartum Care Services, Health Industry, and Other segments. The company offers maternal and child healthcare services; medical anti-aging services; healthcare industry investment services; and healthcare property development services, as well as trades in natural health food and pharmaceutical products. It also offers precision life healthcare, bio-medical technology, management, and aesthetic and beauty treatment services, as well as investment and finance services. The company was formerly known as Common Splendor International Health Industry Group Limited and changed its name to Aidigong Maternal & Child Health Limited in December 2019. Aidigong Maternal & Child Health Limited was incorporated in 1990 and is based in Kowloon Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kowloon Bay"
    },
    "0722.HK": {
        "short_name": "UMP",
        "long_name": "UMP Healthcare Holdings Limited",
        "summary": "UMP Healthcare Holdings Limited, an investment holding company, provides a range of medical and healthcare services in the People's Republic of China. It operates through two segments, Corporate Healthcare Solution Services and Clinical Healthcare Services. The company offers virtual care; family medicine; specialist consultation services, including internal medicine, surgery, pediatrics, cardiology, dermatology, otorhinolaryngology, orthopedics, ophthalmology, urology, gastroenterology and hepatology, radiology, endocrinology, and diabetes; and dental care services, such as dental implant, cosmetic dentistry, periodontal treatments, and orthodontics, as well as traditional Chinese medicines. It also provides physiotherapy services comprises muscle-strengthening, limb function, eye-hand coordination, and hand function trainings; day surgery and endoscopy; diagnostic imaging and laboratory; health assessment; visa medical examination; vaccination and consultation; vision care and optometry; plastic, head, and neck surgeries; dermatology and aesthetics; chronic disease management; and child health and development services. In addition, the company engages in the provision of day surgery, endoscopy, and healthcare training services. It serves insurance companies and corporations, and self-paid patients. As of June 30, 2020, the company operated a network of approximately 800 self-owned and affiliated service points. UMP Healthcare Holdings Limited was founded in 1990 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "2189.HK": {
        "short_name": "KATO (HK) HLDGS",
        "long_name": "Kato (Hong Kong) Holdings Limited",
        "summary": "Kato (Hong Kong) Holdings Limited operates residential care homes for the elderly in Hong Kong. The company provides a range of residential care services for the elderly, including accommodation, professional nursing and care-taking, nutritional management, medical, physiotherapy and occupational therapy, psychological and social care, individual care, and recreational services; and sells healthcare and medical goods, as well as offers add-on healthcare services to its residents. As of March 31, 2020, it operated eight care and attention homes for the elderly with 1,129 residential care places across four districts in Hong Kong under the Fai To, Kato, Happy Luck Home, Tsuen Wan Centre, and Pine Villa brand names. The company was founded in 1991 and is based in Tuen Mun, Hong Kong. Kato (Hong Kong) Holdings Limited is a subsidiary of Sheung Fung Limited.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tuen Mun"
    },
    "2293.HK": {
        "short_name": "BAMBOOSHEALTH",
        "long_name": "Bamboos Health Care Holdings Limited",
        "summary": "Bamboos Health Care Holdings Limited, an investment holding company, provides healthcare staffing solution services in Hong Kong. It offers 24-hour private nursing services; home care and consultation solutions; nursing and rehabilitation assessment; and physiotherapy and occupational therapy solutions. The company also provides healthcare personnel and healthcare staffing solutions; and marketing and consulting services, as well as operates aesthetic clinic. It serves individuals and institutional clients, including hospitals, social service organizations, and clinics. The company was founded in 2009 and is headquartered in Tsim Sha Tsui, Hong Kong.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "3309.HK": {
        "short_name": "C-MER EYE",
        "long_name": "C-MER Eye Care Holdings Limited",
        "summary": "C-MER Eye Care Holdings Limited, an investment holding company, provides ophthalmic services under the C-MER Dennis Lam brand name in Hong Kong and the People's Republic of China. The company operates eye and surgery centers, and satellite clinics that provide cataract and intraocular lens implant, refractive correction, corneal and external eye disease, glaucoma, vitreo-retinal disease, oculoplastic and orbital disease, and squint and pediatric ophthalmology services. It also sells vision aid and pharmaceutical products. The company was founded in 2012 and is headquartered in Central, Hong Kong. C-MER Eye Care Holdings Limited is a subsidiary of C-MER Group Limited.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "8143.HK": {
        "short_name": "GF HEALTHCARE",
        "long_name": "Good Fellow Healthcare Holdings Limited",
        "summary": "Good Fellow Healthcare Holdings Limited, an investment holding company, provides general hospital services in Mainland China and internationally. Its general hospital services include medical and surgical wards, and medical checkup and examination. As of March 31, 2020, the company operated three general hospitals in Jiaxing, Zhuhai, and Beijing. It also provides medical investment and hospital management services. The company was formerly known as Hua Xia Healthcare Holdings Limited and changed its name to Good Fellow Healthcare Holdings Limited in February 2019. The company was incorporated in 2001 and is headquartered in Central, Hong Kong. Good Fellow Healthcare Holdings Limited is a subsidiary of Solar Star Global Limited.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "SMIF.F": {
        "short_name": "CHINA MED.+HLTH.G.HD-0005",
        "long_name": "China Medical & HealthCare Group Limited",
        "summary": "China Medical & HealthCare Group Limited, an investment holding company, primarily operates hospitals in the Hong Kong and People's Republic of China. It operates through six segments: Healthcare, Eldercare, Property Development, Property Investment, Financial Services, and Securities Trading and Investments. The company is also involved in the property development of independent living units; and project management of health campus with a focus on elderly care and retirement community comprising elderly nursing homes, service apartments, and independent living units, as well as a shopping mall, retail shops, and club hall facilities. In addition, it develops and sells properties and land; leases residential and office properties; and provides money lending, financial and strategic investment, and healthcare services. Further, the company is involved in trading of medical equipment and related supplies. Additionally, it invests and trades in securities. The company is also involved in trading of securities listed in overseas exchange. The company was formerly known as COL Capital Limited and changed its name to China Medical & HealthCare Group Limited in February 2016. The company is headquartered in Wanchai, Hong Kong.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    }
}