{
    "0401.HK": {
        "short_name": "WANJIA GROUP",
        "long_name": "Wanjia Group Holdings Limited",
        "summary": "Wanjia Group Holdings Limited, an investment holding company, engages in pharmaceutical wholesale and distribution business in the People's Republic of China and Hong Kong. It also offers hemodialysis treatment and consultancy services. The company sells its products to hospitals and healthcare institutions; and companies operating pharmaceutical retail chain stores, independent pharmacies, outpatient departments of community hospitals, healthcare service stations, and clinics in Fujian province. Wanjia Group Holdings Limited was founded in 2004 and is headquartered in Kowloon, Hong Kong.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.wanjia-gp.com",
        "market_cap": "Nano Cap"
    },
    "8372.HK": {
        "short_name": "GBG HOLDINGS",
        "long_name": "Grand Brilliance Group Holdings Limited",
        "summary": "Grand Brilliance Group Holdings Limited, an investment holding company, engages in supplying of medical devices in Hong Kong. The company offers medical consumables; medical instruments; and medical equipment, as well as develops healthcare products. In addition, it provides medical device solutions, such as market trend analysis, sourcing of medical devices, after-sale services, technical support and training services, medical devices leasing services, and quality assurance services; and holds trademarks, as well as provides maintenance services. Grand Brilliance Group Holdings Limited sells its products to various private hospitals, public hospitals, private clinics, non-profit organizations, universities, and individual end-users. The company was founded in 1997 and is based in Tsuen Wan, Hong Kong. Grand Brilliance Group Holdings Limited is a subsidiary of B&A Success Limited.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsuen Wan",
        "zipcode": null,
        "website": "http://www.grandbrilliancegroup.com",
        "market_cap": "Nano Cap"
    },
    "TK1.SG": {
        "short_name": "China Health Group Ltd. Registe",
        "long_name": "China Health Group Limited",
        "summary": "China Health Group Limited, an investment holding company, engages in the operation and management of hospitals, and medical equipment and consumables trading businesses in the People's Republic of China. It is also involved in business factoring business, as well as property investment business. The company was formerly known as China HealthCare Holdings Limited and changed its name to China Health Group Limited in September 2015. China Health Group Limited is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.ch-groups.com",
        "market_cap": "Nano Cap"
    }
}