{
    "0255.HK": {
        "short_name": "LUNG KEE",
        "long_name": "Lung Kee (Bermuda) Holdings Limited",
        "summary": "Lung Kee (Bermuda) Holdings Limited, an investment holding company, manufactures and markets mold bases and related products in the People's Republic of China and internationally. The company is headquartered in Sha Tin, Hong Kong. Lung Kee (Bermuda) Holdings Limited is a subsidiary of Pan Island Investments Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Sha Tin"
    },
    "0929.HK": {
        "short_name": "IPE GROUP",
        "long_name": "IPE Group Limited",
        "summary": "IPE Group Limited, an investment holding company, manufactures and sells precision metal components and assembled parts for automotive parts, hydraulic equipment, hard disk drives (HDD), and electronic and other devices. The company provides automotive components, such as fuel injectors and automatic transmission products; and hydraulic precision components, such as valves, spools, and joy stick components. It also offers robots that have applications in automotive, medical, electronic, food, laboratory, industrial, packaging, electronic, and consumer industries; CNC and other equipment; and HDD components, including pivot shafts and housings, and spindle motor shafts and housing components that are used in the assembly of pivot cartridges and spindle motors of HDDs. In addition, the company provides surface and deburring treatment services, as well as manufactures and trades in intelligent equipment. It operates in Thailand, Malaysia, Mainland China, Macau, Hong Kong, North America, Europe, and internationally. The company was founded in 1990 and is headquartered in Kowloon, Hong Kong. IPE Group Limited is a subsidiary of Baoan Technology Company Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kowloon Bay"
    },
    "0976.HK": {
        "short_name": "CHIHO ENV",
        "long_name": "Chiho Environmental Group Limited",
        "summary": "Chiho Environmental Group Limited, an investment holding company, engages in the metal recycling business in Asia, Europe, and North America. It is involved in the recycling of mixed metal into copper, aluminum, and ferrous metals. The company also recycles end-of-life vehicles, wasted oil, and electrical and electronic wastes; and owns and operates foundries to manufacture aluminum ingots. In addition, it wholesales metal scrap without processing; processes and sells metal scrap and lubricating oil; provides industrial and logistics services; and purchases and administers real estate properties. The company was formerly known as Chiho-Tiande Group Limited and changed its name to Chiho Environmental Group Limited in June 2017. Chiho Environmental Group Limited is headquartered in Central, Hong Kong. Chiho Environmental Group Limited is a subsidiary of USUM Investment Group Hong Kong Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "1050.HK": {
        "short_name": "KARRIE INT'L",
        "long_name": "Karrie International Holdings Limited",
        "summary": "Karrie International Holdings Limited, an investment holding company, provides metal and plastic products, and electronic manufacturing services (EMS) worldwide. It operates in three segments: Metal and Plastic Business; EMS Business; and Real Estate Business. The Metal and Plastic Business segment manufactures and sells metal and plastic products, including server casings, molds, plastic and metal parts, and household products. The EMS Business segment manufactures and sells magnetic tape data storage products, point-of-sale systems, office automation products, and other computer peripherals. The Real Estate Business segment engages in urban renewal, real estate project investment, property leasing, and development operations. The company also engages in the sale of visual accessories and metal stamping dies; and property holding, trading, and management operations. Karrie International Holdings Limited was founded in 1980 and is headquartered in Tsuen Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tsuen Wan"
    },
    "3816.HK": {
        "short_name": "KFM KINGDOM",
        "long_name": "KFM Kingdom Holdings Limited",
        "summary": "KFM Kingdom Holdings Limited, an investment holding company, manufactures and sells precision metal stamping and metal lathing products in the People's Republic of China, North America, Europe, Japan, Singapore, and internationally. It also manufactures and sells fine metal products; sells and rents kiosks; manufactures and trades in senor products; trades in medical products; and provides management services. In addition, the company offers integrated services, including design engineering solutions; prototyping, computer numerical control (CNC) laser cutting, CNC tooling design and tooling mold design, and lathing or machining parts; hard tooling and soft tooling services; secondary processing services comprising laser welding or robotic argon welding, riveting, tapping, drilling, polishing, sand blasting, etc.; and post-treatment processing services, such as silk screening printing, heat treatment, plating, coating, etc., as well as product assembly and quality testing services. Additionally, it provides packaging solutions. It serves medical and test equipment, finance equipment, consumer electronics, network/data storage, and office automation industries. The company was founded in 1987 and is headquartered in Tsuen Wan, Hong Kong. KFM Kingdom Holdings Limited is a subsidiary of Massive Force Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tsuen Wan"
    },
    "8133.HK": {
        "short_name": "JETE POWER",
        "long_name": "Jete Power Holdings Limited",
        "summary": "Jete Power Holdings Limited, an investment holding company, designs, develops, manufactures, and sells cast metal products in Germany, Hong Kong, the People's Republic of China, the United States, and internationally. It operates through three segments: Metal Casting, Financial Printing, and Entertainment. The company provides pump, filter, valve, and food machinery components made from stainless steel, carbon steel, bronze, and/or grey iron. It serves suppliers of flow control devices, electromechanical equipment, and industrial machinery and equipment. The company is also involved in the provision of the financial printing, typesetting, and translation services; and organizing concerts and events. Jete Power Holdings Limited was incorporated in 2014 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "GZT.F": {
        "short_name": "EVA PRECISION INDL HD-,10",
        "long_name": "EVA Precision Industrial Holdings Limited",
        "summary": "EVA Precision Industrial Holdings Limited, an investment holding company, engages in the provision of precision manufacturing services in the People's Republic of China, Hong Kong, Vietnam, and Mexico. It operates through two segments, Office Automation Equipment and Automotive Component. The company engages in the design and fabrication of precision metal and plastic moulds; and manufacture of precision metal and plastic components. It is also involved in the lathing of metal components; and assembly of precision metal and plastic components into semi-finished products. In addition, the company trades in moulds and components; and develops properties. It serves the office automation equipment, automobile, high technology, and consumer electronic industries. EVA Precision Industrial Holdings Limited was founded in 1993 and is headquartered in Kowloon, Hong Kong.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Kowloon"
    },
    "HIHO": {
        "short_name": "Highway Holdings Limited",
        "long_name": "Highway Holdings Limited",
        "summary": "Highway Holdings Limited, together with its subsidiaries, manufactures and supplies metal, plastic, electric, and electronic components, subassemblies, and finished products for original equipment manufacturers (OEMs) and contract manufacturers. It operates through two segments, Metal Stamping and Mechanical OEM; and Electric OEM. The company also trades in plastic injection products; and manufactures and assembles automation equipment. Its products are used in the manufacture of products, such as photocopiers, laser printers, print cartridges, electrical connectors, electrical circuits, vacuum cleaners, LED power supplies, stepping motors, pumps for dishwashers, and other washing machine components. In addition, the company assists customers in the design and development of the tooling used in the metal and plastic manufacturing process, as well as provides an array of other manufacturing and engineering services. It serves customers in Hong Kong and China, Europe, North America, and other Asian countries. Highway Holdings Limited was founded in 1990 and is headquartered in Sheung Shui, Hong Kong.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Sheung Shui"
    },
    "KRR.SG": {
        "short_name": "Karrie Interntl Hldgs Ltd. Regi",
        "long_name": "Karrie International Holdings Limited",
        "summary": "Karrie International Holdings Limited, an investment holding company, provides metal and plastic products, and electronic manufacturing services (EMS) worldwide. It operates in three segments: Metal and Plastic Business; EMS Business; and Real Estate Business. The Metal and Plastic Business segment manufactures and sells metal and plastic products, including server casings, molds, plastic and metal parts, and household products. The EMS Business segment manufactures and sells magnetic tape data storage products, point-of-sale systems, office automation products, and other computer peripherals. The Real Estate Business segment engages in urban renewal, real estate project investment, property leasing, and development operations. The company also engages in the sale of visual accessories and metal stamping dies; and property holding, trading, and management operations. Karrie International Holdings Limited was founded in 1980 and is headquartered in Tsuen Wan, Hong Kong.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Tsuen Wan"
    },
    "L09.SI": {
        "short_name": "Lung Kee Bermuda",
        "long_name": "Lung Kee (Bermuda) Holdings Limited",
        "summary": "Lung Kee (Bermuda) Holdings Limited, an investment holding company, manufactures and markets mold bases and related products in the People's Republic of China and internationally. The company is headquartered in Sha Tin, Hong Kong. Lung Kee (Bermuda) Holdings Limited is a subsidiary of Pan Island Investments Limited.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Hong Kong",
        "city": "Sha Tin"
    },
    "MI8.F": {
        "short_name": "KA SHUI INTL LTD  HD-,10",
        "long_name": "Ka Shui International Holdings Limited",
        "summary": "Ka Shui International Holdings Limited, an investment holding company, manufactures and sells zinc, magnesium, and aluminum alloy die casting products and components. The company operates through Zinc Alloy Die Casting, Magnesium Alloy Die Casting, Aluminium Alloy Die Casting, Plastic Injection, and Others segments. It also manufactures plastic injection products and components. In addition, the company engages in the provision of surface finishing treatment services; trading and marketing of LED and plasma lighting products; marketing of zinc, magnesium, and aluminum alloy die casting, and plastic injection products and components; trading of home appliance products; and research, development, and trading of germ repellent plastic related products and aluminum related products. Further, it is involved in the research, manufacture, and sale of plastic injection moldings and components of car-related products; and the provision of motor vehicles repair and maintenance services. The company sells its products to household, communication, computer, consumer electronics, automotive parts, and precision components industries in Hong Kong, the People's Republic of China, Japan, the United States, and internationally. Ka Shui International Holdings Limited was founded in 1980 and is headquartered in Kowloon Bay, Hong Kong.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Kowloon Bay"
    },
    "T4N.SG": {
        "short_name": "Chiho Environmental Group Ltd.R",
        "long_name": "Chiho Environmental Group Limited",
        "summary": "Chiho Environmental Group Limited, an investment holding company, engages in the metal recycling business in Asia, Europe, and North America. It is involved in the recycling of mixed metal into copper, aluminum, and ferrous metals. The company also recycles end-of-life vehicles, wasted oil, and electrical and electronic wastes; and owns and operates foundries to manufacture aluminum ingots. In addition, it wholesales metal scrap without processing; processes and sells metal scrap and lubricating oil; provides industrial and logistics services; and purchases and administers real estate properties. The company was formerly known as Chiho-Tiande Group Limited and changed its name to Chiho Environmental Group Limited in June 2017. Chiho Environmental Group Limited is headquartered in Central, Hong Kong. Chiho Environmental Group Limited is a subsidiary of USUM Investment Group Hong Kong Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    }
}