{
    "1319.HK": {
        "short_name": "OIWAHPAWN",
        "long_name": "Oi Wah Pawnshop Credit Holdings Limited",
        "summary": "Oi Wah Pawnshop Credit Holdings Limited, an investment holding company, engages in the provision of secured financing services to high-net-worth customers in Hong Kong. It offers mortgage and pawn loans, and money lending services, as well as consulting services. The company was founded in 1975 and is headquartered in Wan Chai, Hong Kong. Oi Wah Pawnshop Credit Holdings Limited is a subsidiary of Kwan Lik Holding Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Mortgage Finance",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.pawnshop.com.hk",
        "market_cap": "Micro Cap"
    },
    "F6H.F": {
        "short_name": "FAR EAST HORIZON",
        "long_name": "Far East Horizon Limited",
        "summary": "Far East Horizon Limited, together with its subsidiaries, provides various financial services in Mainland China, Hong Kong, and internationally. It operates in two segments, Financial, Lease and Advisory; and Industrial Operation and Management. The Financial, Lease and Advisory segment offers direct finance leasing, sale-leaseback, factoring, entrusted loans, operating lease, and advisory services. The Industrial Operation and Management segment is involved in the import and export trade, and domestic trade of medical equipment; investment, operation, and management of hospitals; and provision of ship brokerage, medical engineering, healthcare management, preschool education and school operation management, and education consulting and management services, as well as trade agency services primarily within the machinery industry. The company also provides trading and brokerage, engineering, equipment operation, medical, and construction services. It serves healthcare, cultural and tourism, engineering construction, machinery, chemical and medicine, electronic information, public consuming, transportation and logistics, and urban public utility industries. The company was formerly known as Far Eastern Hong Xin Co., Limited and changed its name to Far East Horizon Limited in November 2010. Far East Horizon Limited was incorporated in 2008 and is headquartered in Tsim Sha Tsui, Hong Kong.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Mortgage Finance",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.fehorizon.com",
        "market_cap": "Mid Cap"
    }
}