{
    "0403.HK": {
        "short_name": "STARLITE HOLD",
        "long_name": "Starlite Holdings Limited",
        "summary": "Starlite Holdings Limited, an investment holding company, engages in printing and manufacturing packaging materials, labels, and paper products in the People's Republic of China, Hong Kong, the United States, South East Asia, Europe, and internationally. The company offers molded pulp products for various products, such as drink or food trays, bowls and plates, clamshell containers, egg cartons, shipping materials, and point of purchase packaging products; produces labels; and prints children's and novelty books, and board games comprising pop-up books, board games, puzzles, and book kits. It also provides packaging products for household appliances, toys and games, greeting cards, consumer electronics, food and beverages, luxury, pharmaceuticals, and personal care products; blister, window box, and APET box packaging products; and luxury packaging products. In addition, the company offers electronic products, such as sound modules, light sensors, and electric motors for paper printing; and e-business services through its Website GreenTaNet.com. Further, it provides management services; manufactures and trades in machinery; trades in paper products and packaging materials; and holds trade and service marks. Additionally, the company produces, trades in, and distributes team green products and automated equipment, including 3-fold automatic gluing and folding machine, smart material transit warehouse, automated guided vehicle, and glittering machine under the Team Green and JIGZLE brands. The company was founded in 1970 and is headquartered in San Po Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "San Po Kong"
    },
    "1239.HK": {
        "short_name": "TEAMWAY INTL GP",
        "long_name": "Teamway International Group Holdings Limited",
        "summary": "Teamway International Group Holdings Limited, an investment holding company, designs, manufactures, and sells packaging products and structural components in the People's Republic of China. The company offers expanded polystyrene and expanded polyolefin products for packaging consumer electrical appliances, such as televisions, refrigerators, air conditioners, washing machines, water heaters, information technology products, and others. It is also involved in the property investment and money lending businesses. The company was formerly known as Jin Bao Bao Holdings Limited and changed its name to Teamway International Group Holdings Limited in September 2017. Teamway International Group Holdings Limited was incorporated in 2011 and is headquartered in Tsim Sha Tsui, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "1332.HK": {
        "short_name": "CHINA TOUYUN",
        "long_name": "China Touyun Tech Group Limited",
        "summary": "China Touyun Tech Group Limited, an investment holding company, designs, develops, manufactures, and sells packaging products in Hong Kong, the People's Republic of China, Europe, North and South America, and internationally. It operates through three segments: QR Code Business, Packaging Products, and Treasury Investment. The QR Code Business segment provides QR codes on product packaging and solutions; and online advertising display services. The Packaging Products segment manufactures watch boxes, jewelry boxes, eyewear cases, bags and pouches, and display units. The Treasury Investment segment invests and trades in securities, as well as offers money lending services. The company is also involved in business intelligence IT solutions; and the provision of corporate management services. The company was formerly known as China Opto Holdings Limited and changed its name to China Touyun Tech Group Limited in January 2017. China Opto Holdings Limited was founded in 1989 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "1335.HK": {
        "short_name": "SHEEN TAI",
        "long_name": "Sheen Tai Holdings Group Company Limited",
        "summary": "Sheen Tai Holdings Group Company Limited, an investment holding company, primarily manufactures and sells cigarette-related and non-cigarette-related packaging materials in the People's Republic of China. The company operates through five segments: Manufacturing and Sales of BOPP Films; Sales of Sub-processing Cigarette Films; Properties Development and Related Services; Generation of Photovoltaic Power; and Cloud-related Business. It offers cigarette-related packaging materials comprising anti-counterfeiting films and other cigarette films; and BOPP and BOPP ULT thermal sealing films, and laser base films for packaging non-cigarette-related products. The company is also involved in the trading of imported and sub-processed cigarette films; development and sale of properties; provision of property management services; generation and sale of photovoltaic power; development of cloud computing related software; outsourcing of cloud platforms; and provision of cloud computing solutions and related services. The company was founded in 1997 and is based in Wan Chai, Hong Kong. Sheen Tai Holdings Group Company Limited is a subsidiary of Sheen Tai Group Holding Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "1689.HK": {
        "short_name": "HUAXIHOLDINGS",
        "long_name": "Huaxi Holdings Company Limited",
        "summary": "Huaxi Holdings Company Limited, an investment holding company, manufactures and sells cigarette-related packaging materials in the People's Republic of China. The company offers inner frame, cigarette box frame, and tipping papers, as well as cigarette trade mark labels, cigarette paper boxes, and other products. It is also involved in biological technology research and related products trading activities; and provision of environmental treatment services, and agricultural science and technology related services. The company was founded in 1992 and is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "2300.HK": {
        "short_name": "AMVIG HOLDINGS",
        "long_name": "AMVIG Holdings Limited",
        "summary": "AMVIG Holdings Limited, an investment holding company, engages in printing of cigarette packages for state-owned cigarette manufacturers in the People's Republic of China. It also manufactures transfer papers and laser films. The company was formerly known as Vision Grande Group Holdings Limited and changed its name to AMVIG Holdings Limited in September 2006. AMVIG Holdings Limited was founded in 1998 and is headquartered in Causeway Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Causeway Bay"
    },
    "AMVGF": {
        "short_name": "AMVIG HOLDINGS LIMITED",
        "long_name": "AMVIG Holdings Limited",
        "summary": "AMVIG Holdings Limited, an investment holding company, engages in printing of cigarette packages for state-owned cigarette manufacturers in the People's Republic of China. It also manufactures transfer papers and laser films. The company was formerly known as Vision Grande Group Holdings Limited and changed its name to AMVIG Holdings Limited in September 2006. AMVIG Holdings Limited was founded in 1998 and is headquartered in Causeway Bay, Hong Kong.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Causeway Bay"
    }
}