{
    "1257.HK": {
        "short_name": "CEB GREENTECH",
        "long_name": "China Everbright Greentech Limited",
        "summary": "China Everbright Greentech Limited, an investment holding company, engages in the design, construction, operation, and maintenance of integrated biomass and waste-to-energy projects in China. It is involved in the construction and operation of biomass direct combustion power generation projects, biomass heat supply projects, biomass electricity and heat cogeneration projects, waste-to-energy projects, and integrated biomass and waste-to-energy projects; and hazardous waste landfill projects, hazardous waste incineration projects, and physicochemical and resources recycling projects. The company is also involved in the environmental remediation for restoration of industrial contaminated sites, contaminated farmland, mines and landfills; treatment of industrial gas emission, oil sludge, river/lake sediments, and industrial sludge; and construction and operation of wetland parks, environmental stewardship services, and anti-seepage at landfill sites. In addition, it operates 7 solar energy projects and 2 wind power projects with a generation capacity of 125.9 megawatts for local power grid companies in Jiangsu Province, Anhui Province, Shanxi Province, and Germany. The company was founded in 2006 and is headquartered in Admiralty, Hong Kong. China Everbright Greentech Limited is a subsidiary of China Everbright Green Holdings Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.ebgreentech.com",
        "market_cap": "Small Cap"
    },
    "39J.F": {
        "short_name": "LIQTECH INTL INC. DL-,001",
        "long_name": "Sinotrans Shipping Limited",
        "summary": "Sinotrans Shipping Limited, a shipping company, owns, manages, and operates dry bulk and container fleet worldwide. It operates through Dry Bulk Shipping, Container Shipping, and Others segments. The company is involved in dry bulk vessel time chartering and cargo voyage chartering businesses; container vessel time chartering, container line service, freight forwarding, and other related businesses; and shipping agency, ship management, and liquefied natural gas shipping business. Its dry bulk fleet is used for the transportation of bulk cargoes, such as iron ore, coal, grains, steel, and other break-bulk cargoes. The company also provides agency services for shipping forwarding and air cargo. As of December 31, 2017, it controlled a fleet of 113 vessels, including 36 dry bulk vessels with an aggregate capacity of approximately 3.37 million deadweight tons and 14 container vessels with an aggregate capacity of 16,733 twenty-foot equivalent unit. The company was founded in 2003 and is headquartered in Wan Chai, Hong Kong. Sinotrans Shipping Limited operates as a subsidiary of Sinomarine Limited",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.sinotranship.com",
        "market_cap": "Micro Cap"
    },
    "CK7.F": {
        "short_name": " CHINA EVERBRIGHT GREENT.",
        "long_name": "China Everbright Greentech Limited",
        "summary": "China Everbright Greentech Limited, an investment holding company, engages in the design, construction, operation, and maintenance of integrated biomass and waste-to-energy projects in China. It is involved in the construction and operation of biomass direct combustion power generation projects, biomass heat supply projects, biomass electricity and heat cogeneration projects, waste-to-energy projects, and integrated biomass and waste-to-energy projects; and hazardous waste landfill projects, hazardous waste incineration projects, and physicochemical and resources recycling projects. The company is also involved in the environmental remediation for restoration of industrial contaminated sites, contaminated farmland, mines and landfills; treatment of industrial gas emission, oil sludge, river/lake sediments, and industrial sludge; and construction and operation of wetland parks, environmental stewardship services, and anti-seepage at landfill sites. In addition, it operates 7 solar energy projects and 2 wind power projects with a generation capacity of 125.9 megawatts for local power grid companies in Jiangsu Province, Anhui Province, Shanxi Province, and Germany. The company was founded in 2006 and is headquartered in Admiralty, Hong Kong. China Everbright Greentech Limited is a subsidiary of China Everbright Green Holdings Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.ebgreentech.com",
        "market_cap": "Small Cap"
    },
    "CLWT": {
        "short_name": "Euro Tech Holdings Company Limi",
        "long_name": "Euro Tech Holdings Company Limited",
        "summary": "Euro Tech Holdings Company Limited distributes water treatment equipment, laboratory instruments, analyzers, test kits and related supplies, and power generation equipment to commercial customers, and governmental agencies in Hong Kong and the People's Republic of China. The company operates in two segments, Trading and Manufacturing, and Engineering. It sells analytical instruments, such as chromatographs, mass spectrometers, flow injector analyzers, automated sample preparation workstations, and atomic spectrometers; environmental monitoring instruments comprising air and water quality monitoring instruments; sample pre-treatment equipment; and general purpose laboratory instruments consisting of water quality monitoring and analysis equipment. The company also distributes general testing and measuring equipment comprising multi-channel digital and analogue recorders, signal amplifiers, and calibration equipment for energy conservation, renewable energy equipment, power quality analyzers, and continuous emissions monitoring systems; and air pollution control systems to power plants, railway and aero-space industries, utilities, educational institutions, and telecommunications companies. In addition, it offers process control systems, including sensors, temperature gauges, pressure gauges, power and energy consumption meters, flow meters, valves, temperature and pressure transmitters and control devices, and temperature and pressure calibrators, as well as moisture, power, energy, and harmonic analyzers; systems engineering services; and maintenance, installation assistance, and calibration services. Further, the company distributes programmable logic controllers, telemetry units, and supervisory control and data acquisition systems and software; and designs, operates, and manages various waste-water, water, and power generation projects. It also sell its products through Website. The company was founded in 1971 and is headquartered in Hong Kong, Hong Kong.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.euro-tech.com",
        "market_cap": "Nano Cap"
    },
    "GMEV": {
        "short_name": "GME INNOTAINMENT INC",
        "long_name": "GME Innotainment, Inc.",
        "summary": "GME Innotainment, Inc. engages in artist management and event management businesses in Hong Kong, China, and the Asia-Pacific. The company's activities include movie production, distribution, and licensing; music production; talent acquisition and management; concert and event management; and social media management for artists and celebrities. It offers artist management services to adolescents and young adults, brand owners, and institutional customers; and entertainment services to cinema-goers, movie investors, cinema circuits, and broadcasting channel providers. The company was formerly known as Great China Mania Holdings, Inc. and changed its name to GME Innotainment, Inc. in June 2015. GME Innotainment, Inc. was incorporated in 1983 and is headquartered in Hong Kong, Hong Kong.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.gmeinnotainment.com",
        "market_cap": "Nano Cap"
    },
    "SFBE": {
        "short_name": "SINO BIOENERGY CORP",
        "long_name": "Sino Bioenergy Corp.",
        "summary": "Sino Bioenergy Corp., a technology company, builds, owns, and operates plasma conversion biomass gas system facilities to convert municipal solid waste into green power and other valuable products. The company process municipal household waste, construction waste, kitchen waste, and sludge to produce and sell organic, as well as mixed organic and inorganic fertilizers. It also produces other end products, such as plastic wood products, building materials, and bio-fuel blocks. The company was formerly known as Sino Fibre Communications, Inc. and changed its name to Sino Bioenergy Corp. in December 2010. Sino Bioenergy Corp. was incorporated in 1999 and is based in Wanchai, Hong Kong.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wanchai",
        "zipcode": null,
        "website": "http://www.sfbe2016.com",
        "market_cap": "Nano Cap"
    }
}