{
    "0018.HK": {
        "short_name": "ORIENTAL PRESS",
        "long_name": "Oriental Press Group Limited",
        "summary": "Oriental Press Group Limited, an investment holding company, engages in the publication of newspapers in Hong Kong and Australia. The company operates through two segments, Publication of Newspapers and Money Lending Business. The company's flagship publication includes Oriental Daily News, a daily newspaper; and on.cc, a news portal. Its online publications also comprise Oriental Daily News ePaper, Supplement ePaper, on Racing, on Football, Life, Wacky, and Property18. In addition, the company operates Money 18, which provides real-time financial information; ontv, an online television service portal; on.cc Superstar, an entertainment mobile application; orientaldaily.on.cc and on.cc Baby portals; and Ireport, an online blog service. Further, the company engages in the canteen operation, transportation, Website contents production, building management, treasury, human resources services, printing, advertising agency, property holding and investment, and hotel property investment businesses, as well as acts as a Website service provider. Oriental Press Group Limited was founded in 1969 and is headquartered in Tai Po, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tai Po",
        "zipcode": null,
        "website": "http://opg.on.cc/tc",
        "market_cap": "Small Cap"
    },
    "0343.HK": {
        "short_name": "CULTURECOM HOLD",
        "long_name": "Culturecom Holdings Limited",
        "summary": "Culturecom Holdings Limited, an investment holding company, engages in publishing comic books and digital marketing business in Hong Kong and the People's Republic of China. The company operates through Publishing and Intellectual Properties Licensing, Online and Social Business, Digital Marketing, and Retailing and Wholesales segments. The Publishing and Intellectual Properties Licensing segment publishes comic books, as well as licenses intellectual properties of comic books. This segment owns approximately 200 comic titles across various genres, including martial arts action and contemporary romance. The Online and Social Business segment engages in the operation of digital cinemas; and production of films. The Digital Marketing segment provides digital marketing and communication services; and intellectual property digitalization and agency services. The Retailing and Wholesales segment is involved in the retail of wine. It also engages in securities trading activities; and the provision of multimedia services. Culturecom Holdings Limited is headquartered in Admiralty, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.culturecom.com.hk",
        "market_cap": "Small Cap"
    },
    "1105.HK": {
        "short_name": "SING TAO",
        "long_name": "Sing Tao News Corporation Limited",
        "summary": "Sing Tao News Corporation Limited publishes and distributes newspapers, magazines, and books to readers in Hong Kong, Mainland China, Canada, the United States, Europe, Australia, and New Zealand. The company publishes Chinese and English newspapers; and magazines that primarily focuses on current affairs and entertainment, lifestyle and trends. It also publishes books in various categories, including parenting, travel, health, self-improvement, and lifestyle. In addition, the company offers a multi-media platform for recruitment advertising under the JobMarket, HeadlineJobs.hk, and The StandardJobs titles; education advertising under the EDUplus.com.hk title; and an online recruitment medium for professionals through A-Performers.com. Further, it sells and distributes repackaged information and content created by its various media businesses, as well as third party content providers; and engages in the radio broadcasting, printing, securities trading and investment, and software development activities. Additionally, the company engages in the property holding activities; distribution of print-media publications; and operation of a Website. Sing Tao News Corporation Limited was founded in 1938 and is headquartered in Tseung Kwan O, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tseung Kwan O",
        "zipcode": null,
        "website": "http://www.singtaonewscorp.com",
        "market_cap": "Small Cap"
    },
    "8006.HK": {
        "short_name": "SINO SPLENDID",
        "long_name": "Sino Splendid Holdings Limited",
        "summary": "Sino Splendid Holdings Limited, an investment holding company, engages in publishing and events organizing business in Singapore and Hong Kong. It operates in five segments: Travel Media Business, Financial Magazine Business, Securities Investment, Money Lending, and Virtual Reality. The Travel Media Business segment provides advertising services through the internet and travel magazines; organizes events; and publishes magazines. The Financial Magazine Business segment offers contents and advertising services in a financial magazine distributed in the People's Republic of China. The Securities Investment segment invests in securities. The Money Lending segment provides funds to clients and receives loan interest income in return. The Virtual Reality segment operates virtual reality shop. The company was formerly known as China.com Inc. and changed its name to Sino Splendid Holdings Limited in October 2013. Sino Splendid Holdings Limited was founded in 1974 and is headquartered in Sheung Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sheung Wan",
        "zipcode": null,
        "website": "http://www.sinosplendid.com",
        "market_cap": "Small Cap"
    },
    "CUH2.F": {
        "short_name": "CULTURECOM HLDGS  HD -,01",
        "long_name": "Culturecom Holdings Limited",
        "summary": "Culturecom Holdings Limited, an investment holding company, engages in publishing comic books and digital marketing business in Hong Kong and the People's Republic of China. The company operates through Publishing and Intellectual Properties Licensing, Online and Social Business, Digital Marketing, and Retailing and Wholesales segments. The Publishing and Intellectual Properties Licensing segment publishes comic books, as well as licenses intellectual properties of comic books. This segment owns approximately 200 comic titles across various genres, including martial arts action and contemporary romance. The Online and Social Business segment engages in the operation of digital cinemas; and production of films. The Digital Marketing segment provides digital marketing and communication services; and intellectual property digitalization and agency services. The Retailing and Wholesales segment is involved in the retail of wine. It also engages in securities trading activities; and the provision of multimedia services. Culturecom Holdings Limited is headquartered in Admiralty, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.culturecom.com.hk",
        "market_cap": "Small Cap"
    },
    "OPQ.F": {
        "short_name": "ORIENTAL PRESS GRP",
        "long_name": "Oriental Press Group Limited",
        "summary": "Oriental Press Group Limited, an investment holding company, engages in the publication of newspapers in Hong Kong and Australia. The company operates through two segments, Publication of Newspapers and Money Lending Business. The company's flagship publication includes Oriental Daily News, a daily newspaper; and on.cc, a news portal. Its online publications also comprise Oriental Daily News ePaper, Supplement ePaper, on Racing, on Football, Life, Wacky, and Property18. In addition, the company operates Money 18, which provides real-time financial information; ontv, an online television service portal; on.cc Superstar, an entertainment mobile application; orientaldaily.on.cc and on.cc Baby portals; and Ireport, an online blog service. Further, the company engages in the canteen operation, transportation, Website contents production, building management, treasury, human resources services, printing, advertising agency, property holding and investment, and hotel property investment businesses, as well as acts as a Website service provider. Oriental Press Group Limited was founded in 1969 and is headquartered in Tai Po, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tai Po",
        "zipcode": null,
        "website": "http://opg.on.cc/tc",
        "market_cap": "Small Cap"
    },
    "PPK.F": {
        "short_name": "NEXT DIGITAL LTD.",
        "long_name": "Next Digital Limited",
        "summary": "Next Digital Limited, an investment holding company, operates as a multimedia company. It operates through Digital Business and Print Business segments. The Digital Business segment provides Internet advertising, online subscription, and content services, as well as develops mobile games and apps in Hong Kong, Taiwan, and North America. The Print Business segment sells newspapers, books, and magazines; and provides newspapers, books, and magazines printing and advertising services in Hong Kong, Taiwan, North America, Europe, and Australasia. It is also involved in the mobile, platform development, movie production, and mobile commerce businesses, as well as provides promotion and management services. The company was formerly known as Next Media Limited and changed its name to Next Digital Limited in October 2015. Next Digital Limited was incorporated in 1981 and is based in Tseung Kwan O, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tseung Kwan O",
        "zipcode": null,
        "website": "http://www.nextdigital.com.hk",
        "market_cap": "Small Cap"
    },
    "PVGB.F": {
        "short_name": "SING TAO NEWS CORP. CONS.",
        "long_name": "Sing Tao News Corporation Limited",
        "summary": "Sing Tao News Corporation Limited publishes and distributes newspapers, magazines, and books to readers in Hong Kong, Mainland China, Canada, the United States, Europe, Australia, and New Zealand. The company publishes Chinese and English newspapers; and magazines that primarily focuses on current affairs and entertainment, lifestyle and trends. It also publishes books in various categories, including parenting, travel, health, self-improvement, and lifestyle. In addition, the company offers a multi-media platform for recruitment advertising under the JobMarket, HeadlineJobs.hk, and The StandardJobs titles; education advertising under the EDUplus.com.hk title; and an online recruitment medium for professionals through A-Performers.com. Further, it sells and distributes repackaged information and content created by its various media businesses, as well as third party content providers; and engages in the radio broadcasting, printing, securities trading and investment, and software development activities. Additionally, the company engages in the property holding activities; distribution of print-media publications; and operation of a Website. Sing Tao News Corporation Limited was founded in 1938 and is headquartered in Tseung Kwan O, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tseung Kwan O",
        "zipcode": null,
        "website": "http://www.singtaonewscorp.com",
        "market_cap": "Small Cap"
    },
    "TQC.F": {
        "short_name": "TOM GROUP LTD.  HD-,10",
        "long_name": "TOM Group Limited",
        "summary": "TOM Group Limited, an investment holding company, operates as a technology and media company in Hong Kong, Mainland China, Taiwan, and other Asian countries. The company operates through the five segments: E-Commerce Group, Mobile Internet Group, Social Network Group, Publishing Group, and Advertising Group. The company's E-Commerce Group segment provides services to users using the mobile and Internet-based marketplace; and technical services for e-commerce/retail operations. Its Mobile Internet Group segment offers mobile Internet services, online advertising services, and commercial enterprise solutions. The company's Social Network Group segment provides services of online community and social networking websites, and related online advertising. Its Publishing Group segment is involved in the magazine and book publishing and circulation activities; and sale of advertising and other related products. The company's Advertising Group segment provides outdoor media services; and media sales, event production, and marketing services. This segment is also involved in the advertising sale of outdoor media assets. The company also holds trademarks and domain names; operates a mobile and Internet-based C2C marketplace; provides Internet content, online advertising, telecom value-added, management, and email services; and owns and operates a website, an e-marketplace for agricultural products. In addition, it is involved in the development of software, electronics, and computer network systems; supply of online community and social networking websites; publishing, distribution, and retail of books and magazines; and event management and media buying businesses. The company was formerly known as TOM.COM LIMITED and changed its name to TOM Group Limited in 2004. TOM Group Limited was incorporated in 1999 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.tomgroup.com",
        "market_cap": "Small Cap"
    }
}