{
  "1581.HK": {
    "city": "Tuen Mun",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Rental & Leasing Services",
    "long_name": "Progressive Path Group Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "PROGRESSIVE P",
    "state": null,
    "summary": "Progressive Path Group Holdings Limited, an investment holding company, engages in the construction works, and construction machinery rental and trading businesses. It undertakes various construction projects, including the foundation and site formation, builder's, and general building works. The company is also involved in the trade and rental of construction machineries and vehicles, as well as provision of machine operator and transportation services. It serves the construction work companies operating in public and/or private construction projects primarily in Hong Kong. The company was incorporated in 2016 and is headquartered in Tuen Mun, Hong Kong. Progressive Path Group Holdings Limited operates as a subsidiary of Profit Gold Global Limited.",
    "website": "http://www.ppgh.com.hk",
    "zipcode": null
  },
  "3877.HK": {
    "city": "Central",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Rental & Leasing Services",
    "long_name": "CSSC (Hong Kong) Shipping Company Limited",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "CSSC SHIPPING",
    "state": null,
    "summary": "CSSC (Hong Kong) Shipping Company Limited operates as a shipyard-affiliated leasing company in People Republic of China, Asia, the United States, and Europe. It operates through Leasing Services, Shipbroking Services, and Loan Borrowings segments. The company provides leasing services, such as finance and operating lease. It also offers shipbroking services; and loan services comprising pre-delivery loan, secured loan, and factoring services. As of December 31, 2020, the company had 136 vessels, including 90 vessels were operating and 46 vessels were under construction. The company was incorporated in 2012 and is headquartered in Central, Hong Kong.",
    "website": "http://www.csscshipping.net",
    "zipcode": null
  },
  "3LL.F": {
    "city": "Central",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Rental & Leasing Services",
    "long_name": "CSSC (Hong Kong) Shipping Company Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "CSSC(HK)SHIPPING CO.LTD",
    "state": null,
    "summary": "CSSC (Hong Kong) Shipping Company Limited operates as a shipyard-affiliated leasing company in People Republic of China, Asia, the United States, and Europe. It operates through Leasing Services, Shipbroking Services, and Loan Borrowings segments. The company provides leasing services, such as finance and operating lease. It also offers shipbroking services; and loan services comprising pre-delivery loan, secured loan, and factoring services. As of December 31, 2020, the company had 136 vessels, including 90 vessels were operating and 46 vessels were under construction. The company was incorporated in 2012 and is headquartered in Central, Hong Kong.",
    "website": "http://www.csscshipping.net",
    "zipcode": null
  },
  "6110.HK": {
    "city": "Kwai Chung",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Rental & Leasing Services",
    "long_name": "Topsports International Holdings Limited",
    "market": "hk_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "TOPSPORTS",
    "state": null,
    "summary": "Topsports International Holdings Limited, an investment holding company, operates sportswear retail and service platforms in China. As of February 29, 2020, it operated a retail network, which included 8,395 directly-operated stores. The company also offers information technology services; and trades in sportswear products. Topsports International Holdings Limited was founded in 1999 and is based in Kwai Chung, Hong Kong. Topsports International Holdings Limited is a subsidiary of Belle Sports Limited.",
    "website": "http://www.topsports.com.cn",
    "zipcode": null
  },
  "8425.HK": {
    "city": "Kowloon City",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Rental & Leasing Services",
    "long_name": "Hing Ming Holdings Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "HING MING HLDGS",
    "state": null,
    "summary": "Hing Ming Holdings Limited provides rental services for temporary suspended working platforms and other equipment. It rents tower cranes and generators; and trades in equipment and spare parts, including permanent suspended working platforms, motors, and wire ropes. The company also offers project planning; design and customization; delivery of equipment to construction site; installation and inspection; on-site customer support; and disassembly and delivery of equipment, as well as construction consulting services. It provides services to construction companies, owners of commercial properties, and trading companies in Hong Kong, Thailand, Macau, and internationally. The company was founded in 1997 and is headquartered in Kowloon City, Hong Kong. Hing Ming Holdings Limited is a subsidiary of Hing Gut Limited.",
    "website": "http://www.hing-ming.com",
    "zipcode": null
  }
}
