{
    "8218.HK": {
        "short_name": "ECHO INT HOLD",
        "long_name": "Echo International Holdings Group Limited",
        "summary": "Echo International Holdings Group Limited, an investment holding company, engages in the manufacturing and trading of electronic products and accessories in Hong Kong, other Asian countries, Europe, North America, South America, and internationally. It offers design verification, sourcing and procurement, manufacturing, assembling, testing and inspection, packaging, and after-sales services for its branded customers. The company's products include hair remover, starter, control board, and charger board; and PCB assemblies used in beauty, fishing, security, and other electronic related products. It also offers manufacturing and assembly services for electronic products, such as security alarms, buzzers, fire alarms, massage toners, fishing indicators, and communicators. In addition, the company provides food catering services. The company was formerly known as Gold Treasure Hung Holdings Limited and changed its name to Echo International Holdings Group Limited in January 2012. Echo International Holdings Group Limited was founded in 1989 and is headquartered in Tsuen Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsuen Wan",
        "zipcode": null,
        "website": "http://www.echogroup.com.hk",
        "market_cap": 31420260
    },
    "BNSO": {
        "short_name": "Bonso Electronics International",
        "long_name": "Bonso Electronics International Inc.",
        "summary": "Bonso Electronics International Inc. designs, develops, produces, and sells electronic sensor-based and wireless products. The company operates in four segments: Scales, Pet Electronic Products, Rental and Management, and Others. The Scales segment provides sensor-based scales products that include bathroom, kitchen, office, jewelry, laboratory, postal, and industrial scales for consumer, commercial, and industrial applications. The Pet Electronic Products segment develops and produces pet-related electronic products for use in consumer applications. The Rental and Management segment offers leasing of factories and machineries to third parties. The Others segment sells scrap materials. It serves private label original equipment, original brand, and original design manufacturers primarily in the United States, Germany, and the People's Republic of China.  The Company also sells its pet electronic products through online platforms. The company was formerly known as Golden Virtue Limited and changed its name to Bonso Electronics International Inc. in September 1988. Bonso Electronics International Inc. was founded in 1988 and is based in Tsim Sha Tsui, Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.bonso.com",
        "market_cap": 40464284
    },
    "T43.SI": {
        "short_name": "Yunnan Energy",
        "long_name": "Yunnan Energy International Co. Limited",
        "summary": "Yunnan Energy International Co. Limited, an investment holding company, engages in the distribution of analytical and laboratory instruments, and life science equipment in the People's Republic of China. The company operates through two segments, Distribution Business and Supply Chain Business. It offers scientific instruments, such as chromatographs, spectrophotometers, electronic microscopes, and life science and general laboratory instruments, as well as related repair and maintenance services. The company also engages in the trading and supply chain business on construction materials and medical devices. It serves businesses and institutions that include universities, research institutions, companies in industrial sector, and government agencies. The company was formerly known as Techcomp (Holdings) Limited and changed its name to Yunnan Energy International Co. Limited in December 2018. Yunnan Energy International Co. Limited was founded in 1988 and is headquartered in Wan Chai, Hong Kong. Yunnan Energy International Co. Limited is a subsidiary of Baodi International Investment Company Limited.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.yeigi.com",
        "market_cap": 166558512
    }
}