{
    "1162.HK": {
        "short_name": "LUMINA GROUP",
        "long_name": "Lumina Group Limited",
        "summary": "Lumina Group Limited, an investment holding company, provides fire safety services in Hong Kong. Its services include design, supply, and installation of fire safety systems, such as evacuation and electrical fire alarm systems, water and gas suppression systems, and portable fire equipment for newly built and existing buildings; and repair and maintenance services on fire safety systems. The company serves construction contractors, property owners and tenants, property managers, government-related organizations, and non-governmental organizations. The company was founded in 2005 and is headquartered in Tai Kok Tsui, Hong Kong. Lumina Group Limited is a subsidiary of Foxfire Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tai Kok Tsui",
        "zipcode": null,
        "website": "http://www.lumina.com.hk",
        "market_cap": 107400000
    },
    "1850.HK": {
        "short_name": "WINDMILL GP",
        "long_name": "WINDMILL Group Limited",
        "summary": "WINDMILL Group Limited operates as a fire service installation contractor in Hong Kong. The company engages in the design, supply, and installation of fire safety systems for buildings under construction or re-development. It is also involved in the maintenance and repair of fire safety systems for built premises and projects, such as railway stations, utility facilities, hospitals, airport premises, and data centers. In addition, the company trades in fire service accessories, including branded fire services equipment. Windmill Group Limited was founded in 1985 and is headquartered in Kowloon Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon Bay",
        "zipcode": null,
        "website": "http://www.windmill.hk",
        "market_cap": 324000000
    },
    "2086.HK": {
        "short_name": "HNA TECH INV",
        "long_name": "HNA Technology Investments Holdings Limited",
        "summary": "HNA Technology Investments Holdings Limited, an investment holding company, develops, sells, and distributes smart card products, software, and hardware in the People's Republic of China, the United States, Fiji, Japan, Turkey, the Philippines, and internationally. The company operates through two segments, The Financial Technology and Smart Living Business; and The Financial Services and Investment Business. It also provides smart card related services; and advisory services, including financial due diligence and business operation consultancy services. The company was formerly known as Advanced Card Systems Holdings Limited and changed its name to HNA Technology Investments Holdings Limited in August 2017. The company was founded in 1995 and is headquartered in Kowloon Bay, Hong Kong. HNA Technology Investments Holdings Limited is a subsidiary of HNA EcoTech Pioneer Acquisition.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon Bay",
        "zipcode": null,
        "website": "http://www.hnatechinv.com",
        "market_cap": 182152048
    },
    "2885.HK": {
        "short_name": "PEIPORT HOLD",
        "long_name": "Peiport Holdings Ltd.",
        "summary": "Peiport Holdings Ltd., an investment holding company, provides thermal and self-stabilized imaging products and services in the People's Republic of China and internationally. The company offers thermal imaging products under the PTi and other brand names primarily for use in the general consumption, commercial, and industrial fields, as well as thermal imaging inspection services. It also provides self-stabilized imaging products and services mounted on aircrafts, helicopters, vessels, and ships under the SkyEye, SeaVision, and PGs brand names, as well as rents self-stabilized imaging products for aircrafts. In addition, the company distributes general aviation products, including light and ultra-light aircraft engines and related components; and provides maintenance training courses, as well as maintenance and support services to light and ultra-light aircraft manufacturers, flight schools, flying entertainment clubs, light aircraft research institutions, and private flight owners. Peiport Holdings Ltd. was founded in 1998 and is headquartered in Tai Po, Hong Kong. Peiport Holdings Ltd. is a subsidiary of Peiport Alpha Ltd.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tai Po",
        "zipcode": null,
        "website": "http://www.peiport.com",
        "market_cap": 176000000
    },
    "8051.HK": {
        "short_name": "CIRCUTECH",
        "long_name": "CircuTech International Holdings Limited",
        "summary": "CircuTech International Holdings Limited, an investment holding company, engages in the research and development, manufacture, marketing, and sale of video surveillance systems in Hong Kong, the United States, the Netherlands, Taiwan, and internationally. It is also involved in the distribution of third party IT products; and provision of repair, maintenance, and other support services for electronic products. The company was formerly known as TeleEye Holdings Limited and changed its name to CircuTech International Holdings Limited in August 2016. The company was founded in 1994 and is headquartered in Causeway Bay, Hong Kong. CircuTech International Holdings Limited is a subsidiary of Foxconn (Far East) Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.circutech.com",
        "market_cap": 138260608
    },
    "8315.HK": {
        "short_name": "GREATWALLE INC",
        "long_name": "Greatwalle Inc.",
        "summary": "Greatwalle Inc., an investment holding company, provides manned security guarding services in Hong Kong and the People's Republic of China. The company operates through Security Guarding, Asset Management, Mobile Game, and e-Education segments. The Security Guarding segment offers security guarding services, including patrolling, access control at the lobby entrances, registering visitors and preventing unauthorized access, and handling and reporting complaints. This segment also provides guarding and private escorting services, as well as crowd management services in various venues, exhibitions, ceremonies, and press conferences. The Mobile Game segment engages in the mobile gaming business. The Asset Management segment provides business advisory and asset management services. The e-Education segment provides e-education and e-security services to students. It also provides software development and big-data services. The company was formerly as King Force Group Holdings Limited and changed its name to Greatwalle Inc. in October 2018. Greatwalle Inc. was incorporated in 2014 and is headquartered in Central, Hong Kong. Greatwalle Inc. is a subsidiary of Greatwalle Holding Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.kingforce.com.hk",
        "market_cap": 124632008
    },
    "8535.HK": {
        "short_name": "VISTAR HOLDINGS",
        "long_name": "Vistar Holdings Limited",
        "summary": "Vistar Holdings Limited, an investment holding company, provides electrical and mechanical engineering services in Hong Kong. The company operates in three segments: Installation Work, Alteration and Addition Services, and Maintenance Services. It undertakes installation, alteration, addition, and maintenance works of fire service systems. The company was incorporated in 2017 and is headquartered in Chai Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Chai Wan",
        "zipcode": null,
        "website": "http://www.vistarholdings.com",
        "market_cap": 504000000
    },
    "UVEL.L": {
        "short_name": "UNIVISION ENGINEERING LIMITED O",
        "long_name": "UniVision Engineering Limited",
        "summary": "UniVision Engineering Limited, an investment holding company, designs, supplies, consults, installs, and maintains closed circuit televisions and surveillance systems in the People's Republic of China. The company offers digital video recorder, video quad/split unit, video distribution amplifier, optical link, matrix switcher, control equipment, camera, and twisted pair transmission; combination PTZ and compact fixed dome cameras; analytic unit and camera, and monitoring software; DVR; CCD color, color mini dome, day and night, WDR, and day/night IP cameras; digital solution; and manual and auto iris, and manual zoom, motorized zoom, pinhole, and vari-focal lenses, as well as accessories. It also provides IP network intercom; and security intercom; and sells security related products. The company was incorporated in 1979 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.uvel.com",
        "market_cap": 4028608
    }
}