{
    "2336.HK": {
        "short_name": "HAILIANG INTL",
        "long_name": "Hailiang International Holdings Limited",
        "summary": "Hailiang International Holdings Limited, an investment holding company, sells semiconductors and related products, and metals in Hong Kong, rest of the People's Republic of China, Australia, Singapore, and internationally. The company is also involved in the development and provision of electronic turnkey device solutions, including the manufacture and sale of microcontrollers for home electrical appliances. In addition, it engages in the property development business; and sale of metals, such as copper and nickel. The company was formerly known as Sunlink International Holdings Limited and changed its name to Hailiang International Holdings Limited in February 2015. The company was incorporated in 2003 and is headquartered in Central, Hong Kong. Hailiang International Holdings Limited is a subsidiary of Rich Pro Investments Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "8490.HK": {
        "short_name": "NICHE-TECH",
        "long_name": "Niche-Tech Group Limited",
        "summary": "Niche-Tech Group Limited, an investment holding company develops, manufactures, and sells semiconductor packaging materials in the People's Republic of China and Hong Kong. It offers copper bonding wires, aluminum silicon bonding wires, heavy aluminum bonding wires, silver alloy bonding wires, palladium- coated copper wires, and gold alloy bonding wires; and encapsulant for LED filament and COB LED. The company also provides epoxy encapsulant products, such as glob top epoxy, LED epoxy encapsulant, and die attach adhesives; and soldering materials. It serves manufacturers of LEDs, camera modules, and ICs. The company was founded in 2006 and is headquartered in Tai Po, Hong Kong. Niche-Tech Group Limited is a subsidiary of Niche-Tech Investments Holdings Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tai Po"
    },
    "ASMVF": {
        "short_name": "ASM PACIFIC TECHNOLOGY",
        "long_name": "ASM Pacific Technology Limited",
        "summary": "ASM Pacific Technology Limited, an investment holding company, engages in the design, manufacture, and marketing of machines, tools, and materials used in the semiconductor and electronics assembly industries worldwide. It operates through Semiconductor Solutions and Surface Mount Technology Solutions segments. The company provides deposition process equipment, wafer separation equipment, AOI/FOL equipment, die attach equipment, wire bonding equipment, dispensing equipment, encapsulation solutions equipment, and CIS equipment. It also offers singulation, trim, and form systems; LED testing, sorting, and taping systems; sintering equipment; and test and finish handling systems. In addition, it offers surface mount technologies; advanced packaging solutions; encapsulation solutions; MEM solutions; power solutions; LED/opto solutions; photonics, display, and COB solutions; stacked die solutions; and smart SMT factory solutions. Further, the company provides agency and logistics services. ASM Pacific Technology Limited was founded in 1975 and is based in Tsing Yi, Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Tsing Yi"
    },
    "ASMVY": {
        "short_name": "ASM PAC TECHNOLOGY LTD",
        "long_name": "ASM Pacific Technology Limited",
        "summary": "ASM Pacific Technology Limited, an investment holding company, engages in the design, manufacture, and marketing of machines, tools, and materials used in the semiconductor and electronics assembly industries worldwide. It operates through Semiconductor Solutions and Surface Mount Technology Solutions segments. The company provides deposition process equipment, wafer separation equipment, AOI/FOL equipment, die attach equipment, wire bonding equipment, dispensing equipment, encapsulation solutions equipment, and CIS equipment. It also offers singulation, trim, and form systems; LED testing, sorting, and taping systems; sintering equipment; and test and finish handling systems. In addition, it offers surface mount technologies; advanced packaging solutions; encapsulation solutions; MEM solutions; power solutions; LED/opto solutions; photonics, display, and COB solutions; stacked die solutions; and smart SMT factory solutions. Further, the company provides agency and logistics services. ASM Pacific Technology Limited was founded in 1975 and is based in Tsing Yi, Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Tsing Yi"
    },
    "AY7A.F": {
        "short_name": "ASM PAC.TECHN. NEW HD-,10",
        "long_name": "ASM Pacific Technology Limited",
        "summary": "ASM Pacific Technology Limited, an investment holding company, engages in the design, manufacture, and marketing of machines, tools, and materials used in the semiconductor and electronics assembly industries worldwide. It operates through Semiconductor Solutions and Surface Mount Technology Solutions segments. The company provides deposition process equipment, wafer separation equipment, AOI/FOL equipment, die attach equipment, wire bonding equipment, dispensing equipment, encapsulation solutions equipment, and CIS equipment. It also offers singulation, trim, and form systems; LED testing, sorting, and taping systems; sintering equipment; and test and finish handling systems. In addition, it offers surface mount technologies; advanced packaging solutions; encapsulation solutions; MEM solutions; power solutions; LED/opto solutions; photonics, display, and COB solutions; stacked die solutions; and smart SMT factory solutions. Further, the company provides agency and logistics services. ASM Pacific Technology Limited was founded in 1975 and is based in Tsing Yi, Hong Kong.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Tsing Yi"
    },
    "BXE.SI": {
        "short_name": "CDW",
        "long_name": "CDW Holding Limited",
        "summary": "CDW Holding Limited, an investment holding company, produces and supplies precision components in Mainland China, Hong Kong, Japan, and internationally. The company operates through four segments: LCD Backlight Units, Office Automation, LCD Parts and Accessories, and Others. It offers small to medium sized LCD backlight units and flexible printed circuits that are used for the production of a range of equipment, including mobile communication, consumer information technology, and entertainment equipment; and small to large sized high precision metal and plastic frames and reflectors for a range of equipment, such as notebook monitors, mobile phones, game box entertainment equipment, and GPS navigators. The company also provides customized labels, shock absorbers, insulators, and other precision accessories for various office equipment and electrical appliances, which include photocopiers, printers, TV monitors, projectors, microwave ovens, etc. In addition, it is involved in the general trading; food and beverage management and advisory services; and life sciences businesses. Further, the company offers surface mounting technique services in electronic product assembly; plastic injection for electronic consumer products and automobiles; and label printing services. Additionally, the company engages in the manufacture, sale, and marketing of healthcare and beauty products; and provision of biotech related research and development services. CDW Holding Limited was founded in 1991 and is headquartered in Shatin, Hong Kong.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Hong Kong",
        "city": "Sha Tin"
    }
}