{
    "0596.HK": {
        "short_name": "INSPUR INT'L",
        "long_name": "Inspur International Limited",
        "summary": "Inspur International Limited, an investment holding company, provides software development and other software services, and cloud services in the People's Republic of China. The company operates through Cloud Services, Management Software, and Internet of things (IoT) Solution segments. It is also involved in the sale of information technology peripherals and software; and property investment activities. The company was incorporated in 2003 and is based in Kowloon Bay, Hong Kong. Inspur International Limited is considered a Red Chip company due to its listing on the Hong Kong Stock Exchange. Inspur International Limited is a subsidiary of Inspur Group Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kowloon Bay"
    },
    "1933.HK": {
        "short_name": "ONEFORCE HLDGS",
        "long_name": "OneForce Holdings Limited",
        "summary": "OneForce Holdings Limited, together with its subsidiaries, operates as an information and communication technology service provider in the People's Republic of China. It operates through three segments: Software and Solutions, Technical Services, and Hardware. The Software and Solutions segment engages in the design, implementation, enhancement, and upgradation of software systems for power grid and distribution companies. The Technical Services segment provides maintenance services on the software systems sold. The Hardware segment sells software systems, related hardware, and spare parts. The company is also involved in the investment, construction, and operation of smart city infrastructure. It serves energy companies, and government and corporate customers. OneForce Holdings Limited was founded in 2011 and is based in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "8018.HK": {
        "short_name": "FINSOFT FIN",
        "long_name": "Finsoft Financial Investment Holdings Limited",
        "summary": "Finsoft Financial Investment Holdings Limited, an investment holding company, primarily develops and sells financial trading software solutions. The company operates through Financial Trading Software Solutions, Other IT and Internet Financial Platforms Services, Money Lending, Assets Investments, and Others segments. The Financial Trading Software Solutions segment provides trading and settlement systems of financial products for financial institutions. The Other IT and Internet Financial Platforms Services offers e-commerce platforms, other online consultancy services, IT services, and other financial information. The Money Lending segment provides loan financing products. The Assets Investments segment trades in listed securities and invests in properties for rental income. The Others segment offers referral services to source, identify, and refer deal opportunities to interested parties; and corporate finance advisory services. This segment also trades in gaming products, as well as offers related marketing services. In addition, the company provides administrative support services; invests in securities and equity; and develops mobile e-commerce platform. It primarily serves financial institutions that conduct brokerage business of financial products traded in Hong Kong. The company was formerly known as Finsoft Corporation and changed its name to Finsoft Financial Investment Holdings Limited in June 2015. Finsoft Financial Investment Holdings Limited was incorporated in 2012 and is headquartered in North Point, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "North Point"
    },
    "8036.HK": {
        "short_name": "EBROKER GROUP",
        "long_name": "eBroker Group Limited",
        "summary": "eBroker Group Limited, an investment holding company, provides financial software solution services to financial institutions in Hong Kong. The company's trading solution includes eBrokerSys, sponsored DMA, institutional sales desk solutions, and global futures and options trading platform; Algo solutions comprises Algo trader, volatility trading system, and market making system; investment solutions, such as alpha investment system, fund administration system, and wealth management system; and enterprise solutions consists of global back office system, portfolio risk reporting system, and data centers hosting and exchange colocation services. It also sells computer products. The company was founded in 2000 and is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "8083.HK": {
        "short_name": "CHINA YOUZAN",
        "long_name": "China Youzan Limited",
        "summary": "China Youzan Limited, an investment holding company, provides online and offline e-commerce solutions in the People's Republic of China. It operates through four segments: General Trading, Third Party Payment Services, Onecomm, and Merchant Services. The General Trading segment trades in watches and other goods. The Third Party Payment Services segment offers third party payment and related consultancy services. The Onecomm segment provides third party payment management services; and sells integrated smart point of sales devices. The Merchant Services segment offers an e-commerce platform with a variety of Software as a Service products and comprehensive services. China Youzan Limited also provides information system maintenance and development services; wholesale and retail Internet information services; and restaurant management and retail solutions. The company was formerly known as China Innovationpay Group Limited and changed its name to China Youzan Limited in May 2018. China Youzan Limited was incorporated in 1999 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "8156.HK": {
        "short_name": "SINOPHARM TECH",
        "long_name": "Sinopharm Tech Holdings Limited",
        "summary": "Sinopharm Tech Holdings Limited, an investment holding company, engages in lottery business in the People's Republic of China and Hong Kong. It operates through Provision of Lottery-Related Services, Provision of Internet Plus Services, Manufacturing and Distribution of Personal Protective Equipment, and Other Services segments. The company offers lottery-related hardware and software systems. It also provides Internet plus solution services to government affair, public security, health care, leasing, and lottery industries; and corporate management services. The company was formerly known as China Vanguard You Champion Holdings Limited and changed its name to Sinopharm Tech Holdings Limited in June 2019. Sinopharm Tech Holdings Limited was founded in 1999 and is headquartered in Sha Tin, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Sha Tin"
    },
    "8205.HK": {
        "short_name": "JIAODA WITHUB",
        "long_name": "Shanghai Jiaoda Withub Information Industrial Company Limited",
        "summary": "Shanghai Jiaoda Withub Information Industrial Company Limited develops and provides business application solutions primarily in the People's Republic of China. The company operates through two segments, Business Application Project and Application Software; and Sales of Products. It develops and provides business application solutions, which include business solutions and application software, as well as installation and maintenance of Internet and data security products. The company also sells computer hardware and software products, electronic products, and accessories. Shanghai Jiaoda Withub Information Industrial Company Limited was founded in 1998 and is based in Wanchai, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "8279.HK": {
        "short_name": "AGTECH HOLDINGS",
        "long_name": "AGTech Holdings Limited",
        "summary": "AGTech Holdings Limited, an integrated technology and services company, engages in the lottery, and mobile games and entertainment content businesses in the People's Republic of China and internationally. It offers lottery hardware, including traditional lottery terminals, paper scratch card sales hardware, multiple draws, sport betting, video lottery terminal, keno product, and instant scratch cards; and Lucky Racing and e-Ball Lottery games. The company also supplies lottery games, related software, and underlying supporting systems; distribution of online non-lottery games and entertainment content; and distributes lottery games and products. In addition, it provides maintenance, after-sales, training, and consultancy services for software games and systems; and ancillary and management services. Further, the company offers sports lottery management and marketing consultancy services; phone and mobile betting solutions for lottery organizations; and handheld lottery sales equipment and related after-sales maintenance services. Additionally, it is involved in the research and development of sports lottery information technology. The company was formerly known as MegaInfo Holdings Limited and changed its name to AGTech Holdings Limited in February 2007. The company is headquartered in Causeway Bay, Hong Kong. AGTech Holdings Limited is a subsidiary of Ali Fortune Investment Holding Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Causeway Bay"
    },
    "8290.HK": {
        "short_name": "AHSAY BACKUP",
        "long_name": "Ahsay Backup Software Development Company Limited",
        "summary": "Ahsay Backup Software Development Company Limited, an investment holding company, provides online backup software products and services in the United States, the United Kingdom, and internationally. The company operates through Online Backup Software and Related Services, and Information Sharing Services segments. It sells and leases software license; and sells hardware devices, as well as provides software upgrade and maintenance, and other services under the Ahsay brand name. The company also offers information sharing services through KINTIPS, a trading platform designed to provide information to horse racing and football tipsters, and subscribers through its website or mobile application. It provides its solutions to information technology consultants, web hosting companies, telecommunications companies, and MSPs. The company was formerly known as Ahsay Cloud Backup Software Development Company Ltd. Ahsay Backup Software Development Company Limited was founded in 1999 and is headquartered in Lai Chi Kok, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Lai Chi Kok"
    },
    "8635.HK": {
        "short_name": "NOVACON TECH",
        "long_name": "Novacon Technology Group Limited",
        "summary": "Novacon Technology Group Limited, an investment holding company, engages in the development and provision of financial trading solutions. Its financial trading solution includes AUTON, a trading terminal; GES TX, a trading system for trading OTC-traded financial instruments; GES EX and Xentrix trading and settlement systems for stock exchange-traded financial instruments; and GES IX, a fund management system. The company also provides licensing and maintenance services; initial set up and customization services; and system protection and hosting services, as well as sells computer hardware and software. In addition, it is involved in the development and supply of resource allocation, planning, scheduling, and management of software and services; and property investment activities. It serves financial institutions, including brokerage firms and wealth management companies in Hong Kong, Indonesia, Malaysia, Belize, Japan, Cyprus, Australia, and internationally. Novacon Technology Group Limited was founded in 2006 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kwun Tong"
    },
    "AGMH": {
        "short_name": "AGM Group Holdings Inc.",
        "long_name": "AGM Group Holdings Inc.",
        "summary": "AGM Group Holdings Inc. operates as a software company in the People's Republic of China. The company develops and sells enterprise application software, including accounting software and enterprise resource planning software; and social trading software and multi-accounting trading management system to small and mid-size broker and institutional clients. It also develops subscription based and interactive trading education website; and provides technical support plans and software customization services. The company was founded in 2015 and is based in Wan Chai, Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "AGTEF": {
        "short_name": "AGTECH HOLDINGS LIMITED",
        "long_name": "AGTech Holdings Limited",
        "summary": "AGTech Holdings Limited, an integrated technology and services company, engages in the lottery, and mobile games and entertainment content businesses in the People's Republic of China and internationally. It offers lottery hardware, including traditional lottery terminals, paper scratch card sales hardware, multiple draws, sport betting, video lottery terminal, keno product, and instant scratch cards; and Lucky Racing and e-Ball Lottery games. The company also supplies lottery games, related software, and underlying supporting systems; distribution of online non-lottery games and entertainment content; and distributes lottery games and products. In addition, it provides maintenance, after-sales, training, and consultancy services for software games and systems; and ancillary and management services. Further, the company offers sports lottery management and marketing consultancy services; phone and mobile betting solutions for lottery organizations; and handheld lottery sales equipment and related after-sales maintenance services. Additionally, it is involved in the research and development of sports lottery information technology. The company was formerly known as MegaInfo Holdings Limited and changed its name to AGTech Holdings Limited in February 2007. The company is headquartered in Causeway Bay, Hong Kong. AGTech Holdings Limited is a subsidiary of Ali Fortune Investment Holding Limited.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Causeway Bay"
    },
    "ALIF": {
        "short_name": "ARTIFICIAL LIFE INC",
        "long_name": "Artificial Life, Inc.",
        "summary": "Artificial Life, Inc. operates as a technology investment company. It operates content development studio, which implements custom solutions for smartphones and tablet devices. The company focuses on mobile and cross-platform applications and games. It is also involved in patent and technology licensing activities that specializes in intellectual property in the field of augmented reality technology and applications. The company was founded in 1994 and is based in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "FHGDF": {
        "short_name": "FOUNDER HLDGS LTD",
        "long_name": "Founder Holdings Limited",
        "summary": "Founder Holdings Limited, an investment holding company, engages in the software development, system integration, and information products distribution activities in Mainland China, Hong Kong, and internationally. The company is also involved in the properties holding business. Founder Holdings Limited is headquartered in Tsuen Wan, Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Tsuen Wan"
    },
    "L1CC.F": {
        "short_name": "INSPUR INTL NEW  HD-,01",
        "long_name": "Inspur International Limited",
        "summary": "Inspur International Limited, an investment holding company, provides software development and other software services, and cloud services in the People's Republic of China. The company operates through Cloud Services, Management Software, and Internet of things (IoT) Solution segments. It is also involved in the sale of information technology peripherals and software; and property investment activities. The company was incorporated in 2003 and is based in Kowloon Bay, Hong Kong. Inspur International Limited is considered a Red Chip company due to its listing on the Hong Kong Stock Exchange. Inspur International Limited is a subsidiary of Inspur Group Limited.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Kowloon Bay"
    },
    "LCHD": {
        "short_name": "LEADER CAPITAL HOLDINGS CORP",
        "long_name": "Leader Capital Holdings Corp.",
        "summary": "Leader Capital Holdings Corp., through its subsidiaries, provides investment platform services through a mobile application. It is also involved in the development of ecological-systems applications; integration of big data; and promotion of OTT applications. The company was founded in 2017 and is based in Hung Hom, Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Hung Hom"
    },
    "LTDH": {
        "short_name": "LIVING 3D HOLDINGS INC",
        "long_name": "Living 3D Holdings, Inc.",
        "summary": "Living 3D Holdings, Inc., through its subsidiaries, focuses on developing and selling no-frills software solution that facilitates the adoption of technological ideas for companies primarily in Hong Kong and Singapore. Its flagship product is a B2B cryptocurrency Web based trading system featuring newsfeed, live quote, integrated CRM, agent management, and accounting system. The company operates a cryptocurrency exchange platform and offers a range of tools that enhances users' experience and investment options. It also focuses on the research and development of e-commerce platform, mobile game, and virtual reality application. Living 3D Holdings, Inc. is based in Mongkok, Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Mongkok"
    },
    "TEHG": {
        "short_name": "TECHNOVATIVE GROUP INC",
        "long_name": "Technovative Group, Inc.",
        "summary": "Technovative Group, Inc., through its subsidiaries, provides financial technology, blockchain solutions, and big data analytics technologies to financial service institutions in the Greater China Region and Southeast Asia Region. The company develops a suite of smart tools, which include chabot, smart contracts, data analytics, blockchain, and trading platform. Its products include Hedu SmartSuite, a series of software as a service based on modules, such as artificial intelligence, big data, cloud computing, and distributed ledger transaction. The company was incorporated in 2010 and is headquartered in Tsim Sha Tsui, Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "TTNUF": {
        "short_name": "TITANIUM GROUP LIMITED",
        "long_name": "Titanium Group Limited",
        "summary": "Titanium Group Limited, through its subsidiaries, manufactures and sells electronic cables in the People's Republic of China. Its products include various types of computer cables, such as high definition multimedia interface cables that connect to digital audio/video sources; and digital visual interface cable, a video interface standard covering the transmission of video between a source device and a display device. The company also offers video graphics array cables; and universal serial bus cables to establish communication between devices and a host controller, as well as electric power cables for transmission of electrical power. Titanium Group Limited is based in Wanchai, Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Wanchai"
    },
    "UBIA": {
        "short_name": "UBI BLOCKCHAIN INTERNET LTD",
        "long_name": "UBI Blockchain Internet, Ltd.",
        "summary": "UBI Blockchain Internet, Ltd. focuses on the research and application of blockchain technology with a focus on the Internet of things covering areas of food, drugs, and healthcare. It also operates an online store in China selling a range of products, including maternal and infant, cosmetics, wine, household goods, and digital and luxury products. The company was formerly known as JA Energy and changed its name to UBI Blockchain Internet, Ltd. in November 2016. UBI Blockchain Internet, Ltd. was founded in 2010 and is based in Hong Kong, Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "UGHL": {
        "short_name": "UNION BRIDGE HOLDINGS LIMITED",
        "long_name": "Union Bridge Holdings Limited",
        "summary": "Union Bridge Holdings Limited operates as a technology company. It develops and operates CircleYY, a mobile-based social networking and e-commerce app and website platform that enables users to share family stories; build interactions between 50+ users and their family members; and discover and buy fashion, beauty, and other daily accessories products. The company was formerly known as Costo Inc. and changed its name to Union Bridge Holdings Limited in June 2016. Union Bridge Holdings Limited was founded in 2014 and is based in Wan Chai, Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "VEII": {
        "short_name": "VALUE EXCHANGE INTL INC",
        "long_name": "Value Exchange International, Inc.",
        "summary": "Value Exchange International, Inc. provides customer-centric technology solutions to the retail industries in the People's Republic of China, Hong Kong, Malaysia, and the Philippines. The company provides systems maintenance and related services, including software patches and software code revisions; installing, testing, and implementing software; training of customer personnel for the use of software; and technical support for software systems. It also offers systems development and integration services, as well as software development and IT consulting services. The company also sells hardware and consumables products; and markets, sells, and maintains point of sale (POS) software under the edgePOS brand, as well as sells third party POS software programs. The company was formerly known as Sino Payments, Inc. and changed its name to Value Exchange International, Inc. in December 2017. Value Exchange International, Inc. was incorporated in 2007 and is headquartered in Shatin, Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Sha Tin"
    },
    "XHFNF": {
        "short_name": "BEAT HOLDINGS LTD",
        "long_name": "Beat Holdings Limited",
        "summary": "Beat Holdings Limited engages in the development of applications based on blockchain technology. The company develops and distributes software products and services for mobile operators and enterprises; develops and customizes mobile applications for telecom and enterprise customers; and provides mobile messaging services. It is also involved in the administration of information website of crypto-assets; licensing of intellectual properties; and development of a blockchain ecosystem that helps store and manage mental and physical health data. The company was formerly known as Xinhua Holdings Limited and changed its name to Beat Holdings Limited in December 2017. Beat Holdings Limited was founded in 1999 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    }
}