{
    "1410.HK": {
        "short_name": "EDVANCE INTL",
        "long_name": "Edvance International Holdings Limited",
        "summary": "Edvance International Holdings Limited, an investment holding company, distributes information technology (IT) security products and services in the People's Republic of China and Singapore. The company's IT Security Products segment distributes network, system, and application and data security products, such as hardware, software, and auxiliary products. Its IT Security Services segment offers technical implementation, maintenance and support, and consulting services. The company primarily serves IT companies. Edvance International Holdings Limited was incorporated in 2016 and is headquartered in Kwun Tong, Hong Kong. Edvance International Holdings Limited is a subsidiary of Success Vision International Group Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.edvanceintl.com",
        "market_cap": "Small Cap"
    },
    "8017.HK": {
        "short_name": "TRADEGO",
        "long_name": "TradeGo FinTech Limited",
        "summary": "TradeGo FinTech Limited, an investment holding company, provides integrated securities trading platform services to brokerage firms and their clients in Hong Kong and the People's Republic of China. The company engages in the development of TradeGo Pro, a securities trading platform software. It offers front office trading system services to support trading of a range of financial instruments, including equities, ETFs, futures, options, warrants, and derivatives; value-added services; and other services, such as simulation trading platform, online account opening appointment, two-factor authentication, customized software development, cloud infrastructure and hosting, and online advertising services. In addition, the company holds market data vendor licenses from five stock and future exchanges, as well as provides a range of real-time market data feeds from these exchanges. Further, it develops computer hardware and software technology. The company was founded in 2011 and is headquartered in Hong Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.tradego8.com",
        "market_cap": "Small Cap"
    },
    "8062.HK": {
        "short_name": "EFT SOLUTIONS",
        "long_name": "EFT Solutions Holdings Limited",
        "summary": "EFT Solutions Holdings Limited, an investment holding company, provides electronic fund transfer at point-of-sale (EFT-POS) solutions in Hong Kong, Australia, and internationally. It operates through Sale of Hardware Devices, and System Support and Software Solution Services segments. The company engages in sourcing EFT-POS terminals and peripheral devices, as well as providing EFT-POS system support services to various EFT-POS terminal manufacturers, acquirers, and merchants. It also provides value-added EFT-POS system support services, including installation, electronic payment standards acceptance certification solutions, maintenance, collection, repair, and other related services of EFTPOS terminals. In addition, the company provides embedded system solution services. The company was founded in 2004 and is headquartered in Kwai Chung, Hong Kong. EFT Solutions Holdings Limited is a subsidiary of LCK Group Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.eftsolutions.com",
        "market_cap": "Small Cap"
    },
    "G9D.F": {
        "short_name": "GOLDPAC GROUP LTD",
        "long_name": "Goldpac Group Limited",
        "summary": "Goldpac Group Limited, an investment holding company, provides embedded software and secure payment products for smart secure payment in Hong Kong an internationally. It operates through Embedded Software and Secure Payment Products, and Platform and Service segments. The company also provides data processing, digital equipment, system platform, artificial intelligence self-service kiosks, and other solutions for customers in a range of sectors, including financial, government, healthcare, transportation, and retail. In addition, it is involved in the property holding activities; and provision of logistical auxiliary services. Goldpac Group Limited was founded in 1995 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.goldpac.com",
        "market_cap": "Small Cap"
    },
    "SEII": {
        "short_name": "SHARING ECONOMY INTERNATIONAL I",
        "long_name": "Sharing Economy International Inc.",
        "summary": "Sharing Economy International Inc. focuses on technology and global sharing economy markets by developing online platforms and rental business partnerships. Its platforms includes BuddiGo, a peer-to-peer resource sharing platform that allows users to outsource daily chores and mundane tasks; and AnyWorkspace, an online real-time marketplace that connects workspace providers with clients who need temporary office and meeting spaces. The company also operates rental stations that offer power bank for mobile charging on-demand and other items; provides advertising services; and develops virtual tours for the real estate, hospitality, and interior design industries. In addition, it engages in real estate and property management businesses; provision of management services; online media and advertising business; and production of films. Further, the company develops and operates a sharing economy mobile platform for courier services; develops an interactive virtual tour of a physical space using a mobile phone camera; operates online platforms; and offers licensing services. Sharing Economy International Inc. was founded in 1987 and is based in Causeway Bay, Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.seii.com",
        "market_cap": "Small Cap"
    }
}