{
    "0493.HK": {
        "short_name": "GOME RETAIL",
        "long_name": "GOME Retail Holdings Limited",
        "summary": "GOME Retail Holdings Limited, together with its subsidiaries, engages in the retail of home appliances and consumer electronic products in the People's Republic of China. The company is also involved in the provision of logistics and procurement, storage and delivery, IT development, and business management services; retailing of mobile phones and accessories; and online retail of electrical appliances and consumer electronic products, as well as in property holding activities. In addition, it engages in the trading of wine products. As of December 31, 2020, it operated 3,421 stores in 1,298 cities. The company was formerly known as GOME Electrical Appliances Holding Limited and changed its name to GOME Retail Holdings Limited in 2017. GOME Retail Holdings Limited was founded in 1987 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": "100016",
        "website": "http://www.gome.com.hk",
        "market_cap": 30029076480
    },
    "0653.HK": {
        "short_name": "BONJOUR HOLD",
        "long_name": "Bonjour Holdings Limited",
        "summary": "Bonjour Holdings Limited, an investment holding company, engages in the retail and wholesale of beauty and health-care products in Hong Kong, Macau, and the Mainland China. The company offers skin, health food, and hair and body care products; and cosmetics and fragrance products, as well as lifestyle products and snacks from Japan, Korea, and Taiwan to cater to customers' various needs. As of December 31, 2020, it operated 24 retail stores in Hong Kong and Macau. The company also sells its products online. In addition, it is involved in the property holding activities. The company was founded in 1991 and is headquartered in Tsuen Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsuen Wan",
        "zipcode": null,
        "website": "http://corp.bonjourhk.com",
        "market_cap": 887268224
    },
    "0915.HK": {
        "short_name": "DAOHE GLOBAL",
        "long_name": "Daohe Global Group Limited",
        "summary": "Daohe Global Group Limited, an investment holding company, sells merchandise, and provides procurement and value-added services in Southern Hemisphere, North America, the People's Republic of China, Europe, and internationally. The company also provides laboratory, management, marketing consultancy and product development, software and information technology, and market trend consultancy services; acts as a procurement agent; and develops and operates online social platforms. In addition, it engages in the film production and distribution, and television and related activities. The company was formerly known as Linmark Group Limited and changed its name to Daohe Global Group Limited in June 2015. Daohe Global Group Limited was founded in 1964 and is headquartered in Kowloon Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon Bay",
        "zipcode": null,
        "website": "http://www.daoheglobal.com.hk/index.php/en/",
        "market_cap": 117748024
    },
    "1711.HK": {
        "short_name": "ULFERTS",
        "long_name": "Ulferts International Limited",
        "summary": "Ulferts International Limited, an investment holding company, engages in the wholesale and retail of furniture in Hong Kong. It also offers mattresses, pillows, sofas, sofa beds, beds, cabinets, dining tables, chairs, wardrobes, coffee tables, and sideboards, as well as other ancillary items under the Ulfenbo brand name through its Dormire stores; a network of dealers; and department store counters, pop-up stores, and roadshows. In addition, the company provides compact furniture through its at home stores; and services, including planning, design, procuring, and installation of custom-made furniture for corporate customers, as well as consultation and liaison services with furniture manufacturers. As of March 31, 2020, it operated 21 points-of-sale, including 18 retail stores under the Ulferts, Ulferts Signature, at home, and Dormire names; 2 department store counters and 1 pop-up store under the Ulfenbo name; and online shopping platforms. The company was founded in 1975 and is based in Wanchai, Hong Kong. Ulferts International Limited operates as a subsidiary of Ulferts International Group Holdings Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.ulfertsintl.com",
        "market_cap": 211999984
    },
    "8163.HK": {
        "short_name": "MERDEKA FIN",
        "long_name": "Merdeka Financial Group Limited",
        "summary": "Merdeka Financial Group Limited, an investment holding company, engages in the financial services, corporate consulting, trading, and information technology businesses in Hong Kong and the People Republic of China. The company's Financial Services Business segment provides securities brokerage, corporate finance advisory, asset management, money lending, and financial leasing services. Its Corporate Consulting Business segment offers company secretarial, accounting, and financial reporting services; and management consulting services. The company's Trading Business segment trades in goods, components, and accessories; and retails milk powder, dairy products, beauty and cosmetic products, and pharmaceutical OTC products. Its Information Technology Business segment engages in the distribution of information technology products, and provision of relevant technical support services. The company was formerly known as Merdeka Financial Services Group Limited and changed its name to Merdeka Financial Group Limited in October 2019. The company was incorporated in 2001 and is headquartered in Central, Hong Kong. Merdeka Financial Group Limited is a subsidiary of Team Sunny International Holdings Limited,",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.merdeka.com.hk",
        "market_cap": 24844318
    },
    "CKS2.F": {
        "short_name": "GOME RET.HLDG.SUB.HD-,025",
        "long_name": "GOME Retail Holdings Limited",
        "summary": "GOME Retail Holdings Limited, together with its subsidiaries, engages in the retail of home appliances and consumer electronic products in the People's Republic of China. The company is also involved in the provision of logistics and procurement, storage and delivery, IT development, and business management services; retailing of mobile phones and accessories; and online retail of electrical appliances and consumer electronic products, as well as in property holding activities. In addition, it engages in the trading of wine products. As of December 31, 2020, it operated 3,421 stores in 1,298 cities. The company was formerly known as GOME Electrical Appliances Holding Limited and changed its name to GOME Retail Holdings Limited in 2017. GOME Retail Holdings Limited was founded in 1987 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": "100016",
        "website": "http://www.gome.com.hk",
        "market_cap": 3181616896
    },
    "CKS2.SG": {
        "short_name": "GOME Retail Holdings Ltd. Regis",
        "long_name": "GOME Retail Holdings Limited",
        "summary": "GOME Retail Holdings Limited, together with its subsidiaries, engages in the retail of home appliances and consumer electronic products in the People's Republic of China. The company is also involved in the provision of logistics and procurement, storage and delivery, IT development, and business management services; retailing of mobile phones and accessories; and online retail of electrical appliances and consumer electronic products, as well as in property holding activities. In addition, it engages in the trading of wine products. As of December 31, 2020, it operated 3,421 stores in 1,298 cities. The company was formerly known as GOME Electrical Appliances Holding Limited and changed its name to GOME Retail Holdings Limited in 2017. GOME Retail Holdings Limited was founded in 1987 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": "100016",
        "website": "http://www.gome.com.hk",
        "market_cap": 3036990720
    },
    "CMHZ": {
        "short_name": "BANNY COSMIC INTL HLDGS INC",
        "long_name": "Banny Cosmic International Holdings, Inc.\t",
        "summary": "Banny Cosmic International Holdings, Inc. engages in the distribution of wines. The company was formerly known as Wincash Apolo Gold & Energy, Inc. Banny Cosmic International Holdings, Inc. was incorporated in 1997 and is based in Kowloon, Hong Kong.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": null,
        "market_cap": 846821
    },
    "SSW.F": {
        "short_name": "SA SA INTL HLDGS  HD-,10",
        "long_name": "Sa Sa International Holdings Limited",
        "summary": "Sa Sa International Holdings Limited, an investment holding company, engages in the retail and wholesale of cosmetic products in Hong Kong and Macau, Mainland China, and Malaysia. The company offers approximately 700 brands of skincare, fragrance, make-up, body care, hair care, and health and beauty supplements. It is also involved in intellectual property rights and property holding activities, as well as trading of cosmetic and skin care products. As of June 30, 2020, the company's retail network consisted of 231 stores. It also sells its products through e-commerce platforms, including as sasa.com, mobile app, WeChat mini-programme, and third-party platforms. The company was founded in 1978 and is headquartered in Chai Wan, Hong Kong.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Chai Wan",
        "zipcode": null,
        "website": "http://corp.sasa.com/en/home",
        "market_cap": 668115648
    }
}