{
    "0055.HK": {
        "short_name": "NEWAY GROUP",
        "long_name": "Neway Group Holdings Limited",
        "summary": "Neway Group Holdings Limited, an investment holding company, manufactures, sells, and trades in printing products in the People's Republic of China, Hong Kong, Europe, the United States, and internationally. It operates through Lending Business, Manufacturing and Sales Business, Music and Entertainment Business, Property Business, and Trading Business segments. The company's printing products include packaging boxes, labels, paper products, paper shopping bags, and advertising and cards for the electronics, home appliance, and toy industries; produces and distributes music albums and movies; manages artistes; and lends money. It also provides mini storage services; leases office and commercial units; and engages in securities trading businesses. The company tests printing products; trades in label, and packaging and paper products; offers music licensing and financial leasing services; organizes concerts and shows; and provides RFID printing products and RFID labels. The company was formerly known as Chung Tai Printing Holdings Limited and changed its name to Neway Group Holdings Limited in July 2009. Neway Group Holdings Limited was founded in 1979 and is headquartered in Fanling, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Fanling",
        "zipcode": null,
        "website": "http://www.newaygroup.com.hk",
        "market_cap": "Small Cap"
    },
    "0544.HK": {
        "short_name": "DAIDO GROUP",
        "long_name": "Daido Group Limited",
        "summary": "Daido Group Limited, an investment holding company, provides cold storage and related services in the People's Republic of China and Hong Kong. The company operates through Cold Storage and Related Services; Trading of Food and Beverage; and Money Lending Services segments. It provides warehousing and logistics services, including storage, cold storage, freight, cargo delivery, towing, devanning and loading, packaging and re-packaging, and related value-added services. The company also engages in food and beverage trading and distribution, including import, export, distribution, re-distribution, and related value-added services. In addition, it operates Urban Mart, an online shopping platform for selling daily products; provides herbal tea under the Attitude Planet brand name; and money lending services. The company is headquartered in Kwai Chung, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.daidohk.com",
        "market_cap": "Small Cap"
    },
    "0752.HK": {
        "short_name": "PICO FAR EAST",
        "long_name": "Pico Far East Holdings Limited",
        "summary": "Pico Far East Holdings Limited, an investment holding company, engages in the exhibition, event, and brand activation; visual branding activation; museum, themed environment, interior, and retail; meeting architecture activation; and related businesses. It offers visual branding solutions, brand management, and design and consultancy services; digital marketing and technology services; visual and digital content services; virtual and online solutions; design and production management services; event management services; interior renovation, promotion, exhibition and event fabrication, electrical specialist, corporate, and image consultancy and project management services; and construction, interior designing, decoration, and turnkey services, as well as technology solutions for exhibitions, events, museums, and interior and themed environment. The company also provides design, lifestyle, and business innovation communications agency services; designs, develops, operates, and manages exhibition and convention center; produces exhibition, event, and interior fit-out products; and organizes and manages exhibitions, conferences, trade fairs, convention conferences, seminars, and events. In addition, it offers freight forwarding, exhibition logistics, and transportation services for exhibitors; media planning, procurement, and optimization services in social video; services to organizers; and exhibition booth fabrication, event planning, design consultancy, themed designing, brand marketing and creative agency, brand strategy, engagement marketing, and public relations services. Further, the company manufactures and installs exhibitions; and offers services and disruptive technologies, design and technology solutions for interactive experience, and management development programs and courses. It also holds properties. The company operates in Greater China, the Middle East, Southeast Asia, the United Kingdom, the United States, and internationally. The company was founded in 1969 and is based in Tai Po, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tai Po",
        "zipcode": null,
        "website": "http://www.pico.com",
        "market_cap": "Small Cap"
    },
    "1172.HK": {
        "short_name": "MAGNUSCONCORDIA",
        "long_name": "Magnus Concordia Group Limited",
        "summary": "Magnus Concordia Group Limited, an investment holding company, manufactures and trades in printed products in Hong Kong, Mainland China, the United States, the United Kingdom, Germany, France, and internationally. The company operates through Printing, Property Investment, Property Development, Treasury, and Others and corporate segments. It manufactures and sells printed products, including art books, photography books, cookbooks, textbooks, and children's books. The company also offers stationery items, which include stationery sets, greeting cards, hand-made cards with accessories, photo frames, albums, etc. In addition, it engages in commercial printing of books, such as magazines, periodicals, annual reports, corporate brochures, point-of-sale items, catalogs, etc.; and packaging printing for paper boxes, paper gift bags, gift boxes, and packaging boxes, as well as wrapping paper for consumer products, as well as offers customized services comprising mailing of commercial products, and sourcing services. Further, it is involved in investment and leasing of real estate properties; development, sale, and trading of real estate properties; and investment and trading of listed debt and equity instruments. Magnus Concordia Group Limited's customers include companies in various areas, such as book publishing, toy manufacturing, book and gift retailing, etc. The company was formerly known as Midas International Holdings Limited and changed its name to Magnus Concordia Group Limited in June 2018. The company was founded in 1990 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.mcgrouphk.com",
        "market_cap": "Small Cap"
    },
    "1182.HK": {
        "short_name": "SUCCESS DRAGON",
        "long_name": "Success Dragon International Holdings Limited",
        "summary": "Success Dragon International Holdings Limited, an investment holding company, provides outsourced business process management services for electronic gaming machines. It also engages in processing gold-laden carbon; and sale of gold and other precious metals. In addition, the company is involved in the money lending business. It operates in Hong Kong, Macau, the People's Republic of China, and internationally. The company was formerly known as C Y Foundation Group Limited and changed its name to Success Dragon International Holdings Limited in December 2015. Success Dragon International Holdings Limited is headquartered in Tsim Sha Tsui East, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.successdragonintl.com",
        "market_cap": "Small Cap"
    },
    "1540.HK": {
        "short_name": "LEFTFIELD PRINT",
        "long_name": "Left Field Printing Group Limited",
        "summary": "Left Field Printing Group Limited, an investment holding company, provides printing solutions and services in Australia. Its printing process and services include printing solution consultation, production planning and scheduling, pre-press, offset printing, digital printing, post-press, quality check, and packaging and delivery. The company's printed products comprise read-for-pleasure books, government printed matters, quick turnaround time education books, catalogues, operating manuals, and promotional leaflets. It also provides printing related services, such as warehousing and direct mailing, and call center and ancillary services through IPALM platform. The company was incorporated in 2018 and is headquartered in Kwun Tong, Hong Kong. Left Field Printing Group Limited is a subsidiary of Lion Rock Group Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.leftfieldprinting.com",
        "market_cap": "Small Cap"
    },
    "1841.HK": {
        "short_name": "A.PLUS GROUP",
        "long_name": "A.Plus Group Holdings Limited",
        "summary": "A.Plus Group Holdings Limited, an investment holding company, provides financial printing services under the A.Plus brand in Hong Kong. The company primarily offers typesetting, design, translation, printing, and delivery services related to financial reports, company announcements, shareholder circulars, debt offering circulars, IPO prospectuses, and fund documents. It also engages in the design, production, and standalone translation of various types of reports, newsletters, leaflets, brochures, etc. The company was founded in 2002 and is headquartered in Sheung Wan, Hong Kong. A.Plus Group Holdings Limited is a subsidiary of Brilliant Ray Global Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sheung Wan",
        "zipcode": null,
        "website": "http://www.aplusgp.com",
        "market_cap": "Small Cap"
    },
    "1884.HK": {
        "short_name": "EPRINT GROUP",
        "long_name": "eprint Group Limited",
        "summary": "eprint Group Limited, an investment holding company, provides printing services and solutions on advertisements, bound books, and stationeries in Hong Kong. The company operates through two segments, Paper Printing and Banner Printing. It also provides digital printing services; and information technology and management services, as well property investment services. The company operates retail shops or the self-service platform, as well as engages in the trading of optical products. It operates under the e-print and e-banner brands. The company was founded in 2001 and is headquartered in Kwun Tong, Hong Kong. eprint Group Limited is a subsidiary of eprint Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.eprintgroup.com.hk",
        "market_cap": "Small Cap"
    },
    "1975.HK": {
        "short_name": "SUN HING PRINT",
        "long_name": "Sun Hing Printing Holdings Limited",
        "summary": "Sun Hing Printing Holdings Limited, an investment holding company, manufactures and sells printing products in Hong Kong, Europe, the United States, and internationally. The company offers packaging printing services, which include corrugated, gift, card, and product boxes; paper gift set printing services, including gift sets, such as gift boxes, cards, booklets, and hardback books; card printing services, which covers colour, insert, warranty, and plain cards; smart package printing services comprises near-field communications tags, radio-frequency identification labels, and real QR codes; and other printing services that include stickers, colour papers, yupo papers, and red packets. It serves consumer products, promotion, advertising, and education markets. The company was incorporated in 2017 and is based in Chai Wan, Hong Kong. Sun Hing Printing Holdings Limited is a subsidiary of Goody Luck Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Chai Wan",
        "zipcode": null,
        "website": "http://www.sunhingprinting.com",
        "market_cap": "Small Cap"
    },
    "8206.HK": {
        "short_name": "S ROBOT EDU",
        "long_name": "Shentong Robot Education Group Company Limited",
        "summary": "Shentong Robot Education Group Company Limited, an investment holding company, provides robotics education services in the People's Republic of China. It provides promotion and management services for an electronic smart card through Designated Shentong Card. The company also organizes and hosts China Robot Competition; and offers robotics training courses. In addition, it provides robot related consultancy, conference, and advertising services. The company was formerly known as China Communication Telecom Services Company Limited and changed its name to Shentong Robot Education Group Company Limited in September 2016. Shentong Robot Education Group Company Limited is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.srobotedu.com",
        "market_cap": "Small Cap"
    },
    "8317.HK": {
        "short_name": "FINET GROUP",
        "long_name": "Finet Group Limited",
        "summary": "Finet Group Limited, an investment holding company, develops, produces, and provides financial information services, advertising and investor relationship services, and technology solutions to corporate and retail investors in the People's Republic of China. The company operates in four segments: Financial Information, Advertising and Investor Relationship Service Business; Securities and Futures Business; Money Lending Business; and Property Investment Business. It also offers branding promotion, and communication services; digital marketing and advertising, public relationship, and events management; and online securities and futures trading services. In addition, the company produces and distributes programs through the FinTV brand; and invests in properties. Further, it provides securities brokerage, placing and underwriting, and asset management services; and provides money lending, video making, data hosting, financial public relationship and information management, online and offline advertising, financial services, and value-added telecommunication services. The company was incorporated in 1998 and is headquartered in Wanchai, Hong Kong. Finet Group Limited is a subsidiary of Maxx Capital International Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.finet.hk",
        "market_cap": "Small Cap"
    },
    "8325.HK": {
        "short_name": "CHINA SMARTPAY",
        "long_name": "China Smartpay Group Holdings Limited",
        "summary": "China Smartpay Group Holdings Limited, an investment holding company, primarily engages in the prepaid cards and internet payment businesses in the People's Republic of China, Hong Kong, Thailand, and Singapore. The company also offers trade financing, and securities investment services, as well as issues prestige benefits cards to consumers and financial institutions. In addition, it engages in the internet micro-credit business; software development activities; provision of travel package; hotel booking agency; and merchant acquiring businesses. The company was formerly known as Oriental City Group Holdings Limited and changed its name to China Smartpay Group Holdings Limited in March 2014. China Smartpay Group Holdings Limited was founded in 2001 and is headquartered in Sai Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sai Wan",
        "zipcode": null,
        "website": "http://www.chinasmartpay.com",
        "market_cap": "Small Cap"
    },
    "8385.HK": {
        "short_name": "PROSPEROUSPRINT",
        "long_name": "Prosperous Printing Company Limited",
        "summary": "Prosperous Printing Company Limited, together with its subsidiaries, produces and sells books and paper products to print brokers and publishers in Hong Kong, the United States, the United Kingdom, Australia, and other European countries. The company offers case and soft bound book; and saddle stitch book, handcraft products, silk screening, finishing, and cut and stamp products, as well as offers accessories and others. It is also involved in the property investment activities. The company offers its products through sales representatives. The company was incorporated in 1992 and is headquartered in Chai Wan, Hong Kong. Prosperous Printing Company Limited is a subsidiary of First Tech Inc.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Chai Wan",
        "zipcode": null,
        "website": "http://www.prosperous-printing-group.com.hk",
        "market_cap": "Small Cap"
    },
    "8419.HK": {
        "short_name": "AV PROMOTIONS",
        "long_name": "AV Promotions Holdings Limited",
        "summary": "AV Promotions Holdings Limited, an investment holding company, provides visual, lighting, and audio solution services in the Hong Kong, Macau, and People's Republic of China. It offers services to its customers in various events, including exhibitions, ceremonies, conferences, concerts, TV shows, product launches, and other types of events. The company was incorporated in 2017 and is headquartered in Aberdeen, Hong Kong. AV Promotions Holdings Limited is a subsidiary of Mega King Elite Investment Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Aberdeen",
        "zipcode": null,
        "website": "http://www.avpromotions.com",
        "market_cap": "Small Cap"
    },
    "8448.HK": {
        "short_name": "UNI PRINTSHOP",
        "long_name": "Universe Printshop Holdings Limited",
        "summary": "Universe Printshop Holdings Limited, an investment holding company, provides general printing services and trades in printing products in Hong Kong. Its printing services include offset printing, ink-jet printing, and toner-based digital printing. The company also offers business printing-related products, including stationery, advertisements, periodicals, directories, and catalogues; and other printing-related products, such as pre-ink stamps, plastic name-cards, printed eco-bags, and printed plastic folders. In addition, it provides various post-press treatment services to printed products, such as varnishing, binding, and laminating. Universe Printshop Holdings Limited was founded in 2001 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.uprintshop.hk",
        "market_cap": "Small Cap"
    },
    "8450.HK": {
        "short_name": "EDICO HOLDINGS",
        "long_name": "EDICO Holdings Limited",
        "summary": "EDICO Holdings Limited, an investment holding company, provides integrated financial printing services in Hong Kong. Its integrated services include typesetting and proofreading, translation, design, printing and binding, distribution, and media placement. The company handles a range of documents, including listing-related documents, periodical reporting documents, compliance documents, and other miscellaneous and marketing collaterals. It serves listing applicants and listed companies. The company was founded in 2009 and is headquartered in Central, Hong Kong. EDICO Holdings Limited operates as a subsidiary of Achiever Choice Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.edico.com.hk",
        "market_cap": "Small Cap"
    },
    "CI1.AX": {
        "short_name": "CREDITL FPO",
        "long_name": "Credit Intelligence Limited",
        "summary": "Credit Intelligence Limited provides debt restructuring and personal insolvency management services in Hong Kong, Singapore, and Australia. Its services include bankruptcy administration, and individual voluntary arrangement proposal consultancy and implementation services, as well as credit funding for corporate and individuals. The company is based in Central, Hong Kong.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.ci1.com.au",
        "market_cap": "Small Cap"
    },
    "PJFB.F": {
        "short_name": "PICO FAR EAST HLD.SUBDIV.",
        "long_name": "Pico Far East Holdings Limited",
        "summary": "Pico Far East Holdings Limited, an investment holding company, engages in the exhibition, event, and brand activation; visual branding activation; museum, themed environment, interior, and retail; meeting architecture activation; and related businesses. It offers visual branding solutions, brand management, and design and consultancy services; digital marketing and technology services; visual and digital content services; virtual and online solutions; design and production management services; event management services; interior renovation, promotion, exhibition and event fabrication, electrical specialist, corporate, and image consultancy and project management services; and construction, interior designing, decoration, and turnkey services, as well as technology solutions for exhibitions, events, museums, and interior and themed environment. The company also provides design, lifestyle, and business innovation communications agency services; designs, develops, operates, and manages exhibition and convention center; produces exhibition, event, and interior fit-out products; and organizes and manages exhibitions, conferences, trade fairs, convention conferences, seminars, and events. In addition, it offers freight forwarding, exhibition logistics, and transportation services for exhibitors; media planning, procurement, and optimization services in social video; services to organizers; and exhibition booth fabrication, event planning, design consultancy, themed designing, brand marketing and creative agency, brand strategy, engagement marketing, and public relations services. Further, the company manufactures and installs exhibitions; and offers services and disruptive technologies, design and technology solutions for interactive experience, and management development programs and courses. It also holds properties. The company operates in Greater China, the Middle East, Southeast Asia, the United Kingdom, the United States, and internationally. The company was founded in 1969 and is based in Tai Po, Hong Kong.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tai Po",
        "zipcode": null,
        "website": "http://www.pico.com",
        "market_cap": "Small Cap"
    },
    "YDAB.F": {
        "short_name": "YUE DA INTL HLDGS HD -,10",
        "long_name": "Yue Da International Holdings Limited",
        "summary": "Yue Da International Holdings Limited, an investment holding company, operates in the factoring business in the People's Republic of China. It offers trade finance, sales ledger management, customer credit rating, accounts receivable management and collection, credit risk guarantee, and supply chain management services. The company was formerly known as Yue Da Mining Holdings Limited and changed its name to Yue Da International Holdings Limited in December 2018. Yue Da International Holdings Limited was incorporated in 2001 and is headquartered in Sheung Wan, Hong Kong. Yue Da International Holdings Limited is a subsidiary of Yue Da Capital (H.K.) Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sheung Wan",
        "zipcode": null,
        "website": "http://www.yueda.com.hk",
        "market_cap": "Small Cap"
    }
}