{
    "0103.HK": {
        "short_name": "SHOUGANG CENT",
        "long_name": "Shougang Concord Century Holdings Limited",
        "summary": "Shougang Concord Century Holdings Limited, an investment holding company, manufactures and sells steel cords for use in radial tyres in the People's Republic of China. It also engages in the manufacture of sawing wires and hose wires under the Eastern brand. In addition, the company invests in properties, as well as provides management, investment trading, and consulting services. It exports its products to Europe, the Middle East, and Africa, as well as North America, South America, and rest of Asia. The company was incorporated in 1991 and is based in Chai Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Chai Wan",
        "zipcode": null,
        "website": "http://www.shougangcentury.com.hk",
        "full_time_employees": 2148
    },
    "0803.HK": {
        "short_name": "PROSPERITY INTL",
        "long_name": "Prosperity International Holdings (H.K.) Limited",
        "summary": "Prosperity International Holdings (H.K.) Limited, an investment holding company, engages in the real estate investment, development, and leasing business in the People's Republic of China, Taiwan, and internationally. It is also involved in the trading of clinker, cement, granulated blast furnace slag, and other building materials, as well as steel. In addition, the company engages in mining, processing, and trading of iron ore, iron ore equipment, and raw materials. Further, it is involved in the provision of advisory, planning, and administrative; human resource; and transportation services. Prosperity International Holdings (H.K.) Limited was founded in 1980 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.pihl-hk.com",
        "full_time_employees": 171
    },
    "0893.HK": {
        "short_name": "CHINAVTM MINING",
        "long_name": "China Vanadium Titano-Magnetite Mining Company Limited",
        "summary": "China Vanadium Titano-Magnetite Mining Company Limited, an investment holding company, engages in mining and ore processing activities in the People's Republic of China. It operates through three segments: High-Fe Mining Operation; Trading; and Corporate and Others. The company engages in the operation of sale of self-produced products, and trading of coal and steel. It is also involved in the provision of specialized mining services; and management of strategic investments. In addition, the company engages in the iron ore and gypsum ore beneficiation activities, as well as provision of contract mining and construction consulting services. China Vanadium Titano-Magnetite Mining Company Limited was founded in 2004 and is based in Causeway Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.chinavtmmining.com",
        "full_time_employees": 191
    },
    "0990.HK": {
        "short_name": "THEME INT'L",
        "long_name": "Theme International Holdings Limited",
        "summary": "Theme International Holdings Limited, an investment holding company, engages in the distribution and trading of bulk commodities and related products in the People's Republic of China, Hong Kong, and Singapore. It provides personal loan, mortgage, installment credit, market making, margin financing, structured trade, and other credit granting services; and securities and commodity contracts dealing, securities brokerage, commodity futures and gold bullion broking and dealing, and fund management services, as well as trades in metals and metal ores. The company was incorporated in 1993 and is headquartered in Sheung Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sheung Wan",
        "zipcode": null,
        "website": "http://www.990.com.hk",
        "full_time_employees": 71
    },
    "1116.HK": {
        "short_name": "MAYER HOLDINGS",
        "long_name": "Mayer Holdings Limited",
        "summary": "Mayer Holdings Limited, an investment holding company, engages in the processing, manufacture, and sale of steel sheets and pipes, and other steel products in the People's Republic of China. The company provides its products under the MAYER brand. It also offers urban renewal project planning and consulting, business and economic consulting, and real estate development services. The company also exports its products. Mayer Holdings Limited was incorporated in 2003 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.mayer.com.hk",
        "full_time_employees": 355
    },
    "1118.HK": {
        "short_name": "GOLIK HOLDINGS",
        "long_name": "Golik Holdings Limited",
        "summary": "Golik Holdings Limited, an investment holding company, manufactures and sells metal products and building construction materials in Hong Kong and Mainland China. The company offers steel coil products, including cold rolled, galvanized, aluminum coated, silicon, electrolytic tinplate, and electrical steel products; and elevator, crane, and oilfield ropes. It also provides steel wire products, such as carbon steel spring wires, piano wires, bedding spring wires, core wires for ACSR conductors, and galvanized low carbon steel wires for cable armoring; galvanized wire strands, fiber optic cable strength members, and zinc-coated steel strands; and steel wire ropes. In addition, the company distributes reinforcing steel bars, sheet piles, and H-beams; and offers reinforcing steel products, services, and accessories, including reinforcement solutions, bored pile cages, lattice girders, rebar couplers, Hy-Rib formworks, and concreting accessories, as well as expanded metal meshes, beads and laths, lintels, and corrugated sheets. Further, it produces and supplies ready mixed concrete for the construction industry; and operates a decoiling center and concrete batching plants. Additionally, the company provides concrete and metal products, and warehousing services, as well as engages in the property holding activities. Golik Holdings Limited was founded in 1977 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.golik.com",
        "full_time_employees": 1629
    },
    "1203.HK": {
        "short_name": "GUANGNAN (HOLD)",
        "long_name": "GDH Guangnan (Holdings) Limited",
        "summary": "GDH Guangnan (Holdings) Limited, an investment holding company, manufactures and sells tinplates and related products primarily in Hong Kong and Mainland China. It operates through three divisions: Tinplating, Fresh and Live Foodstuffs, and Property Leasing. The Tinplating division provides tinplates and tin-free steel; and processed products, such as coated/printed tinplate/tin-free steel, as well as cold-rolled steel plates. Its tinplate and tin-free steel products are used in food, light, and chemical industries. It is also involved in the research and development, production, and sale of tinplated steel sheets, chrome-plated steel sheets, and other processed products. The Fresh and Live Foodstuffs division engages in the distribution of livestock and poultry, such as cattle and chicken; sale of live pigs; wholesale of poultry; and trading of foodstuffs, including chilled poultry and pork, frozen poultry, and rice and starch. The Property Leasing division leases offices and factory buildings. The company was formerly known as Guangnan (Holdings) Limited and changed its name to GDH Guangnan (Holdings) Limited in June 2020. GDH Guangnan (Holdings) Limited was incorporated in 1982 and is based in Wan Chai, Hong Kong. GDH Guangnan (Holdings) Limited is a subsidiary of GDH Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.gdguangnan.com",
        "full_time_employees": 1071
    },
    "1894.HK": {
        "short_name": "HANG YICK HLDGS",
        "long_name": "Hang Yick Holdings Company Limited",
        "summary": "Hang Yick Holdings Company Limited, a steel and metal engineering company, designs, manufactures, supplies, and installs steel and metal products for construction projects in the People's Republic of China. It offers bespoke steel and metal engineering solutions, such as balustrades, rolling shutters, mailboxes, handrails, cat ladders, etc.; and structural design solutions, including appearance, functionality, material, accurate fabrication tolerance, and ease of installation solutions. The company also designs, manufactures, supplies, and installs various passive fire products comprising insulation or non-insulation fire rolling shutters and gates; and provides metal gates engineering services. In addition, it manufactures and sells metal gates, collapsible gates, fire-insulated shutters, rolling shutters, metal doors, and other steel and metal products. The company was founded in 1982 and is headquartered in Yau Tong, Hong Kong. Hang Yick Holdings Company Limited is a subsidiary of Hy Steel Company Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Yau Tong",
        "zipcode": null,
        "website": "http://www.hy-engineering.com",
        "full_time_employees": 360
    },
    "8140.HK": {
        "short_name": "BOSATECH",
        "long_name": "BOSA Technology Holdings Limited",
        "summary": "BOSA Technology Holdings Limited, an investment holding company, provides mechanical splicing services to the reinforced concrete construction industry in Hong Kong. It is involved in processing reinforcing bars, including cutting, crimping, chamfering, and threading of reinforcing bars at its premises or at the premises of customers; and connecting reinforcing bars by couplers. The company serves various contractors and subcontractors. BOSA Technology Holdings Limited was founded in 2012 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.bosa-tech.com",
        "full_time_employees": 52
    },
    "CV8S.F": {
        "short_name": "CHINA VAN.T.M.REGS HD-,10",
        "long_name": "China Vanadium Titano-Magnetite Mining Company Limited",
        "summary": "China Vanadium Titano-Magnetite Mining Company Limited, an investment holding company, engages in mining and ore processing activities in the People's Republic of China. It operates through three segments: High-Fe Mining Operation; Trading; and Corporate and Others. The company engages in the operation of sale of self-produced products, and trading of coal and steel. It is also involved in the provision of specialized mining services; and management of strategic investments. In addition, the company engages in the iron ore and gypsum ore beneficiation activities, as well as provision of contract mining and construction consulting services. China Vanadium Titano-Magnetite Mining Company Limited was founded in 2004 and is based in Causeway Bay, Hong Kong.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.chinavtmmining.com",
        "full_time_employees": 191
    },
    "CW7.F": {
        "short_name": "SHOU.CON.CENT.HLDGS",
        "long_name": "Shougang Concord Century Holdings Limited",
        "summary": "Shougang Concord Century Holdings Limited, an investment holding company, manufactures and sells steel cords for use in radial tyres in the People's Republic of China. It also engages in the manufacture of sawing wires and hose wires under the Eastern brand. In addition, the company invests in properties, as well as provides management, investment trading, and consulting services. It exports its products to Europe, the Middle East, and Africa, as well as North America, South America, and rest of Asia. The company was incorporated in 1991 and is based in Chai Wan, Hong Kong.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Chai Wan",
        "zipcode": null,
        "website": "http://www.shougangcentury.com.hk",
        "full_time_employees": 2148
    },
    "GUJB.F": {
        "short_name": "GDH GUANGNAN (HOLDINGS)",
        "long_name": "GDH Guangnan (Holdings) Limited",
        "summary": "GDH Guangnan (Holdings) Limited, an investment holding company, manufactures and sells tinplates and related products primarily in Hong Kong and Mainland China. It operates through three divisions: Tinplating, Fresh and Live Foodstuffs, and Property Leasing. The Tinplating division provides tinplates and tin-free steel; and processed products, such as coated/printed tinplate/tin-free steel, as well as cold-rolled steel plates. Its tinplate and tin-free steel products are used in food, light, and chemical industries. It is also involved in the research and development, production, and sale of tinplated steel sheets, chrome-plated steel sheets, and other processed products. The Fresh and Live Foodstuffs division engages in the distribution of livestock and poultry, such as cattle and chicken; sale of live pigs; wholesale of poultry; and trading of foodstuffs, including chilled poultry and pork, frozen poultry, and rice and starch. The Property Leasing division leases offices and factory buildings. The company was formerly known as Guangnan (Holdings) Limited and changed its name to GDH Guangnan (Holdings) Limited in June 2020. GDH Guangnan (Holdings) Limited was incorporated in 1982 and is based in Wan Chai, Hong Kong. GDH Guangnan (Holdings) Limited is a subsidiary of GDH Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.gdguangnan.com",
        "full_time_employees": 1071
    },
    "ORG.F": {
        "short_name": "CHINA ORIENTAL GRP HD-,10",
        "long_name": "China Oriental Group Company Limited",
        "summary": "China Oriental Group Company Limited, an investment holding company, manufactures and sells iron and steel products for downstream steel manufacturers in the People's Republic of China. The company operates through Iron and Steel, and Real Estate segments. It offers H-section steel products for use in non-residential construction and infrastructure projects as structural supports; strips and strip products; cold rolled sheets for use in manufacturing home electric appliances, hardware, pipes, etc.; galvanized sheets for the production of civil-purpose sheets; and billets for use as substrate in downstream steel products; and rebars for use in residential and non-residential projects. The company is also involved in the trade of steel, and iron ore and related products; leasing and financial leasing business; import and export of goods and technology; purchase and sale of ferrous metal and coke; development and sale of real estate properties; environmental protection engineering activities; non-metallic ore mining and trading; recycling of steel and waste materials; processing and sale of railway transmission lines and accessories; manufacturing of casting products; and research and development of recycling and energy-saving technology, as well as other recycling and construction engineering business. In addition, it provides equipment maintenance, motor vehicle scrap, and crush demolition solutions; publication, construction project management, wholesale and retail trade, asset management, logistics, commercial management, hotel and catering, cargo transit agency, and investment and management services; and architectural design, sale, and installation services, commercial consulting, technical advisory and software development, technology promotion, new material technology and building engineering design services, and loans. China Oriental Group Company Limited was incorporated in 2003 and is based in Wanchai, Hong Kong.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.chinaorientalgroup.com",
        "full_time_employees": 9300
    },
    "YCK.F": {
        "short_name": "CHU KONG PET.+NAT.ST.P.H.",
        "long_name": "Chu Kong Petroleum and Natural Gas Steel Pipe Holdings Limited",
        "summary": "Chu Kong Petroleum and Natural Gas Steel Pipe Holdings Limited, an investment holding company, manufactures, sells, and exports longitudinal welded steel pipes in the People's Republic of China and internationally. It operates through two segments, Steel Pipes, and Property Development and Investment. The company offers longitudinal and spiral submerged arc-welded steel pipes. It also trades in steel pipes; manufactures and sells petrol fittings, oil country tubular goods, steel pipe equipment and metallurgy equipment, and screw-thread steels; and provides steel pipe casing and lining, and port services. In addition, the company is involved in the property investment, development, and management activities; provision of manufacturing services for processing raw materials into steel pipes; trading of steel plates; and sale of steel fittings and scrap materials. Its steel pipes are primarily used for energy transmission, including oil and gas transmission pipelines, deep sea pipelines, city gas networks, and petrochemicals, as well as mining, infrastructure construction, offshore engineering, steel structure, and water utilities industries. The company was founded in 1993 and is headquartered in Tsim Sha Tsui, Hong Kong. Chu Kong Petroleum and Natural Gas Steel Pipe Holdings Limited is a subsidiary of Bournam Profits Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.pck.com.cn",
        "full_time_employees": 821
    }
}