{
    "0008.HK": {
        "short_name": "PCCW",
        "long_name": "PCCW Limited",
        "summary": "PCCW Limited provides telecommunications and related services in Hong Kong, Mainland and other parts of China, Japan, and internationally. The company's services include local telephony, local data and broadband, mobile and international telecommunications, and satellite-based and network-based telecommunications services; and outsourcing, consulting, and contact center services. It also provides technical support, electronics and communications engineering, and products and solutions, as well as free television, pay television program, and interactive multimedia services; sells advertising in various telephone directories and on the Internet; publishes directories; and sells mobile handsets and accessories. In addition, the company offers broadcasting and related services, management and engineering support services, customer relationship management and customer contact management solutions, content for various media, and outsourced call center and data center services; and over-the-top video services under the Viu brand, as well as sells customer premises equipment and related solutions. Further, it engages in the sale, distribution, and marketing of telecommunication products; supply of broadband internet access solutions and web services; provision of data services; and software development, systems integration, consulting, and informatization activities; the provision of computer and IP/IT related value-added services to business customers; property investment, development, management, and leasing, as well as hotel management activities; and ski operations. Additionally, the company offers entertainment over-the-top platform; and digital, IT and business process outsourcing, cloud computing, hosting, managed, e-commerce, and IoT solutions. PCCW Limited was founded in 1925 and is headquartered in Quarry Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Quarry Bay"
    },
    "0215.HK": {
        "short_name": "HUTCHTEL HK",
        "long_name": "Hutchison Telecommunications Hong Kong Holdings Limited",
        "summary": "Hutchison Telecommunications Hong Kong Holdings Limited, an investment holding company, provides mobile communication services. It offers provides 5G, 4G long term evolution, 3G and GSM dual-band mobile telecommunications under the 3 brand. The company also provides mobile telecommunications services and products include local voice, SMS, MMS, international direct dialing, and international roaming; and data services and applications, such as direct carrier billing offerings, mobile device security management, eBooks, music downloads, movies-on-demand, mobile social networking applications, and FinTech, as well as Wi-Fi and other value-added services. In addition, the company is involved in the provision of marketing, advertising and promotional services; management and treasury services; and telecommunications retail operations. As of December 31, 2019, it served approximately 3.7 million customers in Hong Kong and Macau. The company was incorporated in 2007 and is headquartered in Central, Hong Kong. Hutchison Telecommunications Hong Kong Holdings Limited is a subsidiary of CK Hutchison Holdings Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0762.HK": {
        "short_name": "CHINA UNICOM",
        "long_name": "China Unicom (Hong Kong) Limited",
        "summary": "China Unicom (Hong Kong) Limited, an investment holding company, provides cellular and fixed-line voice, and related value-added services in the People's Republic of China. It also provides broadband and other Internet-related, information communications technology, and business and data communications services. In addition, the company offers communications technology training, technical, and Internet information and value-added telecommunications services; telecommunications network construction, planning, and technical consulting services; and consultancy, survey, design, and contract services relating to information and construction projects. Further, it provides customer, project design consultation and management, property management, e-payment, venture capital investment, communications technology development and promotion, auto informatisation, financial, data processing, and tourism and information services; advertising design, production, agency, and publication services; technology development, transfer, and consulting services; and technology promotion service of intelligent transportation system's products. Additionally, the company offers technology development and consultation, and other services; technology research and development, consultation, and services of TV video and mobile video; internet of things technology, and online data processing and transaction services; and big data, and cloud computation and infrastructure services. It also provides online video and reading materials; network music; financing leasing services; and data analysis and application services, as well as sells handsets and telecommunication equipment. As of December 31, 2019, it had approximately 254 million 4G subscribers, 83 million fixed-line broadband subscribers, and 54 million fixed-line local access subscribers. The company was incorporated in 2000 and is based in Central, Hong Kong. China Unicom (Hong Kong) Limited is a subsidiary of China Unicom (BVI) Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "1310.HK": {
        "short_name": "HKBN",
        "long_name": "HKBN Ltd.",
        "summary": "HKBN Ltd., an investment holding company, provides fixed telecommunications network, international telecommunications, and mobile services to residential and enterprise customers primarily in Hong Kong. The company offers a range of information and communications technology services, such as broadband, Wi-Fi, mobile, data connectivity, cloud, data processing/center, information security, business continuity, and system integration services. It provides over-the-top entertainment, music streaming, administrative support services, enterprise systems development, technical services, and business referrals and consultancy services; e-business services; outsourcing; property investment; engages in the sale of various products and wholesale of computer software; and holding of licenses, as well as distributes email and related products. HKBN Ltd. was founded in 1992 and is headquartered in Kwai Chung, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kwai Chung"
    },
    "2HK.F": {
        "short_name": "HKBN LTD  HD -,0001",
        "long_name": "HKBN Ltd.",
        "summary": "HKBN Ltd., an investment holding company, provides fixed telecommunications network, international telecommunications, and mobile services to residential and enterprise customers primarily in Hong Kong. The company offers a range of information and communications technology services, such as broadband, Wi-Fi, mobile, data connectivity, cloud, data processing/center, information security, business continuity, and system integration services. It provides over-the-top entertainment, music streaming, administrative support services, enterprise systems development, technical services, and business referrals and consultancy services; e-business services; outsourcing; property investment; engages in the sale of various products and wholesale of computer software; and holding of licenses, as well as distributes email and related products. HKBN Ltd. was founded in 1992 and is headquartered in Kwai Chung, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Kwai Chung"
    },
    "6823.HK": {
        "short_name": "HKT-SS",
        "long_name": "HKT Trust and HKT Limited",
        "summary": "HKT Trust and HKT Limited provides telecommunications services in Hong Kong, Mainland China, and internationally. It operates through Telecommunications Services, Mobile, and Other Businesses segments. The Telecommunications Services segment offers telecommunications and related services, including local telephony, local data and broadband, and international telecommunications, as well as enterprise solutions; and other telecommunications businesses, such as customer premises equipment sales, outsourcing, consulting, and contact centers. The Mobile segment provides mobile telecommunications services. The Other Businesses segment offers financial-related services, such as mobile payment, smart mobile point-of-sale solutions, and insurance; and The Club, a loyalty program. The company also provides cloud computing, Internet of Things, and artificial intelligence solutions to enterprises; Web services; network-based telecommunications and satellite-based services; outsourced call center services; customer and consultancy services; and customer relationship and customer contact management solutions and services. In addition, it offers system integration, software development, and technical services consultancy services; and sells mobile handsets and accessories, as well as telecommunication products and services. The company was incorporated in 2011 and is headquartered in Quarry Bay, Hong Kong. HKT Trust and HKT Limited is a subsidiary of PCCW Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Quarry Bay"
    },
    "ASEJF": {
        "short_name": "APT SATELLITE HLDG",
        "long_name": "APT Satellite Holdings Limited",
        "summary": "APT Satellite Holdings Limited, an investment holding company, maintains, operates, and provides satellite transponder capacity and related services, satellite-based broadcasting and telecommunications services, and other services. It offers a range of C-band and Ku-band transponder leasing services to its broadcast and telecommunication customers; satellite TV broadcasting services; and teleport and network services, including hub-based and single channel per carrier services. The company also provides data center services that comprise rack leasing, server and equipment hosting, cloud management, IP gateway transit, and customized managed services; offers OTT services; and holds rights on the licensing of Chinese TV channel content and 25 TV channels of APT Satellite packages. It operates in-orbit satellites consisting of APSTAR-5C, APSTAR-6C, APSTAR-7, and APSTAR-9 in Asia, Australia, the Middle East, Africa, Europe, and the Pacific region. In addition, the company engages in property holding activities; and the provision of management and project management consultancy services. The company was founded in 1992 and is headquartered in Tai Po, Hong Kong. APT Satellite Holdings Limited is a subsidiary of APT Satellite International Company Limited.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Tai Po"
    },
    "CTM.F": {
        "short_name": "CHINA MOBILE LTD.",
        "long_name": "China Mobile Limited",
        "summary": "China Mobile Limited provides mobile telecommunications and related services in Mainland China and Hong Kong. The company offers local calls; domestic and international long distance calls and roaming services; and value-added services, such as caller identity display, call waiting, conference calls, and others. It also provides wireless Internet service, as well as digital applications comprising music, video, reading, gaming, and animation; wireline broadband services; and wireline voice services. In addition, it offers dedicated line and IDC services to corporate customers in a range of industry sectors; and basic corporate communication products comprising corporate VPMN and SMS, and tailor made solutions. Further, the company provides international telecommunications services, which includes IDD, roaming, Internet, MNC, and value added business services. Additionally, it offers telecommunications network planning, design, and consulting services; roaming clearance, IT system operation, and technology support services; value-added platform development and maintenance services; mobile data, and system integration and development services; network construction and maintenance, network planning and optimizing, and training services; electronic communication products design and sale of related products; and non-banking financial services. It also provides mobile cloud research and development services; call center services; e-payment, e-commerce, and Internet finance services; and mobile Internet digital content services, as well as operates a network and business coordination center. The company serves 950 million mobile customers and 187 million wireline broadband customers. The company was formerly known as China Mobile (Hong Kong) Limited and changed its name to China Mobile Limited in May 2006. The company was incorporated in 1997 and is based in Central, Hong Kong. China Mobile Limited is a subsidiary of China Mobile Hong Kong (BVI) Limited.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "HKTTF": {
        "short_name": "HKT TRUST AND HKT LTD",
        "long_name": "HKT Trust and HKT Limited",
        "summary": "HKT Trust and HKT Limited provides telecommunications services in Hong Kong, Mainland China, and internationally. It operates through Telecommunications Services, Mobile, and Other Businesses segments. The Telecommunications Services segment offers telecommunications and related services, including local telephony, local data and broadband, and international telecommunications, as well as enterprise solutions; and other telecommunications businesses, such as customer premises equipment sales, outsourcing, consulting, and contact centers. The Mobile segment provides mobile telecommunications services. The Other Businesses segment offers financial-related services, such as mobile payment, smart mobile point-of-sale solutions, and insurance; and The Club, a loyalty program. The company also provides cloud computing, Internet of Things, and artificial intelligence solutions to enterprises; Web services; network-based telecommunications and satellite-based services; outsourced call center services; customer and consultancy services; and customer relationship and customer contact management solutions and services. In addition, it offers system integration, software development, and technical services consultancy services; and sells mobile handsets and accessories, as well as telecommunication products and services. The company was incorporated in 2011 and is headquartered in Quarry Bay, Hong Kong. HKT Trust and HKT Limited is a subsidiary of PCCW Limited.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Quarry Bay"
    },
    "HKTTY": {
        "short_name": "HKT TRUST AND HKT LTD",
        "long_name": "HKT Trust and HKT Limited",
        "summary": "HKT Trust and HKT Limited provides telecommunications services in Hong Kong, Mainland China, and internationally. It operates through Telecommunications Services, Mobile, and Other Businesses segments. The Telecommunications Services segment offers telecommunications and related services, including local telephony, local data and broadband, and international telecommunications, as well as enterprise solutions; and other telecommunications businesses, such as customer premises equipment sales, outsourcing, consulting, and contact centers. The Mobile segment provides mobile telecommunications services. The Other Businesses segment offers financial-related services, such as mobile payment, smart mobile point-of-sale solutions, and insurance; and The Club, a loyalty program. The company also provides cloud computing, Internet of Things, and artificial intelligence solutions to enterprises; Web services; network-based telecommunications and satellite-based services; outsourced call center services; customer and consultancy services; and customer relationship and customer contact management solutions and services. In addition, it offers system integration, software development, and technical services consultancy services; and sells mobile handsets and accessories, as well as telecommunication products and services. The company was incorporated in 2011 and is headquartered in Quarry Bay, Hong Kong. HKT Trust and HKT Limited is a subsidiary of PCCW Limited.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Quarry Bay"
    },
    "HTCTF": {
        "short_name": "HUTCHISON TELECOMMUNICATIONS HK",
        "long_name": "Hutchison Telecommunications Hong Kong Holdings Limited",
        "summary": "Hutchison Telecommunications Hong Kong Holdings Limited, an investment holding company, provides mobile communication services. It offers provides 5G, 4G long term evolution, 3G and GSM dual-band mobile telecommunications under the 3 brand. The company also provides mobile telecommunications services and products include local voice, SMS, MMS, international direct dialing, and international roaming; and data services and applications, such as direct carrier billing offerings, mobile device security management, eBooks, music downloads, movies-on-demand, mobile social networking applications, and FinTech, as well as Wi-Fi and other value-added services. In addition, the company is involved in the provision of marketing, advertising and promotional services; management and treasury services; and telecommunications retail operations. As of December 31, 2019, it served approximately 3.7 million customers in Hong Kong and Macau. The company was incorporated in 2007 and is headquartered in Central, Hong Kong. Hutchison Telecommunications Hong Kong Holdings Limited is a subsidiary of CK Hutchison Holdings Limited.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "HUTCY": {
        "short_name": "HUTCHISON TELECOMMUNICATIONS HK",
        "long_name": "Hutchison Telecommunications Hong Kong Holdings Limited",
        "summary": "Hutchison Telecommunications Hong Kong Holdings Limited, an investment holding company, provides mobile communication services. It offers provides 5G, 4G long term evolution, 3G and GSM dual-band mobile telecommunications under the 3 brand. The company also provides mobile telecommunications services and products include local voice, SMS, MMS, international direct dialing, and international roaming; and data services and applications, such as direct carrier billing offerings, mobile device security management, eBooks, music downloads, movies-on-demand, mobile social networking applications, and FinTech, as well as Wi-Fi and other value-added services. In addition, the company is involved in the provision of marketing, advertising and promotional services; management and treasury services; and telecommunications retail operations. As of December 31, 2019, it served approximately 3.7 million customers in Hong Kong and Macau. The company was incorporated in 2007 and is headquartered in Central, Hong Kong. Hutchison Telecommunications Hong Kong Holdings Limited is a subsidiary of CK Hutchison Holdings Limited.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "PCCWY": {
        "short_name": "PCCW LIMITED",
        "long_name": "PCCW Limited",
        "summary": "PCCW Limited provides telecommunications and related services in Hong Kong, Mainland and other parts of China, Japan, and internationally. The company's services include local telephony, local data and broadband, mobile and international telecommunications, and satellite-based and network-based telecommunications services; and outsourcing, consulting, and contact center services. It also provides technical support, electronics and communications engineering, and products and solutions, as well as free television, pay television program, and interactive multimedia services; sells advertising in various telephone directories and on the Internet; publishes directories; and sells mobile handsets and accessories. In addition, the company offers broadcasting and related services, management and engineering support services, customer relationship management and customer contact management solutions, content for various media, and outsourced call center and data center services; and over-the-top video services under the Viu brand, as well as sells customer premises equipment and related solutions. Further, it engages in the sale, distribution, and marketing of telecommunication products; supply of broadband internet access solutions and web services; provision of data services; and software development, systems integration, consulting, and informatization activities; the provision of computer and IP/IT related value-added services to business customers; property investment, development, management, and leasing, as well as hotel management activities; and ski operations. Additionally, the company offers entertainment over-the-top platform; and digital, IT and business process outsourcing, cloud computing, hosting, managed, e-commerce, and IoT solutions. PCCW Limited was founded in 1925 and is headquartered in Quarry Bay, Hong Kong.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Quarry Bay"
    },
    "PCWLF": {
        "short_name": "PCCW LIMITED",
        "long_name": "PCCW Limited",
        "summary": "PCCW Limited provides telecommunications and related services in Hong Kong, Mainland and other parts of China, Japan, and internationally. The company's services include local telephony, local data and broadband, mobile and international telecommunications, and satellite-based and network-based telecommunications services; and outsourcing, consulting, and contact center services. It also provides technical support, electronics and communications engineering, and products and solutions, as well as free television, pay television program, and interactive multimedia services; sells advertising in various telephone directories and on the Internet; publishes directories; and sells mobile handsets and accessories. In addition, the company offers broadcasting and related services, management and engineering support services, customer relationship management and customer contact management solutions, content for various media, and outsourced call center and data center services; and over-the-top video services under the Viu brand, as well as sells customer premises equipment and related solutions. Further, it engages in the sale, distribution, and marketing of telecommunication products; supply of broadband internet access solutions and web services; provision of data services; and software development, systems integration, consulting, and informatization activities; the provision of computer and IP/IT related value-added services to business customers; property investment, development, management, and leasing, as well as hotel management activities; and ski operations. Additionally, the company offers entertainment over-the-top platform; and digital, IT and business process outsourcing, cloud computing, hosting, managed, e-commerce, and IoT solutions. PCCW Limited was founded in 1925 and is headquartered in Quarry Bay, Hong Kong.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Quarry Bay"
    },
    "TH3B.F": {
        "short_name": "PCCW LTD CONS.",
        "long_name": "PCCW Limited",
        "summary": "PCCW Limited provides telecommunications and related services in Hong Kong, Mainland and other parts of China, Japan, and internationally. The company's services include local telephony, local data and broadband, mobile and international telecommunications, and satellite-based and network-based telecommunications services; and outsourcing, consulting, and contact center services. It also provides technical support, electronics and communications engineering, and products and solutions, as well as free television, pay television program, and interactive multimedia services; sells advertising in various telephone directories and on the Internet; publishes directories; and sells mobile handsets and accessories. In addition, the company offers broadcasting and related services, management and engineering support services, customer relationship management and customer contact management solutions, content for various media, and outsourced call center and data center services; and over-the-top video services under the Viu brand, as well as sells customer premises equipment and related solutions. Further, it engages in the sale, distribution, and marketing of telecommunication products; supply of broadband internet access solutions and web services; provision of data services; and software development, systems integration, consulting, and informatization activities; the provision of computer and IP/IT related value-added services to business customers; property investment, development, management, and leasing, as well as hotel management activities; and ski operations. Additionally, the company offers entertainment over-the-top platform; and digital, IT and business process outsourcing, cloud computing, hosting, managed, e-commerce, and IoT solutions. PCCW Limited was founded in 1925 and is headquartered in Quarry Bay, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Quarry Bay"
    },
    "UCL": {
        "short_name": "uCloudlink Group Inc.",
        "long_name": "uCloudlink Group Inc.",
        "summary": "uCloudlink Group Inc. operates as a mobile data traffic sharing marketplace in the telecommunications industry. The company provides uCloudlink 1.0, a model that focuses on cross-border travelers that need mobile data connectivity services in various countries; and operates portable Wi-Fi services under the Roamingman brand in China, Malaysia, and Singapore, which provides global mobile data connectivity services, as well as offers GlocalMe portable Wi-Fi terminals and cloud SIM architecture for mobile virtual network operators, mobile network operators (MNOs), and portable Wi-Fi terminal rental companies. It also offers uCloudlink 2.0, a model that provides mobile data connectivity services to local users through various MNOs; GlocalMe Inside, an implementation solutions for smartphones and other smart hardware terminals, which enables them to access its cloud SIM architecture and SIM card pool; and GlocalMe, a world phone series. In addition, the company provides IoT modules with GlocalMe Inside implementation to meet the demand for mobile data from various terminals, and provide integrated network solutions to its customers; SIM cards with prepaid data packages; and value added services, such as advertisement. Further, it's platform-as-a-service/ software-as-a-service offers modules, such as customer relationship management, company, and SIM card enterprise resource planning and management. The company was founded in 2014 and is headquartered in Kowloon, Hong Kong.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NGM",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Kowloon"
    },
    "XCIA.F": {
        "short_name": "CN UNICOM(HK)LTD.H ADR/10",
        "long_name": "China Unicom (Hong Kong) Limited",
        "summary": "China Unicom (Hong Kong) Limited, an investment holding company, provides cellular and fixed-line voice, and related value-added services in the People's Republic of China. It also provides broadband and other Internet-related, information communications technology, and business and data communications services. In addition, the company offers communications technology training, technical, and Internet information and value-added telecommunications services; telecommunications network construction, planning, and technical consulting services; and consultancy, survey, design, and contract services relating to information and construction projects. Further, it provides customer, project design consultation and management, property management, e-payment, venture capital investment, communications technology development and promotion, auto informatisation, financial, data processing, and tourism and information services; advertising design, production, agency, and publication services; technology development, transfer, and consulting services; and technology promotion service of intelligent transportation system's products. Additionally, the company offers technology development and consultation, and other services; technology research and development, consultation, and services of TV video and mobile video; internet of things technology, and online data processing and transaction services; and big data, and cloud computation and infrastructure services. It also provides online video and reading materials; network music; financing leasing services; and data analysis and application services, as well as sells handsets and telecommunication equipment. As of December 31, 2019, it had approximately 254 million 4G subscribers, 83 million fixed-line broadband subscribers, and 54 million fixed-line local access subscribers. The company was incorporated in 2000 and is based in Central, Hong Kong. China Unicom (Hong Kong) Limited is a subsidiary of China Unicom (BVI) Limited.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    }
}