{
    "0048.HK": {
        "short_name": "C AUTO INT DECO",
        "long_name": "China Automotive Interior Decoration Holdings Limited",
        "summary": "China Automotive Interior Decoration Holdings Limited, an investment holding company, engages in the manufacture and sale of nonwoven fabric products for use in automotive interior decoration and other parts in the People's Republic of China and Hong Kong. The company is also involved in the trade of rubber and food products. China Automotive Interior Decoration Holdings Limited was incorporated in 2009 and is headquartered in Shatin, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sha Tin",
        "zipcode": null,
        "website": "http://www.hklistco.com/48",
        "market_cap": "Nano Cap"
    },
    "0146.HK": {
        "short_name": "TAI PING CARPET",
        "long_name": "Tai Ping Carpets International Limited",
        "summary": "Tai Ping Carpets International Limited designs, manufactures, imports, exports, and sells carpets in Asia, Europe, the Middle East, the United States, and Africa. It is also involved in the manufacture and sale of yarns; sale of leather; and yarn dyeing activities. The company offers its products for luxury residential, private yachts and jets, boutique stores, corporate offices, and luxury hotels and resorts. Tai Ping Carpets International Limited was founded in 1956 and is headquartered in Cheung Sha Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Cheung Sha Wan",
        "zipcode": null,
        "website": "http://www.taipingtent.com",
        "market_cap": "Nano Cap"
    },
    "0321.HK": {
        "short_name": "TEXWINCA HOLD",
        "long_name": "Texwinca Holdings Limited",
        "summary": "Texwinca Holdings Limited engages in the production, dyeing, and sale of knitted fabrics, yarns, and garments. The company offers finished knitted fabric products in single knit, double knit, velour and polar fleece, jacquard, spandex, stripe, and flat knit areas. It also provides dyed yarn products, such as ramie/cotton, rayon/cotton, acrylic/cotton, and polyester/cotton blend yarn dyed products, as well as cotton yarn dyed products. In addition, the company retails and distributes casual apparel and accessories; and offers franchise services. Further, it is involved in the property holding and sub-letting activities; and holding of trademarks and properties. The company sells its products in the United States, Mainland China, Japan, Hong Kong, and internationally. Texwinca Holdings Limited was founded in 1975 and is headquartered in Kwai Chung, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.texwinca.com",
        "market_cap": "Small Cap"
    },
    "0420.HK": {
        "short_name": "FOUNTAIN SET",
        "long_name": "Fountain Set (Holdings) Limited",
        "summary": "Fountain Set (Holdings) Limited, an investment holding company, produces and sells knitted fabrics and garments in Hong Kong, the People's Republic of China, Taiwan, Korea, Sri Lanka, the United States, Europe, and internationally. It is involved in fabric knitting, dyeing, printing, finishing, and garment manufacturing activities. The company also offers dyed fabrics and yarns. In addition, it engages in trading dyed fabrics and yarns, dyestuffs, and chemicals, as well as garments; and the heating supply activities. The company was founded in 1969 and is headquartered in Kwai Chung, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.fshl.com",
        "market_cap": "Micro Cap"
    },
    "1382.HK": {
        "short_name": "PACIFICTEXTILES",
        "long_name": "Pacific Textiles Holdings Limited",
        "summary": "Pacific Textiles Holdings Limited, an investment holding company, engages in manufacturing and trading textile products. The company is involved in the knitting, dyeing, printing, and finishing of fabrics. Its fabrics are used in a range of garments, including men's, women's, and children's clothing, as well as sportswear, swimwear, and inner-wear. The company operates in the People's Republic of China, Vietnam, Hong Kong, the United States, Indonesia, Cambodia, Thailand, Sri Lanka, India, Haiti, Africa, and internationally. Pacific Textiles Holdings Limited was founded in 1997 and is headquartered in Kwai Chung, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.pacific-textiles.com",
        "market_cap": "Small Cap"
    },
    "1795.HK": {
        "short_name": "YADONG GROUP",
        "long_name": "Yadong Group Holdings Limited",
        "summary": "Yadong Group Holdings Limited engages in the design, processing, and sale of textile fabric products to garment manufacturers and trading companies. Its products include plain weave fabrics and corduroy fabrics. The company sells and distributes its products in China, Japan, Taiwan, Vietnam, Bangladesh, and Indonesia. Yadong Group Holdings Limited was founded in 2011 and is headquartered in Hong Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.yadongtextile.com",
        "market_cap": "Nano Cap"
    },
    "2223.HK": {
        "short_name": "CASABLANCA",
        "long_name": "Casablanca Group Limited",
        "summary": "Casablanca Group Limited, an investment holding company, designs, manufactures, distributes, and retails bedding products in Hong Kong, Macau, the People's Republic of China, and internationally. Its products include bed linens, duvets, and pillows, as well as other home accessories, such as blankets, mattresses and towels, etc. The company sells its products under the Casa Calvin, Casablanca, and CASA-V brands. It also trades in home accessories and furniture. The company was founded in 1993 and is headquartered in Sha Tin, Hong Kong. Casablanca Group Limited is a subsidiary of World Empire Investment Inc.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sha Tin",
        "zipcode": null,
        "website": "http://www.casablanca.com.hk",
        "market_cap": "Nano Cap"
    },
    "2299.HK": {
        "short_name": "BILLION IND",
        "long_name": "Billion Industrial Holdings Limited",
        "summary": "Billion Industrial Holdings Limited, together with its subsidiaries, develops, manufactures, and sells polyester filament yarns and polyester thin films primarily in the People's Republic of China. Its polyester filament yarns include drawn textured, fully drawn, and partially oriented yarns for use in the production of fabrics and textiles for various consumer products, including apparel, footwear, and home furnishings. The company offers polyester thin films, such as heat sealable, twistable, anti-static, electronic releasing, and coating films, as well as metallization, printing, transfer, electrical insulation, card lamination, hot stamping, metallic yarn, reflector, holographic, and solar base films. It also exports its products to Turkey, Italy, Belgium, Brazil, the United States, Spain, Russia, and Poland. Billion Industrial Holdings Limited was founded in 2003 and is headquartered in Wanchai, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.baihong.com",
        "market_cap": "Small Cap"
    },
    "2307.HK": {
        "short_name": "KAM HING INT'L",
        "long_name": "Kam Hing International Holdings Limited",
        "summary": "Kam Hing International Holdings Limited, an investment holding company, manufactures and sells knitted fabrics and dyed yarns in Mainland China, Korea, Hong Kong, Taiwan, Singapore, and internationally. The company operates through three segments: Fabric Products, Garment Products, and Others. It manufactures and trades in garment products. The company also provides sewage treatment, and air and ocean freight handling services; subcontracting; and corporate management, sales planning, and consultancy services. In addition, it engages in the trading of yarns, dyeing materials, and finished fabrics; and property holding and mining activities. The company was founded in 1996 and is headquartered in Tsuen Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsuen Wan",
        "zipcode": null,
        "website": "http://www.kamhingintl.com",
        "market_cap": "Nano Cap"
    },
    "2313.HK": {
        "short_name": "SHENZHOU INTL",
        "long_name": "Shenzhou International Group Holdings Limited",
        "summary": "Shenzhou International Group Holdings Limited, an investment holding company, engages in manufacturing, processing, and selling knitwear products. It produces and sells sportswear, casual wear, and lingerie wear. The company is also involved in the import and export of commodities; quality check of garments; print and sale of knitwear products; trading and retail businesses; aircraft leasing; and property management and leasing activities. It offers its products in Mainland China, European Union, the United States, Japan, and internationally. The company was incorporated in 2005 and is based in Kowloon, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.shenzhouintl.com",
        "market_cap": "Large Cap"
    },
    "2678.HK": {
        "short_name": "TEXHONG TEXTILE",
        "long_name": "Texhong Textile Group Limited",
        "summary": "Texhong Textile Group Limited, an investment holding company, primarily manufactures and sells yarns, grey fabrics, and non-woven and garment fabrics. It also offers dyed clothes and dresses, dyed and denim fabrics, finished woven fabrics, threads, textile knitting products, special textile for construction, decoration products, and garments. In addition, the company processes cotton; and trades in textile products. It sells its products in the People's Republic of China, Vietnam, Turkey, North America, Europe, Brazil, Bangladesh, Japan, South Korea, and internationally. The company was founded in 1997 and is headquartered in Tsuen Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsuen Wan",
        "zipcode": null,
        "website": "http://www.texhong.com",
        "market_cap": "Small Cap"
    },
    "2BL.F": {
        "short_name": "BILLION INDUS.HLDGS HD-01",
        "long_name": "Billion Industrial Holdings Limited",
        "summary": "Billion Industrial Holdings Limited, together with its subsidiaries, develops, manufactures, and sells polyester filament yarns and polyester thin films primarily in the People's Republic of China. Its polyester filament yarns include drawn textured, fully drawn, and partially oriented yarns for use in the production of fabrics and textiles for various consumer products, including apparel, footwear, and home furnishings. The company offers polyester thin films, such as heat sealable, twistable, anti-static, electronic releasing, and coating films, as well as metallization, printing, transfer, electrical insulation, card lamination, hot stamping, metallic yarn, reflector, holographic, and solar base films. It also exports its products to Turkey, Italy, Belgium, Brazil, the United States, Spain, Russia, and Poland. Billion Industrial Holdings Limited was founded in 2003 and is headquartered in Wanchai, Hong Kong.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.baihong.com",
        "market_cap": "Small Cap"
    },
    "3608.HK": {
        "short_name": "YONGSHENG MAT",
        "long_name": "Yongsheng Advanced Materials Company Limited",
        "summary": "Yongsheng Advanced Materials Company Limited, an investment holding company, engages in the textile and advanced material-related businesses in Hong Kong, Mainland China, and internationally. It operates through three segments: Processing, Property Investment, and (Renovation, Maintenance, Alternation and Additional) RMAA Services. The Processing segment involved in the dyeing and processing of differentiated polyester filament fabrics. The Property Investment segment invests in, develops, and sells properties. The RMAA Services segment provides construction services, such as building construction; maintenance and improvement works; and renovation and decoration works. Yongsheng Advanced Materials Company Limited was founded in 1997 and is headquartered in Admiralty, Hong Kong. Yongsheng Advanced Materials Company Limited is a subsidiary of Ever Thrive Global Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.chinaysgroup.com",
        "market_cap": "Micro Cap"
    },
    "8211.HK": {
        "short_name": "ZHEJIANG YONGAN",
        "long_name": "Zhejiang Yongan Rongtong Holdings Co., Ltd.",
        "summary": "Zhejiang Yongan Rongtong Holdings Co., Ltd., together with its subsidiaries, manufactures and sells woven fabrics in the People's Republic of China. It offers cotton, polyester, spandex, T/R, and fashion fabrics. The company also provides woven fabrics subcontracting; and asset management and investment advisory services. It also exports its products to the United States, Europe, Japan, South Africa, and Arabic countries. The company was formerly known as Zhejiang Yonglong Enterprises Co., Ltd. and changed its name to Zhejiang Yongan Rongtong Holdings Co., Ltd. in May 2017. The company was founded in 1998 and is headquartered in Wanchai, Hong Kong. Zhejiang Yongan Rongtong Holdings Co., Ltd. is a subsidiary of Guizhou Yongan Finance Holdings Company Ltd.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.zj-yongan.com",
        "market_cap": "Nano Cap"
    },
    "FOV.F": {
        "short_name": "FOUNTAIN SET (HLDGS)",
        "long_name": "Fountain Set (Holdings) Limited",
        "summary": "Fountain Set (Holdings) Limited, an investment holding company, produces and sells knitted fabrics and garments in Hong Kong, the People's Republic of China, Taiwan, Korea, Sri Lanka, the United States, Europe, and internationally. It is involved in fabric knitting, dyeing, printing, finishing, and garment manufacturing activities. The company also offers dyed fabrics and yarns. In addition, it engages in trading dyed fabrics and yarns, dyestuffs, and chemicals, as well as garments; and the heating supply activities. The company was founded in 1969 and is headquartered in Kwai Chung, Hong Kong.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.fshl.com",
        "market_cap": "Micro Cap"
    },
    "MHI.AX": {
        "short_name": "MERCHANT FPO 1C",
        "long_name": "Merchant House International Limited",
        "summary": "Merchant House International Limited designs, manufactures, and markets home textiles, seasonal and decorative products, and leather shoes. It operates through Home Textile, Footwear Trading, and Footwear Manufacturing segments. The company offers kitchen items, table tops, decorative pillows, seasonal decorations, and kitchen rugs; and footwear products, such as work, safety toe, security, motorcycle, hunting, farm and ranch, and western boots, as well as loggers and waterproof footwear for men. It also engages in the export trading of work boots and safety shoes. The company sells its products in the United States, Australia, China, Hong Kong, and internationally. Merchant House International Limited was founded in 1978 and is headquartered in Chai Wan, Hong Kong.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Chai Wan",
        "zipcode": null,
        "website": "http://www.lorettalee.com.hk",
        "market_cap": "Nano Cap"
    },
    "S6L.F": {
        "short_name": "SHENZHOU I.G.H.REGS HD-10",
        "long_name": "Shenzhou International Group Holdings Limited",
        "summary": "Shenzhou International Group Holdings Limited, an investment holding company, engages in manufacturing, processing, and selling knitwear products. It produces and sells sportswear, casual wear, and lingerie wear. The company is also involved in the import and export of commodities; quality check of garments; print and sale of knitwear products; trading and retail businesses; aircraft leasing; and property management and leasing activities. It offers its products in Mainland China, European Union, the United States, Japan, and internationally. The company was incorporated in 2005 and is based in Kowloon, Hong Kong.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.shenzhouintl.com",
        "market_cap": "Large Cap"
    },
    "SHZHY": {
        "short_name": "SHENZHOU INTERNATIONAL GROUP HL",
        "long_name": "Shenzhou International Group Holdings Limited",
        "summary": "Shenzhou International Group Holdings Limited, an investment holding company, engages in manufacturing, processing, and selling knitwear products. It produces and sells sportswear, casual wear, and lingerie wear. The company is also involved in the import and export of commodities; quality check of garments; print and sale of knitwear products; trading and retail businesses; aircraft leasing; and property management and leasing activities. It offers its products in Mainland China, European Union, the United States, Japan, and internationally. The company was incorporated in 2005 and is based in Kowloon, Hong Kong.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.shenzhouintl.com",
        "market_cap": "Large Cap"
    },
    "TXW.F": {
        "short_name": "TEXWINCA HLDGS LTD HD-,05",
        "long_name": "Texwinca Holdings Limited",
        "summary": "Texwinca Holdings Limited engages in the production, dyeing, and sale of knitted fabrics, yarns, and garments. The company offers finished knitted fabric products in single knit, double knit, velour and polar fleece, jacquard, spandex, stripe, and flat knit areas. It also provides dyed yarn products, such as ramie/cotton, rayon/cotton, acrylic/cotton, and polyester/cotton blend yarn dyed products, as well as cotton yarn dyed products. In addition, the company retails and distributes casual apparel and accessories; and offers franchise services. Further, it is involved in the property holding and sub-letting activities; and holding of trademarks and properties. The company sells its products in the United States, Mainland China, Japan, Hong Kong, and internationally. Texwinca Holdings Limited was founded in 1975 and is headquartered in Kwai Chung, Hong Kong.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.texwinca.com",
        "market_cap": "Small Cap"
    },
    "VI3.F": {
        "short_name": "VICTORY CITY INTL HD -1",
        "long_name": "Victory City International Holdings Limited",
        "summary": "Victory City International Holdings Limited, an investment holding company, produces and sells knitted fabrics, dyed yarns, and garment products. The company provides fabric knitting, bleaching, dyeing, and finishing services, as well as related subcontracting services. Its fabric products include jersey, double knit, fleece, jacquard, lacoste, rib, striped, velour, and polarfleece products. In addition, the company engages in the provision of management services; trading of knitted fabrics, dyed yarns, and garment products and accessories; and chemical mixing activities. It has operations in Hong Kong, Macau, the People's Republic of China, South Korea, the United States, Bangladesh, Taiwan, Singapore, Vietnam, Indonesia, the United Arab Emirates, Canada, India, Mexico, Thailand, Germany, and internationally. Victory City International Holdings Limited was founded in 1983 and is headquartered in Tuen Mun, Hong Kong.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tuen Mun",
        "zipcode": null,
        "website": "http://www.victorycity.com.hk",
        "market_cap": "Nano Cap"
    },
    "WHE.F": {
        "short_name": "PACIFIC TEXTIL.HD HK-,001",
        "long_name": "Pacific Textiles Holdings Limited",
        "summary": "Pacific Textiles Holdings Limited, an investment holding company, engages in manufacturing and trading textile products. The company is involved in the knitting, dyeing, printing, and finishing of fabrics. Its fabrics are used in a range of garments, including men's, women's, and children's clothing, as well as sportswear, swimwear, and inner-wear. The company operates in the People's Republic of China, Vietnam, Hong Kong, the United States, Indonesia, Cambodia, Thailand, Sri Lanka, India, Haiti, Africa, and internationally. Pacific Textiles Holdings Limited was founded in 1997 and is headquartered in Kwai Chung, Hong Kong.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.pacific-textiles.com",
        "market_cap": "Small Cap"
    }
}