{
    "0257.HK": {
        "short_name": "EB ENVIRONMENT",
        "long_name": "China Everbright Environment Group Limited",
        "summary": "China Everbright Environment Group Limited, an investment holding company, provides environmental solutions worldwide. The company's Environmental Energy Project Construction and Operation segment constructs and operates food waste and leachate treatment, sludge treatment and disposal, methane-to-energy, fecal treatment, fly ash landfill, medical waste treatment, and solid waste treatment projects, as well as waste-to-energy plants. Its Greentech Project Construction and Operation segment constructs and operates integrated biomass utilization, hazardous and solid waste treatment, and solar energy and wind power projects, as well as offers environmental remediation services. The company's Environmental Water Project Construction and Operation segment constructs, upgrades, and operates waste water treatment, water supply, reusable water and sludge harmless treatment, sponge city construction, river-basin ecological restoration, waste water source heat pump, and leachate treatment projects. This segment also researches and develops water environment technologies and engineering projects. Its Others segment conducts environmental protection technology research and development projects; provides environmental related technological, and protection project equipment construction and installation services; designs environmental protection projects; and sells related equipment. This segment also offers waste sorting, renewable resources utilization, and sanitation operation services; sells energy-saving street lamps; and provides energy management contract projects. It also operates biomass electricity and heat cogeneration projects; collects and treats municipal wastes; and provides survey, mapping, design, and consultancy services for municipal projects. The company was formerly known as China Everbright International Limited and changed its name to China Everbright Environment Group Limited in September 2020. The company was incorporated in 1961 and is headquartered in Hong Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.cebenvironment.com",
        "market_cap": "Mid Cap"
    },
    "0XC.F": {
        "short_name": "CANVEST ENVIR.PR.G.HD-,01",
        "long_name": "Canvest Environmental Protection Group Company Limited",
        "summary": "Canvest Environmental Protection Group Company Limited, an investment holding company, engages in the development, construction, operation, and management of waste-to-energy plants in the People's Republic of China. It also provides environmental hygiene and related services. As of March 23, 2021, the company had 34 operating, secured, announced, and managed projects; and processing capacity of municipal solid waste of 51,140 tonnes. In addition, it provides municipal solid waste handling, human resources and administrative, transportation, cleaning and waste management, and consultancy services; and engages in the operation and management of smart car parking. The company was founded in 2003 and is based in Kowloon, Hong Kong. Canvest Environmental Protection Group Company Limited is a subsidiary of Best Approach Developments Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.canvestenvironment.com",
        "market_cap": "Small Cap"
    },
    "1196.HK": {
        "short_name": "REALORD GROUP",
        "long_name": "Realord Group Holdings Limited",
        "summary": "Realord Group Holdings Limited, an investment holding company, engages in the commercial printing, hangtag, motor vehicles parts, financial service, trading, property, and environmental protection businesses in the People's Republic of China, Hong Kong, Japan, and internationally. The company's Commercial Printing segment provides financial printing services, including bilingual typesetting, creative design, color separation, media placement, pressing, text editing, translation, Web hosting, and VDR services, as well as digital printing and other related services. Its Hangtag segment sells hangtags, labels, shirt paper boards, and plastic bags to manufacturers of consumer products. The company's Motor Vehicle Parts segment distributes and sells motor vehicle parts. Its Financial Services segment provides corporate finance advisory, asset management, securities brokerage services, and margin financing services. Its Property Investment segment develops and invests in properties. The company's Environmental Protection segment is involved in dismantling and trading of scrap materials. It also provides financial leasing, money lending, and conference services; trades in electronic products and computer components; and develops and sells e-commerce platform. The company was formerly known as Cheong Ming Investments Limited and changed its name to Realord Group Holdings Limited in September 2014. The company is headquartered in Central, Hong Kong. Realord Group Holdings Limited is a subsidiary of Manureen Holdings Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.realord.com.hk",
        "market_cap": "Mid Cap"
    },
    "1381.HK": {
        "short_name": "CANVEST ENV",
        "long_name": "Canvest Environmental Protection Group Company Limited",
        "summary": "Canvest Environmental Protection Group Company Limited, an investment holding company, engages in the development, construction, operation, and management of waste-to-energy plants in the People's Republic of China. It also provides environmental hygiene and related services. As of March 23, 2021, the company had 34 operating, secured, announced, and managed projects; and processing capacity of municipal solid waste of 51,140 tonnes. In addition, it provides municipal solid waste handling, human resources and administrative, transportation, cleaning and waste management, and consultancy services; and engages in the operation and management of smart car parking. The company was founded in 2003 and is based in Kowloon, Hong Kong. Canvest Environmental Protection Group Company Limited is a subsidiary of Best Approach Developments Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.canvestenvironment.com",
        "market_cap": "Small Cap"
    },
    "1397.HK": {
        "short_name": "BAGUIO GREEN",
        "long_name": "Baguio Green Group Limited",
        "summary": "Baguio Green Group Limited, an investment holding company, provides environmental and related services in Hong Kong. It operates through four segments: Cleaning Services Business, Landscaping Services Business, Pest Management Business, and Waste Management and Recycling Business. The company offers cleaning services for commercial and industrial buildings, residential premises, and public hygiene; pest control services, such as integrated pest management, termite control, and leisure places pest control; and landscaping services, including horticultural and lawn maintenance services, as well as supplies landscape materials. It also provides landscape engineering services, such as tree survey and assessment, turfing, and landscape design; and waste management services comprises materials recovery, as well as undertakes construction and other waste management projects. In addition, the company offers automobile repair and plant nursing services; and develops and explores for green technology products. It serves household clients, multinational corporations, semi-government organizations, and government departments. The company was founded in 1980 and is headquartered in Lai Chi Kok, Hong Kong. Baguio Green Group Limited is a subsidiary of Baguio Green (Holding) Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Lai Chi Kok",
        "zipcode": null,
        "website": "http://www.baguio.com.hk",
        "market_cap": "Nano Cap"
    },
    "6805.HK": {
        "short_name": "KIMOU ENVIRON",
        "long_name": "Kimou Environmental Holding Limited",
        "summary": "Kimou Environmental Holding Limited engages in the development and management of electroplating industrial parks in the People's Republic of China. The company operates through three segments: Rental and Facilities Usage, Wastewater Treatment and Utilities, and Sales of Goods and Ancillary Business. The Rental and Facilities Usage segment conducts industrial park property development and management business. The Wastewater Treatment and Utilities Business segment operates electroplating wastewater treatment plants and provides utilities services. The Sales of Goods and Ancillary Business segment sells raw materials and provides environmental services. It operates two electroplating industrial parks, including the Guangdong Huizhou Park and the Tianjin Bingang Park. Kimou Environmental Holding Limited was founded in 2004 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.platingbase.com",
        "market_cap": "Micro Cap"
    },
    "6812.HK": {
        "short_name": "WINSON HLDGS HK",
        "long_name": "Winson Holdings Hong Kong Limited",
        "summary": "Winson Holdings Hong Kong Limited, an investment holding company, provides environmental hygiene and related, and airline catering support services in Hong Kong. It offers environmental hygiene services, including public area and office cleaning, and waste disposal, as well as specialized services, such as external curtain wall and window cleaning, marble floor maintenance and restoration, intensive cleaning, pest control services, etc. to residential, commercial and shopping complexes, public utilities, transportation systems, and government bodies. The company also provides pest control services comprising indoor pest management and rodent prevention, as well as control services that involve spraying of pesticides and fogging treatment, etc. to a range of customers, including government departments, educational institutes, public utilities, and transportation systems, as well as residential, commercial, and shopping complexes. In addition, it offers airline catering support services, such as plating of meals, tray-setting, dry store packing, internal logistic for equipment flow, etc. at flight kitchens of airline catering operators. Further, the company provides property holding services. The company was founded in 1983 and is headquartered in Tsuen Wan, Hong Kong. Winson Holdings Hong Kong Limited is a subsidiary of Sze's Holdings Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsuen Wan",
        "zipcode": null,
        "website": "http://www.winsongrouphk.com",
        "market_cap": "Nano Cap"
    },
    "8309.HK": {
        "short_name": "MANSHING GLOBAL",
        "long_name": "Man Shing Global Holdings Limited",
        "summary": "Man Shing Global Holdings Limited, an investment holding company, provides environmental cleaning services in Hong Kong. The company offers street cleaning solutions, which include street and public area, and refuse collection point cleaning, as well as pest control; building cleaning services, including general building cleaning, refuse collection and waste disposal, toilet cleaning, and janitorial services; and bus and ferry cleaning services, such as general depot and pier cleaning, vehicle and vessel cleaning, refuse collection and waste disposal, and toilet cleaning. It also provides other cleaning services comprising sewage management and fumigation services, as well as external wall and window, and confined space cleaning services. The company serves government, private, and public transport sector customers. Man Shing Global Holdings Limited was founded in 1987 and is headquartered in Kwai Chung, Hong Kong.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.manshing.com.hk",
        "market_cap": "Nano Cap"
    },
    "8320.HK": {
        "short_name": "AEC GROUP",
        "long_name": "Allied Sustainability and Environmental Consultants Group Limited",
        "summary": "Allied Sustainability and Environmental Consultants Group Limited, an investment holding company, provides environmental consulting services in the People's Republic of China. The company operates through four segments: Green Building Certification Consultancy; Sustainability and Environmental Consultancy; Acoustic, Noise and Vibration Control and Audio-Visual Design Consultancy; and Environmental, Social and Governance (ESG) Reporting and Consultancy. It offers green building certification consultancy services for commercial, residential, and industrial buildings; hotels; data centers; and public usage buildings; and sustainability and environmental consultancy services, which engage in the process of environmental impact assessment to identify, predict, evaluate, and mitigate the biophysical, social, and other relevant effects of property development proposal. The company also provides acoustic analysis, design, and control in various kinds of spaces and buildings; ESG reporting and consultancy services, including ESG readiness assessment, developing reports for compliance and enhancement solutions, training to management and employees in various formats, assurance services, and translation services from English to Chinese; and other consultancy services. Allied Sustainability and Environmental Consultants Group Limited was founded in 1994 and is based in Wan Chai, Hong Kong. Allied Sustainability and Environmental Consultants Group Limited is a subsidiary of Gold Investments Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.asecg.com",
        "market_cap": "Nano Cap"
    },
    "8472.HK": {
        "short_name": "LAPCO HOLDINGS",
        "long_name": "Lapco Holdings Limited",
        "summary": "Lapco Holdings Limited, an investment holding company, provides environmental hygiene services in Hong Kong. The company offers cleaning, pest management, waste management and recycling, and landscaping services to a range of venues, including commercial buildings, markets, restaurants, and academic institutions, as well as streets, cultural, leisure, recreational, and residential premises. It serves government departments, property management companies, and other corporations in the private sector. The company was founded in 1990 and is headquartered in Kowloon Bay, Hong Kong. Lapco Holdings Limited is a subsidiary of Gold Cavaliers International Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon Bay",
        "zipcode": null,
        "website": "http://www.lapco.com.hk",
        "market_cap": "Nano Cap"
    },
    "BJG.F": {
        "short_name": "BEIJING ENTERPRIS.ENV.GR.",
        "long_name": "Beijing Enterprises Environment Group Limited",
        "summary": "Beijing Enterprises Environment Group Limited, an investment holding company, engages in the solid waste treatment business in Hong Kong and Mainland China. It operates in two segments, Solid Waste Treatment and Landscaping Services. The company is involved in the construction and operation of household waste incineration plants, as well as hazardous and medical waste treatment activities; and the sale of electricity and steam generated from waste incineration. It also engages in the provision of the design, construction, and project survey activities; and design and construction of project management services. In addition, the company invests in properties. The company was formerly known as Beijing Development (Hong Kong) Limited and changed its name to Beijing Enterprises Environment Group Limited in July 2016. Beijing Enterprises Environment Group Limited was incorporated in 1963 and is based in Wanchai, Hong Kong. Beijing Enterprises Environment Group Limited is a subsidiary of Idata Finance Trading Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.beegl.com.hk",
        "market_cap": "Micro Cap"
    },
    "CHFFF": {
        "short_name": "CHINA EVERBRIGHT ENVIRONMENT GR",
        "long_name": "China Everbright Environment Group Limited",
        "summary": "China Everbright Environment Group Limited, an investment holding company, provides environmental solutions worldwide. The company's Environmental Energy Project Construction and Operation segment constructs and operates food waste and leachate treatment, sludge treatment and disposal, methane-to-energy, fecal treatment, fly ash landfill, medical waste treatment, and solid waste treatment projects, as well as waste-to-energy plants. Its Greentech Project Construction and Operation segment constructs and operates integrated biomass utilization, hazardous and solid waste treatment, and solar energy and wind power projects, as well as offers environmental remediation services. The company's Environmental Water Project Construction and Operation segment constructs, upgrades, and operates waste water treatment, water supply, reusable water and sludge harmless treatment, sponge city construction, river-basin ecological restoration, waste water source heat pump, and leachate treatment projects. This segment also researches and develops water environment technologies and engineering projects. Its Others segment conducts environmental protection technology research and development projects; provides environmental related technological, and protection project equipment construction and installation services; designs environmental protection projects; and sells related equipment. This segment also offers waste sorting, renewable resources utilization, and sanitation operation services; sells energy-saving street lamps; and provides energy management contract projects. It also operates biomass electricity and heat cogeneration projects; collects and treats municipal wastes; and provides survey, mapping, design, and consultancy services for municipal projects. The company was formerly known as China Everbright International Limited and changed its name to China Everbright Environment Group Limited in September 2020. The company was incorporated in 1961 and is headquartered in Hong Kong, Hong Kong.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.cebenvironment.com",
        "market_cap": "Mid Cap"
    },
    "CHFFY": {
        "short_name": "CHINA EVERBRIGHT ENVIRONMENT GR",
        "long_name": "China Everbright Environment Group Limited",
        "summary": "China Everbright Environment Group Limited, an investment holding company, provides environmental solutions worldwide. The company's Environmental Energy Project Construction and Operation segment constructs and operates food waste and leachate treatment, sludge treatment and disposal, methane-to-energy, fecal treatment, fly ash landfill, medical waste treatment, and solid waste treatment projects, as well as waste-to-energy plants. Its Greentech Project Construction and Operation segment constructs and operates integrated biomass utilization, hazardous and solid waste treatment, and solar energy and wind power projects, as well as offers environmental remediation services. The company's Environmental Water Project Construction and Operation segment constructs, upgrades, and operates waste water treatment, water supply, reusable water and sludge harmless treatment, sponge city construction, river-basin ecological restoration, waste water source heat pump, and leachate treatment projects. This segment also researches and develops water environment technologies and engineering projects. Its Others segment conducts environmental protection technology research and development projects; provides environmental related technological, and protection project equipment construction and installation services; designs environmental protection projects; and sells related equipment. This segment also offers waste sorting, renewable resources utilization, and sanitation operation services; sells energy-saving street lamps; and provides energy management contract projects. It also operates biomass electricity and heat cogeneration projects; collects and treats municipal wastes; and provides survey, mapping, design, and consultancy services for municipal projects. The company was formerly known as China Everbright International Limited and changed its name to China Everbright Environment Group Limited in September 2020. The company was incorporated in 1961 and is headquartered in Hong Kong, Hong Kong.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.cebenvironment.com",
        "market_cap": "Mid Cap"
    },
    "CNE.F": {
        "short_name": "CHINA EVERBRIGHT EN.GRP.",
        "long_name": "China Everbright Environment Group Limited",
        "summary": "China Everbright Environment Group Limited, an investment holding company, provides environmental solutions worldwide. The company's Environmental Energy Project Construction and Operation segment constructs and operates food waste and leachate treatment, sludge treatment and disposal, methane-to-energy, fecal treatment, fly ash landfill, medical waste treatment, and solid waste treatment projects, as well as waste-to-energy plants. Its Greentech Project Construction and Operation segment constructs and operates integrated biomass utilization, hazardous and solid waste treatment, and solar energy and wind power projects, as well as offers environmental remediation services. The company's Environmental Water Project Construction and Operation segment constructs, upgrades, and operates waste water treatment, water supply, reusable water and sludge harmless treatment, sponge city construction, river-basin ecological restoration, waste water source heat pump, and leachate treatment projects. This segment also researches and develops water environment technologies and engineering projects. Its Others segment conducts environmental protection technology research and development projects; provides environmental related technological, and protection project equipment construction and installation services; designs environmental protection projects; and sells related equipment. This segment also offers waste sorting, renewable resources utilization, and sanitation operation services; sells energy-saving street lamps; and provides energy management contract projects. It also operates biomass electricity and heat cogeneration projects; collects and treats municipal wastes; and provides survey, mapping, design, and consultancy services for municipal projects. The company was formerly known as China Everbright International Limited and changed its name to China Everbright Environment Group Limited in September 2020. The company was incorporated in 1961 and is headquartered in Hong Kong, Hong Kong.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.cebenvironment.com",
        "market_cap": "Mid Cap"
    },
    "CUV.F": {
        "short_name": "REALORD GRP HLDGS HD -,10",
        "long_name": "Realord Group Holdings Limited",
        "summary": "Realord Group Holdings Limited, an investment holding company, engages in the commercial printing, hangtag, motor vehicles parts, financial service, trading, property, and environmental protection businesses in the People's Republic of China, Hong Kong, Japan, and internationally. The company's Commercial Printing segment provides financial printing services, including bilingual typesetting, creative design, color separation, media placement, pressing, text editing, translation, Web hosting, and VDR services, as well as digital printing and other related services. Its Hangtag segment sells hangtags, labels, shirt paper boards, and plastic bags to manufacturers of consumer products. The company's Motor Vehicle Parts segment distributes and sells motor vehicle parts. Its Financial Services segment provides corporate finance advisory, asset management, securities brokerage services, and margin financing services. Its Property Investment segment develops and invests in properties. The company's Environmental Protection segment is involved in dismantling and trading of scrap materials. It also provides financial leasing, money lending, and conference services; trades in electronic products and computer components; and develops and sells e-commerce platform. The company was formerly known as Cheong Ming Investments Limited and changed its name to Realord Group Holdings Limited in September 2014. The company is headquartered in Central, Hong Kong. Realord Group Holdings Limited is a subsidiary of Manureen Holdings Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.realord.com.hk",
        "market_cap": "Small Cap"
    }
}