{"DAGI.IS": {"short_name": "DAGI GIYIM", "long_name": "Dagi Giyim Sanayi ve Ticaret A.S.", "summary": "Dagi Giyim Sanayi ve Ticaret A.S. operates in the garment industry in Turkey and internationally. It primarily produces and sells underwear, nighties, dresses, T-shirts, trousers, capri, shorts, sweatshirts, sportswear, thermal bottom and tops, maternity nightgowns, swimsuits, socks, and beach and household products for men, women, and children. The company sells its products through online and retail stores. Dagi Giyim Sanayi ve Ticaret A.S. was founded in 1984 and is based in Istanbul, Turkey.", "currency": "TRY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "IST", "market": "tr_market", "country": "Turkey", "city": "Istanbul"}, "DERAS.IS": {"short_name": "DERLUKS DERI", "long_name": "Derluks Deri Sanayi ve Ticaret Anonim Sirketi", "summary": "Derluks Deri Sanayi ve Ticaret Anonim Sirketi engages in the manufacture, buying, sale, import, and export of leather garments, leather accessories, and use products for men, women, and children. The company also offers natural leather, textile, knitwear, and bay clothing, as well as clothing accessories, leather and textile raw materials, and weaving products. In addition, it engages in the import, export, and trading of chemicals, fabrics, natural leather, artificial leather, yarn, and garment materials. The company was founded in 2002 and is based in Istanbul, Turkey.", "currency": "TRY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "IST", "market": "tr_market", "country": "Turkey", "city": "Istanbul"}, "RODRG.IS": {"short_name": "RODRIGO TEKSTIL", "long_name": "Rodrigo Tekstil Sanayi ve Ticaret A.S.", "summary": "Rodrigo Tekstil Sanayi ve Ticaret A.S. provides apparel, footwear, and accessories for men in Turkey. The company's products include T-shirts, polo shirts, shirts, sweats, sweaters, knit wares, jeans trousers, trousers, tracksuits, jackets, raincoats, coats, and vests. It also offers casual and sports shoes; and accessories, including boxers, wallets, belts, socks, bags, shorts, and perfumes. The company operates retail stores. The company was formerly known as Rodrigo Tekstil Turizm Insaat Gida Ticaret ve Sanayi Anonim Sirketi and changed its name to Rodrigo Tekstil Sanayi ve Ticaret A.S. in July 2012. Rodrigo Tekstil Sanayi ve Ticaret A.S. was founded in 1993 and is based in Istanbul, Turkey.", "currency": "TRY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "IST", "market": "tr_market", "country": "Turkey", "city": "Istanbul"}}