{
  "BIZIM.IS": {
    "city": "Istanbul",
    "country": "Turkey",
    "currency": "TRY",
    "exchange": "IST",
    "industry": "Department Stores",
    "long_name": "Bizim Toptan Satis Magazalari A.S.",
    "market": "tr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "BIZIM MAGAZALARI",
    "state": null,
    "summary": "Bizim Toptan Satis Magazalari A.S. wholesales and retails of fast moving consumer goods in Turkey. The company offers dry food, delicatessen and breakfast products; paper products; home supplies and care products, hand tools, communication, meat and meat products, milk and dairy products, fruits and vegetables, beverages, cosmetics and personal care products, cleaning products, electronic and electrical appliances, energy and lighting, office and stationery, and snacks and bakery products to wholesalers, merchants, grocers, markets, supermarkets, specialized retailers, hotels, restaurants, and cafes, as well as to tax payers and legal entities, such as small dealers, small markets, canteens, catering companies, corporate customers, and industrial and public organizations. It wholesales approximately 7000 product types consisting of branded and private label products. The company sells its product through Bizimtoptan.com.tr, a digital sales platform. As of March 31, 2019, it had 175 stores in 69 cities; and 801 franchise shops. The company was founded in 2001 and is based in Istanbul, Turkey. Bizim Toptan Satis Magazalari A.S. is a subsidiary of Yildiz Holding A.S.",
    "website": "http://www.bizimtoptan.com.tr",
    "zipcode": "34662"
  },
  "SOKM.IS": {
    "city": "Istanbul",
    "country": "Turkey",
    "currency": "TRY",
    "exchange": "IST",
    "industry": "Department Stores",
    "long_name": "Sok Marketler Ticaret A.S.",
    "market": "tr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SOK MARKETLER TICARET",
    "state": null,
    "summary": "Sok Marketler Ticaret A.S. operates in retail sector in Turkey. It sells fast-moving consuming products, such as dairy products, pasta, flour, semolina, ground rice and starch products, cleaning products, peanuts, hair dye products, and baby products; make-up products comprise lipsticks, blushers, mascaras, and beauty balms; chocolate products, including Madlen chocolates, biscuits, and chocolate-coated wafers; and cooking ingredients, deli, fruits and vegetables, kitchenware, cleaners, paper products, and clothing. The company operates approximately 8,145 stores in 81 provinces of Turkey. Sok Marketler Ticaret A.S. was founded in 1995 and is based in Istanbul, Turkey.",
    "website": "http://www.sokmarket.com.tr",
    "zipcode": null
  }
}
