{
    "BAYRK.IS": {
        "short_name": "BAYRAK TABAN SANAYI",
        "long_name": "Bayrak EBT Taban Sanayi ve Ticaret Anonim Sirketi",
        "summary": "Bayrak Ebt Taban Sanayi Ve Ticaret Anonim Sirketi engages in manufacturing PVC and thermo shoe soles for various brands. The company is based in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34528",
        "website": "http://bayrakebt.com.tr",
        "market_cap": "Small Cap"
    },
    "DERIM.IS": {
        "short_name": "DERIMOD",
        "long_name": "Derimod Konfeksiyon Ayakkabi Deri Sanayi ve Ticaret A.S.",
        "summary": "Derimod Konfeksiyon Ayakkabi Deri Sanayi ve Ticaret A.S. provides leather and fashionable products for men and women in Turkey and internationally. Its products include leather jackets and coats, bags, cross body bags, loafers, backpacks, waist bags, shoulder bags, briefcases, clutch and portfolio products, purses/wallets, wristlets, gloves, slippers, casual and classic shoes, shoe care products and accessories, belts, boots, sports shoes and sneakers, heels, and flat and heeled sandals. The company also operates stores. Derimod Konfeksiyon Ayakkabi Deri Sanayi ve Ticaret A.S. was founded in 1974 and is based in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": null,
        "website": "http://www.derimod.com.tr",
        "market_cap": "Small Cap"
    },
    "DESA.IS": {
        "short_name": "DESA DERI",
        "long_name": "Desa Deri Sanayi ve Ticaret A.S.",
        "summary": "Desa Deri Sanayi ve Ticaret A.S. manufactures, imports, and export, and sells leather and leather products primarily in Turkey. The company offers ready-to-wear, bags, shoes, and various leather craft products for men and women. It markets and sells its products through 132 retail stores, including 63 Desa, 39 Desa Samsonite, 3 Desa franchise, 2 Albania franchise, 17 Samsonite JV, 3 Tumi, and 5 virtual stores; 2 Desa franchise store in Albania; and 109 overseas stores. The company was founded in 1972 and is headquartered in Istanbul, Turkey. Desa Deri Sanayi ve Ticaret A.S. is a subsidiary of Ã\u0087elet Holding A.S.",
        "currency": "TRY",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34295",
        "website": "http://www.desa.com.tr",
        "market_cap": "Small Cap"
    }
}