{
    "FLAP.IS": {
        "short_name": "FLAP KONGRE TOPLANTI HIZ.",
        "long_name": "Flap Kongre Toplanti Hizmetleri Otomotiv ve Turizm A.S.",
        "summary": "Flap Kongre Toplanti Hizmetleri Otomotiv ve Turizm A.S. plans and organizes events and meetings under Flap Tour brand name for the tourism industry. The company organizes product launch meetings, education meetings, dealers meetings, and corporate opening organizations. It is also involved in organizing press meetings and bulletins; and the preparation of the printed materials for presentations. In addition, the company offers association management services, such as general management and secretariat, membership succeeding, course and seminar organizations, finance and budget management, and Web services; and IT and graphic design services, including logo and visual projects for congress and meetings, design and printing of printed materials, online abstract module software, electronic poster module software, congress registration and accommodation module software, and internal use web server and customizable software options. Further, it provides ticketing services; and tracks payments and contracts of the hotel projects. The company was founded in 1993 and is headquartered in Ankara, Turkey.",
        "currency": "TRY",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Ankara",
        "zipcode": null,
        "website": "http://www.flaptour.com.tr",
        "full_time_employees": 36
    },
    "NTHOL.IS": {
        "short_name": "NET HOLDING",
        "long_name": "Net Holding A.S.",
        "summary": "Net Holding A.S. engages in tourism and publishing activities in Turkey, Croatia, Bulgaria, Azerbaijan, Montenegro, and the Turkish Republic of Northern Cyprus. The company engages in the hotel and accommodation, touristic shopping, duty-free store management, and parking area businesses; and car rental, airport transfer, private jet charter, helicopter tour, other tour services businesses. It also publishes books and newspapers, as well as provides bookstore and stationery products and sells jewel. In addition, the company offers food and beverages products; and consulting services related to financing, investment, organization, and marketing and sales. Further, it engages in construction, agriculture activities, and casino management. The company was founded in 1974 and is based in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34337",
        "website": "http://www.netholding.com",
        "full_time_employees": 4071
    }
}