{
    "JEL.L": {
        "short_name": "JERSEY ELECTRICITY PLC 'A'ORD 5",
        "long_name": "Jersey Electricity plc",
        "summary": "Jersey Electricity plc, together with its subsidiaries, engages in the supply, generation, transmission, and distribution of electricity in Jersey, the Channel Islands. The company offers energy solutions and services for enterprises to switch their heating and cooling systems from fossil-based fuels to electric; and building services, including design, installation, and maintenance services, which cover heating systems, electric works, plumbing services, air conditioning, low energy and LED lighting, renewable systems, commercial refrigeration, and maintenance services. It also provides mechanical and electrical building consultancy services for various project, such as serviced houses, hotels, leisure centers, office developments, schools, social housing estates, computer data centers, and retail outlets; designs, maintains, and sells refrigeration and catering equipment; and operates and leases Powerhouse retail park to retailers. In addition, the company offers various electrical appliances, such as cookers, washing machines, dishwashers, fridges, and freezers; small appliances comprising vacuum cleaners, kettles, coffee makers, toasters, blenders, and food processors; TVs, computers, mobile devices, digital cameras, and game consoles; and cooking equipment and accessories through retail shop, as well as online store, powerhouse.je. Further, it engages in the provision of Jenworks, a multi-utility billing engine; and property management business, as well as other businesses, which comprise software development and consulting. The company was founded in 1924 and is headquartered in St Helier, Jersey.",
        "currency": "GBp",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Jersey",
        "state": null,
        "city": "Saint Helier",
        "zipcode": "JE4 8NY",
        "website": "http://www.jec.co.uk",
        "market_cap": null
    }
}