{
  "1010.SR": {
    "city": "Riyadh",
    "country": "Saudi Arabia",
    "currency": "SAR",
    "exchange": "SAU",
    "industry": "Banks - Regional",
    "long_name": "Riyad Bank",
    "market": "sr_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "Riyad Bank",
    "state": null,
    "summary": "Riyad Bank provides various banking products and services in the Kingdom of Saudi Arabia. The company operates through Retail Banking, Investment Banking and Brokerage, Corporate Banking, and Treasury and Investments segments. The Retail Banking segment offers deposits, credit, and investment products for individuals and small to medium sized businesses. The Investment Banking and Brokerage segment provides investment management services; and asset management services related to dealing, managing, arranging, advising, and custody of securities. The Corporate Banking segment offers current accounts, deposits, loans, overdrafts, and other credit facilities. The Treasury and Investments segment offers money market, trading, and treasury and derivative products and services, as well as manages investment portfolios. The company also provides saving account and term deposit products; personal, car, and home finance; Islamic banking products and services; and digital banking services. In addition, it owns, buys, and sells real estate; and acts as an agent for insurance products. It operates through a network of approximately 341 branches in the Kingdom of Saudi Arabia; a branch in London, the United Kingdom; an agency in Houston, the United States; and a representative office in Singapore. Riyad Bank was founded in 1957 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
    "website": "http://www.riyadbank.com",
    "zipcode": "11416"
  },
  "1020.SR": {
    "city": "Jeddah",
    "country": "Saudi Arabia",
    "currency": "SAR",
    "exchange": "SAU",
    "industry": "Banks - Regional",
    "long_name": "Bank AlJazira",
    "market": "sr_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "Bank AlJazira",
    "state": null,
    "summary": "Bank AlJazira provides a range of Shari'ah compliant banking products and services for individuals, corporates, small to medium sized businesses, and institutions in the Kingdom of Saudi Arabia. The company operates through Personal Banking, Corporate Banking, Treasury, Brokerage and Asset Management, and Takaful Ta'awuni segments. It offers various personal banking products and services, including saving and current accounts; real estate and personal financing services; safety deposits; money transfer; investment products; and ladies and e-banking services. The company also provides Islamic funding services; global transaction services, such as cash management, trade financing, and corporate payroll services; syndication financing services; and commercial and online banking services, as well as services for the public sector and financial institutions. In addition, it offers investment banking services comprising brokerage and asset management services, as well as corporate investment banking services through initial public offerings, private placement, capital increase, and underwriting. Further, the company provides private banking products and services, including ATM and credit cards, safe deposit lockers, trading commission, foreign currency exchange, short term deposits, and structured products; real-estates investments; wealth management services; and treasury services, including naqa'a and thrift saving programs, foreign exchange, FX forward, structured products, and hedging solutions, as well as margin financing services. As of December 31, 2020, it operated a network of 79 branches and 62 Fawri remittance centers. The company was incorporated in 1975 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
    "website": "http://www.bankaljazira.com",
    "zipcode": null
  },
  "1050.SR": {
    "city": "Riyadh",
    "country": "Saudi Arabia",
    "currency": "SAR",
    "exchange": "SAU",
    "industry": "Banks - Regional",
    "long_name": "Banque Saudi Fransi",
    "market": "sr_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "Banque Saudi Fransi",
    "state": null,
    "summary": "Banque Saudi Fransi provides banking and financial services in the Kingdom of Saudi Arabia and internationally. Its deposit products include demand accounts, saving accounts, current accounts, money market deposits, term deposits, and notice deposits, as well as mada Pay and Apple Pay products. The company's loan portfolio comprises home and personal loans, consumer loans, overdrafts, corporate finance, working capital finance, contract finance, structured finance, trade finance, Islamic finance, project finance, and credit and debit cards, as well as other credit facilities. It also provides forex and derivative products; treasury services, such as trading activities, investment securities, capital markets, and bank's funding operations; and cash and wealth management services. In addition, the company provides investment management services; asset management activities related to dealing, managing, arranging, advising, and custody of securities; retail investment products; international and brokerage services; education, retirement, travel protection, and car protection insurance plans; and ATM, and Islamic and e-banking services. It operates through a network of 87 branches. Banque Saudi Fransi founded in 1977 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
    "website": "http://www.alfransi.com.sa",
    "zipcode": "11554"
  },
  "1090.SR": {
    "city": "Riyadh",
    "country": "Saudi Arabia",
    "currency": "SAR",
    "exchange": "SAU",
    "industry": "Banks - Regional",
    "long_name": "Samba Financial Group",
    "market": "sr_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "SAMBA Financial Group",
    "state": null,
    "summary": "Samba Financial Group provides various banking products and services. The company operates through four segments: Consumer Banking, Corporate Banking, Treasury, and Investment Banking. The Consumer Banking segment offers individual customer time deposits, current, call, and savings accounts, as well as credit cards, retail investment products, and individual and consumer loans. The Corporate Banking segment provides corporate time deposits, current and call accounts, overdrafts, loans and other credit facilities, and corporate advisory services, as well as derivative portfolios. The Treasury segment primarily manages money market, foreign exchange, commission rate trading, and derivatives for corporate and institutional customers. The Investment Banking segment is involved in the investment management and asset management activities related to dealing, managing, arranging, advising, and custody businesses. The company also offers Islamic banking products, as well as manages real estate projects; and provides debit cards and online banking services. It operates 73 branches in the Kingdom of Saudi Arabia; and two overseas branches. Samba Financial Group was founded in 1955 and is headquartered in Riyadh, the Kingdom of Saudi Arabia. As of April 1, 2021, Samba Financial Group was acquired by The National Commercial Bank.",
    "website": "http://www.samba.com",
    "zipcode": "11421"
  },
  "1120.SR": {
    "city": "Riyadh",
    "country": "Saudi Arabia",
    "currency": "SAR",
    "exchange": "SAU",
    "industry": "Banks - Regional",
    "long_name": "Al Rajhi Banking and Investment Corporation",
    "market": "sr_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "Al Rajhi Bank",
    "state": null,
    "summary": "Al Rajhi Banking and Investment Corporation, together with its subsidiaries, engages in banking and investment activities in the Kingdom of Saudi Arabia and internationally. The company operates through four segments: Retail, Corporate, Treasury, and Investment Services and Brokerage. It offers current, affluent, private, ladies, business, and escrow accounts; personal, auto, home, car, real estate, fleet, payroll, POS merchant, contract, invoice, and working capital finance services; credit and debit cards; and vehicle, property, family protection, medical, personal accident, travel, marine and cargo, engineering, machinery breakdown, and professional liability insurance products. The company also provides documentary collection, letters of credit, letters of guarantee, supply chain finance, and e-trade services; cash management services; and investment products. In addition, it offers various corporate products, such as Bai Al Ajel, a financing facility that provides cash to customers; Murabaha contracts that allow customers to purchase raw materials, capital goods, and other consumables from local and international markets; Musharaka that enables customers to import goods and equipment; Istisnaa for financing real estate projects; Akar for investing in properties; and Erad that provides credit facilities against the assignment of rental income for a specific period for those interested in financing a real estate purchase. Further, the company provides treasury products, including direct investment, FX, gold trading, and bank notes; and mutual funds, investment, and local and international share trading services. It operates through a network of 591 branches. The company was founded in 1957 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
    "website": "http://www.alrajhibank.com.sa",
    "zipcode": "12263-2743"
  },
  "1140.SR": {
    "city": "Riyadh",
    "country": "Saudi Arabia",
    "currency": "SAR",
    "exchange": "SAU",
    "industry": "Banks - Regional",
    "long_name": "Bank Albilad",
    "market": "sr_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "Bank Albilad",
    "state": null,
    "summary": "Bank Albilad provides various banking products and services in the Kingdom of Saudi Arabia. It operates through Retail Banking, Corporate Banking, Treasury, and Investment Banking and Brokerage segments. The Retail Banking segment offers deposits, financing, remittances, and currency exchange products and services to individuals. The Corporate Banking segment provides deposits, financing, and trade services to corporate customers. The Treasury segment offers money market and treasury services. The Investment Banking and Brokerage segment offers investment management services; and undertakes asset management activities related to dealing, managing, arranging, advising, and custody of securities. It also provides payroll payment and vendor registration services; and debit, credit, medad, and household labor cards, as well as e-services. It operates through a network of 111 banking branches and 177 exchange and remittance centers. The company was founded in 2004 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
    "website": "http://www.bankalbilad.com",
    "zipcode": "3952-12711"
  },
  "1150.SR": {
    "city": "Riyadh",
    "country": "Saudi Arabia",
    "currency": "SAR",
    "exchange": "SAU",
    "industry": "Banks - Regional",
    "long_name": "Alinma Bank",
    "market": "sr_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "Alinma Bank",
    "state": null,
    "summary": "Alinma Bank provides banking and investment services in the Kingdom of Saudi Arabia. It operates through Retail Banking, Corporate Banking, Treasury, and Investment and Brokerage segments. The company provides various retail services, including current, family, education, and savings accounts; self-service banking, such as internet, mobile, and phone banking services; debit, credit, traveler, and prepaid cards; point of sale services; car, real estate, personal, and education financing; and bill payment services. It also offers treasury, letters of guarantee, documentary collection, import and export letters of credit, and guarantee verification services; cash management services; corporate partner services; finance and investment products; financial services to small and medium enterprises (SMEs); and payroll management, point of sale, and payment gateway services. In addition, the company provides investment management, asset management, custodianship, advisory, underwriting, and brokerage services; and operates as an insurance agent. Alinma Bank offers its services to individuals, corporates, SMEs, and institutional customers. As of December 31, 2020, the company served through its network of 98 branches. Alinma Bank was founded in 2006 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
    "website": "http://www.alinma.com",
    "zipcode": "11586"
  }
}
