{
    "2090.SR": {
        "short_name": "National Gypsum Co.",
        "long_name": "National Gypsum Company",
        "summary": "National Gypsum Company manufactures and sells gypsum and its derivatives in the Kingdom of Saudi Arabia and internationally. The company offers regular, and fire and moisture resistant plaster boards; and boards laminated with lead sheet. It also provides gypsum powder products, such as plastering, sprinkling, spraying machine, adhesive, agricultural, and other products. The company was founded in 1958 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    },
    "3001.SR": {
        "short_name": "Hail Cement Co.",
        "long_name": "Hail Cement Company",
        "summary": "Hail Cement Company manufactures and sells cement in the Kingdom of Saudi Arabia and internationally. It offers ordinary Portland, sulphate resistant, and masonry cement. The company was founded in 2010 and is headquartered in Hail, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Hail"
    },
    "3002.SR": {
        "short_name": "Najran Cement Co.",
        "long_name": "Najran Cement Company",
        "summary": "Najran Cement Company manufactures and sells cement products in the Kingdom of Saudi Arabia. The company offers ordinary Portland and cement resistant to salt. It also sells its products online. Najran Cement Company was founded in 2005 and is based in Najran, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Najran"
    },
    "3005.SR": {
        "short_name": "Umm Al-Qura Cement Co.",
        "long_name": "Umm Al-Qura Cement Company",
        "summary": "Umm Al-Qura Cement Company produces and sells cement products. It offers ordinary portland cement, buzlana cement, resistant cement, clinker, and cement finishing products. The company was founded in 2013 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    },
    "3008.SR": {
        "short_name": "Al Kathiri Holding Co.",
        "long_name": "Al Kathiri Holding Company",
        "summary": "Al Kathiri Holding Company manufactures, distributes, and transports cement and ready-made concrete to construction companies in the Kingdom of Saudi Arabia. It also distributes construction materials, such as gravel and various types of sand. The company was founded in 2008 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    },
    "3010.SR": {
        "short_name": "Arabian Cement Co.",
        "long_name": "Arabian Cement Company",
        "summary": "Arabian Cement Company engages in the production, trading, and selling of cement primarily in Saudi Arabia and Jordan. It also provides building materials and other related products. The company was incorporated in 1955 and is based in Jeddah, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Jeddah"
    },
    "3020.SR": {
        "short_name": "Yamama Cement Co.",
        "long_name": "Yamama Saudi Cement Company",
        "summary": "Yamama Saudi Cement Company manufactures and sells cement in Saudi Arabia. It offers ordinary Portland, clinker and finishing, sulfate-resistant Portland, white and colored, oil-well, fast cementing Bozolani, and bacteric resistant cement. The company was founded in 1956 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    },
    "3040.SR": {
        "short_name": "The Qassim Cement Co.",
        "long_name": "Qassim Cement Company",
        "summary": "Qassim Cement Company manufactures and sells cement and its derivatives and supplements in the Kingdom of Saudi Arabia. It offers ordinary Portland, Portland pozzolana, sulphate resistant, finishing, and limestone cement. The company was founded in 1976 and is headquartered in Buraydah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Buraydah"
    },
    "3050.SR": {
        "short_name": "Southern Province Cement Co.",
        "long_name": "Southern Province Cement Company",
        "summary": "Southern Province Cement Company engages in the production and sale of cement, clinker, and its derivatives in Saudi Arabia. The company was founded in 1978 and is headquartered in Abha, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Abha"
    },
    "3060.SR": {
        "short_name": "Yanbou Cement Co.",
        "long_name": "Yanbu Cement Company",
        "summary": "Yanbu Cement Company, together with its subsidiaries, engages in the manufacturing, producing, and trading in cement and related products in the Kingdom of Saudi Arabia. The company offers ordinary Portland, Pozzolana Portland, hydraulic, and sulphate resistance cement products. It also manufactures cement bags. Yanbu Cement Company was founded in 1977 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Jeddah"
    },
    "3080.SR": {
        "short_name": "Eastern Province Cement Co.",
        "long_name": "Eastern Province Cement Co.",
        "summary": "Eastern Province Cement Company produces and sells clinker and cement in the Kingdom of Saudi and internationally. It offers ordinary Portland, sulphate resisting, and finishing cement, as well as pre-cast concrete products. The company also engages in the wholesale and retail of cement, gypsum, etc. Eastern Province Cement Company is headquartered in Dammam, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Dammam"
    },
    "3090.SR": {
        "short_name": "Tabouk Cement Co.",
        "long_name": "Tabuk Cement Company",
        "summary": "Tabuk Cement Company manufactures and sells cement and related products for construction industries and infrastructure projects in Saudi Arabia. It offers ordinary Portland cement, sulphate resisting Portland cement, and Portland pozzolan cement. The company also engages in the establishment of factories and plants for manufacturing cement related products and construction materials; and export of cement and related products. The company was founded in 1994 and is based in Duba, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Duba"
    },
    "3091.SR": {
        "short_name": "Al Jouf Cement Co.",
        "long_name": "Al Jouf Cement Company",
        "summary": "Al Jouf Cement Company produces and sells cement in the Kingdom of Saudi Arabia. It provides ordinary Portland, sulphate resistant cement, and pozzolana Portland cement. The company's cement is used to build bases and foundations, bridges and towers, concert roads, sewage plants, concrete pipes, etc. The company is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Jeddah"
    },
    "9512.SR": {
        "short_name": "Riyadh Cement Co.",
        "long_name": "Riyadh Cement Co.",
        "summary": "Saudi White Cement Company manufactures, produces, and markets various types of clinker and cement in the Kingdom of Saudi Arabia. The company was founded in 1997 and is headquartered in Dammam, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Dammam"
    }
}