{
    "2001.SR": {
        "short_name": "Methanol Chemicals Co.",
        "long_name": "Methanol Chemicals Company",
        "summary": "Methanol Chemicals Company manufactures and sells methanol derivatives, formaldehyde derivatives, plasticizers, and various amino resins in the Middle East and internationally. It offers aqueous formaldehyde solution, urea formaldehyde concentrates, hexamethylene tetramine, paraformaldehyde, liquid and powder formaldehyde resins, and phenol formaldehyde resins, as well as urea and melamine formaldehyde powder resins, melamine urea formaldehyde powder resins, sulphonated naphthalene formaldehyde liquid and powder, and sulphonated melamine formaldehyde liquid. The company also provides methanol, carbon monoxide, monomethylamine, di-methylamine, tri-mon-methylamine, dimethylformamide, di-methyl carbon, pentaerythritol, sodium formate, and acetaldehyde. Its products have applications in agricultural fertilizers, pharmaceuticals, solvents, intermediates, the laminates/wood industry, plastics, paper, and the production of concrete admixtures. The company was formerly known as Saudi Formaldehyde Chemical Company Limited. Methanol Chemicals Company was founded in 1989 and is headquartered in Dammam, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Dammam",
        "zipcode": "31471",
        "website": "http://chemanol.com",
        "market_cap": "Small Cap"
    },
    "2010.SR": {
        "short_name": "Saudi Basic Industries Corp",
        "long_name": "Saudi Basic Industries Corporation",
        "summary": "Saudi Basic Industries Corporation manufactures, markets, and distributes chemicals, polymers, plastics, agri-nutrients, and metal products worldwide. The company operates through Petrochemicals & Specialties, Agri-Nutrients, and Hadeed segments. It offers polymers, such as acrylonitrile butadiene styrene, acrylonitrile styrene acrylate, carbon black, metallocene polyethylene, polybutylene terephthalate, polycarbonate, polycarbonate/acrylonitrile-butadiene-styrene, polyethylene terephthalate, polymethyl methacrylate, polyoxymethylene, polypropylene, polystyrene, polyethylene, polyvinyl chloride, and synthetic rubbers. The company also provides engineering thermoplastic resins and compounds, composites, thermosets and additives, copolymers, and additive manufacturing solutions. In addition, it offers chemicals, including aromatics, chlor-alkali, ethanolamines, ethoxylates, glycols, linear alpha olefins, natural detergent alcohol, olefins and gases, OXO alcohols and performance monomers, and oxygenates. Further, the company provides fertilizers comprising urea, ammonia, and a portfolio of nitrogen-based inorganic products; produces steel products, such as hot and cold rolled flat products, and long products; operates e-business portal for sales; and offers color services under the ColorXpress name. It serves agriculture, automotive, building and construction, consumer, electrical and electronics, healthcare, industrial, mass transportation, and packaging industries. The company was incorporated in 1976 and is headquartered in Riyadh, Saudi Arabia. Saudi Basic Industries Corporation is a subsidiary of Saudi Arabian Oil Company",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11422",
        "website": "http://www.sabic.com",
        "market_cap": "Large Cap"
    },
    "2060.SR": {
        "short_name": "National Industrialization Co.",
        "long_name": "National Industrialization Company",
        "summary": "National Industrialization Company operates in the petrochemicals, chemicals, plastics, engineering, and metals sectors worldwide. The company operates in three segments: Chemical, Petrochemical, and Downstream & Others. It manufactures and sells titanium dioxide, sulphuric acid, titanium chemicals, ultrafine titanium dioxide products, and titanium metal powder; mineral sands; ethylene, polyethylene, propylene, and polypropylene; acrylic acid; lead and sodium sulfate; and plastic sheets. The company also offers technical industrial services; manufactures steel and non-steel castings; produces towed steel wires, spring wires, steel wires for cables, and twisted reinforcement wires to carry the electrical conductors, as well as for use in concrete and welding wires; and produces and markets dry and liquid batteries for vehicles and industrial use. In addition, it conducts technical tests on industrial facilities; chemical, petrochemical, and metal plants; and water desalination and electricity generating plants, as well as sets up various plastic industries. Further, the company engages in the inspection of mechanical equipment and industrial instruments, quality management, and environment systems; provides academic training, information technology consultancy, and laboratory testing services; gathers, recycles, and sells used and damaged batteries, lead, plastics, industrial materials, and environmental waste; produces and markets acrylic boards; and markets and exports chemical, petrochemical, and plastic items. National Industrialization Company was founded in 1985 and is based in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11496",
        "website": "http://www.tasnee.com",
        "market_cap": "Mid Cap"
    },
    "2210.SR": {
        "short_name": "Nama Chemicals Co.",
        "long_name": "Nama Chemicals Co.",
        "summary": "NAMA Chemicals Company, together with its subsidiaries, owns, operates, and manages industrial projects in the petrochemical and chemical sectors in Saudi Arabia and internationally. The company operates through Epoxi Resin Products, Chlor Alkali Products, and Others segments. It provides epoxy, a thermosetting polymer; and anhydrous caustic soda, an indispensable inorganic chemical used in various applications by industries in chemical production, petroleum and natural gas processing, textile finishing process, cleaning products, food processing, beverages, pharmaceuticals, and municipal water and sewage treatment. The company also offers epichlorohydrin, a reactive organic compound for use in the production of epoxy and phenoxy resins, and other polymers, as well as used as a solvent for cellulose, resins, and paints; and other chemical products, such as calcium chloride, hydrochloric acid, and sodium hypochlorite. In addition, it is involved in the real estate business. NAMA Chemicals Company was founded in 1992 and is based in Jubail, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jubail",
        "zipcode": "31961",
        "website": "http://www.nama.com.sa",
        "market_cap": "Micro Cap"
    },
    "2290.SR": {
        "short_name": "Yanbu National Petrochemical Co",
        "long_name": "Yanbu National Petrochemical Company",
        "summary": "Yanbu National Petrochemical Company manufactures and sells petrochemical products in Saudi Arabia. It provides ethylene, propylene, mono ethylene glycol, di ethylene glycol, tri ethylene glycol, polypropylene, low linear density polyethylene, high density polyethylene, butene 1, butene 2, MTBE, benzene, and TX. The company was founded in 2006 and is based in Yanbu, Saudi Arabia. Yanbu National Petrochemical Company is a subsidiary of Saudi Basic Industries Corporation.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Yanbu",
        "zipcode": "51000",
        "website": "http://www.yansab.com.sa",
        "market_cap": "Large Cap"
    },
    "2310.SR": {
        "short_name": "Sahara International Petrochemi",
        "long_name": "Sahara International Petrochemical Company",
        "summary": "Sahara International Petrochemical Company owns, establishes, operates, and manages industrial projects related to chemical and petrochemical industries in the Kingdom of Saudi Arabia and internationally. The company operates through Basic Chemicals, Intermediate Chemicals, Polymers, Trading, and Corporate and Others segments. It offers basic products, including methanol, butane, tetrahydrofuran, maleic anhydride, carbon monoxide, and gamma butyrolactone; and intermediate products, such as acetic acid, acetic anhydride, vinyl acetate monomer, dichloroethane, and caustic soda, as well as ethyl and butyl acetates. The company also provides polymer products consisting of low-density polyethylene (LDPE), ethylene vinyl acetate, polyvinyl acetate, polyvinyl alcohol, cross linkable and semi-conductive LDPE compounds, polypropylene, and polybutylene terephthalate. In addition, it markets and distributes other petrochemical products; offers electrical connecting wire products; and manufactures and sells molds and dies, and related services, as well as produces ethylene-vinyl acetate films. The company was formerly known as Saudi International Petrochemical Company and changed its name to Sahara International Petrochemical Company in May 2019. Sahara International Petrochemical Company was incorporated in 1999 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11383",
        "website": "http://www.sipchem.com",
        "market_cap": "Mid Cap"
    },
    "2350.SR": {
        "short_name": "Saudi Kayan Petrochemical Co.",
        "long_name": "Saudi Kayan Petrochemical Company",
        "summary": "Saudi Kayan Petrochemical Company manufactures chemicals, polymers, and specialty products. The company offers ethylene for use as a feed stock for polyethylene and ethylene glycol; propylene for use as a feed stock for polypropylene and cumene; benzene for use as a feed stock for cumene plant; polypropylene for automotive, electric appliances, hot water pipe systems fibers, and film wraps; and high and low density polyethylene for automotive gasoline tanks, pipes, bottles, and containers. It also provides ethylene oxide for use as a feed stock to ethylene glycols, polycarbonates, and ethanolamines; monoethylene glycol for use in polyester fibers, soft drinks packaging, antifreeze and coolants, heat transfer fluids, and chemical intermediates; diethylene glycol used in unsaturated polyester resin, polyurethane, plasticizer, grinding aid, gas dehydration, printing ink, and paint pigment manufacturing; and triethylene glycol for the dehydration of industrial gases and solvents, and plasticizers. In addition, the company offers cumene used as a feed stock to phenol plant; phenol for use as a feed stock to Bisphenol-A plant; acetone used in solvents, and BPA and methyl methacrylate manufacturing; bisphenol A for use in polycarbonates and epoxy resins; and polycarbonate for use in optical media, construction and housing, automotive, aircraft, electronic components, lenses, toys, hobby items, and medical appliances. Further, it provides diethanolamine, diethanolamine, and monoethanolamine used in gas sweetening, detergent and specialty cleaning formulations, concrete mixtures, foam catalysts, pharmaceuticals, personal care products, and herbicides; ethoxylates for the detergent, paint, and leather industries; N-butanol for use in solvents, plasticizers, and coatings; iso-butanol used in direct solvents, chemical intermediates, and additives; and natural detergent alcohol for use in detergents. The company was founded in 2007 and is headquartered in Jubail, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jubail",
        "zipcode": "31961",
        "website": "http://www.saudikayan.com",
        "market_cap": "Mid Cap"
    }
}