{
    "2030.SR": {
        "short_name": "Saudi Arabia Refineries Co.",
        "long_name": "Saudi Arabia Refineries Co.",
        "summary": "Saudi Arabia Refineries Co. engages in the extraction of crude oil in the Kingdom of Saudi Arabia. It is also involved in the construction of refineries and petrochemical plants; buying and selling of lands and real estate; and management and leasing of non-residential real estate properties, as well as dealing in securities. Saudi Arabia Refineries Co. was founded in 1960 and is based in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "23215",
        "website": "http://www.almasafi.com.sa",
        "market_cap": "Small Cap"
    },
    "4051.SR": {
        "short_name": "Baazeem Trading Co.",
        "long_name": "Baazeem Trading Co.",
        "summary": "Baazeem Trading Co. operates as a FMCG distribution company. The company offers household cleaning solutions, such as sponge, scrubbers, steel wool, brooms, wipers, trash bags, food storage bags, table covers, and others; liquid detergents; cleaners; tuna; starch sprays; plastic oven bags; toilet cleaning products; and bed linens. It sells its products through business to business, discount store, and wholesale and retail channels in the United Arab Emirates, the Kingdom of Bahrain, and the Sultanate of Oman. The company was founded in 1978 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11451",
        "website": "http://baazeem.com",
        "market_cap": "Small Cap"
    },
    "4080.SR": {
        "short_name": "Aseer Trading\\, Tourism and Man",
        "long_name": "Aseer Trading, Tourism and Manufacturing Co.",
        "summary": "Aseer Trading, Tourism and Manufacturing Co., an investment holding company, engages in the industry, trade, tourism, agriculture, real estate development, and contracting activities. It invests in preserved food, real estate development, building and construction materials, electrical and electronic home appliances, petrochemical and derivatives, and financial and service sectors. The company was founded in 1977 and is headquartered in Abha, Saudi Arabia. Aseer Trading, Tourism and Manufacturing Co. is a subsidiary of Dallah Albaraka Holding Company.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Abha",
        "zipcode": null,
        "website": "http://www.aseercorp.com.sa",
        "market_cap": "Small Cap"
    }
}