{
    "4001.SR": {
        "short_name": "Abdullah Al Othaim Markets Co.",
        "long_name": "Abdullah Al-Othaim Markets Company",
        "summary": "Abdullah Al-Othaim Markets Company, together with its subsidiaries, engages in the wholesale and retail trade of food supplies and other products in the Kingdom of Saudi Arabia and Egypt. The company imports, exports, wholesales, and retails food products, wheat, rice, meat, fish, dairy products, ghee, olive, halawa, pasta, and soft drinks, as well as fruits, vegetables, and agricultural products; livestock and household items; and ready-made clothes, sport clothes, jewelry, sewing tools, bags, leather products, decorations, dropped ceilings, and vehicles spare parts. It also establishes, operates, manages, and maintains supermarkets, commercial complexes, bakeries, and cafes; and provides catering, as well as labor services regarding house workers and employment in the public and private sectors. In addition, the company maintains training and educational, entertainment, and sports centers; offers computer services for application systems and databases; establishes agriculture projects; and undertakes general contracting, electrical and electronic, and reinforcing and carpentry works, as well as construction, maintenance, demolition, and restoration works primarily for highways, roads, streets, and bridges. Further, it is involved in the vegetables and fodder cultivation, livestock, poultry breeding, and general trading businesses; acquisition of land to construct buildings for lease or sale; and contracting of buildings. The company was formerly known as Abdullah Saleh Al-Othaim Markets Company and changed its name to Abdullah Al-Othaim Markets Company in September 2007. Abdullah Al-Othaim Markets Company was founded in 1956 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    }
}