{
    "6020.SR": {
        "short_name": "Al Gassim Investment  Holding C",
        "long_name": "Al Gassim Investment Holding Company",
        "summary": "Al Gassim Investment Holding Company invests in agriculture business in the Kingdom of Saudi Arabia. It engages in the manufacturing and selling of agricultural products; and import of seeds. The company was formerly known as Qassim Agriculture Company and changed its name to Al Gassim Investment Holding Co. in January 2017. Al Gassim Investment Holding Co. was founded in 1984 and is based in Jaradat al Buraykah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jaradat al Buraykah",
        "zipcode": "51451",
        "website": "http://www.gih.sa",
        "market_cap": "Small Cap"
    },
    "6040.SR": {
        "short_name": "Tabuk Agriculture Development C",
        "long_name": "Tabuk Agricultural Development Company",
        "summary": "Tabuk Agricultural Development Company produces and sells agricultural products in Saudi Arabia. It offers fruits; vegetables; alfalfa and wheat; and olive oil. The company also engages in the management and leasing of owned or leased properties. It sells its products under the TADCO brand. Tabuk Agricultural Development Company was founded in 1983 and is headquartered in Tabuk, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Tabuk",
        "zipcode": "71421",
        "website": "http://www.tadco-agri.com",
        "market_cap": "Small Cap"
    },
    "6050.SR": {
        "short_name": "Saudi Fisheris Co.",
        "long_name": "Saudi Fisheries Company",
        "summary": "Saudi Fisheries Company engages in fishing, fish-farming, and marketing activities in the Kingdom of Saudi Arabia. The company's seafood products include hareed, hamour baloul, zubaidi, shaour emperor, andak red sea bream, dennis seabream, qarous sea bass, hamor seaman, and nagel fish, as well as crab, peeled shrimp, lobster, squid, and salmon and knad steaks. It also offers meal products, including salmon grilled with rice, sweet sour shrimp with rice, tempura fish, fried prawns with potatoes, daqoos, flour, thome, green salad, spiced eggplant, rabban timbora, his sanctity, and chickpeas, as well as frozen shrimp. In addition, the company is involved in the operation of fish and shrimp farms; ice production and storage facilities; and operation and management of seafood restaurants. In addition, it engages in the sorting, cleaning, and chopping of fish, as well as preservation, cooking, and packing; and provision of logistic services, which include procurement, transportation, and warehouse of products. The company was founded in 1980 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "12641",
        "website": "http://www.alasmak.com.sa",
        "market_cap": "Small Cap"
    },
    "6090.SR": {
        "short_name": "Jazan Energy and Development Co",
        "long_name": "Jazan Energy and Development Company",
        "summary": "Jazan Energy and Development Company, together with its subsidiaries, engages in the fisheries, agricultural, industrial, and real estate businesses in Saudi Arabia. The company is involved in the cultivation of mangoes and shrimps; preservation of fish and fish products; cooling and freezing of fruits; production and packaging and distributing of pure filtered water; operates hotels; and other activities. It engages in the buying, selling, and renting of land and real estate properties. Jazan Energy and Development Company was incorporated in 1993 and is headquartered in Jazan, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jazan",
        "zipcode": null,
        "website": "http://www.jazadco.com.sa",
        "market_cap": "Small Cap"
    }
}