{
    "2270.SR": {
        "short_name": "Saudia Dairy and Foodstuff Co.",
        "long_name": "Saudia Dairy & Foodstuff Company",
        "summary": "Saudia Dairy & Foodstuff Company engages in the production and distribution of dairy products, beverages, and various foodstuffs in the Kingdom of Saudi Arabia, Poland, and other Gulf and Arab countries. It operates through Drinks and NonÂ\u0096Drinks segments. The company offers milk and milk powder, soy drinks, laban, evaporated milk, cheese, cream, fruit drinks, ice cream, butter, tomato products, French fries, and snacks. It provides its products under the Saudia, Crispy, Majestique, and Baboo brands. The company was founded in 1976 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21422",
        "website": "http://www.sadafco.com",
        "market_cap": "Small Cap"
    },
    "4061.SR": {
        "short_name": "Anaam International Holding Gro",
        "long_name": "Anaam International Holding Group Company",
        "summary": "Anaam International Holding Group Company engages in food, agriculture, and estate development businesses in Saudi Arabia. The company imports, distributes, and sells frozen food products, including chicken, mutton, fish, potatoes, vegetables, fruits, and other products. It also produces grain and fodder products, such as alfalfa, corn, wheat, fruits and vegetables, tomatoes, potatoes, onions, and other products, as well as owns agricultural land with an area of 100,000,000 square meters in the fertile agricultural Albesitae northern Saudi Arabia. In addition, the company manages and leases cold and dry storage facilities; builds, manages, and maintains commercial centers; and builds, manages, and operates industrial projects. Further, it undertakes contracts to build residential complexes, commercial centers, economic cities, and industrial properties; constructs, sells, and leases buildings; leases construction machinery and equipment; and undertakes finishing works in construction, as well as provides construction maintenance, and construction materials wholesale and retail services. Anaam International Holding Group Company was founded in 1980 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11555",
        "website": "http://www.anaamgroup.com",
        "market_cap": "Micro Cap"
    }
}