{
    "7200.SR": {
        "short_name": "Al Moammar Information Systems ",
        "long_name": "Al Moammar Information Systems Company",
        "summary": "Al Moammar Information Systems Company provides information technology solutions and services in the Kingdom of Saudi Arabia. The company operates through six segments: Business Service Management unit, Solutions unit, Systems unit, Information Technology Security unit, Networking unit, and Operation and Maintenance unit. It provides operating systems, system analysis, and software design, programming, and maintenance, as well as web design and hosting, data processing services, and related services. The company also offers software-defined and coveraged storage; servers, such as server infrastructure management, racks and power infrastructure, racks and tower servers, mission-critical, blade system, and hyperscale; and software, including mobility, autonomy portfolio, big data and analysis, automation and cloud, app and desktop virtualization, application lifecycle management, data center and cloud management, desktop virtualization and mobile computing, and data center virtualization and cloud infrastructure. In addition, it provides networks and communication solutions based on SDN, NFV, automation, and management and orchestration technologies; geographic information services and various infrastructure solutions; and information technology security solutions to develop, deploy, and maintain security. Further, the company offers mainframe cost optimization, performance monitoring, remote support solutions, network management solution, IT business and service management, cloud computing, data center automation, data center infrastructure, management solutions, and data center capacity management solutions; and project management support for IT infrastructure business. It serves government, semi-government ministries, and private sectors. The company was incorporated in 1979 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "13315",
        "website": "http://www.mis.com.sa",
        "market_cap": "Mid Cap"
    }
}