{
    "8020.SR": {
        "short_name": "Malath Cooperative Insurance Co",
        "long_name": "Malath Cooperative Insurance Company",
        "summary": "Malath Cooperative Insurance Company provides insurance products and related services to individuals and businesses in the Kingdom of Saudi Arabia. The company operates through Medical, Motor, Property & Casualty, and Protection & Savings segments. It offers marine cargo in transit and ships against marine perils insurance products; engineering insurance that provides coverage for loss or damage to construction works or erection and installation of plant and machinery; and health, motor vehicles, fire and burglary, public liability, personal accident, and workmen compensation insurance products. The company was incorporated in 2007 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Property & Casualty",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11625",
        "website": "http://www.malath.com.sa",
        "market_cap": "Small Cap"
    },
    "8050.SR": {
        "short_name": "Salama Cooperative Insurance Co",
        "long_name": "Salama Cooperative Insurance Company",
        "summary": "Salama Cooperative Insurance Company provides insurance products and services in the United Arab Emirates, the Kingdom of Saudi Arabia, Algeria, Malaysia, Bahrain, Senegal, and Egypt. It operates through three segments: Medical, Motor, and Others. It offers motor insurance products that cover accident, fire, towing, malicious, theft, estimation, and medical expenses; and medical insurance for care, medicines, chronic diseases, vaccination, maternity and neonatal, physiotherapy, ophthalmology, dental care, oncology, and CCHI. The company also provides travel insurance comprising personal accidents, medical expenses, repatriation of mortal remains, lost baggage, passport loss, cash loss, personal liability, and accidental death; and malpractice insurance that provides specialties, flexible, and medical facilities coverage. In addition, it offers general insurance coverage, such as engineering, liability, marine, property, and general accident insurance products. The company was formerly known as Saudi IAIC Cooperative Insurance Company and changed its name to Salama Cooperative Insurance Company in 2012. Salama Cooperative Insurance Company was founded in 1979 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Property & Casualty",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21491",
        "website": "http://www.salama.com.sa",
        "market_cap": "Small Cap"
    },
    "8070.SR": {
        "short_name": "Arabian Shield Cooperative Insu",
        "long_name": "Arabian Shield Cooperative Insurance Company",
        "summary": "Arabian Shield Cooperative Insurance Company offers various insurance products to companies and individuals in the Kingdom of Saudi Arabia. It offers medical, motor, property, engineering, marine, liability, accident, casualty, protection and saving, travel, and medical malpractice insurance, as well as reinsurance products. The company was founded in 1998 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Property & Casualty",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11565",
        "website": "http://www.der3.com",
        "market_cap": "Small Cap"
    },
    "8160.SR": {
        "short_name": "Arabia Insurance Cooperative Co",
        "long_name": "Arabia Insurance Cooperative Company",
        "summary": "Arabia Insurance Cooperative Company provides insurance products and services in the Kingdom of Saudi Arabia. It offers motor, health, property, engineering, medical, general accident, fire, marine, and other insurance products, such as general and aviation, as well as protection and savings insurance. The company was founded in 2007 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Property & Casualty",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": null,
        "website": "http://www.aicc.com.sa",
        "market_cap": "Small Cap"
    }
}