{
    "1201.SR": {
        "short_name": "Takween Advanced Industries Co.",
        "long_name": "Takween Advanced Industries",
        "summary": "Takween Advanced Industries produces and sells plastic packaging products in the Kingdom of Saudi Arabia and the Arab Republic of Egypt. It operates through Disposable Polystyrene Cups, Lids, and Other Plastic Related Products; and Non-Woven Fabrics segments. The company offers polyethylene terephthalate (PET) preforms and bottles for water, juices, and other beverages, and home and personal care products; HDPE bottles and containers; and flexible packaging products, including plastic films and sheets. It also provides caps and closures for the mineral water, soft drink, juice, dairy, and food industries; disposable white, semitransparent, and transparent polystyrene cups and lids for the beverage industry; and industrial crates, pallets, pails, buckets, plastic plates, cups, utensils, tables and chairs, and others, as well as drums. In addition, the company offers nonwoven fabrics comprising polypropylene spunbonded and spunmelt nonwoven products for use in consumer, medical, or industrial applications; the construction, automotive, home furnishings, and packaging sectors; and babies' products, feminine care, etc., as well as gowns, drapes, and sterile wraps for medical applications. Further, it is involved in the manufacture and wholesale trading of films; manufacture, wholesale, and retail trading of plastic containers and polyethylene cups, rolls, and bags; and management and operation of industrial centers. Additionally, the company owns land; establishes industrial institutes, and provides and coordinates training courses related to the development of plastic products; and establishes, manages, operates, and maintains various industrial projects, as well as engages in the import and export, wholesale, and retail of plastic products. The company was formerly known as Al-Othman Plastic Products. Takween Advanced Industries was founded in 1993 and is headquartered in Al Khobar, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Al Khobar"
    },
    "2180.SR": {
        "short_name": "Filing and Packing Materials Ma",
        "long_name": "Filling and Packing Materials Manufacturing Company",
        "summary": "Filling and Packing Materials Manufacturing Company develops, produces, and sells jumbo bags and other woven poly-propylene packaging products for industrial, agricultural, and general applications in the Kingdom of Saudi Arabia and internationally. It offers jumbo bags for packing, handling, storage, and transport of materials in bulk quantities; small PP woven bags for packing fertilizers, feeds, grains, barley, flour, salt, sugar, seeds, and other lumpy and fine materials; and valve bags for packing cement, chemical material, feeds, fertilizers, etc. The company also provides strapping bands, which are used to strap small and big boxes, bales, bricks, and various other products; and cable filler yarns and sewing threads used in the manufacture of electric cables. In addition, it offers flame-retardant and conductive fabrics and sacks, including tubular rolls or sheets; and container liner products for transport of dry flow able products. Filling and Packing Materials Manufacturing Company was founded in 1991 and is based in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    },
    "3007.SR": {
        "short_name": "Zahrat Al Waha for Trading Co.",
        "long_name": "Zahrat Al Waha For Trading Company",
        "summary": "Zahrat Al Waha For Trading Company produces and sells plastic bottles preforms and plastic caps. It operates in Asia, Africa, Europe, the Kingdom of Saudi Arabia, and Gulf countries. The company also exports its products. Zahrat Al Waha for Trading Company was founded in 2003 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    }
}