{
    "2050.SR": {
        "short_name": "SAVOLA Group",
        "long_name": "Savola Group Company",
        "summary": "Savola Group Company, through its subsidiaries, manufactures and distributes food products in the Middle East, North Africa, and Turkey region. The company operates through five segments: Food Processing, Retail, Food Services, Frozen Foods, and Investments. It offers edible oils, vegetable oils, sugar, pasta, bakery products, specialty fats, seafood, confectionery, and frozen food products. The company also engages in the agro cultivation, services and maintenance, trading and distribution, and real estate related investment activities. In addition, it retails groceries through a chain of hypermarkets, supermarkets, and convenience stores. The company was founded in 1979 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "23511-7333",
        "website": "http://www.savola.com",
        "market_cap": 22737000448
    },
    "2100.SR": {
        "short_name": "Wafrah for Industry and Develop",
        "long_name": "Wafrah for Industry and Development Company",
        "summary": "Wafrah for Industry and Development Company engages in manufacturing, canning, preserving, processing, and marketing food products in Saudi Arabia and internationally. It provides pasta products, potato chips, frozen French fries products, peanut products, and breakfast cereals, as well as frozen, chilled, and cooked meat products. The company markets its products under the Wafra, Caprini, Saudi Garden, and Nemah brands. It is also involved in the treatment and processing of agricultural products; and investment in land property. The company was formerly known as Food Products Company and changed its name to Wafrah for Industry and Development Company in 2014. Wafrah for Industry and Development Company was founded in 1989 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11383",
        "website": "http://www.wafrah.com",
        "market_cap": 1336591360
    },
    "2280.SR": {
        "short_name": "Almarai Co.",
        "long_name": "Almarai Company",
        "summary": "Almarai Company, together with its subsidiaries, operates as an integrated consumer food and beverage company in Saudi Arabia, Egypt, Jordan, and rest of Gulf Cooperation Council countries. The company operates through Dairy and Juice, Bakery, Poultry, and Other Activities segments. It offers dairy, fruit juice, and related food products under the Almarai, Joosy Life, Beyti, and Teeba brand names; bakery products under the L'usine and 7 Days brand names; and poultry products under the Alyoum and AlBashayer brand names. The company also engages in the arable and horticulture activities; and provision of infant nutrition products under the Nuralac and Evolac brand names. Almarai Company was founded in 1977 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11492",
        "website": "http://www.almarai.com",
        "market_cap": 62124437504
    },
    "6001.SR": {
        "short_name": "Halwani Bros. Co.",
        "long_name": "Halwani Bros. Co. Ltd.",
        "summary": "Halwani Bros. Co. Ltd. produces, manufactures, and distributes food products in the Kingdom of Saudi Arabia. It offers Middle Eastern food products, such as sweets; meat products; breaded chicken and burgers; jams; dairy products; cheese; juices; provisions, such as olive oil, olives, peppers, and pickles; bakery products stuffed with dates, and packaging products. The company was founded in 1950 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21421",
        "website": "http://www.halwani.com.sa",
        "market_cap": 3475602944
    }
}