{
    "4220.SR": {
        "short_name": "Emaar The Economic City",
        "long_name": "Emaar The Economic City",
        "summary": "Emaar The Economic City operates as a real estate development and management company in Saudi Arabia. The company primarily develops the King Abdullah Economic City. It also develops infrastructures; promotes, markets, and sells land within development areas; transfers/leases land; develops buildings/housing units; and constructs on behalf of other parties. In addition, the company develops, invests in, markets, sells/leases, operates, and maintains properties; and provides higher education services. Emaar The Economic City was founded in 2006 and is headquartered in King Abdullah Economic City, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "King Abdullah Economic City",
        "zipcode": "23965",
        "website": "http://www.kaec.net",
        "market_cap": "Large Cap"
    },
    "4300.SR": {
        "short_name": "Dar Alarkan Real Estate Develop",
        "long_name": "Dar Al Arkan Real Estate Development Company",
        "summary": "Dar Al Arkan Real Estate Development Company, together with its subsidiaries, primarily engages in the development, sale, and lease of real estate projects in the Kingdom of Saudi Arabia. The company operates in two segments, Development Properties and Asset Management. It is involved in the acquisition, development, construction, management, operation, and maintenance of residential and commercial buildings, and public facilities. The company also engages in the purchase and sale, acquisition, and leasing of real estate investments; and purchase of land and general contracting activities. Dar Al Arkan Real Estate Development Company was founded in 1994 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "12622",
        "website": "http://www.daralarkan.com",
        "market_cap": "Large Cap"
    },
    "4310.SR": {
        "short_name": "Knowledge Economic City",
        "long_name": "Knowledge Economic City Company",
        "summary": "Knowledge Economic City develops properties and other land in the economic cities of Saudi Arabia. It undertakes projects, including infrastructure, telecommunications and Internet networks, water and electricity networks, water treatment plants, and other works related to the development of the economic cities. The company also engages in the creation, operation, and management of educational projects; and development of software, scientific research centers, universities, colleges, institutes, and academies. In addition, its activities include marketing and selling real estate properties; buildings and land for development or for ownership of others; and managing housing services, tourist projects, resorts, hotels and furnished apartments, and other activities. The company was founded in 2010 and is based in Medina, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Medina",
        "zipcode": "41561",
        "website": "http://www.madinahkec.com",
        "market_cap": "Mid Cap"
    },
    "4320.SR": {
        "short_name": "Alandalus property Co.",
        "long_name": "Alandalus Property Company",
        "summary": "Alandalus Property Company engages in the commercial real estate investment and development activities in the Kingdom of Saudi Arabia. It constructs, owns, and manages centers, and commercial and residential complexes. The company is also involved in the general contracting of residential and commercial buildings, educational, recreational, health institutions, roads, dams, water and sewage project, electrical, and mechanical works. In addition, it engages in the leasing, maintenance, and operation of real estate properties, buildings, and commercial complexes, as well as ownership, development, and investment of lands and real estate properties. Alandalus Property Company was founded in 2006 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11342",
        "website": "http://www.alandalus.com.sa",
        "market_cap": "Small Cap"
    },
    "9511.SR": {
        "short_name": "Sumou Real Estate Co.",
        "long_name": "Sumou Real Estate Company",
        "summary": "Sumou Real Estate Company engages in the development, management, maintenance, sale, and rental of residential and non-residential properties in Saudi Arabia. It also engages in the general building contracts, including construction, repair and renovation, and demolition for residential compounds, commercial centers, educational and entertainment, health and sports facilities, and hotels and restaurants; the provision of real estate project management services; and investment in real estate and project development. The company was founded in 2007 and is based in Al Khobar, Saudi Arabia. Sumou Real Estate Company is a subsidiary of Sumou Holding Company.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Al Khobar",
        "zipcode": "31952",
        "website": "http://www.sumou.com.sa",
        "market_cap": null
    }
}