{
    "6002.SR": {
        "short_name": "Herfy Food Services Co.",
        "long_name": "Herfy Food Services Company",
        "summary": "Herfy Food Services Company establishes, operates, and franchises restaurants primarily in the Kingdom of Saudi Arabia. The company's restaurants offer cooked meals to companies and others. As of December 31, 2020, it owned 40 restaurants and leased 348 restaurants under the HERFY name in the Kingdom of Saudi Arabia. The company also franchises restaurants in Kuwait, the United Arab Emirates, Egypt, and Bahrain; provides catering services; manufactures and sells meat products, as well as bakery and pastry, and sweets and chocolate products; and operates bakeries. In addition, it purchases and sells land for constructing buildings; and owns, uses, maintains, and leases stores and food store fridges. The company was founded in 1981 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    },
    "6012.SR": {
        "short_name": "Raydan Food Co.",
        "long_name": "Raydan Food Co.",
        "summary": "Raydan Food Co. establishes, owns, operates, and manages restaurants. The company offers Arab meals, and cooked and uncooked catering services. It is also involved in the holding of concerts; management of factories; sale and purchase of livestock; sale and delivery of finished paintings; general contracting; real estate investment; import and export; and wholesale and retail trade activities. The company was formerly known as Raydan Co. Raydan Food Co. was founded in 2008 and is headquartered in Jeddah, Saudi Arabia.",
        "currency": null,
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Jeddah"
    }
}