{
  "4190.SR": {
    "city": "Riyadh",
    "country": "Saudi Arabia",
    "currency": "SAR",
    "exchange": "SAU",
    "industry": "Specialty Retail",
    "long_name": "Jarir Marketing Company",
    "market": "sr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Jarir Marketing Co.",
    "state": null,
    "summary": "Jarir Marketing Company, together with its subsidiaries, engages in the retail and wholesale trading of office and school supplies. It operates through Retail Outlets and Wholesale segments. The company sells office supplies, school supplies, books, computers and peripherals, computer supplies, smartphones and accessories, electronics, art and craft supplies, video games, smart TV's, and kids' development products, as well as after-sale services. It is also involved in the online sale of products through Jarir.com website and Jarir Bookstore app; and investment of office, retail, and residential properties. Jarir Marketing Company sells its products under the Jarir bookstore brand name. As of April 12, 2021, the company had 64 retail showrooms in the Kingdom of Saudi Arabia and other Gulf countries. Jarir Marketing Company was founded in 1974 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
    "website": "http://www.jarir.com",
    "zipcode": "11471"
  },
  "4191.SR": {
    "city": "Riyadh",
    "country": "Saudi Arabia",
    "currency": "SAR",
    "exchange": "SAU",
    "industry": "Specialty Retail",
    "long_name": "Abdullah Saad Mohammed Abo Moati Stationaries Company",
    "market": "sr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Abdullah Saad Mohammed Abo Moat",
    "state": null,
    "summary": "Abdullah Saad Mohammed Abo Moati Stationaries Company operates bookstores in the Kingdom of Saudi Arabia. Its stores offer stationery products and ink. As of April 26, 2021, the company operates 11 retail showrooms in the Kingdom of Saudi Arabia. The company is based in Riyadh, Saudi Arabia.",
    "website": "http://www.abomoati.com",
    "zipcode": "11423"
  },
  "4200.SR": {
    "city": "Riyadh",
    "country": "Saudi Arabia",
    "currency": "SAR",
    "exchange": "SAU",
    "industry": "Specialty Retail",
    "long_name": "Aldrees Petroleum and Transport Services Company",
    "market": "sr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Aldrees Petroleum and Transport",
    "state": null,
    "summary": "Aldrees Petroleum and Transport Services Company engages in the wholesale and retail of fuel, gasoline, lubricant, and oil in the Kingdom of Saudi Arabia. The company operates through Petroleum Services and Transport Services segments. It operates approximately 544 fuel stations. The company offers various services related to additives, car wash, tire servicing, alignment, accessories, food, mosque, ATMs, car rental, etc. at its fuel stations. It also provides transportation and logistics services through a fleet of trucks and trailers. The company was founded in 1957 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
    "website": "http://www.aldrees.com",
    "zipcode": "11421"
  },
  "4240.SR": {
    "city": "Riyadh",
    "country": "Saudi Arabia",
    "currency": "SAR",
    "exchange": "SAU",
    "industry": "Specialty Retail",
    "long_name": "Fawaz Abdulaziz AlHokair & Co.",
    "market": "sr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Fawaz Abdulaziz Alhokair Co.",
    "state": null,
    "summary": "Fawaz Abdulaziz AlHokair & Company, together with its subsidiaries, engages in the wholesale and retail of fashion apparels. It operates through three segments: Fashion Retail, Indoor Entertainment, and Food & Beverage. The Fashion Retail segment is involved in the sale of apparels, footwears, and accessories through retail outlets. The Indoor Entertainment segment operates kids play center. The Food & Beverage segment operates cafes and restaurants. The company has operations in the Kingdom of Saudi Arabia, Jordan, Egypt, the Republic of Kazakhstan, the United States, the Republic of Azerbaijan, Georgia, Armenia, and Morocco. It operates approximately 1,842 stores across 100 shopping malls. The company was founded in 1990 and is based in Riyadh, the Kingdom of Saudi Arabia.",
    "website": "http://www.fawazalhokairfashion.com",
    "zipcode": "12373"
  }
}
