{
    "ACES.JK": {
        "short_name": "Ace Hardware Indonesia Tbk.",
        "long_name": "PT Ace Hardware Indonesia Tbk",
        "summary": "PT Ace Hardware Indonesia Tbk engages in the retail of household appliances and lifestyle products in Indonesia. It operates through Home Improvement Products, Lifestyle Products, and Toy Products segments. As of December 31, 2019, it operated 197 retail outlets located in Jakarta, Tangerang, Cilegon, Bekasi, Karawang, Bogor, Depok, Cirebon, Bandung, Sumedang, Tasikmalaya, Gresik, Yogyakarta, Semarang, Solo, Purwokerto, Tegal, Surabaya, Malang, Jember, Kediri, Madiun, Aceh, Bali, Medan, Batam, Padang, Pekan Baru, Palembang, Jambi, Bengkulu, Lampung, Balikpapan, Makassar, Banjarmasin, Pontianak, Manado, Maluku, Samarinda, Kupang, Lombok, Kendari dan, and Pangkal Pinang. The company was formerly known as PT Ace Indoritel Perkakas and changed its name to PT Ace Hardware Indonesia Tbk in August 2001. The company was founded in 1995 and is headquartered in Jakarta, Indonesia. PT Ace Hardware Indonesia Tbk is a subsidiary of PT Kawan Lama Sejahtera.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "11610",
        "website": "http://www.acehardware.co.id",
        "market_cap": 24178952503296
    },
    "AKPI.JK": {
        "short_name": "Argha Karya Prima Industry Tbk.",
        "long_name": "PT Argha Karya Prima Industry Tbk",
        "summary": "PT Argha Karya Prima Industry Tbk manufacturers, markets, trades, and distributes flexible packaging films in Indonesia, Asia, Africa, America, the Middle East, Europe, Australia, and New Zealand. It operates through two segments, Manufacturing and Distribution. The company offers biaxially oriented poly propylene films and polyester films. The company was founded in 1980 and is based in Bogor, Indonesia. PT Argha Karya Prima Industry Tbk is a subsidiary of PT Nawa Panduta.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bogor",
        "zipcode": "16810",
        "website": "http://www.arghakarya.com",
        "market_cap": 345920110592
    },
    "APLI.JK": {
        "short_name": "Asiaplast Industries Tbk.",
        "long_name": "PT Asiaplast Industries Tbk.",
        "summary": "PT Asiaplast Industries Tbk. manufactures and sells polyvinyl chloride products in Indonesia and internationally. The company offers flexible films and sheets for use in office equipment, overlay furniture and home appliances, promotion media, raincoats, packaging products, etc.; leatherette for use in fashion products, automotive interior, furniture, tents, etc.; and rigid films and sheets for use in pharmaceutical grade blisters, food grade packaging products, boxes and window boxes, thermoform packaging products, etc. It also provides polyethylene terephthalate sheets for use in drinking cups and lids, food packaging products, cosmetic trays and window boxes, electronic packaging products, semiconductor trays, automotive spare part packaging products, pharmaceutical blisters, etc. The company was formerly known as PT Akasa Pandukarya. The company was founded in 1992 and is headquartered in Tangerang, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang",
        "zipcode": "15133",
        "website": "http://www.asiaplast.co.id",
        "market_cap": 267083317248
    },
    "ARGO.JK": {
        "short_name": "Argo Pantes Tbk",
        "long_name": "PT Argo Pantes Tbk",
        "summary": "PT Argo Pantes Tbk produces and sells various textile products primarily in Indonesia. It is also involved in the warehouse rental activities. The company was founded in 1977 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12930",
        "website": "http://www.argopantes.com",
        "market_cap": 590580285440
    },
    "ARTA.JK": {
        "short_name": "Arthavest Tbk",
        "long_name": "PT Arthavest Tbk",
        "summary": "PT Arthavest Tbk, together with its subsidiaries, engages in the hospitality business in Central Jakarta. The company owns and operates Redtop, a 4-star business hotel with 390-suite rooms. Its Redtop hotel offers convention and banquet, meeting rooms, and business center, as well as sports center and spa. The company also provides information technology and payment system services. The company was formerly known as PT Artha Securities Tbk. PT Arthavest Tbk was founded in 1990 and is based in Central Jakarta, Indonesia. PT Arthavest Tbk is a subsidiary of Lucas SH CN.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10220",
        "website": "http://www.arthavest.com",
        "market_cap": 117028585472
    },
    "ASII.JK": {
        "short_name": "Astra International Tbk.",
        "long_name": "PT Astra International Tbk",
        "summary": "PT Astra International Tbk, together with its subsidiaries, operates in the automotive, financial services, heavy equipment, mining, construction, energy, agri, infrastructure and logistics, information technology, and property businesses in Indonesia. It offers cars, trucks, and motorcycles of various brands; manufactures and sells automotive components to the original equipment for manufacturers and replacement markets, as well as provides consultation services to its customers; financing for cars, motorcycles, and heavy equipment; life, vehicle, and health insurance, as well as other insurance for commercial business; and various banking products and services. The company also distributes heavy equipment for the mining, plantation, construction, forestry, transportation, and material handling industries; provides coal mining contracting services; operates coal mines; and produces crude palm oil. In addition, it is involved in the development and operation of toll roads; rental and leasing of vehicles; resale of used cars; and provision of public transportation services and logistics facilities. Further, the company offers various information technology business solutions based on document, information, and communication technology; and engages in the property investment, development, and management activities. Additionally, it is involved in the foundation; formwork and bekisting; pump services; and mechanical, electrical, and plumbing works, as well as dredging, reclamation, and marine works. The company was founded in 1957 and is headquartered in North Jakarta, Indonesia. PT Astra International Tbk is a subsidiary of Jardine Cycle & Carriage Ltd.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10220",
        "website": "http://www.astra.co.id",
        "market_cap": 213550974894080
    },
    "ASJA.F": {
        "short_name": "PT ASTRA INTL TBK  RP 50",
        "long_name": "PT Astra International Tbk",
        "summary": "PT Astra International Tbk, together with its subsidiaries, operates in the automotive, financial services, heavy equipment, mining, construction, energy, agri, infrastructure and logistics, information technology, and property businesses in Indonesia. It offers cars, trucks, and motorcycles of various brands; manufactures and sells automotive components to the original equipment for manufacturers and replacement markets, as well as provides consultation services to its customers; financing for cars, motorcycles, and heavy equipment; life, vehicle, and health insurance, as well as other insurance for commercial business; and various banking products and services. The company also distributes heavy equipment for the mining, plantation, construction, forestry, transportation, and material handling industries; provides coal mining contracting services; operates coal mines; and produces crude palm oil. In addition, it is involved in the development and operation of toll roads; rental and leasing of vehicles; resale of used cars; and provision of public transportation services and logistics facilities. Further, the company offers various information technology business solutions based on document, information, and communication technology; and engages in the property investment, development, and management activities. Additionally, it is involved in the foundation; formwork and bekisting; pump services; and mechanical, electrical, and plumbing works, as well as dredging, reclamation, and marine works. The company was founded in 1957 and is headquartered in North Jakarta, Indonesia. PT Astra International Tbk is a subsidiary of Jardine Cycle & Carriage Ltd.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10220",
        "website": "http://www.astra.co.id",
        "market_cap": 11105781760
    },
    "ASPI.JK": {
        "short_name": "Andalan Sakti Primaindo Tbk.",
        "long_name": "PT Andalan Sakti Primaindo, Tbk",
        "summary": "PT Andalan Sakti Primaindo, Tbk engages in property business in Indonesia. It develops residential properties. The company was founded in 2012 and is based in South Jakarta, Indonesia. PT Andalan Sakti Primaindo, Tbk is a subsidiary of PT Andalan Sakti Inti.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12920",
        "website": "http://ansa-land.com",
        "market_cap": 36135030784
    },
    "ATAP.JK": {
        "short_name": "Trimitra Prawara Goldland Tbk.",
        "long_name": "PT Trimitra Prawara Goldland Tbk",
        "summary": "PT Trimitra Prawara Goldland Tbk engages in the property development business in Indonesia. The company is based in Bogor, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bogor",
        "zipcode": null,
        "website": "http://trimitraprawaraland.co.id/",
        "market_cap": 137500000256
    },
    "AUTO.JK": {
        "short_name": "Astra Otoparts Tbk.",
        "long_name": "PT Astra Otoparts Tbk",
        "summary": "PT Astra Otoparts Tbk manufactures, sells, distributes, and exports spare parts for two wheelers and four wheelers in Indonesia, rest of Asia, the Middle East, the United States, Europe, and Africa. It operates through two segments, Trading and Automotive Component Manufacturing. The company offers engine parts, such as molded and automotive rubber, air conditioner compressor, steel ball, pins, yoke welds and centers, and spindle knuckles; and body and chassis parts comprising torque assy rod truck, wheel assy, steering and driver air bag, tube, fuel tank main and breather, passenger air bag with door, inlet, air cleaner, and hose assy products. It also provides electronic and electrical parts consisting of SIFs, meter clusters, car horns, car and bus air conditioners, ECU, car batteries, and head units; and drive and transmission products for four wheelers. The company offers motorcycle batteries, signal and tail lamps, head lamps, instrument clusters, tray fuel cushion seats, screen oil filters, link stoppers, intake air cleaners, hose fuel, air and water, radiators, flap boot protectors, damper RR wheels, body and chassis parts, and other products for two wheelers. It also provides jacks, tools, automotive chains and filters, rubber parts, metal components, plastic components, automotive batteries and pistons, automotive wheel rims, and frame chassis for vehicles, as well as provides cutting steel and heat treatment services. The company distributes spare parts for replacement markets and original equipment manufacturer through a distribution network of dealers, sales offices, and retail stores in Indonesia. The company was formerly known as PT Astra Dian Lestari and changed its name to PT Astra Otoparts Tbk in November 1997. PT Astra Otoparts Tbk was founded in 1976 and is headquartered in Jakarta, Indonesia. PT Astra Otoparts Tbk is a subsidiary of PT Astra International Tbk.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "14250",
        "website": "http://www.astra-otoparts.com",
        "market_cap": 5590886645760
    },
    "BATA.JK": {
        "short_name": "Sepatu Bata Tbk.",
        "long_name": "PT Sepatu Bata Tbk.",
        "summary": "PT Sepatu Bata Tbk. manufactures and sells footwear products in Indonesia. The company offers leather footwear, canvas built-up footwear, casual and sports shoes, injection molded sandals/slippers, and industrial safety footwear. It is also involved in the import, export, and distribution of footwear. PT Sepatu Bata Tbk. serves retail dealers and wholesalers. The company was founded in 1931 and is headquartered in Jakarta, Indonesia. PT Sepatu Bata Tbk. is a subsidiary of Bafin (Nederland) B.V.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12430",
        "website": "http://www.bata.co.id",
        "market_cap": 831999967232
    },
    "BAYU.JK": {
        "short_name": "Bayu Buana Tbk",
        "long_name": "PT Bayu Buana Tbk",
        "summary": "PT Bayu Buana Tbk operates as a travel agent in Indonesia and internationally. The company engages in the provision of online systems for airline companies, travel insurance, travel document arrangement, and travel management services; hotel arrangement; and car rental, as well as offers tour packages.. It also offers trading and industrial development; travel bureau; transportation; and umrah services. In addition, the company acts as an airlines ticket sales agent; and organizes conventions. Additionally, the company offers its services through bayubuanatravel.com. PT Bayu Buana Tbk was founded in 1972 and is headquartered in Central Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10120",
        "website": "http://www.bayubuanatravel.com",
        "market_cap": 374414245888
    },
    "BELL.JK": {
        "short_name": "Trisula Textile Industries Tbk.",
        "long_name": "PT Trisula Textile Industries Tbk",
        "summary": "PT Trisula Textile Industries Tbk manufactures, distributes, and retails textile products in Indonesia. The company provides polyester fabrics for formal jackets and pants, suiting, and uniforms for men and women; fabrics for office and career wear collection; fabrics for tropical weather; and fabrics for apparel and accessories, such as hats, ties, scarves, shoes, belts, and others. It offers its products under the BELLINI and CATERINA brand names. The company also exports its products to Singapore, Thailand, Vietnam, Sri Lanka, India, Japan, the United States, Brazil, Mexico, Colombia, Australia, the United Kingdom, and the Middle East. PT Trisula Textile Industries Tbk was founded in 1968 and is headquartered in Cimahi, Indonesia. PT Trisula Textile Industries Tbk is a subsidiary of PT Inti Nusa Damai.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Cimahi",
        "zipcode": "40522",
        "website": "http://trisulatextile.com",
        "market_cap": 913500012544
    },
    "BIMA.JK": {
        "short_name": "Primarindo Asia Infrastructure ",
        "long_name": "PT Primarindo Asia Infrastructure Tbk.",
        "summary": "PT Primarindo Asia Infrastructure Tbk. engages in the production, marketing, and export of sports/casual shoes under the Tomkins brand name in Indonesia and internationally. The company sells its products through consignment sales cooperation with various department stores; and direct sales through its own showrooms. The company was formerly known as PT Bintang Kharisma Tbk and changed its name to PT Primarindo Asia Infrastructure Tbk. in 1997. The company was founded in 1988 and is headquartered in Jakarta, Indonesia. PT Primarindo Asia Infrastructure Tbk. is a subsidiary of PT. Golden Lestari.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10230",
        "website": "http://www.primarindo.co.id",
        "market_cap": 38315089920
    },
    "BOGA.JK": {
        "short_name": "Bintang Oto Global Tbk.",
        "long_name": "PT Bintang Oto Global Tbk",
        "summary": "PT Bintang Oto Global Tbk operates as an integrated automotive company in Indonesia. It engages in the vehicle dealership and rental business; buying and sale of used cars; and provision of vehicle maintenance and repair services. The company was founded in 2011 and is based in Malang, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Malang",
        "zipcode": null,
        "website": "http://bintangotoglobal.com",
        "market_cap": 5191818543104
    },
    "BOLA.JK": {
        "short_name": "Bali Bintang Sejahtera Tbk.",
        "long_name": "PT Bali Bintang Sejahtera Tbk",
        "summary": "PT Bali Bintang Sejahtera Tbk operates a professional football club. It operates a club under the Bali United Football Club name. The company engages in the management of football club and young football academies; and sale of jersey and merchandise the club. It is also involved in the operation of sports agencies, which include sponsor providers for soccer clubs in Indonesia, direct streaming video services, and creation of sponsor advertising videos; cafe; radio; and others. The company was founded in 1989 and is based in Denpasar, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Denpasar",
        "zipcode": "80118",
        "website": "http://www.baliutd.com",
        "market_cap": 1584000008192
    },
    "BRAM.JK": {
        "short_name": "Indo Kordsa Tbk.",
        "long_name": "PT Indo Kordsa Tbk",
        "summary": "PT Indo Kordsa Tbk manufactures, markets, and sells tire cord fabrics and yarn filaments in Indonesia, Thailand, Korea, Japan, China, Vietnam, Turkey, Taiwan, Brazil, and internationally. The company offers nylon, polyester, and rayon fibers; fiber industrial yarns; and polyester raw materials. Its products are used to produce cord fabrics, which lend strength and flexibility to tires. The company was formerly known as PT Branta Mulia Tbk and changed its name to PT Indo Kordsa Tbk in 2007. The company was founded in 1981 and is headquartered in Bogor, Indonesia. PT Indo Kordsa Tbk operates as a subsidiary of Kordsa Teknik Tekstil A.S.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bogor",
        "zipcode": "16810",
        "website": "http://www.indokordsa.com",
        "market_cap": 2362499923968
    },
    "BRNA.JK": {
        "short_name": "Berlina Tbk.",
        "long_name": "PT Berlina Tbk",
        "summary": "PT Berlina Tbk, together with its subsidiaries, provides plastic packaging solutions in Indonesia and internationally. It offers plastic laminated tubes and packages, bottle and cap plastic products, and toothbrushes. The company also engages in plastic processing, general trading, and service activities. It primarily serves multinational companies in various industries, including cosmetics, pharmacy, food and beverage, industrial goods, etc. The company was founded in 1969 and is headquartered in Bekasi, Indonesia. PT Berlina Tbk is a subsidiary of PT Dwi Satrya Utama.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bekasi",
        "zipcode": "17520",
        "website": "http://www.berlina.co.id",
        "market_cap": 1390336278528
    },
    "BUVA.JK": {
        "short_name": "Bukit Uluwatu Villa Tbk.",
        "long_name": "PT Bukit Uluwatu Villa Tbk",
        "summary": "PT Bukit Uluwatu Villa Tbk operates environmental friendly hotels and resorts in Indonesia. It operates through three segments: Hotel; Lifestyle, Recreation, and Entertainment; and Real Estate. The company primarily owns and operates Alila Ubud, Alila Manggis, Alila Villas Uluwatu, Alila SCBD, and Dialoog Banyuwangi properties. It provides hospitality, food, and beverage services; trading, construction, industrial, agricultural, printing, transportation, and workshop services; and hotel guest rooms and restaurant services. The company also sells land or villas. PT Bukit Uluwatu Villa Tbk was founded in 2000 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12190",
        "website": "http://www.buvagroup.com",
        "market_cap": 442732544000
    },
    "CARS.JK": {
        "short_name": "Industri dan Perdagangan Bintra",
        "long_name": "PT Industri dan Perdagangan Bintraco Dharma Tbk",
        "summary": "PT Industri dan Perdagangan Bintraco Dharma Tbk engages in the services, trade, workshop, property and real estate, industry, and companies investment businesses. It operates through Automotive and Financing segments. The company provides sales and after-sales vehicle services under the Nasmoco brand; automotive financing for corporates and individuals; and car finance for new or used vehicles. It is also involved in the trading activities; distribution of spare parts; and operation of car services shop. In addition, the company offers electronic system trading and management services related to automotive that are accessible through Website and software app with Android platform. The company was founded in 1969 and is headquartered in South Tangerang, Indonesia. PT Industri dan Perdagangan Bintraco Dharma Tbk is a subsidiary of PT Ahabe Niaga Selaras.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "South Tangerang",
        "zipcode": "15321",
        "website": "http://www.bintracodharma.com",
        "market_cap": 750000013312
    },
    "CBMF.JK": {
        "short_name": "Cahaya Bintang Medan Tbk.",
        "long_name": "PT Cahaya Bintang Medan Tbk",
        "summary": "PT Cahaya Bintang Medan Tbk, a furniture company, manufactures office and household appliances in Indonesia. It manufactures furniture with wood for household and office appliances, such as tables, chairs, benches, beds, cupboards, shelves, cabinets, and room dividers; furniture with rattan and or bamboo; and furniture with plastic materials comprising tables, chairs, and shelves. The company also processes furniture, such as restaurant decoration cart/food carts, supplementary materials for mattresses; spring mattress or filled/stuffed with other supplementary materials; and non-coated plastic/rubber mattresses. In addition, it trades in household furnishings; kitchen and cooking utensils; lights and fixtures; consumer electronics, such as radios, televisions, recorders, CD and DVD players, stereo equipment, and video game consoles; lighting equipment; porcelain tableware comprising glass, spoon, knife, and fork; wooden tools; woven goods; cork articles; wallpapers; and carpets, as well as retails furniture, such as tables, chairs, cabinets, beds, bookshelves, shoe racks, sideboards, mattresses, and pillows/bolsters. Further, the company offers coating, finishing, repair, and restoration services for home furnishings and equipment, office furniture, and self-standing furniture, as well as invests in other companies. PT Cahaya Bintang Medan Tbk was founded in 2012 and is headquartered in Deli Serdang, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Deli Serdang",
        "zipcode": "20361",
        "website": "http://www.cbm-furniture.com",
        "market_cap": 262500007936
    },
    "CINT.JK": {
        "short_name": "Chitose Internasional Tbk.",
        "long_name": "PT Chitose Internasional Tbk",
        "summary": "PT Chitose Internasional Tbk, together with its subsidiaries, manufactures and sells steel furniture for offices, hotels, hospitals, home, schools, and public facilities primarily in Indonesia. It offers folding-chairs; folding chairs + memos; hotel-banquet and restaurant chairs and tables; working and meeting products, including office and meeting chairs, desks and tables, racks and storage products, and lobby space products, as well as office shelves; school education and hospital items; and accessories. The company markets its products through a network of distributors and agents. It also exports its products to Saudi Arabia, the United Arab Emirates, Thailand, South Africa, Sri Lanka, Brunei, Hong Kong, Taiwan, Malaysia, Singapore, Japan, Germany, England, Egypt, the United States, South Korea, Australia, and New Zealand. The company was formerly known as PT Chitose Indonesia Manufacturing Limited and changed its name to PT Chitose Internasional Tbk in 2013. PT Chitose Internasional Tbk was founded in 1979 and is based in Cimahi, Indonesia. PT Chitose Internasional Tbk is a subsidiary of PT Tritirta Inti Mandiri.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Cimahi",
        "zipcode": "40533",
        "website": "http://www.chitose-indonesia.com",
        "market_cap": 216000004096
    },
    "CLAY.JK": {
        "short_name": "Citra Putra Realty Tbk.",
        "long_name": "PT Citra Putra Realty Tbk",
        "summary": "PT Citra Putra Realty Tbk engages in the property and hospitality business in Indonesia. The company operates hotels. The company was founded in 2009 and is headquartered in Jakarta, Indonesia. PT Citra Putra Realty Tbk is a subsidiary of PT Citra Putra Mandiri.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10310",
        "website": "http://cpr.co.id",
        "market_cap": 2338699870208
    },
    "CNTX.JK": {
        "short_name": "Century Textile Industry Tbk.",
        "long_name": "PT Century Textile Industry Tbk",
        "summary": "PT Century Textile Industry Tbk engages in the textiles business in Indonesia and internationally. The company offers T/C, CVC, dobby, and oxford fabrics used for shirts and uniforms. It also exports its products primarily to the United States, Japan, and the United Kingdom. The company was founded in 1970 and is based in Jakarta Timur, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Timur",
        "zipcode": "13740",
        "website": "http://www.toray.co.id/centex/",
        "market_cap": 38799998976
    },
    "CSIS.JK": {
        "short_name": "Cahayasakti Investindo Sukses T",
        "long_name": "PT Cahayasakti Investindo Sukses Tbk",
        "summary": "PT Cahayasakti Investindo Sukses Tbk engages in the furniture trading and construction service businesses in Indonesia and internationally. It operates through two segments, Construction Services and Furniture Project. The company is also involved in the wood working, handcraft, household, timber processing, general trading, distribution, agency and representative, and franchising businesses. In addition, it undertakes building and general works, including residential housing, industrial area, buildings, factories, roads, bridges, waterways, irrigation, excavation, retaining, electric installation, telephone, plumbing, gas, and other related works; and provides planning, implementation, and supervisory services. Further, the company develops and manages real estate properties; and rents spaces in stores. Additionally, it acts as a distributor, wholesaler, dealer, supplier, and commission house. The company was founded in 1995 and is headquartered in Bogor, Indonesia. PT Cahayasakti Investindo Sukses Tbk is a subsidiary of PT Andalan Utama Bintara.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bogor",
        "zipcode": "16151",
        "website": "http://www.csis.co.id",
        "market_cap": 101946007552
    },
    "CSMI.JK": {
        "short_name": "Cipta Selera Murni Tbk.",
        "long_name": "PT Cipta Selera Murni Tbk",
        "summary": "PT Cipta Selera Murni Tbk, together with its subsidiaries, engages in the fast food restaurant business in Indonesia. It offers french fries, honey butter biscuits, mashed potatoes, coleslaw, mixed salad, chicken soup, liver, and gizzard; spicy, white, and fried rice; and potato cutlets, chicken chunks, sphaghetti, spicy and original chicken tender, burger, and wraps. The company also offers mineral water; soft, bottled, and hot drinks; and ice creams. In addition, it trades in household appliances and equipment, consumer electronics, stereo equipment, video game consoles, lighting equipment, porcelain and glass drinking utensils, and other appliances, as well as spoons, knives, forks, tools made of wood, articles of plaiting and articles of cork, wallpaper, carpets etc. As of April 2, 2020, the company operated 37 outlets under the Texas chicken brand name. PT Cipta Selera Murni Tbk was founded in 1983 and is headquartered in Jakarta Pusat, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10330",
        "website": "http://ciptaseleramurni.co.id",
        "market_cap": 2293134262272
    },
    "DAYA.JK": {
        "short_name": "Duta Intidaya Tbk.",
        "long_name": "PT Duta Intidaya Tbk",
        "summary": "PT Duta Intidaya Tbk operates as a beauty and health retailer in Indonesia. The company offers medicine, pharmacy goods, medical and wellness equipment, personal and skin care products, perfume and cosmetics, baby products, and general merchandise in stores and pharmacies. It also trades in food and beverages. In addition, the company acts as an agent, representative, sole agent, distributor, and purveyor, as well as a franchise and supplier of various traded goods. As of December 31, 2019, the company operated a network of 140 stores in Java and Bali Island, Kalimantan, Yogyakarta, Banten, Jakarta, Sumatera, and Sulawesi under the Watsons brand. PT Duta Intidaya Tbk also operates online stores at Shopee.com, Lazada.com, Blibli.com, and Bukalapak.com, as well as at Halodoc platform and bima+ App. The company was founded in 2005 and is based in South Jakarta, Indonesia. PT Duta Intidaya Tbk is a subsidiary of Total Alliance Holdings Limited.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "South Jakarta",
        "zipcode": "12870",
        "website": "http://www.watsons.biz.id",
        "market_cap": 663230676992
    },
    "DUCK.JK": {
        "short_name": "Jaya Bersama Indo Tbk.",
        "long_name": "PT Jaya Bersama Indo Tbk",
        "summary": "PT Jaya Bersama Indo Tbk, together with its subsidiaries, operates various Chinese restaurants in Indonesia. It operates 31 restaurant outlets primarily under the brand names of The Duck King Group, Fook Yew, and Panda Bowl. The company was founded in 2003 and is based in West Jakarta, Indonesia. PT Jaya Bersama Indo Tbk is a subsidiary of PT Asia Kuliner Sejahtera.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "West Jakarta",
        "zipcode": null,
        "website": "http://www.ptjbi.id",
        "market_cap": 227149414400
    },
    "EAST.JK": {
        "short_name": "Eastparc Hotel Tbk.",
        "long_name": "PT Eastparc Hotel Tbk",
        "summary": "PT Eastparc Hotel Tbk owns and operates hotels in Indonesia. It operates Eastparc Hotel, a 5 star hotel with 189 guestrooms located in Yogyakarta. PT Eastparc Hotel Tbk is based in Yogyakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Yogyakarta",
        "zipcode": "55281",
        "website": "http://www.eastparchotel.com",
        "market_cap": 274692620288
    },
    "ECII.JK": {
        "short_name": "Electronic City Indonesia Tbk.",
        "long_name": "PT Electronic City Indonesia Tbk",
        "summary": "PT Electronic City Indonesia Tbk engages in the trade of electronic goods in Indonesia. It operates through three segments: Sales of Branded Electronic Goods, Rents, and Others. The company offers products in the categories of home appliances, audio and video, IT and mobile devices, and camera and office equipment. It sells its products through online stores. The company is also involved in the property business. PT Electronic City Indonesia Tbk was founded in 2001 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12190",
        "website": "http://eci.id",
        "market_cap": 1226399940608
    },
    "EPAC.JK": {
        "short_name": "Megalestari Epack Sentosaraya T",
        "long_name": "PT Megalestari Epack Sentosaraya Tbk",
        "summary": "PT Megalestari Epack Sentosaraya Tbk engages in plastic packaging business in Indonesia. The company is headquartered in Tangerang, Indonesia. PT Megalestari Epack Sentosaraya Tbk is a subsidiary of ePac Flexibles Asia Pte. Ltd.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang",
        "zipcode": "15570",
        "website": "http://www.epack.co.id",
        "market_cap": 168473395200
    },
    "ERAA.JK": {
        "short_name": "Erajaya Swasembada Tbk.",
        "long_name": "PT Erajaya Swasembada Tbk",
        "summary": "PT Erajaya Swasembada Tbk imports, distributes, and retails mobile telecommunication products in Indonesia. The company offers mobile phones and tablets, subscriber identity module cards, prepaid mobile vouchers, accessories, Internet of Things devices, and Google Play gift cards; computers and other electronic devices; and trades in medical equipment, as well as provides value added services, including mobile phones protection and cellphone leasing services. It also engages in information technology system; management consulting; outsourcing; and property businesses. The company was founded in 1996 and is headquartered in West Jakarta, Indonesia. PT Erajaya Swasembada Tbk is a subsidiary of PT Eralink International.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Barat",
        "zipcode": "11240",
        "website": "http://www.erajaya.com",
        "market_cap": 10731487494144
    },
    "ERTX.JK": {
        "short_name": "Eratex Djaja Tbk.",
        "long_name": "PT Eratex Djaja Tbk",
        "summary": "PT Eratex Djaja Tbk manufactures and sells garments in Indonesia and internationally. It is involved in spinning, weaving, dyeing, finishing, printing, false twisting, and knitting. The company's products include jeans, casual dress pants, denims, and Italian twills. It is also involved in the general trading business. The company was founded in 1972 and is headquartered in Surabaya, Indonesia. PT Eratex Djaja Tbk is a subsidiary of PT Buana Indah Garment.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Surabaya",
        "zipcode": "60226",
        "website": "http://www.eratexco.com",
        "market_cap": 231577206784
    },
    "ESIP.JK": {
        "short_name": "Sinergi Inti Plastindo Tbk.",
        "long_name": "PT Sinergi Inti Plastindo Tbk",
        "summary": "PT Sinergi Inti Plastindo Tbk provides plastic packaging products in Indonesia and internationally. It offers low and high density polyethylene products, such as T-shirt bags, soft loop handle bags, poly draw bags, and patch handle bags. The company was founded in 2001 and is headquartered in South Jakarta, Indonesia. PT Sinergi Inti Plastindo Tbk is a subsidiary of PT Tanindo Omega Pasifik.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "South Jakarta",
        "zipcode": "12220",
        "website": "http://sinergiplastama.co.id",
        "market_cap": 47360000000
    },
    "ESTA.JK": {
        "short_name": "Esta Multi Usaha Tbk.",
        "long_name": "PT Esta Multi Usaha Tbk",
        "summary": "PT Esta Multi Usaha Tbk owns and operates a hotel under the Hotel 88 name in Indonesia. The company's Hotel 88 operates a total of 70 rooms located in Bekasi City. It also engages in the rental of shops, as well as rental and trade of passenger cars. The company was formerly known as PT Esta Asri Propertindo and changed its name to PT Esta Multi Usaha Tbk in September 2019. PT Esta Multi Usaha Tbk was founded in 2011 and is headquartered in South Tangerang, Indonesia. PT Esta Multi Usaha Tbk is a subsidiary of PT Esta Utama Corpora.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "South Tangerang",
        "zipcode": "15318",
        "website": "http://www.estamultiusaha.co.id",
        "market_cap": 62999998464
    },
    "ESTI.JK": {
        "short_name": "Ever Shine Tex Tbk.",
        "long_name": "PT Ever Shine Tex Tbk",
        "summary": "PT Ever Shine Tex Tbk, together with its subsidiaries, manufactures and sells synthetic yarns and fabrics in Indonesia. The company's Yarn division offers nylon filament, draw textured, air textured, micro, high stretch, dope dyed, and melange and special yarns, as well as polyester high stretch and air textured yarns under the PRS brand for use in various industries, such as circular and warp knitting, elastic, embroidery, fancy yarn, fashion garments, gloves, labels, lingerie, ribbons, sewing threads, socks and hosiery, and sweater. Its Fabric division provides nylon, polyester, and nylon/polyester blended woven fabrics, as well as warp knitting fabrics for garment and lifestyle industries. It also produces special applications fabrics for use in automotive, home furnishings, and outdoor industries, including decorations, furniture, outdoor tents, sleeping bags, car seat covers, and others. The company offers its products under the APL 10000, APOLLO, HUT 1080, DECOTEX, LININGTEX, and PRO-COTTON brand names. It also exports its products. PT Ever Shine Tex Tbk was founded in 1973 and is headquartered in Jakarta, Indonesia. PT Ever Shine Tex Tbk is a subsidiary of PT Cahaya Interkontinental.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10250",
        "website": "http://www.evershinetex.com",
        "market_cap": 213612265472
    },
    "FAST.JK": {
        "short_name": "Fast Food Indonesia Tbk.",
        "long_name": "PT Fast Food Indonesia Tbk",
        "summary": "PT Fast Food Indonesia Tbk engages in the food and restaurant activities in Indonesia. The company holds the rights to establish and operate Kentucky Fried Chicken (KFC) outlets. As of December 31, 2019, it operated 748 restaurant outlets. The company was founded in 1978 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12810",
        "website": "http://www.kfcku.com",
        "market_cap": 4007005257728
    },
    "FITT.JK": {
        "short_name": "Hotel Fitra International Tbk.",
        "long_name": "PT Hotel Fitra International Tbk",
        "summary": "PT Hotel Fitra International Tbk owns and operates hotels in Indonesia. The company operates Fitra Hotel, a three-star hotel with 113 rooms located in Majalengka. It also provides travel and tourism services. The company is based in Majalengka, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Majalengka",
        "zipcode": "45418",
        "website": "http://www.hotelfitra.com",
        "market_cap": 95400001536
    },
    "GDYR.JK": {
        "short_name": "Goodyear Indonesia Tbk.",
        "long_name": "PT Goodyear Indonesia Tbk",
        "summary": "PT Goodyear Indonesia Tbk manufactures and sells tires for automobiles, airplanes, and related components in Indonesia and internationally. The company also imports, exports, and distributes tires, inner tubes, flaps, and other rubber derivative products. As of December 31, 2019, it owned 47 Autocare outlets. The company was formerly known as NV The Goodyear Tire & Rubber Company Limited and changed its name to PT Goodyear Indonesia Tbk in July 1978. PT Goodyear Indonesia Tbk was founded in 1917 and is headquartered in Bogor, Indonesia. PT Goodyear Indonesia Tbk is a subsidiary of The Goodyear Tire & Rubber Company.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bogor",
        "zipcode": "16161",
        "website": "http://www.goodyear-indonesia.com",
        "market_cap": 645749997568
    },
    "GEMA.JK": {
        "short_name": "Gema Grahasarana Tbk.",
        "long_name": "PT Gema Grahasarana Tbk",
        "summary": "PT Gema Grahasarana Tbk operates as an interior contractor and furniture manufacturer in Indonesia and internationally. It offers a range of products and services, such as interior fit-outs, furniture and panel manufacturing, mechanical and electrical installation, maintenance, and logistics. The company also manufactures and sells customized, modular, home and office, and hospitality furniture. In addition, the company is involved in trading laminated material interior and furniture; house, and office furniture and equipment; and interior and furniture components. It serves banking and financial institutions; oil, gas, and mining, as well as retail and hospitality industries; and multinational company and others. The company was founded in 1984 and is headquartered in West Jakarta, Indonesia. PT Gema Grahasarana Tbk is a subsidiary of PT Virucci Indogriya Sarana.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Barat",
        "zipcode": "11480",
        "website": "http://www.ggs-interior.com",
        "market_cap": 543999983616
    },
    "GH8.F": {
        "short_name": "PT GAJAH TUNG.  RP 500",
        "long_name": "PT. Gajah Tunggal Tbk",
        "summary": "PT. Gajah Tunggal Tbk produces and distributes tires for passenger cars, SUVs, commercial vehicles, off-the-road vehicles, industrial vehicles, and motorcycles. It also manufactures and sells other rubber related products, such as synthetic rubber, tire cords, inner tube, flap, o-ring, and other products, as well as nylon filament yarn, polyester chips as raw materials for nylon cord, and fishing net yarn. In addition, the company engages in general trading activities. It markets its products in Indonesia, the United States, Asia, Europe, the Middle East, Africa, Australia, and Oceania. The company was founded in 1951 and is headquartered in Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10120",
        "website": "http://www.gt-tires.com",
        "market_cap": 131975512
    },
    "GJTL.JK": {
        "short_name": "Gajah Tunggal Tbk.",
        "long_name": "PT. Gajah Tunggal Tbk",
        "summary": "PT. Gajah Tunggal Tbk produces and distributes tires for passenger cars, SUVs, commercial vehicles, off-the-road vehicles, industrial vehicles, and motorcycles. It also manufactures and sells other rubber related products, such as synthetic rubber, tire cords, inner tube, flap, o-ring, and other products, as well as nylon filament yarn, polyester chips as raw materials for nylon cord, and fishing net yarn. In addition, the company engages in general trading activities. It markets its products in Indonesia, the United States, Asia, Europe, the Middle East, Africa, Australia, and Oceania. The company was founded in 1951 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10120",
        "website": "http://www.gt-tires.com",
        "market_cap": 3048858976256
    },
    "GLOB.JK": {
        "short_name": "Global Teleshop Tbk.",
        "long_name": "PT Global Teleshop Tbk",
        "summary": "PT Global Teleshop Tbk engages in the retail and distribution of cellular phones and operator products in Indonesia. It operates through Cellular Phones, Reload vouchers, Content, and Other segments. The company offers smart phones, tablets, computers, audio products, wearable devices, gadget accessories, and lifestyle and travel products, and fashion and accessories. As of December 31, 2019, the company operated 43 Global Teleshop outlets and service centers. The company was formerly known as PT Pro Empower Perkasa. The company was founded in 2007 and is based in Jakarta Pusat, Indonesia. PT Global Teleshop Tbk operates as a subsidiary of PT Trikomsel Oke Tbk.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10340",
        "website": null,
        "market_cap": 311110795264
    },
    "HADE.JK": {
        "short_name": "Himalaya Energi Perkasa Tbk.",
        "long_name": "PT Himalaya Energi Perkasa Tbk",
        "summary": "PT Himalaya Energi Perkasa Tbk provides financial advisory services. The company offers offline and online trading services; underwriting services; and financial advisory services, such as corporate actions, including merger and acquisition, limited public offering, restructuring, and financing transaction. It also provides trade and debt syndication, and sector financing services. In addition, the company engages in the debt origination, underwriting, securitization, and trading of asset backed securities activities, such as the securitization of housing loans, commercial property, automobile, and credit card; and provision of marketing and distribution services for the products selling, government, corporate, sukuk, and Repo bonds for institutional investor clients, such as banks, pension funds, insurance companies, government agencies, cooperative employees, and financial institutions. Further, it provides liquefied petroleum gas refueling services. The company was formerly known as PT HD Capital Tbk. PT Himalaya Energi Perkasa Tbk was founded in 1989 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "South Jakarta",
        "zipcode": "12210",
        "website": "http://www.hdx.co.id",
        "market_cap": 105999998976
    },
    "HERO.JK": {
        "short_name": "Hero Supermarket Tbk.",
        "long_name": "PT Hero Supermarket Tbk",
        "summary": "PT Hero Supermarket Tbk engages in the retail business primarily in Indonesia. It operates through Food and Non Food segments. The company operates supermarket, hypermarket, and specialty stores, including pharmacy, drugs stores, health and beauty stores, home furnishing stores, etc. As of December 31, 2019, it operated 22 Hero supermarkets, 100 Giant stores comprising Giant Ekspres and Giant Ekstra, 293 Guardian stores, and 2 IKEA stores. The company was founded in 1971 and is headquartered in South Tangerang, Indonesia. PT Hero Supermarket Tbk is a subsidiary of Mulgrave Corporation B.V.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "South Tangerang",
        "zipcode": "15224",
        "website": "http://www.hero.co.id",
        "market_cap": 3953530503168
    },
    "HOTL.JK": {
        "short_name": "Saraswati Griya Lestari Tbk.",
        "long_name": "PT. Saraswati Griya Lestari Tbk",
        "summary": "PT. Saraswati Griya Lestari Tbk operates in the field of hospitality in Indonesia. It operates in two segments, Hotel and Property. It operates hotels, condotels, and resorts. The company was founded in 2006 and is headquartered in South Jakarta, Indonesia. PT. Saraswati Griya Lestari Tbk is a subsidiary of PT Tiara Realty.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12210",
        "website": "http://www.saraswatigriyalestari.com",
        "market_cap": 177500012544
    },
    "HRME.JK": {
        "short_name": "Menteng Heritage Realty Tbk.",
        "long_name": "PT Menteng Heritage Realty Tbk",
        "summary": "PT Menteng Heritage Realty Tbk, together with its subsidiaries, owns and operates hotels in Indonesia. The company owns The Hermitage, a hotel located in Menteng, Central Jakarta. It is also involved in mining; general trading and services; and sea and domestic transportation businesses. The company was formerly known as PT Citra Prestasi Abadi and changed its name to PT Menteng Heritage Realty Tbk in October 2007. The company was founded in 2007 and is based in Jakarta, Indonesia. PT Menteng Heritage Realty Tbk is a subsidiary of PT Wijaya Wisesa Realty.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10310",
        "website": "http://www.hrme.co.id",
        "market_cap": 339648774144
    },
    "HRTA.JK": {
        "short_name": "Hartadinata Abadi Tbk.",
        "long_name": "PT Hartadinata Abadi Tbk",
        "summary": "PT Hartadinata Abadi Tbk manufactures and sells gold jewelry products in Indonesia. The company offers necklaces, rings, pendants, earrings, and bracelets. It sells its products through its retail and online stores. The company also provides franchising opportunities for its stores. As of 31, December, 2019 the company operated 26 stores under the Aurum Colection Center (ACC) name, 3 outlets under the Claudia Perfect Jewelery name, and 3 outlets under the Celine Jewelery name. The company was founded in 2003 and is headquartered in Bandung, Indonesia. PT Hartadinata Abadi Tbk is a subsidiary of PT Terang Anugrah Abadi.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bandung",
        "zipcode": "40228",
        "website": "http://www.hartadinata.com",
        "market_cap": 1206578053120
    },
    "ICON.JK": {
        "short_name": "Island Concepts Indonesia Tbk.",
        "long_name": "PT Island Concepts Indonesia Tbk",
        "summary": "PT Island Concepts Indonesia Tbk engages in the catering and maintenance services in Indonesia. The company also provides accommodation services. In addition, it engages in the sale of house, and lot and condotel; and property development activities. The company was founded in 2001 and is based in Kuta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Kuta",
        "zipcode": "80361",
        "website": "http://www.islandconcepts.com",
        "market_cap": 107885248512
    },
    "IDSA.SG": {
        "short_name": "Indomobil Sukses Intl TBK,PT Re",
        "long_name": "PT Indomobil Sukses Internasional Tbk",
        "summary": "PT Indomobil Sukses Internasional Tbk, together with its subsidiaries, engages in the integrated automotive business in Indonesia. The company operates through four segments: Automotive, Financial Services, Rental and Services, and Others. The company distributes vehicles and spare parts, as well as fuel; assembles vehicle; manufactures automotive parts/component; and provides after sales services, vehicle financing, car rental, used cars trading, logistics, non-formal education services, and other related supporting services, as well as acts as a trademark license holder. Its products include two-wheel and four-wheel vehicles, buses, trucks, and heavy equipment. The company offers products of Audi, Bandit, Datsun, HIAB, Hino, John Deere, Kalmar, KIA, Manitou, Nissan, Renault Trucks, SDLG, Suzuki, Volkswagen, Volvo Bus, Volvo Construction Equipment, and Volvo Trucks brands. In addition, it is involved in the rental and building management activities; operation of gas stations; mining, plantation, and forestry contracting business; industrial plantations management; and transportation and logistics businesses. Further, the company provides e-learning, manpower, and data processing services; and automotive services, such as dealership, workshop, and financing. The company was founded in 1987 and is headquartered in Jakarta, Indonesia. PT Indomobil Sukses Internasional Tbk is a subsidiary of Gallant Venture Ltd.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "13330",
        "website": "http://www.indomobil.com",
        "market_cap": 225866432
    },
    "IGAR.JK": {
        "short_name": "Champion Pacific Indonesia Tbk.",
        "long_name": "PT Champion Pacific Indonesia Tbk",
        "summary": "PT Champion Pacific Indonesia Tbk, together with its subsidiaries, manufactures, supplies, and sells flexible packaging products in Indonesia. It offers various plastic products for the pharmaceutical, food, and cosmetic industries. The company was formerly known as PT Kageo Igar Jaya Tbk and changed its name to PT Champion Pacific Indonesia Tbk in October 2010. The company was founded in 1975 and is headquartered in Bekasi, Indonesia. PT Champion Pacific Indonesia Tbk is a subsidiary of PT Kingsford Holdings.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bekasi",
        "zipcode": "17133",
        "website": "http://www.champion.co.id",
        "market_cap": 414158913536
    },
    "IKAI.JK": {
        "short_name": "Intikeramik Alamasri Industri T",
        "long_name": "PT Intikeramik Alamasri Industri Tbk",
        "summary": "PT Intikeramik Alamasri Industri Tbk, together with its subsidiaries, manufactures, distributes, and sells porcelain tiles in Indonesia and internationally. The company operates in two segments, Ceramic Industry and Hotel Industry. It also engages in the hospitality business. The company was founded in 1991 and is based in Central Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "12870",
        "website": "http://intikeramik.com",
        "market_cap": 665290014720
    },
    "IMAS.JK": {
        "short_name": "Indomobil Sukses Internasional ",
        "long_name": "PT Indomobil Sukses Internasional Tbk",
        "summary": "PT Indomobil Sukses Internasional Tbk, together with its subsidiaries, engages in the integrated automotive business in Indonesia. The company operates through four segments: Automotive, Financial Services, Rental and Services, and Others. The company distributes vehicles and spare parts, as well as fuel; assembles vehicle; manufactures automotive parts/component; and provides after sales services, vehicle financing, car rental, used cars trading, logistics, non-formal education services, and other related supporting services, as well as acts as a trademark license holder. Its products include two-wheel and four-wheel vehicles, buses, trucks, and heavy equipment. The company offers products of Audi, Bandit, Datsun, HIAB, Hino, John Deere, Kalmar, KIA, Manitou, Nissan, Renault Trucks, SDLG, Suzuki, Volkswagen, Volvo Bus, Volvo Construction Equipment, and Volvo Trucks brands. In addition, it is involved in the rental and building management activities; operation of gas stations; mining, plantation, and forestry contracting business; industrial plantations management; and transportation and logistics businesses. Further, the company provides e-learning, manpower, and data processing services; and automotive services, such as dealership, workshop, and financing. The company was founded in 1987 and is headquartered in Jakarta, Indonesia. PT Indomobil Sukses Internasional Tbk is a subsidiary of Gallant Venture Ltd.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "13330",
        "website": "http://www.indomobil.com",
        "market_cap": 3894432759808
    },
    "INDO.JK": {
        "short_name": "Royalindo Investa Wijaya Tbk.",
        "long_name": "PT Royalindo Investa Wijaya Tbk",
        "summary": "PT Royalindo Investa Wijaya, through its subsidiaries, operates boarding facilities in Indonesia. The company operates two boarding facilities, including the PJ Mansion boarding house and Puri Cempaka 04 boarding house located in Central Jakarta. PT Royalindo Investa Wijaya was founded in 2005 and is based in Central Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Central Jakarta",
        "zipcode": "10350",
        "website": "http://royalindo.id",
        "market_cap": 568809095168
    },
    "INDR.JK": {
        "short_name": "Indo-Rama Synthetics Tbk.",
        "long_name": "PT. Indo-Rama Synthetics Tbk",
        "summary": "PT. Indo-Rama Synthetics Tbk, together with its subsidiaries, produces and sells polyester, spun yarns, and fabrics in Indonesia, the rest of Asia, Europe, North America, South America, and internationally. It offers spun yarns, sewing threads, polyester filament yarns, polyester staple fiber, chips, pet resins, grey and finished polyester fabrics, nitrogen and phosphate fertilizers, polyethylene, polypropylene, polyester, textiles, cotton fiber, medical gloves, and polyester feedstocks. The company engages in trading, investment, and other activities; and management of office and school buildings. It also exports its products. The company was founded in 1975 and is based in Jakarta, Indonesia. PT. Indo-Rama Synthetics Tbk is a subsidiary of Indorama Corporation Pte. Ltd.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12950",
        "website": "http://www.indorama.com",
        "market_cap": 2846431117312
    },
    "INDS.JK": {
        "short_name": "Indospring Tbk.",
        "long_name": "PT Indospring Tbk",
        "summary": "PT Indospring Tbk manufactures and sells leaf and coil springs to the automotive industry in South East Asia. It offers parabolic, trailing, and yoko-oki leaf springs; and tension, compression, valve, and hot coil springs, as well as wire rings and stabilizer bars. The company was founded in 1978 and is based in Gresik, Indonesia. PT Indospring Tbk is a subsidiary of PT Indoprima Gemilang.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Gresik",
        "zipcode": "61123",
        "website": "http://www.indospring.co.id",
        "market_cap": 1164843679744
    },
    "INPP.JK": {
        "short_name": "Indonesian Paradise Property Tb",
        "long_name": "PT Indonesian Paradise Property Tbk",
        "summary": "PT Indonesian Paradise Property Tbk develops, owns, and operates hotels and resorts in Indonesia. The company also engages in the real estate, general trading, and development businesses, as well as in the ownership of shopping centers, office buildings, and apartments. The company was formerly known as PT Penta Karsa Lubrindo and changed its name to PT Indonesian Paradise Property Tbk in 2004. PT Indonesian Paradise Property Tbk was founded in 1996 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12930",
        "website": "http://www.theparadise-group.com",
        "market_cap": 7771490091008
    },
    "IPOL.JK": {
        "short_name": "Indopoly Swakarsa Industry Tbk.",
        "long_name": "PT Indopoly Swakarsa Industry Tbk",
        "summary": "PT Indopoly Swakarsa Industry Tbk, together with its subsidiaries, operates as a flexible-packaging manufacturing company in Indonesia, China, Singapore, and the United States. It operates through three segments: Cigarette Packaging, Food Packaging, and Specialty Films. The company manufactures and sells biaxially oriented polypropylene films for cigarette and food packaging, labeling, graphic media, custom overwrap/custom purpose, and green packaging segments; and biaxially oriented polyester films for food packaging, custom overwrap/custom purpose, and graphic media film segments. It is also involved in the investment business. The company markets its products under the Ilene brand name. PT Indopoly Swakarsa Industry Tbk was founded in 1995 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12910",
        "website": "http://www.ilenefilms.com",
        "market_cap": 1011610681344
    },
    "IUD.SG": {
        "short_name": "PT Champion Pacific Indonesia R",
        "long_name": "PT Champion Pacific Indonesia Tbk",
        "summary": "PT Champion Pacific Indonesia Tbk, together with its subsidiaries, manufactures, supplies, and sells flexible packaging products in Indonesia. It offers various plastic products for the pharmaceutical, food, and cosmetic industries. The company was formerly known as PT Kageo Igar Jaya Tbk and changed its name to PT Champion Pacific Indonesia Tbk in October 2010. The company was founded in 1975 and is headquartered in Bekasi, Indonesia. PT Champion Pacific Indonesia Tbk is a subsidiary of PT Kingsford Holdings.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bekasi",
        "zipcode": "17133",
        "website": "http://www.champion.co.id",
        "market_cap": 27446004
    },
    "JAK1.MU": {
        "short_name": "JAKARTA HOTEL  RP 500",
        "long_name": "PT Jakarta International Hotels & Development Tbk",
        "summary": "PT Jakarta International Hotels & Development Tbk, through its subsidiaries, engages in the hotel and property businesses in Indonesia. It operates through four segments: Hotel, Real Estate, Telecommunication Services, and Hotel Management Services. The Hotel segment owns and operates two hotels under the Hotel Borobudur Jakarta and Ritz-Carlton Pacific Place names. The Real Estate segment engages in the real estate development business and services, including the construction of office buildings, shopping malls, and trade centers, as well as their supporting facilities; leasing of office buildings and rooms, and shopping mall complex units, as well as their supporting facilities; provision of infrastructures and facilities for integrated commercial centers construction, commercialization, and development; and provision of general services with the exception of legal and financial services. The Telecommunication Services segment offers telecommunication service management, closed fixed network, Internet service provider and its feature, and data center and managed services. The Hotel Management Services segment manages and operates Hotel Borobudur Jakarta, Discovery Kartika Plaza Hotel, Discovery Hotel & Convention Ancol, and Palace Hotel Cipanas. The company also engages in the tourism and related activities; and apartment development and trading businesses. PT Jakarta International Hotels & Development Tbk was founded in 1969 and is headquartered in Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12190",
        "website": "http://www.jihd.co.id",
        "market_cap": 57359936
    },
    "JIHD.JK": {
        "short_name": "Jakarta International Hotels & ",
        "long_name": "PT Jakarta International Hotels & Development Tbk",
        "summary": "PT Jakarta International Hotels & Development Tbk, through its subsidiaries, engages in the hotel and property businesses in Indonesia. It operates through four segments: Hotel, Real Estate, Telecommunication Services, and Hotel Management Services. The Hotel segment owns and operates two hotels under the Hotel Borobudur Jakarta and Ritz-Carlton Pacific Place names. The Real Estate segment engages in the real estate development business and services, including the construction of office buildings, shopping malls, and trade centers, as well as their supporting facilities; leasing of office buildings and rooms, and shopping mall complex units, as well as their supporting facilities; provision of infrastructures and facilities for integrated commercial centers construction, commercialization, and development; and provision of general services with the exception of legal and financial services. The Telecommunication Services segment offers telecommunication service management, closed fixed network, Internet service provider and its feature, and data center and managed services. The Hotel Management Services segment manages and operates Hotel Borobudur Jakarta, Discovery Kartika Plaza Hotel, Discovery Hotel & Convention Ancol, and Palace Hotel Cipanas. The company also engages in the tourism and related activities; and apartment development and trading businesses. PT Jakarta International Hotels & Development Tbk was founded in 1969 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12190",
        "website": "http://www.jihd.co.id",
        "market_cap": 1010803277824
    },
    "KBAG.JK": {
        "short_name": "Karya Bersama Anugerah Tbk.",
        "long_name": "PT Karya Bersama Anugerah Tbk",
        "summary": "PT Karya Bersama Anugerah Tbk engages in the real estate development business. It constructs Rusunami dwellings, landed houses, and shop-houses. The company was founded in 2014 and is headquartered in Balikpapan, Indonesia. PT Karya Bersama Anugerah Tbk is a subsidiary of PT Visi Kota Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Balikpapan",
        "zipcode": "76114",
        "website": "http://www.kbag.co.id",
        "market_cap": 357499994112
    },
    "KDSI.JK": {
        "short_name": "Kedawung Setia Industrial Tbk.",
        "long_name": "PT Kedawung Setia Industrial Tbk",
        "summary": "PT Kedawung Setia Industrial Tbk, together with its subsidiary, manufactures and sells enamel products in Indonesia. The company offers enamel houseware, corrugated carton boxes, and egg tray boxes. It also exports its products. The company was founded in 1973 and is headquartered in Surabaya, Indonesia. PT Kedawung Setia Industrial Tbk is a subsidiary of PT Kitasubur Utama.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Surabaya",
        "zipcode": "60221",
        "website": "http://www.kedawungsetia.com",
        "market_cap": 362474995712
    },
    "KICI.JK": {
        "short_name": "Kedaung Indah Can Tbk",
        "long_name": "PT Kedaung Indah Can Tbk",
        "summary": "PT Kedaung Indah Can Tbk manufactures and sells enamel-on-steel cookware and can/tin products in Indonesia. The company operates through two segments, Enamelware and Can. It offers various stock pots, steamer cooker sets, ovens, deep stock pot gradations, pasta cooker sets, deep stock pots, and stock pots with steamer; roasters comprising lasagna pans, oval roasters, and fry pans; cookware sets; and storage bowls, such as soup bowls, salad bowls, mixing bowl sets, deep bowl sets, basins, serving bowls, preparation bowl sets, and fancy bowl sets. The company also provides tableware products, including plates and colanders; tea kettles; and lunch carriers, trays, canister sets, cookie tins, kerosene stoves, mugs, and milk pans. In addition, the company provides metal printing services. It also exports its products. The company was founded in 1974 and is based in Surabaya, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Surabaya",
        "zipcode": "60293",
        "website": "http://www.kedaungindahcan.com",
        "market_cap": 77280002048
    },
    "KMTR.JK": {
        "short_name": "Kirana Megatara Tbk.",
        "long_name": "PT Kirana Megatara Tbk",
        "summary": "PT Kirana Megatara Tbk, together with its subsidiaries, produces crumb rubber in Indonesia. The company produces SIR 10, SIR 20, and SIR 20 CV type crumb rubber. Its SIR products are exported to tire manufacturers worldwide. The company was founded in 1964 and is headquartered in South Jakarta, Indonesia. PT Kirana Megatara Tbk operates as a subsidiary of HSF (S) Pte. Ltd.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12950",
        "website": "http://www.kiranamegatara.com",
        "market_cap": 3483317043200
    },
    "KONI.JK": {
        "short_name": "Perdana Bangun Pusaka Tbk",
        "long_name": "PT Perdana Bangun Pusaka Tbk",
        "summary": "PT Perdana Bangun Pusaka Tbk sells and distributes photographic products. The company's photographic products include photographic paper, chemical supplies, films, vinyl/flex banners, frames, and other finished goods, as well as color papers, inkjet papers, dye sub printers, photo printers, minilabs, and DNP media printers. It also provides auto processors, cassettes, grids, hangers, screens, chemical products, X-ray films, and USG papers for conventional medical uses; and CR and DR systems, digital media products, LED viewers, and scanners for medical digital imaging uses, as well as hard disk drives. In addition, the company leases office spaces. It operates through retail stores or representative offices that are located in 15 geographic areas in Indonesia. The company was formerly known as PT Konica Cemerlang and changed its name to PT Perdana Bangun Pusaka Tbk in April 1988. The company was founded in 1987 and is headquartered in Central Jakarta, Indonesia. PT Perdana Bangun Pusaka Tbk is a subsidiary of PT Dasabina Adityasarana.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Central Jakarta",
        "zipcode": "10610",
        "website": "http://www.perdanabangunpusaka.co.id",
        "market_cap": 238640005120
    },
    "KPAS.JK": {
        "short_name": "Cottonindo Ariesta Tbk.",
        "long_name": "PT Cottonindo Ariesta Tbk",
        "summary": "PT Cottonindo Ariesta Tbk manufactures and sells cotton products in Indonesia. The company offers facial cotton pads and cotton buds; cosmetic and medical cotton products, including cotton rolls, dental cotton, mini cotton balls, and cotton ball in various sizes; and industrial cotton products comprising cotton sliver, spunlace cotton pads, bleached cotton, and cotton rolls. It also provides cotton bud manufacturing machines. The company was founded in 1994 and is headquartered in Subang, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Subang",
        "zipcode": null,
        "website": "http://www.cottonindo.com",
        "market_cap": 51458883584
    },
    "LFLO.JK": {
        "short_name": "Imago Mulia Persada Tbk.",
        "long_name": "PT Imago Mulia Persada Tbk",
        "summary": "PT Imago Mulia Persada Tbk operates furniture, fixtures, and equipment showrooms in Indonesia, South East Asia, and the Asia Pacific. The company was founded in 1995 and is based in Jakarta Selatan, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12950",
        "website": "http://www.imago-int.com",
        "market_cap": null
    },
    "LMPI.JK": {
        "short_name": "Langgeng Makmur Industri Tbk.",
        "long_name": "PT Langgeng Makmur Industri Tbk",
        "summary": "PT Langgeng Makmur Industri Tbk manufactures and sells aluminum cookware, plastic houseware and others, and PVC pipes, fittings, and profiles in Indonesia. It offers plastic houseware products, such as bathroom, basket, children item, food container, household, industrial, kitchenware, storage, tableware, and other products under the Global Eagle brand name. The company also provides nonstick cookware and bakeware products, including diamante, smeraldo classic and nobel, rubina, zaffiro, and drago series products; aluminum kitchenware products comprising aldize, kettle, magic roaster, pot, rice boiler and cooker, rice container, food carrier, and other products under the Global Eagle brand name; and plastic woven bags. It exports its products to Asia, the Middle East, Africa, and Europe. The company was formerly known as PT Langgeng Makmur Plastic Industry Ltd. and changed its name to PT Langgeng Makmur Industri Tbk in July 1997. PT Langgeng Makmur Industri Tbk was founded in 1972 and is headquartered in Sidoarjo, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Sidoarjo",
        "zipcode": "61256",
        "website": "http://www.langgengmakmur.com",
        "market_cap": 177499521024
    },
    "LPIN.JK": {
        "short_name": "Multi Prima Sejahtera Tbk",
        "long_name": "PT Multi Prima Sejahtera Tbk",
        "summary": "PT Multi Prima Sejahtera Tbk produces, manufactures, distributes, and sells spark plugs in Indonesia. It also offers automobile and motorcycle spark plugs; machinery, equipment, and paraphernalia; automobile accessories parts; technical activities; and agricultural activities and plant breeding. The company was formerly known as Lippo Enterprises Tbk and changed its name to PT Multi Prima Sejahtera Tbk in 2001. PT Multi Prima Sejahtera Tbk was founded in 1982 and is headquartered in Tangerang, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang",
        "zipcode": "15139",
        "website": "http://www.multiprimasejahtera.net",
        "market_cap": 107099996160
    },
    "LPPF.JK": {
        "short_name": "Matahari Department Store Tbk.",
        "long_name": "PT Matahari Department Store Tbk",
        "summary": "PT Matahari Department Store Tbk engages in the retail business in Indonesia. Its stores offer clothes, accessories, bags, shoes, cosmetics, homeware, and household appliances for men, women, and children. The company also provides management consulting services. As of December 31, 2019, it operated 169 stores. The company was founded in 1958 and is headquartered in Tangerang, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang",
        "zipcode": "15811",
        "website": "http://www.matahari.co.id",
        "market_cap": 5147253538816
    },
    "MAMI.JK": {
        "short_name": "Mas Murni Indonesia Tbk",
        "long_name": "PT Mas Murni Indonesia, Tbk",
        "summary": "PT Mas Murni Indonesia, Tbk owns, operates, and manages the Garden Palace Hotel located in Surabaya, Indonesia. It operates through Hospitality Services; Office Space Rental Services; and Catering, Laundry and Recreation Services segments. The company also owns the Crystal Garden, an apartment block and shopping center. It also engages in the restaurant, club, fitness center, advertising, entertainment, fisheries, aquaculture, livestock, and general trading activities, as well as provision of laundry service business; construction and development of residential and real estate properties; and trading of food and beverages. The company was formerly known as PT Rantai Mas Murni and changed its name to PT Mas Murni Indonesia, Tbk in October 1971. PT Mas Murni Indonesia, Tbk was founded in 1970 and is headquartered in Surabaya, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Surabaya",
        "zipcode": "60271",
        "website": "http://www.masmurniindonesia.com",
        "market_cap": 615254982656
    },
    "MAPA.JK": {
        "short_name": "Map Aktif Adiperkasa Tbk.",
        "long_name": "PT Map Aktif Adiperkasa Tbk",
        "summary": "PT Map Aktif Adiperkasa Tbk operates as a sporting goods retailer in Indonesia. It operates sports, leisure footwear, and kid's stores that sell athletic shoes, apparel, sports equipment, leisure footwear, apparel, accessories, kids wear, toys, and early education tools. The company's brand portfolio includes Planet Sports, Sports Station, Royal Sporting House, Golf House, OGAAN, Kidz Station, and Planet Sports Kids. It sells its products through approximately 1,173 retail stores in 76 cities, as well as through 6 digital stores. The company was founded in 2015 and is headquartered in Central Jakarta, Indonesia. PT Map Aktif Adiperkasa Tbk is a subsidiary of PT Mitra Adiperkasa Tbk.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Central Jakarta",
        "zipcode": "10220",
        "website": "http://mapactive.id",
        "market_cap": 5814815817728
    },
    "MAPB.JK": {
        "short_name": "MAP Boga Adiperkasa Tbk.",
        "long_name": "PT. Map Boga Adiperkasa Tbk",
        "summary": "PT. Map Boga Adiperkasa Tbk, through its subsidiaries, operates cafÃ©s and restaurants in Indonesia. The company operates 566 retail stores across 33 Indonesian cities with a portfolio of Starbucks, Pizza Express/Pizza Marzano, Krispy Kreme, Cold Stone Creamery, Godiva, Genki Sushi, and Paul Bakery brands. The company was formerly known as PT. Creasi Aksesoris Indonesia. The company was founded in 2013 and is headquartered in Jakarta, Indonesia. PT. Map Boga Adiperkasa Tbk is a subsidiary of PT. Mitra Adiperkasa Tbk.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10220",
        "website": "http://www.mbai.co.id",
        "market_cap": 2952451063808
    },
    "MAPI.JK": {
        "short_name": "Mitra Adiperkasa Tbk.",
        "long_name": "PT. Mitra Adiperkasa Tbk",
        "summary": "PT. Mitra Adiperkasa Tbk engages in the retail trade of clothing, shoes, toys, accessories, bags, and sports equipment. The company operates through Retail Sales, Department Stores, CafÃ© and Restaurant, and Others segments. It operates sports, fashion, department, kids, food and beverage, and lifestyle product stores under approximately 150 retail brands. The company is also involved in the operation of cafÃ© and restaurant business; and property, investment, book store, manufacturing, and handicraft trading activities, as well as offers cellular phones, tablets, computers, and accessories. It operates approximately 2,500 retail stores and outlets in Jakarta, Bandung, Surabaya, Bali, Medan, Makassar, Batam, Manado, and other cities in Indonesia. The company was founded in 1995 and is headquartered in Central Jakarta, Indonesia. PT. Mitra Adiperkasa Tbk is a subsidiary of PT Satya Mulia Gema Gemilang.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10220",
        "website": "http://www.map.co.id",
        "market_cap": 12900887429120
    },
    "MINA.JK": {
        "short_name": "Sanurhasta Mitra Tbk.",
        "long_name": "PT Sanurhasta Mitra Tbk",
        "summary": "PT Sanurhasta Mitra Tbk engages in property development and hospitality business in Indonesia. It primarily develops housing projects; and manages cottages. The company was founded in 1993 and is headquartered in Jakarta Selatan, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12190",
        "website": "http://sanurhastamitra.com",
        "market_cap": 452812505088
    },
    "MLPL.JK": {
        "short_name": "Multipolar Tbk.",
        "long_name": "PT Multipolar Tbk",
        "summary": "PT Multipolar Tbk, together with its subsidiaries, engages in telecommunication, information technology, and general trading businesses in Indonesia and internationally. The company operates through Retail and Distribution, Information Technology, and Others segments. It operates a chain of retail hypermarkets, SmartClub, Foodmart, Boston Health & Beauty, and FMX, as well as e-commerce business; department stores and Books & Beyond book stores; and family entertainment centers. The company also provides IT services and solutions, including hardware and integration services; application system and implementation services; and IT consulting services. In addition, it operates filing management; offers services for record, computer data, valuable document, electronic document, and facility management services; other auxiliary services; and develops and manages shopping centers, offices, and apartments. Additionally, the company provides a web based platform for procurement of goods and services for business-to-business and business-to-government market segments; and telecommunication and air transportation services. Further, it is involved in import, export, interinsulair, local and retail, property/real estate development and management services, rental space of building, and investment businesses. PT Multipolar Tbk was formerly known as PT Multipolar Corporation Tbk and changed its name to PT Multipolar Tbk in July 2007. PT Multipolar Tbk was founded in 1975 and is headquartered in Jakarta, Indonesia. PT Multipolar Tbk operates as a subsidiary of PT Inti Anugrah Pratama.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12950",
        "website": "http://www.multipolar-group.com",
        "market_cap": 9881729892352
    },
    "MLQ2.F": {
        "short_name": "MULTIPOLAR  RP 2000",
        "long_name": "PT Multipolar Tbk",
        "summary": "PT Multipolar Tbk, together with its subsidiaries, engages in telecommunication, information technology, and general trading businesses in Indonesia and internationally. The company operates through Retail and Distribution, Information Technology, and Others segments. It operates a chain of retail hypermarkets, SmartClub, Foodmart, Boston Health & Beauty, and FMX, as well as e-commerce business; department stores and Books & Beyond book stores; and family entertainment centers. The company also provides IT services and solutions, including hardware and integration services; application system and implementation services; and IT consulting services. In addition, it operates filing management; offers services for record, computer data, valuable document, electronic document, and facility management services; other auxiliary services; and develops and manages shopping centers, offices, and apartments. Additionally, the company provides a web based platform for procurement of goods and services for business-to-business and business-to-government market segments; and telecommunication and air transportation services. Further, it is involved in import, export, interinsulair, local and retail, property/real estate development and management services, rental space of building, and investment businesses. PT Multipolar Tbk was formerly known as PT Multipolar Corporation Tbk and changed its name to PT Multipolar Tbk in July 2007. PT Multipolar Tbk was founded in 1975 and is headquartered in Jakarta, Indonesia. PT Multipolar Tbk operates as a subsidiary of PT Inti Anugrah Pratama.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12950",
        "website": "http://www.multipolar-group.com",
        "market_cap": 1244689792
    },
    "MPMX.JK": {
        "short_name": "Mitra Pinasthika Mustika Tbk.",
        "long_name": "PT Mitra Pinasthika Mustika Tbk",
        "summary": "PT Mitra Pinasthika Mustika Tbk, through its subsidiaries, engages in the distribution of two-wheel vehicle and spare parts under Honda brand primarily in Indonesia. It operates through three segments: Distribution, Retail and Aftermarket; Transportation; and Others. The company operates MPMMotor retail outlets. It is also involved in the four-wheel vehicle retail sale and rental, general insurance, and financing activities, as well as online sale of four wheels-vehicle and its supporting activities. In addition, the company provides investment, management consulting, and advisory services; auction services; outsourcing services; land, sea, and air freight forwarding; and other, trading, and workshop services. Further, it trades in new and used motor vehicles, and supporting components; offers general and motor vehicle trading and agency services; and computer consultant activities and other computer facility management services. The company was founded in 1987 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12940",
        "website": "http://www.mpmgroup.co.id",
        "market_cap": 3081678618624
    },
    "MPPA.JK": {
        "short_name": "Matahari Putra Prima Tbk.",
        "long_name": "PT Matahari Putra Prima Tbk",
        "summary": "PT Matahari Putra Prima Tbk, together with its subsidiaries, operates a chain of retail stores that offers fast moving consumer goods in Indonesia. The company operates Hypermart stores; Foodmart Fresh and Foodmart Primo supermarkets, which offers fresh foods, bakery products, and ready-to-eat products, as well as eat-in or quick take-away meals, and cafÃ© and boutique bakery; and Foodmart Express (FMX) convenient stores that provides food and snack products. As of December 31, 2018, it operated 219 stores, including 107 Hypermarts, 2 SmartClubs, 24 Foodmarts, 74 Boston Health & Beauty stores, and 12 FMX convenience stores. The company was founded in 1986 and is headquartered in Tangerang, Indonesia. PT Matahari Putra Prima Tbk is a subsidiary of PT Multipolar Tbk.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang",
        "zipcode": "15811",
        "website": "http://www.hypermart.co.id",
        "market_cap": 9223208435712
    },
    "MYTX.JK": {
        "short_name": "Asia Pacific Investama Tbk.",
        "long_name": "PT Asia Pacific Investama Tbk",
        "summary": "PT Asia Pacific Investama Tbk operates as a garments company in Indonesia, Africa, the United States, Asia, Australia, and Europe. The company operates through two segments, Garments, and Weaving and Spinning. It offers denim, grey, job work, laundry, waste, and other garments, as well as yarns. The company was formerly known as PT Apac Citra Centertex Tbk and changed its name to PT Asia Pacific Investama Tbk in November 2015. PT Asia Pacific Investama Tbk was founded in 1987 and is headquartered in Jakarta Barat, Indonesia. PT Asia Pacific Investama Tbk is a subsidiary of PT World Harvest Textile.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Barat",
        "zipcode": "11610",
        "website": "http://www.apinvestama.co.id",
        "market_cap": 844453511168
    },
    "NATO.JK": {
        "short_name": "Surya Permata Andalan Tbk.",
        "long_name": "PT Surya Permata Andalan Tbk",
        "summary": "PT Surya Permata Andalan Tbk develops and operates boutique hotels, villas, and resorts in Indonesia. The company was formerly known as PT Nusantara Properti Internasional Tbk. PT Surya Permata Andalan Tbk is based in Bali, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bali",
        "zipcode": null,
        "website": "http://www.nusantara-properti.co.id",
        "market_cap": 4360593997824
    },
    "OAIA.F": {
        "short_name": "PT RAMA.LEST.SEN.  RP 50",
        "long_name": "PT Ramayana Lestari Sentosa Tbk",
        "summary": "PT Ramayana Lestari Sentosa Tbk operates a chain of department stores in Indonesia. It sells clothes, accessories, bags, shoes, cosmetics, household appliances, stationery, toys, and daily needs, as well as food products through the company's stores and supermarkets. The company also offers products online through www.ramayana.co.id. As of December 31, 2019, it operated 117 stores in 54 locations throughout Indonesia. The company was founded in 1978 and is headquartered in Jakarta, Indonesia. PT Ramayana Lestari Sentosa Tbk is a subsidiary of PT Ramayana Makmursentosa.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10250",
        "website": "http://www.ramayana.co.id",
        "market_cap": 255254816
    },
    "PANR.JK": {
        "short_name": "Panorama Sentrawisata Tbk.",
        "long_name": "PT Panorama Sentrawisata Tbk",
        "summary": "PT Panorama Sentrawisata Tbk engages in tourism and hospitality businesses primarily in Indonesia. The company offers inbound tour and destination management services to foreign tourists and travelers; and travel leisure offers travel management services to domestic travelers. It also offers media pillar services, such as event and exhibition organizer for meetings, incentives, conventions, and exhibitions activities; live entertainment for music, theater, and other on stage performances; media publication; and publishes travel magazine and books. The company provides premium bus charters, intercity shuttles, tourism buses, and open trip services. PT Panorama Sentrawisata Tbk was founded in 1972 and is headquartered in Jakarta, Indonesia. PT Panorama Sentrawisata Tbk is a subsidiary of PT Panorama Tirta Anugerah.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "11440",
        "website": "http://www.panorama-sentrawisata.com",
        "market_cap": 153600000000
    },
    "PBID.JK": {
        "short_name": "Panca Budi Idaman Tbk.",
        "long_name": "PT Panca Budi Idaman Tbk",
        "summary": "PT Panca Budi Idaman Tbk manufactures, distributes, and trades in plastic packaging products. It provides polyethylene and polypropylene bags; high density polyethylene resins; and heavy duty sacks, as well as packaging products, such as food wrapping papers, cake boxes, plastic ropes, rubber bands, and straws. The company also trades in plastic resins. It distributes its products to retail merchants, semi-wholesalers, and wholesalers. The company provides its products under the Pluit, Tomat, Bangkuang, Jeruk, Cabe, 222, Wayang, Gapura, Sparta, Liberty, Dayana, PB, and various other brand names. It exports its products to the United Kingdom, Germany, the Netherlands, Spain, the United Arab Emirates, Nigeria, the United States, Taiwan, etc. The company was founded in 1979 and is headquartered in Tangerang, Indonesia. PT Panca Budi Idaman Tbk is a subsidiary of PT Alphen Internasional Corporindo.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang",
        "zipcode": "15122",
        "website": "http://www.pancabudi.com",
        "market_cap": 3440625057792
    },
    "PBRX.JK": {
        "short_name": "Pan Brothers Tbk.",
        "long_name": "PT Pan Brothers Tbk",
        "summary": "PT Pan Brothers Tbk, together with its subsidiaries, develops, manufactures, and supplies garments. It offers woven garments, such as padded and light weight jackets, pants, shorts, casual pants and dress shirts, etc.; technical, functional, and active wear jackets for snow boarding, ski outer wear, active wear, jogging, hiking, other sports and outdoor activities, etc.; and cut and sewn knit garments, including polo shirts, golf shirts, track suits, and sweat suits, as well as various fabric products. The company also provides garment printing and embroidery services. It exports its products to the United States, European Community, Eastern Europe, Canada, Asia, Australia, New Zealand, and internationally. The company was founded in 1980 and is headquartered in Tangerang, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang",
        "zipcode": "15133",
        "website": "http://www.panbrotherstbk.com",
        "market_cap": 1062441254912
    },
    "PDES.JK": {
        "short_name": "Destinasi Tirta Nusantara Tbk",
        "long_name": "PT Destinasi Tirta Nusantara Tbk",
        "summary": "PT Destinasi Tirta Nusantara Tbk, together with its subsidiaries, operates as a tour operator company in Indonesia. It offers tour and travel packages, tour guides, and tour transportation related services to foreign tourists. The company was founded in 1999 and is headquartered in Jakarta, Indonesia. PT Destinasi Tirta Nusantara Tbk is a subsidiary of PT. Panorama Sentrawisata Tbk.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "11440",
        "website": "http://www.panorama-destination.com",
        "market_cap": 393250013184
    },
    "PGJO.JK": {
        "short_name": "Tourindo Guide Indonesia Tbk.",
        "long_name": "PT Tourindo Guide Indonesia Tbk",
        "summary": "PT Tourindo Guide Indonesia Tbk operates a digital tourism marketplace that enable tourism product providers and travelers interact real time online. The company was founded in 2017 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12940",
        "website": "http://www.pigijo.com",
        "market_cap": 21129900032
    },
    "PGLI.JK": {
        "short_name": "Pembangunan Graha Lestari Indah",
        "long_name": "PT Pembangunan Graha Lestari Indah Tbk",
        "summary": "PT Pembangunan Graha Lestari Indah Tbk engages in the hotel and restaurant businesses in Indonesia. The company owns and operates a hotel under the Travellers Suites name; restaurants under the Le Chic name; and a banquet and restaurant under the Tia CafÃ© name. It also generates hydroelectricity power. PT Pembangunan Graha Lestari Indah Tbk was founded in 1994 and is based in Medan, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Medan",
        "zipcode": "20124",
        "website": "http://www.ptpgli.co.id",
        "market_cap": 122976002048
    },
    "PICO.JK": {
        "short_name": "Pelangi Indah Canindo Tbk",
        "long_name": "PT Pelangi Indah Canindo Tbk",
        "summary": "PT Pelangi Indah Canindo Tbk manufactures and sells metal packaging products in Indonesia and internationally. The company offers steel drums, PG tank, pail cans, food cans, and general cans, as well as provides metal printing services. The company was founded in 1983 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "11840",
        "website": "http://www.pic.co.id",
        "market_cap": 85256249344
    },
    "PJAA.JK": {
        "short_name": "Pembangunan Jaya Ancol Tbk.",
        "long_name": "PT Pembangunan Jaya Ancol Tbk",
        "summary": "PT Pembangunan Jaya Ancol Tbk, together with its subsidiaries, primarily engages in managing recreational parks, sports facilities, and resorts in Indonesia. It operates through Tourism; Real Estate; and Trading and Services segments. The company manages entrance gates, recreational parks and beaches, fantasy world, swimming pool, animal shows, and lodging facilities, as well as engages in merchandise selling activities. It also develops, sells, and rents properties, including houses, shophouses, condominiums, apartments, offices, and shopping centers, as well as land. In addition, the company is involved in souvenirs trading, marine transportation, and restaurant management activities; the purification, management, supply, and distribution of clean water; and the provision of highway construction and services, and waste and draination services. PT Pembangunan Jaya Ancol Tbk was founded in 1992 and is headquartered in North Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "North Jakarta",
        "zipcode": "14430",
        "website": "http://www.ancol.com",
        "market_cap": 847999991808
    },
    "PLAN.JK": {
        "short_name": "Planet Properindo Jaya Tbk.",
        "long_name": "PT Planet Properindo Jaya Tbk",
        "summary": "PT Planet Properindo Jaya engages in hotels, restaurants, and tourism consulting activities. It operates Vue Palace hotel, a 4-star hotel located in Bandung. The company was founded in 2003 and is based in Bandung, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bandung",
        "zipcode": "40117",
        "website": "http://www.planetproperindojaya.com",
        "market_cap": 29464281088
    },
    "PMDKY": {
        "short_name": "MITRA ADIPERKASA TBK",
        "long_name": "PT. Mitra Adiperkasa Tbk",
        "summary": "PT. Mitra Adiperkasa Tbk engages in the retail trade of clothing, shoes, toys, accessories, bags, and sports equipment. The company operates through Retail Sales, Department Stores, CafÃ© and Restaurant, and Others segments. It operates sports, fashion, department, kids, food and beverage, and lifestyle product stores under approximately 150 retail brands. The company is also involved in the operation of cafÃ© and restaurant business; and property, investment, book store, manufacturing, and handicraft trading activities, as well as offers cellular phones, tablets, computers, and accessories. It operates approximately 2,500 retail stores and outlets in Jakarta, Bandung, Surabaya, Bali, Medan, Makassar, Batam, Manado, and other cities in Indonesia. The company was founded in 1995 and is headquartered in Central Jakarta, Indonesia. PT. Mitra Adiperkasa Tbk is a subsidiary of PT Satya Mulia Gema Gemilang.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10220",
        "website": "http://www.map.co.id",
        "market_cap": 902363968
    },
    "PMJS.JK": {
        "short_name": "Putra Mandiri Jembar Tbk.",
        "long_name": "PT Putra Mandiri Jembar Tbk",
        "summary": "PT Putra Mandiri Jembar Tbk engages in the vehicle dealership business. The company also engages in the provision of automotive rental services; and e-commerce business. It operates 45 Mitsubishi dealer showrooms, 1 Mercedes-Benz dealer showroom, and 2 Nissan dan Datsun dealer showrooms located in 31 cities and 10 provinces in Sumatera, DKI Jakarta, and Jawa. The company was founded in 2003 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10260",
        "website": "http://www.ptpmj.co.id",
        "market_cap": 1719449944064
    },
    "PNSE.JK": {
        "short_name": "Pudjiadi & Sons Tbk.",
        "long_name": "PT Pudjiadi and Sons Tbk",
        "summary": "PT Pudjiadi and Sons Tbk operates hotels and hotel facilities. Its facilities include accommodation, offices, shopping, apartments, recreational, and entertainment facilities. The company is also involved in the property management and catering businesses. It operates in Jakarta, Bandung, Anyer, Cisarua, Bali, Lombok, Yogyakarta, and Flores. The company was founded in 1970 and is headquartered in Jakarta, Indonesia. PT Pudjiadi and Sons Tbk is a subsidiary of PT Istana Kuta Ratu Prestige.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "11180",
        "website": "http://www.pudjiadiandsons.co.id",
        "market_cap": 359016300544
    },
    "POLU.JK": {
        "short_name": "Golden Flower Tbk.",
        "long_name": "PT Golden Flower, Tbk",
        "summary": "PT Golden Flower, Tbk manufactures and sells garments in Indonesia. It offers men's and women's casuals, and formal light woven wears. The company's products include ladies blouse, men's shirt, non-iron shirt, casual shirt, skirt, dresses, night wear, uniform, etc. It also offers garment services, such as cutting, sewing, checking, ironing, finishing. The company also exports its products to the United States, Canada, European Union, Australia, Japan, and other Asian countries. PT Golden Flower, Tbk was founded in 1958 and is based in Semarang, Indonesia. PT Golden Flower, Tbk is a subsidiary of PT Profashion Apparel.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Semarang",
        "zipcode": "50519",
        "website": "http://goldenflower.co.id",
        "market_cap": 281999998976
    },
    "PRAS.JK": {
        "short_name": "Prima Alloy Steel Universal Tbk",
        "long_name": "PT. Prima Alloy Steel Universal Tbk.",
        "summary": "PT. Prima Alloy Steel Universal Tbk manufactures and sells aluminum alloy wheels in Indonesia. It also exports its products to Europe, the United States, Africa, Australia, and Asia. The company was founded in 1984 and is based in Sidoarjo, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Sidoarjo",
        "zipcode": "61254",
        "website": "http://www.panther-wheels.net",
        "market_cap": 165446156288
    },
    "PSKT.JK": {
        "short_name": "Red Planet Indonesia Tbk.",
        "long_name": "PT Red Planet Indonesia Tbk",
        "summary": "PT Red Planet Indonesia Tbk, together with its subsidiaries, engages in the hospitality business in Indonesia. The company also provides function, accommodation, and recreation services. It owns and operates eight hotels located in Jakarta, Bekasi, Makassar, Palembang, Pekanbaru, Solo, Surabaya, and Bukittinggi. The company was formerly known as PT Pusako Tarinka Tbk and changed its name to PT Red Planet Indonesia Tbk in May 2014. PT Red Planet Indonesia Tbk was founded in 1989 and is headquartered in Jakarta, Indonesia. PT Red Planet Indonesia Tbk is a subsidiary of Red Planet Holdings (Indonesia) Limited.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12920",
        "website": "http://www.redplanetindonesia.com",
        "market_cap": 517560008704
    },
    "PTAIF": {
        "short_name": "ASTRA INTERNATIONAL",
        "long_name": "PT Astra International Tbk",
        "summary": "PT Astra International Tbk, together with its subsidiaries, operates in the automotive, financial services, heavy equipment, mining, construction, energy, agri, infrastructure and logistics, information technology, and property businesses in Indonesia. It offers cars, trucks, and motorcycles of various brands; manufactures and sells automotive components to the original equipment for manufacturers and replacement markets, as well as provides consultation services to its customers; financing for cars, motorcycles, and heavy equipment; life, vehicle, and health insurance, as well as other insurance for commercial business; and various banking products and services. The company also distributes heavy equipment for the mining, plantation, construction, forestry, transportation, and material handling industries; provides coal mining contracting services; operates coal mines; and produces crude palm oil. In addition, it is involved in the development and operation of toll roads; rental and leasing of vehicles; resale of used cars; and provision of public transportation services and logistics facilities. Further, the company offers various information technology business solutions based on document, information, and communication technology; and engages in the property investment, development, and management activities. Additionally, it is involved in the foundation; formwork and bekisting; pump services; and mechanical, electrical, and plumbing works, as well as dredging, reclamation, and marine works. The company was founded in 1957 and is headquartered in North Jakarta, Indonesia. PT Astra International Tbk is a subsidiary of Jardine Cycle & Carriage Ltd.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10220",
        "website": "http://www.astra.co.id",
        "market_cap": 13820897280
    },
    "PTAIY": {
        "short_name": "ASTRA INTERNATIONAL",
        "long_name": "PT Astra International Tbk",
        "summary": "PT Astra International Tbk, together with its subsidiaries, operates in the automotive, financial services, heavy equipment, mining, construction, energy, agri, infrastructure and logistics, information technology, and property businesses in Indonesia. It offers cars, trucks, and motorcycles of various brands; manufactures and sells automotive components to the original equipment for manufacturers and replacement markets, as well as provides consultation services to its customers; financing for cars, motorcycles, and heavy equipment; life, vehicle, and health insurance, as well as other insurance for commercial business; and various banking products and services. The company also distributes heavy equipment for the mining, plantation, construction, forestry, transportation, and material handling industries; provides coal mining contracting services; operates coal mines; and produces crude palm oil. In addition, it is involved in the development and operation of toll roads; rental and leasing of vehicles; resale of used cars; and provision of public transportation services and logistics facilities. Further, the company offers various information technology business solutions based on document, information, and communication technology; and engages in the property investment, development, and management activities. Additionally, it is involved in the foundation; formwork and bekisting; pump services; and mechanical, electrical, and plumbing works, as well as dredging, reclamation, and marine works. The company was founded in 1957 and is headquartered in North Jakarta, Indonesia. PT Astra International Tbk is a subsidiary of Jardine Cycle & Carriage Ltd.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10220",
        "website": "http://www.astra.co.id",
        "market_cap": 14817630208
    },
    "PTSP.JK": {
        "short_name": "Pioneerindo Gourmet Internation",
        "long_name": "PT Pioneerindo Gourmet International Tbk",
        "summary": "PT Pioneerindo Gourmet International Tbk, together with its subsidiaries, operates restaurants in Indonesia. The company operates restaurants under the California Fried Chicken, Sapo Oriental, and Cal Donat trademarks. As of December 31, 2019, it owned and franchised 332 outlets. The company was formerly known as PT Putra Sejahtera Pioneerindo Tbk and changed its name to PT Pioneerindo Gourmet International Tbk in August 2001. PT Pioneerindo Gourmet International Tbk was founded in 1983 and is headquartered in Jakarta Barat, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Barat",
        "zipcode": "11480",
        "website": "http://www.cfcindonesia.com",
        "market_cap": 1203403620352
    },
    "PZZA.JK": {
        "short_name": "Sarimelati Kencana Tbk.",
        "long_name": "PT Sarimelati Kencana Tbk.",
        "summary": "PT Sarimelati Kencana Tbk. operates Pizza Hut restaurants under a franchise agreement with Yum! Asia Franchise Pte. Ltd. in Indonesia. As of December 31, 2019, it operated 516 outlets in Jakarta and other cities in Indonesia. The company was founded in 1987 and is headquartered in Jakarta, Indonesia. PT Sarimelati Kencana Tbk. is a subsidiary of PT Sriboga Raturaya.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12870",
        "website": "http://www.sarimelatikencana.co.id",
        "market_cap": 2133897904128
    },
    "QGI.F": {
        "short_name": "MITRA ADIPERKASA  RP 500",
        "long_name": "PT. Mitra Adiperkasa Tbk",
        "summary": "PT. Mitra Adiperkasa Tbk engages in the retail trade of clothing, shoes, toys, accessories, bags, and sports equipment. The company operates through Retail Sales, Department Stores, CafÃ© and Restaurant, and Others segments. It operates sports, fashion, department, kids, food and beverage, and lifestyle product stores under approximately 150 retail brands. The company is also involved in the operation of cafÃ© and restaurant business; and property, investment, book store, manufacturing, and handicraft trading activities, as well as offers cellular phones, tablets, computers, and accessories. It operates approximately 2,500 retail stores and outlets in Jakarta, Bandung, Surabaya, Bali, Medan, Makassar, Batam, Manado, and other cities in Indonesia. The company was founded in 1995 and is headquartered in Central Jakarta, Indonesia. PT. Mitra Adiperkasa Tbk is a subsidiary of PT Satya Mulia Gema Gemilang.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10220",
        "website": "http://www.map.co.id",
        "market_cap": 711454016
    },
    "RALS.JK": {
        "short_name": "Ramayana Lestari Sentosa Tbk.",
        "long_name": "PT Ramayana Lestari Sentosa Tbk",
        "summary": "PT Ramayana Lestari Sentosa Tbk operates a chain of department stores in Indonesia. It sells clothes, accessories, bags, shoes, cosmetics, household appliances, stationery, toys, and daily needs, as well as food products through the company's stores and supermarkets. The company also offers products online through www.ramayana.co.id. As of December 31, 2019, it operated 117 stores in 54 locations throughout Indonesia. The company was founded in 1978 and is headquartered in Jakarta, Indonesia. PT Ramayana Lestari Sentosa Tbk is a subsidiary of PT Ramayana Makmursentosa.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10250",
        "website": "http://www.ramayana.co.id",
        "market_cap": 4517461491712
    },
    "RICY.JK": {
        "short_name": "Ricky Putra Globalindo Tbk",
        "long_name": "PT Ricky Putra Globalindo Tbk",
        "summary": "PT Ricky Putra Globalindo Tbk manufactures and sells underwear and fashion wear in Indonesia, Australia, the United States, Asia, Europe, Africa, and the Middle East. It operates through Manufacturing of Underwear and Fashion Wear, Trading, and Spinning Manufacturing segments. The company offers men's underwear under the Ricky, GT Man, Ricsony, GT Man Kid, GT Kid, GT Man Sport, and GT Ladies brands. It also provides outfits for children, as well as adolescent and adult women and men under international licenses and own brands, such as Transformer, Pokemon, Barbie, and Despicable Me. In addition, the company offers nightgowns, women's underwear, t-shirts, and polo shirts for children, as well as adolescent and adult women and men. Further, it provides knitting yarn comprising cotton knitting yarn and TC knitting yarns with various sizes; and knit fabrics products under the flag of PT Ricky Tekstil Indonesia. Additionally, the company engages in exporting apparel; and restaurant business. The company was formerly known as PT Ricky Putra Garmindo and changed its name to PT Ricky Putra Globalindo Tbk in June 1996. PT Ricky Putra Globalindo Tbk was founded in 1987 and is headquartered in Bogor, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bogor",
        "zipcode": null,
        "website": "http://www.rpg.co.id",
        "market_cap": 61604929536
    },
    "SBAT.JK": {
        "short_name": "Sejahtera Bintang Abadi Textile",
        "long_name": "PT Sejahtera Bintang Abadi Textile Tbk",
        "summary": "PT Sejahtera Bintang Abadi Textile Tbk manufactures and sells yarns using recycled materials primarily in Indonesia. It offers cotton open-end, ploy-cotton bleached open-end, ploy-cotton raw white open-end, ploy-cotton color open-end, mop, and ring-spun yarn products. The company's products are used as materials for mops, towels, denim fabrics, canvas fabrics, carpets, batik, and knitted gloves. It also exports its products to Asia, Europe, the Americas, and Africa. The company was founded in 2003 and is based in Bandung, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bandung",
        "zipcode": "40396",
        "website": "http://sbatextile.com",
        "market_cap": 106249994240
    },
    "SHID.JK": {
        "short_name": "Hotel Sahid Jaya International ",
        "long_name": "PT Hotel Sahid Jaya International Tbk",
        "summary": "PT Hotel Sahid Jaya International Tbk engages in the hotel and accommodation businesses in Indonesia. It also leases facilities related to the hotel business; and offers management and other services for hotel and tourism sectors. PT Hotel Sahid Jaya International Tbk was founded in 1969 and is headquartered in Jakarta, Indonesia. PT Hotel Sahid Jaya International Tbk is a subsidiary of PT Empu Sahid International.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10220",
        "website": "http://www.pthsji.com",
        "market_cap": 2574459076608
    },
    "SMKL.JK": {
        "short_name": "Satyamitra Kemas Lestari Tbk.",
        "long_name": "PT Satyamitra Kemas Lestari Tbk",
        "summary": "PT Satyamitra Kemas Lestari Tbk provides integrated carton packaging solutions in Indonesia. It offers corrugated carton boxes, pre-print, offset, and rigid boxes; and truck rental and logistics services. The company was founded in 2001 and is headquartered in Tangerang, Indonesia. PT Satyamitra Kemas Lestari Tbk is a subsidiary of Satyamitra Investindo Pratama.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang",
        "zipcode": "15720",
        "website": "http://www.satyamitra.com",
        "market_cap": 680000028672
    },
    "SMSM.JK": {
        "short_name": "Selamat Sempurna Tbk.",
        "long_name": "PT Selamat Sempurna Tbk",
        "summary": "PT Selamat Sempurna Tbk manufactures and sells spare parts and automotive components. It operates through five segments: Filter, Radiator, Body Maker, Trading, and Others. The company offers radiators; hydraulic and automotive components, including body maker, dump truck, tank, box, trailer, and dump hoist; and fuel tank, muffler, oil, cooler, condenser, exhaust system, and brake and fuel pipe products, as well as filters for automotive, commercial, heavy equipment, marine, industrial, construction equipment, and gas turbine applications. It also assembles dump trucks, trailers, mixers, and other special purpose vehicles; and manufactures rubber O-rings, polyurethanes, and plastisol adhesives for automotive industries. The company markets its products under the Sakura Filter brand name. It exports its products to approximately 120 countries worldwide. The company was founded in 1976 and is headquartered in Jakarta, Indonesia. PT Selamat Sempurna Tbk is a subsidiary of PT Adrindo Intiperkasa.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "14440",
        "website": "http://smsm.co.id",
        "market_cap": 7284730101760
    },
    "SNLK.JK": {
        "short_name": "Sunter Lakeside Hotel Tbk.",
        "long_name": "PT Sunter Lakeside Hotel Tbk",
        "summary": "PT Sunter Lakeside Hotel Tbk operates a 4-star luxury hotel in North Jakarta. Its hotel provides guest rooms and suites, as well as various facilities and amenities, which include Internet, meeting rooms, banquet ballrooms, gym and fitness center, swimming pool, tennis courts, airport shuttle services, and others. The company was founded in 1991 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "14350",
        "website": "http://www.sunlakehotel.com",
        "market_cap": 494999994368
    },
    "SOFA.JK": {
        "short_name": "Boston Furniture Industries Tbk",
        "long_name": "PT Boston Furniture Industries Tbk",
        "summary": "PT Boston Furniture Industries Tbk manufactures and sales furniture products for home in Indonesia. The company is headquartered in Tangerang, Indonesia with additional location in Selatan, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang",
        "zipcode": null,
        "website": "http://www.boston-industries.com",
        "market_cap": 153450004480
    },
    "SONA.JK": {
        "short_name": "Sona Topas Tourism Industry Tbk",
        "long_name": "PT Sona Topas Tourism Industry Tbk",
        "summary": "PT Sona Topas Tourism Industry Tbk, together with its subsidiaries, provides travel related services in Indonesia. It operates through three divisions: Tours, Duty Free Shops, and Retail Shops. The company operates duty free shops in Bali and retail shops in Jakarta and Bali. It also sells tours and travel tickets, as well as handles related documents and tours. The company was formerly known as PT Sona Topas and changed its name to PT Sona Topas Tourism Industry Tbk in October 1990. PT Sona Topas Tourism Industry Tbk was founded in 1978 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12920",
        "website": "http://www.sonatopas.co.id/new/",
        "market_cap": 1796760010752
    },
    "SOTS.JK": {
        "short_name": "Satria Mega Kencana Tbk.",
        "long_name": "PT Satria Mega Kencana Tbk",
        "summary": "PT Satria Mega Kencana Tbk, through its subsidiaries, operates hotels under the Sotis brand in Indonesia. It also owns and leases real estate properties; and offers food and beverages. In addition, the company is involved in the professional, scientific, and technical activities, as well as construction services. Further, it provides spa services. The company was founded in 2004 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12160",
        "website": "http://satriamegakencana.com",
        "market_cap": 539999993856
    },
    "SPTO.JK": {
        "short_name": "Surya Pertiwi Tbk.",
        "long_name": "PT Surya Pertiwi Tbk",
        "summary": "PT Surya Pertiwi Tbk distributes bathroom and kitchen products. The company offers sanitary wares, porcelain, fittings, kitchen products, and household appliances. It also engages in the construction activities. The company was founded in 1968 and is headquartered in Jakarta Barat, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Barat",
        "zipcode": "11420",
        "website": "http://suryapertiwi.co.id",
        "market_cap": 1225800024064
    },
    "SRIL.JK": {
        "short_name": "Sri Rejeki Isman Tbk.",
        "long_name": "PT Sri Rejeki Isman Tbk",
        "summary": "PT Sri Rejeki Isman Tbk operates as a textile and garment company in Indonesia. It operates through Spinning, Weaving, Finishing Fabric, and Garment segments. The company provides yarn to textile customers; greige; finished fabric; and military and corporate uniforms. It offers its products in the United States, China, Japan, South Korea, Malaysia, Brunei Darussalam, Timor Leste, Singapore, Nepal, the Philippines, South Africa, the United Arab Emirates, Australia, New Zealand, Germany, Austria, England, Bangladesh, and India. The company was founded in 1966 and is headquartered in Surakarta, Indonesia. PT Sri Rejeki Isman Tbk is a subsidiary of PT Huddleston Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Surakarta",
        "zipcode": "57511",
        "website": "http://www.sritex.co.id",
        "market_cap": 2986021224448
    },
    "SSTM.JK": {
        "short_name": "Sunson Textile Manufacture Tbk",
        "long_name": "PT Sunson Textile Manufacturer Tbk",
        "summary": "PT Sunson Textile Manufacturer Tbk engages in the manufacturing and selling yarn, fabric, and other textile products in Indonesia. The company operates in three segments: Spinning, Weaving, and Others. It also provides general trading services. The company also exports its products in rest of Asia, Europe, the Americas, and Africa. PT Sunson Textile Manufacturer Tbk was founded in 1972 and is headquartered in Bandung, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bandung",
        "zipcode": null,
        "website": "http://www.sunson.co.id",
        "market_cap": 477731258368
    },
    "STAR.JK": {
        "short_name": "Buana Artha Anugerah Tbk.",
        "long_name": "PT Buana Artha Anugerah Tbk",
        "summary": "PT Buana Artha Anugerah Tbk engages in the wholesale trade and export of thread, cotton, and fiber primarily in Indonesia. It also processes synthetic fibers. The company was formerly known as PT Star Petrochem, Tbk and changed its name to PT Buana Artha Anugerah Tbk in June 2019. PT Buana Artha Anugerah Tbk was founded in 2008 and is based in Central Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Central Jakarta",
        "zipcode": "10310",
        "website": "http://www.starpetrochem.co.id",
        "market_cap": 484800004096
    },
    "SWAT.JK": {
        "short_name": "Sriwahana Adityakarta Tbk.",
        "long_name": "PT Sriwahana Adityakarta Tbk",
        "summary": "PT Sriwahana Adityakarta Tbk manufactures and sells corrugated carton packaging solutions. It offers corrugated carton for use in transport, consumer, non-direct contact food, and non-food packaging applications; paper cones; and paper tubes. The company was founded in 1990 and is headquartered in Boyolali, Indonesia. PT Sriwahana Adityakarta Tbk is a subsidiary of PT Sumber Makmur Lumintu.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Boyolali",
        "zipcode": null,
        "website": "http://www.sriwahana.id",
        "market_cap": 250593607680
    },
    "TALF.JK": {
        "short_name": "Tunas Alfin Tbk.",
        "long_name": "PT Tunas Alfin Tbk",
        "summary": "PT Tunas Alfin Tbk manufactures and sells packaging products in Indonesia. The company offers dry and wet, wax, extrusion, and solventless lamination; paper and board metalizing; and printing services, as well as produces release paper and adhesive coating products. It serves cigarette, consumer food, and health and hygiene products manufacturing industries. The company was founded in 1977 and is headquartered in Tangerang, Indonesia. PT Tunas Alfin Tbk is a subsidiary of PT Proinvestindo.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang",
        "zipcode": "15119",
        "website": "http://www.tunasalfin.com",
        "market_cap": 384376963072
    },
    "TFCO.JK": {
        "short_name": "Tifico Fiber Indonesia Tbk.",
        "long_name": "PT Tifico Fiber Indonesia Tbk",
        "summary": "PT Tifico Fiber Indonesia Tbk manufactures and sells polyester chips, staple fibers, filament yarns, and RCL products in Indonesia. The company also exports its products to Asia, the United States, Australia, and Europe. PT Tifico Fiber Indonesia Tbk was founded in 1973 and is based in Tangerang, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang",
        "zipcode": "15143",
        "website": "http://www.tifico.co.id",
        "market_cap": 3424386809856
    },
    "TOYS.JK": {
        "short_name": "Sunindo Adipersada Tbk.",
        "long_name": "PT Sunindo Adipersada Tbk",
        "summary": "PT Sunindo Adipersada Tbk manufactures and sells toys in Indonesia. The company also exports its products. PT Sunindo Adipersada Tbk was founded in 1991 and is headquartered in Bogor, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bogor",
        "zipcode": "16820",
        "website": "http://www.sunindo.id",
        "market_cap": 175070003200
    },
    "TRIS.JK": {
        "short_name": "Trisula International Tbk.",
        "long_name": "PT Trisula International Tbk",
        "summary": "PT Trisula International Tbk, together with its subsidiaries, designs and manufactures garments in Indonesia. It operates in two segments, Garment and Retail. The Garment segment manufactures and markets casual wear, lifestyle clothing, golf clothing, executive office wear, and uniforms; and corporate garments and uniforms for a range of industry sectors, including banks, airlines, retail outlets, hotels, governments, schools, transportation entities, and hospitals. The Retail segment operates retail outlets; and distributes garments to department stores, retail outlets, and designer boutiques. The company markets its products primarily under the JOBB, Jack Nicklaus, Man Club, and G2000 brands. It owns and operates 300 outlets. The company also exports its products primarily to the United States, the United Kingdom, Australia, Japan, South Korea, Malaysia, and Singapore. In addition, PT Trisula International Tbk offers its products through jobb.co.id, g2000.co.id, and jacknicklaus.co.id Websites. The company was founded in 1968 and is headquartered in West Jakarta, Indonesia. PT Trisula International Tbk is a subsidiary of PT Trisula Insan Tiara.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "West Jakarta",
        "zipcode": "11740",
        "website": "http://www.trisula.co.id",
        "market_cap": 442849984512
    },
    "TRST.JK": {
        "short_name": "Trias Sentosa Tbk.",
        "long_name": "PT Trias Sentosa Tbk",
        "summary": "PT Trias Sentosa Tbk engages in the manufacture and trading of plastic packaging materials in Indonesia Japan, rest of Asia, the United States, Australia, Europe, and internationally. The company manufactures and sells biaxially oriented polypropylene (BOPP) and biaxially oriented polyester (BOPET) films and plastics; and offers solutions of plastic packaging products. Its BOPP and BOPET products include printing and lamination, overwrap, anti-fog, matte, pearlized, white opaque, label, metallized, coated, heat sealable, and thermal film products. The company's products are used for food packaging; tobacco and box overwraps; anti-fog bags for vegetables, fresh fruits, and salad; paper look packaging and paper lamination; clear, white, and metallized label packaging; and ice cream, candy, and soap packaging. It is also involved in the investment, trading, import, export, distribution, and other activities. The company was founded in 1979 and is headquartered in Sidoarjo, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Sidoarjo",
        "zipcode": "61262",
        "website": "http://www.trias-sentosa.com",
        "market_cap": 1207439982592
    },
    "TURI.JK": {
        "short_name": "Tunas Ridean Tbk.",
        "long_name": "PT Tunas Ridean Tbk",
        "summary": "PT Tunas Ridean Tbk engages in the automotive dealership business in Indonesia. The company operates in three segments: Automotive, Rental Services, and Financial Services. It acts as a dealer for Toyota, BMW, Daihatsu, Isuzu, and Honda brands. The company also rents motor vehicles; and provides driver, cleaning, and auction services. PT Tunas Ridean Tbk was founded in 1967 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12740",
        "website": "http://www.tunasgroup.com",
        "market_cap": 6417000431616
    },
    "UFOE.JK": {
        "short_name": "Damai Sejahtera Abadi Tbk.",
        "long_name": "PT Damai Sejahtera Abadi Tbk",
        "summary": "PT Damai Sejahtera Abadi Tbk operates retail electronics store in Indonesia. It sells LED TVs, LCDs, plasmas, computers, laptops, office supplies, mobile phones, various gadgets, speakers, home theaters, digital cameras, kitchen electronic equipment, and household furniture. The company was founded in 2004 and is based in Surabaya, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Surabaya",
        "zipcode": "60282",
        "website": "http://corp.ufoelektronika.com",
        "market_cap": null
    },
    "WOOD.JK": {
        "short_name": "Integra Indocabinet Tbk.",
        "long_name": "PT Integra Indocabinet Tbk",
        "summary": "PT Integra Indocabinet Tbk manufactures and sells wooden furniture and other wooden products in Indonesia. The company operates through Manufacturing, Forestry, and Trading segments. It offers indoor, reclaim wood, panel, set up, garden/outdoor, and industrial and natural fiber furniture; building components, door products, and solid and fingerjoint laminated boards; and furniture for hotel, apartment, and school projects. The company also holds forest concession rights. It exports its products to the United States, Asia, Australia, Africa, and Europe. The company was founded in 1989 and is based in Sidoarjo, Indonesia. PT Integra Indocabinet Tbk is a subsidiary of PT Integra Indo Lestari.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Sidoarjo",
        "zipcode": "61253",
        "website": "http://www.integragroup-indonesia.com/site/integra-indocabinet/",
        "market_cap": 4761218711552
    },
    "YELO.JK": {
        "short_name": "Yelooo Integra Datanet Tbk.",
        "long_name": "PT Yelooo Integra Datanet Tbk",
        "summary": "PT Yelooo Integra Datanet Tbk engages in leasing communication technology equipment in Indonesia. It also provides tour and travel services, as well as trades in communication equipment. The company was founded in 2016 and is headquartered in Jakarta Pusat, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10150",
        "website": "http://www.passpod.com",
        "market_cap": 49405718528
    },
    "YPAS.JK": {
        "short_name": "Yanaprima Hastapersada Tbk",
        "long_name": "PT Yanaprima Hastapersada Tbk",
        "summary": "PT Yanaprima Hastapersada Tbk manufactures and exports polypropylene (PP) and polyethylene woven bags in Indonesia, rest of Asia, and internationally. The company operates through Plastic Bags, Cement Bags, Roll Sheet and Sandwich Sheet, and Others segments. It provides block-bottom bags for use in packaging cement, resins, and other bulk materials; PP woven bags for bulk material packaging; coated woven PP bags and woven PP bags laminated with kraft paper; and semi-finished products. The company was founded in 1995 and is headquartered in Jakarta, Indonesia. PT Yanaprima Hastapersada Tbk is a subsidiary of PT Hastagraha Bumipersada.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12950",
        "website": "http://www.yanaprima.com",
        "market_cap": 304607985664
    },
    "ZBRA.JK": {
        "short_name": "Zebra Nusantara Tbk",
        "long_name": "PT Zebra Nusantara Tbk",
        "summary": "PT Zebra Nusantara Tbk, together with its subsidiaries, provides taxi and other related services in Indonesia. It operates through two divisions, Taxi and Gas Fuel services. The company also sells gas fuels. The company was formerly known as PT. Zebra Taksi and changed its name to PT. Zebra Nusantara Tbk in May 1990. PT. Zebra Nusantara Tbk was founded in 1987 and is headquartered in Surabaya, Indonesia. As of March 9, 2021, PT Zebra Nusantara Tbk operates as a subsidiary of PT Trinity Healthcare.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Surabaya",
        "zipcode": "60291",
        "website": "http://www.zebranusantara.co.id",
        "market_cap": 241918656512
    },
    "ZONE.JK": {
        "short_name": "Mega Perintis Tbk.",
        "long_name": "PT Mega Perintis Tbk",
        "summary": "PT Mega Perintis Tbk manufactures, retails, and trades in men's fashion products and accessories in Indonesia. The company was founded in 2005 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12940",
        "website": "http://megaperintis.co.id",
        "market_cap": 368952508416
    }
}