{
  "ERTX.JK": {
    "city": "Surabaya",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Apparel Manufacturing",
    "long_name": "PT Eratex Djaja Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Eratex Djaja Tbk.",
    "state": null,
    "summary": "PT Eratex Djaja Tbk manufactures and sells garments in Indonesia and internationally. It is involved in spinning, weaving, dyeing, finishing, printing, false twisting, and knitting. The company's products include jeans, casual dress pants, denims, and Italian twills. It is also involved in the general trading business. The company was founded in 1972 and is headquartered in Surabaya, Indonesia. PT Eratex Djaja Tbk is a subsidiary of PT Buana Indah Garment.",
    "website": "http://www.eratexco.com",
    "zipcode": "60226"
  },
  "PBRX.JK": {
    "city": "Tangerang",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Apparel Manufacturing",
    "long_name": "PT Pan Brothers Tbk",
    "market": "id_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Pan Brothers Tbk.",
    "state": null,
    "summary": "PT Pan Brothers Tbk, together with its subsidiaries, develops, manufactures, and supplies garments. It offers woven garments, such as padded and light weight jackets, pants, shorts, casual pants and dress shirts, etc.; technical, functional, and active wear jackets for snow boarding, ski outer wear, active wear, jogging, hiking, other sports and outdoor activities, etc.; and cut and sewn knit garments, including polo shirts, golf shirts, track suits, and sweat suits, as well as various fabric products. The company also provides garment printing and embroidery services. It exports its products to the United States, European Community, Eastern Europe, Canada, Asia, Australia, New Zealand, and internationally. The company was founded in 1980 and is headquartered in Tangerang, Indonesia.",
    "website": "http://www.panbrotherstbk.com",
    "zipcode": "15133"
  },
  "POLU.JK": {
    "city": "Semarang",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Apparel Manufacturing",
    "long_name": "PT Golden Flower, Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Golden Flower Tbk.",
    "state": null,
    "summary": "PT Golden Flower, Tbk manufactures and sells garments in Indonesia. It offers men's and women's casuals, and formal light woven wears. The company's products include ladies blouse, men's shirt, non-iron shirt, casual shirt, skirt, dresses, night wear, uniform, etc. It also offers garment services, such as cutting, sewing, checking, ironing, finishing. The company also exports its products to the United States, Canada, European Union, Australia, Japan, and other Asian countries. PT Golden Flower, Tbk was founded in 1958 and is based in Semarang, Indonesia. PT Golden Flower, Tbk is a subsidiary of PT Profashion Apparel.",
    "website": "http://goldenflower.co.id",
    "zipcode": "50519"
  },
  "RICY.JK": {
    "city": "Bogor",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Apparel Manufacturing",
    "long_name": "PT Ricky Putra Globalindo Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Ricky Putra Globalindo Tbk",
    "state": null,
    "summary": "PT Ricky Putra Globalindo Tbk manufactures and sells underwear and fashion wear in Indonesia, Australia, the United States, Asia, Europe, Africa, and the Middle East. It operates through Manufacturing of Underwear and Fashion Wear, Trading, and Spinning Manufacturing segments. The company offers men's underwear under the Ricky, GT Man, Ricsony, GT Man Kid, GT Kid, GT Man Sport, and GT Ladies brands. It also provides outfits for children, as well as adolescent and adult women and men under international licenses and own brands, such as Transformer, Pokemon, Barbie, and Despicable Me. In addition, the company offers nightgowns, women's underwear, t-shirts, and polo shirts for children, as well as adolescent and adult women and men. Further, it provides knitting yarn comprising cotton knitting yarn and TC knitting yarns with various sizes; and knit fabrics products under the flag of PT Ricky Tekstil Indonesia. Additionally, the company engages in exporting apparel; and restaurant business. The company was formerly known as PT Ricky Putra Garmindo and changed its name to PT Ricky Putra Globalindo Tbk in June 1996. PT Ricky Putra Globalindo Tbk was founded in 1987 and is headquartered in Bogor, Indonesia.",
    "website": "http://www.rpg.co.id",
    "zipcode": null
  },
  "TRIS.JK": {
    "city": "West Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Apparel Manufacturing",
    "long_name": "PT Trisula International Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Trisula International Tbk.",
    "state": null,
    "summary": "PT Trisula International Tbk, together with its subsidiaries, designs and manufactures garments in Indonesia. It operates in two segments, Garment and Retail. The Garment segment manufactures and markets casual wear, lifestyle clothing, golf clothing, executive office wear, and uniforms; and corporate garments and uniforms for a range of industry sectors, including banks, airlines, retail outlets, hotels, governments, schools, transportation entities, and hospitals. The Retail segment operates retail outlets; and distributes garments to department stores, retail outlets, and designer boutiques. The company markets its products primarily under the JOBB, Jack Nicklaus, Man Club, and G2000 brands. It owns and operates 300 outlets. The company also exports its products primarily to the United States, the United Kingdom, Australia, Japan, South Korea, Malaysia, and Singapore. In addition, PT Trisula International Tbk offers its products through jobb.co.id, g2000.co.id, and jacknicklaus.co.id Websites. The company was founded in 1968 and is headquartered in West Jakarta, Indonesia. PT Trisula International Tbk is a subsidiary of PT Trisula Insan Tiara.",
    "website": "http://www.trisula.co.id",
    "zipcode": "11740"
  }
}
