{
  "BOGA.JK": {
    "city": "Malang",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Auto & Truck Dealerships",
    "long_name": "PT Bintang Oto Global Tbk",
    "market": "id_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Bintang Oto Global Tbk.",
    "state": null,
    "summary": "PT Bintang Oto Global Tbk operates as an integrated automotive company in Indonesia. It engages in the vehicle dealership and rental business; buying and sale of used cars; and provision of vehicle maintenance and repair services. The company was founded in 2011 and is based in Malang, Indonesia.",
    "website": "http://bintangotoglobal.com",
    "zipcode": null
  },
  "CARS.JK": {
    "city": "South Tangerang",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Auto & Truck Dealerships",
    "long_name": "PT Industri dan Perdagangan Bintraco Dharma Tbk",
    "market": "id_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Industri dan Perdagangan Bintra",
    "state": null,
    "summary": "PT Industri dan Perdagangan Bintraco Dharma Tbk engages in the services, trade, workshop, property and real estate, industry, and companies investment businesses. It operates through Automotive and Financing segments. The company provides sales and after-sales vehicle services under the Nasmoco brand; automotive financing for corporates and individuals; and car finance for new or used vehicles. It is also involved in the trading activities; distribution of spare parts; and operation of car services shop. In addition, the company offers electronic system trading and management services related to automotive that are accessible through Website and software app with Android platform. The company was founded in 1969 and is headquartered in South Tangerang, Indonesia. PT Industri dan Perdagangan Bintraco Dharma Tbk is a subsidiary of PT Ahabe Niaga Selaras.",
    "website": "http://www.bintracodharma.com",
    "zipcode": "15321"
  },
  "IDSA.SG": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Auto & Truck Dealerships",
    "long_name": "PT Indomobil Sukses Internasional Tbk",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Indomobil Sukses Intl TBK,PT Re",
    "state": null,
    "summary": "PT Indomobil Sukses Internasional Tbk, together with its subsidiaries, engages in the integrated automotive business in Indonesia. The company operates through four segments: Automotive, Financial Services, Rental and Services, and Others. The company distributes vehicles and spare parts, as well as fuel; assembles vehicle; manufactures automotive parts/component; and provides after sales services, vehicle financing, car rental, used cars trading, logistics, non-formal education services, and other related supporting services, as well as acts as a trademark license holder. Its products include two-wheel and four-wheel vehicles, buses, trucks, and heavy equipment. The company offers products of Audi, Bandit, Datsun, HIAB, Hino, John Deere, Kalmar, KIA, Manitou, Nissan, Renault Trucks, SDLG, Suzuki, Volkswagen, Volvo Bus, Volvo Construction Equipment, and Volvo Trucks brands. In addition, it is involved in the rental and building management activities; operation of gas stations; mining, plantation, and forestry contracting business; industrial plantations management; and transportation and logistics businesses. Further, the company provides e-learning, manpower, and data processing services; and automotive services, such as dealership, workshop, and financing. The company was founded in 1987 and is headquartered in Jakarta, Indonesia. PT Indomobil Sukses Internasional Tbk is a subsidiary of Gallant Venture Ltd.",
    "website": "http://www.indomobil.com",
    "zipcode": "13330"
  },
  "IMAS.JK": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Auto & Truck Dealerships",
    "long_name": "PT Indomobil Sukses Internasional Tbk",
    "market": "id_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Indomobil Sukses Internasional ",
    "state": null,
    "summary": "PT Indomobil Sukses Internasional Tbk, together with its subsidiaries, engages in the integrated automotive business in Indonesia. The company operates through four segments: Automotive, Financial Services, Rental and Services, and Others. The company distributes vehicles and spare parts, as well as fuel; assembles vehicle; manufactures automotive parts/component; and provides after sales services, vehicle financing, car rental, used cars trading, logistics, non-formal education services, and other related supporting services, as well as acts as a trademark license holder. Its products include two-wheel and four-wheel vehicles, buses, trucks, and heavy equipment. The company offers products of Audi, Bandit, Datsun, HIAB, Hino, John Deere, Kalmar, KIA, Manitou, Nissan, Renault Trucks, SDLG, Suzuki, Volkswagen, Volvo Bus, Volvo Construction Equipment, and Volvo Trucks brands. In addition, it is involved in the rental and building management activities; operation of gas stations; mining, plantation, and forestry contracting business; industrial plantations management; and transportation and logistics businesses. Further, the company provides e-learning, manpower, and data processing services; and automotive services, such as dealership, workshop, and financing. The company was founded in 1987 and is headquartered in Jakarta, Indonesia. PT Indomobil Sukses Internasional Tbk is a subsidiary of Gallant Venture Ltd.",
    "website": "http://www.indomobil.com",
    "zipcode": "13330"
  },
  "MPMX.JK": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Auto & Truck Dealerships",
    "long_name": "PT Mitra Pinasthika Mustika Tbk",
    "market": "id_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Mitra Pinasthika Mustika Tbk.",
    "state": null,
    "summary": "PT Mitra Pinasthika Mustika Tbk, through its subsidiaries, engages in the distribution of two-wheel vehicle and spare parts under Honda brand primarily in Indonesia. It operates through three segments: Distribution, Retail and Aftermarket; Transportation; and Others. The company operates MPMMotor retail outlets. It is also involved in the four-wheel vehicle retail sale and rental, general insurance, and financing activities, as well as online sale of four wheels-vehicle and its supporting activities. In addition, the company provides investment, management consulting, and advisory services; auction services; outsourcing services; land, sea, and air freight forwarding; and other, trading, and workshop services. Further, it trades in new and used motor vehicles, and supporting components; offers general and motor vehicle trading and agency services; and computer consultant activities and other computer facility management services. The company was founded in 1987 and is headquartered in Jakarta, Indonesia.",
    "website": "http://www.mpmgroup.co.id",
    "zipcode": "12940"
  },
  "PMJS.JK": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Auto & Truck Dealerships",
    "long_name": "PT Putra Mandiri Jembar Tbk",
    "market": "id_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Putra Mandiri Jembar Tbk.",
    "state": null,
    "summary": "PT Putra Mandiri Jembar Tbk engages in the vehicle dealership business. The company also engages in the provision of automotive rental services; and e-commerce business. It operates 45 Mitsubishi dealer showrooms, 1 Mercedes-Benz dealer showroom, and 2 Nissan dan Datsun dealer showrooms located in 31 cities and 10 provinces in Sumatera, DKI Jakarta, and Jawa. The company was founded in 2003 and is headquartered in Jakarta, Indonesia.",
    "website": "http://www.ptpmj.co.id",
    "zipcode": "10260"
  },
  "TURI.JK": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Auto & Truck Dealerships",
    "long_name": "PT Tunas Ridean Tbk",
    "market": "id_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Tunas Ridean Tbk.",
    "state": null,
    "summary": "PT Tunas Ridean Tbk engages in the automotive dealership business in Indonesia. The company operates in three segments: Automotive, Rental Services, and Financial Services. It acts as a dealer for Toyota, BMW, Daihatsu, Isuzu, and Honda brands. The company also rents motor vehicles; and provides driver, cleaning, and auction services. PT Tunas Ridean Tbk was founded in 1967 and is headquartered in Jakarta, Indonesia.",
    "website": "http://www.tunasgroup.com",
    "zipcode": "12740"
  }
}
