{
    "BOLA.JK": {
        "short_name": "Bali Bintang Sejahtera Tbk.",
        "long_name": "PT Bali Bintang Sejahtera Tbk",
        "summary": "PT Bali Bintang Sejahtera Tbk operates a professional football club. It operates a club under the Bali United Football Club name. The company engages in the management of football club and young football academies; and sale of jersey and merchandise the club. It is also involved in the operation of sports agencies, which include sponsor providers for soccer clubs in Indonesia, direct streaming video services, and creation of sponsor advertising videos; cafe; radio; and others. The company was founded in 1989 and is based in Denpasar, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Denpasar",
        "zipcode": "80118",
        "website": "http://www.baliutd.com",
        "full_time_employees": 196
    },
    "PJAA.JK": {
        "short_name": "Pembangunan Jaya Ancol Tbk.",
        "long_name": "PT Pembangunan Jaya Ancol Tbk",
        "summary": "PT Pembangunan Jaya Ancol Tbk, together with its subsidiaries, primarily engages in managing recreational parks, sports facilities, and resorts in Indonesia. It operates through Tourism; Real Estate; and Trading and Services segments. The company manages entrance gates, recreational parks and beaches, fantasy world, swimming pool, animal shows, and lodging facilities, as well as engages in merchandise selling activities. It also develops, sells, and rents properties, including houses, shophouses, condominiums, apartments, offices, and shopping centers, as well as land. In addition, the company is involved in souvenirs trading, marine transportation, and restaurant management activities; the purification, management, supply, and distribution of clean water; and the provision of highway construction and services, and waste and draination services. PT Pembangunan Jaya Ancol Tbk was founded in 1992 and is headquartered in North Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "North Jakarta",
        "zipcode": "14430",
        "website": "http://www.ancol.com",
        "full_time_employees": 735
    },
    "TOYS.JK": {
        "short_name": "Sunindo Adipersada Tbk.",
        "long_name": "PT Sunindo Adipersada Tbk",
        "summary": "PT Sunindo Adipersada Tbk manufactures and sells toys in Indonesia. The company also exports its products. PT Sunindo Adipersada Tbk was founded in 1991 and is headquartered in Bogor, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bogor",
        "zipcode": "16820",
        "website": "http://www.sunindo.id",
        "full_time_employees": 76
    }
}