{
    "AKPI.JK": {
        "short_name": "Argha Karya Prima Industry Tbk.",
        "long_name": "PT Argha Karya Prima Industry Tbk",
        "summary": "PT Argha Karya Prima Industry Tbk manufacturers, markets, trades, and distributes flexible packaging films in Indonesia, Asia, Africa, America, the Middle East, Europe, Australia, and New Zealand. It operates through two segments, Manufacturing and Distribution. The company offers biaxially oriented poly propylene films and polyester films. The company was founded in 1980 and is based in Bogor, Indonesia. PT Argha Karya Prima Industry Tbk is a subsidiary of PT Nawa Panduta.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Bogor"
    },
    "APLI.JK": {
        "short_name": "Asiaplast Industries Tbk.",
        "long_name": "PT Asiaplast Industries Tbk.",
        "summary": "PT Asiaplast Industries Tbk. manufactures and sells polyvinyl chloride products in Indonesia and internationally. The company offers flexible films and sheets for use in office equipment, overlay furniture and home appliances, promotion media, raincoats, packaging products, etc.; leatherette for use in fashion products, automotive interior, furniture, tents, etc.; and rigid films and sheets for use in pharmaceutical grade blisters, food grade packaging products, boxes and window boxes, thermoform packaging products, etc. It also provides polyethylene terephthalate sheets for use in drinking cups and lids, food packaging products, cosmetic trays and window boxes, electronic packaging products, semiconductor trays, automotive spare part packaging products, pharmaceutical blisters, etc. The company was formerly known as PT Akasa Pandukarya. The company was founded in 1992 and is headquartered in Tangerang, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "BRNA.JK": {
        "short_name": "Berlina Tbk.",
        "long_name": "PT Berlina Tbk",
        "summary": "PT Berlina Tbk, together with its subsidiaries, provides plastic packaging solutions in Indonesia and internationally. It offers plastic laminated tubes and packages, bottle and cap plastic products, and toothbrushes. The company also engages in plastic processing, general trading, and service activities. It primarily serves multinational companies in various industries, including cosmetics, pharmacy, food and beverage, industrial goods, etc. The company was founded in 1969 and is headquartered in Bekasi, Indonesia. PT Berlina Tbk is a subsidiary of PT Dwi Satrya Utama.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Bekasi"
    },
    "EPAC.JK": {
        "short_name": "Megalestari Epack Sentosaraya T",
        "long_name": "PT Megalestari Epack Sentosaraya Tbk",
        "summary": "PT Megalestari Epack Sentosaraya Tbk engages in plastic packaging business in Indonesia. The company is headquartered in Tangerang, Indonesia. PT Megalestari Epack Sentosaraya Tbk is a subsidiary of ePac Flexibles Asia Pte. Ltd.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "ESIP.JK": {
        "short_name": "Sinergi Inti Plastindo Tbk.",
        "long_name": "PT Sinergi Inti Plastindo Tbk",
        "summary": "PT Sinergi Inti Plastindo Tbk provides plastic packaging products in Indonesia and internationally. It offers low and high density polyethylene products, such as T-shirt bags, soft loop handle bags, poly draw bags, and patch handle bags. The company was founded in 2001 and is headquartered in South Jakarta, Indonesia. PT Sinergi Inti Plastindo Tbk is a subsidiary of PT Tanindo Omega Pasifik.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "South Jakarta"
    },
    "IGAR.JK": {
        "short_name": "Champion Pacific Indonesia Tbk.",
        "long_name": "PT Champion Pacific Indonesia Tbk",
        "summary": "PT Champion Pacific Indonesia Tbk, together with its subsidiaries, manufactures, supplies, and sells flexible packaging products in Indonesia. It offers various plastic products for the pharmaceutical, food, and cosmetic industries. The company was formerly known as PT Kageo Igar Jaya Tbk and changed its name to PT Champion Pacific Indonesia Tbk in October 2010. The company was founded in 1975 and is headquartered in Bekasi, Indonesia. PT Champion Pacific Indonesia Tbk is a subsidiary of PT Kingsford Holdings.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Bekasi"
    },
    "IPOL.JK": {
        "short_name": "Indopoly Swakarsa Industry Tbk.",
        "long_name": "PT Indopoly Swakarsa Industry Tbk",
        "summary": "PT Indopoly Swakarsa Industry Tbk, together with its subsidiaries, operates as a flexible-packaging manufacturing company in Indonesia, China, Singapore, and the United States. It operates through three segments: Cigarette Packaging, Food Packaging, and Specialty Films. The company manufactures and sells biaxially oriented polypropylene films for cigarette and food packaging, labeling, graphic media, custom overwrap/custom purpose, and green packaging segments; and biaxially oriented polyester films for food packaging, custom overwrap/custom purpose, and graphic media film segments. It is also involved in the investment business. The company markets its products under the Ilene brand name. PT Indopoly Swakarsa Industry Tbk was founded in 1995 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "IUD.SG": {
        "short_name": "PT Champion Pacific Indonesia R",
        "long_name": "PT Champion Pacific Indonesia Tbk",
        "summary": "PT Champion Pacific Indonesia Tbk, together with its subsidiaries, manufactures, supplies, and sells flexible packaging products in Indonesia. It offers various plastic products for the pharmaceutical, food, and cosmetic industries. The company was formerly known as PT Kageo Igar Jaya Tbk and changed its name to PT Champion Pacific Indonesia Tbk in October 2010. The company was founded in 1975 and is headquartered in Bekasi, Indonesia. PT Champion Pacific Indonesia Tbk is a subsidiary of PT Kingsford Holdings.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Bekasi"
    },
    "KDSI.JK": {
        "short_name": "Kedawung Setia Industrial Tbk.",
        "long_name": "PT Kedawung Setia Industrial Tbk",
        "summary": "PT Kedawung Setia Industrial Tbk, together with its subsidiary, manufactures and sells enamel products in Indonesia. The company offers enamel houseware, corrugated carton boxes, and egg tray boxes. It also exports its products. The company was founded in 1973 and is headquartered in Surabaya, Indonesia. PT Kedawung Setia Industrial Tbk is a subsidiary of PT Kitasubur Utama.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Surabaya"
    },
    "PBID.JK": {
        "short_name": "Panca Budi Idaman Tbk.",
        "long_name": "PT Panca Budi Idaman Tbk",
        "summary": "PT Panca Budi Idaman Tbk manufactures, distributes, and trades in plastic packaging products. It provides polyethylene and polypropylene bags; high density polyethylene resins; and heavy duty sacks, as well as packaging products, such as food wrapping papers, cake boxes, plastic ropes, rubber bands, and straws. The company also trades in plastic resins. It distributes its products to retail merchants, semi-wholesalers, and wholesalers. The company provides its products under the Pluit, Tomat, Bangkuang, Jeruk, Cabe, 222, Wayang, Gapura, Sparta, Liberty, Dayana, PB, and various other brand names. It exports its products to the United Kingdom, Germany, the Netherlands, Spain, the United Arab Emirates, Nigeria, the United States, Taiwan, etc. The company was founded in 1979 and is headquartered in Tangerang, Indonesia. PT Panca Budi Idaman Tbk is a subsidiary of PT Alphen Internasional Corporindo.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "PICO.JK": {
        "short_name": "Pelangi Indah Canindo Tbk",
        "long_name": "PT Pelangi Indah Canindo Tbk",
        "summary": "PT Pelangi Indah Canindo Tbk manufactures and sells metal packaging products in Indonesia and internationally. The company offers steel drums, PG tank, pail cans, food cans, and general cans, as well as provides metal printing services. The company was founded in 1983 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "SMKL.JK": {
        "short_name": "Satyamitra Kemas Lestari Tbk.",
        "long_name": "PT Satyamitra Kemas Lestari Tbk",
        "summary": "PT Satyamitra Kemas Lestari Tbk provides integrated carton packaging solutions in Indonesia. It offers corrugated carton boxes, pre-print, offset, and rigid boxes; and truck rental and logistics services. The company was founded in 2001 and is headquartered in Tangerang, Indonesia. PT Satyamitra Kemas Lestari Tbk is a subsidiary of Satyamitra Investindo Pratama.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "SWAT.JK": {
        "short_name": "Sriwahana Adityakarta Tbk.",
        "long_name": "PT Sriwahana Adityakarta Tbk",
        "summary": "PT Sriwahana Adityakarta Tbk manufactures and sells corrugated carton packaging solutions. It offers corrugated carton for use in transport, consumer, non-direct contact food, and non-food packaging applications; paper cones; and paper tubes. The company was founded in 1990 and is headquartered in Boyolali, Indonesia. PT Sriwahana Adityakarta Tbk is a subsidiary of PT Sumber Makmur Lumintu.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Boyolali"
    },
    "TALF.JK": {
        "short_name": "Tunas Alfin Tbk.",
        "long_name": "PT Tunas Alfin Tbk",
        "summary": "PT Tunas Alfin Tbk manufactures and sells packaging products in Indonesia. The company offers dry and wet, wax, extrusion, and solventless lamination; paper and board metalizing; and printing services, as well as produces release paper and adhesive coating products. It serves cigarette, consumer food, and health and hygiene products manufacturing industries. The company was founded in 1977 and is headquartered in Tangerang, Indonesia. PT Tunas Alfin Tbk is a subsidiary of PT Proinvestindo.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "TRST.JK": {
        "short_name": "Trias Sentosa Tbk.",
        "long_name": "PT Trias Sentosa Tbk",
        "summary": "PT Trias Sentosa Tbk engages in the manufacture and trading of plastic packaging materials in Indonesia Japan, rest of Asia, the United States, Australia, Europe, and internationally. The company manufactures and sells biaxially oriented polypropylene (BOPP) and biaxially oriented polyester (BOPET) films and plastics; and offers solutions of plastic packaging products. Its BOPP and BOPET products include printing and lamination, overwrap, anti-fog, matte, pearlized, white opaque, label, metallized, coated, heat sealable, and thermal film products. The company's products are used for food packaging; tobacco and box overwraps; anti-fog bags for vegetables, fresh fruits, and salad; paper look packaging and paper lamination; clear, white, and metallized label packaging; and ice cream, candy, and soap packaging. It is also involved in the investment, trading, import, export, distribution, and other activities. The company was founded in 1979 and is headquartered in Sidoarjo, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Sidoarjo"
    },
    "YPAS.JK": {
        "short_name": "Yanaprima Hastapersada Tbk",
        "long_name": "PT Yanaprima Hastapersada Tbk",
        "summary": "PT Yanaprima Hastapersada Tbk manufactures and exports polypropylene (PP) and polyethylene woven bags in Indonesia, rest of Asia, and internationally. The company operates through Plastic Bags, Cement Bags, Roll Sheet and Sandwich Sheet, and Others segments. It provides block-bottom bags for use in packaging cement, resins, and other bulk materials; PP woven bags for bulk material packaging; coated woven PP bags and woven PP bags laminated with kraft paper; and semi-finished products. The company was founded in 1995 and is headquartered in Jakarta, Indonesia. PT Yanaprima Hastapersada Tbk is a subsidiary of PT Hastagraha Bumipersada.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    }
}