{
    "ACES.JK": {
        "short_name": "Ace Hardware Indonesia Tbk.",
        "long_name": "PT Ace Hardware Indonesia Tbk",
        "summary": "PT Ace Hardware Indonesia Tbk engages in the retail of household appliances and lifestyle products in Indonesia. It operates through Home Improvement Products, Lifestyle Products, and Toy Products segments. As of December 31, 2019, it operated 197 retail outlets located in Jakarta, Tangerang, Cilegon, Bekasi, Karawang, Bogor, Depok, Cirebon, Bandung, Sumedang, Tasikmalaya, Gresik, Yogyakarta, Semarang, Solo, Purwokerto, Tegal, Surabaya, Malang, Jember, Kediri, Madiun, Aceh, Bali, Medan, Batam, Padang, Pekan Baru, Palembang, Jambi, Bengkulu, Lampung, Balikpapan, Makassar, Banjarmasin, Pontianak, Manado, Maluku, Samarinda, Kupang, Lombok, Kendari dan, and Pangkal Pinang. The company was formerly known as PT Ace Indoritel Perkakas and changed its name to PT Ace Hardware Indonesia Tbk in August 2001. The company was founded in 1995 and is headquartered in Jakarta, Indonesia. PT Ace Hardware Indonesia Tbk is a subsidiary of PT Kawan Lama Sejahtera.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "11610",
        "website": "http://www.acehardware.co.id",
        "market_cap": 24178952503296
    },
    "DAYA.JK": {
        "short_name": "Duta Intidaya Tbk.",
        "long_name": "PT Duta Intidaya Tbk",
        "summary": "PT Duta Intidaya Tbk operates as a beauty and health retailer in Indonesia. The company offers medicine, pharmacy goods, medical and wellness equipment, personal and skin care products, perfume and cosmetics, baby products, and general merchandise in stores and pharmacies. It also trades in food and beverages. In addition, the company acts as an agent, representative, sole agent, distributor, and purveyor, as well as a franchise and supplier of various traded goods. As of December 31, 2019, the company operated a network of 140 stores in Java and Bali Island, Kalimantan, Yogyakarta, Banten, Jakarta, Sumatera, and Sulawesi under the Watsons brand. PT Duta Intidaya Tbk also operates online stores at Shopee.com, Lazada.com, Blibli.com, and Bukalapak.com, as well as at Halodoc platform and bima+ App. The company was founded in 2005 and is based in South Jakarta, Indonesia. PT Duta Intidaya Tbk is a subsidiary of Total Alliance Holdings Limited.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "South Jakarta",
        "zipcode": "12870",
        "website": "http://www.watsons.biz.id",
        "market_cap": 663230676992
    },
    "ECII.JK": {
        "short_name": "Electronic City Indonesia Tbk.",
        "long_name": "PT Electronic City Indonesia Tbk",
        "summary": "PT Electronic City Indonesia Tbk engages in the trade of electronic goods in Indonesia. It operates through three segments: Sales of Branded Electronic Goods, Rents, and Others. The company offers products in the categories of home appliances, audio and video, IT and mobile devices, and camera and office equipment. It sells its products through online stores. The company is also involved in the property business. PT Electronic City Indonesia Tbk was founded in 2001 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12190",
        "website": "http://eci.id",
        "market_cap": 1226399940608
    },
    "ERAA.JK": {
        "short_name": "Erajaya Swasembada Tbk.",
        "long_name": "PT Erajaya Swasembada Tbk",
        "summary": "PT Erajaya Swasembada Tbk imports, distributes, and retails mobile telecommunication products in Indonesia. The company offers mobile phones and tablets, subscriber identity module cards, prepaid mobile vouchers, accessories, Internet of Things devices, and Google Play gift cards; computers and other electronic devices; and trades in medical equipment, as well as provides value added services, including mobile phones protection and cellphone leasing services. It also engages in information technology system; management consulting; outsourcing; and property businesses. The company was founded in 1996 and is headquartered in West Jakarta, Indonesia. PT Erajaya Swasembada Tbk is a subsidiary of PT Eralink International.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Barat",
        "zipcode": "11240",
        "website": "http://www.erajaya.com",
        "market_cap": 10731487494144
    },
    "GLOB.JK": {
        "short_name": "Global Teleshop Tbk.",
        "long_name": "PT Global Teleshop Tbk",
        "summary": "PT Global Teleshop Tbk engages in the retail and distribution of cellular phones and operator products in Indonesia. It operates through Cellular Phones, Reload vouchers, Content, and Other segments. The company offers smart phones, tablets, computers, audio products, wearable devices, gadget accessories, and lifestyle and travel products, and fashion and accessories. As of December 31, 2019, the company operated 43 Global Teleshop outlets and service centers. The company was formerly known as PT Pro Empower Perkasa. The company was founded in 2007 and is based in Jakarta Pusat, Indonesia. PT Global Teleshop Tbk operates as a subsidiary of PT Trikomsel Oke Tbk.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10340",
        "website": null,
        "market_cap": 311110795264
    },
    "HADE.JK": {
        "short_name": "Himalaya Energi Perkasa Tbk.",
        "long_name": "PT Himalaya Energi Perkasa Tbk",
        "summary": "PT Himalaya Energi Perkasa Tbk provides financial advisory services. The company offers offline and online trading services; underwriting services; and financial advisory services, such as corporate actions, including merger and acquisition, limited public offering, restructuring, and financing transaction. It also provides trade and debt syndication, and sector financing services. In addition, the company engages in the debt origination, underwriting, securitization, and trading of asset backed securities activities, such as the securitization of housing loans, commercial property, automobile, and credit card; and provision of marketing and distribution services for the products selling, government, corporate, sukuk, and Repo bonds for institutional investor clients, such as banks, pension funds, insurance companies, government agencies, cooperative employees, and financial institutions. Further, it provides liquefied petroleum gas refueling services. The company was formerly known as PT HD Capital Tbk. PT Himalaya Energi Perkasa Tbk was founded in 1989 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "South Jakarta",
        "zipcode": "12210",
        "website": "http://www.hdx.co.id",
        "market_cap": 105999998976
    },
    "KONI.JK": {
        "short_name": "Perdana Bangun Pusaka Tbk",
        "long_name": "PT Perdana Bangun Pusaka Tbk",
        "summary": "PT Perdana Bangun Pusaka Tbk sells and distributes photographic products. The company's photographic products include photographic paper, chemical supplies, films, vinyl/flex banners, frames, and other finished goods, as well as color papers, inkjet papers, dye sub printers, photo printers, minilabs, and DNP media printers. It also provides auto processors, cassettes, grids, hangers, screens, chemical products, X-ray films, and USG papers for conventional medical uses; and CR and DR systems, digital media products, LED viewers, and scanners for medical digital imaging uses, as well as hard disk drives. In addition, the company leases office spaces. It operates through retail stores or representative offices that are located in 15 geographic areas in Indonesia. The company was formerly known as PT Konica Cemerlang and changed its name to PT Perdana Bangun Pusaka Tbk in April 1988. The company was founded in 1987 and is headquartered in Central Jakarta, Indonesia. PT Perdana Bangun Pusaka Tbk is a subsidiary of PT Dasabina Adityasarana.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Central Jakarta",
        "zipcode": "10610",
        "website": "http://www.perdanabangunpusaka.co.id",
        "market_cap": 238640005120
    },
    "MAPA.JK": {
        "short_name": "Map Aktif Adiperkasa Tbk.",
        "long_name": "PT Map Aktif Adiperkasa Tbk",
        "summary": "PT Map Aktif Adiperkasa Tbk operates as a sporting goods retailer in Indonesia. It operates sports, leisure footwear, and kid's stores that sell athletic shoes, apparel, sports equipment, leisure footwear, apparel, accessories, kids wear, toys, and early education tools. The company's brand portfolio includes Planet Sports, Sports Station, Royal Sporting House, Golf House, OGAAN, Kidz Station, and Planet Sports Kids. It sells its products through approximately 1,173 retail stores in 76 cities, as well as through 6 digital stores. The company was founded in 2015 and is headquartered in Central Jakarta, Indonesia. PT Map Aktif Adiperkasa Tbk is a subsidiary of PT Mitra Adiperkasa Tbk.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Central Jakarta",
        "zipcode": "10220",
        "website": "http://mapactive.id",
        "market_cap": 5814815817728
    },
    "ZBRA.JK": {
        "short_name": "Zebra Nusantara Tbk",
        "long_name": "PT Zebra Nusantara Tbk",
        "summary": "PT Zebra Nusantara Tbk, together with its subsidiaries, provides taxi and other related services in Indonesia. It operates through two divisions, Taxi and Gas Fuel services. The company also sells gas fuels. The company was formerly known as PT. Zebra Taksi and changed its name to PT. Zebra Nusantara Tbk in May 1990. PT. Zebra Nusantara Tbk was founded in 1987 and is headquartered in Surabaya, Indonesia. As of March 9, 2021, PT Zebra Nusantara Tbk operates as a subsidiary of PT Trinity Healthcare.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Surabaya",
        "zipcode": "60291",
        "website": "http://www.zebranusantara.co.id",
        "market_cap": 241918656512
    }
}