{
    "ARGO.JK": {
        "short_name": "Argo Pantes Tbk",
        "long_name": "PT Argo Pantes Tbk",
        "summary": "PT Argo Pantes Tbk produces and sells various textile products primarily in Indonesia. It is also involved in the warehouse rental activities. The company was founded in 1977 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "BELL.JK": {
        "short_name": "Trisula Textile Industries Tbk.",
        "long_name": "PT Trisula Textile Industries Tbk",
        "summary": "PT Trisula Textile Industries Tbk manufactures, distributes, and retails textile products in Indonesia. The company provides polyester fabrics for formal jackets and pants, suiting, and uniforms for men and women; fabrics for office and career wear collection; fabrics for tropical weather; and fabrics for apparel and accessories, such as hats, ties, scarves, shoes, belts, and others. It offers its products under the BELLINI and CATERINA brand names. The company also exports its products to Singapore, Thailand, Vietnam, Sri Lanka, India, Japan, the United States, Brazil, Mexico, Colombia, Australia, the United Kingdom, and the Middle East. PT Trisula Textile Industries Tbk was founded in 1968 and is headquartered in Cimahi, Indonesia. PT Trisula Textile Industries Tbk is a subsidiary of PT Inti Nusa Damai.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Cimahi"
    },
    "CNTX.JK": {
        "short_name": "Century Textile Industry Tbk.",
        "long_name": "PT Century Textile Industry Tbk",
        "summary": "PT Century Textile Industry Tbk engages in the textiles business in Indonesia and internationally. The company offers T/C, CVC, dobby, and oxford fabrics used for shirts and uniforms. It also exports its products primarily to the United States, Japan, and the United Kingdom. The company was founded in 1970 and is based in Jakarta Timur, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Timur"
    },
    "ESTI.JK": {
        "short_name": "Ever Shine Tex Tbk.",
        "long_name": "PT Ever Shine Tex Tbk",
        "summary": "PT Ever Shine Tex Tbk, together with its subsidiaries, manufactures and sells synthetic yarns and fabrics in Indonesia. The company's Yarn division offers nylon filament, draw textured, air textured, micro, high stretch, dope dyed, and melange and special yarns, as well as polyester high stretch and air textured yarns under the PRS brand for use in various industries, such as circular and warp knitting, elastic, embroidery, fancy yarn, fashion garments, gloves, labels, lingerie, ribbons, sewing threads, socks and hosiery, and sweater. Its Fabric division provides nylon, polyester, and nylon/polyester blended woven fabrics, as well as warp knitting fabrics for garment and lifestyle industries. It also produces special applications fabrics for use in automotive, home furnishings, and outdoor industries, including decorations, furniture, outdoor tents, sleeping bags, car seat covers, and others. The company offers its products under the APL 10000, APOLLO, HUT 1080, DECOTEX, LININGTEX, and PRO-COTTON brand names. It also exports its products. PT Ever Shine Tex Tbk was founded in 1973 and is headquartered in Jakarta, Indonesia. PT Ever Shine Tex Tbk is a subsidiary of PT Cahaya Interkontinental.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "INDR.JK": {
        "short_name": "Indo-Rama Synthetics Tbk.",
        "long_name": "PT. Indo-Rama Synthetics Tbk",
        "summary": "PT. Indo-Rama Synthetics Tbk, together with its subsidiaries, produces and sells polyester, spun yarns, and fabrics in Indonesia, the rest of Asia, Europe, North America, South America, and internationally. It offers spun yarns, sewing threads, polyester filament yarns, polyester staple fiber, chips, pet resins, grey and finished polyester fabrics, nitrogen and phosphate fertilizers, polyethylene, polypropylene, polyester, textiles, cotton fiber, medical gloves, and polyester feedstocks. The company engages in trading, investment, and other activities; and management of office and school buildings. It also exports its products. The company was founded in 1975 and is based in Jakarta, Indonesia. PT. Indo-Rama Synthetics Tbk is a subsidiary of Indorama Corporation Pte. Ltd.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "KPAS.JK": {
        "short_name": "Cottonindo Ariesta Tbk.",
        "long_name": "PT Cottonindo Ariesta Tbk",
        "summary": "PT Cottonindo Ariesta Tbk manufactures and sells cotton products in Indonesia. The company offers facial cotton pads and cotton buds; cosmetic and medical cotton products, including cotton rolls, dental cotton, mini cotton balls, and cotton ball in various sizes; and industrial cotton products comprising cotton sliver, spunlace cotton pads, bleached cotton, and cotton rolls. It also provides cotton bud manufacturing machines. The company was founded in 1994 and is headquartered in Subang, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Subang"
    },
    "MYTX.JK": {
        "short_name": "Asia Pacific Investama Tbk.",
        "long_name": "PT Asia Pacific Investama Tbk",
        "summary": "PT Asia Pacific Investama Tbk operates as a garments company in Indonesia, Africa, the United States, Asia, Australia, and Europe. The company operates through two segments, Garments, and Weaving and Spinning. It offers denim, grey, job work, laundry, waste, and other garments, as well as yarns. The company was formerly known as PT Apac Citra Centertex Tbk and changed its name to PT Asia Pacific Investama Tbk in November 2015. PT Asia Pacific Investama Tbk was founded in 1987 and is headquartered in Jakarta Barat, Indonesia. PT Asia Pacific Investama Tbk is a subsidiary of PT World Harvest Textile.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Barat"
    },
    "SBAT.JK": {
        "short_name": "Sejahtera Bintang Abadi Textile",
        "long_name": "PT Sejahtera Bintang Abadi Textile Tbk",
        "summary": "PT Sejahtera Bintang Abadi Textile Tbk manufactures and sells yarns using recycled materials primarily in Indonesia. It offers cotton open-end, ploy-cotton bleached open-end, ploy-cotton raw white open-end, ploy-cotton color open-end, mop, and ring-spun yarn products. The company's products are used as materials for mops, towels, denim fabrics, canvas fabrics, carpets, batik, and knitted gloves. It also exports its products to Asia, Europe, the Americas, and Africa. The company was founded in 2003 and is based in Bandung, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Bandung"
    },
    "SRIL.JK": {
        "short_name": "Sri Rejeki Isman Tbk.",
        "long_name": "PT Sri Rejeki Isman Tbk",
        "summary": "PT Sri Rejeki Isman Tbk operates as a textile and garment company in Indonesia. It operates through Spinning, Weaving, Finishing Fabric, and Garment segments. The company provides yarn to textile customers; greige; finished fabric; and military and corporate uniforms. It offers its products in the United States, China, Japan, South Korea, Malaysia, Brunei Darussalam, Timor Leste, Singapore, Nepal, the Philippines, South Africa, the United Arab Emirates, Australia, New Zealand, Germany, Austria, England, Bangladesh, and India. The company was founded in 1966 and is headquartered in Surakarta, Indonesia. PT Sri Rejeki Isman Tbk is a subsidiary of PT Huddleston Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Surakarta"
    },
    "SSTM.JK": {
        "short_name": "Sunson Textile Manufacture Tbk",
        "long_name": "PT Sunson Textile Manufacturer Tbk",
        "summary": "PT Sunson Textile Manufacturer Tbk engages in the manufacturing and selling yarn, fabric, and other textile products in Indonesia. The company operates in three segments: Spinning, Weaving, and Others. It also provides general trading services. The company also exports its products in rest of Asia, Europe, the Americas, and Africa. PT Sunson Textile Manufacturer Tbk was founded in 1972 and is headquartered in Bandung, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Bandung"
    },
    "STAR.JK": {
        "short_name": "Buana Artha Anugerah Tbk.",
        "long_name": "PT Buana Artha Anugerah Tbk",
        "summary": "PT Buana Artha Anugerah Tbk engages in the wholesale trade and export of thread, cotton, and fiber primarily in Indonesia. It also processes synthetic fibers. The company was formerly known as PT Star Petrochem, Tbk and changed its name to PT Buana Artha Anugerah Tbk in June 2019. PT Buana Artha Anugerah Tbk was founded in 2008 and is based in Central Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Central Jakarta"
    },
    "TFCO.JK": {
        "short_name": "Tifico Fiber Indonesia Tbk.",
        "long_name": "PT Tifico Fiber Indonesia Tbk",
        "summary": "PT Tifico Fiber Indonesia Tbk manufactures and sells polyester chips, staple fibers, filament yarns, and RCL products in Indonesia. The company also exports its products to Asia, the United States, Australia, and Europe. PT Tifico Fiber Indonesia Tbk was founded in 1973 and is based in Tangerang, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang"
    }
}