{
    "BAYU.JK": {
        "short_name": "Bayu Buana Tbk",
        "long_name": "PT Bayu Buana Tbk",
        "summary": "PT Bayu Buana Tbk operates as a travel agent in Indonesia and internationally. The company engages in the provision of online systems for airline companies, travel insurance, travel document arrangement, and travel management services; hotel arrangement; and car rental, as well as offers tour packages.. It also offers trading and industrial development; travel bureau; transportation; and umrah services. In addition, the company acts as an airlines ticket sales agent; and organizes conventions. Additionally, the company offers its services through bayubuanatravel.com. PT Bayu Buana Tbk was founded in 1972 and is headquartered in Central Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10120",
        "website": "http://www.bayubuanatravel.com",
        "full_time_employees": 462
    },
    "PANR.JK": {
        "short_name": "Panorama Sentrawisata Tbk.",
        "long_name": "PT Panorama Sentrawisata Tbk",
        "summary": "PT Panorama Sentrawisata Tbk engages in tourism and hospitality businesses primarily in Indonesia. The company offers inbound tour and destination management services to foreign tourists and travelers; and travel leisure offers travel management services to domestic travelers. It also offers media pillar services, such as event and exhibition organizer for meetings, incentives, conventions, and exhibitions activities; live entertainment for music, theater, and other on stage performances; media publication; and publishes travel magazine and books. The company provides premium bus charters, intercity shuttles, tourism buses, and open trip services. PT Panorama Sentrawisata Tbk was founded in 1972 and is headquartered in Jakarta, Indonesia. PT Panorama Sentrawisata Tbk is a subsidiary of PT Panorama Tirta Anugerah.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "11440",
        "website": "http://www.panorama-sentrawisata.com",
        "full_time_employees": 1475
    },
    "PDES.JK": {
        "short_name": "Destinasi Tirta Nusantara Tbk",
        "long_name": "PT Destinasi Tirta Nusantara Tbk",
        "summary": "PT Destinasi Tirta Nusantara Tbk, together with its subsidiaries, operates as a tour operator company in Indonesia. It offers tour and travel packages, tour guides, and tour transportation related services to foreign tourists. The company was founded in 1999 and is headquartered in Jakarta, Indonesia. PT Destinasi Tirta Nusantara Tbk is a subsidiary of PT. Panorama Sentrawisata Tbk.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "11440",
        "website": "http://www.panorama-destination.com",
        "full_time_employees": 554
    },
    "PGJO.JK": {
        "short_name": "Tourindo Guide Indonesia Tbk.",
        "long_name": "PT Tourindo Guide Indonesia Tbk",
        "summary": "PT Tourindo Guide Indonesia Tbk operates a digital tourism marketplace that enable tourism product providers and travelers interact real time online. The company was founded in 2017 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12940",
        "website": "http://www.pigijo.com",
        "full_time_employees": 15
    },
    "SONA.JK": {
        "short_name": "Sona Topas Tourism Industry Tbk",
        "long_name": "PT Sona Topas Tourism Industry Tbk",
        "summary": "PT Sona Topas Tourism Industry Tbk, together with its subsidiaries, provides travel related services in Indonesia. It operates through three divisions: Tours, Duty Free Shops, and Retail Shops. The company operates duty free shops in Bali and retail shops in Jakarta and Bali. It also sells tours and travel tickets, as well as handles related documents and tours. The company was formerly known as PT Sona Topas and changed its name to PT Sona Topas Tourism Industry Tbk in October 1990. PT Sona Topas Tourism Industry Tbk was founded in 1978 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12920",
        "website": "http://www.sonatopas.co.id/new/",
        "full_time_employees": 970
    },
    "YELO.JK": {
        "short_name": "Yelooo Integra Datanet Tbk.",
        "long_name": "PT Yelooo Integra Datanet Tbk",
        "summary": "PT Yelooo Integra Datanet Tbk engages in leasing communication technology equipment in Indonesia. It also provides tour and travel services, as well as trades in communication equipment. The company was founded in 2016 and is headquartered in Jakarta Pusat, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10150",
        "website": "http://www.passpod.com",
        "full_time_employees": 12
    }
}