{
    "ADGL": {
        "short_name": "ALLDIGITAL HLDGS INC",
        "long_name": "AllDigital Holdings, Inc.",
        "summary": "AllDigital Holdings, Inc. provides digital broadcasting solutions to develop, operate, and support complex digital service and digital broadcasting workflow implementations across various devices. The company offers AllDigital Brevity, a solution for transporting large digital media files over the Internet; and AllDigital Cloud, a unified digital broadcasting and cloud services platform for ingesting, storing, preparing, securing, managing, monetizing, converting, and distributing digital media and other forms of data across various devices. It also provides consultation and software development services, such as transition planning, as well as designing, building, and hosting digital workflows that enable its customers to integrate AllDigital Brevity and AllDigital Cloud into existing digital workflows. The company offers its services to various media and entertainment, enterprise, and government/non-profit customers. AllDigital Holdings, Inc. was founded in 2009 and is headquartered in Irvine, California.",
        "currency": "USD",
        "sector": "Services",
        "industry": "Broadcasting - TV",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Irvine"
    },
    "DISN.BA": {
        "short_name": "WALT DISNEY CO.",
        "long_name": "The Walt Disney Company",
        "summary": "The Walt Disney Company, together with its subsidiaries, operates as an entertainment company worldwide. The company's Media Networks segment operates domestic cable networks under the Disney, ESPN, Freeform, FX, and National Geographic brands; and television broadcast network under the ABC brand, as well as eight domestic television stations. This segment is also involved in the television production and distribution. Its Parks, Experiences and Products segment operates theme parks and resorts, such as Walt Disney World Resort in Florida; Disneyland Resort in California; Disneyland Paris; Hong Kong Disneyland Resort; and Shanghai Disney Resort; Disney Cruise Line, Disney Vacation Club, National Geographic Expeditions, and Adventures by Disney and Aulani, a Disney resort and spa in Hawaii, as well as licenses its intellectual property to a third party for the operations of the Tokyo Disney Resort in Japan. The company's Studio Entertainment segment produces and distributes motion pictures under the Walt Disney Pictures, Twentieth Century Studios, Marvel, Lucasfilm, Pixar, Searchlight Pictures, and Blue Sky Studios banners; develops, produces, and licenses live entertainment events; produces and distributes music; and provides post-production services through Industrial Light & Magic and Skywalker Sound. Its Direct-To-Consumer & International segment operates international television networks and channels comprising Disney, ESPN, Fox, National Geographic, and Star; direct-to-consumer videos streaming services consisting of Disney+/Disney+Hotstar, ESPN+, and Hulu; and operates branded apps and Websites, such as Disney Movie Club and Disney Digital Network, as well as provides streaming technology support services. The company was founded in 1923 and is based in Burbank, California.",
        "currency": "ARS",
        "sector": "Services",
        "industry": "Entertainment - Diversified",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "city": "Burbank"
    },
    "DJSP": {
        "short_name": "DJSP ENTERPRISES INC",
        "long_name": "DJSP Enterprises, Inc.",
        "summary": "DJSP Enterprises, Inc. provides processing services for the mortgage and real estate industries in the United States. It engages in offering non-legal services supporting residential real estate foreclosure, other related legal actions, and lender owned real estate (REO) services in the United States. The company involves in providing non-legal support in connection with residential foreclosures, bankruptcy, complex litigation, evictions, and the sale of REO properties by foreclosing lenders. It also prepares drafts of pleadings and documentation for legal matters. In addition, the company provides REO related services, including property inspection, valuation, broker assignments, and closings of purchases. Further, it performs title searches and examinations related to legal services; and assists in the location of defendants in foreclosure proceedings to enable service of legal process. The company serves to mortgage servicers in the United States. DJSP Enterprises, Inc. was formerly known as Chardan 2008 China Acquisition Corp. and changed its name to DJSP Enterprises, Inc. in January 2010. The company was founded in 1994 and is based in Plantation, Florida with additional operations in Louisville, Kentucky; and San Juan, Puerto Rico.",
        "currency": "USD",
        "sector": "Services",
        "industry": "Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Plantation"
    },
    "DRSV": {
        "short_name": "DEBT RESOLVE INC",
        "long_name": "Debt Resolve, Inc.",
        "summary": "Debt Resolve, Inc. provides software solutions to consumer lenders or those collecting consumer loans using Software-as-a-Service model in the United States. Its solutions facilitate Web-based payments or the resolution of delinquent or defaulted consumer debt. The company also provides services in the student loan document preparation industry. It serves consumer banks, collection agencies, and the buyers of defaulted debt. The company was formerly known as Lombardia Acquisition Corp. and changed its name to Debt Resolve, Inc. in May 2003. Debt Resolve, Inc. was founded in 1997 and is based in Hawthorne, New York. On July 29, 2020, the voluntary petition of Debt Resolve, Inc. for reorganization under Chapter 11 was converted to Chapter 7. It had filed for Chapter 11 bankruptcy on February 3, 2020.",
        "currency": "USD",
        "sector": "Services",
        "industry": "Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Hawthorne"
    },
    "ELTZ": {
        "short_name": "ELITE GROUP INC",
        "long_name": "Elite Group, Inc.",
        "summary": "Elite Group, Inc. engages in acquiring water properties for the oilfield service sector. It holds a Salt Water Disposal (Kypo) property in oil and gas land located in Carrizo Springs, Texas. The company was formerly known as Elite Books, Inc. and changed its name to Elite Group, Inc. in July 2016. Elite Group, Inc. was founded in 2013 and is based in Frisco, Texas.",
        "currency": "USD",
        "sector": "Services",
        "industry": "Specialty Retail, Other",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Frisco"
    },
    "FUEG": {
        "short_name": "FACE UP ENTERTAINMENT GROUP INC",
        "long_name": "Face Up Entertainment Group, Inc.",
        "summary": "Face Up Entertainment Group, Inc., a development stage company, focuses on the development of Internet reality gaming social network. The company operates FaceUpGaming.com, a non-wagering internet poker Website, which provides users with streaming video, audio, and messaging capabilities. It has a strategic partnership with Texas Hold'em Poker Tours. The company was formerly known as Game Face Gaming, Inc. and changed its name to Face Up Entertainment Group, Inc. in April 2012. Face Up Entertainment Group, Inc. was founded in 2009 and is based in Valley Stream, New York.",
        "currency": "USD",
        "sector": "Services",
        "industry": "Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Valley Stream"
    },
    "INHC": {
        "short_name": "INNOLOG HLDGS CORP",
        "long_name": "Innolog Holdings Corporation",
        "summary": "Innolog Holdings Corporation, through its subsidiary, Innovative Logistics Techniques, Inc., provides supply chain logistics and information technology solutions to clients in the public and private sectors. The company offers its services and solutions to various clients comprising the Department of Defense, Department of Homeland Security, and civilian agencies in the federal government, as well as state and local municipalities and commercial organizations. Innolog Holdings Corporation is headquartered in Fairfax, Virginia with an additional office in Washington D.C.",
        "currency": "USD",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Fairfax"
    },
    "IRBS": {
        "short_name": "IR BIOSCIENCES HOLDINGS INC",
        "long_name": "IR Biosciences Holdings Inc.",
        "summary": "IR BioSciences Holdings, Inc. operates as a development stage biotechnology company in the United States. The company, through its subsidiary, ImmuneRegen BioSciences, Inc., engages in the research and development of therapies in the areas of pulmonary fibrosis, influenza infection, and radiation-induced Neutropenia. It is involved in the development of Homspera, and its derivates Radilex and Viprovex, for human stem cell stimulation, immune system stimulation and anti-infective activity, vaccine adjuvancy, and wound healing. IR BioSciences Holdings, Inc. was founded in 1999 and is headquartered in Scottsdale, Arizona.",
        "currency": "USD",
        "sector": "Services",
        "industry": "Research Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Scottsdale"
    },
    "ITEC": {
        "short_name": "INTERTECH SOLUTIONS INC",
        "long_name": "Intertech Solutions , Inc.",
        "summary": "Intertech Solutions , Inc. operates as gold project finance, management, and services consulting company in Arizona. The company provides development capital, engineering, project supervision, and technical management services to gold projects. It has a gold stream agreement with West Port Gold for the West Port Gold project in Arizona. The company was formerly known as Amwest Imaging Incorporated and changed its name to Intertech Solutions , Inc. in July 2013. Intertech Solutions, Inc. was founded in 2010 and is based in Scottsdale, Arizona.",
        "currency": "USD",
        "sector": "Services",
        "industry": "Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Scottsdale"
    },
    "LB3A.DE": {
        "short_name": "QURATE RETAIL INC. QVC A",
        "long_name": "Qurate Retail, Inc.",
        "summary": "Qurate Retail, Inc., through its subsidiaries, engages in the video and online commerce industries in North America, Europe, and Asia. The company markets and sells various consumer products primarily through television, programs, Websites, and mobile applications to approximately 380 million households worldwide. It also operates as an online retailer offering women's, children's, and men's apparel; and other products, such as home, and beauty products through its desktop and mobile Websites, and mobile applications under the name Zulily. The company was formerly known as Liberty Interactive Corporation and changed its name to Qurate Retail, Inc. in April 2018. Qurate Retail, Inc. was founded in 1991 and is headquartered in Englewood, Colorado.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Specialty Retail, Other",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "Englewood"
    },
    "PCPZ": {
        "short_name": "LEEWARD GROUP HLDGS INC",
        "long_name": "Leeward Group Holdings Inc.",
        "summary": "Leeward Group Holdings Inc. provides retail insurance agency and risk consulting services in the United States. The company sells various categories of insurance products to commercial, professional, and individual customers, which include property insurance relating to physical damage to property; casualty insurance relating to legal liabilities, workers' compensation, and commercial and private passenger automobile coverages; and fidelity and surety bonds. It also sells and services group and individual life, accident, disability, health, hospitalization, medical, and dental insurance products. In addition, the company provides specialty products and services to associations, industries, and businesses, which comprise umbrella insurance policies for limited service franchise hotels and motels; personal umbrella insurance for lawyers; and mobile phone insurance program for telecommunications companies, which offers coverage for the loss, theft, or accidental damage of cell phones. Further, it creates and administers risk management services, such as reinsurance brokerage. The company distributes its products through retail agencies and insurance producers, as well as insurance programs through non-affiliated insurance agencies and associations. Leeward Group Holdings Inc. is headquartered in Pennington, New Jersey.",
        "currency": "USD",
        "sector": "Services",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Pennington"
    },
    "PGOG": {
        "short_name": "PERF GO GREEN HOLDINGS INC",
        "long_name": "Perf Go Green Holdings, Inc.",
        "summary": "Perf Go Green Holdings, Inc. operates as a biodegradable plastics company in the United States and Canada. It focuses on the development and marketing of eco-friendly, non-toxic, food contact compliant, biodegradable plastic products. The company's biodegradable plastic products offer a practical and viable solution for reducing plastic waste from the environment. Its products include biodegradable trash bags, biodegradable plastic drop cloths, Biodegradable Doggie Duty Bags and Cat Pan Liners, PerfPower alkaline batteries, and Perf Go Clean cleaning products. Perf Go Green Holdings, Inc. is based in New York, New York.",
        "currency": "USD",
        "sector": "Services",
        "industry": "Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "PVHO": {
        "short_name": "PROVISION HOLDING INC",
        "long_name": "Provision Holding, Inc.",
        "summary": "Provision Holding, Inc. focuses on the development and distribution of three-dimensional (3D) holographic interactive video displays primarily for advertising and product merchandising markets. The company's products include HoloVision displays and 3D Savings Center kiosks that offer advertisers and customers to reach captive audience in grocery stores, malls, convenience stores, gas stations, banks, and other retail locations. Its HoloVision displays are also used in education, medical, entertainment, and consumer applications. Provision Holding, Inc. has a strategic alliance agreement with Coinstar, LLC to develop and integrate HoloVision display systems into Coinstar's kiosks. The company is headquartered in Chatsworth, California.",
        "currency": "USD",
        "sector": "Services",
        "industry": "Marketing Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Chatsworth"
    },
    "SLTZ": {
        "short_name": "SOLAR THIN FILMS INC",
        "long_name": "Solar Thin Films, Inc.",
        "summary": "Solar Thin Films, Inc. designs, develops, manufactures, and installs thin-film amorphous silicon photovoltaic manufacturing equipment used in plants that produce photovoltaic thin-film a-Si solar panels or modules. The company serves businesses and investment partnerships engaged in the production of photovoltaic thin-film modules; and corporations and governments involved in the construction of solar power plants principally in the United States, Europe, Russia, Ukraine, and Asia. Solar Thin Films, Inc. was founded in 1993 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Services",
        "industry": "Industrial Equipment Wholesale",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "TPNI": {
        "short_name": "PULSE NETWORK INC",
        "long_name": "The Pulse Network, Inc.",
        "summary": "The Pulse Network, Inc. provides a cloud-based platform that focuses on content marketing and event solutions in the United States. It operates a cloud-based content marketing platform, which enables corporate marketers and event groups in their campaign efforts. The company's platform includes Content Marketing Platform that provides newsletters for outreach and engagement; Digital Publication Platform Creator, which develops digital publications; Video Webcast Production Platform that engages the audience with live video production, and enhances participation with live polls and chats; and Event Management Platform, which creates interactive customer experiences through registration and online engagement. Its platform also enhances registration counts through engagement and social sharing, and verification counts through connecting with the audience. In addition, the company offers ICTG platform, a marketing and follow up automation software; event management solution, an end-to-end tool for event groups worldwide; and HostMyLeads.com for lead management, as well as event technology, registration, lead generation, Web, and lead management program services for businesses, event organizers, and associations to engage with their community across channels, such as online, mobile, or face to face. Further, it provides Event Database Solutions comprising a multi-channel software-as-a-service platform for marketing support, registration, housing, management reporting, lead retrieval, online production, event Websites, and continuing education unit tracking, as well as services for marketing and event management. Additionally, the company offers content marketing tools that include syndication and distribution, social sharing, newsletter creation, analytics and reporting, prospect management, and other tools, as well as a content curation tool, which support the cloud-based platform. The Pulse Network, Inc. was founded in 1994 and is based in Norwood, Massachusetts.",
        "currency": "USD",
        "sector": "Services",
        "industry": "Marketing Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Norwood"
    },
    "YUM.MX": {
        "short_name": "YUM BRANDS INC",
        "long_name": "Yum! Brands, Inc.",
        "summary": "YUM! Brands, Inc., together with its subsidiaries, develops, operates, and franchises quick service restaurants worldwide. It operates in three segments: the KFC Division, the Pizza Hut Division, and the Taco Bell Division. The company operates restaurants under the KFC, Pizza Hut, and Taco Bell brands, which specialize in chicken, pizza, and Mexican-style food categories. As of December 31, 2018, it had 22,621 KFC units; 18,431 Pizza Hut units; and 7,072 Taco Bell units in approximately 140 countries and territories. The company was formerly known as TRICON Global Restaurants, Inc. and changed its name to YUM! Brands, Inc. in May 2002. YUM! Brands, Inc. was incorporated in 1997 and is headquartered in Louisville, Kentucky.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Restaurants",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Louisville"
    }
}