{"DJSP": {"short_name": "DJSP ENTERPRISES INC", "long_name": "DJSP Enterprises, Inc.", "summary": "DJSP Enterprises, Inc. provides processing services for the mortgage and real estate industries in the United States. It engages in offering non-legal services supporting residential real estate foreclosure, other related legal actions, and lender owned real estate (REO) services in the United States. The company involves in providing non-legal support in connection with residential foreclosures, bankruptcy, complex litigation, evictions, and the sale of REO properties by foreclosing lenders. It also prepares drafts of pleadings and documentation for legal matters. In addition, the company provides REO related services, including property inspection, valuation, broker assignments, and closings of purchases. Further, it performs title searches and examinations related to legal services; and assists in the location of defendants in foreclosure proceedings to enable service of legal process. The company serves to mortgage servicers in the United States. DJSP Enterprises, Inc. was formerly known as Chardan 2008 China Acquisition Corp. and changed its name to DJSP Enterprises, Inc. in January 2010. The company was founded in 1994 and is based in Plantation, Florida with additional operations in Louisville, Kentucky; and San Juan, Puerto Rico.", "currency": "USD", "sector": "Services", "industry": "Business Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Plantation"}, "DRSV": {"short_name": "DEBT RESOLVE INC", "long_name": "Debt Resolve, Inc.", "summary": "Debt Resolve, Inc. provides software solutions to consumer lenders or those collecting consumer loans using Software-as-a-Service model in the United States. Its solutions facilitate Web-based payments or the resolution of delinquent or defaulted consumer debt. The company also provides services in the student loan document preparation industry. It serves consumer banks, collection agencies, and the buyers of defaulted debt. The company was formerly known as Lombardia Acquisition Corp. and changed its name to Debt Resolve, Inc. in May 2003. Debt Resolve, Inc. was founded in 1997 and is based in Hawthorne, New York. On July 29, 2020, the voluntary petition of Debt Resolve, Inc. for reorganization under Chapter 11 was converted to Chapter 7. It had filed for Chapter 11 bankruptcy on February 3, 2020.", "currency": "USD", "sector": "Services", "industry": "Business Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Hawthorne"}, "FUEG": {"short_name": "FACE UP ENTERTAINMENT GROUP INC", "long_name": "Face Up Entertainment Group, Inc.", "summary": "Face Up Entertainment Group, Inc., a development stage company, focuses on the development of Internet reality gaming social network. The company operates FaceUpGaming.com, a non-wagering internet poker Website, which provides users with streaming video, audio, and messaging capabilities. It has a strategic partnership with Texas Hold'em Poker Tours. The company was formerly known as Game Face Gaming, Inc. and changed its name to Face Up Entertainment Group, Inc. in April 2012. Face Up Entertainment Group, Inc. was founded in 2009 and is based in Valley Stream, New York.", "currency": "USD", "sector": "Services", "industry": "Business Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Valley Stream"}, "ITEC": {"short_name": "INTERTECH SOLUTIONS INC", "long_name": "Intertech Solutions , Inc.", "summary": "Intertech Solutions , Inc. operates as gold project finance, management, and services consulting company in Arizona. The company provides development capital, engineering, project supervision, and technical management services to gold projects. It has a gold stream agreement with West Port Gold for the West Port Gold project in Arizona. The company was formerly known as Amwest Imaging Incorporated and changed its name to Intertech Solutions , Inc. in July 2013. Intertech Solutions, Inc. was founded in 2010 and is based in Scottsdale, Arizona.", "currency": "USD", "sector": "Services", "industry": "Business Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Scottsdale"}, "PGOG": {"short_name": "PERF GO GREEN HOLDINGS INC", "long_name": "Perf Go Green Holdings, Inc.", "summary": "Perf Go Green Holdings, Inc. operates as a biodegradable plastics company in the United States and Canada. It focuses on the development and marketing of eco-friendly, non-toxic, food contact compliant, biodegradable plastic products. The company's biodegradable plastic products offer a practical and viable solution for reducing plastic waste from the environment. Its products include biodegradable trash bags, biodegradable plastic drop cloths, Biodegradable Doggie Duty Bags and Cat Pan Liners, PerfPower alkaline batteries, and Perf Go Clean cleaning products. Perf Go Green Holdings, Inc. is based in New York, New York.", "currency": "USD", "sector": "Services", "industry": "Business Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "New York"}}