{
    "RICH.BA": {
        "short_name": "LAB RICHMOND",
        "long_name": "Laboratorios Richmond S.A.C.I.F.",
        "summary": "Laboratorios Richmond S.A.C.I.F., a pharmaceutical company, develops and manufactures pharmaceutical products. It provides antivirals for the treatment of HIV and HCV; oncology and oncohematology drugs; cardiometabolic drugs, including antihypertensive, cholesterol-lowering, and anti platelet drugs; and psychiatric drugs comprising analgesic, anti psychotic, anti depressive, anti dementia, and hypnotic drugs, as well as drugs for the treatment of multiple sclerosis. The company sells its products in Latin America, Africa, Asia, and the Middle East. Laboratorios Richmond S.A.C.I.F. was founded in 1935 and is based in Buenos Aires, Argentina.",
        "currency": "ARS",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "Argentina",
        "city": "Buenos Aires"
    },
    "ROSE.BA": {
        "short_name": "INSTITUTO ROSENBUC",
        "long_name": "Instituto Rosenbusch S.A.",
        "summary": "Instituto Rosenbusch S.A. researches, develops, manufactures, and sells veterinary products in Argentina. The company offers biological products, including products for reproductive-respiratory and nervous complex, IBR, BVD, brucelosis, carbuncle, and other diseases; clostridial vaccines; vaccines for cattle, sheep, goats, horses, and dogs; vaccines for the prevention of reproductive diseases; and products for the prevention of pneumonia and calve diarrhea, and cattle infectious keratoconjunctivitis. It also provides pharmaceutical products, such as external and internal antiparasitics, endectocides, antimicotics-bacteriostatics, injectable antibiotics, antimastitics, and other chemotherapics, as well as vitamins and minerals. The company was founded in 1917 and is based in Buenos Aires, Argentina.",
        "currency": "ARS",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "Argentina",
        "city": "Buenos Aires"
    }
}