{
    "000021.SZ": {
        "short_name": "SHENZHEN KAIFA TEC",
        "long_name": "Shenzhen Kaifa Technology Co., Ltd.",
        "summary": "Shenzhen Kaifa Technology Co., Ltd. provides electronics manufacturing services worldwide. The company manufactures computers and storage products, communication products and consumer electronics, semiconductors, medical equipment, automotive electronics, and commercial and industrial products; and provides packaging and testing services for integrated circuits and semiconductors. It also offers research and development, and production services for automation equipment, utility metering systems, and Internet of Things systems. Shenzhen Kaifa Technology Co., Ltd. was founded in 1985 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518035",
        "website": "http://www.kaifa.cn",
        "full_time_employees": null
    },
    "000066.SZ": {
        "short_name": "CHINA GREATWALL TE",
        "long_name": "China Greatwall Technology Group Co., Ltd.",
        "summary": "China Greatwall Technology Group Co., Ltd. provides computer components and consumer digital products in China. It also provides PCs/notebooks, tablets, and all-in-one products; power products, such as PC power supply, server power supply, networking power supply, LED power supply, PC adaptor, and power bank products; and servers. The company offers its products for use in infrastructure and solutions, finance, medical care, transportation, education, and other industries. The company was formerly known as China Great Wall Computer Shenzhen Co., Ltd. and changed its name to China Greatwall Technology Group Co., Ltd. in March 2017. The company was founded in 1987 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.greatwall.cn",
        "full_time_employees": 15410
    },
    "000977.SZ": {
        "short_name": "INSPUR ELECTRONIC",
        "long_name": "Inspur Electronic Information Industry Co., Ltd.",
        "summary": "Inspur Electronic Information Industry Co., Ltd. provides data center and cloud computing solutions worldwide. The company offers rack, multi-node, and rack-scale servers; and artificial intelligence, cloud, SAP HANA platform, and hyperconverged infrastructure solutions. It also provides product and technical support services. The company serves government and enterprise customers. Inspur Electronic Information Industry Co., Ltd. is headquartered in Jinan, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinan",
        "zipcode": null,
        "website": "http://en.inspur.com",
        "full_time_employees": 7131
    },
    "002104.SZ": {
        "short_name": "HENGBAO CO. LTD.",
        "long_name": "Hengbao Co.,Ltd.",
        "summary": "Hengbao Co.,Ltd. provides smart products and solutions in China and internationally. The company offers fiscard, e-bank security, WAP security, payment, and platform solutions for banking industry; mobile communication, platform, and mobile payment solutions for telecommunication industry; and social insurance, residents health card, citizen card, and tax control solutions for government sector. It also provides city I pass, ETC card, and transportation permit solutions for the transportation industry; and enterprise I pass, campus I pass, magnetic cards, and IOT products for various industrial applications. The company was founded in 1996 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100033",
        "website": "http://www.hengbao.com",
        "full_time_employees": null
    },
    "002189.SZ": {
        "short_name": "COSTAR GROUP CO LT",
        "long_name": "Costar Group Co., Ltd.",
        "summary": "Costar Group Co., Ltd. develops, manufactures, sells, and services optical components and parts in China. It provides various shape and special material optical lens; optical prisms for use in light engine for advanced LCDs, DLPs, and LCOS displays, as well as DVD series prisms and dichroic mirrors; and special type components, such as high-precision optical components for large-diameter super-smooth optical plano-surface and super-smooth optical spherical-surface, as well as high-power laser optical components, aspherical, infrared components, coating products, etc. The company also designs and manufactures various lens assembly, projection lens, monitoring lens, fingerprint device lens, fixed focus projection lens, and zoom projection lens; light engines, including DLP, portable LED, minisize LED embedded type, single and three panel LCOS, large type three-DLP, and laser light engines; and optical auxiliary materials. In addition, it provides mechanical parts; photoresistance cells; and single piece or glued optical low pass filter products used in digital cameras, monitoring systems, digital vidicon, etc. Costar Group Co., Ltd. exports its products to Japan, the United States, Germany, South Korea, Hong Kong, and Taiwan. The company was formerly known as Lida Optical and Electronic Co., Ltd. and changed its name to Costar Group Co., Ltd. in 2019. Costar Group Co., Ltd. was founded in 1995 and is based in Nanyang, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanyang",
        "zipcode": null,
        "website": "http://www.cccme.org.cn",
        "full_time_employees": 3327
    },
    "002415.SZ": {
        "short_name": "HANGZHOU HIKVISION",
        "long_name": "Hangzhou Hikvision Digital Technology Co., Ltd.",
        "summary": "Hangzhou Hikvision Digital Technology Co., Ltd. provides video-centered intelligent Internet of Things solutions and big data services worldwide. The company offers network cameras, PTZ cameras, explosion-proof and anti-corrosion series products, network video recorders, data center and storage products, and power-over-Ethernet and Wi-Fi kits; and turbo HD cameras, DVRs, PTZ cameras, and portable products. It also provides transmission products, including network switches, cables, and wireless bridges; display and control products, which include digital signages, interactive tablets, monitors, LCD video walls and displays, and controllers; and intelligent traffic products that include signal control and traffic flow systems, smart surveillance and AID systems, entrance and exit management products, checkpoint and intersection violation systems, and parking guidance products. In addition, the company offers access control products comprising face recognition and card terminals, controllers, turnstiles, fingerprint terminals, readers, electrical locks, and kits; video intercom products, 2-wire, 4-wire, 8-wire, and IP products and doorbells; security, thermography, and common vision thermal cameras; alarm products, including intrusion alarm panel, intrusion detector, emergency alarm, and security radar products; CCTV, access control, mobile, traffic, transmission and display, and video intercom product accessories; and HiLook IP, turbo HD, and transmission products. Further, it provides HikCentral Professional, an integrated security software for video security, access control, intrusion alarm, etc.; HikCentral Enterprise; Hik-Connect mobile app; and Hik-ProConnect, a cloud-based solution. It serves the public security, transportation, retail, education, healthcare, financial institutions, intelligent buildings, and other markets. The company was founded in 2001 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310051",
        "website": "http://www.hikvision.com",
        "full_time_employees": 42685
    },
    "002577.SZ": {
        "short_name": "SHENZHEN RAPOO TEC",
        "long_name": "Shenzhen Rapoo Technology Co., Ltd.",
        "summary": "Shenzhen Rapoo Technology Co., Ltd. manufactures and sells wired and wireless peripheral products worldwide. The company offers wired and wireless mouse and keyboards, wireless audio products, and wired and wireless combo sets. It also provides game peripherals, including game keyboards, mouse, headsets, combos, and mats, as well as gamepads. The company offers its products under the Rapoo brand. The company was founded in 2002 and is based in Shenzhen, China. Shenzhen Rapoo Technology Co., Ltd. is a subsidiary of MLK Electronics Limited.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518048",
        "website": "http://www.rapoo.com",
        "full_time_employees": 167
    },
    "002635.SZ": {
        "short_name": "SUZHOU ANJIE TECHN",
        "long_name": "Suzhou Anjie Technology Co., Ltd.",
        "summary": "Suzhou Anjie Technology Co., Ltd. supplies internal and external functional components for the consumer electronics industry in China and internationally. Its principal products include tapes, insulation products, buffering products, EMI products, shading tapes, thermal products, conductive products, optical films, touch panels, cover glasses, precision metal parts, etc. The company also provides die-cut products, non-metal printing and CNC products, 3D processing products, optical glass products, precise metal stampings, and energy batteries. It offers its products for smartphones, tablets, laptops, AR/VR, smart home applications, etc. The company was founded in 1999 and is headquartered in Suzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215159",
        "website": "http://www.anjiesz.com",
        "full_time_employees": 5723
    },
    "002751.SZ": {
        "short_name": "SHENZHEN ESUN DISP",
        "long_name": "Shenzhen ESUN Display Co.,Ltd",
        "summary": "Shenzhen ESUN Display Co.,Ltd engages in the brand terminal exhibition, low carbon cycle exhibition, 3D printing, and virtual reality businesses in China. The company offers brand strategic planning, brand prototype design, brand profile promotion, and business chain terminal research and development services. It also provides 3D printing fundamental research services in 3D maker education, antique 3D digital protection, and Internet e-commerce 3D display fields; and human body, fluid antique 3D, 3D desktop, and face recognition 3D scanners. The company was founded in 2004 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.es-display.com",
        "full_time_employees": 666
    },
    "2028.HK": {
        "short_name": "JOLIMARK",
        "long_name": "Jolimark Holdings Limited",
        "summary": "Jolimark Holdings Limited, an investment holding company, manufactures and sells printers and other electronic products in the People's Republic of China and internationally. The company offers rolling and flatbed dot matrix printers, passbook printers, thermal and dot matrix POS solutions, mini printers, tax control ECRs, DLP projectors, and other electronic products under the Jolimark brand name. It also designs, manufactures, and sells business equipment, tax control equipment, and other electronic products on EMS/ODM/OEM basis. In addition, the company is involved in the distribution of EPSON branded SIDM printers; research and development of the inkjet print heads and Internet of Things; and provision of import and export service for electronic business. Further, it operates as a logistics agent. The company was incorporated in 2004 and is headquartered in Jiangmen, the People's Republic of China. Jolimark Holdings Limited is a subsidiary of Kytronics Holdings Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Jiangmen",
        "zipcode": "529141",
        "website": "http://www.jolimark.com",
        "full_time_employees": 858
    },
    "2308.HK": {
        "short_name": "EVOC",
        "long_name": "EVOC Intelligent Technology Company Limited",
        "summary": "EVOC Intelligent Technology Company Limited, together with its subsidiaries, engages in the research, development, manufacture, and distribution of special computer products primarily in the People's Republic of China. It operates in two segments, Special Computer Products, and Electronic Products and Accessories; and Property Development. The company offers embedded single board computers (SBCs), including CPU boards, compact modules, micro-ATX SBCs, mini-ITX SBCs, and other SBCs; industrial automation products, such as panel personal computers (PCs) and fanless box PCs; and portable workstations and rugged laptops. It also provides industrial computers comprising wall mount computers, rackmount computers, industrial motherboards, and EPE/EPI CPU cards/backplanes; and applied PC platforms that include rugged computers, power automation, and transportation systems. In addition, the company offers compact PCIs that include CPCI systems, boards, and peripherals; and network appliances, which comprise industrial servers, network platforms, and network modules. Further, it is involved in assembling and trading electronic products and accessories; and the development of properties. The company's products are used in the telecommunication, industrial, military, electricity generation, video frequency control, transportation, Internet, commerce, and finance industries. It sells its products to authorized distribution agents, system integrators, construction and building surveillance agents, software developers, and IT manufacturers. The company was founded in 1993 and is headquartered in Shenzhen, the People's Republic of China. EVOC Intelligent Technology Company Limited is a subsidiary of EVOC Hi-Tech. Holding Group Co., Ltd.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.evoc.com",
        "full_time_employees": 867
    },
    "300042.SZ": {
        "short_name": "NETAC TECHNOLOGY C",
        "long_name": "Netac Technology Co., Ltd.",
        "summary": "Netac Technology Co., Ltd. manufactures and sells flash memory products in the People's Republic of China and internationally. It offers USB flash drives, portable HDD and solid state disks, memory cards, and encryption products. The company was founded in 1999 and is based in Shenzhen, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.netac.com",
        "full_time_employees": 443
    },
    "300223.SZ": {
        "short_name": "INGENIC SEMICONDUC",
        "long_name": "Ingenic Semiconductor Co.,Ltd.",
        "summary": "Ingenic Semiconductor Co.,Ltd., a fabless technology company, designs embedded CPU products for mobile and consumer system-on-chip applications in China. The company offers solutions for wearables and consumer devices markets, which cover smart Internet of things, smart videos, smart wearables, and CPU technology products. Its products are used in biometrics, e-education, portable media player, e-reader, and mobile Internet devices. Ingenic Semiconductor Co.,Ltd. was founded in 2005 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100193",
        "website": "http://www.ingenic.cn",
        "full_time_employees": 857
    },
    "300302.SZ": {
        "short_name": "TOYOU FEIJI ELECTR",
        "long_name": "Toyou Feiji Electronics Co., Ltd.",
        "summary": "Toyou Feiji Electronics Co., Ltd. provides data storage infrastructure solutions in China. The company offers flash memory, autonomous and controllable, cloud computing, enterprise and distributed storage, storage network, and data protection products. It also provides video cloud, active storage, and database acceleration solutions. The company serves finance, transportation, medical, education, and energy industries, as well as government, military, industrial, and research institutes. Toyou Feiji Electronics Co., Ltd. was founded in 1988 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.toyou.com.cn",
        "full_time_employees": 347
    },
    "300645.SZ": {
        "short_name": "ZHEJIANG ZHENGYUAN",
        "long_name": "Zhejiang Zhengyuan Zhihui Technology Co.,Ltd.",
        "summary": "Zhejiang Zhengyuan Zhihui Technology Co.,Ltd. provides system construction, operation and maintenance, intelligent management, and control of smart card related services to schools, government, and military police in China. It offers cards, intensive cards, and freestanding card platforms; basic and online education platform in the school; and card application subsystems, operation platforms, payment and self-service terminals, IC card readers, remote identification products, and visitor channels. The company also provides hacking and communication controlling products. In addition, it offers electronic payment, identification, access control, and attendance, as well as energy-saving and smart home products. The company is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.hzsun.com",
        "full_time_employees": null
    },
    "300647.SZ": {
        "short_name": "SHENZHEN FLUENCE T",
        "long_name": "Shenzhen Fluence Technology PLC.",
        "summary": "Shenzhen Fluence Technology PLC. researches and develops, produces, and sells radiators, heat sinks, and LED lights in China and internationally. The company offers LED lighting products, including sports, education, facade, solar, infrastructure, industrial facilities, commercial, and household lightings. It also provides consumer electronics, such as radiators, storage devices, memory products, power supply devices, computer accessories, and cases; and flood light, highbay light, street light, and tunnel light heatsinks. In addition, the company offers heat dissipation systems comprising medical equipment cooling solutions; generating set and transportation solutions; aerospace and military testing equipment; and IDC data center and cloud computing centers. Further, it provides smart city solutions for transportation, humanities scenic spots, education facilities, and other fields. Shenzhen Fluence Technology PLC. was founded in 2005 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518172",
        "website": "http://www.pccooler.cn",
        "full_time_employees": null
    },
    "300787.SZ": {
        "short_name": "ANFU CE LINK LTD",
        "long_name": "Anfu CE LINK Limited",
        "summary": "Anfu CE LINK Limited manufacturers and sells custom-made Cables and accessories for AV, PC, and mobile applications in Mainland China. The company offers a range of cables and adapters, and smart wireless accessories, as well as power related products, including USB power stations power banks travel and car chargers, wireless charging products, and inverters. It also provides AV distribution products, such as HDMI matrix, switcher, splitter, converter, and extender products; HDBaseT and AV/USB extenders; and AV matrix, switcher, splitter/hub, and converter products. The company is based in Ji'an, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ji'an",
        "zipcode": null,
        "website": "http://www.ce-link.com",
        "full_time_employees": 7111
    },
    "3396.HK": {
        "short_name": "LEGENDHOLDING",
        "long_name": "Legend Holdings Corporation",
        "summary": "Legend Holdings Corporation, an diversified investment holding company, together with its subsidiaries, operates in information technology (IT), financial services, innovative consumption and services, agriculture and food, advanced manufacturing and professional services, and financial investments businesses in the People's Republic of China and internationally. The company's IT segment develops, manufactures, and markets technology products and services to customers and enterprises. Its Financial Services segment offers banking, short-term financing, financial leasing, insurance brokerage, third party payment, internet finance, property insurance, and other related business services. The company's Innovative Consumption and Services segment provides medical and health services, car rental business, and education services for kids. Its Agriculture and Food segment plants and sells fruit and tea products; produces and sells salmon and Chinese liquor; supplies seafood and accessory products; and operates liquor direct sales chain business. The company's Advanced Manufacturing and Professional Services segment provides chemicals and energy materials production; and logistics, and aviation logistic related business services. Its Financial Investments segment invests in private equity and venture capital funds as a limited partner; holds interest in the general partners of various funds; makes angel investments in technology start-ups, as well as minority investments in other entities; and provides office rental services. The company also develops car management software; provides car services information consultant and medical consultation services; and engages in real estate investment and asset management businesses. In addition, it engages in agriculture and food investment; foods trading activities; and offers other animal protein-related products. The company was incorporated in 1984 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100190",
        "website": "http://www.legendholdings.com.cn",
        "full_time_employees": 84000
    },
    "600100.SS": {
        "short_name": "TSINGHUA TONGFANG CO. LTD.",
        "long_name": "Tsinghua Tongfang Co., Ltd.",
        "summary": "Tsinghua Tongfang Co., Ltd. operates as an information and security company. It offers electronic information products, smart city, Internet services, public safety, industrial equipment, illumination, energy conservation and environmental protection, lighting, medical treatment and health, and financial and insurance services and solutions, as well as production, research, and development services. Tsinghua Tongfang Co., Ltd. was founded in 1997 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100083",
        "website": "http://www.thtf.com.cn",
        "full_time_employees": 12556
    },
    "600122.SS": {
        "short_name": "JIANGSU HONGTU HIGH TECHNOLOGY ",
        "long_name": "Jiangsu Hongtu High Technology Co., Ltd.",
        "summary": "Jiangsu Hongtu High Technology Co., Ltd. primarily engages in retail, electronics manufacturing, Internet finance, and real estate development activities in the People's Republic of China. The company retails computers, telecommunications, smart living, digital products, DIY computer assembly and IT accessories, various products and accessories, various external devices, network and server equipment, office automation and supplies and other accessory products, software products and IT books, service products, etc. It also offers various services and support, including on-site maintenance, system installation and commissioning, application guidance, technical maintenance, after-sale services, etc. In addition, the company researches, develops, produces, and sells various optical communication products, such as fiber optic and power cables, communication cables, power carrier equipment, optical fiber access equipment, distribution automation and smart instrumentation systems, video surveillance systems, communication power supply systems, and program-controlled switching equipment, as well as manufactures communications equipment, optical cable, consumer electronics, computers, and printers. Further, it develops and operates residential and commercial office buildings. Additionally, the company engages in the processing of copper. Jiangsu Hongtu High Technology Co., Ltd. is based in Nanjing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "210012",
        "website": "http://www.hiteker.com.cn",
        "full_time_employees": null
    },
    "600734.SS": {
        "short_name": "FUJIAN START GROUP CO LTD",
        "long_name": "Fujian Start Group Co.Ltd",
        "summary": "Fujian Start Group Co.Ltd provides anti-intrusion detection system services and solutions in China. The company also offers integrated management platform that integrates daily business systems and security systems, such as video analytics, access control system, family telephone and interview system, digital broadcasting system, intercom system, emergency alarm system, and large-screen control systems; image enhancement solutions; intelligent data services; and wisdom judiciary systems. In addition, it provides financial POS machines, mobile payment terminals, and mobile intelligent hardware products. The company was formerly known as Fujian Start Computer Group Co.,Ltd. and changed its name to Fujian Start Group Co.Ltd in July 2009. Fujian Start Group Co.Ltd was founded in 1988 and is based in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": "350002",
        "website": "http://www.start.com.cn",
        "full_time_employees": 1619
    },
    "603019.SS": {
        "short_name": "DAWNING INFORMATION INDUSTRY CO",
        "long_name": "Dawning Information Industry Co., Ltd.",
        "summary": "Dawning Information Industry Co., Ltd. provides high-performance computing, server, storage, cloud computing, and big data products in China and internationally. It offers rack, storage, and blade servers, as well as high-density servers; workstation products; disk array and cloud storage products; server cabinets and cooling solutions; high-performance computers; and cloud computing products. The company was founded in 1996 and is based in Beijing, China. Dawning Information Industry Co., Ltd. is a subsidiary of Landsea Green Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100193",
        "website": "http://www.sugon.com",
        "full_time_employees": 3332
    },
    "603933.SS": {
        "short_name": "FUJIAN RAYNEN TECHNOLOGY CO LTD",
        "long_name": "Fujian Raynen Technology Co., Ltd.",
        "summary": "Fujian Raynen Technology Co., Ltd. engages in the distribution of IC products in China. The company also researches, develops, produces, and sells computer control systems for knitting machines and textile servo drivers. Its products include flat knitting machine computer control systems, vamp flat knitting machine computer control systems, operation boxes, main controllers, take-down comb controllers, carriage controllers, and integrated power supply products; and single-axis and digital dual-axis servo drivers. In addition, the company is involved in various activities, including application software development for knitting industry, industrial electrical automation products distribution, system integration, etc. Fujian Raynen Technology Co., Ltd. was formerly known as Fujian Raynen Electronics Co., Ltd. and changed its name to Fujian Raynen Technology Co., Ltd. in 2013. The company was founded in 2007 and is headquartered in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": null,
        "website": "http://www.raynen.cn",
        "full_time_employees": 646
    },
    "688086.SS": {
        "short_name": "AMETHYSTUM STORAGE TECHNOLOGY C",
        "long_name": "Amethystum Storage Technology Co., Ltd",
        "summary": "Amethystum Storage Technology Co., Ltd engages in the research and development, design, production, sale, and service of optical storage media and equipment, and intelligent data hierarchical storage and information technology solutions in China. The company offers data storage and security products, as well as AmeCloud, a enterprise cloud storage solution. Its products and services are applied in government administration, health care, and archives industries to facilitate the national strategies for the big data development and information security. The company was founded in 2010 and is headquartered in Meizhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Meizhou",
        "zipcode": null,
        "website": "http://www.amethystum.com",
        "full_time_employees": 326
    },
    "6939.HK": {
        "short_name": "MEGAIN",
        "long_name": "MEGAIN Holding (Cayman) Co., Ltd.",
        "summary": "MEGAIN Holding (Cayman) Co., Ltd. engages in the research, design, development, and sale of compatible cartridge chips. The company was incorporated in 2016 and is based in Zhuhai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Zhuhai",
        "zipcode": "519000",
        "website": "http://www.megaincayman.com",
        "full_time_employees": null
    },
    "7EB.F": {
        "short_name": "EBANG INTL HLDGS  HD-,001",
        "long_name": "Ebang International Holdings Inc.",
        "summary": "Ebang International Holdings Inc., through its subsidiaries, engages in the research, design, and development of application-specific integrated circuit chips and manufacture of Bitcoin mining machines in China, the United States, Hong Kong, and internationally. It also provides mining machine hosting services that enable customers to operate mining machines remotely, as well as offers routine maintenance services. In addition, the company engages in the research, development, manufacture, and sale of fiber optical telecommunication products, including PDH fiber optical multiplexers, E+E fiber optical multiplexers, 1+1 dual fiber interface back-up fiber optical multiplexers, voice fiber optical multiplexers, date video fiber optical multiplexers, fiber modems, protocol converters, optical fiber transceivers, timeslot multiplexers, PAS repeaters, and others, as well as transmission network and converged communication products. Further, it offers enterprise convergent terminal products, including gigabit passive optical network, enterprise cloud gateway devices, industrial Internet of Things access devices, and business enterprise smart wireless access devices. The company offers Bitcoin mining machines under the Ebit brand. It serves blockchain and telecommunications industries. The company sells its blockchain products directly, as well as through its website; and telecommunication products under the EBANG brand name primarily through supplier contracts. Ebang International Holdings Inc. was incorporated in 2018 and is headquartered in Hangzhou, China.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "311100",
        "website": "http://www.ebang.com.cn",
        "full_time_employees": 205
    },
    "CAN": {
        "short_name": "Canaan Inc.",
        "long_name": "Canaan Inc.",
        "summary": "Canaan Inc. engages in the research, design, and sale of integrated circuit (IC) final system products by integrating IC products for bitcoin mining and related components primarily in the People's Republic of China. It is also involved in the assembly of system products; and supply chain and distribution of system products. The company has a strategic cooperation with Northern Data AG in the areas of artificial intelligence development, blockchain technology, and datacenter operations. The company was founded in 2013 and is based in Hangzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100193",
        "website": "http://canaan-creative.com",
        "full_time_employees": 248
    },
    "EBON": {
        "short_name": "Ebang International Holdings In",
        "long_name": "Ebang International Holdings Inc.",
        "summary": "Ebang International Holdings Inc., through its subsidiaries, engages in the research, design, and development of application-specific integrated circuit chips and manufacture of Bitcoin mining machines in China, the United States, Hong Kong, and internationally. It also provides mining machine hosting services that enable customers to operate mining machines remotely, as well as offers routine maintenance services. In addition, the company engages in the research, development, manufacture, and sale of fiber optical telecommunication products, including PDH fiber optical multiplexers, E+E fiber optical multiplexers, 1+1 dual fiber interface back-up fiber optical multiplexers, voice fiber optical multiplexers, date video fiber optical multiplexers, fiber modems, protocol converters, optical fiber transceivers, timeslot multiplexers, PAS repeaters, and others, as well as transmission network and converged communication products. Further, it offers enterprise convergent terminal products, including gigabit passive optical network, enterprise cloud gateway devices, industrial Internet of Things access devices, and business enterprise smart wireless access devices. The company offers Bitcoin mining machines under the Ebit brand. It serves blockchain and telecommunications industries. The company sells its blockchain products directly, as well as through its website; and telecommunication products under the EBANG brand name primarily through supplier contracts. Ebang International Holdings Inc. was incorporated in 2018 and is headquartered in Hangzhou, China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "311100",
        "website": "http://www.ebang.com.cn",
        "full_time_employees": null
    },
    "ECRP": {
        "short_name": "CHEE CORP",
        "long_name": "Chee Corp.",
        "summary": "Chee Corp. operates in the 3D printing industry in China. The company provides 3D modeling and 3D print services to various items and accessories. Its products include design figure, badges, table plates, magnets, cups, etc. The company was founded in 2016 and is based in Qingdao, China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Qingdao",
        "zipcode": "266000",
        "website": "http://www.corpchee.com",
        "full_time_employees": null
    }
}