{
    "SBAY": {
        "short_name": "SUBAYE INC",
        "long_name": "Subaye, Inc.",
        "summary": "Subaye, Inc. provides online business services in the People's Republic of China. The company offers bundled cloud product that uses Internet-based computing, storage, and connectivity technology to deliver various services to small-to-medium sized enterprises. It markets its products through direct sales and third party agencies. The company was formerly known as MyStarU.com, Inc. and changed its name to Subaye, Inc. in October 2009. Subaye, Inc. was founded in 1997 and is based in Guangzhou, China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Internet Information Providers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "SINAN.MX": {
        "short_name": "SINA CORPORATION (CAY)",
        "long_name": "SINA Corporation",
        "summary": "SINA Corporation, together with its subsidiaries, operates as an online media company in the People's Republic of China and internationally. The company operates SINA.com, an online media property that provides region-focused format and content, including feeds from news providers; business news coverage and personal finance columns; sporting events information; entertainment news and events; automobile-related news and service information; technology updates; interactive video products, such as news, sports, and entertainment; and education, digital, fashion, luxury, health, collectibles, travel, and other interest-based channels. It also offers SINA mobile, a mobile portal, which provides news information and entertainment content from SINA.com for mobile users in mobile browser and application format. In addition, it operates Weibo.com that offers discovery products to help users discover content; self-expression products to enable users to express themselves on Weibo platform; social products to promote social interaction between users on Weibo platform; advertising and marketing solutions; and tools and services. Further, the company offers online loan facilitation and payment, VIP membership, live streaming, and game-related services. SINA Corporation was founded in 1993 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Internet Information Providers",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "China",
        "city": "Beijing"
    },
    "TCEHYN.MX": {
        "short_name": "TENCENT HOLDINGS LIMITED",
        "long_name": "Tencent Holdings Limited",
        "summary": "Tencent Holdings Limited, an investment holding company, provides value-added services (VAS) and Internet advertising services in Mainland China, the United States, Europe, and internationally. The company operates through VAS, FinTech and Business Services, Online Advertising, and Others segments. It offers online games and social network services; FinTech and cloud services; and online advertising services, such as media, social, and others advertisement services. The company is also involved in production, investment, and distribution of films and television programs for third parties, as well as copyrights licensing, merchandise sales, and other activities. In addition, it develops software; develops and operates online games; and provides information technology, information system integration, asset management, online literature, and online music entertainment services. The company was founded in 1998 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Internet Information Providers",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "WBN.MX": {
        "short_name": "WEIBO CORPORATION",
        "long_name": "Weibo Corporation",
        "summary": "Weibo Corporation, through its subsidiaries, operates as a social media platform for people to create, distribute, and discover content in the People's Republic of China. It operates in two segments, Advertising and Marketing Services; and Value-Added Services. The company offers discovery products to help users discover content on its platform; self-expression products that enable its users to express themselves on its platform; and social products to promote social interaction between users on its platform. It also provides advertising and marketing solutions, such as social display advertisements; and promoted feeds, such as Super FST, Fans Headline, and Weibo Express, promoted accounts, and promoted trends and search products that enable its customers to promote their brands and conduct marketing activities. In addition, the company offers copyright content, such as TV channels, online video websites, and operators with copyright content through traffic resource exchange and content traffic sharing; MCNs and other self-media to manage and provide services to content creators on Weibo, such as MCNs, unions, and e-commerce partners; other app developers an application platform, which allows users to log into third-party applications; and Weibo Wallet product consists of red envelops and coupons that enables platform partners to conduct interest generation activities on Weibo. The company was formerly known as T.CN Corporation and changed its name to Weibo Corporation in 2012. The company was founded in 2009 and is headquartered in Beijing, China. Weibo Corporation is a subsidiary of Sina Corporation.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Internet Information Providers",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "China",
        "city": "Beijing"
    }
}