{
    "SBAY": {
        "short_name": "SUBAYE INC",
        "long_name": "Subaye, Inc.",
        "summary": "Subaye, Inc. provides online business services in the People's Republic of China. The company offers bundled cloud product that uses Internet-based computing, storage, and connectivity technology to deliver various services to small-to-medium sized enterprises. It markets its products through direct sales and third party agencies. The company was formerly known as MyStarU.com, Inc. and changed its name to Subaye, Inc. in October 2009. Subaye, Inc. was founded in 1997 and is based in Guangzhou, China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Internet Information Providers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510006",
        "website": "http://www.mystaru.com",
        "market_cap": 46850
    },
    "TCEHYN.MX": {
        "short_name": "TENCENT HOLDINGS LIMITED",
        "long_name": "Tencent Holdings Limited",
        "summary": "Tencent Holdings Limited, an investment holding company, provides value-added services (VAS) and Online advertising services in Mainland China and internationally. The company operates through VAS, Online Advertising, FinTech and Business Services, and Others segments. It offers online games and social network services; FinTech and cloud services, and online advertising services, such as media, social, and others advertisement services. The company is also involved in production, investment, and distribution of films and television programs for third parties, as well as copyrights licensing, merchandise sales, and other activities. In addition, it develops software; develops and operates online games; and provides information technology, information system integration, asset management, online literature, and online music entertainment services. Tencent Holdings Limited company was founded in 1998 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Internet Information Providers",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518054",
        "website": "http://www.tencent.com",
        "market_cap": 14598586499072
    },
    "WBN.MX": {
        "short_name": "WEIBO CORPORATION",
        "long_name": "Weibo Corporation",
        "summary": "Weibo Corporation, through its subsidiaries, operates as a social media platform for people to create, distribute, and discover content in the People's Republic of China. It operates in two segments, Advertising and Marketing Services; and Value-Added Services. The company offers discovery products to help users discover content on its platform; self-expression products that enable its users to express themselves on its platform; and social products to promote social interaction between users on its platform. It also provides advertising and marketing solutions, such as social display advertisements; and promoted marketing offerings, such as Fans Headline and Weibo Express, as well as promoted trends and search products that appear alongside user's trends discovery and search behaviors. In addition, the company offers products, such as trends, search, video/live streaming, and editing tools; content customization, copyright contents pooling, and user interaction development; and search list recommendation, trends list recommendation, and Weibo app opening advertisements for copyright content providers. Further, it provides back-end management, traffic support, and product solutions to MCNs, unions, and e-commerce partners; open application platform for other app developers that allows users to log into third-party applications with their Weibo account for sharing third-party content on its platform; and Weibo Wallet, a product that enables platform partners to conduct interest generation activities on Weibo, such as handing out red envelops and coupons. The company was formerly known as T.CN Corporation and changed its name to Weibo Corporation in 2012. The company was founded in 2009 and is headquartered in Beijing, China. Weibo Corporation is a subsidiary of Sina Corporation.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Internet Information Providers",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100027",
        "website": "http://ir.weibo.com",
        "market_cap": 9528647680
    }
}