{
  "002151.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Beijing BDStar Navigation Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "BEIJING BDSTAR NAV",
    "state": null,
    "summary": "Beijing BDStar Navigation Co., Ltd. provides satellite navigation, and positioning products and services worldwide. asic products, automotive electronics, special application, and industry applications & operational services. The company provides high precision and navigation products, such as GNSS SoC chips, modules, and boards; GNSS antennas, including survey, choke ring, aviation, Helix/UAV, beacon, smart, and OEM antennas, as well as H-RTK GNSS modules; and wireless data links comprising OEM modems, external radios, and accessories. It also offers iridium antennas; mobile base station antennas, including regular base station and integrative concealment antennas; and RF passive components comprising low and high temperature co-fired, and microwave dielectric ceramics; and soft magnetism ferrite materials. In addition, the company provides passive, active, monopole/dipole, and special antennas; GNSS, CATV, Bluetooth, and WIFI modules; and ceramic substrates comprising LTCC, HTCC, and composite substrates. Further, it offers automotive electronic products, such as infotainment system, reconfigurable instrument cluster, heads-up display, and T-BOX; and automotive engineering services, including automotive electronics testing and verification engineering, and software development services, as well as services for driving assistance, infotainment, and related systems. The company's products are used in various applications, such as measuring, mapping, mechanical control, vehicle monitoring, automotive electronics, precision agriculture, aero logical sounding, precision timing, etc. Beijing BDStar Navigation Co., Ltd. was founded in 2000 and is headquartered in Beijing, China.",
    "website": "http://www.bdstar.com",
    "zipcode": null
  },
  "002338.SZ": {
    "city": "Changchun",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Changchun UP Optotech Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "CHANGCHUN UP OPTOT",
    "state": null,
    "summary": "Changchun UP Optotech Co.,Ltd. engages in the research and development, manufacture, and sale of photoelectric measurement and control equipment, optical materials, and other products in China. Its principal products include TV goniometers, antenna pedestals, photoelectric theodolite optical and mechanical subsystems, aviation/aerospace camera optical and mechanical subsystems, radar antenna pedestals, medical testing instruments, K9 optical glasses, etc. The company was founded in 2001 and is based in Changchun, China.",
    "website": "http://www.up-china.com",
    "zipcode": null
  },
  "002380.SZ": {
    "city": "Nanjing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Nanjing Sciyon Wisdom Technology Group Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "NANJING SCIYON WIS",
    "state": null,
    "summary": "Nanjing Sciyon Wisdom Technology Group Co., Ltd. researches, develops, produces, and sells industrial automation and informatization products and solutions in China and internationally. The company offers smart control products, such as smart management systems, intelligent safety production management systems, equipment monitoring and accident prediction systems, intelligent maintenance and training systems, intelligent simulation and training systems, manufacturing execution systems, and intelligent manufacturing information systems, as well as smart control center products. It also provides intelligent control products, such as distributed control, digital electro-hydraulic control, failure safe control, intelligent combustion optimization, intelligent ammonia injection zone control, equipment fault diagnosis and early warning, and intelligent operation optimization systems, as well as touch screens, universal/marine turbine controllers, and integrated/medium-scale programmable controllers. In addition, the company offers smart devices comprising intelligent electric actuators, personnel positioning system, condenser online cleaning robots, boiler furnace parameter measurement systems, warehouse empty preheaters, ranging cable systems, air powder parameter measurement, combustion system parameter detection, and optimization control, smart inverters, and AC servo drives. Further, it provides training and other support services. Nanjing Sciyon Wisdom Technology Group Co., Ltd. was founded in 1993 and is based in Nanjing, China.",
    "website": "http://www.sciyon.com",
    "zipcode": "211102"
  },
  "002383.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Beijing Unistrong Science & Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "BEIJING UNISTRONG",
    "state": null,
    "summary": "Beijing UniStrong Science & Technology Co., Ltd. designs and manufactures high-precision products and services for the geospatial marketplace worldwide. It offers a range of solutions for various fields of applications and industries, such as building and construction, land survey and cadastral survey, geographic information systems (GIS) data collection, 3D scanning, agriculture and smart farming, and land and structure monitoring. The company provides its products and services for original equipment/design manufacturer, machine control and guidance, survey and mapping, GIS, L-band correction services, marine, field mobile worker, monitoring, and unmanned systems markets. Beijing UniStrong Science & Technology Co., Ltd. was founded in 1994 and is based in Beijing, China.",
    "website": "http://www.unistrong.com",
    "zipcode": "100176"
  },
  "002413.SZ": {
    "city": "Changzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Jiangsu Leike Defense Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "JIANGSU LEIKE DEFE",
    "state": null,
    "summary": "Jiangsu Leike Defense Technology Co., Ltd. operates as a civil-military integration enterprise that researches, develops, produces, and sells radar systems, remote sensing, satellite navigation, digital systems, analog simulation, and security storage for space, aviation, and ground industries. It offers wall probing radar, Mini-SAR, the millimeter-wave radar, the phased array radar, and the slope stability radar used in national defense, public security, frontier defense, geological disaster monitoring, regional protection, and automobile active safety. The company is also involved in processing algorithms of multi-source remote sensing data, and anti-radiation remote sensing data processing SOC chips; and provides real-time onboard, ground raw data, and specialized data processing, as well as system integration services. In addition, it provides baseband processing chips, serialization modules, and complete machines used in general and specialized military equipment, as well as signal acquisition, tracking, observation processing, and PVT solution services. Further, the company offers digital design and simulation, experiment verification, performance evaluation, and operational maintenance in the field of radar systems, satellite navigation, and electronic warfare. Additionally, it provides LNA, BUC, microwave frequency conversion, matrix switch, mediation, spectrum monitoring, automatic detection, frequency domain situation, and equipment status monitoring services; and embedded military-use storage devices, secret-related computer storage disks, portable storage devices, and large-scale information storage systems. The company was formerly known as Jiangsu Changfa Refrigeration Co., Ltd. and changed its name to Jiangsu Leike Defense Technology Co., Ltd. in November 2015. Jiangsu Leike Defense Technology Co., Ltd. was founded in 2002 and is based in Changzhou, China.",
    "website": "http://www.racodf.com",
    "zipcode": null
  },
  "002414.SZ": {
    "city": "Wuhan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Wuhan Guide Infrared Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "WUHAN GUIDE INFRAR",
    "state": null,
    "summary": "Wuhan Guide Infrared Co., Ltd. engages in the research and development, production, and sale of infrared thermal imaging systems primarily in Asia. The company offers localization cooled and uncooled IR detectors; system integration cores and modules; law enforcement and temperature measurement systems; personal vision products; and automotive thermal imaging obstacle avoidance systems. Its infrared products are used in various applications, including electric power, metallurgy, petrochemical, construction, firefighting, law enforcement, inspection and quarantine, security and surveillance, ADAS night vision system, and others. The company a strategic cooperation agreement with Foresight Autonomous Holdings Ltd. to develop and market Foresight's QuadSight sensor system combined with guide infrared applications to customers in China. Wuhan Guide Infrared Co., Ltd. was founded in 1999 and is based in Wuhan, the People's Republic of China.",
    "website": "http://www.guide-infrared.com",
    "zipcode": "430205"
  },
  "002609.SZ": {
    "city": "Shenzhen",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Shenzhen Jieshun Science and Technology Industry Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "SHENZHEN JIESHUN S",
    "state": null,
    "summary": "Shenzhen Jieshun Science And Technology Industry Co.,Ltd. researches, develops, manufactures, and sells access control and management systems. The company offers car parking management systems and auto pay stations; ultrasonic parking guidance systems; access controllers, access control readers, and access control spare parts; pedestrian and barrier gate systems; and road blockers, as well as all-in-one card, turnstile with ESD testing, biological recognition, and card retriever solutions. It provides its products under the JSST brand. The company has operations in approximately 100 countries and areas worldwide. Shenzhen Jieshun Science And Technology Industry Co.,Ltd. was founded in 1992 and is based in Shenzhen, China.",
    "website": "http://www.jieshun.cn",
    "zipcode": null
  },
  "002658.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Beijing SDL Technology Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "BEIJING SDL TECHNO",
    "state": null,
    "summary": "Beijing SDL Technology Co.,Ltd. develops and sells environmental monitoring, environmental information system, and process analysis products in China. The company offers environmental monitoring system products, such as continuous emission, waste incineration, ambient air quality, and online monitoring systems; and process analytics system products, including gas analytics systems. It also provides infrared and explosion-proof gas, paramagnetic oxygen, and thermal conductivity analyzers; moisture and electrochemical oxygen analyzers; and particle concentration analyzers. In addition, the company offers software products. Its products are used in environmental, power, cement, iron and steel, air separation, and petrochemical industries. Beijing SDL Technology Co.,Ltd. was founded in 2001 and is headquartered in Beijing, China.",
    "website": "http://www.chsdl.com",
    "zipcode": "102206"
  },
  "002766.SZ": {
    "city": "Shenzhen",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Shenzhen Soling Industrial Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "SHENZHEN SOLING IN",
    "state": null,
    "summary": "Shenzhen Soling Industrial Co.,Ltd provides car networking hardware and software services. Its products include MWR, HUD, rear-view mirror, ADAS, DVR, back seat infotainment device, TPMS, 360 monitor, telematics, bcaking camera, full LCD cluster, MIFI, t-box, OBD, IVI, and anti-fatigue system. The company offers IVI systems for passenger car infotainment systems and commercial vehicle products; and tire pressure monitoring systems. It also provides IOV management platform for vehicle data monitoring, fault reminder, location tracking, in-car entertainment, maintenance reminder, location sharing, electric vehicle management, vehicle remote control, collision reminder, real-time detection, car friends group, address book interaction, electric vehicle international and landmark docking, and overall security management. The company offers its products to approximately 30 provinces and cities in China; and approximately 60 countries and regions in Europe, the United States, and Southeast Asia. The company was founded in 1997 and is based in Shenzhen, China.",
    "website": "http://www.szsoling.com",
    "zipcode": null
  },
  "002767.SZ": {
    "city": "Hangzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Hangzhou Innover Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "HANGZHOU INNOVER T",
    "state": null,
    "summary": "Hangzhou Innover Technology Co., Ltd. engages in the research and development, manufacture, and sale of intelligent metering systems for the gas, water, and heat supply industries in China. The company offers multi-layer Internet of Things interactive metering platforms, Internet of Things interactive metering platforms, peer-to-peer interactive metering platforms, and IC card prepaid metering platforms, as well as city gas intelligent metering network charging system solutions. Hangzhou Innover Technology Co., Ltd. was founded in 1991 and is based in Hangzhou, China.",
    "website": "http://www.innover.com.cn",
    "zipcode": "310021"
  },
  "002829.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "BeiJing StarNeto Technology Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "BEIJING STARNETO T",
    "state": null,
    "summary": "Beijing StarNeto Technology Co., Ltd. provides navigation, measurement, and control products in China. The company offers inertial navigation products, such as MEMS and fiber combination products; gyro, satellite positioning, and guided products; attitude measurement products, including tilt sensors and electronic compass; smart driving test products, such as ETS, kao kao, practice and practice solutions, base stations, driving systems, and testable products; and photoelectric pods, photoelectric tracking devices, radar servo turntables, and photoelectric pod control units. It also provides satellite communications solutions, including ship loading, car moving through, portable communication stations, and airborne transmission solutions, as well as system integration services; radar products, such as security systems, wireless communication systems, and miss distance measurement radars; and infrared cameras, meteorological and underwater sound detection products, Netherlands XSENS products, and MTi products. The company serves clients in defense, emergency communications, intelligent transportation, marine mapping, geographic mapping, and other industries. Beijing StarNeto Technology Co., Ltd. was founded in 2005 and is based in Beijing, China.",
    "website": "http://www.starneto.com",
    "zipcode": "100097"
  },
  "002870.SZ": {
    "city": "Zhongshan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Guangdong Senssun Weighing Apparatus Group Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "GUANGDONG SENSSUN",
    "state": null,
    "summary": "Guangdong Senssun Weighing Apparatus Group Ltd. engages in the research and development, production, and sale of medium- to high-end weighing apparatuses for home and commercial use, and health and movement measurement products. It operates through Measuring Devices, Weighing Apparatuses, and Health and Movement Information Measurement Products segments. The company's products include price computing scales, electronic platform scales, digital weighing scales, dial spring scales, weighing indicators, smart personal scales, activity trackers, baby scales, body analyzers, kitchen scales, body fat scales, luggage scales, and health monitor scales. It operates in China, Europe, North America, and Southeast Asia. Guangdong Senssun Weighing Apparatus Group Ltd. sells its products through a network of own stores, electronic channels, and retail chains, as well as direct selling facilities. The company was formerly known as Senssun Weighing Apparatus Co., Ltd. and changed its name to Guangdong Senssun Weighing Apparatus Group Ltd. in January 2008. Guangdong Senssun Weighing Apparatus Group Ltd. was founded in 1999 and is based in Zhongshan, China.",
    "website": "http://www.camry.com.cn",
    "zipcode": "528403"
  },
  "1743.HK": {
    "city": "Wenzhou",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Zhejiang Cangnan Instrument Group Company Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "CANGNAN INST",
    "state": null,
    "summary": "Zhejiang Cangnan Instrument Group Company Limited manufactures and sells gas metering instruments and other related products in People's Republic of China. The company offers gas flowmeters and filters, pressure regulating devices, volume correctors, and flowrate controllers; gas meters, remote wireless diaphragm gas meters, and IC card remote wireless smart controllers; and throttle devices, as well as after sale services. Its products are used in urban gas industry and petroleum systems. The company also exports its products to the United States, Europe, South America, Southeast Asia, and other countries and regions. Zhejiang Cangnan Instrument Group Company Limited was founded in 1977 and is headquartered in Wenzhou, China.",
    "website": "http://www.zjcnyb.com",
    "zipcode": "325800"
  },
  "300007.SZ": {
    "city": "Zhengzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Hanwei Electronics Group Corporation",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "HANWEI ELECTRONICS",
    "state": null,
    "summary": "Hanwei Electronics Group Corporation manufactures and markets gas sensors and instruments in China. It offers carbon monoxide (CO) alarms; gas alarms for CNG, LPG, and CO gas detection; gas shut off valves; vehicle gas alarm systems; and portable gas detectors, including pen type flammable gas detectors, gas leak detectors with feeler poles, single gas detectors, multi-gas detectors, gas sampling pumps, and H2S detectors. The company also provides fixed gas detectors, such as control panels and fixed gas monitors; various alcohol testers and printers; smoke alarms; air purifiers; and water and air quality monitoring equipment. Its products are used in various fields, such as petroleum, chemical, metallurgy, environmental protection, mining, electronics, electricity, pharmaceutical, food, medical health, agriculture, gas, water supply and discharge, heating, municipal engineering, home security and health, public areas, waste gas treatment, sewage treatment, biological sciences, aerospace, military, anti-terrorism, and traffic safety management. The company markets its products in Europe, the Middle East, Southeast Asia, the United States, and South Africa. The company was formerly known as Henan Hanwei Electronics Co., Ltd. and changed its name to Hanwei Electronics Group Corporation in July 2017. Hanwei Electronics Group Corporation was founded in 1998 and is headquartered in Zhengzhou, China.",
    "website": "http://www.hwsensor.com",
    "zipcode": "450001"
  },
  "300036.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "SuperMap Software Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "BEIJING SUPERMAP S",
    "state": null,
    "summary": "SuperMap Software Co., Ltd. develops and provides geographic information system (GIS) software products and services in China and internationally. The company offers Desktop GIS, a desktop computer GIS; Component GIS, a standard communication interface with GIS functionalities and other functionalities used to construct complicated programs; Service GIS, a component GIS operating on the Internet; Cloud GIS, a cloud GIS platform; and Mobile GIS, a positioning GIS system under the support of mobile network. Its solutions include SuperMap Land Information System, a land resource and e-business information platform; SuperMap Public Service System, a Web digital map public service solution; SuperMap Social Economy Statistics System, a GIS solution in statistics industry; and SuperMap Real Estate Information System. The company's solutions also comprise SuperMap Facility Management System, an application platform for facility resource management, as well as facility resource information publication based on Internet; SuperMap Digital Urban Management System for grid management, urban facility management, and event management; SuperMap Municipality GIS, a municipality GIS solution; and SuperMap Integrated Emergency Response Management System. SuperMap Software Co., Ltd. has strategic partnerships with Microsoft, Oracle, Red Hat, HP, EPSON, and Trimble. The company was formerly known as SuperMap Technologies, Inc. and changed its name to SuperMap Software Co., Ltd. in 2008. SuperMap Software Co., Ltd. was founded in 1997 and is based in Beijing, the People's Republic of China.",
    "website": "http://www.supermap.com",
    "zipcode": "100015"
  },
  "300065.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Beijing Highlander Digital Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "BEIJING HIGHLANDER",
    "state": null,
    "summary": "Beijing Highlander Digital Technology Co., Ltd. primarily provides electronic navigation and communications equipment and automation systems for the marine industry. It also offers multi-sensor systems for monitoring maritime and airport activity; and high-end instrumentation and services for the oceanographic and hydrographic sectors. The company's products include ship navigation products, such as radars, electronic chart display information systems, steering and track control systems, voyage data recorders, integrated navigation systems, bridge navigational watch alarm systems, and rudder angle indicators; and sensor systems, including surveillance radar systems, wave measurement radar systems, and oil spill detection systems. In addition, its products comprise vessel monitoring systems and Hi-Cloud connectivity products, as well as ship automation, and oceanology and hydrography products. The company was founded in 2001 and is headquartered in Beijing, China.",
    "website": "http://www.highlander.com.cn",
    "zipcode": "100084"
  },
  "300114.SZ": {
    "city": "Xi'an",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Zhonghang Electronic Measuring Instruments Co., Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "ZHONGHANG ELECTRON",
    "state": null,
    "summary": "Zhonghang Electronic Measuring Instruments Co., Ltd, together with its subsidiaries, develops, manufactures, and sells electronic measuring instruments worldwide. It offers strain gages, strain gage based sensors, weighing indicators and software, testing and measuring systems for the aviation industry, automobile performance and environmental detection systems, automobile driver intelligent training systems, remote networking regulatory network platform, on- board weighing control systems, automatic systems, and precision mechanical and electrical control parts, as well as Internet of Things application, and military and civilian use measurement and control products and system solutions. The company's products also include pressure and torque transducers, digital and customized load cells, miniature sensors, accessories, and weighting pads; transmitters and junction boxes; hair spring; welding robot station miniature; hard and brittle material process; assist manipulator; automatic optic; auto-coating machine for two-component glue; and auto load /unload machine for metal sheet in CNC. The company was formerly known as Zhongyuan Electrical Measuring Instruments Factory and changed its name to Zhonghang Electronic Measuring Instruments Co., Ltd in 2002. Zhonghang Electronic Measuring Instruments Co., Ltd was founded in 1965 and is headquartered in Xi'an, the People's Republic of China.",
    "website": "http://www.zemic.com.cn",
    "zipcode": null
  },
  "300165.SZ": {
    "city": "Kunshan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Jiangsu Skyray Instrument Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "JIANGSU SKYRAY INS",
    "state": null,
    "summary": "Jiangsu Skyray Instrument Co., Ltd. researches, develops, produces, and sells analytical and measuring instruments worldwide. The company primarily offers instruments in spectroscopy and chromatography fields. Its products are used in various applications, including jewelry, electronics, mineral metallurgy, coating thickness, toy safety, petroleum environment, building, food safety, archaeology, medicine, glass, alloy, and refractory. The company is headquartered in Kunshan, China.",
    "website": "http://www.skyray-instrument.com",
    "zipcode": null
  },
  "300183.SZ": {
    "city": "Qingdao",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Qingdao Eastsoft Communication Technology Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "QINGDAO EASTSOFT C",
    "state": null,
    "summary": "Qingdao Eastsoft Communication Technology Co.,Ltd develops and sells power line carrier communication products in China. It provides power line carrier products, such as narrowband high and low, broadband low, and micropower wireless and Bluetooth chips; various series modules and carrier wireless dual modules series; terminal products comprising intelligent centralized controllers, carrier type I and II collectors, and dual mode II type collectors; and carrier radiator, wireless copy controller, handheld debug tablet, and dual mode repeater debugging tools. The company also offers intelligent products that include access control, attendance, consumption, ladder, water, parking, video surveillance, perimeter protection, electronic patrol, background music, information release, linkage, visual intercom, property, intelligent lighting, and remote meter reading management subsystems. In addition, it intelligent products comprises smart curtain system, air conditioning management system, building automation system, street lighting system, visitor management system, book lending system, merchant management system, hotel management system, personnel positioning system, SF6 micro water density monitoring system, transformer temperature online monitoring system, switch cabinet contact and cable temperature measurement system, arrester online monitoring system, and power supply and distribution online monitoring system. Further, it provides court software products, which comprise trial execution, judicial management, and convenience services; and court hardware products, such as trial hosts, dedicated media servers, and scanners. The company was founded in 1993 and is based in Qingdao, China.",
    "website": "http://www.eastsoft.com.cn",
    "zipcode": "266023"
  },
  "300248.SZ": {
    "city": "Zhengzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Newcapec Electronics Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "NEWCAPEC ELECTRONI",
    "state": null,
    "summary": "Newcapec Electronics Co., Ltd. provides smart card applications and solutions in the People's Republic of China. It offers citizen card solutions, public transport solutions, campus one card systems, enterprises one card systems, financial payment solutions, RFID Internet of Things applications, utilities payment systems, and gas management systems. The company also provides electronic payment products, including retail POS terminals, ticket validators, taxi POS, countertop terminals, and kiosks; intelligent recognition products, such as punch clocks, access control readers, access controllers, and electronic door locks; and smart meters comprising prepaid watt-hour meters, prepaid water meters, residential and industrial gas meters, AMR devices, and PLC devices. In addition, it offers RFID devices consisting of E-tags, active RFID readers, UHF desktop card dispensers, UHF remote 4-channel readers, UHF remote integrated readers, Zigbee wireless base stations, and Zigbee modules and routers. The company provides its solutions for smart card applications in cities, schools, colleges, and communities; and other sectors of businesses, including public transportation, sanitation, enterprises, banks, and mobile payment. Newcapec Electronics Co., Ltd. was founded in 2000 and is headquartered in Zhengzhou, the People's Republic of China.",
    "website": "http://www.newcapec.com.cn",
    "zipcode": null
  },
  "300338.SZ": {
    "city": "Changsha",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Kaiyuan Education Technology Group Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "KAIYUAN EDUCATION",
    "state": null,
    "summary": "Kaiyuan Education Technology Group Co., Ltd. manufactures and sells mechanical samplers, sample preparation equipment, and analytical instruments for coal and coke, alternative fuel, food and feed, and environmental applications in the People's Republic of China. It offers calorimeters; and C/H/N elemental, nitrogen/protein, fluorine/chlorine, mercury, sulfur carbon, infrared sulfur, proximate, volatile matter, moisture, and online analyzers, as well as muffle furnaces, and moisture and drying ovens. The company also provides ash fusion determinators, coking coal indices determinators, and hardgrove grindability index testers, as well as spare parts. In addition, offers sample preparation equipment comprising sample preparation systems, pulverizers, sample dividers, sieving shakers, and assisting tools, as well as hammer, jaw, and double roller crushers; and mechanical samplers include cross-belt, and railway and road wagon samplers, and online sample preparation systems. Further, the company provides management and robotic intelligent laboratory systems. The company also exports its products to approximately 60 countries, such as Indonesia, Vietnam, South Africa, Mexico, the Philippines, Thailand, South Korea, Malaysia, Burma, Laos, Australia, India, Ukraine, and the European Union. The company was formerly known as Changsha Kaiyuan Instruments Co., Ltd. and changed its name to Kaiyuan Education Technology Group Co., Ltd. in December 2020. Kaiyuan Education Technology Group Co., Ltd. was founded in 1992 and is based in Changsha, the People's Republic of China.",
    "website": "http://www.ckic.net",
    "zipcode": "410100"
  },
  "300354.SZ": {
    "city": "Jingjiang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Jiangsu DongHua Testing Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "DONGHUA TESTING TE",
    "state": null,
    "summary": "Jiangsu DongHua Testing Technology Co., Ltd. manufactures and sells structural mechanics performance test systems in China. The company also provides structural mechanics performance tests, such as multi-channel dynamic signal test and analysis systems, stress strain test analysis systems, portable test analysis systems, signal analysis systems, rugged dynamic signal test and analysis systems, wireless signal test and analysis systems, isolated signal test and analysis systems, bridge modal test systems, online monitoring and analysis systems, experimental teaching systems, modal excitation systems, and accessory products. It also offers software products, which include basic analysis, engineering application, order analysis, acoustic analysis, modal analysis, bridge analysis, and secondary development modules, as well as online monitoring software platform. In addition, the company provides sensor products, such as speed, strain, and pressure sensors; accelerometers; motion detectors; and force hammers. Its products are used in scientific research, testing, teaching, equipment manufacturing, and other fields. The company was founded in 1993 and is headquartered in Jingjiang, China.",
    "website": "http://www.dhtest.com",
    "zipcode": null
  },
  "300356.SZ": {
    "city": "Nanjing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "EleFirst Science & Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "ELEFIRST SCIENCE A",
    "state": null,
    "summary": "EleFirst Science & Technology Co., Ltd. provides information collection systems in China and internationally. It offers smart grid products, such as electricity information collection system solutions, energy management systems, micro grid systems, distribution network automation system solutions, substation automation system solutions, tools, and other solutions. The company also provides health management solutions, including mobile services for medical authorities, hospitals, government communities, communication operators, radio and television networks, enterprises and institutions, and general public. In addition, it offers copyright cloud platforms, such as national digital audiovisual broadcasting service supervision platform and China international digital intellectual property monitoring and protection platform. The company was founded in 2000 and is based in Nanjing, China.",
    "website": "http://www.elefirst.com",
    "zipcode": "211106"
  },
  "300370.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Sichuan Etrol Technologies Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "BEIJING ETROL TECH",
    "state": null,
    "summary": "Beijing Etrol Technologies Co., Ltd. manufactures smart industry, automation, and oil and gas products and solutions in China. The company offers distributed control systems, remote terminal units, expansion I/O products, and instruments, as well as specialized industrial products for the intelligent production and development in the oilfield, granary, environment protection, and chemical industries. It also delivers supervisory control and data acquisition, safety instrumented, fire and gas, emergency shutdown, security monitoring, and dispatching systems. In addition, the company offers oil and gas ground devices; products for measurement while drilling; and natural gas processing, and environmental protection in oil and gas, as well as integrated drilling and completion, and fracturing services. Further, it provides three-dimensional ecological monitoring network and application platform for dynamic data; integrated solutions to customers in informationalized and intelligent, and grain storage and transportation industries; and multi-purpose monitoring and control systems. Additionally, it provides technologies of Internet of Things, cloud computing and related equipment, communication technology and relevant products, intelligent manufacturing, etc., as well as smart campus and intelligent water products. The company also offers oil and gas field, water and waste water, city gas, coal bed methane, oil production technology, EPC, and smart park and city solutions. In addition, it provides operation and maintenance, technical consultation, investment, engineering design and system integration, solution and implementation, construction, equipment installation and commissioning, spare parts management, and performance and upgradation services. The company was formerly known as Beijing ECHO Technologies Co., Ltd. and changed its name to Beijing Etrol Technologies Co., Ltd. in February 2015. The company was founded in 1998 and is based in Beijing, China.",
    "website": "http://www.etrol.com",
    "zipcode": "100095"
  },
  "300371.SZ": {
    "city": "Tangshan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Huizhong Instrumentation Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "HUIZHONG INSTRUMEN",
    "state": null,
    "summary": "Huizhong Instrumentation Co., Ltd. engages in the research, development, manufacture, and sale of ultrasonic heat meters, water meters, flow meters, and metering systems in China. It offers water meters for residential water supply, water supply management, modeling, and billing applications; and heat meters for residential, public buildings, temperature control, and billing applications. The company was formerly known as Tangshan Huizhong Instrumentation Co., Ltd. and changed its name to Huizhong Instrumentation Co., Ltd. in September 2015. Huizhong Instrumentation Co., Ltd. was founded in 1994 and is based in Tangshan, China.",
    "website": "http://www.huizhong.co",
    "zipcode": "063020"
  },
  "300410.SZ": {
    "city": "Dongguan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Guangdong Zhengye Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "GUANGDONG ZHENGYE",
    "state": null,
    "summary": "Guangdong Zhengye Technology Co., Ltd. engages in the research and development, production, sale, and after-sale servicing of precision inspection equipment and electronic materials in China. The company develops and produces X-ray machines, UV laser cutting machines, automatic reinforcement machines, UV laser drilling machines, PCB cutting machines, hole checkers, TDR impedance testers, ionic contamination testers, thermal resistance testers, and other precision equipment for use in PCBs and lithium batteries. It also offers lab testing machines, laser marking machines, and PCB manufacturing machines. In addition, the company provides consumable materials, such as filtration purification, precision photosensitive, dedicated plastics, and precision positioning products, as well as other electronic materials for use in PCB, SMT, lithium battery, environmental protection, and food industries. Guangdong Zhengye Technology Co., Ltd. also exports its products to Russia, the United States, England, Japan, Korea, Brazil, Singapore, Thailand, Malaysia, Vietnam, etc. The company was founded in 1997 and is headquartered in Dongguan, China.",
    "website": "http://www.zhengyee.com",
    "zipcode": null
  },
  "300416.SZ": {
    "city": "Suzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Suzhou Sushi Testing Group Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "SUZHOU SUSHI TEST",
    "state": null,
    "summary": "Suzhou Sushi Testing Group Co., Ltd. provides mechanics environmental test equipment and solutions. The company's products include electro-dynamic shakers, electro-dynamic test systems, electro-dynamic vibration test systems, multi-point test systems, life test and accelerated stress screens, multi-loading composite systems, hydraulic vibration systems, shock testers, drop test systems, vibration test systems and sensors, digital vibration controllers, auxiliary devices, slip and other tables, and automobile simulation transport and transportation vibration testers. Its products are used to simulate the vibration, shock, collision, and falling environmental conditions to assess the reliability of the quality of industrial products. The company was formerly known as Suzhou Sushi Testing Instrument Co., Ltd. and changed its name to Suzhou Sushi Testing Group Co., Ltd. in August 2017. Suzhou Sushi Testing Group Co., Ltd. was founded in 1956 and is headquartered in Suzhou, China.",
    "website": "http://www.chinasti.com",
    "zipcode": null
  },
  "300417.SZ": {
    "city": "Foshan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Nanhua Instruments Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "NANHUA INSTRUMENTS",
    "state": null,
    "summary": "Nanhua Instruments Co., Ltd. manufactures and sells vehicle test equipment in China. The company offers vehicle inspection line products, such as suspension, wheel steering angle, plate brake, speed meter, wheel load, side slip, break, multi-axle wheel load, vehicle dimension, and loaded brake testers, as well as free roller and play detector. It also offers exhaust gas analyzers, BASM detection products, VMAS/ASM/lugdown testing systems, and headlight testers. In addition, the company provides motor vehicle emission detection instruments, environmental protection detection systems, and safety detection instruments, as well as safety detection systems, including computer detection/management network control system software. It also exports its products to Asia, the United States, Europe, and other countries. The company was founded in 1996 and is based in Foshan, China.",
    "website": "http://www.nanhua.com.cn",
    "zipcode": "528251"
  },
  "300455.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Beijing Ctrowell Technology Corporation Limited",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "BEIJING CTROWELL T",
    "state": null,
    "summary": "Beijing Ctrowell Technology Corporation Limited engages in the research and production of railway vehicle safety detection technology products. The company offers vehicle infrared axis temperature detection systems and truck running fault dynamic image detection systems, as well as AS/RS warehouse, railway MIS, and other products. Beijing Ctrowell Technology Corporation Limited was founded in 1988 and is based in Beijing, China.",
    "website": "http://www.cchbds.com.cn",
    "zipcode": "100190"
  },
  "300456.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Navtech Inc.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "SAI MICROELECTRONI",
    "state": null,
    "summary": "Navtech Inc. engages in the research and development, production, and sale of inertial, satellite, and integrated navigation products in China. The company also offers unmanned systems, MEMS series products, avionics, and intelligent manufacturing products. It serves the aviation and navigation, surveying and mapping, unmanned system, consumer electronic, intelligent control, weapon, scientific research and teaching, and other fields. The company was founded in 2008 and is based in Beijing, China.",
    "website": "http://www.navgnss.com",
    "zipcode": null
  },
  "300466.SZ": {
    "city": "Xuzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Saimo Technology Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "SAIMO TECHNOLOGY C",
    "state": null,
    "summary": "Saimo Technology Co., Ltd. provides intelligent detection products and control systems in China. The company's Bulk Handling division offers weighing products, including high precision belt scales, floating scale belt scales, coal weighing feeders, weighing feeders, batching systems, checking equipment, weighing instruments/load cells, and other measuring equipment; bulk material detection products, such as sweep sampling, auger sampling, sample preparation and analytics, and coal sample transportation systems; and conveyor protection products comprising run off, safety pull, position, tilt, and under speed switches, as well as belt damaged detectors and motion monitor systems. Its Packaging division provides flexible and bulk packaging lines; weighing and filling products, such as multihead and linear weighers, auger fillers, and volumetric cup fillers; open mouth, valve bag, bulk bag, and premade bag packers, as well as vertical form fill seals, bulk bag dischargers, and vacuum loaders; checkweigher and metal detector inspection products; robotic, low level, and high level palletizers; and inclined, screw, take off, bet, and chain conveyors, as well as turn tables and bucket elevators. The company also provides spare parts and manuals, and field and training services; and industrial handling robots and quantitative packaging machinery. In addition, it offers pillow bag, tray, carton, bottle, open mouth bag, and bulk bag solutions for the dry and processed food, fresh food, frozen food, liquid and thick, and nonfood industries; and bulk handling solutions for the power, chemical, cement, steel, metallurgy, port, coal, and quarry industries. The company was formerly known as Saimo Electric Co., Ltd. and changed its name to Saimo Technology Co., Ltd. in May 2020. Saimo Technology Co., Ltd. was founded in 1996 and is headquartered in Xuzhou, China.",
    "website": "http://www.saimo.cn",
    "zipcode": null
  },
  "300515.SZ": {
    "city": "Changsha",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Hunan Sundy Science and Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "HUNAN SUNDAY SCIEN",
    "state": null,
    "summary": "Hunan Sundy Science and Technology Co., Ltd. supplies coal analysis solutions in the People's Republic of China and internationally. The company offers bomb calorimeters; elemental analyzers, including carbon hydrogen and nitrogen, infrared sulfur, coulomb sulfur, and fluorine and chlorine analyzers; and thermogravimetric analyzers comprising loss on ignition analyzers, moisture analyzers, and intelligent muffle furnaces. It also provides ash fusion testers; hardgrove grindability index testers; sample preparation equipment, such as quick dryer, hammer crusher and divider, jaw crusher, double roll crusher, humid coal hammer crusher and divider, pulverizer, automatic divider, standard sieve shaker, environmental sieve, and crushing dividing combined products; and auto sampling systems comprising fuel management and control, integrated sampling and sample preparation system, and coal yard dynamic management and control systems. In addition, the company offers preceding stage sample preparation, online total moisture test, automatic sample storing and checking cabinet, dust extraction, and coal quality management systems, as well as stationery laser and unmanned aerial vehicle stockpile inventorying equipment. Its products are used in coal and coke, biomass fuel, food and feed, and environmental applications. The company was founded in 1993 and is based in Changsha, the People's Republic of China.",
    "website": "http://www.sandegroup.com",
    "zipcode": null
  },
  "300516.SZ": {
    "city": "Wuhan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Hubei Jiuzhiyang Infrared System Co., Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "HUBEI JIUZHIYANG I",
    "state": null,
    "summary": "Hubei Jiuzhiyang Infrared System Co., Ltd engages in the research, production, and marketing of infrared thermal imagers in China. The company offers uncooled and cooled infrared imagers; laser range finders; and hand-held and physical thermoscopes. Its products are used in the areas of marine surveillance, law enforcement, security and protection monitoring, forest fire prevention, supervising and rescue for aquatic transportation, search and rescue, industrial detection, inspection and quarantine, assistant driving, etc. The company is based in Wuhan, China.",
    "website": "http://www.hbjir.com",
    "zipcode": "430223"
  },
  "300552.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Beijing Wanji Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "BEIJING WANJI TECH",
    "state": null,
    "summary": "Beijing Wanji Technology Co., Ltd. provides intelligent transportation systems in China. The company offers ETC products, such as on board units, release devices, and roadside units, as well as V2X, a product that connects Internet of vehicles and automatic drive; and weigh-in-motion products, including toll-by-weight, overweight measurement, direct enforcement, instrument panel, LiDAR axle recognizer, and integrated management platform. It also provides LiDAR range of products for use in traffic condition survey, vehicle detection outline size detection and measurement, and vehicle classification systems; and electronic registration identification systems, which include RFID readers and antennas. In addition, the company offers big data products for use in overloading management, traffic, and logistics applications. Beijing Wanji Technology Co., Ltd. was founded in 1994 and is headquartered in Beijing, China.",
    "website": "http://www.wanji.net.cn",
    "zipcode": "100193"
  },
  "300567.SZ": {
    "city": "Wuhan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Wuhan Jingce Electronic Group Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "WUHAN JINGCE ELECT",
    "state": null,
    "summary": "Wuhan Jingce Electronic Group Co., Ltd. engages in the research and development, production, and sale flat panel display inspection systems. The company's principal products include module inspection systems, panel inspection systems, OLED inspection systems, AOI optical inspection systems, and flat panel display automation equipment. The company was formerly known as Wuhan Jingce Electronic Technology Co., Ltd. and changed its name to Wuhan Jingce Electronic Group Co., Ltd. in November 2017. Wuhan Jingce Electronic Group Co., Ltd. was founded in 2006 and is headquartered in Wuhan, China.",
    "website": "http://www.wuhanjingce.com",
    "zipcode": null
  },
  "300572.SZ": {
    "city": "Shenzhen",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Shenzhen Anche Technologies Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "SHENZHEN ANCHE TEC",
    "state": null,
    "summary": "Shenzhen Anche Technologies Co., Ltd. provides motor vehicle inspection, industry regulation and supervision, driver examination system, and intelligent maintenance industry services and management solutions in China. It offers motor vehicle inspection systems, such as motor vehicle testing line, security line equipment, inspection line, comprehensive inspection line, loop inspection line, motorized inspection line, and maintenance equipment; industry supervision networking platform; motor vehicle driver examination systems; automobile factory test equipment, including new vehicle testing line, new energy automobile testing line, rain testing room, four-wheel positioning, and vehicle washing machines; and vehicle inspection appointment system. The company is headquartered in Shenzhen, China.",
    "website": "http://www.anche.cn",
    "zipcode": "518052"
  },
  "300590.SZ": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Queclink Wireless Solutions Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "QUECLINK WIRELESS",
    "state": null,
    "summary": "Queclink Wireless Solutions Co., Ltd. supplies wireless machine-to-machine devices and solutions worldwide. The company offers asset trackers, personal trackers, vehicle trackers, accessories, and animal identification tags, as well as ODM services. It provides products for automotive tracking, fleet management, tracking and tracing, lone worker safety, mobile health care, remote monitoring and control of various assets, and wireless alarms to cover applications through the Internet. The company was founded in 2009 and is headquartered in Shanghai, China.",
    "website": "http://www.queclink.com",
    "zipcode": "200233"
  },
  "300627.SZ": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Shanghai Huace Navigation Technology Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "SHANGHAI HUACE NAV",
    "state": null,
    "summary": "Shanghai Huace Navigation Technology Ltd. operates as a GNSS positioning technology and products company in China and internationally. The company offers GNSS survey and engineering products, as well as software solutions for high precision surveying and positioning, engineering, mapping, GIS data collection, road stakeout, and pipeline surveying; GIS data collection products; GNSS infrastructures; unmanned aircraft systems; and precision agricultural products for various applications and industries, such as auto-steering, ditching, ridging, seeding, inter-tillage, etc. It also provides rugged total stations for optical surveying; and vehicle-independent mobile mapping solutions, as well as products for marine construction industry. Shanghai Huace Navigation Technology Ltd. has a strategic collaboration agreement with CMMB Silkwave Limited to jointly develop the BeiDou navigation applications and services. The company was founded in 2003 and is headquartered in Shanghai, China.",
    "website": "http://www.huace.cn",
    "zipcode": "201702"
  },
  "300747.SZ": {
    "city": "Wuhan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Wuhan Raycus Fiber Laser Technologies Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "WUHAN RAYCUS FIBER",
    "state": null,
    "summary": "Wuhan Raycus Fiber Laser Technologies Co., Ltd. researches, develops, produces, and sells high power fiber lasers and devices in the People's Republic of China. The company offers single module CW fiber, short-pulse fiber, fiber delivered direct diode laser, quasi-continuous fiber, 10-100W Q-switched pulse fiber, and high-power multimode continuous fiber lasers. It also exports its products to Asia, Europe, the United States, the Middle East, and internationally. The company was founded in 2007 and is headquartered in Wuhan, the People's Republic of China.",
    "website": "http://www.raycuslaser.com",
    "zipcode": "430223"
  },
  "300807.SZ": {
    "city": "Zhengzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Zhengzhou Tiamaes Technology Co., Ltd",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "ZHENGZHOU TIAMAES",
    "state": null,
    "summary": "Zhengzhou Tiamaes Technology Co., Ltd engages in the research, development, design, production, and sale of vehicle electronic products for urban public transport smart solutions. Its products include fare box and cashier counting machines; on-board computers, driving recorders, intelligent passenger counters, LED screens, and section station apparatus products; electronic bus-stop boards and guiding screens; and scheduling screens, dispatching terminals, and bus dispatching communication machines. The company also offers software products, such as enterprise resource management comprehensive information management system, urban public traffic intelligent application platform, bus comprehensive operation detecting monitoring platform, bus cashier system, bus intelligent dispatching system, travel services mobile client, bus operation monitoring platform, bus oiling management system, intelligent fare collection management cloud platform, passenger flow scheduling analysis system, and energy charging monitoring system solutions. It serves bus companies and cities. The company was founded in 2004 and is based in Zhengzhou, China.",
    "website": "http://www.tiamaes.cn",
    "zipcode": "450000"
  },
  "300862.SZ": {
    "city": "Tongling",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Anhui Landun Photoelectron Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "ANHUI LANDUN PHOTO",
    "state": null,
    "summary": "Anhui Landun Photoelectron Co., Ltd. researches and produces analytical measuring instruments. The company offers transportation products, such as speed measuring products, cameras, fill light products, intelligent management systems, information release products, signal light and machine products, and traffic weather collection products; traffic front-end subsystems; and software platform. It also provides application solutions, and operation and maintenance services in the fields of intelligent transportation, smart environmental protection, intelligent weather, and food and drug safety. The company is headquartered in Tongling, China.",
    "website": "http://www.ldchina.cn",
    "zipcode": null
  },
  "300880.SZ": {
    "city": "Cixi",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Ningbo Jianan Electronics Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "NINGBO JIANAN ELEC",
    "state": null,
    "summary": "Ningbo Jianan Electronics Co.,Ltd engages in the research, development, production, and sale of smart meters, electricity information collection terminals, and energy metering boxes. Its products include single- and three-phase smart meters, intelligent power management terminals, electric energy metering boxes, distribution network automation equipment, charging piles, etc. The company was founded in 1999 and is based in Cixi, China.",
    "website": "http://www.nbjianan.com",
    "zipcode": "315300"
  },
  "300882.SZ": {
    "city": "Tiantai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Zhejiang Wellsun Intelligent Technology Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "ZHEJIANG WELLSUN I",
    "state": null,
    "summary": "Zhejiang Wellsun Intelligent Technology Co.,Ltd. engages in the research, production, and sale of electric energy measuring instrument and power automation systems. It offers sets of single-phase intelligent ammeters, three-phase intelligent ammeters, concentrators, collectors, terminals, and electric energy measuring boxes. The company also provides Internet of Things equipment, and distribution network automation and main station management systems. It serves customers in South Asia, Africa, the Middle East, Europe, and internationally. The company was founded in 1992 and is based in Tiantai, China.",
    "website": "http://www.wellsun.com",
    "zipcode": "317200"
  },
  "300897.SZ": {
    "city": "Hangzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Hangzhou Seck Intelligent Technology Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "HANGZHOU SECK INTE",
    "state": null,
    "summary": "Hangzhou Seck Intelligent Technology Co.,Ltd. primarily manufactures and processes meter reading system products and rotor wet long-distance cold water meters. The company engages in the electronic computer and system integration, and technology development, as well as technical development of smart water meter systems and software, and water automation and information systems. It is also involved in the installation of intelligent water meters and meter reading systems; wholesale and retail of electronic products, instruments, and water supply equipment; and import and export of goods. The company was founded in 1999 and is based in Hangzhou, China.",
    "website": "http://www.seck.com.cn",
    "zipcode": "310012"
  },
  "300906.SZ": {
    "city": "Nanchang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Jiangxi Everbright Measurement Control Technology Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "JIANGXI EVERBRIGHT",
    "state": null,
    "summary": "Jiangxi Everbright Measurement Control Technology Co.,Ltd manufactures track inspection instrument, track measuring instrument, track testing equipment combination, and other testing equipment. The company was founded in 2006 and is headquartered in Nanchang, China. Jiangxi Everbright Measurement Control Technology Co.,Ltd operates as a subsidiary of Jiangxi Riyueming Industrial Co., Ltd.",
    "website": "http://www.rym.com.cn",
    "zipcode": "330029"
  },
  "603279.SS": {
    "city": "Dezhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Jingjin Environmental Protection Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "JINGJIN ENVIRONMENTAL PROTECTIO",
    "state": null,
    "summary": "Jingjin Environmental Protection Co.,Ltd. manufactures and sells filter press machines and related equipment for use in environmental protection, chemical engineering, food, pharmaceutical, metallurgy, and coal industry. Its products include filter press, low temperature dryer, filter press, filter plate, filter press auxiliary system, filter press accessories, filter equipment, and filter cloth. The company was founded in 1988 and is based in Dezhou, China.",
    "website": "http://www.jjylj.com",
    "zipcode": "253034"
  },
  "603297.SS": {
    "city": "Ningbo",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Ningbo Yongxin Optics Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "NINGBO YONGXIN OPTICS CO LTD",
    "state": null,
    "summary": "Ningbo Yong Xin Optics Co., Ltd. manufactures and sells optical instruments and components in China. It offers optical microscopes and optical components used for various applications in optical and electronic products, such as bar-code scanners, motion optics, automotive driving, high-end cameras, HD projection, teaching, life sciences, semiconductors, etc. The company offers its products under the NOVEL, JIANGNAN, and NEXCOPE brands. It also exports its products to approximately 100 countries. The company was formerly known as Ningbo Yongxin Optical Instrument Co., Ltd. and changed its name to Ningbo Yong Xin Optics Co., Ltd. in 2000. Ningbo Yong Xin Optics Co., Ltd. was founded in 1997 and is based in Ningbo, China.",
    "website": "http://www.yxopt.com",
    "zipcode": null
  },
  "603421.SS": {
    "city": "Qingdao",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Qingdao Topscomm Communication INC.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "QINGDAO TOPSCOMM COMMUNICATION ",
    "state": null,
    "summary": "Qingdao Topscomm Communication INC. designs, researches and develops, manufactures, and sells smart products for electric power and fire protection primarily in China. The company offers smart energy meters, such as smart prepayment and advanced metering infrastructure (AMI), and conventional meters; communication terminals, including data collectors and concentrators, and communication converters; energy data acquisition, distribution automation, power quality, and renewable energy systems; and communication chips and modules. It also provides AMI, prepayment vending, water/gas/heat and electricity meter AMR/AMI, distribution automation and management, and low and medium voltage PLC communication solutions. In addition, the company offers billing management, photovoltaic power management, and wind turbine control systems; and data collection operation and maintenance, line loss management, engineering installation, operation and distribution coordination, and power design services. Its products are used in the fields of smart grid, smart metering, new energy, fire protection, smart home, etc. Qingdao Topscomm Communication INC. was founded in 2008 and is headquartered in Qingdao, China.",
    "website": "http://www.topscomm.com",
    "zipcode": "266024"
  },
  "603508.SS": {
    "city": "Zhengzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Henan Thinker Automatic Equipment Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "HENAN THINKER AUTOMATIC EQUIPME",
    "state": null,
    "summary": "Henan Thinker Automatic Equipment Co.,Ltd engages in the research and development, manufacture, and sale of train operation control systems in China. The company offers automotive solutions, which include locomotive car safety protection, locomotive remote monitoring and diagnosis, and train operation status information systems. It also provides ground solutions comprising locomotive wireless shunting monitoring, standardized maintenance operation, flight attendant training, flight attendant remote exit management, locomotive operation safety monitoring and early warning, and driving safety data closed-loop application systems. The company was founded in 1992 and is based in Zhengzhou, China.",
    "website": "http://www.hnthinker.com",
    "zipcode": "450001"
  },
  "688056.SS": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Beijing Labtech Instruments Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "BEIJING LABTECH INSTRUMENTS CO ",
    "state": null,
    "summary": "Beijing Labtech Instruments Co., Ltd. manufactures and supplies laboratory products and solutions to laboratory industry worldwide. Its primary products include organic/inorganic sample preparation systems, laboratory cooling/heating equipment, analytical instruments, and consumables. The company is based in Beijing, China.",
    "website": "http://www.labtechus.com",
    "zipcode": "101300"
  },
  "688288.SS": {
    "city": "Hangzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Hangzhou Hopechart IoT Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "HANGZHOU HOPECHART IOT TECHNOLO",
    "state": null,
    "summary": "Hangzhou Hopechart IoT Technology Co., Ltd. develops, produces, and sells driving systems and advanced driver assistance systems in China. The company was founded in 2009 and is headquartered in Hangzhou, China.",
    "website": "http://www.hopechart.com",
    "zipcode": null
  },
  "688528.SS": {
    "city": "Chengdu",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Chengdu Qinchuan IoT Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "CHENGDU QINCHUAN IOT TECHNOLOGY",
    "state": null,
    "summary": "Chengdu Qinchuan IoT Technology Co., Ltd. engages in the research and development, manufacturing, sale, and servicing of smart gas meters and Internet of Things system software. The company's principal products include IC card smart, Internet of things smart, membrane, remote control smart, and industrial and commercial gas meters. It also offers IoT smart gas solutions and Internet of things intelligent gas meter operating systems. The company was founded in 2001 and is based in Chengdu, China.",
    "website": "http://www.cdqckj.com",
    "zipcode": "610000"
  },
  "688600.SS": {
    "city": "Hefei",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Scientific & Technical Instruments",
    "long_name": "AnHui Wanyi Science and Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "ANHUI WANYI SCIENCE AND TECHNOL",
    "state": null,
    "summary": "AnHui Wanyi Science and Technology Co., Ltd. develops and supplies analytical instruments. The company's products include analytical tools about mass spectrometers, chromatography instruments, spectrum instruments, and medical devices. It offers leak detectors, environmental monitoring equipment, and laboratory analysis instruments. The company was founded in 2003 and is based in Hefei, China.",
    "website": "http://www.wayeal.com.cn",
    "zipcode": "230088"
  },
  "8511.HK": {
    "city": "Guangzhou",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Zhicheng Technology Group Ltd.",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "ZC TECH GP",
    "state": null,
    "summary": "Zhicheng Technology Group Ltd., an investment holding company, provides precision 3D testing and machining solutions in the People's Republic of China. The company offers non-contact optical measurement and full-field positioning systems to detect and analyze the shape and appearance data of objects; and non-contact three-dimensional dynamic measurement and analysis systems to calculate surface displacement and strain distribution. It serves equipment manufacturers in the aviation, aerospace, shipbuilding, ground transportation vehicles, and electronics industries. The company was incorporated in 2017 and is headquartered in Guangzhou, the People's Republic of China.",
    "website": "http://www.ztecgroup.com",
    "zipcode": "510600"
  },
  "ZEPP": {
    "city": "Hefei",
    "country": "China",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Zepp Health Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "Zepp Health Corporation",
    "state": null,
    "summary": "Zepp Health Corporation, a biometric and activity data-driven company, develops, manufactures, and sells smart wearable technological devices in the People's Republic of China. It operates through two segments, Xiaomi Wearable Products, and Self-Branded Products and Others. The company offers smart bands, watches, and scales; and a range of accessories, including bands, watch straps, earphones, sportswear, home gym, treadmill, etc. under the Xiaomi and Amazfit brands. It provides charts and graphs to display analysis of the activity and biometric data collected from users through its Mi Fit and Amazfit mobile apps. Zepp Health Corporation has strategic collaborations with Timex Group to develop smart watches; and AliveCor, Inc. to deliver a medical functionality to wearable devices. The company was formerly known as Huami Corporation and changed its name to Zepp Health Corporation in February 2021. Zepp Health Corporation was founded in 2013 and is headquartered in Hefei, the People's Republic of China.",
    "website": "http://www.huami.com",
    "zipcode": "230088"
  }
}
