{
    "000997.SZ": {
        "short_name": "NEWLAND DIGITAL TE",
        "long_name": "Newland Digital Technology Co.,Ltd.",
        "summary": "Newland Digital Technology Co.,Ltd. provides bar code, financial payment, mobile and other communications, traffic information, and Internet finance services in China and internationally. The company offers bar code recognition technology; POS machines for electronic financial payment; mobile information technology; cloud computing and big data services; traffic information business software, equipment, and systems service solutions; and online to offline QR code marketing services. It also provides system construction and operation services of intelligent transportation solutions; develops, constructs, and operates expressways electromechanical information; constructs and operates car networking systems; rail transit electromechanical information; develops and constructs intelligent parking lots; and designs and constructs provincial and municipal intelligent traffic card application planning and technical standards. In addition, the company offers software development, hardware manufacturing, and system integration services in the field of food safety; animal identification and disease traceability systems for the Department of Agriculture; meat and vegetable circulation traceability systems to the Ministry of Commerce; national veterinary drug product traceability information systems; Chinese medicine tracing systems for the Ministry of Commerce; and construction services for Beijing Olympic food safety project. Further, it provides consumer, small and micro-operating, and online merchant micro-loans. The company was formerly known as Fujian Newland Computer Co., Ltd. and changed its name to Newland Digital Technology Co.,Ltd. in November 2018. Newland Digital Technology Co.,Ltd. was founded in 1994 and is based in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": "350001",
        "website": "http://dt.newland.com.cn",
        "market_cap": 17468815360
    },
    "002063.SZ": {
        "short_name": "YGSOFT INC",
        "long_name": "YGSOFT Inc.",
        "summary": "YGSOFT Inc. provides enterprise management and social service information systems to the energy industry. The company also offers software and hardware products and services, and financial, information and big data analytics consulting service. In addition, the company provides power distribution network information services, energy management, energy information application, fuel solutions, and analytical equipment and solutions, as well as coal quality technology. Further, it offers Internet solutions; management tools for military industry; business extension platform; project management solutions; business travel management solutions; and invests in and finances business development platform. Additionally, the company provides various management field solutions in the fields of business analysis, governance, risk and compliance, financial management, purchase and sale of electricity, financial sharing, safety production management, consolidated statement, cost management, EAP integration, electronic file management, accounting, asset management, SME, material management, consultation, system integration, and wisdom check. It serves customers in energy, aerospace, high-end equipment, metallurgical smelting, and rail transportation industries. Ygsoft Inc. was founded in 1998 and is headquartered in Zhuhai, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhuhai",
        "zipcode": "519085",
        "website": "http://www.ygsoft.com",
        "market_cap": 9922409472
    },
    "002095.SZ": {
        "short_name": "ZHEJIANG NETSUN CO",
        "long_name": "Zhejiang NetSun Co., Ltd.",
        "summary": "Zhejiang NetSun Co., Ltd. provides Internet information, e-commerce, and enterprise application software development services in China. It operates Websites, such as chemnet.com.cn, chinachemnet.com, texnet.com.cn, pharmnet.com.cn, toocle.cn, toocle.com, 100ppi.com, dazpin.com, sinopay.com, and sinoloans.cn. The company was founded in 1997 and is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://corp.netsun.com",
        "market_cap": 3722565376
    },
    "002123.SZ": {
        "short_name": "MONTNETS CLOUD TEC",
        "long_name": "Montnets Cloud Technology Group Co., Ltd.",
        "summary": "Montnets Cloud Technology Group Co., Ltd. operates as a mobile Internet operating support service provider in China and internationally. It operates operations support platform for various B2C applications of mobile Internet, as well as offers mobile instant messaging services, such as SMS and MMS for enterprises. The company also provides mobile smart traffic services; and operates an audio/video communication service cloud platform enabling enterprises to implement communication capabilities based on mobile Internet audio and video platform. In addition, it offers B2C unified communication cloud platform, a PaaS platform to help corporate customers obtain the B2C communication service capability; enterprise mobile platform, a communication gateway system for front-end access; and short message captcha for member verification, order notification, payment confirmation, logistics notification, and other triggering SMS applications. Further, the company provides mobile information code application platform; SMS notification; enterprise yellow page; Nova information processing platform for corporate customers; Tongzhiwang, a software product with notification; and audio captcha services. Additionally, it offers Montnets video cloud, a real-time communication platform; Montnets Cloud Broadcast, a vertical SaaS product; wisdom IoT cloud platform; and IoT 4G/3G/2G cards. The company was formerly known as Montnets Rongxin Technology Group Co., Ltd. and changed its name to Montnets Cloud Technology Group Co., Ltd. in November 2020. Montnets Cloud Technology Group Co., Ltd. was founded in 1998 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.montnets.com",
        "market_cap": 14510352384
    },
    "002153.SZ": {
        "short_name": "BEIJING SHIJI INFO",
        "long_name": "Beijing Shiji Information Technology Co., Ltd.",
        "summary": "Beijing Shiji Information Technology Co., Ltd. provides software solutions and services for the hospitality, food service, retail, and entertainment industries in China and internationally. It also offers payment gateways; data management solutions; IT services for restaurants; POS hardware, kitchen printers, and screens; inventory management software for restaurants; and e-commerce platforms for stores, products, orders, purchasing, delivery, maintenance, storage, finance, loyalty programs, and reporting. The company was founded in 1995 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100010",
        "website": "http://www.shijigroup.com",
        "market_cap": 31115745280
    },
    "002230.SZ": {
        "short_name": "IFLYTEK CO LTD",
        "long_name": "iFLYTEK Co.,Ltd",
        "summary": "Iflytek Co., Ltd. engages in the research and development of artificial intelligence (AI) technologies. The company develops and offers software and chip products. It also provides machine translation systems; intelligent speech, medical image, and cognitive intelligence based auxiliary medical systems; and smart voice court hearing systems for politics and laws. In addition, the company offers smart education products for teaching students; AI voice assistants, vehicle-mounted AI systems, and all-in-one infotainment systems for smart automobiles; and call center solutions for channeling voice self-services. Iflytek Co., Ltd. was founded in 1999 and is based in Hefei, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": "230088",
        "website": "http://www.iflytek.com",
        "market_cap": 128367501312
    },
    "002232.SZ": {
        "short_name": "QIMING INFORMATION",
        "long_name": "Qiming Information Technology Co.,Ltd",
        "summary": "Qiming Information Technology Co.,Ltd provides products and services in the areas of smart manufacturing, smart cars, and smart cities in China. The company's management software products include ERP, intelligent manufacturing, smart logistics, collaborative office, basic research and development, market consulting service, big data value-added application, and industrial Internet platform, as well as management software implementation services. It also provides intelligent networking, new energy, vehicle diagnostic, automotive electronic testing, and electronic and electrical architecture development services. In addition, the company offers smart logistics, smart transportation, and car information security services; and Qiming Cloud platform solution. Further, it provides solutions for vehicle manufacturers, including electronic and electrical design and integration testing, diagnostic communication development, comfort system electronic control unit development, battery system design and trial production, trial engineering, high-voltage electrical design, powertrain test and system solution verification, control strategy consulting, power system design, and MBD and integration testing services. Qiming Information Technology Co.,Ltd was founded in 2000 and is based in Changchun, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changchun",
        "zipcode": null,
        "website": "http://www.qm.cn",
        "market_cap": 4587993600
    },
    "002253.SZ": {
        "short_name": "WISESOFT CO LTD",
        "long_name": "Wisesoft Co., Ltd.",
        "summary": "Wisesoft Co., Ltd. provides technologies, systems, and services for the air traffic field in China. It offers flight flow management systems, portable emergency air traffic control systems, air traffic management integrated information management systems, radar control simulators, desktop tower simulators, tower control simulators, program control simulators, and multi-channel digital synchronous recorders. The company was founded in 2000 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610045",
        "website": "http://www.wisesoft.com.cn",
        "market_cap": 3122663936
    },
    "002280.SZ": {
        "short_name": "HANGZHOU LIAISON I",
        "long_name": "Hangzhou Lianluo Interactive Information Technology Co.,Ltd",
        "summary": "Hangzhou Lianluo Interactive Information Technology Co.,Ltd operates as an e-commerce company in China. It is involved in the various activities, such as e-commerce services platform; eSports and broadcasting networks; distribution and production of television and movies; and operation of airport media, as well as investment activities. The company also provides Internet financial services; and smart devices under MOPS brand that include virtual reality retinal glasses, smart masks, battery cases, Bluetooth headsets, and other related products. Hangzhou Lianluo Interactive Information Technology Co.,Ltd was founded in 2007 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.lianluo.com",
        "market_cap": 11756609536
    },
    "002331.SZ": {
        "short_name": "ANHUI WANTONG TECH",
        "long_name": "Anhui Wantong Technology Co.,Ltd.",
        "summary": "Anhui Wantong Technology Co.,Ltd. engages in the transportation information system integration, application software development, and operation and maintenance services in China. It provides system integration solutions used in expressways, port terminals, urban intelligent transportation, trunk roads, inland waterways, logistics tracking and justice, taxation, insurance, education, and other industry information fields. The company was founded in 1999 and is based in Hefei, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": "230088",
        "website": "http://www.wantong-tech.net",
        "market_cap": 4837725184
    },
    "002373.SZ": {
        "short_name": "CHINA TRANSINFO TE",
        "long_name": "China Transinfo Technology Co., Ltd",
        "summary": "China Transinfo Technology Co., Ltd. operates as a transportation operator and traffic data service provider. The company offers traffic solutions and security system for the urban transportation, highway transportation, rail transportation, civil aviation, water transportation, and other fields. China Transinfo Technology Co., Ltd. was founded in 2000 and is based in Beijing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100085",
        "website": "http://www.ctfo.com",
        "market_cap": 27623213056
    },
    "002405.SZ": {
        "short_name": "NAVINFO CO LTD",
        "long_name": "NavInfo Co., Ltd.",
        "summary": "NavInfo Co., Ltd. provides digital map content, Internet of Vehicles and dynamic traffic information service, and location-based vertical application services worldwide. The company offers ADAS maps, high-precision maps, navigation engines, and ADAS chips. It serves car navigation, consumer electronic navigation, the Internet and mobile Internet, government, and enterprise applications. NavInfo Co., Ltd. was founded in 2002 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.navinfo.com",
        "market_cap": 31867385856
    },
    "002410.SZ": {
        "short_name": "GLODON CO LTD",
        "long_name": "Glodon Company Limited",
        "summary": "Glodon Company Limited provides professional application software and support services to the construction industry. The company offers various products and services, such as cost management, BIM construction, digital enterprise. It operates in China, the United States, the United Kingdom, Finland, Sweden, Singapore, Hong Kong, Malaysia, Indonesia, India, and internationally. The company was formerly known as Glodon Software Company Limited and changed its name to Glodon Company Limited in June 2016. Glodon Company Limited was founded in 1998 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100193",
        "website": "http://www.glodon.com",
        "market_cap": 79589023744
    },
    "002474.SZ": {
        "short_name": "FUJIAN RONGJI SOFT",
        "long_name": "Fujian Rongji Software Co., Ltd.",
        "summary": "Fujian Rongji Software Co., Ltd. engages in the development and distribution of software products in China. The company offers software products for e-government, judicial, quality inspection information, and environmental information industries. The company also provides network engineering, data center, disaster recovery, information security, collaborative management, and system integration services. It primarily serves energy, telecommunication, finance, and manufacturing industries. Fujian Rongji Software Co., Ltd. was founded in 1993 and is based in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": "350003",
        "website": "http://www.rongji.com",
        "market_cap": 4479839744
    },
    "002657.SZ": {
        "short_name": "SINODATA CO LTD",
        "long_name": "Sinodata Co., Ltd.",
        "summary": "Sinodata Co., Ltd. operates in the software and information service sector in China. The company offers financial assets transaction, Internet bank, assets management, asset securitization, credit investigation, big data and supply chain finance services; and creates third party Internet bank platform and financial asset transaction platform; and constructs Internet bank ecosphere. It serves small and medium-sized commercial banks, enterprises government, and financial institutions. The company was founded in 2003 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100191",
        "website": "http://www.sinodata.net.cn",
        "market_cap": 4003663104
    },
    "002777.SZ": {
        "short_name": "SICHUAN JIUYUAN YI",
        "long_name": "Sichuan Jiuyuan Yinhai Software Co.,Ltd",
        "summary": "Sichuan Jiuyuan Yinhai Software Co., Ltd provides livelihood and military-civilian integration services for livelihood and military-civilian industries. The company is headquartered in Chengdu, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610063",
        "website": "http://www.yinhai.com",
        "market_cap": 5708956160
    },
    "002908.SZ": {
        "short_name": "GUANGDONG TECSUN S",
        "long_name": "Guangdong Tecsun Science & Technology Co.,Ltd.",
        "summary": "Guangdong Tecsun Science & Technology Co.,Ltd. provides information system construction and related operational services for human society, employment, finance, medical care, big data, etc. It offers social security card production and issuance, application environment construction, and operation services, as well as social security card solutions and card making services. The company also provides personal services, such as employment, subsidy issuance, and cards replacement services. The company was founded in 1999 and is headquartered in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.e-tecsun.com",
        "market_cap": 3435492608
    },
    "0268.HK": {
        "short_name": "KINGDEE INT'L",
        "long_name": "Kingdee International Software Group Company Limited",
        "summary": "Kingdee International Software Group Company Limited, an investment holding company, engages in enterprise resource planning business. The company operates through ERP Business, Cloud Services Business, and Investment Properties Operating Business segments. The ERP Business segment sells software and hardware products; and provides software solution consulting, maintenance, upgrade, and other supporting services, as well as software implementation services. The Cloud Services Business segment provides enterprise, finance, industry, and other cloud services. The Investment Properties Operating Business segment invests in properties. The company also develops, designs, manufactures, and sells hardware products; provides software-related and online financial services; and develops Internet and online pay technologies. It serves enterprises, government agencies, and other organizations worldwide. Kingdee International Software Group Company Limited was founded in 1991 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.kingdee.com",
        "market_cap": 96778403840
    },
    "0909.HK": {
        "short_name": "MING YUAN CLOUD",
        "long_name": "Ming Yuan Cloud Group Holdings Limited",
        "summary": "Ming Yuan Cloud Group Holdings Limited, an investment holding company, provides software solutions for property developers in the People's Republic of China. It offers enterprise resource planning (ERP) solutions and Software as a Service (SaaS) products for property developers and other real estate industry participants, such as construction materials suppliers and property asset management companies to manage a range of business operations, including sales and marketing, procurement, cost management, project management, budgeting, and property asset management. The company sells and delivers ERP solutions and SaaS products through direct sales force and a network of regional channel partners. Ming Yuan Cloud Group Holdings Limited was founded in 2003 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.mingyuanyun.com",
        "market_cap": 71979425792
    },
    "0C9A.F": {
        "short_name": "CHEET.M.ADR A10 DL-000025",
        "long_name": "Cheetah Mobile Inc.",
        "summary": "Cheetah Mobile Inc. operates as a mobile Internet company worldwide. The company's utility products include Clean Master, a junk file cleaning, memory boosting, and privacy protection tool for mobile devices; Security Master, an anti-virus and security application for mobile devices; Battery Doctor, a power optimization tool for mobile devices; Cheetah Browser, a Web browser for PCs and mobile devices; CM Browser, a mobile browser to protect users from malicious threats; and CM Launcher, which provides personalized experience in using smart phones. Its utility products also comprise Cheetah Keyboard, an artificial intelligence (AI)-enabled application; Photo Grid, a photo collage application for mobile devices; CM Locker, a lock screen with notifications and security; Duba Anti-virus, an Internet security application for PC and mobile devices; and SafeWallet, a mobile digital wallet. In addition, the company offers Live.me, a live video streaming application; and Cheez, an interactive short video application. Further, it provides mobile games comprising Piano Tiles 2, Rolling Sky, Dancing Line, Arrow.io, Tap Tap Fish, Tap Tap Dash, and Bricks n Balls; and Cheetah Voicepod, an AI-based smart speaker; Cheetah Translator, a portable hand-held voice translation device; and Cheetah GreetBot, a reception robot. Additionally, the company offers mobile advertising publisher services; duba.com personal start page that aggregates online resources and provides users access to their online destinations; and cloud-based data analytics engines. It serves direct advertisers that include mobile application developers, mobile game developers, and e-commerce companies, as well as search engines and partnering mobile advertising networks. The company was formerly known as Kingsoft Internet Software Holdings Limited and changed its name to Cheetah Mobile Inc. in March 2014. Cheetah Mobile Inc. was incorporated in 2009 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100123",
        "website": "http://www.cmcm.com",
        "market_cap": 295196736
    },
    "1297.HK": {
        "short_name": "SINOSOFT TECH",
        "long_name": "Sinosoft Technology Group Limited",
        "summary": "Sinosoft Technology Group Limited, an investment holding company, provides software development and system integration services, and sales of related computer products in the People's Republic of China. It operates through four segments: Export Enterprise Cloud-Based Software and Services, Low Carbon & Ecology Software and Related Services, Government Big Data Software and Related Services, and System Integration Solutions. The company offers export tax rebate filing management systems, invoices-matching and management systems, customs taxation certificates management systems, and value-added services for export tax rebate. It also provides e-government solutions and products that are used by government agencies at various administrative levels, including the ministerial, provincial, municipal, and district levels. In addition, the company offers carbon management solutions that enable government agencies and enterprises to audit, calculate, and control their greenhouse gas emissions and energy consumption. Further, it provides system integration solutions to government agencies, including information systems consultation and feasibility analysis; sourcing of systems and equipment; LAN and web-based network design and implementation; analysis, planning, and design of integrated wiring and network systems; design and implementation of video conferencing and multimedia education systems; and system management and supervision, as well as services comprising system architectures, intuitive graphical and multimedia user interfaces, web services, and other Internet technologies. Additionally, the company sells computer products; offers related services; provides investment and advisory services; and holds properties. Sinosoft Technology Group Limited was incorporated in 2011 and is headquartered in Nanjing, China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": null,
        "website": "http://www.sinosoft-technology.com",
        "market_cap": 1894704512
    },
    "1588.HK": {
        "short_name": "CHANJET",
        "long_name": "Chanjet Information Technology Company Limited",
        "summary": "Chanjet Information Technology Company Limited provides cloud services and software to micro and small scale enterprises in Mainland China. The company offers cloud services, including Chanjet Good Accountant, a cloud financial application; T+ Cloud enterprise management services; Chanjet Good Business that provides WeChat sharing and operation of store, product, and activity marketing of mobile phone stores; and Chanjet Easy Accounting Agent. It is also involved in the technical development, consulting, transfer, service, and training of computer software, hardware, and external devices; sale of typing paper, computer consumables, computer software, and hardware and external devices; provision of database services and information services of the second category value-added telecom business; and design, manufacturing, agency, and publication of advertisements. The company was formerly known as Chanjet Software Company Limited. Chanjet Information Technology Company Limited was founded in 2005 and is headquartered in Beijing, China. Chanjet Information Technology Company Limited is a subsidiary of Yonyou Network Technology Co., Ltd.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.chanjet.com",
        "market_cap": 4408794624
    },
    "1675.HK": {
        "short_name": "ASIAINFO TECH",
        "long_name": "Asiainfo Technologies Limited",
        "summary": "Asiainfo Technologies Limited, an investment holding company, provides telecom software products and related services for the telecom, postal, transportation, public services, finance, energy, and manufacturing industries in the People's Republic of China. The company operates through Software Business and Network Security Business segments. Its software product portfolio includes AISWare billing, bigdata, customer relationship management, AiDO, intelligent operation, Internet of Things, artificial intelligence platform, AsiaInfo infrastructure foundations, 5G network intelligence, AntDB, DataGo-data asset management, AIMAP, HyperView 3D visualization, RPA, 5G-slicing management, AIOps, and AISP-intelligent security all-in-one machine. The company also offers deployment services, including demand analysis, project design and planning, software development and sourcing, system installation and launch, and trial operation and acceptance services; and operation and maintenance services. In addition, it provides data-driven operation, business consulting, system integration, and corporate training services; and network security related software products and services, as well as procures and sells third-party hardware and software. The company was founded in 1993 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100193",
        "website": "http://www.asiainfo.com",
        "market_cap": 12106439680
    },
    "1782.HK": {
        "short_name": "VIXTEL TECH",
        "long_name": "Vixtel Technologies Holdings Limited",
        "summary": "Vixtel Technologies Holdings Limited, an investment holding company, provides Internet and Web application performance management (APM) products and services to telecommunication operators and large enterprises in Hong Kong and mainland China. The company offers Loglyst analysis platform, which collects, searches, analyzes, monitors, and visualizes unstructured data; APM Vista SaaS Platform, which provides network performance monitoring and mobility performance management services, as well as CDN performance monitoring, diagnosis, and evaluation; and NetVista, an intelligent IP network-oriented performance management and quality monitoring platform; cloud monitoring systems. It also provides IPTV/OTT video security and quality monitoring system, including program content, business, and transmission quality monitoring systems, as well as safety broadcast monitoring and multi-picture surveillance systems; and Trade QoS Monitoring, a precise analysis tool for transaction speed, delay, and algorithm for securities, futures, and other financial transaction systems. In addition, the company offers technical services, such as operational support, system maintenance, network analysis and optimization of a chain of Internet applications, and research study of specific topics on application and network performance. Further, it provides software development services; and sells embedded hardware and APM software. Vixtel Technologies Holdings Limited was founded in 2006 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100085",
        "website": "http://www.vixtel.com",
        "market_cap": 279400000
    },
    "2013.HK": {
        "short_name": "WEIMOB INC",
        "long_name": "Weimob Inc.",
        "summary": "Weimob Inc., an investment holding company, provides cloud-based commerce and marketing solutions in the People's Republic of China. It operates through Subscription Solutions, Merchant Solutions, and Digital Media segments. The Subscription Solutions segment provides cloud-hosted commerce and marketing SaaS products; customised software, such as ERP solutions; and other software related services, as well as WeiMall, Smart Retail, Smart Catering, Smart Hotel, Heading ERP, and others for e-commerce, retail, catering, hotel, local life and other industries. The Merchant Solutions segment offers value-added services for merchants to meet merchants' online digital commerce and marketing needs, including assisting merchants to purchase online advertising traffic in various media platforms. The Digital Media segment provides advertisement placement services for merchants. The company was founded in 2013 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.weimob.com",
        "market_cap": 39640948736
    },
    "300002.SZ": {
        "short_name": "BEIJING ULTRAPOWER",
        "long_name": "Beijing Ultrapower Software Co., Ltd.",
        "summary": "Beijing Ultrapower Software Co., Ltd. engages in the Internet of Things (IOT)/communication technology, artificial intelligence and big data, ICT operation management, and mobile gaming businesses in China and internationally. It offers nuclear communication, perimeter security, and underground space IOT and communication access products that are used in nuclear island and power, smart city, airport, high-speed rail, military, petroleum refining, and other industries. The company also provides Chinese natural language analysis technology products, such as Logic Intelligence 2.0 series products; Radar Risk Management SaaS platform; intelligent semantic industry platform; and Ultrapower Semantic Processing Plant based NPL technology and application. In addition, it offers ICT operation management products for finance, insurance, and government sectors, as well as develops and publishes mobile games. The company has a strategic cooperation agreement with Glory Star New Media Group Holdings Limited to explore the development of various 5G business applications. Beijing Ultrapower Software Co., Ltd. was founded in 2001 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.ultrapower.com.cn",
        "market_cap": 9727006720
    },
    "300020.SZ": {
        "short_name": "ENJOYOR CO LTD",
        "long_name": "Enjoyor Co.,Ltd",
        "summary": "Enjoyor Co.,Ltd provides Internet of Things, cloud computing, big data, artificial intelligence, and blockchain technologies in China. It serves transportation, medical, and other industries. The company is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310030",
        "website": "http://www.enjoyor.net",
        "market_cap": 5475838464
    },
    "300033.SZ": {
        "short_name": "HITHINK ROYALFLUSH",
        "long_name": "Hithink RoyalFlush Information Network Co., Ltd.",
        "summary": "Hithink RoyalFlush Information Network Co., Ltd. provides Internet financial information services in China. The company specializes in financial data processing and information cloud services. It also provides online market trading systems; financial information and data services; mobile financial information services; fund sales; and other products and services. Hithink RoyalFlush Information Network Co., Ltd. is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310023",
        "website": "http://www.10jqka.com.cn",
        "market_cap": 59609088000
    },
    "300044.SZ": {
        "short_name": "SHENZHEN SUNWIN IN",
        "long_name": "Shenzhen Sunwin Intelligent Co., Ltd.",
        "summary": "Shenzhen Sunwin Intelligent Co., Ltd. operates as a smart city and artificial intelligent company in the People's Republic of China. The company primarily offers smart city, big data, artificial intelligence, and cultural and education services. Its smart city services include smart city investment, construction, and operation of integrated service providers; and artificial intelligence services comprise service robots, unmanned aerial vehicle platforms, face recognition, smart video analysis systems, and others. The company also engages in the research, development, distribution, and operation of online mobile games; Internet social platform operation; and creating artificial intelligence and cloud computing solutions through offline and online for entrepreneurship and professional education, as well as offers Internet finance services. Shenzhen Sunwin Intelligent Co., Ltd. was founded in 1997 and is based in Shenzhen, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.szsunwin.com",
        "market_cap": 2330132992
    },
    "300047.SZ": {
        "short_name": "SHENZHEN TIANYUAN",
        "long_name": "Shenzhen Tianyuan DIC Information Technology Co., Ltd.",
        "summary": "Shenzhen Tianyuan DIC Information Technology Co., Ltd. provides products and solutions to the telecommunications, government, financial, and other industries. The company offers cloud-based billing, user abnormal behaviour analysis, application and data security gateway, integrated resource management, cloud network integration design orchestration, wireless network optimization, wireless network big data analysis, sales assistant, subcontracting, data gateway, internet distribution, marketing consultant, sales management, and channel and online operation platform products; and electronic channel operation, precision marketing, and security services to telecommunications industry. It also provides small 6 robot and D pay slip, wind control cloud, digital bank-smart customer, digital bank-business middle office and integrated payment, digital bank-supply chain finance and smart marketing, digital bank-digital retail credit and deposit factory, and digital bank-account system solutions to financial industry. In addition, the company offers smart people's livelihood and housing, smart city management and government, integrated online government, immigration management, customs monitoring and command, personnel information service management, detection and control, intelligent transportation network, traffic guidance release, intelligent traffic control platform, public security traffic integrated command, energy monitoring and management, road construction safety management, and internet information public opinion monitoring system products and solutions to government. Further, it provides business operation guarantee, code marketing and e-commerce platform, power communication GIS management information, construction engineering integrated management, informatization integrated management, property accounting, and enterprise IT directory solutions to other industry, as well as platform products. The company was founded in 1993 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.tydic.com",
        "market_cap": 4489724928
    },
    "300075.SZ": {
        "short_name": "BEIJING EGOVA CO L",
        "long_name": "Beijing eGOVA Co,. Ltd",
        "summary": "Beijing eGOVA Co,. Ltd provides solutions in the digital city management, innovation and social management, intelligent transportation, and safe city fields in China. The company offers products, such as digital core management core business software, digital law enforcement management software, digital 3D real image, urban management information collection and processing, land and resources comprehensive information management software, urban planning management software, and parking software solutions, as well as HD cameras. It also provides consulting and design, IT application and integration, collection and update, operation outsourcing, system operation and maintenance, and management training services. Beijing eGOVA Co,. Ltd was founded in 2001 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100193",
        "website": "http://www.egova.com.cn",
        "market_cap": 5020043264
    },
    "300096.SZ": {
        "short_name": "YLZ INFORMATION TE",
        "long_name": "YLZ Information Technology Co., Ltd",
        "summary": "YLZ Information Technology Co., Ltd provides information services for livelihood industries in China. It provides its solutions in the areas of human resources, social security, health, financial, housing, education, and energy saving and environmental protection industries. The company also offers software and systems products, including enterprise service bus, data integration tools, integrated development tools, embedded architecture, portal integration software, workflow software, smart reporting components, enterprise application architecture, business intelligence systems, and rule engines; and hardware products, such as medical and health service, human resources social security services, financial services, and agricultural service self-service terminals, as well as card readers. In addition, it provides social security and residents health cards, as well as various cloud services; and engineering solution. YLZ Information Technology Co., Ltd is based in Xiamen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "361008",
        "website": "http://www.ylzinfo.com",
        "market_cap": 5078300160
    },
    "300235.SZ": {
        "short_name": "SHENZHEN KINGSUN S",
        "long_name": "Shenzhen Kingsun Science & Technology Co.,Ltd",
        "summary": "Shenzhen Kingsun Science & Technology Co.,Ltd engages in the research and development, production, sale, and service of multimedia and network education software for supporting teachers and students in China. The company's products include English, language, mathematical, early childhood education, and teaching software products, as well as Bruce Wizard products. It also provides professional services. The company was founded in 1993 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.kingsunsoft.com",
        "market_cap": 1797470080
    },
    "300339.SZ": {
        "short_name": "JIANGSU HOPERUN SO",
        "long_name": "Jiangsu Hoperun Software Co., Ltd.",
        "summary": "Jiangsu Hoperun Software Co., Ltd. provides software and IT services in China, Japan, Southeast Asia, North America, and internationally. It offers software solutions in the areas of software lifecycle management, bank resource management, and big data application services. The company's financial IT system products include business hub platform, a platform that provides enterprise level operational capabilities for the banking industry; ICredit Alert Wisdom, an alert system that predicts risk; big data ODS platform; precision marketing recommendation system, a customer centric marketing model; business integration platform; channel integration platform; project asset management and control platform; and events cloud platform. It also provides intelligent trading command system; Internet distributed core; performance monitoring and analysis platform; financial organization based on big data analysis platform; retail marketing management platform; and financial IT core system solution. Jiangsu Hoperun Software Co., Ltd. was founded in 2006 and is headquartered in Nanjing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "210012",
        "website": "http://www.hoperun.com",
        "market_cap": 33640402944
    },
    "300365.SZ": {
        "short_name": "BEIJING FOREVER TE",
        "long_name": "Beijing Forever Technology Co., Ltd.",
        "summary": "Beijing Forever Technology Co., Ltd. provides smart grid solutions and services in the People's Republic of China and internationally. The company offers full life cycle informatization solutions, such as research and development of resource platform, geographic resources platform, and enterprise integrated service platform; electric planning and consultation, and power investigation and surveying solutions; and engineering, procurement, and construction (EPC) solutions for power transmission and transformation. It also provides new energy power generation solutions, including pre-planning, survey, and design, as well as EPC solutions; smart transportation solutions comprising off-site overweight and oversize enforcement, and cloud based overweight and oversized vehicle detecting systems, as well as bridge health monitoring vehicle axle load monitoring subsystem; and traffic survey system. In addition, the company offers electricity sale solutions, including investment and financing, consulting, network construction, professional operation, information technology, and value-added services; water resources and hydropower ICT solutions; mountain flood disaster monitoring and early warning system; unmanned aerial vehicle emergency command and control system; and energy saving and environmental protection solutions. Further, it provides smart conference rooms, online education and training systems, and engineering 3D visualization application solutions; and operates Forever, a cloud service platform that provides informatization products and SaaS services for various industries. The company was founded in 2000 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100011",
        "website": "http://www.ieforever.com",
        "market_cap": 5106161152
    },
    "300379.SZ": {
        "short_name": "BEIJING TONGTECH C",
        "long_name": "Beijing Tongtech Co., Ltd.",
        "summary": "Beijing Tongtech Co., Ltd. provides security solutions in China. It offers communications security, 5G innovation applications, and industrial Internet security products and solutions to help users achieve business innovation, security management, and data sharing and value mining. The company provides middleware products and solutions; and information security, network security, data security, business security, and other products; and support services. Its products and solutions are used in various industries, such as telecommunications, finance, government, energy, transportation and other industries. The company was founded in 1992 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100080",
        "website": "http://www.tongtech.com",
        "market_cap": 8093976064
    },
    "300380.SZ": {
        "short_name": "SHANGHAI AMARSOFT",
        "long_name": "Shanghai Amarsoft Information & Technology Co.,Ltd",
        "summary": "Shanghai Amarsoft Information & Technology Co.,Ltd provides IT solutions to financial and non-financial customers in China. It offers software products, such as credit management, risk management, trust management, P2P online loan, and supply chain financing systems, as well as business consulting, system development and implementation, data services, and other services. In addition, the company provides cloud platform. Shanghai Amarsoft Information & Technology Co.,Ltd is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "300433",
        "website": "http://www.amarsoft.com",
        "market_cap": 2658038528
    },
    "300399.SZ": {
        "short_name": "JIANGXI TIANLI TEC",
        "long_name": "Beijing Tianli Mobile Service Integration, Inc.",
        "summary": "Beijing Tianli Mobile Service Integration, Inc. provides integrated solutions for mobile information systems in China. The company offers mobile information application solutions, including customized development, business integration, operational support, and customer relationship management services, as well as SMS, MMS application, and cloud platform-based mobile information services to large and medium-sized group customers. It also provides Internet finance and insurance services; and software custom development, terminal equipment, operation support, and comprehensive consulting services. Beijing Tianli Mobile Service Integration, Inc. was founded in 2006 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100144",
        "website": "http://www.ihandy.cn",
        "market_cap": 2365272064
    },
    "300465.SZ": {
        "short_name": "GLOBAL INFOTECH CO",
        "long_name": "Global Infotech Co., Ltd.",
        "summary": "Global Infotech Co., Ltd. provides financial information software products and integrated services in China. The company offers EasyLoan credit management, EasyecIF enterprise customer information integration, EasyIBS new core business, EasyPayment bank second generation payment, EasyCMS collateral management, EasyECDS electronic ticket, treasury, insurance e-commerce network direct sales core platform, and life insurance and reinsurance core business systems, as well as Easylink integrated business front-end system. It also provides EasyCRM customer relationship management, credit asset classification, EasyECM imaging platform, internal rating, EasyRWA risk management, financial accounting, EasyALM asset and liability management, performance management, EasyCI enterprise financial analysis, EasyMAIS management accounting, EasyHDI basic data platform, EasyBAS bank data analysis, and EasyASV bank post monitoring systems; fund transfer pricing plan; and EasyMonitor bank system monitoring, and EasyBSM bank sales and customer integrated service platform solutions. In addition, the company offers EasyCard bank card, EasyTERM bank front end, and Easy CMGIS bank channel management information systems; and CAP ESB gao weida enterprise, EasyBPM workflow, and EasyHMFS maintenance fund integrated management systems, as well as EasyWEB page generation and EasyReport reporting platform solutions, and software testing services. Further, it provides data center consulting and planning, integration and implementation, and operation and maintenance services; cloud computing data center IT service management products and solutions; planning consultation, business consulting, and technical consultation services; and system integration, operation and maintenance, and implementation services. The company was founded in 1998 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100016",
        "website": "http://www.git.com.cn",
        "market_cap": 5821308416
    },
    "300520.SZ": {
        "short_name": "GUOCHUANG SOFTWARE",
        "long_name": "GuoChuang Software Co.,Ltd.",
        "summary": "GuoChuang Software Co.,Ltd operates as a software company in China and internationally. It offers software research and development services, including offshore software development, software application development, system integration, and maintenance service for various industries, such as tobacco, telecom, electric power, financing, healthcare, manufacturing, e-commerce, education, retail, etc., as well as governments. The company was founded in 1994 and is based in Hefei, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": "230088",
        "website": "http://www.kdgcsoft.com",
        "market_cap": 5189912064
    },
    "300542.SZ": {
        "short_name": "BRILLIANCE TECHNOL",
        "long_name": "Brilliance Technology Co., Ltd.",
        "summary": "Brilliance Technology Co., Ltd. provides software development, system integration, and professional and technical services in China. The company's software solutions include international business, corporate settlement system, bank settlement system, and bank intermediary business platform solutions; channel integration cloud platform, total cooperation cloud platform, television banking system, online banking system, and call center application platform solutions; and data exchange applications and service products. It also provides IT infrastructure solutions comprising information security system, enterprise network construction, and data center infrastructure solutions; and IT services. The company was founded in 1998 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100097",
        "website": "http://www.brilliance-led.com",
        "market_cap": 3264903168
    },
    "300571.SZ": {
        "short_name": "HANGZHOU ANYSOFT I",
        "long_name": "Hangzhou Anysoft Information Technology Co., Ltd.",
        "summary": "Hangzhou Anysoft Information Technology Co., Ltd. aggregates and provides text and audio-visual content in China. The company provides users with digital reading through PC, smart phone, tablet, e-reader, car, wearable device, and other reading carriers. Its services include online literature, publishing books, magazines, newspapers, radio broadcasts, music and art talks, education and training lectures, etc. The company was founded in 2002 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.anysoft.cn",
        "market_cap": 4347224064
    },
    "300588.SZ": {
        "short_name": "XINJIANG SAILING I",
        "long_name": "Xinjiang Sailing Information Technology Co., Ltd.",
        "summary": "Xinjiang Sailing Information Technology Co., Ltd. engages in the software and information technology services business in China. It offers smart security and safe city solutions; information security solutions, such as business security and public security audit systems; and customs special supervision area informatization solutions. The company also provides training, and ITO and BPO services. It serves public security, finance, insurance, transportation, government, and other industries, as well as enterprises. The company was founded in 1999 and is based in Urumqi, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Urumqi",
        "zipcode": null,
        "website": "http://www.sit.com.cn",
        "market_cap": 2121387264
    },
    "300609.SZ": {
        "short_name": "WINNER TECHNOLOGY",
        "long_name": "Winner Technology Co., Inc.",
        "summary": "Winner Technology Co., Inc. provides video analytic technology solutions in China. The company offers video traffic analytics systems to shopping malls, department stores, exhibition and scenic spots, brand chain stores, and others. The company was formerly known as Winner Information Technology Co., Inc. and changed its name to Winner Technology Co., Inc. in August 2018. Winner Technology Co., Inc. was founded in 2004 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.winnerinf.com",
        "market_cap": 1951971200
    },
    "300634.SZ": {
        "short_name": "RICHINFO TECHNOLOG",
        "long_name": "Richinfo Technology Co., Ltd.",
        "summary": "Richinfo Technology Co., Ltd. provides industrial Internet solutions and technical services in China. It provides cloud platform construction and operation, big data analysis, network monitoring, and mobile application development services. The company also offers color messaging system, color messaging enterprise network disk, multimedia unified office platform, color messaging application performance management system, color communication automation test platform, color data management platform, color message precision marketing intelligent recommendation platform, multimedia integrated marketing resource management platform, color messaging mobile application portal, color media operations management platform, color data big data intelligent analysis platform, color message management platform, color messaging mobile application data insight system, color message mail delivery platform, and multimedia anti-spam security gateway. In addition, it provides industry solutions for operators, financial insurance, government business and organization, electric and energy, enterprise, educational institution, retail and logistics, and education and research industries. The company was formerly known as Shenzhen Richinfo Technology Limited and changed its name to Richinfo Technology Co., Ltd. in June 2016. Richinfo Technology Co., Ltd. was founded in 2004 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.richinfo.cn",
        "market_cap": 5432135680
    },
    "300659.SZ": {
        "short_name": "ZHONGFU INFORMATIO",
        "long_name": "Zhongfu Information Inc.",
        "summary": "Zhongfu Information Inc. provides information security software and hardware products. The company offers protection products, including host protection products that consists of computer and mobile storage media security management systems, host monitoring and auditing systems, print security monitoring and auditing systems, CD burning monitoring and auditing systems, terminal security login systems, storage media information elimination and removal tools, USB mobile storage media usage management systems, keyboard and mouse display switchers, and mobile hard and U disks, as well as cyber security products comprising network security isolation and information one-way import systems, and network access control systems. It also provides inspection products, such as inspection and evidence collection systems, database and terminal security check systems, and email check systems; and password applications and security solutions. The company was founded in 2002 and is based in Jinan, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinan",
        "zipcode": "250101",
        "website": "http://www.zhongfu.net",
        "market_cap": 8863539200
    },
    "300663.SZ": {
        "short_name": "CLIENT SERVICE INT",
        "long_name": "Client Service International, Inc.",
        "summary": "Client Service International, Inc. develops and sells financial software products for high-tech companies in China. The company offers various software solutions for the banking industry; and consulting services. Its products and services include direct Internet banking; financial open platform; e-banking solutions; and online banking security solutions, as well as business series solutions. The company was founded in 1999 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100020",
        "website": "http://www.csii.com.cn",
        "market_cap": 9382628352
    },
    "300678.SZ": {
        "short_name": "CHENGDU INFORMATIO",
        "long_name": "Chengdu Information Technology of The Chinese Academy of Sciences Co., Ltd.",
        "summary": "Chengdu Information Technology of The Chinese Academy of Sciences Co., Ltd. provides intelligent engineering, and related products and technical services to government, tobacco, oil and gas, special printing, and other industries. It offers election equipment and service for party and national conferences; testing equipment for the national printing industry; and intelligent city key technology, platform system, and transportation solutions based on cloud computing, large data, Internet of Things, and mobile Internet for government. The company also provides various solutions for tobacco industry comprising tobacco planting expert analysis system; tobacco leaf digital storage and logistics integrated platform; data collection and intelligent diagnosis and analysis system in cigarette factory; life cycle tracking and management system for cigarette accessories; cigarette research and development information management system; and tobacco logistics park information infrastructure construction solutions. In addition, it offers inspection equipment for banknote printing industry, such as large bill quality inspection machines, banknote printed gravure online detection systems, paper machine online quality inspection systems, cutting quality on line detection systems, and banknote sorting machines; and oil and gas industry information construction solutions, including oil and gas field digital production management solution, as well as integrates electronic logging, automatic collection, real-time monitoring, intelligent defense, management, and scientific command solutions. Chengdu Information Technology of The Chinese Academy of Sciences Co., Ltd. was founded in 1958 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610041",
        "website": "http://www.casit.com.cn",
        "market_cap": 3387599872
    },
    "300682.SZ": {
        "short_name": "LONGSHINE TECHNOLO",
        "long_name": "Longshine Technology Group Co.,Ltd.",
        "summary": "Longshine Technology Group Co., Ltd. provides software and IT services for the power industry in China and internationally. It provides inspection monitoring system of power marketing; billing and customer service system; call center operation management system; LongShine Zeus cloud platform; data visualization platform; data processing platform; IoT acquisition platform; smart city industry Internet open platform; and order merchandise and living payment platforms. It also provides China international trade single window platform, port operation-service and public service platforms, identification service for international trade; new energy vehicle, integrated energy service cloud, EV pile cloud, smart power cloud, government new energy, intelligent parking, smart street light, charging pile management, photovoltaic cloud, and IoT terminal solutions; HanClouds industrial Internet platform; intelligent customer service, self-help intelligence analysis, and relationship network analysis solutions. In addition, the company offers cloud services, such as consulting, planning, and cloud design and implementation services, as well as traditional data center hybrid cloud upgrade and construction services; and intelligent cloud based customer services. The company was formerly known as LongShine Technology Co., Ltd. Longshine Technology Group Co., Ltd. was founded in 2003 and is headquartered in Wuxi, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuxi",
        "zipcode": "214135",
        "website": "http://www.longshine.com",
        "market_cap": 18084210688
    },
    "300773.SZ": {
        "short_name": "LAKALA PAYMENT CO",
        "long_name": "Lakala Payment Co., Ltd.",
        "summary": "Lakala Payment Corporation provides third-party payment and financial technology services in China. The company offers third-party payment, personal payment, merchant receipt, and related derivative services in the form of online/offline and hardware/software. It provides convenient payment, POS receipt, and cross-border payment services; and Internet finance and community e-commerce services to community residents. The company also offers receipt and convenient terminal, and payment bracelet products. It provides value-added services for various industries, such as catering, retail, insurance, education, tourism, etc. The company was founded in 2005 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100080",
        "website": "http://www.lakala.com",
        "market_cap": 24072601600
    },
    "300799.SZ": {
        "short_name": "BEIJING ZUOJIANG T",
        "long_name": "Beijing Zuojiang Technology Co., Ltd.",
        "summary": "Beijing Zuojiang Technology Co., Ltd. engages in the design, research and development, production, and sale of hardware platform and boards related for network information safety applications. It operates through Products Sales; and Subcontracted Research and Development segments. The company's products include secure heterogeneous dual host platforms and secure homogenous dual host platforms. It serves the military sector. The company was founded in 2007 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100095",
        "website": null,
        "market_cap": 5263244800
    },
    "300830.SZ": {
        "short_name": "JINXIANDAI INFORMA",
        "long_name": "JinXianDai Information Industry Co.,Ltd.",
        "summary": "JinXianDai Information Industry Co.,Ltd. develops software products in China. It offers data visualization, mobile application, testing, UED, artificial intelligence, and other software products. The company also provides information solutions and services for various industries, such as power, petrochemical, public security, railway, government, aerospace, communications, coal, and others. It distributes its products in 22 provinces, 5 autonomous regions, and 4 municipalities. JinXianDai Information Industry Co.,Ltd. was founded in 2001 and is based in Jinan, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinan",
        "zipcode": "250101",
        "website": "http://www.jxdinfo.com",
        "market_cap": 4133500928
    },
    "300895.SZ": {
        "short_name": "BEIJING TOPNEW INF",
        "long_name": "Beijing Topnew Info & Tech Co., Ltd.",
        "summary": "Beijing Topnew Info & Tech Co., Ltd. provides Internet data center services, Internet access services, and related value-added services. Its cloud services include Internet access, cloud computing, and cloud video conference services; IT services comprise configuration center and speed WAN services; and network Shield security management systems. The company was founded in 2005 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100061",
        "website": "http://www.topnewinfo.cn",
        "market_cap": 3374562816
    },
    "300935.SZ": {
        "short_name": "BEIJING YJK BUILDI",
        "long_name": "Beijing YJK Building Software Co.,Ltd.",
        "summary": "Beijing YJK Building Software Co.,Ltd. develops and sells building structure design software and consulting services for the construction industry in China and internationally. It offers an integrated building structure auxiliary design system that comprises YJK-A, a building structure calculation module; YJK-F, a basic design module; YJK-M, a masonry structure design module; YJK-D, a structure construction drawing design module; YJK-STS, a steel structure construction drawing design module; YJK-EP, an elastoplastic dynamic time history analysis module; and an interface module. The company was founded in 2010 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100013",
        "website": "http://www.yjk.cn",
        "market_cap": 4694435328
    },
    "36W.F": {
        "short_name": "WEIMOB INC.  DL-,0001",
        "long_name": "Weimob Inc.",
        "summary": "Weimob Inc., an investment holding company, provides cloud-based commerce and marketing solutions in the People's Republic of China. It operates through Subscription Solutions, Merchant Solutions, and Digital Media segments. The Subscription Solutions segment provides cloud-hosted commerce and marketing SaaS products; customised software, such as ERP solutions; and other software related services, as well as WeiMall, Smart Retail, Smart Catering, Smart Hotel, Heading ERP, and others for e-commerce, retail, catering, hotel, local life and other industries. The Merchant Solutions segment offers value-added services for merchants to meet merchants' online digital commerce and marketing needs, including assisting merchants to purchase online advertising traffic in various media platforms. The Digital Media segment provides advertisement placement services for merchants. The company was founded in 2013 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.weimob.com",
        "market_cap": 4293915904
    },
    "600271.SS": {
        "short_name": "AISINO CORPORATION",
        "long_name": "Aisino Corporation",
        "summary": "Aisino Corporation provides information security solutions in China and internationally. The company offers intelligent tax solutions; financial IC cards, and residential health cards; and V70 terminals. It also provides E-ID solutions; intelligent emergency, and warehouse and logistics solutions; national citizen voting fingerprint application solutions; public safety solutions; solutions for government offices; border crossing security monitoring systems; intelligent vehicle management systems; and intelligent asset management solutions. It offers its services to various fields, including finance, education, customs, public security, and urban services. The company was founded in 2000 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100195",
        "website": "http://www.aisino.com",
        "market_cap": 25384044544
    },
    "600289.SS": {
        "short_name": "BRIGHT OCEAN INTER-TELECOM CORP",
        "long_name": "Bright Oceans Inter-Telecom Corporation",
        "summary": "Bright Oceans Inter-Telecom Corporation provides telecommunications and broadcasting network management systems in China and internationally. The company's telecommunications network management systems provide fault management, resource management, performance management, wireless network optimization, electronic operation and maintenance, enterprise information technology (IT) operation and maintenance, generation management, unified collection, and ESB services; and radio and television network management systems comprise integrated supervision system, unified network management system, education management and resource library, and interactive operation O2O platform. It also provides enterprise IT operation support systems; information security products; management support systems for servicing enterprises and the company's fixed assets related to investment planning, budgeting, procurement, contracts, orders, logistics, projects, and project construction; and planning consulting, top-level design, IT infrastructure construction, platform and application development, system integration, and operation services for smart city construction. In addition, the company offers value-added services, such as e-phone card, e-commerce Weijiajia, triple-play integration, and IoT business operator enterprise customer agency; software outsourcing services; and business support products, including procurement, engineering construction, warehouse logistics, and investment plan management systems. It serves telecommunications, transportation, energy, government, finance, press and publication, radio, film and television, and other industries and enterprises. Bright Oceans Inter-Telecom Corporation was founded in 1995 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100093",
        "website": "http://www.boco.com.cn:8080/bocoit/",
        "market_cap": 2208681984
    },
    "600410.SS": {
        "short_name": "BEIJING TEAMSUN TECHNOLOGY CO",
        "long_name": "Beijing Teamsun Technology Co.,Ltd.",
        "summary": "Beijing Teamsun Technology Co.,Ltd. provides enterprise IT products and consulting services. The company offers cloud data center; big data platform; Internet of Things applications; and server services. It serves telecommunication, postal, finance, government, tourism, education, manufacture, energy, transportation, military, and other fields. The company was founded in 1998 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100193",
        "website": "http://www.teamsun.com.cn",
        "market_cap": 8844857344
    },
    "600476.SS": {
        "short_name": "HUNAN COPOTE SCIENCE & TECHNOLO",
        "long_name": "Hunan Copote Science Technology Co.,Ltd.",
        "summary": "Hunan Copote Science Technology Co.,Ltd. provides integrated IT services in the postal industry. The company offers China post vehicle operation control platform, a philatelic platform; China post Internet SMS service platform; satellite positioning intelligent vehicle; smart parcel cabinets; smart mailboxes; financial security intelligent management systems; money transport vehicle monitoring systems; smart travel systems; intelligent mail logistics systems; and bubble counting machines. It also provides Bluetooth electronic scales; network advertising media publishing systems; portable ticket label printers; desktop thermal barcode label printers; electronic surface sheet printers; industrial barcode label printers; document ticket scanners; handheld smart terminals; postage machines; and envelope printers. The company is headquartered in Changsha, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changsha",
        "zipcode": "410205",
        "website": "http://www.copote.com",
        "market_cap": 1728281088
    },
    "600570.SS": {
        "short_name": "HUNDSUN TECHNOLOGIES INC",
        "long_name": "Hundsun Technologies Inc.",
        "summary": "Hundsun Technologies Inc. operates as a financial technology company in the People's Republic of China. The company offers integrated solutions and services to the institutions of securities, futures, funds, trust, insurance, bank, exchange, and private placement. It also provides wealth management tools to individual investors. The company has a strategic partnership with Finastra Group Holdings Limited to develop and launch Fusion Invest, a portfolio management system. Hundsun Technologies Inc. was founded in 1995 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310053",
        "website": "http://www.hundsun.com",
        "market_cap": 92882247680
    },
    "600588.SS": {
        "short_name": "YONYOU NETWORK TECHNOLOGY CO LT",
        "long_name": "Yonyou Network Technology Co., Ltd.",
        "summary": "Yonyou Network Technology Co., Ltd. provides software and cloud services for enterprises and public organizations. The company also offers financial services. It serves large, medium-sized, and small and micro enterprises. The company was formerly known as UFIDA Software Co., Ltd. and changed its name to Yonyou Network Technology Co., Ltd. in January 2015. Yonyou Network Technology Co., Ltd. was founded in 1988 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100094",
        "website": "http://www.yonyou.com",
        "market_cap": 116496277504
    },
    "600718.SS": {
        "short_name": "NEUSOFT CORPORATION",
        "long_name": "Neusoft Corporation",
        "summary": "Neusoft Corporation provides information technology (IT) solutions and services worldwide. The company offers products and platforms, such as TalentBase human capital management system; SkillBase, an e-learning system; group financial management and control system; customer relationship management system; enterprise asset management system; super electronic archive system; business process content management platform; and UniOffice, an office management system. Its products and platforms also include picture archiving and communication software system; digital signage network/system; NetEye security operations center platform; NetPatrol, a network application monitoring and management system; Aclome, a cloud management environment; UniEAP, a unified enterprise application practice application; OpenBASE, a database management system; mobile device management system; navigation system; and rear view assistance system. In addition, it provides engineering services, such as application development and maintenance, ERP consulting and implementation, software globalization and localization, professional testing and performance engineering, and IT infrastructure services; on-demand services, such as Telemedicine, Xikang, and Telematics; and management consultation, business process outsourcing, and IT education and training services. Further, the company develops medical products, such as MRI, digital X-ray, color doppler ultrasound, laboratory automation, radiation therapy, and nuclear medicine imaging equipment, as well as CT scanners; and network security appliances. It serves telecom, energy, FSI, government, manufacturing, trade logistics, healthcare, education, transportation, automotive electronics, mobile terminals, digital home products, IT products, broadcasting and cinema, retail electronics, industrial control, and network security appliance sectors. The company was founded in 1991 and is headquartered in Shenyang, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenyang",
        "zipcode": "110179",
        "website": "http://www.neusoft.com",
        "market_cap": 13119428608
    },
    "600756.SS": {
        "short_name": "INSPUR SOFTWARE CO LTD",
        "long_name": "Inspur Software Co., Ltd.",
        "summary": "Inspur Software Co., Ltd. provides IT products and services in China and internationally. The company offers various servers, including rack servers, multi-node servers, and rack-scale systems; and all-flash and hybrid flash storage solutions. It also provides AI solutions, including AI computing platform, AI resource platform, algorithm toolkit platform, and E2E AI solutions; InCloud Platform that integrates cloud computing, big data infrastructure, and capabilities through an integrated and flexible IaaS + PaaS delivery model; and SAP HANA solutions. In addition, the company offers Inspur Nutanix HCI solutions; HCI solutions based on vSAN technology; nspur Azure Stack HCI solutions; data center and cloud computing solutions; and software outsourcing, and cloud and IT services. Its products and solutions are used in global data center, high performance computing center, tax, education, and government agencies. The company was formerly known as Shandong Inspur Software Co., Ltd. and changed its name to Inspur Software Co., Ltd. in January 2014. The company is headquartered in Jinan, China. Inspur Software Co., Ltd. is a subsidiary of Inspur Group Limited.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinan",
        "zipcode": "250101",
        "website": "http://www.inspur.com",
        "market_cap": 3979935744
    },
    "600845.SS": {
        "short_name": "SHANGHAI BAOSIGHT SOFTWARE",
        "long_name": "Shanghai Baosight Software Co.,Ltd.",
        "summary": "Shanghai Baosight Software Co.,Ltd., a information and automation company, provides industrial solutions in China. The company offers information solutions, including manufacturing execution systems, advanced planning systems, quality management systems, equipment management systems, and logistics management systems; and automation solutions, such as automated solutions for whole metallurgical and automated solutions cold rolling processes, and data acquisition and analysis systems. It also provides process energy-saving solutions; electromechanical equipment comprising marking machines, full-hydrogen bell-type furnaces, and strip steel surface inspection systems; and intelligent manufacturing solutions that include cloud computing, Internet data center, big data, unmanned warehouse, industrial robot, Internet of Things, and car network solutions. The company operates through 12 branches. Shanghai Baosight Software Co.,Ltd. was founded in 1978 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201203",
        "website": "http://www.baosight.com",
        "market_cap": 43424968704
    },
    "603039.SS": {
        "short_name": "SHANGHAI WEAVER NETWORK CO LTD",
        "long_name": "Shanghai Weaver Network Co., Ltd.",
        "summary": "Shanghai Weaver Network Co., Ltd. provides collaborative management software products in China. It offers e-cology, a platform for large and middle size enterprises; e-office, a collaboration platform for SMEs; eteams, a mobile cloud software; and e-mobile/mobile integration platform that enables mobile connectivity. The company serves manufacturing, real estate, software and Internet, financial, electronics, telecommunications, energy and chemical, automotive, media and entertainment, and catering chain industries, as well as textile, shoes, and apparel markets. Shanghai Weaver Network Co., Ltd. was founded in 2001 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201112",
        "website": "http://www.weaver.com.cn",
        "market_cap": 14177574912
    },
    "603160.SS": {
        "short_name": "SHENZHEN GOODIX TECHNOLOGY CO L",
        "long_name": "Shenzhen Goodix Technology Co., Ltd.",
        "summary": "Shenzhen Goodix Technology Co., Ltd. operates as an integrated solution provider for applications based on IC design and software development offering software and hardware semiconductor solutions worldwide. It provides biometric authentication solutions for android devices, IoT applications, and automotive electronics. The company offers microcontrollers; Bluetooth low energy SoC chips; heart rate sensors; audio amplifiers; fingerprint sensors, including in-display fingerprint sensor, live finger detection, invisible fingerprint sensor, covered fingerprint sensor, and fingerprint sensor with hard coating solutions; and touchscreen and touchkey controllers, and mousepad solutions. Its products and solutions are used by various mobile brands, including Huawei, OPPO, vivo, Xiaomi, Samsung, Google, Amazon, Dell, HP, LG, OnePlus, Nokia, ASUS, etc. The company sells its products directly, as well as through agents and distributors to module makers, integrated solution providers, and device manufactures. The company was formerly known as Shenzhen Huiding Technology Co., Ltd. and changed its name to Shenzhen Goodix Technology Co., Ltd. in April 2017. Shenzhen Goodix Technology Co., Ltd. was founded in 2002 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "51800",
        "website": "http://www.goodix.com",
        "market_cap": 58344570880
    },
    "603528.SS": {
        "short_name": "DUOLUN TECHNOLOGY CO LTD",
        "long_name": "DuoLun Technology Corporation Ltd.",
        "summary": "DuoLun Technology Corporation Ltd. develops motor vehicle driver intelligent training, examination, and application systems in China. It offers smart driving test, wisdom driving, smart transportation, smart security, smart public security, and traffic safety solutions. The company was formerly known as Nanjing DuoLun Technology Corporation Ltd. and changed its name to DuoLun Technology Corporation Ltd. in October 2017. DuoLun Technology Corporation Ltd. was founded in 1995 and is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": null,
        "website": "http://www.duoluntech.com",
        "market_cap": 5582302208
    },
    "603533.SS": {
        "short_name": "IREADER TECHNOLOGY CO LTD",
        "long_name": "IReader Technology Co., Ltd.",
        "summary": "IReader Technology Co., Ltd. provides palm reading software for Android and iOS platforms. It operates a mobile reading distribution platform comprising approximately 100 original works, as well as 600 domestic and international copyrights; and offers iReader, a smartbook. The company was founded in 2008 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100024",
        "website": "http://www.zhangyue.com",
        "market_cap": 13333690368
    },
    "603636.SS": {
        "short_name": "LINEWELL SOFTWARE CO LTD",
        "long_name": "Linewell Software Co., Ltd.",
        "summary": "Linewell Software Co., Ltd. engages in the software development and information technology service businesses in China. The company provides big data platforms, intelligent security solutions. It also offers smart government solutions, such as one window accepts cloud platform, power running cloud platform, power matter management system, handling information management system, online service hall, and trusted electronic license sharing service platform; wisdom public security solutions, including car big data platform, intelligent perception big data platform, and wireless terminal information application platform; and wisdom politics systems, such as wisdom political law solution, suit service, executive command center integrated application, and intelligent assistant case handling systems. The company was founded in 2003 and is headquartered in Quanzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Quanzhou",
        "zipcode": null,
        "website": "http://www.linewell.com",
        "market_cap": 5842952704
    },
    "603776.SS": {
        "short_name": "YOUON TECHNOLOGY CO LTD",
        "long_name": "Youon Technology Co.,Ltd",
        "summary": "Youon Technology Co.,Ltd provides green transport services through its Internet of Things technology and data platform. The company provides Wing of the line, a guide to the city green sharing travel service platform, which covers 220 cities, 32,000 shared bicycle service stations, and 800,000 shared bicycles. It also offers cloud service platform, site controller, lock car, public bike, and public bicycle car rental card services. The company was formerly known as Changzhou Youon Public Bicycle System Co., Ltd. and changed its name to Youon Technology Co.,Ltd in March 2018. Youon Technology Co.,Ltd is based in Changzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changzhou",
        "zipcode": "213000",
        "website": "http://www.youonbike.com",
        "market_cap": 3789116160
    },
    "603927.SS": {
        "short_name": "SINOSOFT CO LTD",
        "long_name": "Sinosoft Co.,Ltd",
        "summary": "Sinosoft Co.,Ltd. engages in the research and development of computer software. The company focuses on industry application software development covering application software, supporting software, system integration, and other application levels. It provides its solutions in the areas of property insurance, life insurance, health care, governments, financial sector, and call centers, as well as media, energy, postal, traffic, and civil aviation fields; and discipline inspection, enterprise information, and agent products. The company was founded in 1996 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100190",
        "website": "http://www.sinosoft.com.cn",
        "market_cap": 17816479744
    },
    "688058.SS": {
        "short_name": "BEIJING BAOLANDE SOFTWARE CORPO",
        "long_name": "Beijing Baolande Software Corporation",
        "summary": "Beijing Baolande Software Corporation engages in the research and development, and sale of infrastructure software products in China, Nepal, Pakistan, and internationally. The company offers Web middleware, a HTTP protocol to support the EJB technology; application runtime platform software; application performance management technology, a real-time online monitoring technology; and service availability management platform, which provides proactive detection services for enterprise-class users. It also provides application server software, CORBA transaction middleware, message middleware, cloud management platform, APM, and distributed cache databases. In addition, the company offers BES application server, BES CloudLink, BES VBroker, BES WebGate, BES MQ, BES CacheDB, and other software products, as well as cloud computing technology. It serves telecommunication, financial, insurance, government, energy, and other industries. The company was founded in 2008 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100020",
        "website": "http://www.bessystem.com",
        "market_cap": 3623200000
    },
    "688066.SS": {
        "short_name": "PIESAT INFORMATION TECHNOLOGY C",
        "long_name": "Piesat Information Technology Co., Ltd.",
        "summary": "Piesat Information Technology Co., Ltd. engages in research and application of satellite technology for remote sensing satellite and navigation satellite in China. The company offers pixel information expert (PIE), its flagship software for analyzing remote sensing image and data; and PIE-Map, a development platform that provides map navigation secondary development components, such as navigation cloud services and integrating solutions for the government, army, enterprises, and other clients. It also provides IT project consulting service to national satellite projects and other industries. The company was formerly known as Beijing PIESAT Information Technology Co., Ltd. and changed its name to Piesat Information Technology Co., Ltd. in March 2020. Piesat Information Technology Co., Ltd. was founded in 2008 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100195",
        "website": "http://www.piesat.cn",
        "market_cap": 6870036480
    },
    "688095.SS": {
        "short_name": "FUJIAN FOXIT SOFTWARE DEVELOPME",
        "long_name": "Fujian Foxit Software Development Joint Stock Co.,Ltd",
        "summary": "Fujian Foxit Software Development Joint Stock Co.,Ltd develops PDF electronic document solutions worldwide. The company offers various solutions covering the document life cycle, such as document generation, conversion, display, editing, search, printing, storage, signature, form, protection, and secure distribution management, as well as PDF software development kits and cloud solutions. It serves customers in government and e-government, publishing education library, financial, manufacturing, IT communication, energy and chemical, food and medicine, and law firm sectors. The company was founded in 2001 and is based in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": "350003",
        "website": "http://www.foxitsoftware.cn",
        "market_cap": 13201912832
    },
    "688111.SS": {
        "short_name": "BEIJING KINGSOFT OFFICE SOFTWAR",
        "long_name": "Beijing Kingsoft Office Software, Inc.",
        "summary": "Beijing Kingsoft Office Software, Inc. develops and operates WPS series office software. Its products include WPS Office Pro 2016, WPS mobile office platform, WPS Office personal edition, WPS Office mobile, and Kingsoft power enterprise edition. It serves various clients, including ministry of government affairs, provincial/municipal government agencies, central enterprise, financial sector, steel industry, education industry, and other enterprises. The company is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100085",
        "website": "http://www.wps.cn",
        "market_cap": 193974960128
    },
    "688256.SS": {
        "short_name": "CAMBRICON TECHNOLOGIES CORPORAT",
        "long_name": "Cambricon Technologies Corporation Limited",
        "summary": "Cambricon Technologies Corporation Limited creates core processor chips for various types of intelligent cloud servers, intelligent edge devices, and intelligent terminals. It offers terminal intelligent processor IPs, smart accelerator cards, and edge artificial intelligence acceleration cards; and Cambricon NeuWare, a software development platform for its cloud, edge, and end intelligent processor products. The company was founded in 2016 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100094",
        "website": "http://www.cambricon.com",
        "market_cap": 46855712768
    },
    "688365.SS": {
        "short_name": "HANGZHOU RAYCLOUD TECHNOLOGY CO",
        "long_name": "Hangzhou Raycloud Technology Co., Ltd.",
        "summary": "Hangzhou Raycloud Technology Co., Ltd. operates as an e-commerce software and service technology company. The company offers various products and services that help e-commerce merchants to do business. It provides e-commerce SaaS products and supporting hardware, as well as CRM SMS and operation services. The company's e-commerce SaaS products include super store manager, super express, and other software. Hangzhou Raycloud Technology Co., Ltd. was founded in 2016 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310052",
        "website": "http://www.raycloud.com",
        "market_cap": 7635040256
    },
    "688369.SS": {
        "short_name": "BEIJING SEEYON INTERNET SOFTWAR",
        "long_name": "BeiJing Seeyon Internet Software Corp.",
        "summary": "BeiJing Seeyon Internet Software Corp. provides collaborative management software, solutions, and cloud services for organizational customers in China. It offers universal solutions covering process management, knowledge management, group control, portal management, and system integration; and business application solutions comprising cost budget, human resource, project, fixed asset, office equipment, procurement, document, conference, and sales management. The company also provides automotive, retail, IT service, clothing manufacturing, electronic, steel, food, pharmaceutical, and instrumentation industry solutions. In addition, it offers support services. The company was founded in 2002 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100195",
        "website": "http://www.seeyon.com",
        "market_cap": 5376953344
    },
    "688579.SS": {
        "short_name": "DAREWAY SOFTWARE CO LTD",
        "long_name": "Dareway Software Co.,Ltd.",
        "summary": "Dareway Software Co.,Ltd. develops and offers software solution for human resources, social security, industrial, and smart power application. The company offers energy management, power consumption information, electricity demand management, and power quality management software. It also offers insurance, labor employment, public service, data exchange, decision support, information management, big data management, database disaster recovery and backup, IT quality service management, and database performance analysis solutions. It also offers system integration services. Dareway Software Co.,Ltd. was founded in 1992 and is based in Jinan, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinan",
        "zipcode": "250100",
        "website": "http://www.dareway.com.cn",
        "market_cap": 5496137216
    },
    "688588.SS": {
        "short_name": "LINKAGE SOFTWARE CO LTD",
        "long_name": "Linkage Software Co., LTD",
        "summary": "Linkage Software Co., LTD offers financial software outsourcing services for domestic securities industry. The company's software is used for the implementation of the line items, which includes micro-credit financing platform for online brokerage, data mining solutions, real-time big data solutions, public equity raised platform and integrated financial services platform solutions, business related to the field of Internet banking, mobile data terminals, big data analytics, and trading and other pages. It also offers software development services. Linkage Software Co., LTD was founded in 2003 and is based in Suzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215028",
        "website": "http://www.linkstec.com",
        "market_cap": 7484186624
    },
    "79S.F": {
        "short_name": "SINOSOFT TECH.GRP HD -,01",
        "long_name": "Sinosoft Technology Group Limited",
        "summary": "Sinosoft Technology Group Limited, an investment holding company, provides software development and system integration services, and sales of related computer products in the People's Republic of China. It operates through four segments: Export Enterprise Cloud-Based Software and Services, Low Carbon & Ecology Software and Related Services, Government Big Data Software and Related Services, and System Integration Solutions. The company offers export tax rebate filing management systems, invoices-matching and management systems, customs taxation certificates management systems, and value-added services for export tax rebate. It also provides e-government solutions and products that are used by government agencies at various administrative levels, including the ministerial, provincial, municipal, and district levels. In addition, the company offers carbon management solutions that enable government agencies and enterprises to audit, calculate, and control their greenhouse gas emissions and energy consumption. Further, it provides system integration solutions to government agencies, including information systems consultation and feasibility analysis; sourcing of systems and equipment; LAN and web-based network design and implementation; analysis, planning, and design of integrated wiring and network systems; design and implementation of video conferencing and multimedia education systems; and system management and supervision, as well as services comprising system architectures, intuitive graphical and multimedia user interfaces, web services, and other Internet technologies. Additionally, the company sells computer products; offers related services; provides investment and advisory services; and holds properties. Sinosoft Technology Group Limited was incorporated in 2011 and is headquartered in Nanjing, China.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": null,
        "website": "http://www.sinosoft-technology.com",
        "market_cap": 199942384
    },
    "8255.HK": {
        "short_name": "CHINA BINARY",
        "long_name": "China Binary New Fintech Group",
        "summary": "China Binary New Fintech Group, an investment holding company, provides online transaction and software technology services in the People's Republic of China. The company operates through Online Transaction Services; Software Technology Services; and Financial Services segments. It facilitates transactions between online game operators and online game users; offers mobile top-up services to mobile subscribers, as well as micro financing facilitating services, including loan introduction, credit review, repayment reminder, and fund collection services; and sales of smart hardware products. The company also offers banking services, such as payment collection and remittance, deposits, foreign exchange, and global investment management. In addition, it distributes online game products; designs and develops tailor made cryptocurrencies trading platform systems; and provides consulting and technical support services. The company was formerly known as China Binary Sale Technology Limited and changed its name to China Binary New Fintech Group in July 2018. China Binary New Fintech Group was founded in 2004 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.shenzhoufu.hk",
        "market_cap": 86400000
    },
    "900926.SS": {
        "short_name": "SHANGHAI BAOSIGHT SOFTWARE",
        "long_name": "Shanghai Baosight Software Co.,Ltd.",
        "summary": "Shanghai Baosight Software Co.,Ltd., a information and automation company, provides industrial solutions in China. The company offers information solutions, including manufacturing execution systems, advanced planning systems, quality management systems, equipment management systems, and logistics management systems; and automation solutions, such as automated solutions for whole metallurgical and automated solutions cold rolling processes, and data acquisition and analysis systems. It also provides process energy-saving solutions; electromechanical equipment comprising marking machines, full-hydrogen bell-type furnaces, and strip steel surface inspection systems; and intelligent manufacturing solutions that include cloud computing, Internet data center, big data, unmanned warehouse, industrial robot, Internet of Things, and car network solutions. The company operates through 12 branches. Shanghai Baosight Software Co.,Ltd. was founded in 1978 and is headquartered in Shanghai, China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201203",
        "website": "http://www.baosight.com",
        "market_cap": 46455693312
    },
    "9600.HK": {
        "short_name": "NEWLINK TECH",
        "long_name": "Newlink Technology Inc.",
        "summary": "Newlink Technology Inc., an investment holding company, big data and artificial intelligence related solutions in the People's Republic of China. The company operates through three segments: Financial Institution, Medical Institution, and Other. It offers software development, and technical and maintenance services, as well as sells standard software products. The company also provides over-the-counter bond bookkeeping system; and RPA platform solutions. In addition, its solutions include distribution trading platform; medical quality control and safety warning system; clinical pathway management system; intelligent healthcare platform; and telemedicine solutions. The company serves banks, trust companies, asset management companies, other financial institutions, hospitals, and other customers. Newlink Technology Inc. was founded in 2011 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100083",
        "website": "http://www.xnewtech.com",
        "market_cap": 1624000000
    },
    "9911.HK": {
        "short_name": "NEWBORNTOWN",
        "long_name": "Newborn Town Inc.",
        "summary": "Newborn Town Inc., an investment holding company, operates as a mobile applications developer and mobile advertising platform services provider based on AI technologies worldwide. The company provides live streaming services through social networking platform; and mobile marketing and advertising services through various mobile applications. It also offers Solo X product matrix; Solo Math, a programmatic mobile advertising platform; and Solo Aware, an artificial intelligence (AI) engine. The company was founded in 2009 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.newborntown.com",
        "market_cap": 6971973120
    },
    "9J4.F": {
        "short_name": "QUHUO LTD  SP.ADR/1 CL.A",
        "long_name": "Quhuo Limited",
        "summary": "Quhuo Limited, through its subsidiaries, operates a workforce operational solution platform in the People's Republic of China. The company provides tech-enabled operational solutions to blue-chip on-demand consumer service businesses in industries with e-commerce exposure, including food delivery, ride-hailing, housekeeping, and bike-sharing. It offers on-demand food delivery solutions for industry customers; ride hailing solutions for ride-hailing company; housekeeping solutions for long-term housing rental service providers; and shared-bike maintenance solutions to address the demand for maintenance and distribution services from bike-sharing companies. Quhuo Limited was founded in 2012 and is based in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.quhuo.cn",
        "market_cap": 212955184
    },
    "API": {
        "short_name": "Agora, Inc.",
        "long_name": "Agora, Inc.",
        "summary": "Agora, Inc. provides Real-Time Engagement Platform-as-a-Service (RTE-PaaS) in the People's Republic of China, the United States, and internationally. Its RTE-PaaS offers developers with software tools to embed real-time video, voice, and messaging functionalities into applications. The company's enterprise-grade products include Real-Time Video, Real-Time Voice, Live Interactive Video and Audio Streaming, Real-Time Messaging, Real-Time Recording, Real-Time Streaming Acceleration, Agora Analytics, and various use case products that serves as building blocks for developers to embed the respective functions in applications. Its real-time engagement products are delivered through its Software-Defined Real-Time Network, which is a virtual network overlay on top of the public internet. The company offers its solutions in the areas of social, education, entertainment, gaming, e-commerce, financial Services, and healthcare, as well as provides customer support services. Agora, Inc. was founded in 2013 and is headquartered in Shanghai, China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.agora.io",
        "market_cap": 4726377984
    },
    "BRQS": {
        "short_name": "Borqs Technologies, Inc.",
        "long_name": "Borqs Technologies, Inc.",
        "summary": "Borqs Technologies, Inc., through its subsidiaries, focuses on software, development services, and products that provides Android-based smart connected devices and cloud service solutions in China, India, the United States, and internationally. The company offers commercial grade Android platform software and service solutions to address vertical market segment needs through the targeted BorqsWare software platform solutions. Its BorqsWare software platform consists of BorqsWare Client software that has been used in Android phones, tablets, watches, and various Internet-of-things devices; and BorqsWare Server software platform that includes back-end server software that allows customers to develop their own mobile end-to-end services for their devices. The company primarily serves mobile chipset manufacturers, mobile device original equipment manufacturers, and mobile operators, as well as product solutions of mobile connected devices for enterprise and consumer applications. Borqs Technologies, Inc. was founded in 2007 and is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100016",
        "website": "http://www.borqs.com",
        "market_cap": 80751392
    },
    "C7D.F": {
        "short_name": "CHANJET INFO.TECHN.-H-YC1",
        "long_name": "Chanjet Information Technology Company Limited",
        "summary": "Chanjet Information Technology Company Limited provides cloud services and software to micro and small scale enterprises in Mainland China. The company offers cloud services, including Chanjet Good Accountant, a cloud financial application; T+ Cloud enterprise management services; Chanjet Good Business that provides WeChat sharing and operation of store, product, and activity marketing of mobile phone stores; and Chanjet Easy Accounting Agent. It is also involved in the technical development, consulting, transfer, service, and training of computer software, hardware, and external devices; sale of typing paper, computer consumables, computer software, and hardware and external devices; provision of database services and information services of the second category value-added telecom business; and design, manufacturing, agency, and publication of advertisements. The company was formerly known as Chanjet Software Company Limited. Chanjet Information Technology Company Limited was founded in 2005 and is headquartered in Beijing, China. Chanjet Information Technology Company Limited is a subsidiary of Yonyou Network Technology Co., Ltd.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.chanjet.com",
        "market_cap": 485736736
    },
    "CIH": {
        "short_name": "China Index Holdings Limited - ",
        "long_name": "China Index Holdings Limited",
        "summary": "China Index Holdings Limited operates a real estate information and analytics service platform in China. The company offers promotion services, including number of online and offline themed campaigns, industry forums, periodic updates, and online promotions to its customers to promote their brands. It provides listing services comprising commercial property listing and agent services for commercial properties; access and analytics tools, including appraisal and rating, and land modules, based on proprietary database of commercial real estate information; customized research reports; and data monitoring and survey services. The company serves real estate developers, commercial banks and other financial institutions, academic institutions, property managers, brokers, agents, consultants, and other participants in real estate related business. The company was formerly known as Selovo Investments Limited and changed its name to China Index Holdings Limited. China Index Holdings Limited was founded in 2007 and is based in Beijing, China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100070",
        "website": "http://www.chinaindexholdings.com",
        "market_cap": 204409184
    },
    "CMCM": {
        "short_name": "Cheetah Mobile Inc.",
        "long_name": "Cheetah Mobile Inc.",
        "summary": "Cheetah Mobile Inc. operates as a mobile Internet company worldwide. The company's utility products include Clean Master, a junk file cleaning, memory boosting, and privacy protection tool for mobile devices; Security Master, an anti-virus and security application for mobile devices; Battery Doctor, a power optimization tool for mobile devices; Cheetah Browser, a Web browser for PCs and mobile devices; CM Browser, a mobile browser to protect users from malicious threats; and CM Launcher, which provides personalized experience in using smart phones. Its utility products also comprise Cheetah Keyboard, an artificial intelligence (AI)-enabled application; Photo Grid, a photo collage application for mobile devices; CM Locker, a lock screen with notifications and security; Duba Anti-virus, an Internet security application for PC and mobile devices; and SafeWallet, a mobile digital wallet. In addition, the company offers Live.me, a live video streaming application; and Cheez, an interactive short video application. Further, it provides mobile games comprising Piano Tiles 2, Rolling Sky, Dancing Line, Arrow.io, Tap Tap Fish, Tap Tap Dash, and Bricks n Balls; and Cheetah Voicepod, an AI-based smart speaker; Cheetah Translator, a portable hand-held voice translation device; and Cheetah GreetBot, a reception robot. Additionally, the company offers mobile advertising publisher services; duba.com personal start page that aggregates online resources and provides users access to their online destinations; and cloud-based data analytics engines. It serves direct advertisers that include mobile application developers, mobile game developers, and e-commerce companies, as well as search engines and partnering mobile advertising networks. The company was formerly known as Kingsoft Internet Software Holdings Limited and changed its name to Cheetah Mobile Inc. in March 2014. Cheetah Mobile Inc. was incorporated in 2009 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100123",
        "website": "http://www.cmcm.com",
        "market_cap": 293937440
    },
    "CT7A.F": {
        "short_name": "COOTEK CAYM. SP.ADR/50 A",
        "long_name": "CooTek (Cayman) Inc.",
        "summary": "CooTek (Cayman) Inc. operates as a mobile internet company in the United States, the People's Republic of China, the United States, and internationally. Its primary product is TouchPal Smart Input, an input method for mobile devices that supports approximately 110 languages. The company also offers Fengdu Novel, a mobile application that provides users with free online novels; Fengdu Audiobooks; and short video series based on Fengdu Literature Platform content and IP resources. In addition, it provides casual games, including simulation games, such as Farm Hero and Idle Land King Tycoon; puzzle games comprising Hi Hamster; and educational games, such as Puzzle No. 1 and Idiom Hero. Further, the company offers fitness applications comprising Walk Walk; Drink Water Reminder that helps users drink an appropriate amount of water on a daily basis; Happy Jogging, a free pedometer mobile application; and Hailaidian, a mobile application that provides pictures, videos, and music to decorate the call interface and help users have fun when receiving phone calls. It distributes its products and acquires users primarily through user downloads from digital distribution platforms and pre-installations on mobile devices. CooTek (Cayman) Inc. was founded in 2008 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201101",
        "website": "http://www.cootek.com",
        "market_cap": 100961016
    },
    "CTK": {
        "short_name": "CooTek (Cayman) Inc.",
        "long_name": "CooTek (Cayman) Inc.",
        "summary": "CooTek (Cayman) Inc. operates as a mobile internet company in the United States, the People's Republic of China, the United States, and internationally. Its primary product is TouchPal Smart Input, an input method for mobile devices that supports approximately 110 languages. The company also offers Fengdu Novel, a mobile application that provides users with free online novels; Fengdu Audiobooks; and short video series based on Fengdu Literature Platform content and IP resources. In addition, it provides casual games, including simulation games, such as Farm Hero and Idle Land King Tycoon; puzzle games comprising Hi Hamster; and educational games such as, Puzzle No. 1 and Idiom Hero. Further, the company offers fitness applications comprising Walk Walk; Drink Water Reminder that helps users drink an appropriate amount of water on a daily basis; Happy Jogging, a free pedometer mobile application; and Hailaidian, a mobile application that provides pictures, videos, and music to decorate the call interface and help users have fun when receiving phone calls. It distributes its products and acquires users primarily through user downloads from digital distribution platforms and pre-installations on mobile devices. CooTek (Cayman) Inc. was founded in 2008 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201101",
        "website": "http://www.cootek.com",
        "market_cap": 120805176
    },
    "FIGM": {
        "short_name": "FUTURE INTERNATIONAL GROUP CORP",
        "long_name": "Future International Group Corp.",
        "summary": "As of March 29, 2019,  operates as a subsidiary of Hillhouse Shareholding Group Co.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.pacmanmedia.net",
        "market_cap": 720000000
    },
    "FTFT": {
        "short_name": "Future FinTech Group Inc.",
        "long_name": "Future FinTech Group Inc.",
        "summary": "Future FinTech Group Inc., through its subsidiaries, operates a real-name block chain e-commerce platform that integrates block chain and internet technology in People's Republic of China. It operates through CCM Shopping Mall Membership, Sales of Goods, and Others segments. The company offers Chain Cloud Mall (CCM), an enterprise customer interactive and comprehensive shopping and sales service platform; NONOGIRL, a cross-border e-commerce platform; and DCON, a block chain-based application incubator and a digital payment system. It also engages in the development of block chain-based e-commerce and financial technology; and provides technical services and support for real name and blockchain based assets. The company was formerly known as SkyPeople Fruit Juice, Inc. and changed its name to Future FinTech Group Inc. in June 2017. Future FinTech Group Inc. is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NCM",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.ftftex.com",
        "market_cap": 213747584
    },
    "IFBD": {
        "short_name": "Infobird Co., Ltd",
        "long_name": "Infobird Co., Ltd",
        "summary": "Infobird Co., Ltd operates as a software-as-a-service (SaaS) provider of artificial intelligence (AI) enabled customer engagement solutions in the People's Republic of China. It offers standard and customized customer relationship management cloud-based services, such as SaaS, and business process outsourcing services to its clients. The company also provides AI-powered cloud-based sales force management software, including intelligent quality inspection and intelligent training software to enable its clients monitor, benchmark, and improve the performances of agents; and other services, including software license selling, data analysis, and other professional services. It serves companies and organizations, primarily in the finance, education, public services, healthcare, and consumer products industries. The company was incorporated in 2020 and is based in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://www.infobird.com",
        "market_cap": 106302504
    },
    "IICN": {
        "short_name": "CHINA INTELLIGENCE INFORMATION ",
        "long_name": "China Intelligence Information Systems, Inc.",
        "summary": "China Intelligence Information Systems, Inc. develops and provides virtualization and cloud computing solutions and services in China. It offers virtualization technology related hardware products, software products, and services. The company develops and promotes server virtualization technology; and offers virtual desktop infrastructures, disaster tolerance backup and management technology under virtualization infrastructure, information technology outsourcing services of virtualization products and technology, and info-security storage products. It is also involved in the development and promotion of cloud computing platform; and provision of cloud computing products and consultation, and solution services for large-scale enterprises and government departments, as well as cloud computing services for SME and individuals. The company was formerly known as China VoIP & Digital Telecom Inc. and changed its name to China Intelligence Information Systems, Inc. in November 2010. China Intelligence Information Systems, Inc. was founded in 2001 and is based in Jinan, China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Jinan",
        "zipcode": "250101",
        "website": null,
        "market_cap": 2693780
    },
    "JFU": {
        "short_name": "9F Inc.",
        "long_name": "9F Inc.",
        "summary": "9F Inc., together with its subsidiaries, operates a digital financial account platform that integrates and personalizes financial services in the People's Republic of China. Its products include digital financial accounts that offer online lending, online wealth management, and payment facilitation services; revolving and non-revolving loan products to borrowers, as well as traffic referral services to institutional funding partners; and a suite of online wealth management products, such as fixed income products, stocks, insurance, and mutual funds to investors in various platforms, including Wukong Licai, 9F Wallet, and 9F Puhui. The company also provides payment facilitation and other products and services that help users to pay credit card bills and household bills, such as utility bills; and other value-added services, including credit history search, debt consolidation, and user referral services. It has partnerships with borrowers, investors, financial institutions, and merchant partners. The company was formerly known as JIUFU Financial Technology Service Limited and changed its name to 9F Inc. in June 2014. 9F Inc. was founded in 2006 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://www.9fgroup.com",
        "market_cap": 265460128
    },
    "JG": {
        "short_name": "Aurora Mobile Limited",
        "long_name": "Aurora Mobile Limited",
        "summary": "Aurora Mobile Limited, through its subsidiaries, provides mobile big data solutions platform in the People's Republic of China. The company offers targeted marketing, market intelligence, financial risk management, and location-based intelligence services. Its developer services provide core in-app functionalities needed by developers, including push notification, instant messaging, analytics, sharing, short message service, verification, and device connection. The company also provides application programming interfaces that create connectivity and automate the process of message exchange between the mobile apps and its backend network; and an interactive web-based service dashboard that allows app developers to utilize and monitor its services through controls on an ongoing basis. It primarily serves mobile app developers in a range of industries, such as media, entertainment, gaming, financial services, tourism, ecommerce, education, and healthcare. The company was founded in 2011 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.jiguang.cn",
        "market_cap": 416232896
    },
    "KC": {
        "short_name": "Kingsoft Cloud Holdings Limited",
        "long_name": "Kingsoft Cloud Holdings Limited",
        "summary": "Kingsoft Cloud Holdings Limited provides cloud services to businesses and organizations in China. The company offers public cloud services to customers in various verticals, including game, video, AI, e-commerce, education, and mobile internet; enterprise cloud services to customers in financial service, public service, and healthcare businesses among others. It also provides IoTÂ\u0096 smart living solutions. The company was incorporated in 2012 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100085",
        "website": "http://www.ksyun.com",
        "market_cap": 9808390144
    },
    "KDIC.F": {
        "short_name": "KINGDEE ITL SOFTW.G.SUBD.",
        "long_name": "Kingdee International Software Group Company Limited",
        "summary": "Kingdee International Software Group Company Limited, an investment holding company, engages in enterprise resource planning business. The company operates through ERP Business, Cloud Services Business, and Investment Properties Operating Business segments. The ERP Business segment sells software and hardware products; and provides software solution consulting, maintenance, upgrade, and other supporting services, as well as software implementation services. The Cloud Services Business segment provides enterprise, finance, industry, and other cloud services. The Investment Properties Operating Business segment invests in properties. The company also develops, designs, manufactures, and sells hardware products; provides software-related and online financial services; and develops Internet and online pay technologies. It serves enterprises, government agencies, and other organizations worldwide. Kingdee International Software Group Company Limited was founded in 1991 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.kingdee.com",
        "market_cap": 10326635520
    },
    "KDID.F": {
        "short_name": "SINO BIOPHA  UNS.ADR/100",
        "long_name": "Kingdee International Software Group Company Limited",
        "summary": "Kingdee International Software Group Company Limited, an investment holding company, engages in enterprise resource planning business. The company operates through ERP Business, Cloud Services Business, and Investment Properties Operating Business segments. The ERP Business segment sells software and hardware products; and provides software solution consulting, maintenance, upgrade, and other supporting services, as well as software implementation services. The Cloud Services Business segment provides enterprise, finance, industry, and other cloud services. The Investment Properties Operating Business segment invests in properties. The company also develops, designs, manufactures, and sells hardware products; provides software-related and online financial services; and develops Internet and online pay technologies. It serves enterprises, government agencies, and other organizations worldwide. Kingdee International Software Group Company Limited was founded in 1991 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.kingdee.com",
        "market_cap": 10364589056
    },
    "KGDEY": {
        "short_name": "KINGDEE INTL SOFTWARE GROUP",
        "long_name": "Kingdee International Software Group Company Limited",
        "summary": "Kingdee International Software Group Company Limited, an investment holding company, engages in enterprise resource planning business. The company operates through ERP Business, Cloud Services Business, and Investment Properties Operating Business segments. The ERP Business segment sells software and hardware products; and provides software solution consulting, maintenance, upgrade, and other supporting services, as well as software implementation services. The Cloud Services Business segment provides enterprise, finance, industry, and other cloud services. The Investment Properties Operating Business segment invests in properties. The company also develops, designs, manufactures, and sells hardware products; provides software-related and online financial services; and develops Internet and online pay technologies. It serves enterprises, government agencies, and other organizations worldwide. Kingdee International Software Group Company Limited was founded in 1991 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.kingdee.com",
        "market_cap": 10285533184
    },
    "MTC": {
        "short_name": "MMTec, Inc.",
        "long_name": "Mmtec, Inc.",
        "summary": "Mmtec, Inc. develops and deploys platforms that enable financial institutions to engage in securities market transactions and settlements in the People's Republic of China. It offers Internet-based securities solutions comprising Securities Dealers Trading System, which includes securities registration and clearing, account management, risk management, trading and execution, and third party access middleware; Private Fund Investment Management System that supports multi-account management, fund valuation, risk management, quantitative trading access, liquidation, and requisition management; and Mobile Transaction Individual Client System and PC Client System for Apple IOS, Android, PC, and Web. The company enables its customers to white label its trading interface, as well as select modular functionalities. It serves hedge funds, mutual funds, registered investment advisors, proprietary trading groups, and brokerage firms. The company was founded in 2015 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100020",
        "website": "http://www.51mm.com",
        "market_cap": 46472000
    },
    "NNT.AX": {
        "short_name": "99 LOYALTY LTD",
        "long_name": "99 Loyalty Limited",
        "summary": "99 Technology Limited, an investment holding company, provides customer engagement technology and solutions in the People's Republic of China. The company offers mobile solutions platform, including 99 Marketplace that offers virtual products, applications, lifestyle entertainments, marketing services, platform operations, and O2O solutions for banks and other big institutions; business procurement tools; integrated marketing solutions that provides various offline to online marketing solutions and tools; and loyalty management and solutions. It also provides cloud delivered solutions platform, such as business development platform for insurance sector, rewards redemption services, employee benefit services, and insurance brokerage services to business partners and their consumers and employees. The company was formerly known as 99 Wuxian Limited and changed its name to 99 Technology Limited in April 2020. 99 Technology Limited was founded in 2011 and is headquartered in Shanghai, China.",
        "currency": "AUD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "ASX",
        "market": "au_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200023",
        "website": "http://www.99tech.com",
        "market_cap": 78858248
    },
    "OCFT": {
        "short_name": "OneConnect Financial Technology",
        "long_name": "OneConnect Financial Technology Co., Ltd.",
        "summary": "OneConnect Financial Technology Co., Ltd. provides cloud-platform-based Fintech solutions, and online information and operating support services for financial institutions in the People's Republic of China. It offers digital retail banking, small and medium enterprises (SME) financing and services, retail and SME banking risk-management, auto insurance operations and services, asset management, asset-liability management, artificial intelligence customer service, core systems, and insurance sales management solutions. The company also operates Regtech, an end-to-end regulatory solution to help regulatory authorities automate and digitalize their operations; Gamma O, an open API platform-as-a-service for reusable financial technology components and integrations; and Blockchain network-as-a-service. In addition, it provides technology infrastructure, such as data management and cloud services. The company serves customers in the financial services industry, including banking, insurance, and asset management. OneConnect Financial Technology Co., Ltd. was founded in 2015 and is headquartered in Shenzhen, the People's Republic of China. OneConnect Financial Technology Co., Ltd. has a strategic agreement with the Hainan Local Financial Supervision Administration to develop smart financial and smart supervision services in the island province of Hainan, as well as the financial sector in Hainan free trade port. OneConnect Financial Technology Co., Ltd. operates as a subsidiary of Ping An Insurance (Group) Company of China, Ltd.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.ocft.com",
        "market_cap": 5568880128
    },
    "P9F1.F": {
        "short_name": "FUTURE FINTECH GRP",
        "long_name": "Future FinTech Group Inc.",
        "summary": "Future FinTech Group Inc., through its subsidiaries, operates a real-name block chain e-commerce platform that integrates block chain and internet technology in People's Republic of China. It operates through CCM Shopping Mall Membership, Sales of Goods, and Others segments. The company offers Chain Cloud Mall (CCM), an enterprise customer interactive and comprehensive shopping and sales service platform; NONOGIRL, a cross-border e-commerce platform; and DCON, a block chain-based application incubator and a digital payment system. It also engages in the development of block chain-based e-commerce and financial technology; and provides technical services and support for real name and blockchain based assets. The company was formerly known as SkyPeople Fruit Juice, Inc. and changed its name to Future FinTech Group Inc. in June 2017. Future FinTech Group Inc. is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.ftftex.com",
        "market_cap": 194751856
    },
    "PBTS": {
        "short_name": "Powerbridge Technologies Co., L",
        "long_name": "Powerbridge Technologies Co., Ltd.",
        "summary": "Powerbridge Technologies Co., Ltd. provides software application and technology solutions and services primarily in China. The company offers Powerbridge System Solutions, which include Trade Enterprise and Trade Compliance, as well as Import & Export Loan and Insurance Processing for customers to streamline their trade operations, trade logistics, and regulatory compliance. It also provides Powerbridge Software-as-a-Service solutions, which include Logistics Service Cloud and Trade Zone Operations Cloud, as well as Inward Processed Manufacturing Cloud, Cross-Border eCommerce Cloud, and Import & Export Loan and Insurance Processing Service Cloud; and Powerbridge Blockchain-as-a-Service that comprise Compliance Blockchain Services and Supply Chain Blockchain Services. The company serves international trade businesses and manufacturers, government agencies and authorities, and logistics service and other providers. It sells its solutions and services through its direct sales organization, indirect channel partners, and strategic government partners. Powerbridge Technologies Co., Ltd. was founded in 1997 and is headquartered in Zhuhai, China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Zhuhai",
        "zipcode": "519080",
        "website": "http://www.powerbridge.com",
        "market_cap": 55341932
    },
    "QH": {
        "short_name": "Quhuo Limited - American Deposi",
        "long_name": "Quhuo Limited",
        "summary": "Quhuo Limited, through its subsidiaries, operates a workforce operational solution platform in the People's Republic of China. The company provides tech-enabled and end-to-end operational solutions to blue-chip on-demand consumer service businesses in industries with e-commerce exposure, including delivery, ride-hailing, housekeeping, and bike-sharing. It also offers on-demand delivery solutions for industry customers with focus on items, such as grocery, and prepared and fresh food; ride hailing solutions for ride-hailing companies; housekeeping solutions and other services for short-term rental properties and hotel cleaning services; and shared-bike maintenance solutions to address the demand for maintenance and distribution services from bike-sharing companies. In addition, the company develops computer software and applications. Quhuo Limited was founded in 2012 and is based in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NGM",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100020",
        "website": "http://www.quhuo.cn",
        "market_cap": 220580848
    },
    "RAAS": {
        "short_name": "Cloopen Group Holding Limited",
        "long_name": "Cloopen Group Holding Limited",
        "summary": "Cloopen Group Holding Limited, through its subsidiaries, provides cloud-based communications solutions in the People's Republic of China. The company offers a suite of cloud-based communications solutions, which include communications platform as a service, cloud-based contact centers, and cloud-based unified communications and collaborations. It serves a customer base consisting of enterprises of various industries, including internet, telecommunications, financial services, education, industrial manufacturing, and energy. The company was founded in 2012 and is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.yuntongxun.com",
        "market_cap": 1532913536
    },
    "SPOM": {
        "short_name": "SPO GLOBAL INC",
        "long_name": "SPO Global Inc.",
        "summary": "Gerpang Healthcare Group operates as a bio-pharmaceutical company that manufactures and sells genetic coating stents, HBV hepatitis B virus vaccines, monoclonal antibodies for male infertility detection, ognitive disorder functional food, and polypeptide probiotics. The company was founded in 2006 and is based in Jinan, China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Jinan",
        "zipcode": null,
        "website": "http://www.gerpanghealthcare.com",
        "market_cap": 65141
    },
    "TAQR": {
        "short_name": "TRAQER CORP",
        "long_name": "Traqer Corp.",
        "summary": "Traqer Corp. researches, develops, and sells building material in the People's Republic of China. The company offers decoration-free wall materials and precast walls manufactured from recycled solid wastes. Its products include core-filled wall mortised concrete blocks, decorative mortised concrete blocks, antique-style narrow bricks, and squeeze-type building mortars. The company serves governments, construction and real estate companies, and households. Traqer Corp. is based in Guangzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510145",
        "website": null,
        "market_cap": 1161895552
    },
    "WEMXF": {
        "short_name": "WEIMOB INC",
        "long_name": "Weimob Inc.",
        "summary": "Weimob Inc., an investment holding company, provides cloud-based commerce and marketing solutions in the People's Republic of China. It operates through Subscription Solutions, Merchant Solutions, and Digital Media segments. The Subscription Solutions segment provides cloud-hosted commerce and marketing SaaS products; customised software, such as ERP solutions; and other software related services, as well as WeiMall, Smart Retail, Smart Catering, Smart Hotel, Heading ERP, and others for e-commerce, retail, catering, hotel, local life and other industries. The Merchant Solutions segment offers value-added services for merchants to meet merchants' online digital commerce and marketing needs, including assisting merchants to purchase online advertising traffic in various media platforms. The Digital Media segment provides advertisement placement services for merchants. The company was founded in 2013 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.weimob.com",
        "market_cap": 4951665152
    }
}