{
  "002017.SZ": {
    "city": "Zhuhai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Software - Infrastructure",
    "long_name": "Eastcompeace Technology Co.,ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "EASTCOMPEACE TECH",
    "state": null,
    "summary": "Eastcompeace Technology Co.,ltd provides smart card and system solutions in China and internationally. It offers smart cards, inducing TurboCOS, USIMExploiter, USIMExploiter Plus, M2M, SWP NFC, SIMePay, micro SIM and nano SIM, scratch, mag-stripe, EMV IC, contactless, dual interface, national ID, citizen, transportation, and social security cards. The company also provides SIM-key, SIM-kiosk, device management system, smart tracking system, OTA, TSM, key management system, banking card Perso, mobile payment system, one card, and smart parking management system solutions. It serves clients in telecommunications, banking and payment, IOT, and government and public sectors. The company was formerly known as Eastcompeace Smart Card Co., Ltd. and changed its name to Eastcompeace Technology Co.,ltd in April 2012. Eastcompeace Technology Co.,ltd was founded in 1998 and is based in Zhuhai, China.",
    "website": "http://www.eastcompeace.com",
    "zipcode": "519060"
  },
  "002090.SZ": {
    "city": "Nanjing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Software - Infrastructure",
    "long_name": "Wiscom System Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "WISCOM SYSTEM CO",
    "state": null,
    "summary": "Wiscom System Co., Ltd. engages in smart energy and smart city businesses in China. The company researches and develops, manufactures, and sells power generation, transmission, substation, distribution, and other power automation products. It is also involved in the wind power, solar energy, and other new energy power generation; biomass and waste heat power generation; distributed gas turbine and other thermal power generation; and power distribution professional engineering consulting, survey, and design businesses. In addition, the company engages in the new energy, micro-network, energy emission reduction, and other project development, construction management, and general contracting businesses; and other technology development and technical services businesses. Further, it provides IT consulting, value-added, and infrastructure, as well as industry application solutions. The company was founded in 1995 and is headquartered in Nanjing, China.",
    "website": "http://www.wiscom.com.cn",
    "zipcode": "211100"
  },
  "002212.SZ": {
    "city": "Shantou City",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Software - Infrastructure",
    "long_name": "Topsec Technologies Group Inc.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "TOPSEC TECHNOLOGIE",
    "state": null,
    "summary": "Topsec Technologies Group Inc., together with its subsidiaries, research, develops, manufactures, and sells wires and cables in China. It offers low voltage cables, such as control, insulated halogen-free low-smoke, and armored power cables, as well as copper core cross-linked polyethylene insulated copper wires; medium voltage cables, including copper core XLPE insulated PVC sheathed power cables; and high voltage cables, such as XLPE insulated power cables. The company also provides special cables comprising aluminum alloy, mineral flexible, marine, and frequency conversion environmental protection cables, as well as offers wire products. In addition, it offers security and data products, including security gateway, security detection, secure access, data security, cloud security, and data and other related products; and security consulting, safe operation and maintenance, security research and development, security cloud services, etc. for government, finance, energy, telecommunications, and other industries. The company was formerly known as Nanyang Topsec Technologies Group Inc. and changed its name to Topsec Technologies Group Inc. in November 2020. Topsec Technologies Group Inc.  was founded in 1985 and is based in Shantou City, China.",
    "website": "http://tzzgx.topsec.com.cn",
    "zipcode": null
  },
  "002439.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Software - Infrastructure",
    "long_name": "Venustech Group Inc.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "VENUSTECH GROUP IN",
    "state": null,
    "summary": "Venustech Group Inc. provides network security products, trusted security management platforms, and specialized security services and solutions worldwide. The company offers security products, such as unified threat management, firewall, intrusion detection systems, intrusion prevention systems, Web application firewall, Web application audio systems, security operations center, database audit, and vulnerabilities scanning, and security management, as well as application delivery controller products. It primarily serves Chinese banking institutions, state-owned enterprises, and Chinese telecom operators. The company was formerly known as Beijing Venustech Inc. Venustech Group Inc. was founded in 1996 and is headquartered in Beijing, China.",
    "website": "http://www.venusense.com",
    "zipcode": "100193"
  },
  "002990.SZ": {
    "city": "Shenzhen",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Software - Infrastructure",
    "long_name": "Maxvision Technology Corp.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "MAXVISION TECHNOLO",
    "state": null,
    "summary": "Maxvision Technology Corp. engages in artificial intelligence, algorithm research, and system integration activities in China. It offers port, smart transportation, and smart systems. The company was founded in 1997 and is headquartered in Shenzhen, China.",
    "website": "http://www.maxvision.com.cn",
    "zipcode": null
  },
  "300017.SZ": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Software - Infrastructure",
    "long_name": "Wangsu Science & Technology Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "WANGSU SCIENCE AND",
    "state": null,
    "summary": "Wangsu Science & Technology Co.,Ltd. provides data and cloud computing infrastructures, content delivery network (CDN), and computing network services worldwide. It offers Webpage Accelerator solution to enhance the delivery of static contents of Website; Download Acceleration solution for slow speed, content hijacking, bandwidth burst, etc.; Streaming Media Acceleration solution to distribute streaming media contents; Whole Site Acceleration solution to accelerate static and dynamic Web content; Application Accelerator solution for various enterprise business information systems; and Mobile Application Accelerator, a security and monitoring platform. The company also provides Dynamic Site Accelerator solution for dynamic interactive Websites; Accessing Accelerator solution; HTTPS Security Accelerator for various security protection, and dynamic and static resource planning; and Overseas Accelerator solution for multi-device and acceleration solutions. In addition, it offers Wangsu Shield cloud security solutions for Websites, which include DDoS Mitigation service for various types of DDoS attacks, such as SYN Flood, ACK Flood, UDP Flood, HTTP Flood, etc.; Web Application Firewall; and Bot Guard, as well as security management and security services. Further, the company operates Website security monitoring platform; and cloud video platform for live streaming, VOD, video AI, media processing, video uploading, and cloud video services. Additionally, it offers Website Defacement system; data center solutions; and cloud computing solutions, which include computing, storage, networks, security, data base, CDN, management and development, domains and analytics, middleware, and instant messaging. The company serves online interactive quiz, government, automotive, gaming, video, finance, appliance manufacturing, e-commerce, mobile live streaming, media, FMCG, education, and consumer electronics sectors. The company was founded in 2000 and is based in Shanghai, China.",
    "website": "http://www.wangsu.com",
    "zipcode": "200030"
  },
  "300085.SZ": {
    "city": "Shenzhen",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Software - Infrastructure",
    "long_name": "Shenzhen InfoGem Technologies Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "SHENZHEN INFOGEM T",
    "state": null,
    "summary": "Shenzhen InfoGem Technologies Co., Ltd. develops and sells software products and services for the financial information industry primarily in China. The company provides financial equipment related to payment and settlement, risk prevention and control, business process reengineering, Internet financial core system, and self-service system. It also offers personal mobile information services; and home security products and other consumer electronic products. In addition, it invests in innovative financial technologies, such as big-data based personal credit rating technology, artificial intelligent, and natural language processing; and offers innovative services for financial institutions, Internet financial companies, and individual consumers. The company was formerly known as Shenzhen Infotech Technologies Co., Ltd. and changed its name to Shenzhen InfoGem Technologies Co., Ltd. in May 2015. Shenzhen InfoGem Technologies Co., Ltd. was founded in 1998 and is headquartered in Shenzhen, China.",
    "website": "http://www.yinzhijie.com",
    "zipcode": null
  },
  "300209.SZ": {
    "city": "Nanjing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Software - Infrastructure",
    "long_name": "TIZA Information Industry Corporation INC.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "TIANZE INFORMATION",
    "state": null,
    "summary": "TIZA Information Industry Corporation INC. provides industrial Internet IT services in China. The company offers information management, precision agriculture, and cloud products and solutions, as well as related software and hardware products and services. Its solutions include new energy vehicle management, product lifecycle management, enterprise Internet of Things big data platform, commercial vehicle car networking, agricultural machine Internet of Things, machine learning platform, smart environment, engine plant iCAN, integrated iMOC equipment manufacturer, data acquisition manufacturing and management, telemedicine consultation system, and industrial spare parts supply chain management solutions. The company serves high-end equipment manufacturing enterprises, and upstream and downstream manufacturers, as well as new energy and environmental protection, transportation, logistics, and other related industries and government departments. TIZA Information Industry Corporation INC. was founded in 2000 and is headquartered in Nanjing, China.",
    "website": "http://www.tiza.com.cn",
    "zipcode": "210019"
  },
  "300352.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Software - Infrastructure",
    "long_name": "Beijing VRV Software Corporation Limited",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "BEIJING VRV SOFTWA",
    "state": null,
    "summary": "Beijing VRV Software Corporation Limited develops and sells information security products and solutions in China. The company provides data applications, mobile management systems, domestic and virtual terminal security systems, boundary security products, Intranet security products, anti-virus products, Internet security aggregation channels, and data security products. It serves the government, military, public security, finance, energy, and other industries. The company was founded in 1996 and is headquartered in Beijing, China.",
    "website": "http://www.vrv.com.cn",
    "zipcode": "100081"
  },
  "300369.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Software - Infrastructure",
    "long_name": "Nsfocus Information Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "NSFOCUS TECHNOLOGI",
    "state": null,
    "summary": "Nsfocus Information Technology Co., Ltd. provides Internet and application security services worldwide. It offers holistic, carrier-grade, hybrid distributed denial of service (DDoS), and Web security solutions. The company's products include anti-DDoS system, an appliance for the real-time mitigation of DDoS attacks; Cloud DDoS Protection Service, a service for service providers that defeats DDoS attacks, which impact infrastructure; Threat Intelligence Subscription Service, a service that minimizes risk and enhances overall security postures; and Attack Threat Monitoring for DDoS threat analyses and assessments, as well as Exposed Internet Surface Analysis and Cloud Web Vulnerability Scanning Service. It also provides Web Application Firewall, which protects Web servers and applications in defending against the attacks and data breaches, as well as helps in eliminating downtime; and Web Vulnerability Scanning System that helps in securing Website and identifying real vulnerabilities. In addition, the company offers Threat Analysis and Next Generation Intrusion Prevention Systems to detect and mitigate advanced persistent threats. Its solutions include cloud-in-a-box for local and regional service providers; on-premises defenses for managing DDoS services; and Hybrid DDoS Defenses for eliminating various DDoS attacks targeting customers and infrastructure. It serves telecom carriers, data centers, financial services companies, cloud service providers, managed security services providers, and enterprises. The company was founded in 2000 and is headquartered in Beijing, China.",
    "website": "http://nsfocusglobal.com",
    "zipcode": null
  },
  "300377.SZ": {
    "city": "Shenzhen",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Software - Infrastructure",
    "long_name": "Shenzhen Ysstech Info-Tech Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "SHENZHEN YSSTECH I",
    "state": null,
    "summary": "Shenzhen Ysstech Info-Tech Co.,Ltd provides system solutions for the financial industry in the China. The company offers investment trading products, including investment trading management platforms; and risk management and performance products comprising combination management, investment decision analysis, investment risk management integration, financial asset risk management and performance evaluation, investment performance attribution analysis system, financial model management system, and financial data warehouse system solutions. It also provides liquidation, accounting, and valuation products, such as assets financial valuation system, asset management system, assets integrated information management system, clearing system, XBRL information disclosure system, and interbank data interface system solutions. In addition, the company offers bank and financial asset custody products, including financial asset management system, custodian bank clearing system, and bank monitoring system solutions, as well as hosting service platform. It serves banks, fund companies, securities companies, insurance companies, trust companies, financial management companies, national social security, and others. Shenzhen Ysstech Info-Tech Co.,Ltd is headquartered in Shenzhen, China.",
    "website": "http://www.ysstech.com",
    "zipcode": "518053"
  },
  "300378.SZ": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Software - Infrastructure",
    "long_name": "Digiwin Software Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "DIGIWIN SOFTWARE C",
    "state": null,
    "summary": "Digiwin Software Co.,Ltd. provides industry-specific software solutions in the Greater China and South East Asia. It offers ERP/ERPII solutions, including T-series products for large size companies; E-series products for medium size companies; C-series products for small companies; and A-series cloud services for small to micro businesses. The company serves manufacturing, distribution and retail, and micro and small enterprises. Digiwin Software Co.,Ltd. is based in Shanghai, China.",
    "website": "http://www.digiwin.com.cn",
    "zipcode": "200072"
  },
  "300383.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Software - Infrastructure",
    "long_name": "Beijing Sinnet Technology Co., Ltd",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "BEIJING SINNET TEC",
    "state": null,
    "summary": "Beijing Sinnet Technology Co., Ltd provides Internet data center (IDC), Internet access (ISP), and cloud computing services worldwide. The company offers IDC services, including network security, server hosting and VIP room rental services; load balancing, disaster recovery, reverse DNS, VPN, and traffic monitoring; air conditioning firewall protection, DDOS protection, and intrusion detection service; and customized operation and maintenance services. It also provides public cloud, private cloud, hybrid cloud, cloud management platform, and cloud infrastructure platforms; and ISP services, such as optical fiber access, PCM access, EDSL access, microwave access, and point to point leased services to customers. In addition, the company offers network system integration services that include Internet integration for small and medium enterprises, ERP solutions for large enterprises, and network services for telecom industry. Beijing Sinnet Technology Co., Ltd was founded in 1999 and is based in Beijing, China.",
    "website": "http://www.sinnet.com.cn",
    "zipcode": "100011"
  },
  "300386.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Software - Infrastructure",
    "long_name": "Feitian Technologies Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "FEITIAN TECHNOLOGI",
    "state": null,
    "summary": "Feitian Technologies Co., Ltd. provides authentication and transaction security solutions for secure online banking and transaction security worldwide. It offers OTP display, chip embedded, and fingerprint cards; FIDO2 security key to encrypt, store, and protect fingerprint data; FIDO U2F, a security key for supporting USB, NFC, and BLE communications; mobile payment terminals; PKI identification products; OTP authentication products; smart card readers; smart card OS, a java card operating system; software protection products; cloud based service platform; and BlockChain, a cryptocurrency wallet. The company also provides turnkey solution, which includes secure hardware, operating systems, middleware, software application, and services, such as personalization and remote lifecycle management. The company's customers include financial institutions, as well as telecom, government, and business enterprises. Feitian Technologies Co., Ltd. was founded in 1998 and is headquartered in Beijing, China.",
    "website": "http://www.ftsafe.com",
    "zipcode": "100085"
  },
  "300561.SZ": {
    "city": "Zhuhai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Software - Infrastructure",
    "long_name": "SGSG Science&Technology Co., Ltd. Zhuhai",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "SGSG SCIENCE&TECHN",
    "state": null,
    "summary": "SGSG Science&Technology Co., Ltd. Zhuhai engages in software designing, system integration, installation and debugging, technical support, training, and other activities in Mainland China. The company primarily offers professional services for bank business operations and outlet constructions, as well as total solutions to cash notes, precious metals, and seal management needs. It also develops bank self-service device cash replenishment and distribution management systems, bank physical/electronic seal management systems, intelligent bank outlet solutions, bank cash flow physical internal control systems, bank treasury management solutions, and other products, as well as supplies internal control risk management solutions for the financial industry. In addition, the company offers banking self-service equipment and bill allocation management solutions; banking stamp management solutions; banking material circulation management solutions; and baking vault management solutions. Its products are primarily used in Chinese and foreign banks. The company was founded in 2005 and is headquartered in Zhuhai, the People's Republic of China.",
    "website": "http://www.sgsg.cc",
    "zipcode": "519085"
  },
  "300578.SZ": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Software - Infrastructure",
    "long_name": "BizConf Telecom Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "BIZCONF TELECOM CO",
    "state": null,
    "summary": "BizConf Telecom Co.,Ltd. provides remote virtual conferencing services for internal and external communication of business in China and internationally. The company offers audio conferencing, Web conferencing, video conferencing, and Webcasting services, as well as builds SaaS cloud video service platform. It provides solutions for hardware, HR, financial, retail, and medical sectors. The company has strategic partnerships with China Telecom, China Unicom, China Mobile, Tata Communication, Singtel, Telstra, PCCW, BT, Starhub, etc. BizConf Telecom Co.,Ltd. was founded in 2006 and is based in Shanghai, China.",
    "website": "http://www.bizconf.cn",
    "zipcode": null
  },
  "300579.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Software - Infrastructure",
    "long_name": "Beijing Certificate Authority Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "BEIJING CERTIFICAT",
    "state": null,
    "summary": "Beijing Certificate Authority Co., Ltd. provides information security solutions in China. The company offers electronic certification services, electronic certification products and manageable information security services. It provides digital certificate authentication system, certificate management server, office/pdf web page electronic signature, pdf signature server, time stamp service system, signature verification server, handwritten digital signature system, trusted document management system, drawing digital delivery system, electronic contract signing system, and unified certification management system products. The company also offers trusted network authentication, SSL certificate, digital certificate, cloud signature, product solution, electronic bidding solution, mobile law enforcement solution, electronic license solution, mobile office solution, electronic signature judicial proof, and electronic security services. Beijing Certificate Authority Co., Ltd. was founded in 2001 and is based in Beijing, China.",
    "website": "http://www.bjca.org.cn",
    "zipcode": "100080"
  },
  "300768.SZ": {
    "city": "Hangzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Software - Infrastructure",
    "long_name": "Hangzhou DPtech Technologies Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "HANGZHOU DPTECH TE",
    "state": null,
    "summary": "Hangzhou DPtech Technologies Co.,Ltd. manufactures and sells network security and application delivery products and solutions in China. The company offers application firewall, intrusion prevention system, bandwidth management, deep packet inspection, Web application firewall, anti-DDoS, application network, industrial Ethernet, unified threat management, and WLAN products, as well as technical solutions. It serves customers in various industries, such as service providers, governments, power grid, finance, education, etc. The company was founded in 2008 and is headquartered in Hangzhou, China.",
    "website": "http://www.dptech.com",
    "zipcode": "310051"
  },
  "3773.HK": {
    "city": "Shenzhen",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Software - Infrastructure",
    "long_name": "NNK Group Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "NNK",
    "state": null,
    "summary": "NNK Group Limited provides mobile top-up services to mobile subscribers in the People's Republic of China. The company operates 007ka Top-up Platform for mobile top-up through electronic banking systems. It also provides mobile top-up services through offline channels, including convenience stores; and mobile phone stores and other third party retailer chains, as well as through third-party online platforms, the company's Websites, and Wechat public account. The company was founded in 2006 and is headquartered in Shenzhen, the People's Republic of China.",
    "website": "http://www.nnk.com.hk",
    "zipcode": null
  },
  "600571.SS": {
    "city": "Hangzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Software - Infrastructure",
    "long_name": "Sunyard Technology Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "SUNYARD TECHNOLOGY CO LTD",
    "state": null,
    "summary": "Sunyard Technology Co.,Ltd engages in the research and development of software and technology products and services in China and internationally. It offers financial software covering operational management, document management, credit card, information security, auditing, stocks and securities, banking, e-commerce, risk management, insurance, payment and clearing, and micro-finance solutions, as well as basic products. The company also provides financial equipment, including financial POS, mobile payment, payment terminal, PINPAD, telephone-POS, data security, and system platform series products; information technology and business processing outsourcing services; and consulting solutions for the financial service industry. It serves banks, securities clients, and insurance customers, as well as oil and gas industry. The company was formerly known as Sunyard System Engineering Co., Ltd. and changed its name to Sunyard Technology Co.,Ltd. Sunyard Technology Co.,Ltd was founded in 1996 and is headquartered in Hangzhou, China.",
    "website": "http://www.sunyard.com",
    "zipcode": "310053"
  },
  "600602.SS": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Software - Infrastructure",
    "long_name": "INESA Intelligent Tech Inc.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "INESA INTELLIGENT TECH INC",
    "state": null,
    "summary": "INESA Intelligent Tech Inc. operates as an information technology services company in China. It offers cloud computing and big data solutions that include infrastructure as a service, platform as a service, and software as a service; industry solutions, such as intelligent security, smart government, wisdom detection, smart water, wisdom education, and smart medical; and consumer, security, and special electronic products, as well as electronic detection products. The company was formerly known as INESA Electron Co., Ltd and changed its name to INESA Intelligent Tech Inc. in June 2016. INESA Intelligent Tech Inc. was founded in 1986 and is based in Shanghai, China.",
    "website": "http://www.inesa-it.com",
    "zipcode": "200233"
  },
  "603232.SS": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Software - Infrastructure",
    "long_name": "Koal Software Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "KOAL SOFTWARE CO LTD",
    "state": null,
    "summary": "Koal Software Co., Ltd. develops public key infrastructure platform in China. The company offers identity security infrastructure, such as root certificate issuing, certificate issuing, certificate registration auditing, key and certificate integrated management, and trusted identity management systems; password service platform, including timestamp and signature verification servers, and electronic signature systems; and authentication and access control products comprising security authentication, SSL application delivery, and single sign-on gateways. It also provides terminal security and admission control products, such as LAN access control, and terminal security login and file protection systems; and data security and privacy protection products, including secure email, network and net shield safe, USB guardian, print control, and secure instant messaging systems. In addition, the company offers unified authentication, terminal security password module, Internet of Things security, connected car security, certificate authentication system, and mobile security solutions. It serves public security, immigrations, and ministries; the information technology, finance, and manufacturing industries; banks, stock exchanges, and financial institutions; and military industry groups in the field of defense. The company was founded in 1998 and is headquartered in Shanghai, China.",
    "website": "http://www.koal.com",
    "zipcode": "200436"
  },
  "6608.HK": {
    "city": "Beijing",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Software - Infrastructure",
    "long_name": "Bairong Inc.",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "BAIRONG-W",
    "state": null,
    "summary": "Bairong Inc., a fintech application company, provides full lifecycle management services to financial institutions and offers financial products and services to private and small-micro enterprises in the People's Republic of China. It offers credit risk management, precision marketing, and insurance distribution products. The company is also engaged in micro-loan business, and insurance and reinsurance brokerage business. In addition, it provides development, consulting, and transfer services of software and hardware products, and network technology; data processing and big data services; enterprise credit services; technology development services; and financial information services. Further, the company is engaged in computer system development; and technology development, consulting, and promotion services. It provides its solutions to banks and insurance companies. Bairong Inc. was founded in 2014 and is headquartered in Beijing, China.",
    "website": "http://www.guiyang.baironginc.com/index.php/index/index.html",
    "zipcode": null
  },
  "688023.SS": {
    "city": "Hangzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Software - Infrastructure",
    "long_name": "DBAPPSecurity Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "HANGZHOU DAS-SECURITY TECHNOLOG",
    "state": null,
    "summary": "DBAPPSecurity Co., Ltd. engages in the research and development, manufacture, and sale of cybersecurity products in China. The company offers security products, including APT Discovery platform, Operation and Maintenance Audit and Risk Control System, Comprehensive Log Auditor, Database Auditor, Web Vulnerability Scanner, and Cloud and Big Data Security platforms, as well as SaaS cloud security services. It also provides professional security services, including application security, big data security, cloud security, IoT security, ICS security, industrial Internet security, etc. The company was founded in 2007 and is headquartered in Hangzhou, China.",
    "website": "http://www.dbappsecurity.com",
    "zipcode": null
  },
  "688030.SS": {
    "city": "Suzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Software - Infrastructure",
    "long_name": "Hillstone Networks Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "HILLSTONE NETWORKS CO LTD",
    "state": null,
    "summary": "Hillstone Networks Co., Ltd. provides a portfolio of network security and risk management solutions to enterprises and service providers worldwide. It offers perimeter protection, breach prevention, and data center protection equipment; cloud protection and security management solutions; and pre-breach, breach, and post-breach services, as well as technical support and training services. The company was founded in 2011 and is based in Suzhou, China.",
    "website": "http://www.hillstonenet.com.cn",
    "zipcode": "215000"
  },
  "688081.SS": {
    "city": "Wuhan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Software - Infrastructure",
    "long_name": "Wuhan Xingtu Xinke Electronics Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "WUHAN XINGTU XINKE ELECTRONICS ",
    "state": null,
    "summary": "Wuhan Xingtu Xinke Electronics Co., Ltd. produces and sells military-specific video command and control systems based on network communications. It also offers video early warning control systems. The company was founded in 2004 and is based in Wuhan, China.",
    "website": "http://www.xingtu.com",
    "zipcode": "430074"
  },
  "688158.SS": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Software - Infrastructure",
    "long_name": "UCloud Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "UCLOUD TECHNOLOGY CO LTD",
    "state": null,
    "summary": "UCloud Technology Co., Ltd. researches and develops cloud computing technology platform solutions. The company offers cloud computing products, such as IaaS, PaaS, big data circulation platform, and AI service platform solutions. It also provides products in the areas of data analysis, artificial intelligence, and the Internet of things; security, safety compliance, enterprise application, and management and monitoring; and hybrid and private cloud solutions. The company was founded in 2012 and is based in Shanghai, China.",
    "website": "http://www.ucloud.cn",
    "zipcode": "200090"
  },
  "688229.SS": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Software - Infrastructure",
    "long_name": "Bonree Data Technology Co., Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "BONREE DATA TECHNOLOGY CO LTD",
    "state": null,
    "summary": "Bonree Data Technology Co., Ltd provides application performance management services for enterprises in China. It also offers network performance management, big data, mobile app, and test products. In addition, the company provides financial, e-commerce, portal, aviation, manufacturing, live video, and operator solutions. Further, it offers support services. The company was founded in 2008 and is based in Beijing, China.",
    "website": "http://www.bonree.com",
    "zipcode": null
  },
  "6B5.MU": {
    "city": "Beijing",
    "country": "China",
    "currency": "EUR",
    "exchange": "MUN",
    "industry": "Software - Infrastructure",
    "long_name": "Bairong Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "BAIRONG INC.CL.B -,00002",
    "state": null,
    "summary": "Bairong Inc., a fintech application company, provides full lifecycle management services to financial institutions and offers financial products and services to private and small-micro enterprises in the People's Republic of China. It offers credit risk management, precision marketing, and insurance distribution products. The company is also engaged in micro-loan business, and insurance and reinsurance brokerage business. In addition, it provides development, consulting, and transfer services of software and hardware products, and network technology; data processing and big data services; enterprise credit services; technology development services; and financial information services. Further, the company is engaged in computer system development; and technology development, consulting, and promotion services. It provides its solutions to banks and insurance companies. Bairong Inc. was founded in 2014 and is headquartered in Beijing, China.",
    "website": "http://www.guiyang.baironginc.com/index.php/index/index.html",
    "zipcode": null
  },
  "900901.SS": {
    "city": "Shanghai",
    "country": "China",
    "currency": "USD",
    "exchange": "SHH",
    "industry": "Software - Infrastructure",
    "long_name": "INESA Intelligent Tech Inc.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "INESA INTELLIGENT TECH INC",
    "state": null,
    "summary": "INESA Intelligent Tech Inc. operates as an information technology services company in China. It offers cloud computing and big data solutions that include infrastructure as a service, platform as a service, and software as a service; industry solutions, such as intelligent security, smart government, wisdom detection, smart water, wisdom education, and smart medical; and consumer, security, and special electronic products, as well as electronic detection products. The company was formerly known as INESA Electron Co., Ltd and changed its name to INESA Intelligent Tech Inc. in June 2016. INESA Intelligent Tech Inc. was founded in 1986 and is based in Shanghai, China.",
    "website": "http://www.inesa-it.com",
    "zipcode": "200233"
  },
  "9923.HK": {
    "city": "Shenzhen",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Software - Infrastructure",
    "long_name": "Yeahka Limited",
    "market": "hk_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "YEAHKA",
    "state": null,
    "summary": "Yeahka Limited operates payment-based technology platform that provides payment and business services to merchants and consumers in China. It offers one-stop payment services, which include app-based and traditional payment services comprising mobile payment and bank card acquiring products, as well as an intelligent risk control platform for controlling and managing mobile payments. The company also provides technology-enabled business services, including various merchant SaaS products and marketing services that offer a variety of intelligent business solutions, and intelligent operation and management services; and a payment-based advertising platform, which provides various marketing and promotional tools. In addition, it offers fintech services for financial needs of customers. Yeahka Limited was incorporated in 2011 and is headquartered in Shenzhen, the People's Republic of China.",
    "website": "http://www.yeahka.com",
    "zipcode": null
  },
  "9959.HK": {
    "city": "Shenzhen",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Software - Infrastructure",
    "long_name": "Linklogis Inc.",
    "market": "hk_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "LINKLOGIS-W",
    "state": null,
    "summary": "Linklogis Inc., an investment holding company, provides technology solutions for supply chain finance primarily in China. The company offers Anchor Cloud, a solution that enables anchor enterprises to achieve digital transformation for supply chain management and optimize payment cycle for parties along the supply chain; and FI Cloud, a solution to help for financial institutions to digitalize, automate, and streamline their supply chain financing services. It also provides Cross-border Cloud solutions to help anchor enterprises and financial institutions to offer supply chain payment and financing for corporates engaged in cross-border trade activities; and SME Credit Tech Solution, a suite of data-driven risk analytics solutions, which help financial institutions to provide financing for anchor enterprises' SME suppliers and distributors based on data in the supply chain ecosystem. The company was founded in 2016 and is based in Shenzhen, in the People's Republic of China.",
    "website": "http://www.linklogis.com",
    "zipcode": "518063"
  },
  "AQC.F": {
    "city": "Beijing",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Infrastructure",
    "long_name": "Datasea Inc.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "DATASEA INC.  DL-,01",
    "state": null,
    "summary": "Datasea Inc., through its subsidiaries, provides smart security solutions in the People's Republic of China. It develops big data security and smart 3D security platforms, safe campus security systems, scenic area security systems, and public community security systems, as well as epidemic system. The company offers its smart security solutions primarily to schools, tourist or scenic attractions, and public communities through its own sales teams, partner agents, and newly founded operating entities. It also develops and offers education-related technologies to build campus networks, education management systems, education cloud platforms, science education platforms, and other education systems used in schools. The company was formerly known as Rose Rock, Inc. and changed its name to Datasea Inc. in October 2015. Datasea Inc. was incorporated in 2014 and is headquartered in Beijing, the People's Republic of China.",
    "website": "http://www.dataseainc.com",
    "zipcode": "100176"
  },
  "C3IA.F": {
    "city": "Shenzhen",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Infrastructure",
    "long_name": "Taoping Inc.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "TAOPING INC.  NEW  DL-,01",
    "state": null,
    "summary": "Taoping Inc. provides cloud-based platform, resource sharing, and big data solutions to the Chinese new media, education residential community management, and elevator Internet of Things (IoT) industries in the People's Republic of China. The company operates in two segments, Cloud-Based Technology and Traditional Information Technology. It offers cloud-based software as a service to automate the interactive workflow between advertising agencies and their customers, including establishing new advertising projects, submitting advertisement proposals, revising and approving advertising proposals, processing payment online, remotely uploading advertisement content, and tracking and analyzing performance data. The company also provides project-based technology products and services for the public sector; and software and hardware with integrated solutions, including information technology infrastructure, Internet-enabled display technologies, and IoT platforms to customers in government, education, residential community management, media, transportation, healthcare, and other private sectors, as well as related maintenance and support services. In addition, it offers cloud-application-terminal and IoT technology based digital advertising distribution network and media resource sharing platform in the out-of-home advertising markets. Further, the company operates Taoping Net, an advertising-resources trading service platform, which connect screen owners, advertisers, and consumers; Taoping App, which enable customers to distribute and manage ads from mobile terminals; and blockchain business. It has strategic partnership agreement with Ivy International Education Technology Co., Ltd. to develop and market new learning programs for quality education. The company was formerly known as China Information Technology, Inc. and changed its name to Taoping Inc. in June 2018. Taoping Inc. was founded in 1993 and is headquartered in Shenzhen, the People's Republic of China.",
    "website": "http://www.taop.com",
    "zipcode": "518040"
  },
  "DTSS": {
    "city": "Beijing",
    "country": "China",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Software - Infrastructure",
    "long_name": "Datasea Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "Datasea Inc.",
    "state": null,
    "summary": "Datasea Inc., through its subsidiaries, provides smart security solutions in the People's Republic of China. It develops big data security and smart 3D security platforms, safe campus security systems, scenic area security systems, and public community security systems, as well as epidemic system. The company offers its smart security solutions primarily to schools, tourist or scenic attractions, and public communities through its own sales teams, partner agents, and newly founded operating entities. It also develops and offers education-related technologies to build campus networks, education management systems, education cloud platforms, science education platforms, and other education systems used in schools. The company was formerly known as Rose Rock, Inc. and changed its name to Datasea Inc. in October 2015. Datasea Inc. was incorporated in 2014 and is headquartered in Beijing, the People's Republic of China.",
    "website": "http://www.dataseainc.com",
    "zipcode": "100176"
  },
  "FTC.AX": {
    "city": "Shenzhen",
    "country": "China",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Software - Infrastructure",
    "long_name": "FinTech Chain Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "FIN CHAIN CDI 1:1",
    "state": null,
    "summary": "FinTech Chain Limited, an investment holding company, engages in the provision of system development and information technology services in the People's Republic of China. It also provides point-of-sale machines. The company's products comprise Payment T+ that includes prepaid card, integrated payment cashier, and commission assignment system, as well as POS P acquiring system; Clearing F.E.A, such as bank identification number based promotion tool system, traceable transaction electronic authentication platform, horizontal alliance clearing and settlement platform, and universal points platform; Q-Life, a web-based community service system that provides digital value-added services for property management and convenient life-support services for community residents, T-Linx, an integrated payment acquiring infrastructure, community O2O service platform, and e-commerce supply chain system services; and T-PAD, T-BOX, TL-007, TL 008/009, and T-Linx Remix Mini hardware products. In addition, it offers investment management and consultancy services. It offers its solutions for banking, catering, department store, tourism, and retail industries, as well as for community management. The company was formerly known as TTG FinTech Limited and changed its name to FinTech Chain Limited in April 2018. FinTech Chain Limited was founded in 2010 and is based in Shenzhen, the People's Republic of China.",
    "website": "http://www.ttg.hk",
    "zipcode": null
  },
  "SOS": {
    "city": "Qingdao",
    "country": "China",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Software - Infrastructure",
    "long_name": "SOS Limited",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "SOS Limited",
    "state": null,
    "summary": "SOS Limited, a technology company, provides marketing data, technology, and solutions for emergency rescue services to corporate and individual members. It operates SOS cloud emergency rescue service software as a service platform that offers basic cloud products, such as medical rescue, car rescue, financial rescue, and mutual assistance rescue cards; cooperative cloud products, including information rescue center, intelligent big data, and intelligent software and hardware; and information cloud products, such as News Today and E-Commerce Today. The company serves insurance companies, financial institutions, medical institutions, healthcare providers, auto manufacturers, security providers, senior living assistance providers, and other service providers in the emergency rescue services industry. SOS Limited is based Qingdao, the People's Republic of China.",
    "website": "http://www.sosyun.com",
    "zipcode": null
  },
  "TAOP": {
    "city": "Shenzhen",
    "country": "China",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Software - Infrastructure",
    "long_name": "Taoping Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "Taoping Inc.",
    "state": null,
    "summary": "Taoping Inc. provides cloud-based platform, resource sharing, and big data solutions to the Chinese new media, education residential community management, and elevator Internet of Things (IoT) industries in the People's Republic of China. The company operates in two segments, Cloud-based Technology and Traditional Information Technology. It offers cloud-based software as a service to automate the interactive workflow between advertising agencies and their customers, including establishing new projects, submitting advertisement proposals, revising and approving advertising proposals, processing payment online, remotely uploading advertisement content, and tracking and analyzing performance data. The company also provides project-based technology products and services for the public sector; and software and hardware with fully integrated solutions, including information technology infrastructure, Internet-enabled display technologies, and IoT platforms to customers in government, education, residential community management, media, transportation, healthcare, and other private sectors, as well as related maintenance and support services. In addition, it offers cloud-app-terminal and IoT technology based digital advertising distribution network and media resource sharing platform in the out-of-home advertising markets. Further, the company operates Taoping Net, an advertising-resources trading service platform, which connect screen owners, advertisers, and consumers; Taoping App, which enable customers to distribute and manage ads from mobile terminals; and blockchain business. The company was formerly known as China Information Technology, Inc. and changed its name to Taoping Inc. in June 2018. Taoping Inc. was founded in 1993 and is headquartered in Shenzhen, the People's Republic of China.",
    "website": "http://www.taop.com",
    "zipcode": "518040"
  },
  "TUYA": {
    "city": "Hangzhou",
    "country": "China",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Software - Infrastructure",
    "long_name": "Tuya Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "Tuya Inc.",
    "state": null,
    "summary": "Tuya Inc. engages in the cloud and application development business. It provides purpose-built Internet of Things (IoT) cloud platform that delivers a suite of offerings, including Platform-as-a-Service (PaaS) and Software-as-a-Service (SaaS) to original equipment manufacturers, industry operators, and system integrators. The company's IoT PaaS offering enables businesses and developers to develop, launch, manage, and monetize software-enabled devices and services; and SaaS offering enables businesses to deploy, connect, and manage various types of smart devices. It also provides a wide range of cloud-based value-added services to businesses, developers, and end users to develop and manage IoT experiences. The company offers its solutions to smart real estate, smart business, healthcare, education, energy, and agriculture industry. Tuya Inc. was founded in 2014 and is based in Hangzhou, China with additional locations at Santa Clara, California; Gurugram, India; Dusseldorf, Germany; Antioquia, Colombia; Tokyo, Japan; Shenzhen, China; and Los Angeles, California.",
    "website": "http://www.tuya.com",
    "zipcode": "310012"
  },
  "YHEKF": {
    "city": "Shenzhen",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Software - Infrastructure",
    "long_name": "Yeahka Limited",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "YEAHKA LTD",
    "state": null,
    "summary": "Yeahka Limited operates payment-based technology platform that provides payment and business services to merchants and consumers in China. It offers one-stop payment services, which include app-based and traditional payment services comprising mobile payment and bank card acquiring products, as well as an intelligent risk control platform for controlling and managing mobile payments. The company also provides technology-enabled business services, including various merchant SaaS products and marketing services that offer a variety of intelligent business solutions, and intelligent operation and management services; and a payment-based advertising platform, which provides various marketing and promotional tools. In addition, it offers fintech services for financial needs of customers. Yeahka Limited was incorporated in 2011 and is headquartered in Shenzhen, the People's Republic of China.",
    "website": "http://www.yeahka.com",
    "zipcode": null
  }
}
