{
    "000591.SZ": {
        "short_name": "CECEP SOLAR ENERGY",
        "long_name": "CECEP Solar Energy Co.,Ltd.",
        "summary": "CECEP Solar Energy Co.,Ltd. engages in the research and development, construction, and operation of photovoltaic power plants. It engages in the technology research and development, manufacture, and sale of monocrystalline silicon products, and polycrystalline silicon battery and components. The company also generates and sells solar energy; invests in, constructs, operates, maintains, and manages solar energy generation projects; provides solar energy generation planning, technology research and development, design consultation, integration, installation, and operation maintenance services; and other related business, as well as manufactures generating system devices. In addition, it provides electricity solution to production; and living electricity facilities for families, villages, hospitals, border posts, islands, and others. The company was founded in 2009 and is based in Beijing, China. CECEP Solar Energy Co.,Ltd. is a subsidiary of China Energy Conservation and Environmental Protection Group.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "002218.SZ": {
        "short_name": "SZ TOPRAYSOLAR CO.",
        "long_name": "SHENZHEN TOPRAYSOLAR Co.,Ltd.",
        "summary": "SHENZHEN TOPRAYSOLAR Co.,Ltd. operates as an integrated solar manufacturer in China, Europe, North America, Africa, and internationally. The company offers solar glasses, solar cells, solar wafers, and solar ingots. It also provides on grid and off grid solar panels, such as mono and poly crystalline solar panels; and regular, flexible, folding, and solar blanket panels. In addition, the company offers solar consumer products comprising solar chargers that include electronic chargers, automotive products, charge regulators, and accessories; solar power kits; solar lightings; and solar home improvement products, as well as solar battery chips, solar power systems, solar energy absorbers, and water heater systems. Further, it provides EPC services, which comprise design, procurement, installation, and civic works, as well as operation and maintenance services for solar projects. It also develops and operates solar power plants with a capacity of 110MW in Dingbian, China. The company was founded in 1992 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "0438.HK": {
        "short_name": "IRICO NEWENERGY",
        "long_name": "IRICO Group New Energy Company Limited",
        "summary": "IRICO Group New Energy Company Limited, together with its subsidiaries, engages in the solar photovoltaic, new materials, trading, and other businesses in the People's Republic of China and internationally. It researches, develops, produces, and sells solar photovoltaic glasses, solar cells and modules, and related products; luminous materials, and lithium battery anode materials and related products of flat panel display; and photovoltaic glass upstream quartz sand. The company also constructs and operates solar power stations. In addition, it is involved in the mining and exploration activities; production and sale of inorganic nonmetallic materials and products; and trading of solar modules and other related accessories. The company was formerly known as IRICO Group Electronics Company Limited and changed its name to IRICO Group New Energy Company Limited in January 2016. The company was founded in 2004 and is headquartered in Xianyang, the People's Republic of China. IRICO Group New Energy Company Limited is a subsidiary of IRICO Group Corporation Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Xianyang"
    },
    "0712.HK": {
        "short_name": "COMTEC SOLAR",
        "long_name": "Comtec Solar Systems Group Limited",
        "summary": "Comtec Solar Systems Group Limited, an investment holding company, researches, produces, and sells mono-crystalline solar wafers and ingots in the People's Republic of China and Malaysia. The company operates through Upstream, and Downstream Solar and Power Storage segments. It offers solar grade products, such as pseudo square bricks, wafers, and polysilicon products. The company also invests in, develops, constructs, and operates solar photovoltaic power stations; and researches and develops, designs, integrates, and sells lithium battery management and battery systems to electric vehicle and lithium battery manufacturers, and power storage companies. In addition, it trades in solar related parts, equipment, and products; and generates solar power. The company was founded in 1999 and is headquartered in Shanghai, the People's Republic of China. Comtec Solar Systems Group Limited is a subsidiary of Fonty Holdings Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "0968.HK": {
        "short_name": "XINYI SOLAR",
        "long_name": "Xinyi Solar Holdings Limited",
        "summary": "Xinyi Solar Holdings Limited, an investment holding company, produces and sells solar glass products in the People's Republic of China, Malaysia, and internationally. It operates through three segments: Sales of Solar Glass; Solar Farm Business; and Engineering, Procurement and Construction Services. The company offers photovolatic power station, ultraclear patterned glasses, back glasses, and AR photovoltaic glasses, as well as double glass modules. It also develops and operates solar farms; and provides engineering, procurement, and construction services. In addition, the company engages in the provision of solar power systems; and trading of solar glass products. Xinyi Solar Holdings Limited was founded in 2008 and is headquartered in Wuhu, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Wuhu"
    },
    "13X.F": {
        "short_name": "XINYI SOLAR HLDGS",
        "long_name": "Xinyi Solar Holdings Limited",
        "summary": "Xinyi Solar Holdings Limited, an investment holding company, produces and sells solar glass products in the People's Republic of China, Malaysia, and internationally. It operates through three segments: Sales of Solar Glass; Solar Farm Business; and Engineering, Procurement and Construction Services. The company offers photovolatic power station, ultraclear patterned glasses, back glasses, and AR photovoltaic glasses, as well as double glass modules. It also develops and operates solar farms; and provides engineering, procurement, and construction services. In addition, the company engages in the provision of solar power systems; and trading of solar glass products. Xinyi Solar Holdings Limited was founded in 2008 and is headquartered in Wuhu, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Wuhu"
    },
    "1799.HK": {
        "short_name": "XINTE ENERGY",
        "long_name": "Xinte Energy Co., Ltd.",
        "summary": "Xinte Energy Co., Ltd., together with its subsidiaries, provides engineering and construction contracting services and systems for solar and wind power plants in the People's Republic of China and internationally. It also produces polysilicon products; and operates solar and wind power plants. In addition, the company produces inverter and static var generator products. Further, it offers consulting, design, research, and development services; and sells electricity. The company was founded in 2008 and is headquartered in Urumqi, the People's Republic of China. Xinte Energy Co., Ltd. is a subsidiary of TBEA Co., Ltd.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Urumqi"
    },
    "300111.SZ": {
        "short_name": "ZHEJIANG SUNFLOWE",
        "long_name": "Zhejiang Sunflower Great Health Limited Liability Company",
        "summary": "Zhejiang Sunflower Great Health Limited Liability Company engages in the research, development, production, and sale of solar energy batteries and components worldwide. It offers polycrystalline silicon wafers; and photovoltaic cells and modules. The company was formerly known as Zhejiang Sunflower Light Energy Science & Technology Limited Liability Company and changed its name to Zhejiang Sunflower Great Health Limited Liability Company in March 2020. Zhejiang Sunflower Great Health Limited Liability Company was founded in 2005 and is headquartered in Shaoxing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shaoxing"
    },
    "300125.SZ": {
        "short_name": "LINGDA GROUP CO LT",
        "long_name": "Lingda Group Co., Ltd.",
        "summary": "Lingda Group Co., Ltd. engages in the energy industry development, ecological environment improvement, and energy conservation activities in China. It provides new energy technology consulting, technology, technology transfer and engineering, design, equipment package, construction, and engineering services; energy conservation and other renewable energy technology research and development services; un-stated technology promotion and application services; and other technology promotion services. The company is also involved in the general contracting of practically applied projects; research, development, manufacture, assembly, and sale of mechanical, electric, and automation control equipment and spare parts; investment, operation, and management of various projects and related energy contracts; and natural science research and experimental development activities. In addition, it engages in solar photovoltaic system construction; vegetable cultivation; planting Chinese herbal medicine; other machinery and electronic products wholesale; business information consultation; investment management consulting; other engineering preparation; and other construction and installation activities. The company serves various industries, including cement, iron and steel, metallurgy, coking, etc. Lingda Group Co., Ltd. was founded in 2005 and is based in Dalian, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Dalian"
    },
    "300393.SZ": {
        "short_name": "JOLYWOOD (SUZHOU)",
        "long_name": "Jolywood (Suzhou) Sunwatt Co., Ltd.",
        "summary": "Jolywood (Suzhou) Sunwatt Co., Ltd. manufactures and sells integrated photovoltaic (PV) products worldwide. It offers solar module backsheets, P-type and N-type mono-crystalline silicon solar cells, and N-type bifacial solar cells; and invests in, installs, and operates distributed PV systems. The company was formerly known as Jolywood (Suzhou) Solar Material Technology Co., Ltd. and changed its name to Jolywood (Suzhou) Sunwatt Co., Ltd. in 2011. Jolywood (Suzhou) Sunwatt Co., Ltd. was founded in 2008 and is headquartered in Changzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Changzhou"
    },
    "600537.SS": {
        "short_name": "EGING PHOTOVOLTAIC TECHNOLOGY C",
        "long_name": "EGing Photovoltaic Technology Co.,Ltd.",
        "summary": "EGing Photovoltaic Technology Co.,Ltd. researches, develops, manufactures, and sells photovoltaic products in China and internationally. It offers mono and poly silicon solar modules, as well as glass-glass-solar modules. The company was formerly known as Haitong Food Group Co., Ltd. EGing Photovoltaic Technology Co.,Ltd. was founded in 2003 and is headquartered in Jintan, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Jintan"
    },
    "600732.SS": {
        "short_name": "SHANGHAI AIKO SOLAR ENERGY CO L",
        "long_name": "Shanghai Aiko Solar Energy Co., Ltd.",
        "summary": "Shanghai Aiko Solar Energy Co., Ltd. engages in the research, manufacturing, and sale of crystalline silicon solar cells. The company was founded in 1996 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "603105.SS": {
        "short_name": "ZHEJIANG XINNENG PHOTOVOLTAIC T",
        "long_name": "Zhejiang Sunoren Solar Technology Co.,Ltd.",
        "summary": "Zhejiang Sunoren Solar Technology Co.,Ltd. engages in the photovoltaic industry in China. It develops solar power stations; produces solar modules; manufactures silicon wafers; and researches and develops in the field of photovoltaic manufacturing and distributed photovoltaic power plants. The company was founded in 2008 and is headquartered in Haining, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Haining"
    },
    "603628.SS": {
        "short_name": "CLENERGY (XIAMEN) TECHNOLOGY CO",
        "long_name": "Clenergy (Xiamen) Technology Co., Ltd.",
        "summary": "Clenergy (Xiamen) Technology Co., Ltd. researches, develops, manufactures, sells, and services solar products in China and internationally. The company provides a range of solar mounting systems for various kinds of solar installations, including residential, industrial, commercial, and utility scale projects. It also offers power electronics products, such as integrated string combiner boxes, AC combiner boxes, and three phase string inverters. In addition, the company provides turnkey engineering services, including design, development, procurement, and construction of power plants; project consultation services, such as policy analysis, business trends analysis, project positioning analysis, risk analysis, and financing solutions; and technical consultation services comprising site investigation, technical scheme comparison and selection, economic analysis, technical risk assessment, on-site technical management, and project post-evaluation. Further, it offers project financing services. The company was founded in 2007 and is based in Xiamen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Xiamen"
    },
    "688408.SS": {
        "short_name": "ARCTECH SOLAR HOLDING CO LTD",
        "long_name": "Arctech Solar Holding Co., Ltd.",
        "summary": "Arctech Solar Holding Co., Ltd. provides solar tracking and racking systems for utilities, commercial, industrial, and residential projects worldwide. The company offers solar trackers, such as horizontal single axis trackers, horizontal single axis trackers with tilted modules, and tilt single axis trackers that improve the amount of the electricity through orientation of the PV panels towards the sun; and seasonal tilt, and dual and single pole mounting structures. As of December 31, 2018, it had a cumulatively installed capacity of approximately 19 GW; and had completed approximately 700 projects in 24 countries. The company is headquartered in Kunshan, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Kunshan"
    },
    "688599.SS": {
        "short_name": "TRINA SOLAR CO LTD",
        "long_name": "Trina Solar Co., Ltd",
        "summary": "Trina Solar Co., Ltd. operates as an integrated solar power products manufacturer and solar system developer in China, Europe, the United States, and other Asia Pacific regions. The company designs, develops, manufactures, and sells photovoltaic (PV) modules comprising monocrystalline and multicrystalline PV modules ranging in various power outputs for use in residential, commercial, industrial, and other solar power generation systems. It also provides mono- and multi-crystalline silicon ingots, wafers, cells, and related products. In addition, the company designs, constructs, sells, and/or operates solar power projects. It sells its products to power plant developers and operators, distributors, wholesalers, PV system integrators, and regional and national grid operators. Trina Solar Co., Ltd. was founded in 1997 and is headquartered in Changzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Changzhou"
    },
    "8C11.F": {
        "short_name": "COMTEC SOLAR SYS HD -,004",
        "long_name": "Comtec Solar Systems Group Limited",
        "summary": "Comtec Solar Systems Group Limited, an investment holding company, researches, produces, and sells mono-crystalline solar wafers and ingots in the People's Republic of China and Malaysia. The company operates through Upstream, and Downstream Solar and Power Storage segments. It offers solar grade products, such as pseudo square bricks, wafers, and polysilicon products. The company also invests in, develops, constructs, and operates solar photovoltaic power stations; and researches and develops, designs, integrates, and sells lithium battery management and battery systems to electric vehicle and lithium battery manufacturers, and power storage companies. In addition, it trades in solar related parts, equipment, and products; and generates solar power. The company was founded in 1999 and is headquartered in Shanghai, the People's Republic of China. Comtec Solar Systems Group Limited is a subsidiary of Fonty Holdings Limited.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shanghai"
    },
    "CHJI": {
        "short_name": "CHINA CHANG JIANG MINING & NEW ",
        "long_name": "China Changjiang Mining & New Energy Company, Ltd.",
        "summary": "China Changjiang Mining & New Energy Company, Ltd., a development stage company, engages in real estate leasing business in the People's Republic of China. It develops and operates engineering, procurement, and construction projects comprising the Weinan Hechuan 137KWp solar PV building applications. The company also holds land use rights in a land parcel; and leases a portion of the land use rights on the 5.7 square kilometer parcel for the development and operation of a theme park. China Changjiang Mining & New Energy Company, Ltd. is headquartered in Xi'an, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Xi'an"
    },
    "JKS": {
        "short_name": "JinkoSolar Holding Company Limi",
        "long_name": "JinkoSolar Holding Co., Ltd.",
        "summary": "JinkoSolar Holding Co., Ltd., together with its subsidiaries, engages in the design, development, production, and marketing of photovoltaic products. The company offers solar modules, silicon wafers, solar cells, recovered silicon materials, and silicon ingots. It also provides solar system integration services; and develops commercial solar power projects. The company sells its products to distributors, project developers, and system integrators; and utility, commercial, and residential customers under the JinkoSolar brand, as well as on an original equipment manufacturer basis. As of December 31, 2019, it had an integrated annual capacity of 15.0 gigawatt (GW) for silicon wafers, including 11.5 GW for mono wafers; 10.6 GW for solar cells; and 16.0 GW for solar modules. The company has operations in the People's Republic of China, the United States, Japan, Germany, the United Kingdom, Chile, South Africa, India, Mexico, Brazil, the United Arab Emirates, Italy, Spain, France, Belgium, and internationally. JinkoSolar Holding Co., Ltd. was founded in 2006 and is based in Shangrao, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Shangrao"
    },
    "JKS.VI": {
        "short_name": "JINKOSOLAR HOLDING CO ADR",
        "long_name": "JinkoSolar Holding Co., Ltd.",
        "summary": "JinkoSolar Holding Co., Ltd., together with its subsidiaries, engages in the design, development, production, and marketing of photovoltaic products. The company offers solar modules, silicon wafers, solar cells, recovered silicon materials, and silicon ingots. It also provides solar system integration services; and develops commercial solar power projects. The company sells its products to distributors, project developers, and system integrators; and utility, commercial, and residential customers under the JinkoSolar brand, as well as on an original equipment manufacturer basis. As of December 31, 2019, it had an integrated annual capacity of 15.0 gigawatt (GW) for silicon wafers, including 11.5 GW for mono wafers; 10.6 GW for solar cells; and 16.0 GW for solar modules. The company has operations in the People's Republic of China, the United States, Japan, Germany, the United Kingdom, Chile, South Africa, India, Mexico, Brazil, the United Arab Emirates, Italy, Spain, France, Belgium, and internationally. JinkoSolar Holding Co., Ltd. was founded in 2006 and is based in Shangrao, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "VIE",
        "market": "at_market",
        "country": "China",
        "city": "Shangrao"
    },
    "XNYIF": {
        "short_name": "XINYI SOLAR HOLDINGS LIMITED",
        "long_name": "Xinyi Solar Holdings Limited",
        "summary": "Xinyi Solar Holdings Limited, an investment holding company, produces and sells solar glass products in the People's Republic of China, Malaysia, and internationally. It operates through three segments: Sales of Solar Glass; Solar Farm Business; and Engineering, Procurement and Construction Services. The company offers photovolatic power station, ultraclear patterned glasses, back glasses, and AR photovoltaic glasses, as well as double glass modules. It also develops and operates solar farms; and provides engineering, procurement, and construction services. In addition, the company engages in the provision of solar power systems; and trading of solar glass products. Xinyi Solar Holdings Limited was founded in 2008 and is headquartered in Wuhu, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Wuhu"
    },
    "ZJS1.F": {
        "short_name": "JINKOSOLAR ADR/4 DL-00002",
        "long_name": "JinkoSolar Holding Co., Ltd.",
        "summary": "JinkoSolar Holding Co., Ltd., together with its subsidiaries, engages in the design, development, production, and marketing of photovoltaic products. The company offers solar modules, silicon wafers, solar cells, recovered silicon materials, and silicon ingots. It also provides solar system integration services; and develops commercial solar power projects. The company sells its products to distributors, project developers, and system integrators; and utility, commercial, and residential customers under the JinkoSolar brand, as well as on an original equipment manufacturer basis. As of December 31, 2019, it had an integrated annual capacity of 15.0 gigawatt (GW) for silicon wafers, including 11.5 GW for mono wafers; 10.6 GW for solar cells; and 16.0 GW for solar modules. The company has operations in the People's Republic of China, the United States, Japan, Germany, the United Kingdom, Chile, South Africa, India, Mexico, Brazil, the United Arab Emirates, Italy, Spain, France, Belgium, and internationally. JinkoSolar Holding Co., Ltd. was founded in 2006 and is based in Shangrao, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shangrao"
    }
}