{"541.SI": {"short_name": "$ Abundance Intl", "long_name": "Abundance International Limited", "summary": "Abundance International Limited, together with its subsidiaries, engages in the trading of chemical products. It operates through Chemicals, Printing related, and Investment segments. The company offers commodity and specialty chemicals primarily for industrial applications, as well as provides water treatment solutions using microbial and/or chemicals. It also produces books, calendars, and other publications. In addition, the company invests in equity, securities, and other instruments, such as bonds or convertible bonds; and quoted securities and instruments, such as funds and bonds. It operates in the People's Republic of China, Taiwan, Indonesia, Singapore, other countries in Asia, and internationally. The company was formerly known as Craft Print International Limited and changed its name to Abundance International Limited in August 2015. Abundance International Limited was incorporated in 1975 and is based in Singapore.", "currency": "SGD", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "5DS.SI": {"short_name": "$ MegaChem", "long_name": "Megachem Limited", "summary": "Megachem Limited trades in chemicals and chemical-related products in Singapore, Malaysia, Indonesia, the United Kingdom, China, Vietnam, the Philippines, the Middle East, India, and Australia. It distributes performance coatings and polymers; advanced polymer composites; and surface technology, biotech, oil and gas, mining, and lifestyle chemicals. The company also engages in mixing and blending of chemicals according to customers' formulations. Its chemical contract manufacturing services include liquid and solid blending, and repacking services, as well as packaging and relabeling, raw material supply, used drums/tanks washing, lab analysis, and containers stuffing/unstuffing services. The company was founded in 1988 and is headquartered in Singapore.", "currency": "SGD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "5F7.SI": {"short_name": "$ Wilton Resources", "long_name": "Wilton Resources Corporation Limited", "summary": "Wilton Resources Corporation Limited, an investment holding company, engages in the exploration, mining, and production of gold ores in Indonesia. It holds interest in the Ciemas gold project covering a total area of 3,078.5 hectares located in West Java Province of Indonesia. The company is also involved in general trading, transportation, construction, real estate, logging, farming, plantation, forestry, electrical, mechanical, computer, workshop, and printing and services businesses. Wilton Resources Corporation Limited is based in Singapore.", "currency": "SGD", "sector": "Basic Materials", "industry": "Gold", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "5MD.SI": {"short_name": "$ Soon Lian", "long_name": "Soon Lian Holdings Limited", "summary": "Soon Lian Holdings Limited, an investment holding company, operates as a specialist supplier of aluminum alloy products in Singapore, Malaysia, Taiwan, Indonesia, China, and internationally. The company operates through Precision Engineering, Marine, Stockists and Traders, and Other Customers segments. It offers aluminum plates and sheets, rods and bars, extrusions, and special and other metal products. The company supplies its aluminum alloy products for use in shipbuilding-hulls, decks, superstructures, and cabins of catamarans, pleasure crafts, and patrol boats, as well as in crew and rescue boats in offshore oil and gas industry; and precision parts for electronic equipment, precision instruments, medical instrumentation, semiconductor equipment, automated assembly lines, pharmaceutical machinery, and robotics. Its products are also used in aircraft industries, oil tankers, automotive parts, rail coaches, truck frames, and bridges and towers. The company was founded in 1983 and is headquartered in Singapore. Soon Lian Holdings Limited is a subsidiary of Soon Tien Holdings Pte. Ltd.", "currency": "SGD", "sector": "Basic Materials", "industry": "Aluminum", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "5SN.F": {"short_name": "SOON LIAN HLDGS LTD", "long_name": "Soon Lian Holdings Limited", "summary": "Soon Lian Holdings Limited, an investment holding company, operates as a specialist supplier of aluminum alloy products in Singapore, Malaysia, Taiwan, Indonesia, China, and internationally. The company operates through Precision Engineering, Marine, Stockists and Traders, and Other Customers segments. It offers aluminum plates and sheets, rods and bars, extrusions, and special and other metal products. The company supplies its aluminum alloy products for use in shipbuilding-hulls, decks, superstructures, and cabins of catamarans, pleasure crafts, and patrol boats, as well as in crew and rescue boats in offshore oil and gas industry; and precision parts for electronic equipment, precision instruments, medical instrumentation, semiconductor equipment, automated assembly lines, pharmaceutical machinery, and robotics. Its products are also used in aircraft industries, oil tankers, automotive parts, rail coaches, truck frames, and bridges and towers. The company was founded in 1983 and is headquartered in Singapore. Soon Lian Holdings Limited is a subsidiary of Soon Tien Holdings Pte. Ltd.", "currency": "EUR", "sector": "Basic Materials", "industry": "Aluminum", "exchange": "FRA", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "5TP.SI": {"short_name": "$ CNMC Goldmine", "long_name": "CNMC Goldmine Holdings Limited", "summary": "CNMC Goldmine Holdings Limited, an investment holding company, engages in the exploration, development, mining, and marketing of gold in Malaysia. The company also explores for silver, iron, feldspar, lead, and zinc deposits. Its flagship project is the Sokor Gold Field project, which covers an area of 2,370 acres located in the district of Tanah Merah, Kelantan. The company also processes mined ores into gold ores; and provides drilling and non-mining related services, as well as offers underground mining services. The company was founded in 2006 and is headquartered in Singapore.", "currency": "SGD", "sector": "Basic Materials", "industry": "Gold", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "5VJ.SI": {"short_name": "Halcyon Agri", "long_name": "Halcyon Agri Corporation Limited", "summary": "Halcyon Agri Corporation Limited, an investment holding company, originates, produces, and distributes natural rubber products in Singapore, China, the United States, Canada, Europe, rest of Asia, and internationally. It operates through Corrie MacColl Group; HRC Group; SINRIO Group; and Corporate segments. The company processes and produces technically specified rubber, crumb rubber, and latex, as well as constant viscosity rubber products; and owns rubber plantations approximately 110,000 hectares of land in Malaysia and Cameroon. It provides its natural rubber primarily under the HeveaPRO brand, as well as procures other origins and grades of rubber from third party producers. The company offers its products for use in tires, shoe soles, medical gloves, seals, gaskets, and others through a network of logistical assets and sales offices. It is also involved in trading and distribution of natural rubber, latex, and synthetic rubber under the Centrotrade, Wurfbain, Corrie MacColl, Alan L. Grant, Momentum Technologies, and Kelvin Terminals brand names; and manufactures and distributes plastic products, as well as operates oil palm plantations. The company was founded in 1934 and is headquartered in Singapore. As of December 31, 2018, Halcyon Agri Corporation Limited operates as a subsidiary of Sinochem International (Overseas) Pte. Ltd.", "currency": "SGD", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "5WV.SI": {"short_name": "$ AsiaPhos", "long_name": "AsiaPhos Limited", "summary": "AsiaPhos Limited, an investment holding company, manufactures, sells, and trades in phosphate-based chemical products in the People's Republic of China, Singapore, India, the United States, and internationally. The company offers yellow phosphorus, sodium tripolyphosphate, sodium trimetaphosphate, sodium hexametaphosphate, trisodium phosphate, tetra-sodium pyrophosphate, tetrapotassium pyrophosphate, sodium acid pyrophosphate, disodium phosphate, monosodium phosphate, and Phosphoric Acid. It is also involved in the general wholesale trade and trading of chemicals; and provision of Internet technology consulting and transportation services. AsiaPhos Limited was founded in 1996 and is based in Singapore.", "currency": "SGD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "7CN.SG": {"short_name": "CNMC Goldmine Holdings Ltd Regi", "long_name": "CNMC Goldmine Holdings Limited", "summary": "CNMC Goldmine Holdings Limited, an investment holding company, engages in the exploration, development, mining, and marketing of gold in Malaysia. The company also explores for silver, iron, feldspar, lead, and zinc deposits. Its flagship project is the Sokor Gold Field project, which covers an area of 2,370 acres located in the district of Tanah Merah, Kelantan. The company also processes mined ores into gold ores; and provides drilling and non-mining related services, as well as offers underground mining services. The company was founded in 2006 and is headquartered in Singapore.", "currency": "EUR", "sector": "Basic Materials", "industry": "Gold", "exchange": "STU", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "9E5.F": {"short_name": "SAMKO TIMBER LTD", "long_name": "Samko Timber Limited", "summary": "Samko Timber Limited, an integrated wood resource processor, provides primary and secondary processed timber products for residential, commercial, and industrial applications. The company operates through two segment, SGS and ST divisions. The SGS division manufactures and sells primary processed timber products, such as general plywood and laminated veneer lumber; and secondary processed timber products, including truck, piano body parts, and decking products. The ST division trades in various types of timber products; and produces secondary timber products comprising doors and windows. The company is also involved in the wholesale of plywood, sawn timber, logs, and related products; and production of wood panels and flooring products, as well as other wood based furniture. The company's plantation areas cover 1,397 hectares located in Java and Sulawesi, Indonesia. It primarily operates in Indonesia, North Asia, Malaysia, Singapore, the Middle East, Europe, the United States, Australia, South East Asia, and internationally. The company was founded in 1978 and is based in Singapore. Samko Timber Limited is a subsidiary of Sampoerna Forestry Limited.", "currency": "EUR", "sector": "Basic Materials", "industry": "Lumber & Wood Production", "exchange": "FRA", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "A52.SI": {"short_name": "$ AnnAik", "long_name": "AnnAik Limited", "summary": "AnnAik Limited, an investment holding company, manufactures and sells stainless steel piping products in Singapore, the People's Republic of China, South Korea, Malaysia, and internationally. The company operates in four segments: Distribution of Stainless Steel Piping Products; Manufacturing of Steel Flanges; Engineering Construction of Piping Process System; and Environmental Business. The company offers butt-weld, screwed, and high pressure forged steel fittings; stainless steel forged flanges; and ball, flange-end ball, gate, globe, and swing check valves. It also is involved in designing, contracting, and managing engineering projects; the development of environmental technologies, as well as environmental engineering activities; wholesale of metals and metal ores; and provision of import and export agency services. In addition, the company constructs, owns, operates, and manages wastewater treatment plants; constructs and supplies rural wastewater treatment equipment; and provides consulting services in water resource management to governmental and commercial operators. Further, it is involved in the design, fabrication, installation, testing, and commissioning of mechanical system in process plants. AnnAik Limited was founded in 1977 and is based in Singapore.", "currency": "SGD", "sector": "Basic Materials", "industry": "Steel", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "A78.SI": {"short_name": "$ Shen Yao", "long_name": "Shen Yao Holdings Limited", "summary": "Shen Yao Holdings Limited, an investment holding company, engages in the exploration and mining of gold deposits. It holds interests in the Castlemaine Goldfields covering an area of approximately 350 square kilometers in Victoria, Australia. The company was formerly known as LionGold Corp Ltd and changed its name to Shen Yao Holdings Limited in December 2020. Shen Yao Holdings Limited was incorporated in 2004 and is headquartered in Singapore.", "currency": "SGD", "sector": "Basic Materials", "industry": "Gold", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "ASO.SG": {"short_name": "AsiaPhos Ltd. Registered Shares", "long_name": "AsiaPhos Limited", "summary": "AsiaPhos Limited, an investment holding company, manufactures, sells, and trades in phosphate-based chemical products in the People's Republic of China, Singapore, India, the United States, and internationally. The company offers yellow phosphorus, sodium tripolyphosphate, sodium trimetaphosphate, sodium hexametaphosphate, trisodium phosphate, tetra-sodium pyrophosphate, tetrapotassium pyrophosphate, sodium acid pyrophosphate, disodium phosphate, monosodium phosphate, and Phosphoric Acid. It is also involved in the general wholesale trade and trading of chemicals; and provision of Internet technology consulting and transportation services. AsiaPhos Limited was founded in 1996 and is based in Singapore.", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "STU", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "AWG.SI": {"short_name": "AEI^", "long_name": "AEI Corporation Ltd.", "summary": "AEI Corporation Ltd., an investment holding company, manufactures and sells aluminum extrusion products and precision metal components in Singapore, Greater China, Malaysia, and internationally. It operates through Electronics and Precision Engineering, and Construction and Infrastructure Building segments. The Electronics and Precision Engineering segment offers precision aluminum extrusions that form components of products of the high-tech electronics and precision engineering industries. This segment's products are used in electronics and precision engineering components, bio-medical equipment and products, and clean room equipment and structures, as well as in industrial machinery, including machine frames, machinery components, linear tables, and actuators; and technology products for the defense and aerospace industries. The Construction and Infrastructure Building segment offers public infrastructure, building construction, interior fixtures, signages, and advertising panels to the construction, civil engineering, and infrastructure building industries. The company also engages in the manufacture of basic ferrous and non-ferrous metals, and engineering components; and wholesale of scrap, junk, and waste products. AEI Corporation Ltd. was founded in 1983 and is based in Singapore. AEI Corporation Ltd. is a subsidiary of OCBC Securities Private Limited.", "currency": "SGD", "sector": "Basic Materials", "industry": "Aluminum", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "B7K.SI": {"short_name": "Sin Ghee Huat", "long_name": "Sin Ghee Huat Corporation Ltd.", "summary": "Sin Ghee Huat Corporation Ltd., an investment holding company, engages in the trading and sale of stainless steel and specialty metal products in Singapore, Indonesia, China, other ASEAN countries, Australia, New Zealand, India, South America, and the Middle East. It offers seamless and welded pipes, as well as seamless, round, square, and rectangular tubes; butt-welded and forged fittings; flanges; plates; and round, flat, equal angle, U channel, hollow, square, and hexagonal bars, as well as I beams. The company also offers project management services. It serves oil and gas, petrochemical, marine and shipbuilding, construction, food processing, pulp and paper, and pharmaceutical industries. The company was founded in 1939 and is headquartered in Singapore.", "currency": "SGD", "sector": "Basic Materials", "industry": "Steel", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "BAZ.SI": {"short_name": "Lion Asiapac", "long_name": "Lion Asiapac Limited", "summary": "Lion Asiapac Limited, an investment holding company, engages in lime manufacturing and steel trading activities in Malaysia, Indonesia, Singapore, and internationally. The company operates through three segments: Manufacturing of Lime, Trading of Steel Consumables, and Investment Holding/Others. It manufactures and sells quicklime and hydrated lime; and trades in steel manufacturing consumables, such as steel scraps and electrodes. The company was formerly known as Metal Containers Limited and changed its name to Lion Asiapac Limited in 1996. Lion Asiapac Limited was incorporated in 1968 and is headquartered in Singapore.", "currency": "SGD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "BEI.SI": {"short_name": "LHT", "long_name": "LHT Holdings Limited", "summary": "LHT Holdings Limited manufactures and trades in wooden pallets and timber-related products in Singapore, Malaysia, and internationally. It operates through four segments: Pallet/Packaging, Timber Related Products, Technical Wood and Related Products, and Pallet Rental and Others. The Pallet/Packaging segment manufactures and supplies wooden pallets and cases for the packing of industrial products. The Timber Related Products segment trades in raw timber related products. The Technical Wood and Related Products segment manufactures Technical Wood, Technical Wood flooring, and wood waste collection products. The Pallet Rental and Others segment engages in pallet-leasing business. The company also operates as a timber merchant; saw miller; commission agent; and dealer in wood products, pallets, and packaging, as well as recycles and recovers wood waste. In addition, it manufactures, imports, and exports green products and woodchips, as well as provides industrial packaging and heat treatment services. The company was founded in 1977 and is based in Singapore.", "currency": "SGD", "sector": "Basic Materials", "industry": "Lumber & Wood Production", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "BFT.SI": {"short_name": "Fabchem China^", "long_name": "Fabchem China Limited", "summary": "Fabchem China Limited, an investment holding company, manufactures and sells commercial explosive products. It operates through Explosives Devices, Industrial Fuse and Initiating Explosives Devices, and Industrial Detonators segments. The Explosives Devices segment provides boosters to enhance the power of explosions, and oil and gas exploration activities. The Industrial Fuse and Initiating Explosive Devices segment offers detonating cords and non-electric tubes. The Industrial Detonators segment provides non-electric detonators and piston non-electric detonators that are used in methane-free and mine dust-free explosion projects, detonation projects in the mining industry, the excavation of alleys and tunnels, controlled explosions, and underwater demolitions. The company is also involved in the properties holding and management activities, and provision of safety advisory services. It sells its products to customers in the mining, energy exploration and infrastructure construction industries, such as coal mining, hydroelectric construction, oil exploration, road and railway construction and large construction under the Yinguang brand in the People's Republic of China, Australia, Kyrgyzstan, Mongolia, India, Kazakhstan, and Indonesia. The company was founded in 1979 and is based in Singapore. Fabchem China Limited is a subsidiary of Triple Vision Pte. Ltd.", "currency": "SGD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "C8R.SI": {"short_name": "$ Jiutian Chemical", "long_name": "Jiutian Chemical Group Limited", "summary": "Jiutian Chemical Group Limited, an investment holding company, manufactures and sells chemical-based products in the People's Republic of China. The company offers dimethylformamide (DMF), which is used as a feedstock in the production of polyurethane, pharmaceutical, and agro chemical products, as well as an absorbing agent primarily in electronics, acrylic fiber, and pharmaceutical products; and methylamine, a chemical feedstock in the organic chemical industry used in various areas, such as agricultural chemicals, medicines, fuels, synthetic resins, and leather making, as well as in the production of the solvent used for chemical fibers, activating agents, and photography. It also provides sodium hydrosulfite, a crystalline powder for use in water treatment, gas purification, cleaning, and stripping, as well as in the industrial processing of textiles, leather, foods, polymers, photography, and others; industrial and consumable carbon dioxide for use in aerated beverages, tobacco, and preserving vegetables; Oxygen-18, an isotope of oxygen to produce fluorodeoxyglucose; deuterium depleted water to inhibit cancer growth; and industrial methanol. In addition, the company is involved in the sale of downstream products; and research and development of isotope technology. Jiutian Chemical Group Limited was founded in 1994 and is based in Singapore.", "currency": "SGD", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "CHMN.F": {"short_name": "CHINA SUNSINE HLDGS P.S.", "long_name": "China Sunsine Chemical Holdings Ltd.", "summary": "China Sunsine Chemical Holdings Ltd., an investment holding company, manufactures and sells rubber chemicals in the People's Republic of China, rest of Asia, the United States, Europe, and internationally. It offers rubber accelerators, anti-oxidant agents, anti-scorching agents, insoluble sulphur used for the production of tires, and other rubber related products, such as tubes, belts, shoes, rollers, cables, seals, latex products, and other light-color rubber products. The company provides its products under the Sunsine brand name. It is also involved in the production and supply of heating power; and hotel and restaurant business. The company primarily serves the tire companies. China Sunsine Chemical Holdings Ltd. was incorporated in 2006 and is based in Singapore. China Sunsine Chemical Holdings Ltd. is a subsidiary of Success More Group Limited.", "currency": "EUR", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "FRA", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "E6R.SI": {"short_name": "Samko Timber", "long_name": "Samko Timber Limited", "summary": "Samko Timber Limited, an integrated wood resource processor, provides primary and secondary processed timber products for residential, commercial, and industrial applications. The company operates through two segment, SGS and ST divisions. The SGS division manufactures and sells primary processed timber products, such as general plywood and laminated veneer lumber; and secondary processed timber products, including truck, piano body parts, and decking products. The ST division trades in various types of timber products; and produces secondary timber products comprising doors and windows. The company is also involved in the wholesale of plywood, sawn timber, logs, and related products; and production of wood panels and flooring products, as well as other wood based furniture. The company's plantation areas cover 1,397 hectares located in Java and Sulawesi, Indonesia. It primarily operates in Indonesia, North Asia, Malaysia, Singapore, the Middle East, Europe, the United States, Australia, South East Asia, and internationally. The company was founded in 1978 and is based in Singapore. Samko Timber Limited is a subsidiary of Sampoerna Forestry Limited.", "currency": "SGD", "sector": "Basic Materials", "industry": "Lumber & Wood Production", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "HAT.SG": {"short_name": "Halcyon Agri Corporation Ltd. R", "long_name": "Halcyon Agri Corporation Limited", "summary": "Halcyon Agri Corporation Limited, an investment holding company, originates, produces, and distributes natural rubber products in Singapore, China, the United States, Canada, Europe, rest of Asia, and internationally. It operates through Corrie MacColl Group; HRC Group; SINRIO Group; and Corporate segments. The company processes and produces technically specified rubber, crumb rubber, and latex, as well as constant viscosity rubber products; and owns rubber plantations approximately 110,000 hectares of land in Malaysia and Cameroon. It provides its natural rubber primarily under the HeveaPRO brand, as well as procures other origins and grades of rubber from third party producers. The company offers its products for use in tires, shoe soles, medical gloves, seals, gaskets, and others through a network of logistical assets and sales offices. It is also involved in trading and distribution of natural rubber, latex, and synthetic rubber under the Centrotrade, Wurfbain, Corrie MacColl, Alan L. Grant, Momentum Technologies, and Kelvin Terminals brand names; and manufactures and distributes plastic products, as well as operates oil palm plantations. The company was founded in 1934 and is headquartered in Singapore. As of December 31, 2018, Halcyon Agri Corporation Limited operates as a subsidiary of Sinochem International (Overseas) Pte. Ltd.", "currency": "EUR", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "STU", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "KUO.SI": {"short_name": "Intl Cement", "long_name": "International Cement Group Ltd.", "summary": "International Cement Group Ltd., together with its subsidiaries, primarily engages in the production, sale, and distribution of cement in Singapore, Malaysia, Australia, Tajikistan, Afghanistan, Uzbekistan, and internationally. It is also involved in the manufacture and marketing of aluminum extrusions, aluminum panels, and associated architectural aluminum products used for the construction industry. In addition, the company undertakes aluminum architectural contracts; engineering works; and building construction subcontracting projects. Further, it develops prototype equipment for generation of electricity through recycling of shredded tires. The company is based in Singapore. International Cement Group Ltd. is a subsidiary of Victory Gate Ventures Limited.", "currency": "SGD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "M15.SI": {"short_name": "$ Matex Intl", "long_name": "Matex International Limited", "summary": "Matex International Limited engages in the formulation, manufacture, and sale of specialty chemicals worldwide. The company offers dyestuffs, auxiliaries, textile chemicals, optical brighteners, and color measurement and computer aided systems. It is also involved in the import, export, and wholesale of garments, textile products, and chemical products. The company serves textile, paper, leather, detergent, and polymer industries. Matex International Limited was founded in 1989 and is headquartered in Singapore.", "currency": "SGD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "N02.SI": {"short_name": "NSL", "long_name": "NSL Ltd", "summary": "NSL Ltd, an investment holding company, manufactures and sells building materials, refractory materials, and road stones in Singapore, Malaysia, the United Arab Emirates, Finland, Germany, and internationally. It operates through Precast & Prefabricated Bathroom Unit (PBU), Environmental Services, and Investment Holding & Others segments. The company designs, manufactures, supplies, and delivers precast concrete components for building and infrastructure; and PARMA PBU's, as well as cabins for ships and buildings, and marine fire doors. It also collects, manages, recovers, and disposes marine, oily/toxic, and industrial waste. In addition, the company offers other oil-and-chemical services, including cleaning and maintenance of oil interceptors, grease traps, and storage tanks; waste management consultancy; tank rental; and other waste recovery and environmental pollution control projects. Further, it engages in the treatment and recovery of waste oil and oily slops; trading of diesel oil and oil products; disposal of oil and chemical wastes; and ownership and management of Raffles Marina club. The company was incorporated in 1961 and is headquartered in Singapore. NSL Ltd is a subsidiary of 98 Holdings Pte. Ltd.", "currency": "SGD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "OMH.AX": {"short_name": "OM HLDNGS FPO 10C", "long_name": "OM Holdings Limited", "summary": "OM Holdings Limited, an investment holding company, engages in mining, smelting, trading, and marketing ores and ferroalloys. The company operates through Mining, Smelting, and Marketing and Trading segments. It owns Bootu Creek manganese mine that is located in the Northern territory of Australia. The company also provides manganese ferroalloys, ferrosilicon, and manganese sinter ore. In addition, it trades in manganese ore, manganese ferroalloys, ferrosilicon, and sinter ore. The company has operations in Australia, the People's Republic of China, Singapore, Malaysia, and Mauritius. OM Holdings Limited was founded in 1994 and is based in Singapore.", "currency": "AUD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "ASX", "market": "au_market", "country": "Singapore", "city": "Singapore"}, "P52.SI": {"short_name": "PanUnited", "long_name": "Pan-United Corporation Ltd", "summary": "Pan-United Corporation Ltd, an investment holding company, engages in the concrete and logistics businesses in Singapore, China, and internationally. The company operates through three segments: Concrete and Cement, Trading and Shipping, and Others. It manufactures, trades in, and supplies cement, granite, and ready mixed concrete, as well as supplies refined petroleum products to the construction and marine industries. The company also engages in coal and general trading, as well as basic building materials manufacturing and trading activities; and bulk shipping and agency operations. In addition, it is involved in the production of asphalt; building and repairing of roadways; and quarry operations, as well as the provision of software consultancy, information technology, and computer services. Pan-United Corporation Ltd was founded in 1958 and is headquartered in Singapore.", "currency": "SGD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "QES.SI": {"short_name": "ChinaSunsine", "long_name": "China Sunsine Chemical Holdings Ltd.", "summary": "China Sunsine Chemical Holdings Ltd., an investment holding company, manufactures and sells rubber chemicals in the People's Republic of China, rest of Asia, the United States, Europe, and internationally. It offers rubber accelerators, anti-oxidant agents, anti-scorching agents, insoluble sulphur used for the production of tires, and other rubber related products, such as tubes, belts, shoes, rollers, cables, seals, latex products, and other light-color rubber products. The company provides its products under the Sunsine brand name. It is also involved in the production and supply of heating power; and hotel and restaurant business. The company primarily serves the tire companies. China Sunsine Chemical Holdings Ltd. was incorporated in 2006 and is based in Singapore. China Sunsine Chemical Holdings Ltd. is a subsidiary of Success More Group Limited.", "currency": "SGD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "S20.SI": {"short_name": "Straits Trading", "long_name": "The Straits Trading Company Limited", "summary": "The Straits Trading Company Limited, an investment company, has stakes in real estate, hospitality, and resources businesses. It operates through Resources, Real Estate, and Hospitality segments. The company engages in the smelting of tin concentrates and tin bearing materials. It also produces various grades of refined tin metal and by-products; and invests in other metals and mineral resources. In addition, the company invests in, develops, leases, and sells real estate properties; provides property and real estate fund management services; and owns and manages hotels. It has operations in Singapore, Malaysia, Japan, Australia, and China. The company was founded in 1887 and is headquartered in Singapore. The Straits Trading Company Limited is a subsidiary of The Cairns Pte. Ltd.", "currency": "SGD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "S44.SI": {"short_name": "EnGro", "long_name": "EnGro Corporation Limited", "summary": "EnGro Corporation Limited, an investment holding company, manufactures and sells cement and building materials, and specialty polymers primarily in Singapore, Malaysia, the People's Republic of China, and internationally. It operates through four segments: Cement and Building Materials, Specialty Polymer, Investments, and Food and Beverage. The Cement and Building Materials segment manufactures and sells cement and other building materials. It also offers high slag Portland blastfurnace cement, and microfine cement products; ground granulated blastfurnace slag under the VCEM brand name; and ready-mixed concrete under the DuraCrete brand name. The Specialty Polymer segment manufactures and sells thermosetting synthetic resins and plastic materials for use in automotive, electrical and electronics, construction and civil engineering, household and consumer, and packaging sectors. The Investments segment trades in equity and debt securities, as well as holds investments in venture capital and investment funds, and unquoted equity securities. The Food and Beverage segment operates food and beverage outlets under franchise. EnGro Corporation Limited also trades in and wholesales construction chemicals and building materials; and provides carbon consultancy services. The company was formerly known as SsangYong Cement (Singapore) Limited and changed its name to EnGro Corporation Limited in February 2005. EnGro Corporation Limited was founded in 1973 and is headquartered in Singapore.", "currency": "SGD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "SAU.TO": {"short_name": "ST AUGUSTINE GOLD AND COPPER LT", "long_name": "St. Augustine Gold and Copper Limited", "summary": "St. Augustine Gold and Copper Limited, a mineral exploration company, engages in the acquisition, exploration, and evaluation of mineral properties in the Philippines. It holds interests in the King-king copper-gold project covering an area of approximately 1,548 hectares located in the Province of Compostela Valley, Mindanao Island. The company is headquartered in Singapore.", "currency": "CAD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "TOR", "market": "ca_market", "country": "Singapore", "city": "Singapore"}, "SGQ.F": {"short_name": "SIN GHEE HUAT CORP. LTD", "long_name": "Sin Ghee Huat Corporation Ltd.", "summary": "Sin Ghee Huat Corporation Ltd., an investment holding company, engages in the trading and sale of stainless steel and specialty metal products in Singapore, Indonesia, China, other ASEAN countries, Australia, New Zealand, India, South America, and the Middle East. It offers seamless and welded pipes, as well as seamless, round, square, and rectangular tubes; butt-welded and forged fittings; flanges; plates; and round, flat, equal angle, U channel, hollow, square, and hexagonal bars, as well as I beams. The company also offers project management services. It serves oil and gas, petrochemical, marine and shipbuilding, construction, food processing, pulp and paper, and pharmaceutical industries. The company was founded in 1939 and is headquartered in Singapore.", "currency": "EUR", "sector": "Basic Materials", "industry": "Steel", "exchange": "FRA", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "STP.SI": {"short_name": "$ Silkroad Nickel", "long_name": "Silkroad Nickel Ltd.", "summary": "Silkroad Nickel Ltd., together with its subsidiaries, engages in the exploration, mining, production, and sale of nickel ore. The company's nickel mining concession area consists of approximately 1,301 hectares in the Morowali Regency, Central Sulawesi, Indonesia. Silkroad Nickel Ltd. was incorporated in 2005 and is headquartered in Singapore. Silkroad Nickel Ltd. is a subsidiary of Far East Mining Pte. Ltd.", "currency": "SGD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}}