{"BAZ.SI": {"short_name": "Lion Asiapac", "long_name": "Lion Asiapac Limited", "summary": "Lion Asiapac Limited, an investment holding company, engages in lime manufacturing and steel trading activities in Malaysia, Indonesia, Singapore, and internationally. The company operates through three segments: Manufacturing of Lime, Trading of Steel Consumables, and Investment Holding/Others. It manufactures and sells quicklime and hydrated lime; and trades in steel manufacturing consumables, such as steel scraps and electrodes. The company was formerly known as Metal Containers Limited and changed its name to Lion Asiapac Limited in 1996. Lion Asiapac Limited was incorporated in 1968 and is headquartered in Singapore.", "currency": "SGD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "KUO.SI": {"short_name": "Intl Cement", "long_name": "International Cement Group Ltd.", "summary": "International Cement Group Ltd., together with its subsidiaries, primarily engages in the production, sale, and distribution of cement in Singapore, Malaysia, Australia, Tajikistan, Afghanistan, Uzbekistan, and internationally. It is also involved in the manufacture and marketing of aluminum extrusions, aluminum panels, and associated architectural aluminum products used for the construction industry. In addition, the company undertakes aluminum architectural contracts; engineering works; and building construction subcontracting projects. Further, it develops prototype equipment for generation of electricity through recycling of shredded tires. The company is based in Singapore. International Cement Group Ltd. is a subsidiary of Victory Gate Ventures Limited.", "currency": "SGD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "N02.SI": {"short_name": "NSL", "long_name": "NSL Ltd", "summary": "NSL Ltd, an investment holding company, manufactures and sells building materials, refractory materials, and road stones in Singapore, Malaysia, the United Arab Emirates, Finland, Germany, and internationally. It operates through Precast & Prefabricated Bathroom Unit (PBU), Environmental Services, and Investment Holding & Others segments. The company designs, manufactures, supplies, and delivers precast concrete components for building and infrastructure; and PARMA PBU's, as well as cabins for ships and buildings, and marine fire doors. It also collects, manages, recovers, and disposes marine, oily/toxic, and industrial waste. In addition, the company offers other oil-and-chemical services, including cleaning and maintenance of oil interceptors, grease traps, and storage tanks; waste management consultancy; tank rental; and other waste recovery and environmental pollution control projects. Further, it engages in the treatment and recovery of waste oil and oily slops; trading of diesel oil and oil products; disposal of oil and chemical wastes; and ownership and management of Raffles Marina club. The company was incorporated in 1961 and is headquartered in Singapore. NSL Ltd is a subsidiary of 98 Holdings Pte. Ltd.", "currency": "SGD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "P52.SI": {"short_name": "PanUnited", "long_name": "Pan-United Corporation Ltd", "summary": "Pan-United Corporation Ltd, an investment holding company, engages in the concrete and logistics businesses in Singapore, China, and internationally. The company operates through three segments: Concrete and Cement, Trading and Shipping, and Others. It manufactures, trades in, and supplies cement, granite, and ready mixed concrete, as well as supplies refined petroleum products to the construction and marine industries. The company also engages in coal and general trading, as well as basic building materials manufacturing and trading activities; and bulk shipping and agency operations. In addition, it is involved in the production of asphalt; building and repairing of roadways; and quarry operations, as well as the provision of software consultancy, information technology, and computer services. Pan-United Corporation Ltd was founded in 1958 and is headquartered in Singapore.", "currency": "SGD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "S44.SI": {"short_name": "EnGro", "long_name": "EnGro Corporation Limited", "summary": "EnGro Corporation Limited, an investment holding company, manufactures and sells cement and building materials, and specialty polymers primarily in Singapore, Malaysia, the People's Republic of China, and internationally. It operates through four segments: Cement and Building Materials, Specialty Polymer, Investments, and Food and Beverage. The Cement and Building Materials segment manufactures and sells cement and other building materials. It also offers high slag Portland blastfurnace cement, and microfine cement products; ground granulated blastfurnace slag under the VCEM brand name; and ready-mixed concrete under the DuraCrete brand name. The Specialty Polymer segment manufactures and sells thermosetting synthetic resins and plastic materials for use in automotive, electrical and electronics, construction and civil engineering, household and consumer, and packaging sectors. The Investments segment trades in equity and debt securities, as well as holds investments in venture capital and investment funds, and unquoted equity securities. The Food and Beverage segment operates food and beverage outlets under franchise. EnGro Corporation Limited also trades in and wholesales construction chemicals and building materials; and provides carbon consultancy services. The company was formerly known as SsangYong Cement (Singapore) Limited and changed its name to EnGro Corporation Limited in February 2005. EnGro Corporation Limited was founded in 1973 and is headquartered in Singapore.", "currency": "SGD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}}