{
  "GMEI": {
    "city": "San Antonio",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Diversified Investments",
    "long_name": "Gambit Energy, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial",
    "short_name": "GAMBIT ENERGY INC",
    "state": "TX",
    "summary": "Gambit Energy, Inc., an independent oil and natural gas company, engages in the exploration, development, and production of oil and natural gas properties located in Texas. The company has an oil and natural gas property that consists of comprising 4,261 acre of leasehold and is located in the Eagle Ford Shale formation in Zavala County. It also owns and operates two oilfield drilling units on a contract drilling basis comprising an 8,000 feet drilling depth capacity located in Abilene and a 4,000 feet drilling depth capacity located in Crystal City. The company was formerly known as Gulfmark Energy, Inc. and changed its name to Gambit Energy, Inc. in October 2011. Gambit Energy, Inc. is based in San Antonio, Texas.",
    "website": "http://www.gambitenergy.com",
    "zipcode": "78216"
  },
  "NTUR": {
    "city": "Woburn",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Diversified Investments",
    "long_name": "Natural Blue Resources, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial",
    "short_name": "NATURAL BLUE RESOURCES INC",
    "state": "MA",
    "summary": "Natural Blue Resources, Inc., through its subsidiaries, provides recycling and conservation solutions. It offers waste treatment and water purification solutions; purchases, ships, and re-sells recycled steel; and develops drinking water projects. Natural Blue Resources, Inc. was incorporated in 2005 and is based in Woburn, Massachusetts.",
    "website": null,
    "zipcode": "01801"
  },
  "SPDL": {
    "city": "Marco Island",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Diversified Investments",
    "long_name": "Spindle, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial",
    "short_name": "SPINDLE INC",
    "state": "FL",
    "summary": "Spindle, Inc. provides payment-processing services to merchants using its Catalyst Gateway. It also acts as an agent, independent contractor, or referral partner to broker merchants that it secures to other merchant processors for ongoing fees based on processing volume. The company serves small and medium-sized businesses. The company is based in Marco Island, Florida.",
    "website": "http://www.spindle.com",
    "zipcode": "34145"
  },
  "TRBD": {
    "city": "New York",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Diversified Investments",
    "long_name": "Turbodyne Technologies, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial",
    "short_name": "TURBODYNE TECHNOLOGIES INC",
    "state": "NY",
    "summary": "Turbodyne Technologies, Inc. operates as an engineering company. It designs and develops forced-air induction technologies that enhance the performance of gas and diesel internal combustion engines. The company was founded in 1983 and is headquartered in New York, New York.",
    "website": "http://www.turbodyne.net",
    "zipcode": "10107"
  }
}
