{
    "MAC.MX": {
        "short_name": "MACERICH CO",
        "long_name": "The Macerich Company",
        "summary": "Macerich is a fully integrated, self-managed and self-administered real estate investment trust, which focuses on the acquisition, leasing, management, development and redevelopment of regional malls throughout the United States. Macerich currently owns 51 million square feet of real estate consisting primarily of interests in 47 regional shopping centers. Macerich specializes in successful retail properties in many of the country's most attractive, densely populated markets with significant presence in the West Coast, Arizona, Chicago and the Metro New York to Washington, DC corridor. A recognized leader in sustainability, Macerich has achieved the #1 GRESB ranking in the North American Retail Sector for five straight years (2015 Â\u0096 2019).",
        "currency": "MXN",
        "sector": "Financial",
        "industry": "REIT - Retail",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CA",
        "city": "Santa Monica",
        "zipcode": "90401",
        "website": "http://www.macerich.com",
        "market_cap": null
    },
    "RY6.DE": {
        "short_name": "REALTY INC. CORP.  DL 1",
        "long_name": "Realty Income Corporation",
        "summary": "Realty Income, The Monthly Dividend Company, is an S&P 500 company dedicated to providing stockholders with dependable monthly income. The company is structured as a REIT, and its monthly dividends are supported by the cash flow from over 6,500 real estate properties owned under long-term lease agreements with our commercial clients. To date, the company has declared 608 consecutive common stock monthly dividends throughout its 52-year operating history and increased the dividend 109 times since Realty Income's public listing in 1994 (NYSE: O). The company is a member of the S&P 500 Dividend Aristocrats index. Additional information about the company can be obtained from the corporate website at www.realtyincome.com.",
        "currency": "EUR",
        "sector": "Financial",
        "industry": "REIT - Retail",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "CA",
        "city": "San Diego",
        "zipcode": "92130",
        "website": "http://www.realtyincome.com",
        "market_cap": "Large Cap"
    },
    "SQI.DE": {
        "short_name": "SIMON PROPERTY GRP PAIRED",
        "long_name": "Simon Property Group, Inc.",
        "summary": "Simon is a real estate investment trust engaged in the ownership of premier shopping, dining, entertainment and mixed-use destinations and an S&P 100 company (Simon Property Group, NYSE: SPG). Our properties across North America, Europe and Asia provide community gathering places for millions of people every day and generate billions in annual sales.",
        "currency": "EUR",
        "sector": "Financial",
        "industry": "REIT - Retail",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "IN",
        "city": "Indianapolis",
        "zipcode": "46204",
        "website": "http://www.simon.com",
        "market_cap": "Large Cap"
    }
}