{"ATEB.BR": {"short_name": "ATENOR", "long_name": "Atenor SA", "summary": "Atenor SA invests in large-scale real estate projects in Belgium and internationally. It develops office and residential buildings. The company was founded in 1910 and is based in La Hulpe, Belgium.", "currency": "EUR", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "BRU", "market": "be_market", "country": "Belgium", "city": "La Hulpe"}, "BANI.BR": {"short_name": "BANIMMO A", "long_name": "Banimmo SA", "summary": "Banimmo SA engages in the redevelopment of various buildings in Belgium, France, and Luxembourg. It constructs built-to-suit projects in various categories, such as offices, retail projects, and hotels and conference centers. The company is based in Brussels, Belgium.", "currency": "EUR", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "BRU", "market": "be_market", "country": "Belgium", "city": "Brussels"}, "IEP.BR": {"short_name": "IEP INVEST", "long_name": "Iep Invest, NV", "summary": "Iep Invest, NV is an investment firm specializing in investments in and loans to real estate companies. The firm previously operated as manufacturing group. It was formerly known as Punch International nv and changed its name to Iep Invest, NV in May 2014. Iep Invest, NV was founded in 1982 and is based in Antwerp, Belgium.", "currency": "EUR", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "BRU", "market": "be_market", "country": "Belgium", "city": "Antwerp"}, "IMMO.BR": {"short_name": "IMMOBEL", "long_name": "IMMOBEL SA", "summary": "IMMOBEL SA engages in the real estate development activities in Belgium, Luxemburg, Poland, France, Spain, and Germany. It undertakes office, residential development, retail, and landbanking projects, as well as develops mixed real estate projects for living, working, shopping, and leisure activities. It also provides project management and leasing services. The company was formerly known as Allfin NV and changed its name to IMMOBEL SA in June 2016. IMMOBEL SA was founded in 1863 and is headquartered in Brussels, Belgium.", "currency": "EUR", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "BRU", "market": "be_market", "country": "Belgium", "city": "Brussels"}, "WOLE.BR": {"short_name": "WOL. EXTENS. CERT", "long_name": "Woluwe Extension SA", "summary": "Woluwe Extension SA operates a real estate property that functions as a shopping center. The company is based in Brussels, Belgium.", "currency": "EUR", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "BRU", "market": "be_market", "country": "Belgium", "city": "Brussels"}}