{"ETN": {"short_name": "Eaton Corporation, PLC", "long_name": "Eaton Corporation plc", "summary": "Eaton Corporation plc operates as a power management company worldwide. Its Electrical Products segment offers electrical and industrial components, wiring devices, and structural support systems; and residential, single phase power quality, emergency lighting and fire detection, and circuit protection and lighting products. The company's Electrical Systems and Services segment provides power distribution and assemblies, three phase power quality products, hazardous duty electrical equipment, explosion-proof instrumentation, utility power distribution equipment, power reliability equipment, and services. Its Hydraulics segment offers power, controls and sensing, and fluid conveyance products; and filtration systems solutions, industrial drum and disc brakes, and golf grips. The company's Aerospace segment provides hydraulic power generation and fuel systems, controls and sensing, and fluid and conveyance products for commercial and military use. Its Vehicle segment offers transmissions, clutches, hybrid power systems, superchargers, engine valves and valve actuation systems, cylinder heads, locking and limited slip differentials, transmission controls, and fuel vapor components for vehicle industry. The company's eMobility segment provides voltage inverters, converters, fuses, circuit protection units, vehicle controls, power distribution products, fuel tank isolation valves, and commercial vehicle hybrid systems. It serves industrial, institutional, governmental, utility, commercial, residential, information technology, renewable energy, marine, agriculture, oil and gas, construction, mining, forestry, material handling, truck and bus, machine tools, molding, primary metals, and power generation markets, as well as original equipment manufacturers and aftermarket customers. The company was founded in 1916 and is based in Dublin, Ireland.", "currency": "USD", "sector": "Industrials", "industry": "Specialty Industrial Machinery", "exchange": "NYQ", "market": "us_market", "country": "Ireland", "city": "Dublin"}, "I1RP34.SA": {"short_name": "TRANE TECH  DRN", "long_name": "Trane Technologies plc", "summary": "Trane Technologies plc provides climate control solutions for buildings, homes, and transportation. It offers offers air conditioners, exchangers, and handlers; airside and terminal devices; auxiliary power units; chillers; coils and condensers; gensets; furnaces; heat pumps; home automation products; humidifiers; hybrid and non-diesel transport refrigeration, and ice energy storage solutions; indoor air quality; industrial refrigeration products; large and light commercial unitary products;motor replacements; refrigerant reclamation products; thermostats/controls; transport heater products; variable refrigerant flow products; and water source heat pumps. It also provides building management, control, ductless, geothermal, package heating and cooling, temporary heating and cooling, and unitary systems; bus, rail, and multi-pipe heating, ventilation, and air conditioning systems; and container, cryogenic, diesel-powered, industrial, rail, self-powered truck, trailer, and vehicle-powered truck refrigeration systems, as well as aftermarket and OEM parts and supplies. In addition, it offers energy and facility management, installation and performance contracting, repair and maintenance, and rental services. Trane Technologies plc markets and sells its products under the American Standard, Nexia, Thermo King, and Trane brands through sales offices, distributors, and dealers in the United States; and through sales and service companies with a supporting chain of distributors worldwide. The company was formerly known as Ingersoll-Rand Plc and changed its name to Trane Technologies plc in March 2020. Trane Technologies plc was founded in 1885 and is headquartered in Swords, Ireland.", "currency": "BRL", "sector": "Industrials", "industry": "Specialty Industrial Machinery", "exchange": "SAO", "market": "br_market", "country": "Ireland", "city": "Swords"}, "TT": {"short_name": "Trane Technologies plc", "long_name": "Trane Technologies plc", "summary": "Trane Technologies plc provides climate control solutions for buildings, homes, and transportation. It offers offers air conditioners, exchangers, and handlers; airside and terminal devices; auxiliary power units; chillers; coils and condensers; gensets; furnaces; heat pumps; home automation products; humidifiers; hybrid and non-diesel transport refrigeration, and ice energy storage solutions; indoor air quality; industrial refrigeration products; large and light commercial unitary products;motor replacements; refrigerant reclamation products; thermostats/controls; transport heater products; variable refrigerant flow products; and water source heat pumps. It also provides building management, control, ductless, geothermal, package heating and cooling, temporary heating and cooling, and unitary systems; bus, rail, and multi-pipe heating, ventilation, and air conditioning systems; and container, cryogenic, diesel-powered, industrial, rail, self-powered truck, trailer, and vehicle-powered truck refrigeration systems, as well as aftermarket and OEM parts and supplies. In addition, it offers energy and facility management, installation and performance contracting, repair and maintenance, and rental services. Trane Technologies plc markets and sells its products under the American Standard, Nexia, Thermo King, and Trane brands through sales offices, distributors, and dealers in the United States; and through sales and service companies with a supporting chain of distributors worldwide. The company was formerly known as Ingersoll-Rand Plc and changed its name to Trane Technologies plc in March 2020. Trane Technologies plc was founded in 1885 and is headquartered in Swords, Ireland.", "currency": "USD", "sector": "Industrials", "industry": "Specialty Industrial Machinery", "exchange": "NYQ", "market": "us_market", "country": "Ireland", "city": "Swords"}}