{"AEL.JO": {"short_name": "Allied Electronics Corp A", "long_name": "Allied Electronics Corporation Limited", "summary": "Allied Electronics Corporation Limited, through its subsidiaries, provides ICT solutions in South Africa and internationally. It operates through Managed Services, Digital Transformation, Smart IoT, Healthech/Fintech, and Others segments. The Managed Services segment offers hardware and consumables to manage outsource print services, such as installation and training; supplies paper and toner; maintains and services equipment and service contracts; supports and maintains enterprise-wide information products and services; talent management services; and outsourcing services for contact centers and extended capabilities. The Digital Transformation segment provides turnkey solutions for communications and information needs; networking, hardware, software, storage, software integration, SAP and management consulting, Microsoft certified solution, data warehousing, CRM, and support services; information security and risk management, and IT infrastructure solutions; systems integration; and designs, develops, and implements specialised solutions. The Smart IoT segment offers vehicle tracking and recovery systems, fleet management services, and usage-based telematics. The Healthech/Fintech segment provides managed electronic payment solutions, including mobile or online platforms, e-wallet, and medical transaction switching. The Others segment distributes industrial electronic components, such as batteries and solar products; lighting and optics; software and compilers; and semiconductor and aerospace products. Allied Electronics Corporation Limited was founded in 1965 and is headquartered in Parktown, South Africa.", "currency": "ZAc", "sector": "Technology", "industry": "Information Technology Services", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Parktown"}, "ALH.JO": {"short_name": "Alaris Holdings Ltd", "long_name": "Alaris Holdings Limited", "summary": "Alaris Holdings Limited designs, manufactures, and sells specialized broadband antennas and other related radio frequency products primarily in South Africa, the United States, Europe, and Asia. The company operates through Alaris Antennas and COJOT segments. It serves system integrators, frequency spectrum regulators, and players in the homeland security space for use in the communication, frequency spectrum monitoring, test and measurement, electronic warfare, and other specialized markets; and military and public safety markets. The company was formerly known as Poynting Holdings Limited and changed its name to Alaris Holdings Limited in May 2015. Alaris Holdings Limited was founded in 1990 and is based in Centurion, South Africa.", "currency": "ZAc", "sector": "Technology", "industry": "Communication Equipment", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Centurion"}, "AVV.JO": {"short_name": "Alviva Holdings Ltd", "long_name": "Alviva Holdings Limited", "summary": "Alviva Holdings Limited, together with its subsidiaries, provides information and communication technology (ICT) products and services in South Africa, rest of Africa, and internationally. It operates through three segments: ICT Distribution, Services and Solutions, and Financial Services. The ICT Distribution segment imports, assembles, distributes, and sells hardware and software products in sub-Saharan African markets through reseller channels and retail chains. The Services and Solutions segment provides systems integration and ICT solutions, including cybersecurity, application development, and artificial intelligence, as well as undertakes projects in the renewable energy. The Financial Services segment offers asset based finance by providing turnkey solutions, insurance, and financial products to customers for the acquisition of office automation and technology equipment. The company was formerly known as Pinnacle Holdings Limited and changed its name to Alviva Holdings Limited in March 2017. Alviva Holdings Limited was incorporated in 1986 and is headquartered in Midrand, South Africa.", "currency": "ZAc", "sector": "Technology", "industry": "Information Technology Services", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Midrand"}, "AYO.JO": {"short_name": "Ayo Tech Solutions Ltd", "long_name": "AYO Technology Solutions Limited", "summary": "AYO Technology Solutions Limited, through its subsidiaries, provides information and communication technology (ICT) solutions in South Africa, rest of Africa, Europe, India, and the United States. It operates through Software and Consulting, Security Solutions, Unified Communications, Tracking Solutions, Health Care Services, and Managed Services segments. The company offers Enterprise Healthcare Information System, a centralized laboratory information system and health information exchange to the healthcare industry covering public and private health sector organizations; cyber security solutions to blue-chip multinationals, financial institutions, SOE's, and public sector clients, as well as data center infrastructure services; and ICT solutions. It also distributes the poly range of audio, video, and consumer products covering audio and video conferencing products, and headsets. Ayo Technology Solutions Limited was founded in 1996 and is based in Cape Town, South Africa.", "currency": "ZAc", "sector": "Technology", "industry": "Information Technology Services", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Cape Town"}, "CTK.JO": {"short_name": "Cartrack Holdings Ltd", "long_name": "Cartrack Holdings Limited", "summary": "Cartrack Holdings Limited, an investment holding company, provides data analytic solutions for mobile asset management, asset recovery, and workforce optimization based on a Software-as-a-Service platform. The company is involved in the design, development, and installation of telematics technology, data collection and analysis, and the delivery of fleet and mobile asset management solutions, as well as the tracking and recovery of vehicles. It offers fleet management and stolen vehicle recovery solutions; Bike Track, a real-time GPS and telematics solution for commercial motorbike fleet; Mi-Fleet, an administrative and vehicle cost accounting software that manages fleet, drivers, and related operating costs; Communicator, a software application for mobile tablets and phones, which combines communication, navigation, tracking, and task management technologies; Live Vision, a four-camera vehicle video system for fleet owners to have real-time visual contact with their fleet; and Insurance Telematics, a solution for the insurer and the fleet operator to manage driver behavior. The company also provides personal vehicle security products, which include Cartrack Protector, a safety and security package; Stolen Vehicle Recovery solution; Bike Recovery, a tracking device used for stolen motorbike recovery; crash alert/ambulance services; Car Watch, a solution for the detection and reporting of unauthorized vehicle activity; and Insurance Telematics, a solution for the insurer and the insured to manage driver behavior. It serves small, medium, and large fleets, as well as businesses and consumers in 23 countries in Africa, Europe, North America, the Asia-Pacific, and the Middle East. The company was founded in 2001 and is based in Johannesburg, South Africa.", "currency": "ZAc", "sector": "Technology", "industry": "Software—Application", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Johannesburg"}, "DTC.JO": {"short_name": "Datatec Ltd", "long_name": "Datatec Limited", "summary": "Datatec Limited provides information and communication technology (ICT) solutions and services worldwide. The company operates in three segments: Westcon International; Logicalis; and Corporate, Management Consulting and Financial Services. The Westcon International segment distributes cyber security and network infrastructure solutions, unified communications products, data center solutions, and channel services. It offers solutions through a network of service providers, systems integrators, and specialty resellers under the Westcon and Comstor brands. The Logicalis segment provides ICT infrastructure solutions and services with a focus on data center and cloud services, security and network infrastructure, workspace communications and collaboration, data and information strategies, and IT operation modernization. The Corporate, Consulting, and Financial Services segment provides strategic, trusted advisory, modeling, and market intelligence services to the telecoms, media, and technology industries, as well as finance leasing services. Datatec Limited was founded in 1986 and is headquartered in Sandown, South Africa.", "currency": "ZAc", "sector": "Technology", "industry": "Information Technology Services", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Sandown"}, "ELI.JO": {"short_name": "Ellies Holdings Ltd", "long_name": "Ellies Holdings Limited", "summary": "Ellies Holdings Limited, an investment holding company, engages in the manufacture, import, wholesale, and distribution of LED lighting, electrical, and electronic products and solutions to the residential and commercial sectors in South Africa, Botswana, Namibia, and Swaziland. It operates in two segments, Trading and Distribution and Manufacturing. The company provides aerial and satellite television equipment, accessories and hardware, photovoltaic solar panels, and cable and fiber distribution networks, as well as signal, sound, and audio-visual solutions in the business sector. It also develops, manufactures, and sells terrestrial antennae; and light metal products, such as wall brackets, shelving, satellite and terrestrial mounting brackets, and satellite dishes, as well as LED and plasma TV mounts. In addition, the company offers wizard remote blaster and video senders; and vacuum and plastic blister packaging products. Ellies Holdings Limited was founded in 1979 and is based in Sandton, South Africa.", "currency": "ZAc", "sector": "Technology", "industry": "Communication Equipment", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Sandton"}, "EOH.JO": {"short_name": "EOH Holdings Ltd", "long_name": "EOH Holdings Limited", "summary": "EOH Holdings Limited provides information and communications technology (ICT) services in South Africa, rest of Africa, Europe, and the Middle East. The company offers industry consulting, IT services, systems integration, software, industrial technologies, and business process outsourcing services. Its services include go-to-market solutions, network solutions, manage and operate digital industries, knowledge process outsourcing, computer software and hardware reselling, enterprise applications, application development, data analysis, cloud and security, and automation solutions. The company also offers infrastructure solutions; information services; rapid application development platform that allows the agile enterprise to build, model, and deploy multi-experience apps; and systems and services for the administration of cities. EOH Holdings Limited was incorporated in 1998 and is based in Bedfordview, South Africa.", "currency": "ZAc", "sector": "Technology", "industry": "Information Technology Services", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Bedfordview"}, "ETO.JO": {"short_name": "Etion Limited", "long_name": "Etion Limited", "summary": "Etion Limited provides original design manufacturing, safety and productivity, digital network, and cyber security solutions in South Africa, Australia, the rest of Africa, and the Middle East. The company designs, develops, and manufactures various electronic and digital technologies for external customers; and develops customized and generic electronic subsystems, as well as products for clients in the aerospace and defense, cyber security, mining, industrial, and transportation sectors. It also provides digital safety and environment management systems that include IoT devices and custom software for transport and logistics, mining, and energy sectors; and offers asset management and maintenance services. In addition, the company offers connectivity and communications products and solutions for fiber and wireless deployment, data and digital radio communications networks, network monitoring, and power-related infrastructure, as well as services for data center environments; and cybersecurity solutions and services, such as SSL certificates and certificate management systems, FIDO certified strong authentication, digital signature and approval solutions, managed public key infrastructure, biometric enrolment and matching systems, and insider threat prevention solutions. The company was formerly known as Ansys Limited. Etion Limited was founded in 1987 and is headquartered in Centurion, South Africa.", "currency": "ZAc", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Centurion"}, "LAB.JO": {"short_name": "Labat Africa Ltd", "long_name": "Labat Africa Limited", "summary": "Labat Africa Limited, an investment holding company, engages in designing and marketing integrated circuits worldwide. The company operates through Technology, Logistics, Fuel Distribution and Logistics, and Properties segments. It also transports coals and minerals for mines in South Africa. In addition, the company accommodates the businesses of technology and fuel distribution; provides mobile surveillance and tracking solutions for transport, logistics, and fleet, vehicle, and passenger markets. Labat Africa Limited was founded in 1995 and is based in Roodepoort, South Africa.", "currency": "ZAc", "sector": "Technology", "industry": "Semiconductors", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Roodepoort"}, "MST.JO": {"short_name": "Mustek Ltd", "long_name": "Mustek Limited", "summary": "Mustek Limited procures, assembles, distributes, and services personal computers and complementary information and communications technology (ICT) products in South Africa. It offers 3D printing products; computing products; tablets; displays; energy solutions, such as power back up products, LED lighting products, monitoring systems, batteries, and solar panels; networking and enterprise products; printers and scanners; point-of-sale solutions; training services; and peripherals, including flash memory storage and external USBs. The company was founded in 1987 and is headquartered in Midrand, South Africa.", "currency": "ZAc", "sector": "Technology", "industry": "Computer Hardware", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Midrand"}, "NT1.JO": {"short_name": "Net 1 UEPS Tech Inc", "long_name": "Net 1 UEPS Technologies, Inc.", "summary": "Net 1 UEPS Technologies, Inc. provides transaction processing services, financial inclusion products and services, and secure payment technologies in South Africa, the Republic of Korea, and internationally. It operates through three segments: South African Transaction Processing, International Transaction Processing, and Financial Inclusion and Applied Technologies. The South African Transaction Processing segment primarily offers transaction processing for retailers, utilities, and banks. The International Transaction Processing segment offers payment processing services to merchants and card issuers. The Financial Inclusion and Applied Technologies segment provides short-term loans and bank accounts. It also sells prepaid products, such as electricity and airtime, hardware and software, and life insurance products. In addition, this segment distributes starter packs; and provides financing to Cell C for expanding the components of Cell C's telecommunications infrastructure in South Africa. The company was incorporated in 1997 and is headquartered in Johannesburg, South Africa.", "currency": "ZAc", "sector": "Technology", "industry": "Software—Infrastructure", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Johannesburg"}, "NWL.JO": {"short_name": "Nu-World Hldgs Ltd", "long_name": "Nu-World Holdings Limited", "summary": "Nu-World Holdings Limited, together with its subsidiaries, manufactures, imports, assembles, markets, and distributes branded consumer durables in South Africa, Australia, Brazil, Hong Kong, the United Arab Emirates, and Lesotho. The company offers consumer electronics, hi-tech products, small electrical appliances, white goods, liquors, furniture, and personal protective equipment. The company was founded in 1946 and is headquartered in Johannesburg, South Africa.", "currency": "ZAc", "sector": "Technology", "industry": "Consumer Electronics", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Johannesburg"}, "PBG.JO": {"short_name": "PBT Group Limited", "long_name": "PBT Group Limited", "summary": "PBT Group Limited, together with its subsidiaries, provides specialized consulting services to finance, insurance, healthcare, retail, and telecommunication sectors in South Africa, Europe, and Australia. The company engages in the fields of data platform, data engineering, data analytics, data visualization, application development, cloud solutions, and strategic consulting. It offers specialist healthcare management solutions and services, including real time claims processing, query capabilities, electronic data interchange, document management services, and membership and contribution management, as well as medical savings account management to medical aid and managed care sectors. The company also provides business intelligence services; and develops micro PC's and embedded devices, and mobile apps. In addition, it develops business systems, mobile applications, and Web applications comprising software development lifecycle, business analysis, and software architecture and development. The company was formerly known as Prescient Limited and change to PBT Group Limited. PBT Group Limited was founded in 1998 and is based in Cape Town, South Africa.", "currency": "ZAc", "sector": "Technology", "industry": "Information Technology Services", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Cape Town"}, "SEB.JO": {"short_name": "Sebata Holdings Ltd", "long_name": "Sebata Holdings Limited", "summary": "Sebata Holdings Limited provides enterprise management, water management, and ICT solutions to municipalities, public entities, provincial government, and the private sector in South Africa. The company operates through four divisions: Water Technologies, Software Solutions, Consultancy Services, and ICT Support Services. It offers software solutions, such as PROMUN, a public-sector accounting package that incorporates general ledger, creditors, orders, cashbook, stores, payroll, HR, costing, consolidated debtors, fixed assets, and loan registers; integrated technology solutions, enterprise management systems, and multi-disciplinary professional services; and information communication technology solutions and services to municipal fresh produce providers. The company also offers consultancy services, including utility management services comprising credit control, indigent register management, data cleansing, data enrichment, geo-spatial field data management, meter reading, and meter installation and maintenance; and accounting and professional services. In addition, it provides electronic water control and prepayment devices; and plastic water meters, ball valves, and meter boxes. In addition, it offers telecommunication network services; network architecture design, managed IT, backup disaster recovery, cloud, security, and anti-virus solutions, as well as remote monitoring, and remote and telephonic support services. The company was formerly known as MICROmega Holdings Limited and changed its name to Sebata Holdings Limited in November 2018. The company is headquartered in Sandton, South Africa. Sebata Holdings Limited is a subsidiary of Laird Investments (Pty) Ltd.", "currency": "ZAc", "sector": "Technology", "industry": "Software—Application", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Sandton"}, "UEPS": {"short_name": "Net 1 UEPS Technologies, Inc.", "long_name": "Net 1 UEPS Technologies, Inc.", "summary": "Net 1 UEPS Technologies, Inc. provides transaction processing services, financial inclusion products and services, and secure payment technologies in South Africa, the Republic of Korea, and internationally. It operates through three segments: South African Transaction Processing, International Transaction Processing, and Financial Inclusion and Applied Technologies. The South African Transaction Processing segment primarily offers transaction processing for retailers, utilities, and banks. The International Transaction Processing segment offers payment processing services to merchants and card issuers. The Financial Inclusion and Applied Technologies segment provides short-term loans and bank accounts. It also sells prepaid products, such as electricity and airtime, hardware and software, and life insurance products. In addition, this segment distributes starter packs; and provides financing to Cell C for expanding the components of Cell C's telecommunications infrastructure in South Africa. The company was incorporated in 1997 and is headquartered in Johannesburg, South Africa.", "currency": "USD", "sector": "Technology", "industry": "Software—Infrastructure", "exchange": "NMS", "market": "us_market", "country": "South Africa", "city": "Johannesburg"}}