{
  "AEE.JO": {
    "city": "Cape Town",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Information Technology Services",
    "long_name": "African Equity Empowerment Investments Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "African Equity Emp Inv Ltd",
    "state": null,
    "summary": "African Equity Empowerment Investments Limited formerly known as Sekunjalo Investments Limited is a private equity firm specializing in acquisitions, PIPEs, and buyouts. It seeks to invest in companies operating in the food, fishing & brands, marine, biotherapeutics , healthcare & beauty, pharmaceuticals, information technology, telecommunication, Mobile solutions, solar energy, financial services, aquaculture, biotechnology, enterprise development, tourism, events management including entertainment, and travel sectors. The firm prefers to invest companies based in South Africa and outside South Africa in Asia, Dubai, Saudi Arabia, Spain, the UK, the USA, Ghana, Uganda, Zambia, Cameroon, Tanzania, Nigeria, Namibia, Kenya, Zimbabwe, Botswana, Ethiopia, Lesotho, Eswatini (previously Swaziland), Malawi, Mauritius, Côte d'Ivoire, France, Belgium, and Canada. It is open to acquiring non-controlling and majority stakes. The firm invests using its balance sheet and personal capital. African Equity Empowerment Investments Limited was founded in May 1996 and is based in Cape Town, South Africa.",
    "website": "http://aeei.co.za",
    "zipcode": "8001"
  },
  "AEL.JO": {
    "city": "Parktown",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Information Technology Services",
    "long_name": "Allied Electronics Corporation Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "Allied Electronics Corp A",
    "state": null,
    "summary": "Allied Electronics Corporation Limited, through its subsidiaries, provides ICT solutions in South Africa and internationally. It operates through Managed Services, Digital Transformation, Smart IoT, Healthech/Fintech, and Others segments. The Managed Services segment offers hardware and consumables to manage outsource print services, such as installation and training; supplies paper and toner; maintains and services equipment and service contracts; supports and maintains enterprise-wide information products and services; talent management services; and outsourcing services for contact centers and extended capabilities. The Digital Transformation segment provides turnkey solutions for communications and information needs; networking, hardware, software, storage, software integration, SAP and management consulting, Microsoft certified solution, data warehousing, CRM, and support services; information security and risk management, and IT infrastructure solutions; systems integration; and designs, develops, and implements specialised solutions. The Smart IoT segment offers vehicle tracking and recovery systems, fleet management services, and usage-based telematics. The Healthech/Fintech segment provides managed electronic payment solutions, including mobile or online platforms, e-wallet, and medical transaction switching. The Others segment distributes industrial electronic components, such as batteries and solar products; lighting and optics; software and compilers; and semiconductor and aerospace products. Allied Electronics Corporation Limited was founded in 1965 and is headquartered in Parktown, South Africa.",
    "website": "http://www.altron.com",
    "zipcode": "2193"
  },
  "ALH.JO": {
    "city": "Centurion",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Communication Equipment",
    "long_name": "Alaris Holdings Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "Alaris Holdings Ltd",
    "state": null,
    "summary": "Alaris Holdings Limited designs, manufactures, and sells specialized broadband antennas and other related radio frequency products primarily in South Africa, the United States, Europe, and Asia. The company operates through Alaris Antennas and COJOT segments. It serves system integrators, frequency spectrum regulators, and players in the homeland security space for use in the communication, frequency spectrum monitoring, test and measurement, electronic warfare, and other specialized markets; and military and public safety markets. The company was formerly known as Poynting Holdings Limited and changed its name to Alaris Holdings Limited in May 2015. Alaris Holdings Limited was founded in 1990 and is based in Centurion, South Africa.",
    "website": "http://www.alarisholdings.com",
    "zipcode": "0157"
  },
  "ARH.JO": {
    "city": "Durban",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Electronics & Computer Distribution",
    "long_name": "ARB Holdings Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "ARB Holdings Limited",
    "state": null,
    "summary": "ARB Holdings Limited, an investment and property holding company, engages in the trading and distribution of electrical, lighting, and related products. It operates through Electrical, Lighting, and Corporate divisions. The company provides power and instrumentation cables, overhead line hardware and conductors, and general low-voltage products to large and heavy industry, government and parastatals, construction, mining, electrical contractor, domestic/do-it-yourself (DIY), and export markets. It also imports and distributes energy saving, LED, and fluorescent lamps; light fittings; commercial and project lighting products; and a range of electrical accessories, as well as fans and lighting components to retail chains, independent DIY chains, hardware stores, specialized lighting shops, and electrical wholesalers. In addition, the company offers IT hardware and software, and support services, as well as holds and rents a portfolio of 16 properties. ARB Holdings Limited was founded in 1980 and is based in Durban, South Africa.",
    "website": "http://www.arbhold.co.za",
    "zipcode": "4133"
  },
  "AVV.JO": {
    "city": "Midrand",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Information Technology Services",
    "long_name": "Alviva Holdings Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "Alviva Holdings Ltd",
    "state": null,
    "summary": "Alviva Holdings Limited, together with its subsidiaries, provides information and communication technology (ICT) products and services in South Africa, rest of Africa, and internationally. It operates through three segments: ICT Distribution, Services and Solutions, and Financial Services. The ICT Distribution segment imports, assembles, distributes, and sells hardware and software products in sub-Saharan African markets through reseller channels and retail chains. The Services and Solutions segment provides systems integration and ICT solutions, including cybersecurity, application development, and artificial intelligence, as well as undertakes projects in the renewable energy. The Financial Services segment offers asset based finance by providing turnkey solutions, insurance, and financial products to customers for the acquisition of office automation and technology equipment. The company was formerly known as Pinnacle Holdings Limited and changed its name to Alviva Holdings Limited in March 2017. Alviva Holdings Limited was incorporated in 1986 and is headquartered in Midrand, South Africa.",
    "website": "http://www.alvivaholdings.com",
    "zipcode": "1685"
  },
  "AYO.JO": {
    "city": "Cape Town",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Information Technology Services",
    "long_name": "AYO Technology Solutions Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "Ayo Tech Solutions Ltd",
    "state": null,
    "summary": "AYO Technology Solutions Limited, through its subsidiaries, provides information and communication technology (ICT) solutions in South Africa, rest of Africa, Europe, India, and the United States. It operates through Software and Consulting, Security Solutions, Unified Communications, Tracking Solutions, Health Care Services, and Managed Services segments. The company offers Enterprise Healthcare Information System, a centralized laboratory information system and health information exchange to the healthcare industry covering public and private health sector organizations; cyber security solutions to blue-chip multinationals, financial institutions, SOE's, and public sector clients, as well as data center infrastructure services; and ICT solutions. It also distributes the poly range of audio, video, and consumer products covering audio and video conferencing products, and headsets. Ayo Technology Solutions Limited was founded in 1996 and is based in Cape Town, South Africa.",
    "website": "http://ayotsl.com",
    "zipcode": "8001"
  },
  "CTA.JO": {
    "city": "Sandton",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Information Technology Services",
    "long_name": "Capital Appreciation Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "CAPITAL APPRECIATION LTD",
    "state": null,
    "summary": "Capital Appreciation Limited, together with its subsidiaries, owns, manages, invests in, and promotes established and developing financial technology enterprises, their platforms, solutions, products, and applications in South Africa and internationally. It operates in two segments, Payments & Payment Infrastructure, and Software & Services. The company provides payment infrastructure and related technology services to established financial institutions, emerging payment service providers, hospitality industries, and retail operators. It also designs, develops, and implements end-to-end solutions, such as full service device fleet management to institutional clients and corporate customers; supplies electronic point-of-sale devices; and offers merchants with a single device for the banking and non-banking products and services. In addition, the company provides multi-product and multi-party transacting platform for the facilitation of business-to-business payment related products in conjunction with institutional client base. Further, Capital Appreciation Limited offers software development, consulting and integration services, and technology based product solutions to banking and other financial institutions, which enable clients to perform business processing functions, meet regulatory requirements, integrate with trading platforms and exchanges, and secure sensitive information. The company was formerly known as Firefly Investment 285 Proprietary Limited and changed its name to Capital Appreciation Limited in June 2015. Capital Appreciation Limited was incorporated in 2014 and is based in Sandton, South Africa.",
    "website": "http://www.capitalappreciation.co.za",
    "zipcode": "2196"
  },
  "DTC.JO": {
    "city": "Sandown",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Information Technology Services",
    "long_name": "Datatec Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "Datatec Ltd",
    "state": null,
    "summary": "Datatec Limited, together with its subsidiaries, provides information and communication technology (ICT) solutions and services worldwide. The company operates in three segments: Westcon International; Logicalis; and Corporate, Management Consulting and Financial Services. The Westcon International segment distributes security, networking, collaboration, networking and data centre, and cloud products, as well as global deployment and services. It offers solutions through a network of service providers, systems integrators, and specialty resellers under the Westcon and Comstor brands. The Logicalis segment provides ICT infrastructure solutions and services with a focus on data center and cloud services, security and network infrastructure, workspace communications and collaboration, data and information strategies, and IT operation modernization. The Corporate, Management Consulting and Financial Services segment provides strategic, trusted advisory, modeling, and market intelligence services to the telecoms, media, and technology industries, as well as capital/leasing services. Datatec Limited was founded in 1986 and is headquartered in Sandown, South Africa.",
    "website": "http://www.datatec.com",
    "zipcode": "2031"
  },
  "ELI.JO": {
    "city": "Sandton",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Communication Equipment",
    "long_name": "Ellies Holdings Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "Ellies Holdings Ltd",
    "state": null,
    "summary": "Ellies Holdings Limited, an investment holding company, engages in the manufacture, import, wholesale, and distribution of LED lighting, electrical, and electronic products and solutions to the residential and commercial sectors in South Africa, Botswana, Namibia, and Swaziland. It operates in two segments, Trading and Distribution and Manufacturing. The company provides aerial and satellite television equipment, accessories and hardware, photovoltaic solar panels, and cable and fiber distribution networks, as well as signal, sound, and audio-visual solutions in the business sector. It also develops, manufactures, and sells terrestrial antennae; and light metal products, such as wall brackets, shelving, satellite and terrestrial mounting brackets, and satellite dishes, as well as LED and plasma TV mounts. In addition, the company offers wizard remote blaster and video senders; and vacuum and plastic blister packaging products. Ellies Holdings Limited was founded in 1979 and is based in Sandton, South Africa.",
    "website": "http://elliesholdings.com",
    "zipcode": "2090"
  },
  "EOH.JO": {
    "city": "Bedfordview",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Information Technology Services",
    "long_name": "EOH Holdings Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "EOH Holdings Ltd",
    "state": null,
    "summary": "EOH Holdings Limited provides information and communications technology (ICT) services in South Africa, rest of Africa, Europe, and the Middle East. The company offers industry consulting, IT services, systems integration, software, industrial technologies, and business process outsourcing services. Its services include go-to-market solutions, network solutions, manage and operate digital industries, knowledge process outsourcing, computer software and hardware reselling, enterprise applications, application development, data analysis, cloud and security, and automation solutions. The company also offers infrastructure solutions; information services; rapid application development platform that allows the agile enterprise to build, model, and deploy multi-experience apps; and systems and services for the administration of cities. EOH Holdings Limited was incorporated in 1998 and is based in Bedfordview, South Africa.",
    "website": "http://www.eoh.co.za",
    "zipcode": "2007"
  },
  "ETO.JO": {
    "city": "Centurion",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Etion Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "Etion Limited",
    "state": null,
    "summary": "Etion Limited provides original design manufacturing, safety and productivity, digital network, and cyber security solutions in South Africa, Australia, the rest of Africa, and the Middle East. The company designs, develops, and manufactures various electronic and digital technologies for external customers; and develops customized and generic electronic subsystems, as well as products for clients in the aerospace and defense, cyber security, mining, industrial, and transportation sectors. It also provides digital safety and environment management systems that include IoT devices and custom software for transport and logistics, mining, and energy sectors; and offers asset management and maintenance services. In addition, the company offers connectivity and communications products and solutions for fiber and wireless deployment, data and digital radio communications networks, network monitoring, and power-related infrastructure, as well as services for data center environments; and cybersecurity solutions and services, such as SSL certificates and certificate management systems, FIDO certified strong authentication, digital signature and approval solutions, managed public key infrastructure, biometric enrolment and matching systems, and insider threat prevention solutions. The company was formerly known as Ansys Limited. Etion Limited was founded in 1987 and is headquartered in Centurion, South Africa.",
    "website": "http://www.etion.co.za",
    "zipcode": "0157"
  },
  "ISA.JO": {
    "city": "Sandton",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Software - Infrastructure",
    "long_name": "ISA Holdings Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "ISA Holdings Limited",
    "state": null,
    "summary": "ISA Holdings Limited, an investment holding company, provides network, Internet, and information security solutions to the sub-Saharan African market. The company offers various managed security services, such as MSS assist service, which provides the customer with telephonic and email access to IT security specialists; MSS access service for secure remote access in the security systems; MSS monitor service, a monitoring service; and MSS manage service that offers administrative, maintenance, and security infrastructure management functions for the clients. It also provides training services for IT professionals. The company was founded in 1998 and is based in Sandton, South Africa.",
    "website": "http://www.isaholdings.co.za",
    "zipcode": null
  },
  "LAB.JO": {
    "city": "Roodepoort",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Semiconductors",
    "long_name": "Labat Africa Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "Labat Africa Ltd",
    "state": null,
    "summary": "Labat Africa Limited, an investment holding company, designs and markets integrated circuits South Africa. The company operates through Technology, Bulk Logistics, and Healthcare segments. It engages in the transportation of coals and minerals for mines in South Africa; and healthcare business. Labat Africa Limited was founded in 1995 and is based in Roodepoort, South Africa.",
    "website": "http://labat.co.za",
    "zipcode": "1709"
  },
  "MST.JO": {
    "city": "Midrand",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Computer Hardware",
    "long_name": "Mustek Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "Mustek Ltd",
    "state": null,
    "summary": "Mustek Limited procures, assembles, distributes, and services personal computers and complementary information and communications technology (ICT) products in South Africa. It offers 3D printing products; computing products; tablets; displays; energy solutions, such as power back up products, LED lighting products, monitoring systems, batteries, and solar panels; networking and enterprise products; printers and scanners; point-of-sale solutions; training services; and peripherals, including flash memory storage and external USBs. The company was founded in 1987 and is headquartered in Midrand, South Africa.",
    "website": "http://www.mustek.co.za",
    "zipcode": "1685"
  },
  "NT1.JO": {
    "city": "Johannesburg",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Software - Infrastructure",
    "long_name": "Net 1 UEPS Technologies, Inc.",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "Net 1 UEPS Tech Inc",
    "state": null,
    "summary": "Net 1 UEPS Technologies, Inc. provides transaction processing services, financial inclusion products and services, and secure payment technologies in South Africa, the Republic of Korea, and internationally. It operates through three segments: South African Transaction Processing, International Transaction Processing, and Financial Inclusion and Applied Technologies. The South African Transaction Processing segment primarily offers transaction processing for retailers, utilities, and banks. The International Transaction Processing segment offers payment processing services to merchants and card issuers. The Financial Inclusion and Applied Technologies segment provides short-term loans and bank accounts. It also sells prepaid products, such as electricity and airtime, hardware and software, and life insurance products. In addition, this segment distributes starter packs; and provides financing to Cell C for expanding the components of Cell C's telecommunications infrastructure in South Africa. The company was incorporated in 1997 and is headquartered in Johannesburg, South Africa.",
    "website": "http://www.net1.com",
    "zipcode": "2196"
  },
  "NWL.JO": {
    "city": "Johannesburg",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Consumer Electronics",
    "long_name": "Nu-World Holdings Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "Nu-World Hldgs Ltd",
    "state": null,
    "summary": "Nu-World Holdings Limited, together with its subsidiaries, manufactures, imports, assembles, markets, and distributes branded consumer durables in South Africa, Australia, Brazil, Hong Kong, the United Arab Emirates, and Lesotho. The company offers consumer electronics, hi-tech products, small electrical appliances, white goods, liquors, furniture, and personal protective equipment. The company was founded in 1946 and is headquartered in Johannesburg, South Africa.",
    "website": "http://www.nuworld.co.za",
    "zipcode": "2090"
  },
  "PBG.JO": {
    "city": "Cape Town",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Information Technology Services",
    "long_name": "PBT Group Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "PBT Group Limited",
    "state": null,
    "summary": "PBT Group Limited, together with its subsidiaries, provides specialized consulting services to finance, insurance, healthcare, retail, and telecommunication sectors in South Africa, Europe, and Australia. The company engages in the fields of data platform, data engineering, data analytics, data visualization, application development, cloud solutions, and strategic consulting. It offers specialist healthcare management solutions and services, including real time claims processing, query capabilities, electronic data interchange, document management services, and membership and contribution management, as well as medical savings account management to medical aid and managed care sectors. The company also provides business intelligence services; and develops micro PC's and embedded devices, and mobile apps. In addition, it develops business systems, mobile applications, and Web applications comprising software development lifecycle, business analysis, and software architecture and development. The company was formerly known as Prescient Limited and change to PBT Group Limited. PBT Group Limited was founded in 1998 and is based in Cape Town, South Africa.",
    "website": "http://www.pbtgroup.co.za",
    "zipcode": "7441"
  },
  "RY7A.F": {
    "city": "Parktown",
    "country": "South Africa",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Allied Electronics Corporation Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "ALLIED ELECTR. A RC-,02",
    "state": null,
    "summary": "Allied Electronics Corporation Limited, through its subsidiaries, provides ICT solutions in South Africa and internationally. It operates through Managed Services, Digital Transformation, Smart IoT, Healthech/Fintech, and Others segments. The Managed Services segment offers hardware and consumables to manage outsource print services, such as installation and training; supplies paper and toner; maintains and services equipment and service contracts; supports and maintains enterprise-wide information products and services; talent management services; and outsourcing services for contact centers and extended capabilities. The Digital Transformation segment provides turnkey solutions for communications and information needs; networking, hardware, software, storage, software integration, SAP and management consulting, Microsoft certified solution, data warehousing, CRM, and support services; information security and risk management, and IT infrastructure solutions; systems integration; and designs, develops, and implements specialised solutions. The Smart IoT segment offers vehicle tracking and recovery systems, fleet management services, and usage-based telematics. The Healthech/Fintech segment provides managed electronic payment solutions, including mobile or online platforms, e-wallet, and medical transaction switching. The Others segment distributes industrial electronic components, such as batteries and solar products; lighting and optics; software and compilers; and semiconductor and aerospace products. Allied Electronics Corporation Limited was founded in 1965 and is headquartered in Parktown, South Africa.",
    "website": "http://www.altron.com",
    "zipcode": "2193"
  },
  "SEB.JO": {
    "city": "Sandton",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Software - Application",
    "long_name": "Sebata Holdings Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "Sebata Holdings Ltd",
    "state": null,
    "summary": "Sebata Holdings Limited provides enterprise management, water management, and ICT solutions to municipalities, public entities, provincial government, and the private sector in South Africa. The company operates through four divisions: Water Technologies, Software Solutions, Consultancy Services, and ICT Support Services. It offers software solutions, such as PROMUN, a public-sector accounting package that incorporates general ledger, creditors, orders, cashbook, stores, payroll, HR, costing, consolidated debtors, fixed assets, and loan registers; integrated technology solutions, enterprise management systems, and multi-disciplinary professional services; and information communication technology solutions and services to municipal fresh produce providers. The company also offers consultancy services, including utility management services comprising credit control, indigent register management, data cleansing, data enrichment, geo-spatial field data management, meter reading, and meter installation and maintenance; and accounting and professional services. In addition, it provides electronic water control and prepayment devices; and plastic water meters, ball valves, and meter boxes. In addition, it offers telecommunication network services; network architecture design, managed IT, backup disaster recovery, cloud, security, and anti-virus solutions, as well as remote monitoring, and remote and telephonic support services. The company was formerly known as MICROmega Holdings Limited and changed its name to Sebata Holdings Limited in November 2018. The company is headquartered in Sandton, South Africa. Sebata Holdings Limited is a subsidiary of Laird Investments (Pty) Ltd.",
    "website": "http://www.micromega.co.za",
    "zipcode": "2196"
  },
  "SVB.JO": {
    "city": "Pretoria",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Software - Application",
    "long_name": "SilverBridge Holdings Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "Silverbridge Holdings",
    "state": null,
    "summary": "SilverBridge Holdings Limited, together with its subsidiaries, provides business solutions to the financial services industry. The company provides Exergy, an insurance software solution that administers life, group schemes, EB, and pensions on one system; and FAIS Compliance, which facilitates the remote management of FAIS fit and proper and complaints. It also offers data solutions and digital forms; and TOM, an artificial intelligence technology that digitalizes business processes to enhance customer efficiency and service. In addition, the company offers implementation and support, hosting and outsourcing, research and development, and managed services, as well as provides software rental, and other license and maintenance services. Further, it provides advisory and consulting and data analytics solutions and services. The company operates in South Africa, Namibia, Kenya, Zimbabwe, Ghana, Lesotho, Botswana, Mauritius, Nigeria, Mozambique, Zambia, Malawi, and Tanzania. SilverBridge Holdings Limited was founded in 1995 and is based in Pretoria, South Africa.",
    "website": "http://www.silverbridge.co.za",
    "zipcode": "0048"
  },
  "UEPS": {
    "city": "Johannesburg",
    "country": "South Africa",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Software - Infrastructure",
    "long_name": "Net 1 UEPS Technologies, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "Net 1 UEPS Technologies, Inc.",
    "state": null,
    "summary": "Net 1 UEPS Technologies, Inc. provides transaction processing services, financial inclusion products and services, and secure payment technologies in South Africa, the Republic of Korea, and internationally. It operates through three segments: South African Transaction Processing, International Transaction Processing, and Financial Inclusion and Applied Technologies. The South African Transaction Processing segment primarily offers transaction processing for retailers, utilities, and banks. The International Transaction Processing segment offers payment processing services to merchants and card issuers. The Financial Inclusion and Applied Technologies segment provides short-term loans and bank accounts. It also sells prepaid products, such as electricity and airtime, hardware and software, and life insurance products. In addition, this segment distributes starter packs; and provides financing to Cell C for expanding the components of Cell C's telecommunications infrastructure in South Africa. The company was incorporated in 1997 and is headquartered in Johannesburg, South Africa.",
    "website": "http://www.net1.com",
    "zipcode": "2196"
  }
}
