{
  "AEE.JO": {
    "city": "Cape Town",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Information Technology Services",
    "long_name": "African Equity Empowerment Investments Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "African Equity Emp Inv Ltd",
    "state": null,
    "summary": "African Equity Empowerment Investments Limited formerly known as Sekunjalo Investments Limited is a private equity firm specializing in acquisitions, PIPEs, and buyouts. It seeks to invest in companies operating in the food, fishing & brands, marine, biotherapeutics , healthcare & beauty, pharmaceuticals, information technology, telecommunication, Mobile solutions, solar energy, financial services, aquaculture, biotechnology, enterprise development, tourism, events management including entertainment, and travel sectors. The firm prefers to invest companies based in South Africa and outside South Africa in Asia, Dubai, Saudi Arabia, Spain, the UK, the USA, Ghana, Uganda, Zambia, Cameroon, Tanzania, Nigeria, Namibia, Kenya, Zimbabwe, Botswana, Ethiopia, Lesotho, Eswatini (previously Swaziland), Malawi, Mauritius, Côte d'Ivoire, France, Belgium, and Canada. It is open to acquiring non-controlling and majority stakes. The firm invests using its balance sheet and personal capital. African Equity Empowerment Investments Limited was founded in May 1996 and is based in Cape Town, South Africa.",
    "website": "http://aeei.co.za",
    "zipcode": "8001"
  },
  "AEL.JO": {
    "city": "Parktown",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Information Technology Services",
    "long_name": "Allied Electronics Corporation Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "Allied Electronics Corp A",
    "state": null,
    "summary": "Allied Electronics Corporation Limited, through its subsidiaries, provides ICT solutions in South Africa and internationally. It operates through Managed Services, Digital Transformation, Smart IoT, Healthech/Fintech, and Others segments. The Managed Services segment offers hardware and consumables to manage outsource print services, such as installation and training; supplies paper and toner; maintains and services equipment and service contracts; supports and maintains enterprise-wide information products and services; talent management services; and outsourcing services for contact centers and extended capabilities. The Digital Transformation segment provides turnkey solutions for communications and information needs; networking, hardware, software, storage, software integration, SAP and management consulting, Microsoft certified solution, data warehousing, CRM, and support services; information security and risk management, and IT infrastructure solutions; systems integration; and designs, develops, and implements specialised solutions. The Smart IoT segment offers vehicle tracking and recovery systems, fleet management services, and usage-based telematics. The Healthech/Fintech segment provides managed electronic payment solutions, including mobile or online platforms, e-wallet, and medical transaction switching. The Others segment distributes industrial electronic components, such as batteries and solar products; lighting and optics; software and compilers; and semiconductor and aerospace products. Allied Electronics Corporation Limited was founded in 1965 and is headquartered in Parktown, South Africa.",
    "website": "http://www.altron.com",
    "zipcode": "2193"
  },
  "AVV.JO": {
    "city": "Midrand",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Information Technology Services",
    "long_name": "Alviva Holdings Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "Alviva Holdings Ltd",
    "state": null,
    "summary": "Alviva Holdings Limited, together with its subsidiaries, provides information and communication technology (ICT) products and services in South Africa, rest of Africa, and internationally. It operates through three segments: ICT Distribution, Services and Solutions, and Financial Services. The ICT Distribution segment imports, assembles, distributes, and sells hardware and software products in sub-Saharan African markets through reseller channels and retail chains. The Services and Solutions segment provides systems integration and ICT solutions, including cybersecurity, application development, and artificial intelligence, as well as undertakes projects in the renewable energy. The Financial Services segment offers asset based finance by providing turnkey solutions, insurance, and financial products to customers for the acquisition of office automation and technology equipment. The company was formerly known as Pinnacle Holdings Limited and changed its name to Alviva Holdings Limited in March 2017. Alviva Holdings Limited was incorporated in 1986 and is headquartered in Midrand, South Africa.",
    "website": "http://www.alvivaholdings.com",
    "zipcode": "1685"
  },
  "AYO.JO": {
    "city": "Cape Town",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Information Technology Services",
    "long_name": "AYO Technology Solutions Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "Ayo Tech Solutions Ltd",
    "state": null,
    "summary": "AYO Technology Solutions Limited, through its subsidiaries, provides information and communication technology (ICT) solutions in South Africa, rest of Africa, Europe, India, and the United States. It operates through Software and Consulting, Security Solutions, Unified Communications, Tracking Solutions, Health Care Services, and Managed Services segments. The company offers Enterprise Healthcare Information System, a centralized laboratory information system and health information exchange to the healthcare industry covering public and private health sector organizations; cyber security solutions to blue-chip multinationals, financial institutions, SOE's, and public sector clients, as well as data center infrastructure services; and ICT solutions. It also distributes the poly range of audio, video, and consumer products covering audio and video conferencing products, and headsets. Ayo Technology Solutions Limited was founded in 1996 and is based in Cape Town, South Africa.",
    "website": "http://ayotsl.com",
    "zipcode": "8001"
  },
  "CTA.JO": {
    "city": "Sandton",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Information Technology Services",
    "long_name": "Capital Appreciation Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "CAPITAL APPRECIATION LTD",
    "state": null,
    "summary": "Capital Appreciation Limited, together with its subsidiaries, owns, manages, invests in, and promotes established and developing financial technology enterprises, their platforms, solutions, products, and applications in South Africa and internationally. It operates in two segments, Payments & Payment Infrastructure, and Software & Services. The company provides payment infrastructure and related technology services to established financial institutions, emerging payment service providers, hospitality industries, and retail operators. It also designs, develops, and implements end-to-end solutions, such as full service device fleet management to institutional clients and corporate customers; supplies electronic point-of-sale devices; and offers merchants with a single device for the banking and non-banking products and services. In addition, the company provides multi-product and multi-party transacting platform for the facilitation of business-to-business payment related products in conjunction with institutional client base. Further, Capital Appreciation Limited offers software development, consulting and integration services, and technology based product solutions to banking and other financial institutions, which enable clients to perform business processing functions, meet regulatory requirements, integrate with trading platforms and exchanges, and secure sensitive information. The company was formerly known as Firefly Investment 285 Proprietary Limited and changed its name to Capital Appreciation Limited in June 2015. Capital Appreciation Limited was incorporated in 2014 and is based in Sandton, South Africa.",
    "website": "http://www.capitalappreciation.co.za",
    "zipcode": "2196"
  },
  "DTC.JO": {
    "city": "Sandown",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Information Technology Services",
    "long_name": "Datatec Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "Datatec Ltd",
    "state": null,
    "summary": "Datatec Limited, together with its subsidiaries, provides information and communication technology (ICT) solutions and services worldwide. The company operates in three segments: Westcon International; Logicalis; and Corporate, Management Consulting and Financial Services. The Westcon International segment distributes security, networking, collaboration, networking and data centre, and cloud products, as well as global deployment and services. It offers solutions through a network of service providers, systems integrators, and specialty resellers under the Westcon and Comstor brands. The Logicalis segment provides ICT infrastructure solutions and services with a focus on data center and cloud services, security and network infrastructure, workspace communications and collaboration, data and information strategies, and IT operation modernization. The Corporate, Management Consulting and Financial Services segment provides strategic, trusted advisory, modeling, and market intelligence services to the telecoms, media, and technology industries, as well as capital/leasing services. Datatec Limited was founded in 1986 and is headquartered in Sandown, South Africa.",
    "website": "http://www.datatec.com",
    "zipcode": "2031"
  },
  "EOH.JO": {
    "city": "Bedfordview",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Information Technology Services",
    "long_name": "EOH Holdings Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "EOH Holdings Ltd",
    "state": null,
    "summary": "EOH Holdings Limited provides information and communications technology (ICT) services in South Africa, rest of Africa, Europe, and the Middle East. The company offers industry consulting, IT services, systems integration, software, industrial technologies, and business process outsourcing services. Its services include go-to-market solutions, network solutions, manage and operate digital industries, knowledge process outsourcing, computer software and hardware reselling, enterprise applications, application development, data analysis, cloud and security, and automation solutions. The company also offers infrastructure solutions; information services; rapid application development platform that allows the agile enterprise to build, model, and deploy multi-experience apps; and systems and services for the administration of cities. EOH Holdings Limited was incorporated in 1998 and is based in Bedfordview, South Africa.",
    "website": "http://www.eoh.co.za",
    "zipcode": "2007"
  },
  "PBG.JO": {
    "city": "Cape Town",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Information Technology Services",
    "long_name": "PBT Group Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "PBT Group Limited",
    "state": null,
    "summary": "PBT Group Limited, together with its subsidiaries, provides specialized consulting services to finance, insurance, healthcare, retail, and telecommunication sectors in South Africa, Europe, and Australia. The company engages in the fields of data platform, data engineering, data analytics, data visualization, application development, cloud solutions, and strategic consulting. It offers specialist healthcare management solutions and services, including real time claims processing, query capabilities, electronic data interchange, document management services, and membership and contribution management, as well as medical savings account management to medical aid and managed care sectors. The company also provides business intelligence services; and develops micro PC's and embedded devices, and mobile apps. In addition, it develops business systems, mobile applications, and Web applications comprising software development lifecycle, business analysis, and software architecture and development. The company was formerly known as Prescient Limited and change to PBT Group Limited. PBT Group Limited was founded in 1998 and is based in Cape Town, South Africa.",
    "website": "http://www.pbtgroup.co.za",
    "zipcode": "7441"
  },
  "RY7A.F": {
    "city": "Parktown",
    "country": "South Africa",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Allied Electronics Corporation Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "ALLIED ELECTR. A RC-,02",
    "state": null,
    "summary": "Allied Electronics Corporation Limited, through its subsidiaries, provides ICT solutions in South Africa and internationally. It operates through Managed Services, Digital Transformation, Smart IoT, Healthech/Fintech, and Others segments. The Managed Services segment offers hardware and consumables to manage outsource print services, such as installation and training; supplies paper and toner; maintains and services equipment and service contracts; supports and maintains enterprise-wide information products and services; talent management services; and outsourcing services for contact centers and extended capabilities. The Digital Transformation segment provides turnkey solutions for communications and information needs; networking, hardware, software, storage, software integration, SAP and management consulting, Microsoft certified solution, data warehousing, CRM, and support services; information security and risk management, and IT infrastructure solutions; systems integration; and designs, develops, and implements specialised solutions. The Smart IoT segment offers vehicle tracking and recovery systems, fleet management services, and usage-based telematics. The Healthech/Fintech segment provides managed electronic payment solutions, including mobile or online platforms, e-wallet, and medical transaction switching. The Others segment distributes industrial electronic components, such as batteries and solar products; lighting and optics; software and compilers; and semiconductor and aerospace products. Allied Electronics Corporation Limited was founded in 1965 and is headquartered in Parktown, South Africa.",
    "website": "http://www.altron.com",
    "zipcode": "2193"
  }
}
