{
    "1949.HK": {
        "short_name": "PLATT NERA",
        "long_name": "Platt Nera International Limited",
        "summary": "Platt Nera International Limited provides IT integrated solutions and support services to financial institutions, government departments, and agencies primarily in administrative, telecommunications, and utilities sectors in Thailand. Its IT integrated solutions comprise a range of services, including design and planning, assessment of hardware and/or software options, sourcing and sale of hardware and/or software, system installation, and launch to trial operation and maintenance, such as system upgrades for existing systems. The company also provides operational, support, upgrade, and maintenance services to IT system. Platt Nera International Limited was founded in 2004 and is headquartered in Bangkok, Thailand. Platt Nera International Limited is a subsidiary of Pynk Holding Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10110",
        "website": "http://www.plattnera.com",
        "market_cap": "Small Cap"
    },
    "AI.BK": {
        "short_name": "ASIAN INSULATORS PUBLIC COMPANY",
        "long_name": "Asian Insulators Public Company Limited",
        "summary": "Asian Insulators Public Company Limited, together with its subsidiaries, manufactures and distributes porcelain insulators products for electricity distribution and transmission lines. It offers spool, strain, line post type, pin post type, suspension, station post type, cleat, porcelain, and horizontal mounting solid core line post insulators; and underground cable support products. The company provides services for design, supply, and installation of high voltage substation, distribution, and transmission line systems; and project management, industrial maintenance, construction, and engineering services to the water, power, and communications industries. It is also involved in producing and distributing biodiesel, vegetable oil, and other fuel oil; and exporting vegetable oil under the Pamola brand. In addition, the company offers local and overseas logistics services for passenger, merchandise, parcel, and other materials; and ports and rental tank farms services. Further, it trades in electrical equipment. Asian Insulators Public Company Limited was founded in 1981 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10230",
        "website": "http://www.asianinsulators.com",
        "market_cap": "Small Cap"
    },
    "AIT.BK": {
        "short_name": "ADVANCED INFORMATION TECHNOLOGY",
        "long_name": "Advanced Information Technology Public Company Limited",
        "summary": "Advanced Information Technology Public Company Limited, together with its subsidiaries, designs, sells, installs, services, repairs, maintains, and trains information and communication technology network systems in Thailand. The company operates in two segments, Sales and Service, and Rental of Equipment. It provides solutions, including carrier grade router/switch, Web/video caching, DDOS protection, software-defined networking or the network controlled by the program to work as defined, network function virtualization, and other. The company also offers data center and cloud solutions, such as consolidation and virtualization, unified data center, converged and hyper converged infrastructure, private and public cloud infrastructure, software-defined networking or the network controlled by the program, and other. In addition, it provides collaboration solutions comprising communication through IP/VoIP system or unified communication, video and Web conferencing, contact center, and others; and various enterprise network solutions consisting of router, switch, wireless LAN, WAN optimization, security, application delivery control, DNS server, identity system, network management, and other. Further, the company offers the services in the development of information technology systems to various projects with the combination of concepts in applying technology with the framework in developing the system accordingly. Additionally, it provides managed services managing complicated IT system; and maintenance service on checking the operational condition of the system, which enables the system to operate continually and reduce the downtime period, and preventing problem to occur simultaneously, as well as spare parts for saving the time in solving the problem and mitigating the risks from the damage of equipment. The company was founded in 1992 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10320",
        "website": "http://www.ait.co.th",
        "market_cap": "Small Cap"
    },
    "AJA-R.BK": {
        "short_name": "AJ ADVANCE TECHNOLOGY PUBLIC CO",
        "long_name": "AJ Advance Technology Public Company Limited",
        "summary": "AJ Advance Technology Public Company Limited, together with its subsidiaries, engages in the wholesale and retail of electric appliances under the AJ brand in Thailand. It retails and wholesales audio and visual products, home appliances, mobile phones, and accessories. The company also provides top-up services for prepaid phone and service prepaid kiosks. In addition, it is also involved in the distribution of sport shoes; retail of top-up machines; logistic and export business, including TV drama programs and other entertainment media businesses; and provision of e-money services and accept payment through electronic methods. The company was formerly known as Crown Tech Advance Public Company Limited and changed its sport shoes name to AJ Advance Technology Public Company Limited in June 2017. AJ Advance Technology Public Company Limited was founded in 2001 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10150",
        "website": "http://www.ajthai.com",
        "market_cap": "Small Cap"
    },
    "AJA.BK": {
        "short_name": "AJ ADVANCE TECHNOLOGY PUBLIC CO",
        "long_name": "AJ Advance Technology Public Company Limited",
        "summary": "AJ Advance Technology Public Company Limited, together with its subsidiaries, engages in the wholesale and retail of electric appliances under the AJ brand in Thailand. It retails and wholesales audio and visual products, home appliances, mobile phones, and accessories. The company also provides top-up services for prepaid phone and service prepaid kiosks. In addition, it is also involved in the distribution of sport shoes; retail of top-up machines; logistic and export business, including TV drama programs and other entertainment media businesses; and provision of e-money services and accept payment through electronic methods. The company was formerly known as Crown Tech Advance Public Company Limited and changed its sport shoes name to AJ Advance Technology Public Company Limited in June 2017. AJ Advance Technology Public Company Limited was founded in 2001 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10150",
        "website": "http://www.ajthai.com",
        "market_cap": "Small Cap"
    },
    "AKR-R.BK": {
        "short_name": "EKARAT ENGINEERING PUBLIC COMPA",
        "long_name": "Ekarat Engineering Public Company Limited",
        "summary": "Ekarat Engineering Public Company Limited manufactures and distributes transformers and solar farms in Thailand. It also distributes solar cells and solar panel; and engages in the solar electric power business. The company was founded in 1981 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10250",
        "website": "http://www.ekarat.co.th",
        "market_cap": "Small Cap"
    },
    "AKR.BK": {
        "short_name": "EKARAT ENGINEERING PUBLIC COMPA",
        "long_name": "Ekarat Engineering Public Company Limited",
        "summary": "Ekarat Engineering Public Company Limited manufactures and distributes transformers and solar farms in Thailand. It also distributes solar cells and solar panel; and engages in the solar electric power business. The company was founded in 1981 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10250",
        "website": "http://www.ekarat.co.th",
        "market_cap": "Small Cap"
    },
    "ALT.BK": {
        "short_name": "ALT TELECOM PUBLIC COMPANY LIMI",
        "long_name": "ALT Telecom Public Company Limited",
        "summary": "ALT Telecom Public Company Limited engages in the manufacture, installation, maintenance, rental, and sale of telecommunication network equipment in Thailand and internationally. It operates through three segments: Network Equipment and Electricity Meter Distribution, Network Equipment Installation Business, and Network Equipment Rental Business. The company also manufactures, assembles, installs, and distributes electricity meter; and offers telecommunication products comprising fiber optic cables, telecom shelters, antennas, batteries, and other telecommunication equipment, as well as rapid deployment products. In addition, it is involved in the construction of base stations; installation of equipment and optical fiber cables; lease and management of telecommunication basic structures; and sale, installation, and maintenance of electrical equipment and systems. The company was founded in 2001 and is headquartered in Bang Kruay, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bang Kruai",
        "zipcode": "11130",
        "website": "http://www.alt.co.th",
        "market_cap": "Small Cap"
    },
    "APP-R.BK": {
        "short_name": "APPLICAD PUBLIC COMPANY LIMITED",
        "long_name": "Applicad Public Company Limited",
        "summary": "Applicad Public Company Limited sells computer programs and provides maintenance services for computer programs. The company offers computer software for engineering, construction, and architecture services; computer and spare parts; and machines and equipment, as well as materials and other products. It offers education solution and other related services, as well as designs and manufactures industrial parts and prototypes. In addition, the company distributes AutoCAD drawing, 3D pipe drawing, and 3D software in industrial design. The company is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10260",
        "website": "http://www.applicadthai.com",
        "market_cap": null
    },
    "APP.BK": {
        "short_name": "APPLICAD PUBLIC COMPANY LIMITED",
        "long_name": "Applicad Public Company Limited",
        "summary": "Applicad Public Company Limited sells computer programs and provides maintenance services for computer programs. The company offers computer software for engineering, construction, and architecture services; computer and spare parts; and machines and equipment, as well as materials and other products. It offers education solution and other related services, as well as designs and manufactures industrial parts and prototypes. In addition, the company distributes AutoCAD drawing, 3D pipe drawing, and 3D software in industrial design. The company is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10260",
        "website": "http://www.applicadthai.com",
        "market_cap": "Small Cap"
    },
    "CCET-R.BK": {
        "short_name": "CAL-COMP ELECTRONICS (THAILAND)",
        "long_name": "Cal-Comp Electronics (Thailand) Public Company Limited",
        "summary": "Cal-Comp Electronics (Thailand) Public Company Limited, together with its subsidiaries, engages in the manufacture of electronic products worldwide. The company offers computers and computer peripherals, such as mainboards, external hard disk drives, NAS and PCBA for hard disk drives, USB pen drives, storage server PCBA, and assembly products, as well as ink-jet printers, laser printers, multi-function printers, dot-matrix printers, and large format printers; telecommunication products, including set-top boxes and their component parts, and Bluetooth headsets; and smart appliances that comprise smart TV, mirrors, and POS machines, as well as digital camera PCBA and media players. It also provides consumer electronics, which include facial cleaning brushes, iron brushes, cordless airbrush makeup kits, displays, electronic keyboards, hubs, rovers, and calculators; intelligent warehouse, machinery, and robotics, as well as smart factory products; smart beauty products comprising facial moisturizing sprays, facial cleaning brushes, facial massagers, and electric toothbrushes; and healthcare and wearable devices. In addition, the company offers semiconductor design and packaging services; and robotic applications for edutainment and smart service products. Cal-Comp Electronics (Thailand) Public Company Limited was founded in 1989 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10110",
        "website": "http://www.calcomp.co.th",
        "market_cap": "Small Cap"
    },
    "CCET.BK": {
        "short_name": "CAL-COMP ELECTRONICS (THAILAND)",
        "long_name": "Cal-Comp Electronics (Thailand) Public Company Limited",
        "summary": "Cal-Comp Electronics (Thailand) Public Company Limited, together with its subsidiaries, engages in the manufacture of electronic products worldwide. The company offers computers and computer peripherals, such as mainboards, external hard disk drives, NAS and PCBA for hard disk drives, USB pen drives, storage server PCBA, and assembly products, as well as ink-jet printers, laser printers, multi-function printers, dot-matrix printers, and large format printers; telecommunication products, including set-top boxes and their component parts, and Bluetooth headsets; and smart appliances that comprise smart TV, mirrors, and POS machines, as well as digital camera PCBA and media players. It also provides consumer electronics, which include facial cleaning brushes, iron brushes, cordless airbrush makeup kits, displays, electronic keyboards, hubs, rovers, and calculators; intelligent warehouse, machinery, and robotics, as well as smart factory products; smart beauty products comprising facial moisturizing sprays, facial cleaning brushes, facial massagers, and electric toothbrushes; and healthcare and wearable devices. In addition, the company offers semiconductor design and packaging services; and robotic applications for edutainment and smart service products. Cal-Comp Electronics (Thailand) Public Company Limited was founded in 1989 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10110",
        "website": "http://www.calcomp.co.th",
        "market_cap": "Small Cap"
    },
    "CIG-R.BK": {
        "short_name": "C.I.GROUP PUBLIC COMPANY LIMITE",
        "long_name": "C.I. Group Public Company Limited",
        "summary": "C.I. Group Public Company Limited manufactures and distributes air conditioning and refrigeration products and parts in Thailand. The company provides D-Coat, 5MM, aluminum, condenser, water, evaporator, and tube-in-tube exchanger coils; heavy duty air purifiers, air handling units, air cooled condensers, condensing units, unit coolers, and air purifier; and chillers. It also offers building envelope products, such as KingZip, a zipped roofing system; K-Dek; foilback systems, including gutters, safety systems, light solutions, and specialist fabrications; BENCHMARK and Kingspan insulated products; architectural wall panels; and cold store systems. In addition, the company provides ARII smart solutions, a software solution for energy and environmental meters, and cold room packs. Further, it offers coil replacement and AHU renovation; M&E design; and cold room/store and smart solutions design and installation services. Additionally, the company provides maintenance and inspection services for air conditioning and refrigeration products and parts; locomotive construction and maintenance services; and construction of electricity production and distribution systems, as well as operates a hotel. It offers its products directly to customers in Asia and Europe; and through sales agents in the United States, Canada, Australia, and New Zealand. C.I. Group Public Company Limited was founded in 1983 and is headquartered in Pathum Thani, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Pathum Thani",
        "zipcode": "12000",
        "website": "http://www.cigpcl.com",
        "market_cap": "Small Cap"
    },
    "CIG.BK": {
        "short_name": "C.I.GROUP PUBLIC COMPANY LIMITE",
        "long_name": "C.I. Group Public Company Limited",
        "summary": "C.I. Group Public Company Limited manufactures and distributes air conditioning and refrigeration products and parts in Thailand. The company provides D-Coat, 5MM, aluminum, condenser, water, evaporator, and tube-in-tube exchanger coils; heavy duty air purifiers, air handling units, air cooled condensers, condensing units, unit coolers, and air purifier; and chillers. It also offers building envelope products, such as KingZip, a zipped roofing system; K-Dek; foilback systems, including gutters, safety systems, light solutions, and specialist fabrications; BENCHMARK and Kingspan insulated products; architectural wall panels; and cold store systems. In addition, the company provides ARII smart solutions, a software solution for energy and environmental meters, and cold room packs. Further, it offers coil replacement and AHU renovation; M&E design; and cold room/store and smart solutions design and installation services. Additionally, the company provides maintenance and inspection services for air conditioning and refrigeration products and parts; locomotive construction and maintenance services; and construction of electricity production and distribution systems, as well as operates a hotel. It offers its products directly to customers in Asia and Europe; and through sales agents in the United States, Canada, Australia, and New Zealand. C.I. Group Public Company Limited was founded in 1983 and is headquartered in Pathum Thani, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Pathum Thani",
        "zipcode": "12000",
        "website": "http://www.cigpcl.com",
        "market_cap": "Small Cap"
    },
    "COM7-R.BK": {
        "short_name": "COM7 PUBLIC COMPANY LIMITED",
        "long_name": "Com7 Public Company Limited",
        "summary": "Com7 Public Company Limited, together with its subsidiaries, sells IT products, mobiles, and accessories in Thailand. The company also develops computer software; provides repair and other services, as well as training services; and offers ICT infrastructure solutions. In addition, it engages in distribution activities. The company offers products through its retail outlets. Com7 Public Company Limited is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10260",
        "website": "http://www.comseven.com",
        "market_cap": "Mid Cap"
    },
    "COMAN-R.BK": {
        "short_name": "COMANCHE INTERNATIONAL PUBLIC C",
        "long_name": "Comanche International Public Company Limited",
        "summary": "Comanche International Public Company Limited, together with its subsidiaries, provides information technology solutions for hotels and serviced apartments. It offers hospitality industry management systems with integrated modules, such as front office, point of sale, call accounting, back office with accounts payable, accounts receivable, general ledger, and inventory control. The company also sells computers and computer software, as well as provides maintenance services and other services relating to computer software. It operates in Thailand, Myanmar, Vietnam, Laos, Australia, Cambodia, Hong Kong, Macau, China, Japan, Indonesia, the Philippines, Maldives, Malaysia, Taiwan, India, Sri Lanka, and Singapore. The company was incorporated in 2003 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10310",
        "website": "http://www.comancheinternational.com",
        "market_cap": "Small Cap"
    },
    "COMAN.BK": {
        "short_name": "COMANCHE INTERNATIONAL PUBLIC C",
        "long_name": "Comanche International Public Company Limited",
        "summary": "Comanche International Public Company Limited, together with its subsidiaries, provides information technology solutions for hotels and serviced apartments. It offers hospitality industry management systems with integrated modules, such as front office, point of sale, call accounting, back office with accounts payable, accounts receivable, general ledger, and inventory control. The company also sells computers and computer software, as well as provides maintenance services and other services relating to computer software. It operates in Thailand, Myanmar, Vietnam, Laos, Australia, Cambodia, Hong Kong, Macau, China, Japan, Indonesia, the Philippines, Maldives, Malaysia, Taiwan, India, Sri Lanka, and Singapore. The company was incorporated in 2003 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10310",
        "website": "http://www.comancheinternational.com",
        "market_cap": "Small Cap"
    },
    "CPW-R.BK": {
        "short_name": "COPPERWIRED PUBLIC COMPANY LIMI",
        "long_name": "Copperwired Public Company Limited",
        "summary": "Copperwired Public Company Limited retails, distributes, and repairs computers, mobile phones, and accessories in Thailand. The company offers audio equipment, health and fitness devices, smart electrical appliances for homes and offices, smartphones and tablets, smartwatches, and various accessories. It offers its products through various stores under the dotlife, iStudio, U-Store, and iServe names, as well as e-commerce channels, comprising of www.istudio.store and www.dotlife.store. The company was incorporated in 2019 and is based in Bangkok, Thailand. Copperwired Public Company Limited operates as a subsidiary of Vnet Capital Co., Ltd.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10110",
        "website": "http://www.copperwired.co.th",
        "market_cap": "Small Cap"
    },
    "CPW.BK": {
        "short_name": "COPPERWIRED PUBLIC COMPANY LIMI",
        "long_name": "Copperwired Public Company Limited",
        "summary": "Copperwired Public Company Limited retails, distributes, and repairs computers, mobile phones, and accessories in Thailand. The company offers audio equipment, health and fitness devices, smart electrical appliances for homes and offices, smartphones and tablets, smartwatches, and various accessories. It offers its products through various stores under the dotlife, iStudio, U-Store, and iServe names, as well as e-commerce channels, comprising of www.istudio.store and www.dotlife.store. The company was incorporated in 2019 and is based in Bangkok, Thailand. Copperwired Public Company Limited operates as a subsidiary of Vnet Capital Co., Ltd.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10110",
        "website": "http://www.copperwired.co.th",
        "market_cap": "Small Cap"
    },
    "CSS.BK": {
        "short_name": "COMMUNICATION AND SYSTEM SOLUTI",
        "long_name": "Communication & System Solution Public Company Limited",
        "summary": "Communication & System Solution Public Company Limited, together with its subsidiaries, distributes and installs production equipment for electricity, water, air conditioning, and telecommunication systems in Thailand. The company operates through two segments, Distribution Electrical Equipment and Installation Service. The Distribution Electrical Equipment segment supplies electrical cables and other electrical systems equipment, and passive fire protection materials and equipment. The Installation Service segment designs and installs telecommunication and fire protection systems. It also distributes and installs tubes. The company was founded in 1994 and is headquartered in Nonthaburi, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Nonthaburi",
        "zipcode": "11120",
        "website": "http://www.cssthai.com",
        "market_cap": "Small Cap"
    },
    "FORTH-R.BK": {
        "short_name": "FORTH CORPORATION PUBLIC COMPAN",
        "long_name": "Forth Corporation Public Company Limited",
        "summary": "Forth Corporation Public Company Limited, together with its subsidiaries, manufactures and distributes telecommunication and electronic equipment, and assembly electronic parts in Thailand. Its Electronics Manufacturing Service Business segment designs, manufactures, and assembles circuit boards and electronic equipment; and supplies and distributes semiconductor parts, such as IC, transistor, diode, optoelectronics display device relay, battery, connector, electric buzzer, power switch, EMC, filter, thermal printer, capacitor, resistor, crystal oscillator, etc. The company's Enterprise Solutions Business segment engages in the design, system implementation, installation, and maintenance of telecommunication network and information systems; vehicle tracking systems distribution services; and data transmission devices distribution services; enterprise resource management systems; electronic meters distribution services; LED lighting products and lighting equipment procurement and distribution services; aircraft distribution and maintenance repair, and operations services; and traffic system distribution services. This segment also offers smart grid solutions; and Forth Taglock EM, an electronic ankle harness used for track and monitor temporarily released suspects or defendants. Its Smart Service Business segment provides electronic payment acceptance, bill payment, and electronic money services, as well as personal loans; sells canned or bottled beverages, snacks, consumer products, and coffee through vending machines; offers mobile, e-wallet, and game top-up services, utility and phone bills payment service, and money deposit services; and provides electric vehicle charging equipment under the EV NET. The company also provides consulting services for information management and computer software management; engineering; and e-commerce services. Forth Corporation Public Company Limited was founded in 1989 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10400",
        "website": "http://www.forth.co.th",
        "market_cap": "Small Cap"
    },
    "FORTH.BK": {
        "short_name": "FORTH CORPORATION PUBLIC COMPAN",
        "long_name": "Forth Corporation Public Company Limited",
        "summary": "Forth Corporation Public Company Limited, together with its subsidiaries, manufactures and distributes telecommunication and electronic equipment, and assembly electronic parts in Thailand. Its Electronics Manufacturing Service Business segment designs, manufactures, and assembles circuit boards and electronic equipment; and supplies and distributes semiconductor parts, such as IC, transistor, diode, optoelectronics display device relay, battery, connector, electric buzzer, power switch, EMC, filter, thermal printer, capacitor, resistor, crystal oscillator, etc. The company's Enterprise Solutions Business segment engages in the design, system implementation, installation, and maintenance of telecommunication network and information systems; vehicle tracking systems distribution services; and data transmission devices distribution services; enterprise resource management systems; electronic meters distribution services; LED lighting products and lighting equipment procurement and distribution services; aircraft distribution and maintenance repair, and operations services; and traffic system distribution services. This segment also offers smart grid solutions; and Forth Taglock EM, an electronic ankle harness used for track and monitor temporarily released suspects or defendants. Its Smart Service Business segment provides electronic payment acceptance, bill payment, and electronic money services, as well as personal loans; sells canned or bottled beverages, snacks, consumer products, and coffee through vending machines; offers mobile, e-wallet, and game top-up services, utility and phone bills payment service, and money deposit services; and provides electric vehicle charging equipment under the EV NET. The company also provides consulting services for information management and computer software management; engineering; and e-commerce services. Forth Corporation Public Company Limited was founded in 1989 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10400",
        "website": "http://www.forth.co.th",
        "market_cap": "Small Cap"
    },
    "HAA1.F": {
        "short_name": "HANA MICROEL. -FGN-  BA 1",
        "long_name": "Hana Microelectronics Public Company Limited",
        "summary": "Hana Microelectronics Public Company Limited, together with its subsidiaries, manufactures and trades in electronic components. It offers printed circuit board and integrated circuit assemblies, as well as produces liquid crystal on silicon devices that are being used for microdisplays and optical telecommunications components. The company also provides agent and customer services. It has operations in Malaysia, China, the United States, Singapore, Hong Kong, and internationally. The company was founded in 1978 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10210",
        "website": "http://www.hanagroup.com",
        "market_cap": "Small Cap"
    },
    "HANA.BK": {
        "short_name": "HANA MICROELECTRONICS PUBLIC CO",
        "long_name": "Hana Microelectronics Public Company Limited",
        "summary": "Hana Microelectronics Public Company Limited, together with its subsidiaries, manufactures and trades in electronic components. It offers printed circuit board and integrated circuit assemblies, as well as produces liquid crystal on silicon devices that are being used for microdisplays and optical telecommunications components. The company also provides agent and customer services. It has operations in Malaysia, China, the United States, Singapore, Hong Kong, and internationally. The company was founded in 1978 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10210",
        "website": "http://www.hanagroup.com",
        "market_cap": "Small Cap"
    },
    "HUMAN-R.BK": {
        "short_name": "HUMANICA PUBLIC COMPANY LIMITED",
        "long_name": "Humanica Public Company Limited",
        "summary": "Humanica Public Company Limited provides various human resource services and solutions in Thailand, Singapore, Japan, and Malaysia. It operates through Human Resources Solutions and Financial Solutions segments. The company offers Humatrix, a human resource and payroll management solution for mid to large corporations, including manufacturing, hospitality, healthcare, restaurants, and retail. It also offers human resource outsourcing and payroll services; enterprise resource planning and implementation services; payroll outsourcing services; P2P lending platform; and business consulting services to business optimization, business transformation, and business expansion. In addition, the company provides design, develops content, and creating educational solutions, including sale of mobile based learning management solutions; business application of systems management, human resource, and payroll programs; and distributes technologies, including record time such as time recording machines, ace scanners, fingerprint scanners, and hand card machines, etc. Further, it engages in the development and sale of human resource solutions software, as well as provides property management services. The company provides accounting and financial services, which consists of managing accounting information, financial planning advisory, accounting, financial management, and tax services. It also offers brokerage services to provide cutting-edge platforms for employee welfare management, such as healthcare and wellness, as well as operates as a comprehensive community for employees. The company was founded in 2003 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10330",
        "website": "http://www.humanica.com",
        "market_cap": "Small Cap"
    },
    "HUMAN.BK": {
        "short_name": "HUMANICA PUBLIC COMPANY LIMITED",
        "long_name": "Humanica Public Company Limited",
        "summary": "Humanica Public Company Limited provides various human resource services and solutions in Thailand, Singapore, Japan, and Malaysia. It operates through Human Resources Solutions and Financial Solutions segments. The company offers Humatrix, a human resource and payroll management solution for mid to large corporations, including manufacturing, hospitality, healthcare, restaurants, and retail. It also offers human resource outsourcing and payroll services; enterprise resource planning and implementation services; payroll outsourcing services; P2P lending platform; and business consulting services to business optimization, business transformation, and business expansion. In addition, the company provides design, develops content, and creating educational solutions, including sale of mobile based learning management solutions; business application of systems management, human resource, and payroll programs; and distributes technologies, including record time such as time recording machines, ace scanners, fingerprint scanners, and hand card machines, etc. Further, it engages in the development and sale of human resource solutions software, as well as provides property management services. The company provides accounting and financial services, which consists of managing accounting information, financial planning advisory, accounting, financial management, and tax services. It also offers brokerage services to provide cutting-edge platforms for employee welfare management, such as healthcare and wellness, as well as operates as a comprehensive community for employees. The company was founded in 2003 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10330",
        "website": "http://www.humanica.com",
        "market_cap": "Small Cap"
    },
    "IE2A.F": {
        "short_name": "INTERNET THAIL.-FGN- BA 1",
        "long_name": "Internet Thailand Public Company Limited",
        "summary": "Internet Thailand Public Company Limited, together with its subsidiaries, provides Internet access, and information technology and communication integrated services for businesses and individuals in Thailand. The company operates through two segments, Access Business and Business Solutions. It offers full Internet access services with various speeds through leased lines and MetroLAN network connected to the offices' Intranet networks; and Internet data center services comprising business continuity planning/disaster recovery center, co-location, INET security center, and server leasing services for business organizations or agencies that need to present data through Internet/Intranet for public and private networks. The company also provides cloud services, which is a virtual computing service that includes infrastructure as a service, platform as a service, and software as a service; and EDC network pool services, which is a credit card payment system center linked between banks and other merchants through telecommunications networks, such as landline telephone, mobile phone, and Internet. In addition, it offers online applications, such as online recruitment, mail services, etc. The company is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10310",
        "website": "http://www.inet.co.th",
        "market_cap": "Small Cap"
    },
    "IIG.BK": {
        "short_name": "I&I GROUP PUBLIC COMPANY LIMITE",
        "long_name": "I&I Group Public Company Limited",
        "summary": "I&I Group Public Company Limited, together with its subsidiaries, operates as a digital and technology consulting company in Thailand. It operates through three segments: Customer Relationship Program, Enterprise Resource Planning Program, and Digital Marketing Services. The company provides consultation on computer systems; sells subscription; and provides support on computer software licenses. It also offers services in the areas of business analytics and marketing strategy, digital marketing, data management and technology, customer relationship and experience management, and placement service. The company was founded in 1991 and is headquartered in Ratchathewi, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Ratchathewi",
        "zipcode": "10400",
        "website": "http://www.ii.co.th",
        "market_cap": "Small Cap"
    },
    "ILINK-R.BK": {
        "short_name": "INTERLINK COMMUNICATION PUBLIC ",
        "long_name": "Interlink Communication Public Company Limited",
        "summary": "Interlink Communication Public Company Limited imports and distributes IT network cabling system products in Thailand. The company operates through three segments: Distribution Business, Telecommunication Business, and Engineering Business. It also outsources the design and installation service of network and cabling systems for computers and telecommunications. In addition, the company operates as a telecommunication service provider, which invests in the construction of a fiber-optic cable network to provide high-speed leased line service; and a contractor in submarine cable and transmission lines, including fiber optic and high voltage. Further, it provides data center services, such as co-location and disaster recovery services to enterprise customers, as well as virtual server rental services; and broadcast services. The company was founded in 1995 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10310",
        "website": "http://www.interlink.co.th",
        "market_cap": "Small Cap"
    },
    "ILINK.BK": {
        "short_name": "INTERLINK COMMUNICATION PUBLIC ",
        "long_name": "Interlink Communication Public Company Limited",
        "summary": "Interlink Communication Public Company Limited imports and distributes IT network cabling system products in Thailand. The company operates through three segments: Distribution Business, Telecommunication Business, and Engineering Business. It also outsources the design and installation service of network and cabling systems for computers and telecommunications. In addition, the company operates as a telecommunication service provider, which invests in the construction of a fiber-optic cable network to provide high-speed leased line service; and a contractor in submarine cable and transmission lines, including fiber optic and high voltage. Further, it provides data center services, such as co-location and disaster recovery services to enterprise customers, as well as virtual server rental services; and broadcast services. The company was founded in 1995 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10310",
        "website": "http://www.interlink.co.th",
        "market_cap": "Small Cap"
    },
    "INET-R.BK": {
        "short_name": "INTERNET THAILAND PUBLIC COMPAN",
        "long_name": "Internet Thailand Public Company Limited",
        "summary": "Internet Thailand Public Company Limited, together with its subsidiaries, provides Internet access, and information technology and communication integrated services for businesses and individuals in Thailand. The company operates through two segments, Access Business and Business Solutions. It offers full Internet access services with various speeds through leased lines and MetroLAN network connected to the offices' Intranet networks; and Internet data center services comprising business continuity planning/disaster recovery center, co-location, INET security center, and server leasing services for business organizations or agencies that need to present data through Internet/Intranet for public and private networks. The company also provides cloud services, which is a virtual computing service that includes infrastructure as a service, platform as a service, and software as a service; and EDC network pool services, which is a credit card payment system center linked between banks and other merchants through telecommunications networks, such as landline telephone, mobile phone, and Internet. In addition, it offers online applications, such as online recruitment, mail services, etc. The company is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10310",
        "website": "http://www.inet.co.th",
        "market_cap": "Small Cap"
    },
    "INET.BK": {
        "short_name": "INTERNET THAILAND PUBLIC COMPAN",
        "long_name": "Internet Thailand Public Company Limited",
        "summary": "Internet Thailand Public Company Limited, together with its subsidiaries, provides Internet access, and information technology and communication integrated services for businesses and individuals in Thailand. The company operates through two segments, Access Business and Business Solutions. It offers full Internet access services with various speeds through leased lines and MetroLAN network connected to the offices' Intranet networks; and Internet data center services comprising business continuity planning/disaster recovery center, co-location, INET security center, and server leasing services for business organizations or agencies that need to present data through Internet/Intranet for public and private networks. The company also provides cloud services, which is a virtual computing service that includes infrastructure as a service, platform as a service, and software as a service; and EDC network pool services, which is a credit card payment system center linked between banks and other merchants through telecommunications networks, such as landline telephone, mobile phone, and Internet. In addition, it offers online applications, such as online recruitment, mail services, etc. The company is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10310",
        "website": "http://www.inet.co.th",
        "market_cap": "Small Cap"
    },
    "INSET-R.BK": {
        "short_name": "INFRASET PUBLIC COMPANY LIMITED",
        "long_name": "Infraset Public Company Limited",
        "summary": "Infraset Public Company Limited designs and constructs engineering infrastructure in Thailand. The company constructs data centers, information technology and infrastructure, and telecommunication networks. It operates through three segments: Construct of Data Center and Information Technology; Infrastructure, Telecommunications and Transportation Infrastructure; and Maintenance and Services. The company was incorporated in 2006 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10220",
        "website": "http://infraset.co.th",
        "market_cap": null
    },
    "INSET.BK": {
        "short_name": "INFRASET PUBLIC COMPANY LIMITED",
        "long_name": "Infraset Public Company Limited",
        "summary": "Infraset Public Company Limited designs and constructs engineering infrastructure in Thailand. The company constructs data centers, information technology and infrastructure, and telecommunication networks. It operates through three segments: Construct of Data Center and Information Technology; Infrastructure, Telecommunications and Transportation Infrastructure; and Maintenance and Services. The company was incorporated in 2006 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10220",
        "website": "http://infraset.co.th",
        "market_cap": "Small Cap"
    },
    "IRCP-R.BK": {
        "short_name": "INTERNATIONAL RESEARCH CORPORAT",
        "long_name": "International Research Corporation Public Company Limited",
        "summary": "International Research Corporation Public Company Limited engages in the distribution and rendering system development services of information technology, network information, and telecommunication information systems in Thailand. The company operates in two segments, Project Business and Non-Project Business. It provides telecommunication network to connect points to points via fiber optic and wireless technologies, such as DWDM, SDH, Multiplexer, wireless, and broadband; next generation network solutions to link public telephone network with IP network that include VOIP, VDO, instant messaging, etc.; soft switch technology solutions; mobile telephone network solutions; FTTx networking total solutions; and 3G and LTE services. The company also offers solutions for enterprise, such as enterprise resource planning, enterprise application integration, data warehouse and business intelligence, custom application development, and implementation services. In addition, it provides software replication and pad printing services; and digital broadcasting solutions, including headend equipment, television transmission systems, new media, and content production solutions, as well as designs, builds, and installs digital TV system equipment for television and broadcasting industry. Additionally, it provides project management and maintenance services for integrated radio and television broadcasting systems. International Research Corporation Public Company Limited was founded in 1986 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10110",
        "website": "http://www.ircp.co.th",
        "market_cap": "Small Cap"
    },
    "IRCP.BK": {
        "short_name": "INTERNATIONAL RESEARCH CORPORAT",
        "long_name": "International Research Corporation Public Company Limited",
        "summary": "International Research Corporation Public Company Limited engages in the distribution and rendering system development services of information technology, network information, and telecommunication information systems in Thailand. The company operates in two segments, Project Business and Non-Project Business. It provides telecommunication network to connect points to points via fiber optic and wireless technologies, such as DWDM, SDH, Multiplexer, wireless, and broadband; next generation network solutions to link public telephone network with IP network that include VOIP, VDO, instant messaging, etc.; soft switch technology solutions; mobile telephone network solutions; FTTx networking total solutions; and 3G and LTE services. The company also offers solutions for enterprise, such as enterprise resource planning, enterprise application integration, data warehouse and business intelligence, custom application development, and implementation services. In addition, it provides software replication and pad printing services; and digital broadcasting solutions, including headend equipment, television transmission systems, new media, and content production solutions, as well as designs, builds, and installs digital TV system equipment for television and broadcasting industry. Additionally, it provides project management and maintenance services for integrated radio and television broadcasting systems. International Research Corporation Public Company Limited was founded in 1986 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10110",
        "website": "http://www.ircp.co.th",
        "market_cap": "Small Cap"
    },
    "IT.BK": {
        "short_name": "IT CITY PUBLIC COMPANY LIMITED",
        "long_name": "IT City Public Company Limited",
        "summary": "IT City Public Company Limited engages in the retail of computers, tablets, peripherals, smartphones, and other related IT products under the IT CITY name. The company also offers Internet of Thing and gaming devices; IP, car, and action cameras; robots; 3G/4G air cards; mouse, keyboards, and computer software; ink and toner cartridges, printing paper, UPS, power banks, and power extension outlets; loudspeakers, headphones, optical drives, hard disks, computer components, network equipment, and cables; carry bags and smart phone accessories; digital LED TV's and home audio video devices; office equipment, photo copiers, sticker cutting machines, label printers, barcode scanners, projectors, etc.; small home appliances, such as air purifiers, small kitchen utensils, etc.; desktops, notebooks, and LCD and LED monitors; wearable devices; and printers, including ink jet, dot matrix, laser, and multi-function printers. In addition, it operates repair and maintenance service centers; supplies genuine parts; and provides technicians. As of December 31, 2020, it operated 350 branches. IT City Public Company Limited is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10400",
        "website": "http://www.itcityonline.com",
        "market_cap": "Small Cap"
    },
    "KCE.BK": {
        "short_name": "KCE ELECTRONICS PUBLIC COMPANY ",
        "long_name": "KCE Electronics Public Company Limited",
        "summary": "KCE Electronics Public Company Limited, together with its subsidiaries, manufactures and distributes electric printed circuit boards (PCBs) under the KCE trademark worldwide. The company's PCBs manufactured from copper clad laminate are used in various applications, including automotive, industrial, computer, and telecom systems. It also manufactures and distributes chemicals products, and prepreg and laminate products. The company was formerly known as Kuang Charoen Electronics Company Limited. KCE Electronics Public Company Limited was founded in 1982 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10520",
        "website": "http://www.kce.co.th",
        "market_cap": "Mid Cap"
    },
    "KCEA.SG": {
        "short_name": "KCE Electronics PCL Reg. Shs (F",
        "long_name": "KCE Electronics Public Company Limited",
        "summary": "KCE Electronics Public Company Limited, together with its subsidiaries, manufactures and distributes electric printed circuit boards (PCBs) under the KCE trademark worldwide. The company's PCBs manufactured from copper clad laminate are used in various applications, including automotive, industrial, computer, and telecom systems. It also manufactures and distributes chemicals products, and prepreg and laminate products. The company was formerly known as Kuang Charoen Electronics Company Limited. KCE Electronics Public Company Limited was founded in 1982 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10520",
        "website": "http://www.kce.co.th",
        "market_cap": "Mid Cap"
    },
    "KYE-R.BK": {
        "short_name": "KANG YONG ELECTRIC PUBLIC COMPA",
        "long_name": "Kang Yong Electric Public Company Limited",
        "summary": "Kang Yong Electric Public Company Limited manufactures and distributes household electrical appliances in Thailand, Japan, and internationally. The company offers home electrical appliances, such as refrigerators, electric fans, ventilating fans, water pumps, and jet towels under the Mitsubishi Electric name. It also exports its products to approximately 20 countries. The company was formerly known as Kang Yong Electric Manufacturing Co., Ltd. Kang Yong Electric Public Company Limited was founded in 1964 and is based in Bang Phli, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bang Phli",
        "zipcode": "10540",
        "website": "http://www.mitsubishi-kye.com",
        "market_cap": "Small Cap"
    },
    "KYE.BK": {
        "short_name": "KANG YONG ELECTRIC PUBLIC COMPA",
        "long_name": "Kang Yong Electric Public Company Limited",
        "summary": "Kang Yong Electric Public Company Limited manufactures and distributes household electrical appliances in Thailand, Japan, and internationally. The company offers home electrical appliances, such as refrigerators, electric fans, ventilating fans, water pumps, and jet towels under the Mitsubishi Electric name. It also exports its products to approximately 20 countries. The company was formerly known as Kang Yong Electric Manufacturing Co., Ltd. Kang Yong Electric Public Company Limited was founded in 1964 and is based in Bang Phli, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bang Phli",
        "zipcode": "10540",
        "website": "http://www.mitsubishi-kye.com",
        "market_cap": "Small Cap"
    },
    "METCO-R.BK": {
        "short_name": "MURAMOTO ELECTRON (THAILAND)",
        "long_name": "Muramoto Electron (Thailand) Public Company Limited",
        "summary": "Muramoto Electron (Thailand) Public Company Limited manufactures and sells metal and plastic parts for audio/visual equipment; and electronic equipment for automobiles and office automation appliances in Thailand, Japan, the United States, and internationally. It operates through three segments: Electric Parts for Automotive Business, Electronic Parts for Office Automation Business, and Other Business. The company offers car related products, such as display audio units, audio panels, CD and DVD changers, gear units, air bag parts, keyless entry transmitters and receivers, corner sensors, press and window regulator parts, mounting boards for keyless entry receivers, print circuit board assemblies for CD changers, and mounting boards for cameras. It also manufactures video cameras and single-lens reflex camera products for consumers, including video camera LCD units, back cover and lens units for single lens reflex cameras, and top cover units for mirrorless cameras; and printer finished products and electronic parts, such as printer finished products, thermal fuses, hermetic terminals, and magnetron filter box parts for use in industrial applications. The company was founded in 1987 and is headquartered in Bangkok, Thailand. Muramoto Electron (Thailand) Public Company Limited is a subsidiary of Muramoto Industry Co., Ltd.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10230",
        "website": "http://www.metco.co.th",
        "market_cap": "Small Cap"
    },
    "METCO.BK": {
        "short_name": "MURAMOTO ELECTRON (THAILAND)",
        "long_name": "Muramoto Electron (Thailand) Public Company Limited",
        "summary": "Muramoto Electron (Thailand) Public Company Limited manufactures and sells metal and plastic parts for audio/visual equipment; and electronic equipment for automobiles and office automation appliances in Thailand, Japan, the United States, and internationally. It operates through three segments: Electric Parts for Automotive Business, Electronic Parts for Office Automation Business, and Other Business. The company offers car related products, such as display audio units, audio panels, CD and DVD changers, gear units, air bag parts, keyless entry transmitters and receivers, corner sensors, press and window regulator parts, mounting boards for keyless entry receivers, print circuit board assemblies for CD changers, and mounting boards for cameras. It also manufactures video cameras and single-lens reflex camera products for consumers, including video camera LCD units, back cover and lens units for single lens reflex cameras, and top cover units for mirrorless cameras; and printer finished products and electronic parts, such as printer finished products, thermal fuses, hermetic terminals, and magnetron filter box parts for use in industrial applications. The company was founded in 1987 and is headquartered in Bangkok, Thailand. Muramoto Electron (Thailand) Public Company Limited is a subsidiary of Muramoto Industry Co., Ltd.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10230",
        "website": "http://www.metco.co.th",
        "market_cap": "Small Cap"
    },
    "MFEC-R.BK": {
        "short_name": "MFEC PUBLIC COMPANY LIMITED",
        "long_name": "MFEC Public Company Limited",
        "summary": "MFEC Public Company Limited operates as an information technology (IT) services company in Thailand. The company operates through Systems Integration, Maintenance Service, and IT Professional Service segments. It provides securities trading, mobile financial, gamifcation, managed service, information service on mobile/tablet applications, advertisement/PR/marketing, service for platform management system, and ticketing system for all play types. The company also offers mobile products, software as a service, e-commerce, digital content, payment gateway, financial technology, consulting service and computer system development, IT project management and equipment management, outsourcing IT, audit, warranty management, maintenance, and system integration for cloud and office work. In addition, it provides business analytics, agent management, agent leader, smart quotation, eApplication, iClaim, legal tracking system, iCollection, appraisal collateral, and big data services. MFEC Public Company Limited was founded in 1997 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10900",
        "website": "http://www.mfec.co.th",
        "market_cap": "Small Cap"
    },
    "MFEC.BK": {
        "short_name": "MFEC PUBLIC COMPANY LIMITED",
        "long_name": "MFEC Public Company Limited",
        "summary": "MFEC Public Company Limited operates as an information technology (IT) services company in Thailand. The company operates through Systems Integration, Maintenance Service, and IT Professional Service segments. It provides securities trading, mobile financial, gamifcation, managed service, information service on mobile/tablet applications, advertisement/PR/marketing, service for platform management system, and ticketing system for all play types. The company also offers mobile products, software as a service, e-commerce, digital content, payment gateway, financial technology, consulting service and computer system development, IT project management and equipment management, outsourcing IT, audit, warranty management, maintenance, and system integration for cloud and office work. In addition, it provides business analytics, agent management, agent leader, smart quotation, eApplication, iClaim, legal tracking system, iCollection, appraisal collateral, and big data services. MFEC Public Company Limited was founded in 1997 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10900",
        "website": "http://www.mfec.co.th",
        "market_cap": "Small Cap"
    },
    "MSC.BK": {
        "short_name": "METRO SYSTEMS CORPORATION PUBLI",
        "long_name": "Metro Systems Corporation Public Company Limited",
        "summary": "Metro Systems Corporation Public Company Limited, together with its subsidiaries, engages in trading computers and equipment, software, supplies, and office equipment, as well as provision of related services in Thailand. The company provides server, storage, and network for IT infrastructure; backup, modernized application, and IBM I solutions for infrastructure; contractual, supplies, and outsourcing printing and services solutions for digital printing; and compute, network, storage, HCI, private, hybrid, public cloud, middleware and other, database, API, and backup and DR, as well as operating systems for digital infrastructure. It also offers businesses transformation, architecture design, application development, and infrastructure and managed service for digital transformation services; workforce and unified collaboration, mobility workforce, business process automation, and IT process management for digital collaboration; and SOLIDWORKS 3D CAD, simulation, electrical design, SOLIDWORKS product data management, and technical communication for designed and engineering solutions. In addition, it offers data integration tool, data platform, BI and data visualization, advance analytics and AI/ML, and data scientist platform. Further, it offers end point, network, server and data, cloud, and mobility security; and training and services. It also offers hardware products and office supplies. Metro Systems Corporation Public Company Limited was founded in 1985 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10250",
        "website": "http://www.metrosystems.co.th",
        "market_cap": "Small Cap"
    },
    "NETBAY-R.BK": {
        "short_name": "NETBAY PUBLIC COMPANY LIMITED",
        "long_name": "Netbay Public Company Limited",
        "summary": "Netbay Public Company Limited creates, designs, and develops digital business technology platform and omni channel connectivity gateway solutions for the electronic business transaction exchange in the field of trading. The company provides digital business services, which include e-customs; customs e-payment; e-manifest, a paperless report for imports/ exports system; e-express; electronic transaction reporting gateway for financial institutes; customer due diligence gateways; and software development and cloud computing services. Its software as a service comprise data center, disaster recovery center, operating software system, which supports the electronic transaction reporting gateway, networking systems, and protection of information services. In addition, the company acts as electronic data interchange provider for electronic transaction reporting and audit report services for life insurance, non-life insurance, securities, asset management, and finance companies, as well as financial institutions and banks. Further, it offers electronics bank guarantee data interchange services between banks and Comptroller General's Department. It serves international and domestic trade, and service sectors; manufacturers, exporters, importers, freight forwarders, shipping agents, customs brokers, terminal operators, transportation service providers, and logistics and supply chain communities; ocean line, air, and express couriers; and the Thai Chamber of Commerce and Board of Trade of Thailand. Netbay Public Company Limited was founded in 2004 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10330",
        "website": "http://www.netbay.co.th",
        "market_cap": "Small Cap"
    },
    "NETBAY.BK": {
        "short_name": "NETBAY PUBLIC COMPANY LIMITED",
        "long_name": "Netbay Public Company Limited",
        "summary": "Netbay Public Company Limited creates, designs, and develops digital business technology platform and omni channel connectivity gateway solutions for the electronic business transaction exchange in the field of trading. The company provides digital business services, which include e-customs; customs e-payment; e-manifest, a paperless report for imports/ exports system; e-express; electronic transaction reporting gateway for financial institutes; customer due diligence gateways; and software development and cloud computing services. Its software as a service comprise data center, disaster recovery center, operating software system, which supports the electronic transaction reporting gateway, networking systems, and protection of information services. In addition, the company acts as electronic data interchange provider for electronic transaction reporting and audit report services for life insurance, non-life insurance, securities, asset management, and finance companies, as well as financial institutions and banks. Further, it offers electronics bank guarantee data interchange services between banks and Comptroller General's Department. It serves international and domestic trade, and service sectors; manufacturers, exporters, importers, freight forwarders, shipping agents, customs brokers, terminal operators, transportation service providers, and logistics and supply chain communities; ocean line, air, and express couriers; and the Thai Chamber of Commerce and Board of Trade of Thailand. Netbay Public Company Limited was founded in 2004 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10330",
        "website": "http://www.netbay.co.th",
        "market_cap": "Small Cap"
    },
    "NEWS.BK": {
        "short_name": "NEWS NETWORK CORPORATION PUBLIC",
        "long_name": "News Network Corporation Public Company Limited",
        "summary": "News Network Corporation Public Company Limited, together with its subsidiaries, develops and sells software in Thailand. The company is also involved in procuring hardware products; distributing and servicing technology products; providing internet, mass communication, programs production, system integrator, and new media services, as well as news; and trading and servicing examining tools and equipment in occupational health activities. In addition, it provides information through online system and electronic media, as well as publishing production and distribution services; and distributes books, as well as distribution and installation services for environment projects. The company was formerly known as Solution Corner (1998) Public Company Limited and changed its name to News Network Corporation Public Company Limited in April 2015. News Network Corporation Public Company Limited is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10900",
        "website": "http://www.newsnetwork.co.th",
        "market_cap": "Small Cap"
    },
    "NEX.BK": {
        "short_name": "NEX POINT PUBLIC COMPANY LIMITE",
        "long_name": "Nex Point Public Company Limited",
        "summary": "Nex Point Public Company Limited designs, manufactures, and sells electronic products in Thailand. It also offers software, and application and platform for large logistics management system; property procurement services; financial technology services; and installation and consulting services for computer systems, as well as sells hardware and software products; and rents and sells buses. In addition, the company is involved in the transportation and logistics, supply assets, labor, and property rental businesses. In addition, it creates, develops, and customizes computer software for IT services. The company was formerly known as Single Point Parts (Thailand) Public Company Limited and changed its name to Nex Point Public Company Limited in May 2019. Nex Point Public Company Limited was founded in 1997 and is headquartered in Samut Prakan, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Samut Prakan",
        "zipcode": "10540",
        "website": "http://www.nexpoint.co.th",
        "market_cap": "Small Cap"
    },
    "NVAX.F": {
        "short_name": "HANA MICROEL. -NVDR- BA 5",
        "long_name": "Hana Microelectronics Public Company Limited",
        "summary": "Hana Microelectronics Public Company Limited, together with its subsidiaries, manufactures and trades in electronic components. It offers printed circuit board and integrated circuit assemblies, as well as produces liquid crystal on silicon devices that are being used for microdisplays and optical telecommunications components. The company also provides agent and customer services. It has operations in Malaysia, China, the United States, Singapore, Hong Kong, and internationally. The company was founded in 1978 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10210",
        "website": "http://www.hanagroup.com",
        "market_cap": "Small Cap"
    },
    "NVPA.F": {
        "short_name": "KCE EL. PCL -NVDR- BA 0,5",
        "long_name": "KCE Electronics Public Company Limited",
        "summary": "KCE Electronics Public Company Limited, together with its subsidiaries, manufactures and distributes electric printed circuit boards (PCBs) under the KCE trademark worldwide. The company's PCBs manufactured from copper clad laminate are used in various applications, including automotive, industrial, computer, and telecom systems. It also manufactures and distributes chemicals products, and prepreg and laminate products. The company was formerly known as Kuang Charoen Electronics Company Limited. KCE Electronics Public Company Limited was founded in 1982 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10520",
        "website": "http://www.kce.co.th",
        "market_cap": "Mid Cap"
    },
    "PLANET.BK": {
        "short_name": "PLANET COMMUNICATIONS ASIA",
        "long_name": "Planet Communications Asia Public Company Limited",
        "summary": "Planet Communications Asia Public Company Limited engages in the distribution, installation, and maintenance of telecommunication equipment in Thailand. The company operates through three segments: Products and Solution, Services, and Service Provider. It offers telecommunications technology products, such as satellite earth station, wireless network, digital radio communications, and optical fiber network systems; smart office solutions comprising telepresence and video conference, centralized telecommunications system, audio conference, closed circuit television, and Internet network/Wi-Fi; cyber security solutions, consisting of network security, transaction security, and fire wall; and digital broadcasting solutions, which includes television program production system, multimedia and content production studio, content distribution and transmission, and terrestrial digital television set-top box. The company also provides satellite mobile vehicle; mobile phone and radio jammer for military operations and security; and peripheral and accessories, such as cables and connectors, and fiber optic components. In addition, it offers pre-sale, implementation and installation, after sales, and rental services for telecommunication equipment and systems. Further, the company provides PlanetFiber that offers high-speed internet through fiber optic networks for mid- and high-rise condominiums; and PlanetCloud, which provides cloud services for the office. It serves broadcasting, telecommunications service provider, commercial, public, and international sectors. The company was formerly known as Technology Gateway Asia Co., Ltd. and changed its name to Planet Communications Asia Public Company Limited in 1998. Planet Communications Asia Public Company Limited was founded in 1994 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10230",
        "website": "http://www.planetcomm.com",
        "market_cap": "Small Cap"
    },
    "PT.BK": {
        "short_name": "PREMIER TECHNOLOGY PUBLIC COMPA",
        "long_name": "Premier Technology Public Company Limited",
        "summary": "Premier Technology Public Company Limited, through its subsidiary, Datapro Computer Systems Company Limited, distributes and provides services relating to computer and computer systems in Thailand. It develops its own products; and distributes products of other companies. The company's products include hardware and software products, including IT and multimedia products; and system and data management, and application software. It also offers annual maintenance, training and consulting, outsourcing, and other services; and engages in the rental of an office building. The company was formerly known as Premier Engineering and Technology Public Company Limited and changed its name to Premier Technology Public Company Limited in October 2006. Premier Technology Public Company Limited was founded in 1973 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10250",
        "website": "http://www.premier-technology.co.th",
        "market_cap": "Small Cap"
    },
    "SICT-R.BK": {
        "short_name": "SILICON CRAFT TECHNOLOGY PUBLIC",
        "long_name": "Silicon Craft Technology Public Company Limited",
        "summary": "Silicon Craft Technology Public Company Limited, an integrated circuit (IC) design company, designs, markets, and sells microchips for RFID applications. It offers linear and mixed-signal ICs; microchips for access and immobilizer systems, livestock identification tags, near field communications, and access control and interrogator or reader systems; and high and low frequency transponder ICs. The company was founded in 2002 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10900",
        "website": "http://www.sic.co.th",
        "market_cap": "Small Cap"
    },
    "SICT.BK": {
        "short_name": "SILICON CRAFT TECHNOLOGY PUBLIC",
        "long_name": "Silicon Craft Technology Public Company Limited",
        "summary": "Silicon Craft Technology Public Company Limited, an integrated circuit (IC) design company, designs, markets, and sells microchips for RFID applications. It offers linear and mixed-signal ICs; microchips for access and immobilizer systems, livestock identification tags, near field communications, and access control and interrogator or reader systems; and high and low frequency transponder ICs. The company was founded in 2002 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10900",
        "website": "http://www.sic.co.th",
        "market_cap": "Small Cap"
    },
    "SIMAT-R.BK": {
        "short_name": "SIMAT TECHNOLOGIES PUBLIC COMPA",
        "long_name": "Simat Technologies Public Company Limited",
        "summary": "Simat Technologies Public Company Limited distributes computer hardware, software, and network accessories in Thailand and Malaysia. The company also offers computer information technology system development services. It sells various hardware products, such as corded and cordless barcode scanners, micro kiosks, mobile printers, barcode and label printers, card printers, face recognition products, mobile computers, wireless and networking products, RFID barcode readers and printers, and RFID antennas. The company also provides various software products comprising ManageSales, a sales force automation system; ManageWare, a warehouse management system solution; MobileNET; and Sky Frog. In addition, it manufactures self-adhesive label stickers, such as ribbonless, ESD, high temperature, healthcare, and barcode and serialize labels. Further, the company offers project management, implementation and training, helpdesk support, software customization and maintenance, custom software development, and technical services. Simat Technologies Public Company Limited was founded in 1995 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10520",
        "website": "http://www.simat.co.th",
        "market_cap": "Small Cap"
    },
    "SIMAT.BK": {
        "short_name": "SIMAT TECHNOLOGIES PUBLIC COMPA",
        "long_name": "Simat Technologies Public Company Limited",
        "summary": "Simat Technologies Public Company Limited distributes computer hardware, software, and network accessories in Thailand and Malaysia. The company also offers computer information technology system development services. It sells various hardware products, such as corded and cordless barcode scanners, micro kiosks, mobile printers, barcode and label printers, card printers, face recognition products, mobile computers, wireless and networking products, RFID barcode readers and printers, and RFID antennas. The company also provides various software products comprising ManageSales, a sales force automation system; ManageWare, a warehouse management system solution; MobileNET; and Sky Frog. In addition, it manufactures self-adhesive label stickers, such as ribbonless, ESD, high temperature, healthcare, and barcode and serialize labels. Further, the company offers project management, implementation and training, helpdesk support, software customization and maintenance, custom software development, and technical services. Simat Technologies Public Company Limited was founded in 1995 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10520",
        "website": "http://www.simat.co.th",
        "market_cap": "Small Cap"
    },
    "SIS.BK": {
        "short_name": "SIS DISTRIBUTION (THAILAND)",
        "long_name": "SiS Distribution (Thailand) Public Company Limited",
        "summary": "SiS Distribution (Thailand) Public Company Limited, together with its subsidiaries, distributes computer components, smartphones, and office automation equipment in Thailand. The company operates through four segments: Commercial Products, Consumer Products, Value Added Products, and Phones. It offers servers, home and business PCs, storage and networking devices, printers/scanners, and monitors; and private cloud, enterprise storage and backup, and security services. The company is also involved in the service and rental of computers and accessories. SiS Distribution (Thailand) Public Company Limited was founded in 1998 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10400",
        "website": "http://www.sisthai.com",
        "market_cap": "Small Cap"
    },
    "SKY.BK": {
        "short_name": "SKY ICT PUBLIC COMPANY LIMITED",
        "long_name": "Sky ICT Public Company Limited",
        "summary": "Sky ICT Public Company Limited, together with its subsidiary, engages in information and communication technology (ICT), and system integration businesses in Thailand. The company operates through three segments: System Integration, Sales and Service, and Finance Lease segments. It offers consultation, design, installation, maintenance, procurement, and distribution of products and equipment related to the ICT and system integration. The company also provides CCTV, smart office, smart home, smart city, networks infrastructure, cyber security, and unified communication solutions; and network cabling services, including network cable management, single and multi-mode fiber optic cabling, LAN installation and cable management, and rack cabinet installation for network and server/CCTV security installation. In addition, it distributes IT products, such as computer, notebook, scanner, printer, toner, server, storage, switch, and software products; and non-IT solutions. Further, the company is involved in the finance lease business. Sky ICT Public Company Limited serves clients in the education, banking, security, government, and other sectors. The company was formerly known as CCN-TECH Public Company Limited and changed its name to Sky ICT Public Company Limited July 2017. Sky ICT Public Company Limited was founded in 1997 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10400",
        "website": "http://www.skyict.co.th",
        "market_cap": "Small Cap"
    },
    "SMT-R.BK": {
        "short_name": "STARS MICROELECTRONICS (THAILAN",
        "long_name": "Stars Microelectronics (Thailand) Public Company Limited",
        "summary": "Stars Microelectronics (Thailand) Public Company Limited, together with its subsidiaries, provides electronics manufacturing services in Thailand and the United States. It operates through two segments, Microelectronics Module Assembly and Integrated Circuit (IC) Packaging. The company is involved in the manufacture and distribution of integrated circuit boards and radio frequency identification tags; and equipment used to generate electricity from solar energy or alternative energy. It also engages in the generation and distribution of electricity from solar energy or alternative energy; and trading business. The company provides services to original equipment manufacturers, original design manufacturer, and outsourced assembly and test that offers IC packaging services. Its services cover IC packaging and testing; print circuit board assembly (PCBA) and box build, which cover Internet of Things, medical, energy management, and automotive devices, as well as industrial control modules; and fiber optics devices comprising data center, broadcasting, and LiDAR applications. The company serves electronic equipment, automobiles, medical equipment, communications, and entertainment industries. Stars Microelectronics (Thailand) Public Company Limited was founded in 1995 and is headquartered in Phra Nakhon Si Ayutthaya, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Phra Nakhon Si Ayutthaya",
        "zipcode": "13160",
        "website": "http://www.starsmicro.com",
        "market_cap": "Small Cap"
    },
    "SMT.BK": {
        "short_name": "STARS MICROELECTRONICS (THAILAN",
        "long_name": "Stars Microelectronics (Thailand) Public Company Limited",
        "summary": "Stars Microelectronics (Thailand) Public Company Limited, together with its subsidiaries, provides electronics manufacturing services in Thailand and the United States. It operates through two segments, Microelectronics Module Assembly and Integrated Circuit (IC) Packaging. The company is involved in the manufacture and distribution of integrated circuit boards and radio frequency identification tags; and equipment used to generate electricity from solar energy or alternative energy. It also engages in the generation and distribution of electricity from solar energy or alternative energy; and trading business. The company provides services to original equipment manufacturers, original design manufacturer, and outsourced assembly and test that offers IC packaging services. Its services cover IC packaging and testing; print circuit board assembly (PCBA) and box build, which cover Internet of Things, medical, energy management, and automotive devices, as well as industrial control modules; and fiber optics devices comprising data center, broadcasting, and LiDAR applications. The company serves electronic equipment, automobiles, medical equipment, communications, and entertainment industries. Stars Microelectronics (Thailand) Public Company Limited was founded in 1995 and is headquartered in Phra Nakhon Si Ayutthaya, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Phra Nakhon Si Ayutthaya",
        "zipcode": "13160",
        "website": "http://www.starsmicro.com",
        "market_cap": "Small Cap"
    },
    "SNC-R.BK": {
        "short_name": "SNC FORMER PUBLIC COMPANY LIMIT",
        "long_name": "SNC Former Public Company Limited",
        "summary": "SNC Former Public Company Limited, together with its subsidiaries, manufactures and sells component parts for automobile air conditioners and cooling machines in Thailand and internationally. It is also involved in the contract manufacturing and assembly of air conditioners for household use. In addition, the company manufactures plastic parts for electric appliance and automobiles; household and automotive air conditioner parts; heat pumps for water heat pumps; insulation copper price kits used for the installation of cooling machines and foam pipe insulation; and tools for equipment. Further, it engages in the generation of biomass electric plant garbage; and invests in alternative power plant. SNC Former Public Company Limited was founded in 1981 and is headquartered in Samutprakarn, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Samut Prakan",
        "zipcode": "10560",
        "website": "http://www.sncformer.com",
        "market_cap": "Small Cap"
    },
    "SNC.BK": {
        "short_name": "SNC FORMER PUBLIC COMPANY LIMIT",
        "long_name": "SNC Former Public Company Limited",
        "summary": "SNC Former Public Company Limited, together with its subsidiaries, manufactures and sells component parts for automobile air conditioners and cooling machines in Thailand and internationally. It is also involved in the contract manufacturing and assembly of air conditioners for household use. In addition, the company manufactures plastic parts for electric appliance and automobiles; household and automotive air conditioner parts; heat pumps for water heat pumps; insulation copper price kits used for the installation of cooling machines and foam pipe insulation; and tools for equipment. Further, it engages in the generation of biomass electric plant garbage; and invests in alternative power plant. SNC Former Public Company Limited was founded in 1981 and is headquartered in Samutprakarn, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Samut Prakan",
        "zipcode": "10560",
        "website": "http://www.sncformer.com",
        "market_cap": "Small Cap"
    },
    "SOLAR-R.BK": {
        "short_name": "SOLARTRON PUBLIC COMPANY LIMITE",
        "long_name": "Solartron Public Company Limited",
        "summary": "Solartron Public Company Limited, together with its subsidiaries, manufactures, distributes, sells, and installs solar-cell systems and related equipment in Thailand and internationally. The company operates through Selling and Installation of Solar-Cell Systems, Distribution SolarÂ\u0096Cell, Sale of Electricity, Hire of Work, and Other segments. It also constructs solar power plants; and produces and distributes electricity from solar energy. The company was incorporated in 1986 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10110",
        "website": "http://www.solartron.co.th",
        "market_cap": "Small Cap"
    },
    "SOLAR.BK": {
        "short_name": "SOLARTRON PUBLIC COMPANY LIMITE",
        "long_name": "Solartron Public Company Limited",
        "summary": "Solartron Public Company Limited, together with its subsidiaries, manufactures, distributes, sells, and installs solar-cell systems and related equipment in Thailand and internationally. The company operates through Selling and Installation of Solar-Cell Systems, Distribution SolarÂ\u0096Cell, Sale of Electricity, Hire of Work, and Other segments. It also constructs solar power plants; and produces and distributes electricity from solar energy. The company was incorporated in 1986 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10110",
        "website": "http://www.solartron.co.th",
        "market_cap": "Small Cap"
    },
    "SPVI.BK": {
        "short_name": "S P V I PUBLIC COMPANY LIMITED",
        "long_name": "S P V I Public Company Limited",
        "summary": "S P V I Public Company Limited engages in the distribution of computers, mobile phones, and related accessories and services in Thailand. It also resells Apple products, including computers, iOS devices, and various other accessories. In addition, the company distributes products compatible with Apple, such as hard drives for video storage, portable hard drives, and printed and graphic products; and products associated with iOS devices comprising speakers, headphones, protective cases, and screen protectors. As of December 31, 2020, it operated 57 branches. The company was founded in 1989 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10310",
        "website": "http://www.spvi.co.th",
        "market_cap": "Small Cap"
    },
    "SVI.BK": {
        "short_name": "SVI PUBLIC COMPANY LIMITED",
        "long_name": "SVI Public Company Limited",
        "summary": "SVI Public Company Limited, together with its subsidiaries, provides electronic manufacturing services in Asia and Europe. The company operates in three segments: Industrial Control System, Communication Network, and Automotive & Transportation. It offers manufacturing and solution-oriented services, such as industrial electronics and microelectronics for telecommunications components, specialized electronic assemblies, and medical technologies industries. The company also provides new product introduction, joint development engineering, design for manufacturing, supply chain optimization, prototyping, failure analysis and risk management, testing, product transfer, and reverse logistics management. In addition, it provides electronic manufacturing systems that produce full box-build and system build product solutions; and raw material sourcing services. The company serves industrial control, automotive and transportation, medical, communications and networks, audio/video, clean energy, microelectronics, and photonics and lighting markets. The company was formerly known as Semiconductor Venture International Limited. SVI Public Company Limited was founded in 1985 and is headquartered in Pathumthani, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Pathum Thani",
        "zipcode": "12000",
        "website": "http://www.svi-hq.com",
        "market_cap": "Small Cap"
    },
    "SVOA-R.BK": {
        "short_name": "SVOA PUBLIC COMPANY LIMITED",
        "long_name": "SVOA Public Company Limited",
        "summary": "SVOA Public Company Limited provides information technology (IT) products and services in Thailand. The company operates through IT Distribution, Systems Integration, and IT Project segments. It distributes IT products, such as computer equipment, peripherals, and software; assembles and distributes computers under SVOA Computer brand name through partners and authorized dealers; and provides repair and maintenance services for IT products through 11 SVOA service centers, and approximately 108 authorized SVOA service providers. The company also offers IT consulting services, system implementation, networking products, computer security system equipment, and end-to-end IT solutions for financial and banking institutions, telecommunication companies, manufacturing and insurance industries, savings cooperatives, hospitals, government agencies, state enterprises, and private organizations, as well as data processing center, information technology management, and maintenance services. In addition, it provides computer system infrastructure services, including ATM outsource co-location, dedicated server, Web and email hosting, and disaster recovery support; computer products and IT equipment; installation and after-sales services; and digital applications for financial institution and government sector. Further, the company is involved in the sale of computer spare parts and other related equipment. The company was founded in 1982 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10120",
        "website": "http://www.svoa.co.th",
        "market_cap": "Small Cap"
    },
    "SVOA.BK": {
        "short_name": "SVOA PUBLIC COMPANY LIMITED",
        "long_name": "SVOA Public Company Limited",
        "summary": "SVOA Public Company Limited provides information technology (IT) products and services in Thailand. The company operates through IT Distribution, Systems Integration, and IT Project segments. It distributes IT products, such as computer equipment, peripherals, and software; assembles and distributes computers under SVOA Computer brand name through partners and authorized dealers; and provides repair and maintenance services for IT products through 11 SVOA service centers, and approximately 108 authorized SVOA service providers. The company also offers IT consulting services, system implementation, networking products, computer security system equipment, and end-to-end IT solutions for financial and banking institutions, telecommunication companies, manufacturing and insurance industries, savings cooperatives, hospitals, government agencies, state enterprises, and private organizations, as well as data processing center, information technology management, and maintenance services. In addition, it provides computer system infrastructure services, including ATM outsource co-location, dedicated server, Web and email hosting, and disaster recovery support; computer products and IT equipment; installation and after-sales services; and digital applications for financial institution and government sector. Further, the company is involved in the sale of computer spare parts and other related equipment. The company was founded in 1982 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10120",
        "website": "http://www.svoa.co.th",
        "market_cap": "Small Cap"
    },
    "SYNEX-R.BK": {
        "short_name": "SYNNEX (THAILAND) PUBLIC COMPAN",
        "long_name": "Synnex (Thailand) Public Company Limited",
        "summary": "Synnex (Thailand) Public Company Limited distributes computers, computer peripherals, software, IT systems, computer consumables, and communication devices in Thailand and Indochina markets. It distributes mobile phones and tablets; personal computers; and PC components comprising motherboard/mainboard, hard disk drives (HDD), solid-state drives (SDD), central processing unit, dynamic random access memory, video graphics array, power supply units, and computer cases. The company also offers PC monitor, mouse, keyboards, speakers, headsets, mobile phone accessories, web/video cameras, optical disk drives, projectors, uninterruptible power supply, inkjet and laser printers, all-in-one/multi-function printers, dot matrix and plotter printers, pocket photo printers, scanners, sewing machines, ink cartridges, toners, printer ribbons, USB flash drives, and external HDD/external SDD. In addition, it provides commercial notebooks, digital signages, closed circuit televisions, barcode and labelling equipment, servers, network attached storage products, switches, routers, LAN cards, wireless LANs, network cabling systems, network management software and hardware, network security or firewall, and network accessories; and cloud services. Further, the company offers smart watches, wristband and smart eyewear, virtual reality glasses and headsets, drones, underwater scooters, smart light bulbs, internet protocol cameras, industrial network products, and education robots; IoT products; and general and technical services and maintenance for network devices, servers, and various applications software. It serves computer retailers and wholesalers, software solution providers, computer manufacturers, department stores, superstores, and stationary shops. The company was formerly known as Compex (Thailand) Company Limited and changed its name to Synnex (Thailand) Public Company Limited in 2002. Synnex (Thailand) Public Company Limited was founded in 1988 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10230",
        "website": "http://www.synnex.co.th",
        "market_cap": "Small Cap"
    },
    "SYNEX.BK": {
        "short_name": "SYNNEX (THAILAND) PUBLIC COMPAN",
        "long_name": "Synnex (Thailand) Public Company Limited",
        "summary": "Synnex (Thailand) Public Company Limited distributes computers, computer peripherals, software, IT systems, computer consumables, and communication devices in Thailand and Indochina markets. It distributes mobile phones and tablets; personal computers; and PC components comprising motherboard/mainboard, hard disk drives (HDD), solid-state drives (SDD), central processing unit, dynamic random access memory, video graphics array, power supply units, and computer cases. The company also offers PC monitor, mouse, keyboards, speakers, headsets, mobile phone accessories, web/video cameras, optical disk drives, projectors, uninterruptible power supply, inkjet and laser printers, all-in-one/multi-function printers, dot matrix and plotter printers, pocket photo printers, scanners, sewing machines, ink cartridges, toners, printer ribbons, USB flash drives, and external HDD/external SDD. In addition, it provides commercial notebooks, digital signages, closed circuit televisions, barcode and labelling equipment, servers, network attached storage products, switches, routers, LAN cards, wireless LANs, network cabling systems, network management software and hardware, network security or firewall, and network accessories; and cloud services. Further, the company offers smart watches, wristband and smart eyewear, virtual reality glasses and headsets, drones, underwater scooters, smart light bulbs, internet protocol cameras, industrial network products, and education robots; IoT products; and general and technical services and maintenance for network devices, servers, and various applications software. It serves computer retailers and wholesalers, software solution providers, computer manufacturers, department stores, superstores, and stationary shops. The company was formerly known as Compex (Thailand) Company Limited and changed its name to Synnex (Thailand) Public Company Limited in 2002. Synnex (Thailand) Public Company Limited was founded in 1988 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10230",
        "website": "http://www.synnex.co.th",
        "market_cap": "Small Cap"
    },
    "TEAM.BK": {
        "short_name": "TEAM PRECISION PUBLIC COMPANY L",
        "long_name": "Team Precision Public Company Limited",
        "summary": "Team Precision Public Company Limited, together with its subsidiaries, produces and assembles printed circuit and electronics circuit boards in Thailand and internationally. The company offers electronics manufacturing services, such as through-hole assembly; surface mount technology assembly; fine pitch ball grid array, flip chip, and chip-on-board assembly in clean-room environment; de-ionized water-cleaning; chemical compound encapsulation; and box build and retail packing services. It also provides design and prototyping services consisting of design for manufacturing, design for test, PCB layout design, and complete product software and hardware design. In addition, the company offers logistics and warehousing services comprising build to order, configure to order, fulfillment warehouse, hub warehousing with online monitoring, and overseas milk run services. The company serves customers in the industrial, medical, specialty, telecommunication, automotive, and consumer industries. Team Precision Public Company Limited is headquartered in Mueang Prachinburi, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Mueang Prachinburi",
        "zipcode": "25000",
        "website": "http://www.teampcba.com",
        "market_cap": "Small Cap"
    },
    "THCOM-R.BK": {
        "short_name": "THAICOM PUBLIC COMPANY LIMITED",
        "long_name": "Thaicom Public Company Limited",
        "summary": "Thaicom Public Company Limited, together with its subsidiaries, provides transponder services for domestic and international communications. The company operates through three segments: Satellite and Related Services, Internet and Media Services, and Telephone Business Abroad. It also offers broadband content, internet data center, Internet, satellite uplink-downlink, broadcasting television, telecommunications, telephone network, and mobile content services. In addition, the company sells user terminal iPSTAR, as well as direct television equipment. Further, it is involved in the provision of technical support services in relation to satellite business, as well as engineering and development services on communication technology and electronics; and system integration consultancy services for broadband networks. The company has operations in Thailand, Singapore, Lao PDR, Australia, New Zealand, Mauritius, the British Virgin Islands, Japan, and India. Thaicom Public Company Limited was founded in 1991 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Nonthaburi",
        "zipcode": "11000",
        "website": "http://www.thaicom.net",
        "market_cap": "Small Cap"
    },
    "THCOM.BK": {
        "short_name": "THAICOM PUBLIC COMPANY LIMITED",
        "long_name": "Thaicom Public Company Limited",
        "summary": "Thaicom Public Company Limited, together with its subsidiaries, provides transponder services for domestic and international communications. The company operates through three segments: Satellite and Related Services, Internet and Media Services, and Telephone Business Abroad. It also offers broadband content, internet data center, Internet, satellite uplink-downlink, broadcasting television, telecommunications, telephone network, and mobile content services. In addition, the company sells user terminal iPSTAR, as well as direct television equipment. Further, it is involved in the provision of technical support services in relation to satellite business, as well as engineering and development services on communication technology and electronics; and system integration consultancy services for broadband networks. The company has operations in Thailand, Singapore, Lao PDR, Australia, New Zealand, Mauritius, the British Virgin Islands, Japan, and India. Thaicom Public Company Limited was founded in 1991 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Nonthaburi",
        "zipcode": "11000",
        "website": "http://www.thaicom.net",
        "market_cap": "Small Cap"
    },
    "TPS-R.BK": {
        "short_name": "THE PRACTICAL SOLUTION PUBLIC C",
        "long_name": "The Practical Solution Public Company Limited",
        "summary": "The Practical Solution Public Company Limited provides solutions for network computing and e-business. It engages in the distribution and installation of computer network systems, fully integrated communication systems, wireless communication systems, network security systems, and data center solutions and management systems. The company also offers consultancy services, such as LAN/WAN infrastructure, intranet/Internet, security system, IP telephony, network management system, design and best practice recommendation, network troubleshooting, and network equipment assessment. In addition, it provides network system management and maintenance services. The company was founded in 2004 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10900",
        "website": "http://www.thepractical.co.th",
        "market_cap": "Small Cap"
    },
    "TPS.BK": {
        "short_name": "THE PRACTICAL SOLUTION PUBLIC C",
        "long_name": "The Practical Solution Public Company Limited",
        "summary": "The Practical Solution Public Company Limited provides solutions for network computing and e-business. It engages in the distribution and installation of computer network systems, fully integrated communication systems, wireless communication systems, network security systems, and data center solutions and management systems. The company also offers consultancy services, such as LAN/WAN infrastructure, intranet/Internet, security system, IP telephony, network management system, design and best practice recommendation, network troubleshooting, and network equipment assessment. In addition, it provides network system management and maintenance services. The company was founded in 2004 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10900",
        "website": "http://www.thepractical.co.th",
        "market_cap": "Small Cap"
    },
    "TSR-R.BK": {
        "short_name": "THIENSURAT PUBLIC COMPANY LIMIT",
        "long_name": "Thiensurat Public Company Limited",
        "summary": "Thiensurat Public Company Limited manufactures and distributes water purifiers in Thailand. It also distributes air conditioners, water filters jugs, electric appliances, and other equipment, as well as offers personal and auto title loans. The company was founded in 1976 and is headquartered in Nonthaburi, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Nonthaburi",
        "zipcode": "11120",
        "website": "http://www.thiensurat.co.th",
        "market_cap": "Small Cap"
    },
    "TSR.BK": {
        "short_name": "THIENSURAT PUBLIC COMPANY LIMIT",
        "long_name": "Thiensurat Public Company Limited",
        "summary": "Thiensurat Public Company Limited manufactures and distributes water purifiers in Thailand. It also distributes air conditioners, water filters jugs, electric appliances, and other equipment, as well as offers personal and auto title loans. The company was founded in 1976 and is headquartered in Nonthaburi, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Nonthaburi",
        "zipcode": "11120",
        "website": "http://www.thiensurat.co.th",
        "market_cap": "Small Cap"
    },
    "TUUF.F": {
        "short_name": "SOLARTRON -FGN-  BA 1",
        "long_name": "Solartron Public Company Limited",
        "summary": "Solartron Public Company Limited, together with its subsidiaries, manufactures, distributes, sells, and installs solar-cell systems and related equipment in Thailand and internationally. The company operates through Selling and Installation of Solar-Cell Systems, Distribution SolarÂ\u0096Cell, Sale of Electricity, Hire of Work, and Other segments. It also constructs solar power plants; and produces and distributes electricity from solar energy. The company was incorporated in 1986 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10110",
        "website": "http://www.solartron.co.th",
        "market_cap": "Small Cap"
    },
    "VCOM-R.BK": {
        "short_name": "VINTCOM TECHNOLOGY PUBLIC COMPA",
        "long_name": "Vintcom Technology Public Company Limited",
        "summary": "Vintcom Technology Public Company Limited, together with its subsidiaries, trades in computers and equipment in Thailand, Myanmar, Cambodia, and internationally. It operates through Sale of Goods and Rendering of Services segments. The company also provides software and related services for computers. In addition, it offers various information technology solutions and services, such as servers, storage units, engineered systems or converged infrastructure solutions, cybers security, networking devices, database systems, operating systems, virtualization systems, middleware, software development tools, and database management software for data integration, big data management, cloud data management, and data quality and security. Further, the company provides installation, consultation, and computer system maintenance services; professional services; computer and network security monitoring, and outsourced management services to protect the digital infrastructures of enterprises; and installed-based renewal and project management services. The company was founded in 1992 and is headquartered in Bangkok, Thailand. Vintcom Technology Public Company Limited is a subsidiary of Vnet Capital Co., Ltd.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10110",
        "website": "http://www.vintcom.co.th",
        "market_cap": "Small Cap"
    },
    "VCOM.BK": {
        "short_name": "VINTCOM TECHNOLOGY PUBLIC COMPA",
        "long_name": "Vintcom Technology Public Company Limited",
        "summary": "Vintcom Technology Public Company Limited, together with its subsidiaries, trades in computers and equipment in Thailand, Myanmar, Cambodia, and internationally. It operates through Sale of Goods and Rendering of Services segments. The company also provides software and related services for computers. In addition, it offers various information technology solutions and services, such as servers, storage units, engineered systems or converged infrastructure solutions, cybers security, networking devices, database systems, operating systems, virtualization systems, middleware, software development tools, and database management software for data integration, big data management, cloud data management, and data quality and security. Further, the company provides installation, consultation, and computer system maintenance services; professional services; computer and network security monitoring, and outsourced management services to protect the digital infrastructures of enterprises; and installed-based renewal and project management services. The company was founded in 1992 and is headquartered in Bangkok, Thailand. Vintcom Technology Public Company Limited is a subsidiary of Vnet Capital Co., Ltd.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10110",
        "website": "http://www.vintcom.co.th",
        "market_cap": "Small Cap"
    }
}