{
    "DMMX.JK": {
        "short_name": "Digital Mediatama Maxima Tbk.",
        "long_name": "PT Digital Mediatama Maxima Tbk",
        "summary": "PT Digital Mediatama Maxima Tbk develops and provides a digital trade marketing and cloud advertising exchange platform. It offers hardware for advertising and operating systems; maintenance for hardware and infrastructure; advertising operating system; and advertising content management services, such as advertisement on back walls, digital posters, and signage. The company is also involved in the advertising infrastructure leasing business, which includes digital kiosks or signage leasing; maintenance of advertising infrastructure and advertising content; and operation of the Advertising Exchange Hub platform, a cloud-based commercial display platform. In addition, it operates B2B trade marketing program, which includes advertising and marketing promotions, and sales activation solutions; and sells airtime packages in the form of physical and electronic vouchers, as well as cellular phone starter packs. The company was formerly known as PT Digital Marketing Solution and changed its name to PT Digital Mediatama Maxima Tbk in January 2019. PT Digital Mediatama Maxima Tbk was founded in 2015 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12940",
        "website": "http://www.dmmgroup.id",
        "market_cap": 8929111179264
    },
    "FORU.JK": {
        "short_name": "Fortune Indonesia Tbk",
        "long_name": "PT Fortune Indonesia Tbk",
        "summary": "PT Fortune Indonesia Tbk operates as an advertising agency in Indonesia. It operates through five segments: Media, Advertising, Activation, Digital, and Public Relations. The Media segment offers consulting services for planning and implementation of the media advertising shopping, which includes electronic, digital, and print, as well as outdoor media, and media monitoring and analysis services. The Advertising segment provides management consulting services, and marketing and production communication strategies comprising graphic design that includes creative concepts, logos, corporate identities, brands and products, packaging and advertising, and community services. The Activation segment offers consulting services for planning and implementing promotions, exhibitions, and interactive audio visual services, including multi-media and event management services. The Digital segment provides consulting services and implementing virtual communications, which consist communication in cyberspace and social media, as well as site and account development and management, and analysis services. The Public Relations segment offers communications services; crisis management, investor, media, and government relations; corporate, investigation, and supervision marketing; and marketing intelligence and analysis services. The company was founded in 1970 and is based in South Jakarta, Indonesia. PT Fortune Indonesia Tbk is a subsidiary of PT Karya Citra Prima.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12550",
        "website": "http://thefortuna.co",
        "market_cap": 83275096064
    }
}