{
    "GMFI.JK": {
        "short_name": "Garuda Maintenance Facility Aer",
        "long_name": "PT Garuda Maintenance Facility Aero Asia Tbk",
        "summary": "PT Garuda Maintenance Facility Aero Asia Tbk provides various aircraft maintenance, repair, and overhaul (MRO) services for aircraft, engines, and components in Africa, Asia, Australia, America, Europe, and Oceania. The company operates through three segments: Repairs and Overhauls, Line Maintenance, and Other Operations. Its MRO services include line maintenance, base maintenance, airframe, component, engineering, material and logistics, cabin maintenance, engine and APU maintenance, learning center, power, and aircraft support, as well as technical ground handling. The company was founded in 1949 and is headquartered in Tangerang, Indonesia. PT Garuda Maintenance Facility Aero Asia Tbk is a subsidiary of PT Garuda Indonesia (Persero) Tbk.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang",
        "zipcode": "15125",
        "website": "http://www.gmf-aeroasia.co.id",
        "full_time_employees": 5114
    },
    "KPAL.JK": {
        "short_name": "Steadfast Marine Tbk.",
        "long_name": "PT Steadfast Marine Tbk",
        "summary": "PT Steadfast Marine Tbk designs and manufactures ships in Indonesia. The company offers anchor handling tugs, crew boats, tug boats, diving support vessels, dredgers, motor cepats, landing craft tanks, and propelled oil barges. It serves harbor and terminal, offshore oil and gas, public transport, and defense and security markets. The company was founded in 2004 and is headquartered in Jakarta Pusat, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10720",
        "website": "http://steadfast-marine.co.id",
        "full_time_employees": 330
    }
}