{
    "ADES.JK": {
        "short_name": "Akasha Wira International Tbk.",
        "long_name": "PT Akasha Wira International Tbk",
        "summary": "PT Akasha Wira International Tbk manufactures and distributes bottled drinking water and cosmetic products in Indonesia and internationally. It offers bottled drinking water under the Nestle Pure Life and Vica Royal brands; soy milk under the Pureal brand; and beauty care products, such as hair energy and hair recovery products under the Makarizo and Wella brand. The company was founded in 1985 and is headquartered in Jakarta, Indonesia. PT Akasha Wira International Tbk is a subsidiary of Water Partners Bottling S.A.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Beverages - Non-Alcoholic",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "ALTO.JK": {
        "short_name": "Tri Banyan Tirta Tbk.",
        "long_name": "PT Tri Banyan Tirta Tbk",
        "summary": "PT Tri Banyan Tirta Tbk manufactures and sells bottled mineral and flavored water under the Alto and Total brand names in Indonesia. It also sells alkaline water products under the Total 8+ brand. In addition, the company operates as an original equipment manufacturer for bottled VIT products. It serves plastic packaging, food, beverages, and canning/bottling industries, as well as packaging materials sector. The company was founded in 1997 and is headquartered in Sukabumi, Indonesia. PT Tri Banyan Tirta Tbk is a subsidiary of PT Fikasa Bintang Cemerlang.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Beverages - Non-Alcoholic",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Sukabumi"
    },
    "CLEO.JK": {
        "short_name": "Sariguna Primatirta Tbk.",
        "long_name": "PT Sariguna Primatirta Tbk",
        "summary": "PT Sariguna Primatirta Tbk engages in the bottled water business in Indonesia. It operates through Bottle, Non Bottle, and Others segments. The company provides packaged drinking water under the Anda, Cleo Platine, S-Tube, Super O2, Vio 8+, and Cleo Pure Water brands. It also offers industry and trading services. The company was formerly known as PT Sari Guna and changed its name to PT Sariguna Primatirta Tbk in December 1988. The company was founded in 1988 and is headquartered in Sidoarjo, Indonesia. PT Sariguna Primatirta Tbk is a subsidiary of PT Tancorp Global Abadi.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Beverages - Non-Alcoholic",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Sidoarjo"
    }
}