{
    "2S4A.SG": {
        "short_name": "PT Surya Citra Media Tbk Regist",
        "long_name": "PT Surya Citra Media Tbk",
        "summary": "PT Surya Citra Media Tbk, together with its subsidiaries, provides multimedia services in Indonesia. The company owns SCTV and Indosiar television channels. It also provides soccer management, entertainment, and advertising services; and artist management services. In addition, the company engages in film and content trading, content management and production, production house, and multimedia operations; film production and video recording activities; and provision and utilization of multimedia through telecommunications equipment. Further, it offers film distribution and marketing services; content creative; animation production services; film recording services; and information technology, promotion and marketing, general telecommunication, management agency and production, public relations, and mass media and audio recording services. Additionally, the company provides online media, printed and electronic media, and impresario services; and rental and management services. The company was formerly known as PT Cipta Aneka Selaras and changed its name to PT Surya Citra Media Tbk in January 2002. The company was founded in 1999 and is headquartered in Jakarta, Indonesia. PT Surya Citra Media Tbk is a subsidiary of PT Elang Mahkota Teknologi Tbk.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10270",
        "website": "http://www.scm.co.id",
        "market_cap": "Small Cap"
    },
    "EMTK.JK": {
        "short_name": "Elang Mahkota Teknologi Tbk.",
        "long_name": "PT Elang Mahkota Teknologi Tbk",
        "summary": "PT Elang Mahkota Teknologi Tbk, through its subsidiaries, provides media, information technology, connectivity, and other services in Indonesia. The company operates in three segments: Media, Solutions, and Others. The Media segment is involved in free-to-air television broadcasting business through 3 television channels, including PT Indosiar Visual Mandiri, PT Surya Citra Televisi, and PT Omni Intivision, as well as film, video production, megaportal website, and digital publishing businesses. The Solutions segment provides a range of infrastructure solutions and services that include telecommunications and networking, banking software and hardware, integrated very small aperture terminal solutions, and telecommunication's retail distribution solutions. The Others segment offers connectivity services, such as internet, DVBT pay TV, and wireless broadband services; and medical service, as well as engages in fintech and other businesses. The company is also involved in trading of medical equipment, leasing of broadcasting and film studios, trading of multimedia film and content, content management and production, ad based video-on demand and subscription video-on demand, and online media businesses; and provision of tower lease, management, information technology, tourism, artist management, and outdoor media advertising services. PT Elang Mahkota Teknologi Tbk was founded in 1983 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10270",
        "website": "http://www.emtek.co.id",
        "market_cap": "Mid Cap"
    },
    "MARI.JK": {
        "short_name": "Mahaka Radio Integra Tbk.",
        "long_name": "PT Mahaka Radio Integra Tbk",
        "summary": "PT Mahaka Radio Integra Tbk engages in the radio broadcasting business in Indonesia. The company owns radio stations for commercial radio broadcasting. It owns and operates 8 radio stations, including JAK 101 fm, GEN 98.7 fm, GEN 103.1 fm, HOT 93.2 fm, KIS 95.1 fm, MUSTANG 88.0 fm, MOST RADIO 105.8 fm, and NOICE. The company was founded in 2006 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12980",
        "website": "http://www.jak101fm.com",
        "market_cap": "Micro Cap"
    },
    "MDIA.JK": {
        "short_name": "Intermedia Capital Tbk.",
        "long_name": "PT Intermedia Capital Tbk",
        "summary": "PT Intermedia Capital Tbk, through its subsidiaries, provides television broadcasting services in Indonesia. It operates ANTV, a free-to-air television channel. The company offers content that are focused on families, children, and entertainment. It is also involved in the provision of communication and management consultancy services; and production house activities. The company was founded in 2008 and is headquartered in Jakarta, Indonesia. PT Intermedia Capital Tbk is a subsidiary of PT Visi Media Asia Tbk.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12940",
        "website": "http://www.imc.co.id",
        "market_cap": "Micro Cap"
    },
    "SCMA.JK": {
        "short_name": "Surya Citra Media Tbk.",
        "long_name": "PT Surya Citra Media Tbk",
        "summary": "PT Surya Citra Media Tbk, together with its subsidiaries, provides multimedia services in Indonesia. The company owns SCTV and Indosiar television channels. It also provides soccer management, entertainment, and advertising services; and artist management services. In addition, the company engages in film and content trading, content management and production, production house, and multimedia operations; film production and video recording activities; and provision and utilization of multimedia through telecommunications equipment. Further, it offers film distribution and marketing services; content creative; animation production services; film recording services; and information technology, promotion and marketing, general telecommunication, management agency and production, public relations, and mass media and audio recording services. Additionally, the company provides online media, printed and electronic media, and impresario services; and rental and management services. The company was formerly known as PT Cipta Aneka Selaras and changed its name to PT Surya Citra Media Tbk in January 2002. The company was founded in 1999 and is headquartered in Jakarta, Indonesia. PT Surya Citra Media Tbk is a subsidiary of PT Elang Mahkota Teknologi Tbk.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10270",
        "website": "http://www.scm.co.id",
        "market_cap": "Small Cap"
    },
    "VIVA.JK": {
        "short_name": "Visi Media Asia Tbk.",
        "long_name": "PT Visi Media Asia Tbk",
        "summary": "PT Visi Media Asia Tbk operates as an integrated convergent media company in Indonesia. It operates through Advertisement and Non-Advertisement segments. The company operates tvOne, a news and sports television station; ANTV, which provides entertainment and lifestyle content, such as drama, comedy, animation, and other general entertainment programs for families and children; viva.co.id, an online news and entertainment portal; and Viva and tvOneConnect applications to access and engage with tvOne content. It also offers trading and business management consultancy services; office rental, property management, and other services; internet advertising and website services; multimedia and telecommunication services; general private television broadcasting services; television broadcasting industry services; and production house services. The company was founded in 2004 and is based in Jakarta, Indonesia. PT Visi Media Asia Tbk is a subsidiary of PT Bakrie Global Ventura.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12920",
        "website": "http://www.vivagroup.co.id",
        "market_cap": "Micro Cap"
    }
}