{
    "3KH.F": {
        "short_name": "CATUR SENTOSA ADIPRANA",
        "long_name": "PT Catur Sentosa Adiprana Tbk",
        "summary": "PT Catur Sentosa Adiprana Tbk, through its subsidiaries, distributes building materials and consumer products in Indonesia. The company sells building materials, including granite porcelain tiles; and chemicals materials for use in industries. It also distributes consumer goods, such as foods, daily necessities, and household goods. In addition, the company operates retail stores that offer home furniture and accessories; and develops warehouse area. PT Catur Sentosa Adiprana Tbk was founded in 1966 and is headquartered in Jakarta Barat, Indonesia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta Barat"
    },
    "AMFG.JK": {
        "short_name": "Asahimas Flat Glass Tbk.",
        "long_name": "PT Asahimas Flat Glass Tbk",
        "summary": "PT Asahimas Flat Glass Tbk manufactures and sells flat glass and automotive glass products in Indonesia. The Flat Glass segment offers a range of clear and tinted, figured, reflective, coated, and mirror glasses, which are used for glass curtain walls, window glass, and suspended glass in building construction, as well as a raw material for the downstream industry. The Automotive Glass segment provides automotive, tempered, and laminated glasses that are primarily used in the automotive industry. The company also provides automotive glass repair and installation services. It also exports its products. The company was formerly known as PT Asahimas Flat Glass Co., Ltd. and changed its name to PT Asahimas Flat Glass Tbk in June 1998. PT Asahimas Flat Glass Tbk was founded in 1971 and is headquartered in North Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Utara"
    },
    "ARNA.JK": {
        "short_name": "Arwana Citramulia Tbk.",
        "long_name": "PT Arwana Citramulia Tbk",
        "summary": "PT Arwana Citramulia Tbk, together with its subsidiaries, manufactures and distributes ceramic tiles in Indonesia. The company primarily offers wall tiles. It sells its products under the Arwana and UNO brands through sub-distributors and retail outlets. The company was formerly known as PT Arwana Citra Mulia and changed its name to PT Arwana Citramulia Tbk in November 1993. PT Arwana Citramulia Tbk was founded in 1993 and is headquartered in West Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Barat"
    },
    "CAKK.JK": {
        "short_name": "Cahayaputra Asa Keramik Tbk.",
        "long_name": "PT Cahayaputra Asa Keramik Tbk",
        "summary": "PT Cahayaputra Asa Keramik Tbk designs, manufactures, distributes, and sells tiles in Indonesia. The company offers wall and floor tiles for living room, kitchens, and bathrooms. It distributes its products in Europe, the United States, Canada, Australia, Africa, New Zealand, and other Asian countries. The company was founded in 1997 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "South Jakarta"
    },
    "CSAP.JK": {
        "short_name": "Catur Sentosa Adiprana Tbk.",
        "long_name": "PT Catur Sentosa Adiprana Tbk",
        "summary": "PT Catur Sentosa Adiprana Tbk, through its subsidiaries, distributes building materials and consumer products in Indonesia. The company sells building materials, including granite porcelain tiles; and chemicals materials for use in industries. It also distributes consumer goods, such as foods, daily necessities, and household goods. In addition, the company operates retail stores that offer home furniture and accessories; and develops warehouse area. PT Catur Sentosa Adiprana Tbk was founded in 1966 and is headquartered in Jakarta Barat, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Barat"
    },
    "KIAS.JK": {
        "short_name": "Keramika Indonesia Assosiasi Tb",
        "long_name": "PT Keramika Indonesia Assosiasi Tbk",
        "summary": "PT Keramika Indonesia Assosiasi Tbk produces and sells various ceramic wall, roof, granite, and floor tiles in Indonesia, Asia, Europe, and the United States. It provides its products under the KIA, IMPRESSO, and SPECTRA brands. The company was founded in 1953 and is based in Central Jakarta, Indonesia. PT Keramika Indonesia Assosiasi Tbk is a subsidiary of SCG Building Materials Co., Ltd.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Central Jakarta"
    },
    "KOIN.JK": {
        "short_name": "Kokoh Inti Arebama Tbk",
        "long_name": "PT Kokoh Inti Arebama Tbk",
        "summary": "PT Kokoh Inti Arebama, Tbk trades in building materials. It distributes ceramic products, roof tiles, granites, sanitary ware, paints, gypsum, leak-proof coatings, and instant cement. The company offers products under the KIA, Impresso, and Laurenza brand names. Its marketing and distribution network comprises 19 branches in various cities in Indonesia, including Medan, Pekan Baru, Jambi, Palembang, Bandar Lampung, Jakarta, Bekasi, Bogor, Tangerang, Bandung, Cirebon, Yogyakarta, Semarang, Surabaya, Malang, Denpasar, Banjarmasin, Samarinda, and Makassar. The company was founded in 2001 and is headquartered in Central Jakarta, Indonesia. PT Kokoh Inti Arebama, Tbk is a subsidiary of SCG Distribution Company Limited.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Pusat"
    },
    "MLIA.JK": {
        "short_name": "Mulia Industrindo Tbk",
        "long_name": "PT Mulia Industrindo Tbk",
        "summary": "PT Mulia Industrindo Tbk, together with its subsidiaries, manufactures and sells glass in Indonesia. It offers plain and colored float glass; glass containers, such as bottles, mugs, and cups, as well as transparent and colored container glass used for packaging of food, and beverages and beer; architectural glass blocks for application on wall and floor; automotive safety glass; and ceramic tiles. The company also exports its products to Asia, Australia, Europe, Africa, and the United States. It primarily sells its products to distributors and glass processors. PT Mulia Industrindo Tbk was founded in 1986 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "TOTO.JK": {
        "short_name": "Surya Toto Indonesia Tbk.",
        "long_name": "PT Surya Toto Indonesia Tbk",
        "summary": "PT Surya Toto Indonesia Tbk manufactures and sells sanitary wares, fittings, kitchen systems, and other related products in Indonesia and internationally. It offers sanitary wares, including neorests, toilets, lavatories, urinals, bidets, bathtubs, sinks, and washlets; bathroom, automatic, shower, and shower spray fittings, as well as bath spouts, and kitchen and single faucets; and accessories, such as robe hooks, soap holders, toilet paper and towel holders, and towel rings, as well as supplementary and other products. The company was founded in 1977 and is headquartered in West Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Barat"
    }
}