{
  "LION.JK": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Business Equipment & Supplies",
    "long_name": "PT Lion Metal Works Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "Lion Metal Works Tbk.",
    "state": null,
    "summary": "PT Lion Metal Works Tbk manufactures and sells office equipment and steel fabricated products in Indonesia and internationally. The company operates through Office Equipment, Building Material, and Other segments. It offers office equipment and file storage equipment systems, such as filing cabinets, horizontal file cabinet, modular units, office desks, mobile files, office chairs, lockers, cupboard, office panels, workstations, and other office equipment; and safe and security equipment, including safes, fireproof safes, hotel bedroom safes, and safe deposit boxes. The company also provides warehouse equipment comprising utility racks, archive shelving racks, multitier racks, pallet racks, drive-in racks, and shuttle racks; building and construction materials consisting of cable support systems, steel doors, fire proof doors, and steel roof structures for buildings; C-channel and related products; and hospital equipment. It sells its products through distributors, dealers, and suppliers, as well as through online store. The company was founded in 1972 and is headquartered in Jakarta, Indonesia.",
    "website": "http://www.lionmetal.co.id",
    "zipcode": "13910"
  },
  "MCAS.JK": {
    "city": "Jakarta Selatan",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Business Equipment & Supplies",
    "long_name": "PT M Cash Integrasi Tbk",
    "market": "id_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "M Cash Integrasi Tbk.",
    "state": null,
    "summary": "PT M Cash Integrasi Tbk operates as a digital distribution company in Indonesia. It provides digital kiosk, a self-service kiosk in modern and traditional retails; cashier, which offers digital products at modern retail; and digital products to traditional retails, as well as apps/chat bots. The company also offers information technology management consulting services. PT M Cash Integrasi Tbk was founded in 2010 and is based in South Jakarta, Indonesia.",
    "website": "http://www.mcash.id",
    "zipcode": "12930"
  },
  "MDRN.JK": {
    "city": "Jakarta Selatan",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Business Equipment & Supplies",
    "long_name": "PT Modern Internasional Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "Modern Internasional Tbk.",
    "state": null,
    "summary": "PT Modern Internasional Tbk, together with its subsidiaries, primarily engages in the trading business in Indonesia. The company is involved in the operation of department stores and supermarkets; general trading, import/export trading, and food products and beverages trading activities; and provision of document solutions. It also engages in trading and servicing photography/cinematography equipment, home appliances/electronic equipment, engineering equipment, mechanical equipment, electronics, and photocopy machines and its spare parts. The company was formerly known as PT Modern Photo Tbk and changed its name to PT Modern Internasional Tbk in June 2007. PT Modern Internasional Tbk was founded in 1971 and is based in South Jakarta, Indonesia.",
    "website": "http://www.moderninternasional.co.id",
    "zipcode": "12240"
  }
}
