{
    "AKSI.JK": {
        "short_name": "Maming Enam Sembilan Mineral Tb",
        "long_name": "PT Maming Enam Sembilan Mineral Tbk",
        "summary": "PT Maming Enam Sembilan Mineral Tbk, through its subsidiary, PT Rezki Batulicin Transport, engages in the field of land transportation in Indonesia. The company's activities include goods and passengers transportation; warehousing; and freight transportation, which includes transportation for goods, containers, and tracking trailers; and mining and petroleum transportation, and transportation for plantation products. It has 6 scania units, 59 dump truck units, 2 water tank units, and 20 units of Volvo double trailers. The company was formerly known as PT Majapahit Inti Corpora Tbk and changed its name to PT Maming Enam Sembilan Mineral Tbk in January 2020. PT Maming Enam Sembilan Mineral Tbk was founded in 1990 and is based in Central Jakarta, Indonesia. PT Maming Enam Sembilan Mineral Tbk is a subsidiary of PT Batulicin Enam Sembilan Transportasi.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12190",
        "website": "http://www.majapahitinticorpora.co.id",
        "market_cap": "Small Cap"
    },
    "APIC.JK": {
        "short_name": "Pacific Strategic Financial Tbk",
        "long_name": "PT Pacific Strategic Financial Tbk",
        "summary": "PT Pacific Strategic Financial Tbk, together with its subsidiaries, provides investment management services primarily in Indonesia. The company also provides securities brokerage and underwriting services, as well as other services related to investment and capital markets; and financial management services. In addition, it offers business consulting; and conventional and/or Sharia life insurance services. The company was formerly known as PT Pan Pacific International and changed its name to PT Pacific Strategic Financial Tbk in November 2010. PT Pacific Strategic Financial Tbk was founded in 1989 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12710",
        "website": "http://www.apic.co.id",
        "market_cap": "Small Cap"
    },
    "BCAP.JK": {
        "short_name": "MNC Kapital Indonesia Tbk.",
        "long_name": "PT MNC Kapital Indonesia Tbk",
        "summary": "PT MNC Kapital Indonesia Tbk, through its subsidiaries, provides various financial products and services in Indonesia. The company offers fund investment, multi finance, brokerage and underwriting, life insurance, general insurance, and leasing products. It also provides banking, property leasing, and financial technology services. The company was formerly known as PT Bhakti Capital Indonesia Tbk and changed its name to PT MNC Kapital Indonesia Tbk in November 2012. The company was founded in 1999 and is headquartered in Jakarta, Indonesia. PT MNC Kapital Indonesia Tbk is a subsidiary of PT MNC Investama Tbk.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10340",
        "website": "http://www.mncfinancialservices.com",
        "market_cap": "Small Cap"
    },
    "KREN.JK": {
        "short_name": "Kresna Graha Investama Tbk.",
        "long_name": "PT Kresna Graha Investama Tbk",
        "summary": "PT Kresna Graha Investama Tbk, together with its subsidiaries, operates in financial and investment, and technology and digital sectors in Indonesia. The company's Financial and Investment segment offers mutual funds and fixed income; and financial advisory, asset management, brokerage, investment management, and securities underwriting services, as well as operates stock trading platform. Its Technology and Digital segment provides integrated digital products and services comprising financial technology, digital retail and marketing, artificial intelligence, and enterprise solutions, as well as media, and entertainment and lifestyle. The company also engages in the development of human resources platform; trading, online media, and outsourcing activities; digital cloud advertising business; sale of electric vouchers; and provision of communication-platform-as-a-service. The company was formerly known as PT Kresna Graha Sekurindo and changed its name to PT Kresna Graha Investama Tbk in July 2015. The company was founded in 1999 and is headquartered in Jakarta, Indonesia. PT Kresna Graha Investama Tbk is a subsidiary of PT Kresna Prima Invest.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12190",
        "website": "http://www.kresnainvestments.com",
        "market_cap": "Small Cap"
    },
    "LPPS.JK": {
        "short_name": "Lenox Pasifik Investama Tbk.",
        "long_name": "PT Lenox Pasifik Investama Tbk",
        "summary": "PT Lenox Pasifik Investama Tbk provides investment management services in Indonesia. The company was formerly known as PT Lippo Securities Tbk and changed its name to PT Lenox Pasifik Investama Tbk in September 2020. The company was founded in 1989 and is based in Tangerang, Indonesia. PT Lippo Securities Tbk operates as a subsidiary of PT Inti Anugrah Pratama.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang",
        "zipcode": "15139",
        "website": "http://www.lipposecurities.co.id",
        "market_cap": "Small Cap"
    },
    "LPS1.F": {
        "short_name": "LENOX PASIFIK  RP 1000",
        "long_name": "PT Lenox Pasifik Investama Tbk",
        "summary": "PT Lenox Pasifik Investama Tbk provides investment management services in Indonesia. The company was formerly known as PT Lippo Securities Tbk and changed its name to PT Lenox Pasifik Investama Tbk in September 2020. The company was founded in 1989 and is based in Tangerang, Indonesia. PT Lippo Securities Tbk operates as a subsidiary of PT Inti Anugrah Pratama.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang",
        "zipcode": "15139",
        "website": "http://www.lipposecurities.co.id",
        "market_cap": "Small Cap"
    },
    "PANS.JK": {
        "short_name": "Panin Sekuritas Tbk.",
        "long_name": "PT  Panin Sekuritas Tbk",
        "summary": "PT Panin Sekuritas Tbk provides securities brokerage, underwriting, and investment management services in Indonesia. The company was formerly known as PT. Nusamas Panin and changed its name to PT Panin Sekuritas Tbk in June 1995. PT Panin Sekuritas Tbk was founded in 1989 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "South Jakarta",
        "zipcode": "12190",
        "website": "http://www.pans.co.id",
        "market_cap": "Small Cap"
    },
    "PEGE.JK": {
        "short_name": "Panca Global Kapital Tbk.",
        "long_name": "PT Panca Global Kapital Tbk",
        "summary": "PT Panca Global Kapital Tbk engages in the brokerage and underwriting services in Indonesia. It is also involved in development and investment business, as well as general trading activities. The company was formerly known as PT Panca Global Securities Tbk. PT Panca Global Kapital Tbk was founded in 1999 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12190",
        "website": "http://www.pancaglobal.co.id",
        "market_cap": "Small Cap"
    },
    "RELI.JK": {
        "short_name": "Reliance Sekuritas Indonesia Tb",
        "long_name": "PT Reliance Sekuritas Indonesia Tbk",
        "summary": "PT Reliance Sekuritas Indonesia Tbk provides securities brokerage and underwriting services in Indonesia and internationally. The company was founded in 1993 and is headquartered in Jakarta Utara, Indonesia. PT Reliance Sekuritas Indonesia Tbk is a subsidiary of PT Reliance Capital Management.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Utara",
        "zipcode": "14450",
        "website": "http://www.reliancesekuritas.com",
        "market_cap": "Small Cap"
    },
    "TRIM.JK": {
        "short_name": "Trimegah Sekuritas Indonesia Tb",
        "long_name": "PT Trimegah Sekuritas Indonesia Tbk",
        "summary": "PT Trimegah Sekuritas Indonesia Tbk engages in the securities brokerage and underwriting, and investment management activities in Indonesia. Its Equity trading division provides equity brokerage services for retail and institutional clients. This division offers equity sales service in the primary market and serves as equity brokerage in the secondary market to institutional investors, such as asset management companies, pension funds, and sub-broking clients. The company's fixed income trading division facilitates government bond transactions, including retail government, retail and saving Sharia government, savings bond retail, and corporate bonds. This division serves insurance companies, fund managers, pension funds, banks, and other securities companies. Its Investment Banking division provides bonds and equity underwriting services, as well as financial advisory services comprising merger and acquisition, divestment, valuation, due diligence, corporate restructuring, and financing. The company also provides equity, balanced, fixed income, and money market funds for corporations, financial institutions, and pension funds, as well as acts as a mutual funds selling agent. In addition, it offers online trading services. The company was formerly known as PT Trimegah Securities Tbk and changed its name to PT Trimegah Sekuritas Indonesia Tbk in July 2016. PT Trimegah Sekuritas Indonesia Tbk was founded in 1990 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12190",
        "website": "http://www.trimegah.com",
        "market_cap": "Small Cap"
    },
    "YULE.JK": {
        "short_name": "Yulie Sekuritas Indonesia Tbk.",
        "long_name": "PT Yulie Sekuritas Indonesia Tbk",
        "summary": "PT Yulie Sekuritas Indonesia Tbk operates as a securities company. The company operates through two divisions, Securities Brokerage Trading and Underwriting. The Securities Brokerage Trading division provides stock sales services in the primary market and intermediary stock traders in the secondary market for retail and institutional clients. The Underwriting division provides stock and bonds underwriting services. The company, formerly known as PT Yulie Sekurindo Tbk, was founded in 1989 and is based in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "South Jakarta",
        "zipcode": "12950",
        "website": "http://www.yuliesekuritas.com",
        "market_cap": "Small Cap"
    }
}