{
    "AGII.JK": {
        "short_name": "Aneka Gas Industri Tbk.",
        "long_name": "PT Aneka Gas Industri Tbk",
        "summary": "PT Aneka Gas Industri Tbk produces, markets, and sells industrial gases in Indonesia. The company offers air gases, including oxygen, nitrogen, and argon; fuel gases, such as liquid propane, natural, and liquid petroleum gas; mixed gases comprising compressed natural, environmental calibration, and exhaust emissions engine gases; rare gases consisting of helium, neon, krypton, and xenon; specialty gases, including sulfur hexafluoride, sterilization gas, and ammonia; and synthetic gases, such as hydrogen, acetylene, carbon dioxide, carbon monoxide, nitrous oxide, epoxyethane, and sulfur dioxide. It also provides medical oxygen/respiration gas, medical nitrous oxide gas, medical air gas, medical nitrogen gas, medical CO2, lung function mix gases, calibration gas for blood analysis, laser gas for surgery, and cryopreservation gas. In addition, the company offers medical supply equipment, medical monitoring systems, modular operating theatre products, onsite gas systems, gas handling and cutting equipment, and safety equipment, as well as installation services. Further, it engages in the transportation and storage of low temperature fluids; and provision of low temperature containers for biological specimens, as well as construction, wholesale and retail, gas trading, and car and motorcycle repair and maintenance activities. The company operates approximately 104 filling stations. It serves agriculture and agri, food and beverage, glass, automotive, shipping, spacecraft, aeronautic, mining, oil and gas, machinery and construction, metallurgy, pulp and paper, specialty gas, and electronic and semiconductor industries. PT Aneka Gas Industri Tbk was founded in 1916 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12850",
        "website": "http://www.anekagas.com",
        "full_time_employees": 2414
    },
    "BRPT.JK": {
        "short_name": "Barito Pacific Tbk.",
        "long_name": "PT Barito Pacific Tbk",
        "summary": "PT Barito Pacific Tbk, together with its subsidiaries, primarily engages in the petrochemical production business. It operates through Petrochemical, Building and Hotel Management (Property), Energy and Resources, and Others segments. The company produces petrochemical products, which include olefins, such as ethylene, propylene, py-gas, and mixed C4; polyolefins, including polyethylene and polypropylene; styrene monomer, a material for downstream industry products comprising polystyrene (PS), expanded PS, styrene acrylonitrile, acrylonitrile butadiene styrene, styrene butadiene rubber, styrene butadiene latex, and unsaturated polyester resins; and polybutadiene rubber and solution styrene butadiene rubber used as raw materials for the production of tires. It also operates geothermal operations with total installed capacity of 875 MW. In addition, the company manages properties; develops industrial and commercial property, commercial complex, office space, and standard factory building; and owns and manages hotel. Further, it engages in the logistics and glue production businesses. The company was formerly known as PT Barito Pacific Timber Tbk and changed its name to PT Barito Pacific Tbk in 2007. PT Barito Pacific Tbk was founded in 1979 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "11410",
        "website": "http://www.barito-pacific.com",
        "full_time_employees": 3218
    },
    "MOLI.JK": {
        "short_name": "Madusari Murni Indah Tbk.",
        "long_name": "PT Madusari Murni Indah Tbk",
        "summary": "PT. Madusari Murni Indah Tbk, through its subsidiaries, produces, distributes, trades in, and sells food grade ethanol. It also provides carbondioxide gas in liquid and dry forms; and organic and potassium fertilizers. The company sells its products under the Molindo Ethanol, Molindo CO2, and Molindo Fertilizer brands. It serves food and beverage, pharmaceutical, cosmetic, cigarette, hospital, furniture, ink, printing, fuel, and welding industries. The company was founded in 1959 and is headquartered in Malang, Indonesia. PT. Madusari Murni Indah Tbk is subsidiary of Pt Cropsco Panen Indonusa.",
        "currency": "IDR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Malang",
        "zipcode": "65216",
        "website": "http://www.molindo.co.id",
        "full_time_employees": 755
    },
    "OB8.F": {
        "short_name": "BARITO PAC.  RP 100",
        "long_name": "PT Barito Pacific Tbk",
        "summary": "PT Barito Pacific Tbk, together with its subsidiaries, primarily engages in the petrochemical production business. It operates through Petrochemical, Building and Hotel Management (Property), Energy and Resources, and Others segments. The company produces petrochemical products, which include olefins, such as ethylene, propylene, py-gas, and mixed C4; polyolefins, including polyethylene and polypropylene; styrene monomer, a material for downstream industry products comprising polystyrene (PS), expanded PS, styrene acrylonitrile, acrylonitrile butadiene styrene, styrene butadiene rubber, styrene butadiene latex, and unsaturated polyester resins; and polybutadiene rubber and solution styrene butadiene rubber used as raw materials for the production of tires. It also operates geothermal operations with total installed capacity of 875 MW. In addition, the company manages properties; develops industrial and commercial property, commercial complex, office space, and standard factory building; and owns and manages hotel. Further, it engages in the logistics and glue production businesses. The company was formerly known as PT Barito Pacific Timber Tbk and changed its name to PT Barito Pacific Tbk in 2007. PT Barito Pacific Tbk was founded in 1979 and is headquartered in Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "11410",
        "website": "http://www.barito-pacific.com",
        "full_time_employees": 3218
    },
    "OKAS.JK": {
        "short_name": "Ancora Indonesia Resources Tbk.",
        "long_name": "PT Ancora Indonesia Resources Tbk",
        "summary": "PT Ancora Indonesia Resources Tbk, together with its subsidiaries, operates in the explosives industry in Indonesia. The company trades in and manufactures ammonium nitrate and nitric acid compounds used as explosives in coal and mineral mining operation, public works, and the cement industry, as well as explosives related accessories. It also provides drilling and work-over of oil well services; blasting services; mining services; and shipping services. The company was formerly known as PT TD Resources, Tbk and changed its name to PT Ancora Indonesia Resources Tbk. in December 2008. The company was founded in 2003 and is headquartered in Jakarta, Indonesia. PT Ancora Indonesia Resources Tbk operates as a subsidiary of PT Multi Berkat Energi.",
        "currency": "IDR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12190",
        "website": "http://www.ancorair.com",
        "full_time_employees": 605
    },
    "SRSN.JK": {
        "short_name": "Indo Acidatama Tbk",
        "long_name": "PT Indo Acidatama Tbk",
        "summary": "PT Indo Acidatama Tbk produces and sells basic and agro chemicals primarily in Indonesia. The company offers ethanol, acetic acid, and ethyl acetate products; and organic plus bio fertilizers under the POMI and BEKA names. It also exports its products. The company was formerly known as PT Sarasa Nugraha Tbk and changed its name to PT Indo Acidatama Tbk in May 2006. PT Indo Acidatama Tbk was founded in 1982 and is based in West Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Barat",
        "zipcode": "11530",
        "website": "http://www.acidatama.co.id",
        "full_time_employees": null
    },
    "UNIC.JK": {
        "short_name": "Unggul Indah Cahaya Tbk.",
        "long_name": "PT Unggul Indah Cahaya Tbk",
        "summary": "PT Unggul Indah Cahaya Tbk manufactures and sells alkylbenzene chemicals as primary raw material for the production of detergents in Indonesia. The company operates in two segments, Chemicals and Real Estate. It offers linear alkylbenzene and branched alkylbenzene, as well as by-products, such as heavy and light alkylate. The company also manufactures and distributes active detergents of linear alkylbenzene sulfonic acid and sodium lauryl ether sulfate, sodium tripolyphosphate, and phosphate and surfactant. It exports its products to Australia, France, Germany, Japan, Singapore, Vietnam, and the United States. In addition, the company operates as a real estate developer; engages in trading and investment activities; and retails consumer products. PT Unggul Indah Cahaya Tbk was founded in 1983 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "South Jakarta",
        "zipcode": "12930",
        "website": "http://www.uic.co.id",
        "full_time_employees": 627
    }
}