{
  "CCSI.JK": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Communication Equipment",
    "long_name": "PT Communication Cable Systems Indonesia Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Communication Cable Systems Ind",
    "state": null,
    "summary": "PT Communication Cable Systems Indonesia Tbk manufactures and sells optical fiber cables in Indonesia and internationally. The company also produces submarine cables; indoor, outdoor, and special cables; HDPE pipes; and accessories. It serves Internet telecommunication, oil and gas, power utility, railway transport authority, and private industries. The company was formerly known as PT. Siemens Kabel Optik. PT Communication Cable Systems Indonesia Tbk was founded in 1996 and is headquartered in Jakarta, Indonesia.",
    "website": "http://www.ccsi.co.id",
    "zipcode": "12810"
  },
  "KBLM.JK": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Communication Equipment",
    "long_name": "PT Kabelindo Murni Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Kabelindo Murni Tbk.",
    "state": null,
    "summary": "PT Kabelindo Murni Tbk manufactures cables and other related products for telecommunication industries and for the distribution of electricity in Indonesia. It offers bare conductors and twisted cables; low voltage power cables, such as building, control, and instrument cables; medium voltage power cables; and flexible cables. The company also provides special cables for industrial installation, such as power stations, oil and petrochemical plants, high-rise buildings, mass transit underground passenger systems, and control connection networks. In addition, it provides construction services. The company was formerly known as PT Kabel Indonesia and changed its name to PT Kabelindo Murni Tbk in 1979. PT Kabelindo Murni Tbk was founded in 1972 and is based in Jakarta, Indonesia.",
    "website": "http://www.kabelindo.co.id",
    "zipcode": "13930"
  },
  "MKNT.JK": {
    "city": "Jakarta Selatan",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Communication Equipment",
    "long_name": "PT Mitra Komunikasi Nusantara Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Mitra Komunikasi Nusantara Tbk.",
    "state": null,
    "summary": "PT Mitra Komunikasi Nusantara Tbk distributes and sells telecommunication products in Indonesia. The company offers smartphones, tablets/pads, prepaid vouchers, SIM cards, and network products. It also sells its products online. The company was founded in 2008 and is headquartered in South Jakarta, Indonesia.",
    "website": "http://www.mknt.id",
    "zipcode": "12940"
  },
  "SUPR.JK": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Communication Equipment",
    "long_name": "PT Solusi Tunas Pratama Tbk",
    "market": "id_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "Solusi Tunas Pratama Tbk.",
    "state": null,
    "summary": "PT Solusi Tunas Pratama Tbk operates as an independent tower company in Indonesia. The company operates and rents base transceiver station (BTS) tower buildings or telecommunications towers, and other related telecommunication infrastructure. It operates greenfield and rooftop telecommunication towers, including four-legged supporting towers, three-legged self-supporting towers, camouflage towers, monopoles, and roof top towers, as well as mobile BTS. The company was founded in 2006 and is headquartered in Jakarta, Indonesia. PT Solusi Tunas Pratama Tbk is a subsidiary of PT Kharisma Indah Ekaprima.",
    "website": "http://www.stptower.com",
    "zipcode": "12210"
  }
}
