{
    "BMSR.JK": {
        "short_name": "Bintang Mitra Semestaraya Tbk",
        "long_name": "PT Bintang Mitra Semestaraya Tbk",
        "summary": "PT Bintang Mitra Semestaraya Tbk engages in the trading of chemicals and rice in Indonesia. The company offers caustic soda liquid and flakes, hydrochloric acid, sodium hypochlorite, sulfuric acid, ethylene dichloride, vinyl chloride monomer, polyvinyl chloride, and hydrogen gas. It is also involved in the exploration and production of oil and gas; and investment and general trading activities. The company was formerly known as PT Bintang Mahkota Semestaraya and changed its name to PT Bintang Mitra Semestaraya Tbk in May 1991. PT Bintang Mitra Semestaraya Tbk was founded in 1989 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "BNBR.JK": {
        "short_name": "Bakrie & Brothers Tbk",
        "long_name": "PT Bakrie & Brothers Tbk",
        "summary": "PT Bakrie & Brothers Tbk, through its subsidiaries, engages in general trading, construction, agriculture, coal mining, telecommunication, and oil and gas businesses in Indonesia and internationally. The company operates through two segments, Infrastructure and Manufacturing; and Trading, Services, and Investment. It offers automotive components for vehicles and heavy duty equipment; building materials, such as fiber cement roofing, ceiling, conduit pipes for general use; steel pipes for use in oil and gas, and general purposes; and fabrication services. The company also engages in the trading, distribution, and construction of building products, including gypsum, roofing, and autoclaved aerated concrete products, as well as electrical lightings and prefab bathrooms; the development of infrastructure assets; and steel construction, investment, laboratory, oil and gas trading, management consultation, and energy and electrical power businesses. In addition, it provides non-organic fertilizers and industries-organic chlor chemicals; and trades in ammonium nitrate and olein. Further, the company offers information technology, telecommunication, integration system, and multimedia and network services. PT Bakrie & Brothers Tbk was founded in 1942 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "IMJS.JK": {
        "short_name": "Indomobil Multi Jasa Tbk.",
        "long_name": "PT Indomobil Multi Jasa Tbk",
        "summary": "PT Indomobil Multi Jasa Tbk, together with its subsidiaries, provides financial, and car rental and related services in Indonesia. The company offers various financing services; and vehicle rental, trucking, driver, and inspection services. It also sells fuel. The company was formerly known as PT Multi Tambang Abadi and changed its name to PT Indomobil Multi Jasa Tbk in February 2013. PT Indomobil Multi Jasa Tbk was founded in 2004 and is headquartered in East Jakarta, Indonesia. PT Indomobil Multi Jasa Tbk is a subsidiary of PT Indomobil Sukses Internasional Tbk.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "East Jakarta"
    },
    "JKON.JK": {
        "short_name": "Jaya Konstruksi Manggala Pratam",
        "long_name": "PT Jaya Konstruksi Manggala Pratama Tbk",
        "summary": "PT Jaya Konstruksi Manggala Pratama Tbk engages in the construction business in Indonesia. The company is also involved in precast concrete manufacturing, trading, mechanical electrical, contractor, gas and asphalt dealer, station LPG and bulk transportation, asphalt trading, mining, and vehicle chartering activities. In addition, it owns or leases real estate properties; and trades in materials and chemical goods. The company was founded in 1982 and is based in Jakarta, Indonesia. PT Jaya Konstruksi Manggala Pratama Tbk is a subsidiary of PT Pembangunan Jaya Ancol Tbk.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "KIJA.JK": {
        "short_name": "Kawasan Industri Jababeka Tbk.",
        "long_name": "PT Kawasan Industri Jababeka Tbk",
        "summary": "PT Kawasan Industri Jababeka Tbk engages in the real estate development activities in Indonesia and the Netherlands. It operates through Real Estate, Golf, Service and Maintenance, Power Plant, and Tourism segments. The Real Estate segment develops and sells industrial estates, and related facilities and services, including residential estates, apartments, office buildings, and shopping centers; and develops and installs water treatment plant, waste water treatment, telephone, electricity, and other facilities to support the industrial estates, such as sports and recreational facilities. It also exports and imports goods for businesses related to the development and management of the industrial estates. The Golf segment develops and manages golf course, club house, recreation, and sports facilities, as well as supporting facilities. The Service and Maintenance segment engages in the development and infrastructure management of industrial estates, hotels, and residential estates; and development and management of public infrastructure. The Power Plant segment develops and manages power plants; supplies and distributes energy; and provides energy management services to third parties. The Tourism segment is involved in the tourism object, tourism hotel, tourism estate, and education and tourism training center activities. The company also generates and distributes electricity; and provides residential condominium, financing, general trading, transportation, building management, real estate construction, and other services. PT Kawasan Industri Jababeka Tbk was founded in 1989 and is headquartered in Bekasi, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Bekasi"
    },
    "KINO.JK": {
        "short_name": "Kino Indonesia Tbk.",
        "long_name": "PT Kino Indonesia Tbk",
        "summary": "PT Kino Indonesia Tbk manufactures and markets personal care products, beverages, foods, and pharmaceutical products in Indonesia and internationally. The company offers various personal care products, including haircare products under the Ellips, Sasha, and Samantha; skin care products under the Ovale brand; fragrances under the Eskulin brand; feminine hygiene products under the Resik V and Absolute brand names; kids personal care products under the B&B Kids, Eskulin Kids, and Master Kids brands; baby care products under the Sleek Baby brand; men's grooming products under the Master brand; toiletries under Sasha brand; air freshener under the Evergreen brand; beauty product under the Ristra and trustee brand name; and decorative under the Abstract brand. It also provides various beverages, such as remedy drinks under the Cap Kaki Tiga and Sejuk Segar brand; herbal drinks under the Cap Panda brand name; energy drinks under the Panther brand; and juice under the Malee brand name. In addition, the company offers food and confectionary products comprising candies under the Kino Candy and Chew Chew Ball brand names; snacks under the Snack It brand; and powdered drink under the Segar Sari brand. Further, it provides pharmaceutical products, such as balm, headache medicine, and honey cough syrup under the Cap Kaki Tiga brand; and herbal products under the Dua Putri Dewi brand, as well as pet products ProBalance brand. The company was formerly known as PT Kinocare Era Kosmetindo. The company was founded in 1999 and is headquartered in Tangerang, Indonesia. PT Kino Indonesia Tbk is a subsidiary of PT Kino Investindo.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "LFU2.F": {
        "short_name": "BAKRIE + BRO.  RP 50000",
        "long_name": "PT Bakrie & Brothers Tbk",
        "summary": "PT Bakrie & Brothers Tbk, through its subsidiaries, engages in general trading, construction, agriculture, coal mining, telecommunication, and oil and gas businesses in Indonesia and internationally. The company operates through two segments, Infrastructure and Manufacturing; and Trading, Services, and Investment. It offers automotive components for vehicles and heavy duty equipment; building materials, such as fiber cement roofing, ceiling, conduit pipes for general use; steel pipes for use in oil and gas, and general purposes; and fabrication services. The company also engages in the trading, distribution, and construction of building products, including gypsum, roofing, and autoclaved aerated concrete products, as well as electrical lightings and prefab bathrooms; the development of infrastructure assets; and steel construction, investment, laboratory, oil and gas trading, management consultation, and energy and electrical power businesses. In addition, it provides non-organic fertilizers and industries-organic chlor chemicals; and trades in ammonium nitrate and olein. Further, the company offers information technology, telecommunication, integration system, and multimedia and network services. PT Bakrie & Brothers Tbk was founded in 1942 and is headquartered in South Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    }
}