{
    "ADMF.JK": {
        "short_name": "Adira Dinamika Multi Finance Tb",
        "long_name": "PT Adira Dinamika Multi Finance Tbk",
        "summary": "PT Adira Dinamika Multi Finance Tbk provides consumer financing, murabahah financing, and finance leasing services in Indonesia. The company offers financing for new and used cars and motorcycles, as well as durable goods and other products. The company was founded in 1990 and is based in South Jakarta, Indonesia. PT Adira Dinamika Multi Finance Tbk is a subsidiary of PT Bank Danamon Indonesia Tbk.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "BBLD.JK": {
        "short_name": "Buana Finance Tbk.",
        "long_name": "PT Buana Finance Tbk.",
        "summary": "PT Buana Finance Tbk. provides investment, working capital, and multipurpose financing services in Indonesia. The company operates through Lease Financing Receivables and Consumer Financing Receivables segments. It offers financing services for various products, including heavy equipment, such as excavators, wheel loaders, tractors, and heavy trucks; generator and forklifts; printing and industrial machineries; consumer cars and commercial vehicles (trucks); vessels; Hajj/Umrah; education; tour traveling/ vacation; and others. The company also provides working capital financing, which include sale and leaseback, and factoring; multipurpose financing comprising finance lease and installment finance; and investment financing that cover financing facilities for procurement of capital goods, as well as services to individuals, business entities, or legal entities for the modernization and expansion of businesses/investment. It serves customers through its network of 33 branches in Jabodetabek, Java, Sumatra, Bali, Kalimantan, Sulawesi, and Papua. The company was founded in 1982 and is headquartered in Jakarta, Indonesia. PT Buana Finance Tbk. is a subsidiary of PT Sari Dasa Karsa.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "BFIN.JK": {
        "short_name": "BFI Finance  Indonesia Tbk.",
        "long_name": "PT BFI Finance Indonesia Tbk",
        "summary": "PT BFI Finance Indonesia Tbk engages in the finance leasing and consumer financing activities. It offers financing for the purchase of new and used four-wheel vehicles from dealer/showroom/individual; purchase of properties for personal or business use; and investment financing facility to finance various new and used capital goods, such as heavy equipment, trucks, digital printing and printing machines, industrial machinery, and medical devices, as well as working capital financing in sale and leaseback mechanism. The company also provides financing for the procurement of goods and services for consumptive or productive needs; and Sharia financing services. As of December 31, 2019, it operated 232 branches, 191 kiosks, and 45 Sharia branches in Indonesia. The company was formerly known as PT Bunas Finance Indonesia Tbk and changed its name to PT BFI Finance Indonesia Tbk in June 2001. PT BFI Finance Indonesia Tbk was founded in 1982 and is based in Tangerang Selatan, Indonesia.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang Selatan"
    },
    "BPFI.JK": {
        "short_name": "Batavia Prosperindo Finance Tbk",
        "long_name": "PT Batavia Prosperindo Finance Tbk",
        "summary": "PT Batavia Prosperindo Finance Tbk provides finance leasing, consumer financing, and factoring services in Indonesia. As of December 31, 2018, it had 66 branch offices and 2 representative offices. The company was formerly known as PT Bira Multi Finance and changed its name to PT Batavia Prosperindo Finance Tbk in March 2007. PT Batavia Prosperindo Finance Tbk was founded in 1994 and is headquartered in Jakarta, Indonesia. PT Batavia Prosperindo Finance Tbk is a subsidiary of Malacca Trust Pte. Ltd.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "CFIN.JK": {
        "short_name": "Clipan Finance Indonesia Tbk.",
        "long_name": "PT. Clipan Finance Indonesia Tbk",
        "summary": "PT. Clipan Finance Indonesia Tbk provides financial leasing, consumer financing, and factoring services. The company's products include used car financing; new or used house, shophouse, home office, and condominium/apartment financing; heavy equipment financing; and financing for marriage, home renovation, travel, religious travel, education, and other purposes. The company serves customers through 45 branch offices and 76 marketing offices in Indonesia. PT. Clipan Finance Indonesia Tbk was founded in 1982 and is headquartered in Jakarta, Indonesia. PT. Clipan Finance Indonesia Tbk is a subsidiary of PT Bank Pan Indonesia Tbk.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "HDFA.JK": {
        "short_name": "Radana Bhaskara Finance Tbk.",
        "long_name": "PT Radana Bhaskara Finance Tbk",
        "summary": "PT Radana Bhaskara Finance Tbk primarily engages in consumer financing activities in Indonesia. The company provides financing services for new and second-hand motor vehicles. As of December 31, 2019, it operated 41 branch offices located in Jakarta, Bogor, Depok, Tangerang and Bekasi, West Java, Central Java, East Java, North Sumatera, Riau, and South Sumatera. The company was formerly known as PT HD Finance Tbk and changed its name to PT Radana Bhaskara Finance Tbk in June 2014. The company was founded in 1972 and is headquartered in Jakarta, Indonesia. As of November 25, 2019, PT Radana Bhaskara Finance Tbk operates as a prior subsidiary of PT Tiara Marga Trakindo.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "IBFN.JK": {
        "short_name": "Intan Baruprana Finance Tbk.",
        "long_name": "PT Intan Baruprana Finance Tbk",
        "summary": "PT Intan Baruprana Finance Tbk operates as a finance company in Indonesia. The company provides finance leasing, consumer financing, and factoring services. It offers financing for new and second-hand capital goods, including heavy equipment, transport equipment and commercial vehicles, shipping equipment, industrial machines, medical equipment, and other supporting facilities. The company also engages in the sale and leaseback financing activities. It provides financing to plantation, infrastructure, mining, transportation, gas and oil, forestry, aquaculture, health, hospitality, and other sectors. The company was founded in 1991 and is headquartered in Jakarta, Indonesia. PT Intan Baruprana Finance Tbk is a subsidiary of PT Intraco Penta Tbk.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "MFIN.JK": {
        "short_name": "Mandala Multifinance Tbk.",
        "long_name": "Pt Mandala Multifinance Tbk",
        "summary": "PT Mandala Multifinance Tbk engages in consumer financing activities in Java, Sumatera, Sulawesi, and Kalimantan in Indonesia. It offers motorcycle financing services based on conventional and sharia financing, as well as electronic and furniture, and car financing services. The company was formerly known as PT Gracia Dinamika Multifinance and changed its name to PT Mandala Multifinance Tbk in March 1997. The company was founded in 1983 and is based in Jakarta Pusat, Indonesia. PT Mandala Multifinance Tbk is a subsidiary of PT Jayamandiri Gemasejati.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Pusat"
    },
    "TIFA.JK": {
        "short_name": "KDB Tifa Finance Tbk.",
        "long_name": "PT KDB Tifa Finance Tbk",
        "summary": "PT KDB Tifa Finance Tbk engages in the investment financing, working capital financing, and multipurpose financing businesses in Indonesia. It operates in four segments: Finance Lease, Multipurpose Financing, Factoring, and Operating Lease. It also offers sharia financing. The company was formerly known as PT Tifa Finance Tbk and changed its name to PT KDB Tifa Finance Tbk in September 2020. PT KDB Tifa Finance Tbk was founded in 1989 and is headquartered in Jakarta Selatan, Indonesia. As of September 8, 2020, PT KDB Tifa Finance Tbk operates as a subsidiary of Korea Development Bank.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "VRNA.JK": {
        "short_name": "Verena Multi Finance Tbk.",
        "long_name": "PT. Verena Multi Finance Tbk",
        "summary": "PT. Verena Multi Finance Tbk provides consumer finance and leasing services to individuals and financial institutions in Indonesia. The company offers financing for new and used cars; and investment, working capital, and multifunction financing services, as well as financial leasing for heavy equipment and machines. It operates through 20 branches in Bandung, Bekasi, Bogor, Cikarang, Jakarta, Makasar, Malang, Medan, Palembang, Pekanbaru, Rantau Prapat, Semarang, Serang, Surabaya, and Tangerang cities. The company was formerly known as PT. Verena Oto Finance Tbk and changed its name to PT. Verena Multi Finance Tbk in January 2011. PT. Verena Multi Finance Tbk was founded in 1993 and is headquartered in Central Jakarta, Indonesia. PT. Verena Multi Finance Tbk is a subsidiary of PT Bank Pan Indonesia Tbk.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Pusat"
    },
    "WOMF.JK": {
        "short_name": "Wahana Ottomitra Multiartha Tbk",
        "long_name": "PT Wahana Ottomitra Multiartha Tbk",
        "summary": "PT Wahana Ottomitra Multiartha Tbk, together with its subsidiaries, engages in consumer financing activities in Indonesia. It operates through two segments, Multipurpose Financing of Goods and Multipurpose Financing Services. The company offers investment financing and working capital financing services, such as finance lease, sale and leaseback, factoring, project financing, and infrastructure financing, as well as purchase payment by installments and other financing services. It also provides financing services for new and used two-wheeled and four-wheeled motor vehicles. The company was formerly known as PT Wahana Ometraco Multi Artha and changed its name to PT Wahana Ottomitra Multiartha Tbk in March 2000. The company was founded in 1982 and is headquartered in Jakarta Utara, Indonesia. PT Wahana Ottomitra Multiartha Tbk is a subsidiary of PT Bank Maybank Indonesia Tbk.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Utara"
    }
}