{
    "DVLA.JK": {
        "short_name": "Darya-Varia Laboratoria Tbk.",
        "long_name": "PT Darya-Varia Laboratoria Tbk",
        "summary": "PT Darya-Varia Laboratoria Tbk engages in the manufacture and trading of pharmaceutical products and cosmetics in Indonesia and internationally. It operates in three segments: Prescription Drugs, Consumer Health Products, and Export and Toll Manufacturing Services. It provides various prescription and consumer health products in antibiotic, antiparasit, antiseptic, anti-fungal, cough and cold, cardiology, central nervous system, gastro-hepatology, somatic, vitamin and food supplement, women healthcare, ear healthcare, and derma medic areas. The company was founded in 1976 and is headquartered in Jakarta, Indonesia. PT Darya-Varia Laboratoria Tbk is a subsidiary of Blue Sphere Singapore Pte. Ltd.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "HQP.SG": {
        "short_name": "KIMIA FARMA TBK",
        "long_name": "PT Kimia Farma (Persero) Tbk",
        "summary": "PT Kimia Farma (Persero) Tbk produces and sells medicines, herbal medicines, iodine, salts, quinine and their derivative products, and vegetable oils in Indonesia, rest of Asia, Europe, Australia, Africa, and New Zealand. The company operates through Manufacture, Distribution, Retail, and Other Services segments. It also manufactures and markets chemical, betalactam and non betalactam, antiretroviral, narcotic, hormone contraceptive, powder, oil castor, edible oil, cosmetic, over the counter, personal, and beauty care products, as well as food supplements, active pharmaceutical ingredients, and medical devices. In addition, the company manufactures, markets, distributes, and trades in pharmaceutical products; and operates drug materials plants. As of December 31, 2019, it operated 1,279 retail pharmacy outlets under the Kimia Farma Pharmacy brand, 565 health clinic outlets, 64 clinical laboratories, 10 optics, and 3 beauty clinics. The company sells its products to pharmacies, drug stores, hospitals, and free traders through pharmaceutical wholesalers and logistics warehouses. The company was founded in 1817 and is headquartered in Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "IGEX": {
        "short_name": "INDO GLOBAL EXCHANGES PTE LTD",
        "long_name": "Indo Global Exchange(s) PTE, Ltd.",
        "summary": "Indo Global Exchange(s) Pte, Ltd. focuses on providing financial market access to customers worldwide. Its platform provides financial market access to approximately 30 equity exchanges for trading in securities and contract for differences. The company is based in Jakarta, Indonesia.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "INAF.JK": {
        "short_name": "Indofarma Tbk.",
        "long_name": "PT Indofarma (Persero) Tbk",
        "summary": "PT Indofarma (Persero) Tbk, together with its subsidiaries, manufactures and markets pharmaceutical products in Indonesia. It manufactures, trades in, and distributes medicine and medical devices; and operates laboratory. The company also exports its products. PT Indofarma (Persero) Tbk was founded in 1918 and is headquartered in Bekasi, Indonesia. PT Indofarma (Persero) Tbk is a subsidiary of PT. Bio Farma.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Bekasi"
    },
    "KAEF.JK": {
        "short_name": "Kimia Farma Tbk.",
        "long_name": "PT Kimia Farma (Persero) Tbk",
        "summary": "PT Kimia Farma (Persero) Tbk produces and sells medicines, herbal medicines, iodine, salts, quinine and their derivative products, and vegetable oils in Indonesia, rest of Asia, Europe, Australia, Africa, and New Zealand. The company operates through Manufacture, Distribution, Retail, and Other Services segments. It also manufactures and markets chemical, betalactam and non betalactam, antiretroviral, narcotic, hormone contraceptive, powder, oil castor, edible oil, cosmetic, over the counter, personal, and beauty care products, as well as food supplements, active pharmaceutical ingredients, and medical devices. In addition, the company manufactures, markets, distributes, and trades in pharmaceutical products; and operates drug materials plants. As of December 31, 2019, it operated 1,279 retail pharmacy outlets under the Kimia Farma Pharmacy brand, 565 health clinic outlets, 64 clinical laboratories, 10 optics, and 3 beauty clinics. The company sells its products to pharmacies, drug stores, hospitals, and free traders through pharmaceutical wholesalers and logistics warehouses. The company was founded in 1817 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "MERK.JK": {
        "short_name": "Merck Tbk.",
        "long_name": "PT Merck Tbk",
        "summary": "PT Merck Tbk manufactures and sells pharmaceutical products in Indonesia. It operates through three segments: Biopharma, Consumer Health, and Others. The company operates in the healthcare, life science, and performance materials sectors. It offers health care products in the areas of allergies, endocrinology, fertility, general medicine, neuro degenerative diseases, and oncology. The company also engages in discovery, development, manufacturing, and diagnostics of drugs. In addition, it offers liquid crystals and OLED materials for displays, materials for integrated circuits, pigments for coatings or colour cosmetics, and functional materials for energy solutions. The company was formerly known as PT Merck Indonesia Tbk and changed its name to PT Merck Tbk in June 2002. The company was founded in 1970 and is headquartered in East Jakarta, Indonesia. PT Merck Tbk is a subsidiary of Merck Holding GmbH.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Timur"
    },
    "PEHA.JK": {
        "short_name": "Phapros Tbk.",
        "long_name": "PT Phapros, Tbk",
        "summary": "PT Phapros, Tbk operates in the pharmaceutical and health care industry in Indonesia. The company operates through Over the Counter (OTC), Ethical, Generic Drugs Bearing, and Toll Manufacturing segments. It offers OTC drugs, including Antimo Anak, Livron B Plek, Noza, Hemorogard, Bioron, and others. The company also provides generic drug products for government institutions and hospitals, as well as produces drugs for other pharmaceutical industries; and offers medical devices. PT Phapros, Tbk also exports its products internationally. The company was founded in 1954 and is headquartered in Jakarta, Indonesia. PT Phapros, Tbk operates as a subsidiary of PT Kimia Farma (Persero) Tbk.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "PEXXF": {
        "short_name": "TEMPO SCAN PACIFIC",
        "long_name": "PT Tempo Scan Pacific Tbk",
        "summary": "PT Tempo Scan Pacific Tbk engages in the pharmaceuticals, personal care and cosmetics, and distribution services businesses in Indonesia and internationally. It operates through three segments: Pharmaceuticals, Consumer Products and Cosmetics, and Distribution Services. The company is involved in the construction and rental of buildings; provision of warehousing, freight forwarding, advertising and promotion, research and development, computer systems, and distribution and marketing services; medical devices trading; and manufacture of food supplements, food and beverages, and plastic packaging, as well as consumer products, soaps, and household products. It sells its products under Bodrex, Vidoran, Hemaviton, Oskadon, Bodrexin, Neo rheumacyl, Oskadryl, Contrexyn, Zevit Grow, Wybert, Vitonal, Polaris, and Vitamin IPI brands. The company was formerly known as PT Scanchemie. PT Tempo Scan Pacific Tbk was founded in 1970 and is headquartered in Jakarta, Indonesia. PT Tempo Scan Pacific Tbk is a subsidiary of PT Bogamulia Nagadi.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "PYFA.JK": {
        "short_name": "Pyridam Farma Tbk",
        "long_name": "PT Pyridam Farma Tbk",
        "summary": "PT Pyridam Farma Tbk develops, produces, and sells pharmaceuticals, vitamins, supplements, and traditional herbal care products in Indonesia. The company operates in two segments, Pharmaceutical Products and Toll Manufacturing Services, and Medical Equipments. It offers analgesic, antipiretic, anti anemic, anti fungal, anti hypertension, anti parkinsonism, anti rheumatics, anti inflammatory, anti tuberculotic, anti ulcerant and antasida, antibiotic, anticoagulant, anti platelet, fibrinolytic, anticonvulsant, antihistamine, antipsychotic, calcium w/vitamin, central muscle relaxant, cholesterol lowering, and cough and cold remedy products. The company also provides genito-urinary system, eye preparation, hematology, hepatoprotector, immunomodulator, multivitamin and mineral, neurological, nootropic and neurotonic, oral antidiabetics and corticosteroid, peripheral vasodilator and cerebral activator, supplement and adjuvant therapy, anti infective, anti virus, beta-adrenergic agonist bronchodilator, diuretic, hyperuricemia, and gout products, as well as antiemetic and GIT regulators. In addition, it trades in medical equipment. The company was founded in 1976 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "PYZA.SG": {
        "short_name": "PT Tempo Scan Pacific Registere",
        "long_name": "PT Tempo Scan Pacific Tbk",
        "summary": "PT Tempo Scan Pacific Tbk engages in the pharmaceuticals, personal care and cosmetics, and distribution services businesses in Indonesia and internationally. It operates through three segments: Pharmaceuticals, Consumer Products and Cosmetics, and Distribution Services. The company is involved in the construction and rental of buildings; provision of warehousing, freight forwarding, advertising and promotion, research and development, computer systems, and distribution and marketing services; medical devices trading; and manufacture of food supplements, food and beverages, and plastic packaging, as well as consumer products, soaps, and household products. It sells its products under Bodrex, Vidoran, Hemaviton, Oskadon, Bodrexin, Neo rheumacyl, Oskadryl, Contrexyn, Zevit Grow, Wybert, Vitonal, Polaris, and Vitamin IPI brands. The company was formerly known as PT Scanchemie. PT Tempo Scan Pacific Tbk was founded in 1970 and is headquartered in Jakarta, Indonesia. PT Tempo Scan Pacific Tbk is a subsidiary of PT Bogamulia Nagadi.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "SIDO.JK": {
        "short_name": "Industri Jamu dan Farmasi Sido ",
        "long_name": "PT Industri Jamu dan Farmasi Sido Muncul Tbk",
        "summary": "PT Industri Jamu dan Farmasi Sido Muncul Tbk provides herbal medicines, cosmetics, and foods and beverages related to health in Indonesia and internationally. The company produces various medicines consisting of ethical products, OTC products, food supplements, and medical herbs. Its products include Anacetine, a medicine to reduce fever; Combicitrine, a medicine for bacteries/worms removal; Berlosid, a medicine for gastric pains; Anabion multivitamins for children; Suprabion multivitamins for adults; and Telon Oil. The company also manufactures herbal extracts, as well as offers confectionary products, energy and health drinks, and other products. In addition, it is involved in commerce and land transportation activities. The company was founded in 1940 and is headquartered in Semarang, Indonesia. PT Industri Jamu dan Farmasi Sido Muncul Tbk is a subsidiary of PT Hotel Candi Baru.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Semarang"
    },
    "TSPC.JK": {
        "short_name": "Tempo Scan Pacific Tbk.",
        "long_name": "PT Tempo Scan Pacific Tbk",
        "summary": "PT Tempo Scan Pacific Tbk engages in the pharmaceuticals, personal care and cosmetics, and distribution services businesses in Indonesia and internationally. It operates through three segments: Pharmaceuticals, Consumer Products and Cosmetics, and Distribution Services. The company is involved in the construction and rental of buildings; provision of warehousing, freight forwarding, advertising and promotion, research and development, computer systems, and distribution and marketing services; medical devices trading; and manufacture of food supplements, food and beverages, and plastic packaging, as well as consumer products, soaps, and household products. It sells its products under Bodrex, Vidoran, Hemaviton, Oskadon, Bodrexin, Neo rheumacyl, Oskadryl, Contrexyn, Zevit Grow, Wybert, Vitonal, Polaris, and Vitamin IPI brands. The company was formerly known as PT Scanchemie. PT Tempo Scan Pacific Tbk was founded in 1970 and is headquartered in Jakarta, Indonesia. PT Tempo Scan Pacific Tbk is a subsidiary of PT Bogamulia Nagadi.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    }
}