{
    "KLBF.JK": {
        "short_name": "Kalbe Farma Tbk.",
        "long_name": "PT Kalbe Farma Tbk.",
        "summary": "PT Kalbe Farma Tbk., together with its subsidiaries, develops, manufactures, and trades in pharmaceutical products in Indonesia. It operates in four divisions: Prescription Pharmaceuticals, Consumer Health, Nutritionals, and Distribution and Logistic. The company offers generic, branded, and licensed drugs, including Brainact, Cefspan, Mycoral, Cernevit, Cravit, Neuralgin, Broadced, Neurotam, Hemapo, and CPG that are distributed to hospitals, pharmacies, and drug stores. It also provides over-the-counter drugs; energy drinks, ready-to-drink products, supplements, and other preventive products; and nutritional products for infants, toddlers, children, pre-teenagers, adults, pregnant and lactating women, and elders, as well as for consumers with special medical needs. In addition, the company operates Mitrasana Clinics, a health care service; contract services, including clinical study management, bioavailability/bioequivalence studies, and contract analysis to pharmaceutical companies; and animal health products. Further, it offers health screening services; operates as an agent and representative for biotechnology products; distributes consumer products, medical equipment, cosmetics, and other trading products; and trades in medical and laboratory equipment and supplies, raw materials for pharmaceutical products, and consumable products for hemodialysis therapy, as well as provides advertising services. The company was incorporated in 1966 and is headquartered in Jakarta, Indonesia. PT Kalbe Farma Tbk. is a subsidiary of PT Gira Sole Prima.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10510",
        "website": "http://www.kalbe.co.id",
        "market_cap": "Mid Cap"
    },
    "PTKFF": {
        "short_name": "KALBE FARMA",
        "long_name": "PT Kalbe Farma Tbk.",
        "summary": "PT Kalbe Farma Tbk., together with its subsidiaries, develops, manufactures, and trades in pharmaceutical products in Indonesia. It operates in four division: Prescription Pharmaceutical, Consumer Health, Nutritionals, and Distribution and Logistic. The company offers generic, branded, and licensed drugs, including Brainact, Cefspan, Mycoral, Cernevit, Cravit, Neuralgin, Broadced, Neurotam, Hemapo, and CPG that are distributed to hospitals, pharmacies, and drug stores. It also provides over-the-counter drugs; energy drinks, ready-to-drink products, supplements, and other preventive products; and nutritional products for infants, toddlers, children, pre-teenagers, adults, pregnant and lactating women, and elders, as well as for consumers with special medical needs. In addition, the company operates Mitrasana Clinics, a health care service; contract services, including clinical study management, bioavailability/bioequivalence studies, and contract analysis to pharmaceutical companies; and animal health products. Further, it offers health screening services; operates as an agent and representative for biotechnology products; distributes consumer products, medical equipment, cosmetics, and other trading products; and trades in medical and laboratory equipment and supplies, raw materials for pharmaceutical products, and consumable products for hemodialysis therapy, as well as provides advertising services. The company was founded in 1966 and is headquartered in Jakarta, Indonesia. PT Kalbe Farma Tbk. is a subsidiary of PT Gira Sole Prima.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10510",
        "website": "http://www.kalbe.co.id",
        "market_cap": "Mid Cap"
    },
    "PTKFY": {
        "short_name": "KALBE FARMA",
        "long_name": "PT Kalbe Farma Tbk.",
        "summary": "PT Kalbe Farma Tbk., together with its subsidiaries, develops, manufactures, and trades in pharmaceutical products in Indonesia. It operates in four division: Prescription Pharmaceutical, Consumer Health, Nutritionals, and Distribution and Logistic. The company offers generic, branded, and licensed drugs, including Brainact, Cefspan, Mycoral, Cernevit, Cravit, Neuralgin, Broadced, Neurotam, Hemapo, and CPG that are distributed to hospitals, pharmacies, and drug stores. It also provides over-the-counter drugs; energy drinks, ready-to-drink products, supplements, and other preventive products; and nutritional products for infants, toddlers, children, pre-teenagers, adults, pregnant and lactating women, and elders, as well as for consumers with special medical needs. In addition, the company operates Mitrasana Clinics, a health care service; contract services, including clinical study management, bioavailability/bioequivalence studies, and contract analysis to pharmaceutical companies; and animal health products. Further, it offers health screening services; operates as an agent and representative for biotechnology products; distributes consumer products, medical equipment, cosmetics, and other trading products; and trades in medical and laboratory equipment and supplies, raw materials for pharmaceutical products, and consumable products for hemodialysis therapy, as well as provides advertising services. The company was founded in 1966 and is headquartered in Jakarta, Indonesia. PT Kalbe Farma Tbk. is a subsidiary of PT Gira Sole Prima.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10510",
        "website": "http://www.kalbe.co.id",
        "market_cap": "Mid Cap"
    }
}