{
    "BLUE.JK": {
        "short_name": "Berkah Prima Perkasa Tbk.",
        "long_name": "PT Berkah Prima Perkasa Tbk",
        "summary": "PT Berkah Prima Perkasa Tbk engages in trading and printing businesses in Indonesia. PT Berkah Prima Perkasa Tbk was founded in 2014 and is based in North Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Utara",
        "zipcode": null,
        "website": "http://www.blueprint-indonesia.com",
        "market_cap": "Small Cap"
    },
    "GLVA.JK": {
        "short_name": "Galva Technologies Tbk.",
        "long_name": "PT Galva Technologies Tbk",
        "summary": "PT Galva Technologies Tbk supplies electronic products in Indonesia. The company operates through Business Solutions, IT Distribution, and Printing Solutions segments. It primarily sells computers, printers, displays, and audio-video equipment. The company also sells broadcasting products, audio visual and media products, PA and communication products, professional audio and lighting products, digital signage products, security systems, projectors, and accessories. In addition, it offers system integration, design, installation, integration, maintenance, and engineering support services; and a range of hardware and business process solutions, including scanning, archiving, document management, and managed print services, as well as distributes software. The company was founded in 1991 and is based in Jakarta Pusat, Indonesia. PT Galva Technologies Tbk is a subsidiary of PT Elsiscom Prima Karya.",
        "currency": "IDR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10120",
        "website": "http://www.gtc.co.id",
        "market_cap": "Small Cap"
    },
    "LMAS.JK": {
        "short_name": "Limas Indonesia Makmur Tbk",
        "long_name": "PT Limas Indonesia Makmur Tbk",
        "summary": "PT Limas Indonesia Makmur Tbk provides stock information and news services, and value added telephone services primarily in Indonesia. It is also involved in the trading of hardware and software; and provision of supporting facility and information technology consultancy services. The company was formerly known as PT Limas Centric Indonesia Tbk and changed its name to PT Limas Indonesia Makmur Tbk in August 2014. PT Limas Indonesia Makmur Tbk was founded in 1996 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12190",
        "website": "http://www.limas.com",
        "market_cap": "Small Cap"
    },
    "MTDL.JK": {
        "short_name": "Metrodata Electronics Tbk.",
        "long_name": "PT Metrodata Electronics Tbk",
        "summary": "P.T. Metrodata Electronics Tbk, together with its subsidiaries, engages in the information communication and technology (ICT) business in Indonesia and internationally. The company's Distribution division sells hardware and software, and basic peripherals, such as data storage devices, terminals, memory, and peripherals. Its Solution division provides maintenance services; sells hardware, system management software, middleware, serverware, and system level software; and rents hardware and software products. The company's Consultation division provides professional services for consultation, implementation, and training; and sells software products. The company also offers business transformation solutions; assembly services in the computer field or wireless communication equipment area; and system integration services, as well as distributes information technology products and personal computer products. P.T. Metrodata Electronics Tbk was founded in 1983 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "11470",
        "website": "http://www.metrodata.co.id",
        "market_cap": "Small Cap"
    },
    "SLIS.JK": {
        "short_name": "Gaya Abadi Sempurna Tbk.",
        "long_name": "PT Gaya Abadi Sempurna Tbk",
        "summary": "PT Gaya Abadi Sempurna Tbk develops and trades in electric vehicles and electronic products in Indonesia. It offers electric bicycles and motors, and MTB electric bicycles; and fans and LED light products. The company was founded in 1996 and is headquartered in Tangerang, Indonesia. PT Gaya Abadi Sempurna Tbk is a subsidiary of PT Selis Investama Indonesia.",
        "currency": "IDR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang",
        "zipcode": null,
        "website": "http://www.gaya-slis.com",
        "market_cap": "Small Cap"
    }
}