{
    "CASA.JK": {
        "short_name": "Capital Financial Indonesia Tbk",
        "long_name": "PT Capital Financial Indonesia Tbk",
        "summary": "PT Capital Financial Indonesia Tbk, together with its subsidiaries, engages in financial services and investment business in Indonesia. It offers management consulting, asset management, life and sharia life insurance, and Fintech peer-to-peer lending services, as well as engages in venture capital activities. The company was founded in 2009 and is based in Jakarta, Indonesia. PT Capital Financial Indonesia Tbk is a subsidiary of PT Capital Strategic Invesco.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12920",
        "website": "http://www.capitalfinancial.co.id",
        "full_time_employees": 986
    },
    "SMMA.JK": {
        "short_name": "Sinarmas Multiartha Tbk.",
        "long_name": "PT Sinar Mas Multiartha Tbk",
        "summary": "PT Sinar Mas Multiartha Tbk provides various financial services to individual and corporate clients in Indonesia. The company's services include banking, insurance, financing, capital markets, asset management, share administration, security, and information technology. It offers savings accounts; call, time, and demand deposits; foreign exchange; mutual funds; bancassurance; corporate and personal credit cards; bank guarantee; loan products, including micro, working capital, investment, non-collateral, agricultural, and multi-purpose loan; supply chain financing; consumer financing; import and export bill; telegraphic transfer; and mobile and internet banking, as well as automatic teller machine, safe deposit box, payroll, and money transfer services. The company also provides life and general insurance, insurance agency, securities and share registry, asset management, commodity trading, factoring, leasing, investment financing, and fund management services. In addition, it is involved in trading and service, auction house, property, clinic, and workshop activities. The company was formerly known as PT Internas Artha Finance Company and changed its name to PT Sinar Mas Multiartha Tbk in February 1995. The company was founded in 1982 and is headquartered in Jakarta, Indonesia. PT Sinar Mas Multiartha Tbk is a subsidiary of PT Sinar Mas Cakrawala.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10350",
        "website": "http://www.smma.co.id",
        "full_time_employees": 7354
    }
}