{
    "AMRT.JK": {
        "short_name": "Sumber Alfaria Trijaya Tbk.",
        "long_name": "PT Sumber Alfaria Trijaya Tbk",
        "summary": "PT Sumber Alfaria Trijaya Tbk engages in the retail distribution of consumer products in Indonesia. The company's stores offer food and non-food products. It also provides transportation and freight forwarding services; and operates a pharmacy, as well as engages in the retail distribution of cosmetics. PT Sumber Alfaria Trijaya Tbk sells its products through 17,538 stores under the Alfamart, Alfamidi, Lawson, and Dan+Dan names, as well as through the internet. The company was founded in 1989 and is headquartered in Tangerang, Indonesia. PT Sumber Alfaria Trijaya Tbk is a subsidiary of PT Sigmantara Alfindo.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang",
        "zipcode": "15143",
        "website": "http://alfamart.co.id",
        "market_cap": "Mid Cap"
    },
    "RANC.JK": {
        "short_name": "Supra Boga Lestari Tbk.",
        "long_name": "PT Supra Boga Lestari Tbk",
        "summary": "PT Supra Boga Lestari Tbk operates supermarkets in Indonesia. Its supermarkets offer meat, poultry, seafood, fruits, and vegetables, as well as other specialty products. The company operates its supermarket under the Ranch Market and Farmers Market names. It operates 48 stores consisting of 16 Ranch Markets, 29 Farmers Markets, 1 The Gourmet by Ranch Market, and 2 Day2Day by Farmers Market located in various cities in Jakarta, Jabodetabek, Surabaya, Malang, Balikpapan, Samarinda, Pekanbaru, Ambon, Dumai, and Palembang. The company was founded in 1997 and is based in West Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "West Jakarta",
        "zipcode": "11610",
        "website": "http://www.ranchmarket.co.id",
        "market_cap": "Micro Cap"
    }
}