{
    "ATIC.JK": {
        "short_name": "Anabatic Technologies Tbk.",
        "long_name": "PT Anabatic Technologies Tbk",
        "summary": "PT Anabatic Technologies Tbk, through its subsidiaries, provides mission critical digital solution, digital outsourcing, cloud and digital platform partner, and property services in Indonesia. It offers mission critical solutions that cover end to end application, including hardware and software implementation, customization, and routine maintenance, as well as IT security solutions. The company also provides business process outsourcing services related to human resources, such as talent acquisition, on boarding and development, and employee administration and retention; customer experience comprising strategy, campaign, data, and analytics; and technology and value-added services consisting of human resources information systems, customer experience systems, and facilities. In addition, it offers IT infrastructure solutions that comprise high-end servers, storage, enterprise software, networks, and security for B2B customers. Further, the company engages in the trading and service, integrity system, building management, interior construction, Web design, office supplies and spare parts trading, multi dealer, computer and electronic trading, system integration, management consultation and software, money remittance, payment point online banking, and commodity trading activities. It serves banking, telecommunication, and pharmaceutical industries, as well as governments. The company was founded in 2001 and is headquartered in Tangerang, Indonesia. PT Anabatic Technologies Tbk is a subsidiary of PT Artha Investama Jaya.",
        "currency": "IDR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang",
        "zipcode": "15810",
        "website": "http://www.anabatic.com",
        "market_cap": "Small Cap"
    },
    "DCII.JK": {
        "short_name": "DCI Indonesia Tbk.",
        "long_name": "PT DCI Indonesia Tbk",
        "summary": "PT DCI Indonesia Tbk provides cloud and carrier neutral data center infrastructure services in Indonesia. It offers dedicated and shared space colocation services; cross connect services; Flexspace, which offers units of working space services; onsite technical support services; CloudConnect, an interconnection for enterprises; and DCI Internet Exchange. The company was founded in 2011 and is based in Jakarta, Indonesia. PT DCI Indonesia Tbk is a subsidiary of DCI International Holding Pte. Ltd.",
        "currency": "IDR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12190",
        "website": "http://www.dci-indonesia.com",
        "market_cap": null
    },
    "EDGE.JK": {
        "short_name": "Indointernet Tbk.",
        "long_name": "PT Indointernet Tbk.",
        "summary": "PT. Indointernet Tbk, a digital solutions company, provides information and communication technology infrastructure services in Indonesia. It offers connectivity, network managed, IT managed, data center, and cloud services. The company was founded in 1994 and is based in Tangerang Selatan, Indonesia.",
        "currency": "IDR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang Selatan",
        "zipcode": "15412",
        "website": "http://indonet.co.id",
        "market_cap": "Small Cap"
    },
    "MLPT.JK": {
        "short_name": "Multipolar Technology Tbk.",
        "long_name": "PT Multipolar Technology Tbk",
        "summary": "PT Multipolar Technology Tbk provides information technology (IT) consulting, system integration, and IT systems management services in Indonesia. The company offers IT strategy and planning services, such as digital transformation planning, IT operation and governance, independent validation and verification, IT PMO set up and operation assistance, data center consulting, and data governance; customer experience platform and services, including e-channel, mobility, communication system and collaboration, customer relationship management, and digital marketing; and digital insights solutions comprising big data and analytics, business performance intelligence, and artificial intelligence. It also provides banking, enterprise resource planning, smart office, enterprise project management, and field operation solutions; merchant IT and IT operation managed services; and blockchain, Internet of Things, OS and virtualization, database platform, services oriented architecture, container management, and application program interface management solutions. In addition, the company offers ICT infrastructure, colocation, data center managed, and cloud services, as well as disaster recovery as a service; and security solutions, and managed security service provider/security operation center. It serves financial, telecommunication, government, health care, manufacturing, oil and gas, and retail sectors. The company was founded in 1975 and is headquartered in Jakarta, Indonesia. PT Multipolar Technology Tbk is a subsidiary of PT Multipolar Tbk.",
        "currency": "IDR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12950",
        "website": "http://www.multipolar.com",
        "market_cap": "Small Cap"
    },
    "WIFI.JK": {
        "short_name": "Solusi Sinergi Digital Tbk.",
        "long_name": "PT Solusi Sinergi Digital Tbk",
        "summary": "PT Solusi Sinergi Digital Tbk engages in the network infrastructure, application and software, out of home advertising media, and digital advertising businesses. The company operates fiber optic infrastructure, point of presence infrastructure, and base transceiver station towers. It also provides mobile apps, software integration, and web applications; and integrated advertising media in out of home environment. The company was founded in 2014 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12430",
        "website": "http://surge.co.id",
        "market_cap": "Small Cap"
    }
}