{
    "BBRM.JK": {
        "short_name": "Pelayaran Nasional Bina Buana R",
        "long_name": "PT Pelayaran Nasional Bina Buana Raya Tbk",
        "summary": "PT Pelayaran Nasional Bina Buana Raya Tbk, a shipping agency company, provides marine logistics services in Indonesia. It operates in two segments, Tug and Barge Vessel; and Offshore Support Vessel. The company offers transportation services for various kinds of bulk mining material, such as coal, granite, and sand for transshipment or delivery via rivers and coastal routes. It operates 34 barges of various sizes and 35 tug boats, as well as one self-propelled barge vessel. The company also charters its vessels to oil and gas companies. The company was founded in 1998 and is headquartered in Central Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Central Jakarta"
    },
    "BESS.JK": {
        "short_name": "Batulicin Nusantara Maritim Tbk",
        "long_name": "PT Batulicin Nusantara Maritim Tbk",
        "summary": "PT Batulicin Nusantara Maritim Tbk provides sea and river transportation services in Indonesia. It transports goods from the company's tugs and barges to the mother vessel. The company was founded in 2011 and is based in Tanah Bumbu, Indonesia. PT Batulicin Nusantara Maritim Tbk is a subsidiary of PT Batulicin Enam Sembilan Transportasi.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tanah Bumbu"
    },
    "BLTA.JK": {
        "short_name": "Berlian Laju Tanker Tbk",
        "long_name": "PT Berlian Laju Tanker Tbk",
        "summary": "PT Berlian Laju Tanker Tbk provides shipping services for liquid cargo transportation in Malaysia and Indonesia. The company operates through Chemical Tankers, Gas Tankers, and Others segments. It operates chemical tankers that offer maritime transportation services for organic and non-organic liquid chemicals, and vegetable oil and animal fats; and gas tankers, which transport liquefied gas products, including LPG, propylene, propane, and LNG. The company also offers shipping agency, manning, ship management, and trading services. As of December 31, 2019, the company owned a fleet of six vessels. The company was founded in 1981 and is headquartered in Jakarta, Indonesia. PT Berlian Laju Tanker Tbk is a subsidiary of PT Bagusnusa Samudra Gemilang.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "BULL.JK": {
        "short_name": "Buana Lintas Lautan Tbk.",
        "long_name": "PT Buana Lintas Lautan Tbk",
        "summary": "PT Buana Lintas Lautan Tbk operates as a shipowner company in Indonesia. It operates through Gas Tankers; Oil, FPSO and FSO Tankers; Chemical Tankers; and Others segments. The company engages in the maritime transportation of liquefied gases, including liquefied petroleum gas, propylene, propane, and LNG; lubricating oils, crude oil, and petroleum products; and organic and non-organic liquid chemicals, vegetable oils, and animal fats. It also provides floating tanker facility services for production, storage, and off-loading of oil products; short, medium, and long-term chartering of vessels; and offshore storage services for oil and gas sector. In addition, the company offers shipping agency services, such as managements of permits and port facilities arrangement; and provision of supplies, including fuels, freshwater, spare-parts, repair services, and others. Further, it provides ship management services for oil and gas tankers, as well as for floating production storage and offloading (FPSO)/floating storage and offloading (FSO); and crew management services. The company was formerly known as PT Buana Listya Tama Tbk and changed its name to PT Buana Lintas Lautan Tbk in February 2018. PT Buana Lintas Lautan Tbk was founded in 2005 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "CANI.JK": {
        "short_name": "Capitol Nusantara Indonesia Tbk",
        "long_name": "PT Capitol Nusantara Indonesia Tbk",
        "summary": "PT Capitol Nusantara Indonesia Tbk engages in shipping, and the provision of shipping agency and transportation services in Indonesia. It is also involved in the shipping of oil and gas; and rental of vessels. The company was founded in 2004 and is headquartered in Samarinda, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Samarinda"
    },
    "HITS.JK": {
        "short_name": "Humpuss Intermoda Transportasi ",
        "long_name": "PT Humpuss Intermoda Transportasi Tbk.",
        "summary": "PT Humpuss Intermoda Transportasi Tbk., together with its subsidiaries, engages in the sea transportation and other related activities in Indonesia. The company operates through Chartered Vessels Services; and Crews and Vessel Management Services and Other Services divisions. It transports liquefied natural gas, crude and fuel oil, chemicals, containers, coal, and other sea cargoes. The company also provides vessel crews and management services to vessel owners, as well as charters vessels; and offshore support vessel, marine support, dredging, and human capital and development services. In addition, it engages in the energy distribution, crew training, and trading activities. The company was founded in 1992 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "INDX.JK": {
        "short_name": "Tanah Laut Tbk",
        "long_name": "PT Tanah Laut Tbk",
        "summary": "PT Tanah Laut Tbk, together with its subsidiaries, provides sea transport and trans loading services in Indonesia. The company also offers business management consultancy services, which includes planning and designing the development of business management in the areas of shipping, marine transport and logistics, harbor, mining, energy resources, and other consultation services. In addition, it provides ports and terminal development and services; marine transportation and logistics services; and trading services. The company was formerly known as PT IndoExchange Tbk and changed its name to PT Tanah Laut Tbk in June 2011. The company was founded in 1991 and is headquartered in Jakarta, Indonesia. PT Tanah Laut Tbk is a subsidiary of Equatorex Sdn. Bhd.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "IPCM.JK": {
        "short_name": "Jasa Armada Indonesia Tbk.",
        "long_name": "PT Jasa Armada Indonesia Tbk",
        "summary": "PT Jasa Armada Indonesia Tbk provides pilotage and towage services primarily in Indonesia. It offers mooring, sea transportation, river and lake transportation, ship operation, freight, warehousing and storage, cargo handling, and fleet management services. The company also provides vessel rental and agency, vessel repair and maintenance, and refueling and clean water services. It serves public port, private terminal, inland warterway, and ship to ship offshore terminal markets. The company was founded in 1960 and is headquartered in Jakarta, Indonesia. PT Jasa Armada Indonesia Tbk is a subsidiary of PT. Pelabuhan Indonesia II.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "KARW.JK": {
        "short_name": "ICTSI Jasa Prima Tbk.",
        "long_name": "PT ICTSI Jasa Prima Tbk",
        "summary": "PT ICTSI Jasa Prima Tbk, together with its subsidiaries, engages in the development, construction, and operation of maritime logistics infrastructure facilities and related services in Indonesia. The company offers services on maintenance, upkeep, operation, and utilization of maritime facilities and infrastructure, including concession of berths and terminals, and container yards; and upkeep, maintenance and repair, and operation of technical, mechanical, and electronic equipment/aids, as well as machinery and special scales. It also provides computer software and hardware related to facilities and infrastructure of maritime logistics; and stevedoring services. In addition, the company engages in the facilities and infrastructures development for maritime logistics; trading of various goods related to maritime logistics facilities and infrastructure; and freight forwarding and warehousing, and marine and water transportation of goods. Further, it is involved in the workshop, installation and sales, and supply or rental of heavy equipment/light appliance and spare parts related to maritime logistics facilities and infrastructures. Additionally, the company offers management, business, and administration consulting related to maritime logistics facilities and infrastructures; and supply and services related to terminal and other maritime logistic facility management, dredging service of port, quay basin, channel, or supply and management of other maritime logistic infrastructure and facilities, as well as strait and shipping passage and other related supporting service. It is also involved in the development, trading, industrial, agribusiness, land transportation, repair shop, and other activities. The company was formerly known as PT Maharlika Indonesia Tbk and changed its name to PT ICTSI Jasa Prima Tbk in August 2012. The company was founded in 1978 and is based in North Jakarta, Indonesia. PT ICTSI Jasa Prima Tbk is a subsidiary of ICTSI Far East Pte. Ltd.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "North Jakarta"
    },
    "LEAD.JK": {
        "short_name": "Logindo Samudramakmur Tbk.",
        "long_name": "PT Logindo Samudramakmur Tbk.",
        "summary": "PT Logindo Samudramakmur Tbk., together with its subsidiaries, provides integrated maritime services to support upstream oil and gas industries in Indonesia. It provides offshore support vessel services, including anchor handling tugs and anchor handling supply vessels, platform supply vessels, diving support and utility vessels, crew boats, patrol boats, landing craft tanks, tug boats, barges, and accommodation work barges. The company operates a fleet of 45 vessels. PT Logindo Samudramakmur Tbk. was founded in 1995 and is based in Central Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Pusat"
    },
    "MBSS.JK": {
        "short_name": "Mitrabahtera Segara Sejati Tbk.",
        "long_name": "PT Mitrabahtera Segara Sejati Tbk",
        "summary": "PT Mitrabahtera Segara Sejati Tbk, together with its subsidiaries, provides sea logistics and transportation services in Indonesia. It operates through three segments: Tugboat and Barge, Floating Crane, and Consultancy. The company offers direct barging services for the transportation of bulk mining materials, primarily coal. It owns and operates 76 barges. The company also has a fleet of 4 floating cranes consisting of single and double cranes, as well as 2 floating loading facilities with conveyor belt system and metal detector. Further, it provides material handling services covering barge loading activities; and marine consultancy service. The company was founded in 1994 and is headquartered in South Jakarta, Indonesia. PT Mitrabahtera Segara Sejati Tbk is a subsidiary of PT Indika Energy Infrastructure.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "NELY.JK": {
        "short_name": "Pelayaran Nelly Dwi Putri Tbk.",
        "long_name": "PT Pelayaran Nelly Dwi Putri Tbk",
        "summary": "PT Pelayaran Nelly Dwi Putri Tbk provides shipping services in Indonesia. It offers vessel charter services; and builds, repairs, and maintains tug-boats and barges, as well as shipping consulting services. The company was founded in 1977 and is based in Jakarta Pusat, Indonesia. PT Pelayaran Nelly Dwi Putri Tbk is a subsidiary of PT Haskojaya Abadi.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Pusat"
    },
    "P5TA.F": {
        "short_name": "TEMAS  RP 25",
        "long_name": "PT Temas Tbk.",
        "summary": "PT Temas Tbk. provides sea transportation services in Indonesia and internationally. It transports commodities, such as rice, flour, sugar, cement, and other general cargoes. The company also provides shipping agency services for container, break bulk, general cargo, bulk, ro ro, tanker, and other vessels; and shipping management, logistic, and stevedoring services. In addition, it offers container depot management services, such as stuffing and stripping, container repair, container cleaning that has been returned by customer, and rental of the container handling equipment; and leases containers. The company was formerly known as PT Pelayaran Tempuran Emas Tbk and changed its name to PT Temas Tbk. in August 2019. PT Temas Tbk. was founded in 1987 and is headquartered in North Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "North Jakarta"
    },
    "PORT.JK": {
        "short_name": "Nusantara Pelabuhan Handal Tbk.",
        "long_name": "PT Nusantara Pelabuhan Handal Tbk",
        "summary": "PT Nusantara Pelabuhan Handal Tbk manages and operates container terminals in Indonesia and Thailand. It operates through Port Services, Sales Container Handling, and Others segments. The company provides container handling and stevedoring services for export/import commodities; goods loading and unloading services; and repair and maintenance services. It is also involved in the trading and investment activities. In addition, the company offers equipment services; and engineering services, retrofitting, and lashing structure systems for shipment. Further, it supplies cranes; and provides seaport and sea transportation services. The company was formerly known as PT Kharisma Mutiara Agung and changed its name to PT Nusantara Pelabuhan Handal Tbk in November 2016. The company was founded in 2003 and is headquartered in Jakarta, Indonesia. PT Nusantara Pelabuhan Handal Tbk is a subsidiary of PT Episenta Utama Investasi.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "PSSI.JK": {
        "short_name": "Pelita Samudera Shipping Tbk.",
        "long_name": "PT Pelita Samudera Shipping Tbk",
        "summary": "PT Pelita Samudera Shipping Tbk provides integrated logistics and shipping solutions primarily to the coal mining companies in Indonesia. It operates through three segments: Time Charter of Tugboats and Barges, Floating Loading Facility, and Motor Vessel. The company engages in the inter-island coal transportation to various locations of coal-fired power plants and other industries, as well as floating loading facility and floating bulk unloader activities. It also owns 38 tug boats and 37 barges with a range of capacities ranging from 7,500 metric tons to 9,500 metric tons. The company was founded in 2007 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "PTIS.JK": {
        "short_name": "Indo Straits Tbk.",
        "long_name": "PT Indo Straits Tbk",
        "summary": "PT Indo Straits Tbk, together with its subsidiary, provides integrated marine engineering and logistics support services in Indonesia. It offers marine engineering services, including dredging, reclamation and piling works; construction of ports and jetty, piers, breakwaters, and sea walls; and shore protection, and other related marine works, as well as marine civil design and construction services. The company also provides marine support logistic services, such as coal barging, coal transshipment, and sea transportation services. It serves oil and gas, coal mining, and chemical industries, as well as construction and fabrication companies. The company was founded in 1984 and is headquartered in North Jakarta, Indonesia. PT Indo Straits Tbk is a subsidiary of Straits Corporation Pte Ltd.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Utara"
    },
    "RIGS.JK": {
        "short_name": "Rig Tenders Indonesia Tbk.",
        "long_name": "PT Rig Tenders Indonesia Tbk",
        "summary": "PT Rig Tenders Indonesia Tbk provides marine logistics services for the oil and coal industry in Indonesia. It operates in two segments, Coal and Offshore. The Coal segment is involved in the charter of tugboats and barges to coal mining companies for the transportation of coal and other bulk aggregates. The Offshore segment charters supply vessels and accommodation work barges to upstream oil and gas companies for supporting their offshore operations. It also offers catering, ship management, crew management, and bunker services. PT Rig Tenders Indonesia Tbk owns and operates a fleet of vessels, such as anchor handling supply tug boats, accommodation/work overs, flat tops, and self-discharging barges. As of June 30, 2020, the company owned 36 tug boats, 7 self-discharging barges, 21 barges, and 1 accommodation work barge. The company was founded in 1974 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "SMDR.JK": {
        "short_name": "Samudera Indonesia  Tbk.",
        "long_name": "PT Samudera Indonesia Tbk",
        "summary": "PT Samudera Indonesia Tbk, together with its subsidiaries, provides cargo transportation and integrated logistics services in Indonesia and rest of Southeast Asia, the Middle East, India, and internationally. The company operates through Shipping and Agency, Logistics and Terminal, and Others segments. It also offers container shipping services; container storage, repairs, and related services; and stevedoring and warehousing, freight forwarding, land transportation, and container freight station services. In addition, the company provides cargo inland transport, container depot, warehouse and distribution center, third party logistics, and cold chain and project logistics services; and sales and marketing, and traffic and operations services, as well as offers cargo handling services. Further, It offers agency, ship management and other related, and oil and gas transportation services, as well as supporting services for mining oil and gas, and marine transportation services; property development, trading, and industry services; port management and other port services; and mechanical reparation, maintenance, and wholesale trade services, as well as port supporting equipment. Additionally, the company provides terminal, bulk carrier, tanker, offshore support, third-party logistics, packaging, and project logistics services, as well as inland transportation, and container depot services. The company was founded in 1964 and is headquartered in West Jakarta, Indonesia. PT Samudera Indonesia Tbk is a subsidiary of PT Samudera Indonesia Tangguh.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Barat"
    },
    "SOCI.JK": {
        "short_name": "Soechi Lines Tbk.",
        "long_name": "PT Soechi Lines Tbk",
        "summary": "PT Soechi Lines Tbk provides shipping and marine transportation services in Indonesia. The company operates through two segments, Shipping and Shipyard. It charters vessels to the oil and gas, and chemical companies. The company operates a fleet of 35 vessels. It also operates a shipyard, which offers ship maintenance, repair, and overhauling vessels service, as well as new shipbuilding services. In addition, the company provides management and business consulting services; and engages in investment and other business activities. The company was founded in 1970 and is headquartered in Central Jakarta, Indonesia. PT Soechi Lines Tbk is a subsidiary of PT Soechi Group.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Pusat"
    },
    "TAMU.JK": {
        "short_name": "Pelayaran Tamarin Samudra Tbk.",
        "long_name": "PT Pelayaran Tamarin Samudra Tbk",
        "summary": "PT Pelayaran Tamarin Samudra Tbk operates as an integrated offshore shipping company in Indonesia. The company's services include offshore marine support services, marine equipment chatering, chartering, re-chartering, accommodation work barge, and anchor handling tug supply services. It serves the oil and gas industry. The company was founded in 1998 and is headquartered in Jakarta, Indonesia. PT Pelayaran Tamarin Samudra Tbk is a subsidiary of Pt Andalan Lepas Pantai.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "TCPI.JK": {
        "short_name": "TRANSCOAL PACIFIC TBK",
        "long_name": "PT Transcoal Pacific Tbk",
        "summary": "PT Transcoal Pacific Tbk provides sea transport and logistics services in Indonesia. It primarily offers vessel charter and good freight services. The company also provides barging, long hauling, transshipment, oil barge, and agency services, as well as mooring man and oil spill response team services. PT Transcoal Pacific Tbk was founded in 2007 and is headquartered in Jakarta, Indonesia. PT Transcoal Pacific Tbk is a subsidiary of PT Sari Nusantara Gemilang.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "TMAS.JK": {
        "short_name": "Temas Tbk.",
        "long_name": "PT Temas Tbk.",
        "summary": "PT Temas Tbk. provides sea transportation services in Indonesia and internationally. It transports commodities, such as rice, flour, sugar, cement, and other general cargoes. The company also provides shipping agency services for container, break bulk, general cargo, bulk, ro ro, tanker, and other vessels; and shipping management, logistic, and stevedoring services. In addition, it offers container depot management services, such as stuffing and stripping, container repair, container cleaning that has been returned by customer, and rental of the container handling equipment; and leases containers. The company was formerly known as PT Pelayaran Tempuran Emas Tbk and changed its name to PT Temas Tbk. in August 2019. PT Temas Tbk. was founded in 1987 and is headquartered in North Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "North Jakarta"
    },
    "TPMA.JK": {
        "short_name": "Trans Power Marine Tbk.",
        "long_name": "PT Trans Power Marine Tbk",
        "summary": "PT Trans Power Marine Tbk provides bulk cargo transportation and handling solutions in Indonesia and Southeast Asia. The company transports bulk commodities, such as iron sand, coal, wood pellets, gypsum, woodchips, clinker, sponge rotary kiln, etc. As of December 31, 2019, it operated a fleet of 74 units, including 38 tugboats, 33 barges, and 3 crane barges. The company was founded in 2005 and is headquartered in Jakarta Selatan, Indonesia. PT Trans Power Marine Tbk is a subsidiary of PT Dwitunggal Perkasa Mandiri.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "W6O.F": {
        "short_name": "WINTERMAR OFFSHORE MARINE",
        "long_name": "PT Wintermar Offshore Marine Tbk",
        "summary": "PT Wintermar Offshore Marine Tbk supporting services for the offshore transportation for the oil and gas industry in Indonesia, Malaysia, Brunei, Myanmar, Thailand, India, Bangladesh, Papua New Guinea, Micronesia, the Middle East, and Africa. The company operates through three segments: Charter of Own Vessels, Charter of Third Party Vessels, and Other Services. Its fleet includes platform supply vessels, anchor handling tug supply vessels, anchor handling tug vessels, fast utility vessels, fast multi-purpose supply vessels, azimuth stern drive tugs, utility vessels, crew boats, landing crafts, oil barges, heavy load deck barges, and tug boats. The company also offers rig moving and anchor handling, crew change and rig supply, firefighting and emergency rescue, air diving and remotely operated vehicle support, pipe tailing support, seismic survey support services, as well as ship management and other services. It operates a fleet of approximately 48 offshore support vessels. The company was formerly known as PT Swakarya Mulia Shipping and changed its name to PT Wintermar Offshore Marine Tbk in September 2010. The company was founded in 1970 and is based in West Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta Barat"
    },
    "WINS.JK": {
        "short_name": "Wintermar Offshore Marine Tbk.",
        "long_name": "PT Wintermar Offshore Marine Tbk",
        "summary": "PT Wintermar Offshore Marine Tbk supporting services for the offshore transportation for the oil and gas industry in Indonesia, Malaysia, Brunei, Myanmar, Thailand, India, Bangladesh, Papua New Guinea, Micronesia, the Middle East, and Africa. The company operates through three segments: Charter of Own Vessels, Charter of Third Party Vessels, and Other Services. Its fleet includes platform supply vessels, anchor handling tug supply vessels, anchor handling tug vessels, fast utility vessels, fast multi-purpose supply vessels, azimuth stern drive tugs, utility vessels, crew boats, landing crafts, oil barges, heavy load deck barges, and tug boats. The company also offers rig moving and anchor handling, crew change and rig supply, firefighting and emergency rescue, air diving and remotely operated vehicle support, pipe tailing support, seismic survey support services, as well as ship management and other services. It operates a fleet of approximately 48 offshore support vessels. The company was formerly known as PT Swakarya Mulia Shipping and changed its name to PT Wintermar Offshore Marine Tbk in September 2010. The company was founded in 1970 and is based in West Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Barat"
    }
}