{
    "EPMT.JK": {
        "short_name": "Enseval Putera Megatrading Tbk.",
        "long_name": "PT Enseval Putera Megatrading Tbk",
        "summary": "PT Enseval Putera Megatrading Tbk, together with its subsidiaries, engages in the distribution and supply of pharmaceutical products in Indonesia. The company operates in three segments: Pharmaceutical, Consumer Products, and Others. It also trades in medical and laboratory equipment and supplies; operates health care clinics; and offers dental and other equipment, as well as calibration services. In addition, the company engages in the trading of raw materials for pharmaceutical products; consumable products for hemodialysis therapy; and food and beverages. Further, it offers warehousing services, including chiller, cool, and ambient rooms, as well as container chiller as facilities. The company was formerly known as PT Arya Gupta Cempaka and changed its name to PT Enseval Putera Megatrading Tbk in August 1993. The company was founded in 1973 and is headquartered in East Jakarta, Indonesia. PT Enseval Putera Megatrading Tbk is a subsidiary of PT Kalbe Farma Tbk.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Timur",
        "zipcode": "13920",
        "website": "http://www.enseval.com",
        "market_cap": "Large Cap"
    },
    "IRRA.JK": {
        "short_name": "Itama Ranoraya Tbk.",
        "long_name": "PT Itama Ranoraya Tbk",
        "summary": "PT Itama Ranoraya Tbk distributes medical devices in Indonesia. The company offers Oneject auto disable syringe products, Abbott diagnostics products, Terumo BCT products, Ortho-clinical diagnostics, etc. It is also involved in building and office space rental business. The company was founded in 1989 and is headquartered in East Jakarta, Indonesia. PT Itama Ranoraya Tbk is a subsidiary of PT Global Dinamika Kencana.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "East Jakarta",
        "zipcode": "13330",
        "website": "http://www.itama.co.id",
        "market_cap": "Large Cap"
    },
    "SDPC.JK": {
        "short_name": "Millennium Pharmacon Internatio",
        "long_name": "PT Millennium Pharmacon International Tbk",
        "summary": "PT Millennium Pharmacon International Tbk engages in the distribution and trading of prescription and non-prescription medicines, food supplements, and medical devices in Indonesia and internationally. The company distributes its products through hospitals, drug stores, pharmacies, and modern markets. As of December 31, 2019, it operated 32 branch offices in Java, Bali, Sumatera, Kalimantan, and Sulawesi Islands. The company was formerly known as PT NVPD Soedarpo Corporation Tbk and changed its name to PT Millennium Pharmacon International Tbk in February 1990. The company was founded in 1952 and is headquartered in Jakarta, Indonesia. PT Millennium Pharmacon International Tbk is a subsidiary of Pharmaniaga International Corporation Sdn. Bhd.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12240",
        "website": "http://www.mpi-indonesia.co.id",
        "market_cap": "Large Cap"
    }
}