{
  "ABBA.JK": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Publishing",
    "long_name": "PT Mahaka Media Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "Mahaka Media Tbk.",
    "state": null,
    "summary": "PT Mahaka Media Tbk, through its subsidiaries, operates as a multiplatform media company in Indonesia and internationally. It engages in making, selling, collecting, and distributing community contents through various platforms. The company publishes Harian Republika Daily, a Moslem newspaper; Republika Penerbit, which specializes in Islamic reference books, novels, and children stories; Golf Digest, a golf media, including e-magazine, e-newsletter, and social media, as well as golfdigest.id, a Website; and Harian Indonesia, a Chinese-language newspaper. It also provides Republika Media Visual, which offers content and program with Islamic background; Jak TV, a television station; and various commercial radio stations, including JAK 101 FM, GEN 98.7 FM Jakarta, GEN 103.1 FM, Surabaya, HOT 93.2 FM, Most Radio 105.8 FM, KIS 95.1 FM, and Mustang 88.0 FM. In addition, the company offers outdoor advertising media services under the Mahaka Advertising name; brand activation services under the Alive Indonesia name; and discount services under the CardPlus name. Further, it provides online services through Jak-tv.co.id, 98.7 GenFM.co.id, 101 JakFM.co.id, and Republika.co.id. The company was formerly known as PT Abdi Bangsa Tbk and changed its name to PT Mahaka Media Tbk in May 2010. PT Mahaka Media Tbk was founded in 1992 and is headquartered in Jakarta, Indonesia. PT Mahaka Media Tbk is a subsidiary of PT Beyond Media.",
    "website": "http://www.mahakamedia.com",
    "zipcode": "10220"
  },
  "LPLI.JK": {
    "city": "Tangerang",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Publishing",
    "long_name": "PT Star Pacific Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "Star Pacific Tbk",
    "state": null,
    "summary": "PT Star Pacific Tbk, through its subsidiaries, engages in the investment and media businesses in Indonesia. It publishes newspapers and magazines; and offers advertising agency, mass media, general trading, and radio broadcasting services. The company was formerly known as PT Lippo ENet Tbk and changed its name to PT Star Pacific Tbk in November 2008. The company was founded in 1983 and is based in Tangerang, Indonesia. PT Star Pacific Tbk is a subsidiary of PT Inti Anugerah Pratama.",
    "website": "http://www.star-pacific.co.id",
    "zipcode": "15810"
  },
  "TMPO.JK": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Publishing",
    "long_name": "PT Tempo Inti Media Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "Tempo Intimedia Tbk.",
    "state": null,
    "summary": "PT Tempo Inti Media Tbk, together with its subsidiaries, engages in the publishing business in Indonesia. The company is also involved in event convention organizer; publishing press; paper trading; building and transport management; buying and selling of digital newspaper, magazine, and media; training, data processing, and research and consultancy; education; multimedia and creative house; television broadcasting; and industrial general trading activities. PT Tempo Inti Media Tbk was founded in 1971 and is based in Jakarta, Indonesia.",
    "website": "http://korporat.tempo.co",
    "zipcode": "12210"
  }
}
