{
    "AMAN.JK": {
        "short_name": "Makmur Berkah Amanda Tbk.",
        "long_name": "PT Makmur Berkah Amanda Tbk",
        "summary": "PT Makmur Berkah Amanda Tbk operates as a property developer in Indonesia. It develops residential, warehouse, and commercial properties. The company was founded in 1996 and is headquartered in Jakarta Barat, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Barat"
    },
    "APLN.JK": {
        "short_name": "Agung Podomoro Land Tbk.",
        "long_name": "PT Agung Podomoro Land Tbk",
        "summary": "PT Agung Podomoro Land Tbk, together with its subsidiaries, owns, develops, and manages retail, residential, and commercial real estate properties in Indonesia. The company is involved in land acquisition and/or sourcing; design and development; project management, sale, commercial leasing, and marketing; and operation and management of superblock developments, shopping malls, offices, hotels, and residential apartments and houses. The company was founded in 2004 and is headquartered in West Jakarta, Indonesia. PT Agung Podomoro Land Tbk is a subsidiary of PT Indofica.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "West Jakarta"
    },
    "BAPA.JK": {
        "short_name": "Bekasi Asri Pemula Tbk.",
        "long_name": "PT Bekasi Asri Pemula Tbk",
        "summary": "PT Bekasi Asri Pemula Tbk engages in real estate business in Indonesia. The company was founded in 1993 and is headquartered in West Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "West Jakarta"
    },
    "BAPI.JK": {
        "short_name": "Bhakti Agung Propertindo Tbk.",
        "long_name": "PT Bhakti Agung Propertindo Tbk",
        "summary": "PT Bhakti Agung Propertindo Tbk engages in real estate development activities in Indonesia. The company was formerly known as PT Paku Bumi Sejahtera and changed its name to PT Bhakti Agung Propertindo Tbk in June 2015. PT Bhakti Agung Propertindo Tbk was founded in 2012 and is headquartered in Tangerang, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "BCIP.JK": {
        "short_name": "Bumi Citra Permai Tbk.",
        "long_name": "PT Bumi Citra Permai Tbk",
        "summary": "PT Bumi Citra Permai Tbk engages in the development of industrial warehousing and home offices primarily in Indonesia. The company was founded in 2000 and is headquartered in Central Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Central Jakarta"
    },
    "BIKA.JK": {
        "short_name": "Binakarya Jaya Abadi Tbk.",
        "long_name": "PT Binakarya Jaya Abadi Tbk",
        "summary": "PT Binakarya Jaya Abadi Tbk develops and constructs apartments, houses, and complexes in Indonesia. The company's property portfolio comprises hotels, kiosks, shop houses, shopping centers, condominiums, and kavling projects. The company is headquartered in West Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "West Jakarta"
    },
    "BKSL.JK": {
        "short_name": "Sentul City Tbk.",
        "long_name": "PT Sentul City Tbk",
        "summary": "PT Sentul City Tbk engages in the construction, real estate, and services activities in Indonesia. It operates through Real Estate and Other segments. The company develops and sells land, residential houses, shop houses, apartments, commercial buildings, etc. It is also involved in the town, and air/water management activities; amusement park and hospital management activities; apartment management activities; and operation of restaurants and tourism, as well as provision of parking services. The company was formerly known as PT. Bukit Sentul Tbk and changed its name to PT Sentul City Tbk in July 2006. PT Sentul City Tbk was founded in 1993 and is based in Jakarta, Indonesia. PT Sentul City Tbk is a subsidiary of PT Sakti Generasi Perdana.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "BSDE.JK": {
        "short_name": "Bumi Serpong Damai Tbk.",
        "long_name": "PT Bumi Serpong Damai Tbk",
        "summary": "PT Bumi Serpong Damai Tbk, together with its subsidiaries, engages in the real estate development activities in Indonesia. It operates through Real Estate, Property, Hotel, and Others segments. The company is developing the BSD City, a planned and integrated residential area with amenities/infrastructure, environmental facilities, and parks. It is also involved in the hotel operations; and leasing of office space. In addition, the company engages in the development of apartments and shopping centers. The company was founded in 1984 and is based in Tangerang, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "DIIA.F": {
        "short_name": "INTILAND DEVELOP.  RP 250",
        "long_name": "PT Intiland Development Tbk",
        "summary": "PT Intiland Development Tbk, together with its subsidiaries, develops, manages, sells, and invests in real estate properties in Indonesia. The company operates through four segments: Real Estate; Rental of Office Building and Apartments; Industrial Estate; and Facilities. Its property portfolio includes mixed-use and high-rise developments, residential estates, and industrial estates and investment properties in the Greater Jakarta and Surabaya. The company also sells houses and land; develops hotels; operates and manages golf courses; and manages industrial and techno parks, fitness centers, sports clubs, and restaurants. In addition, it engages in the telecommunication business. The company was formerly known as PT Dharmala Intiland Tbk and changed its name to PT Intiland Development Tbk in 2007. PT Intiland Development Tbk was founded in 1983 and is headquartered in Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "DILD.JK": {
        "short_name": "Intiland Development Tbk.",
        "long_name": "PT Intiland Development Tbk",
        "summary": "PT Intiland Development Tbk, together with its subsidiaries, develops, manages, sells, and invests in real estate properties in Indonesia. The company operates through four segments: Real Estate; Rental of Office Building and Apartments; Industrial Estate; and Facilities. Its property portfolio includes mixed-use and high-rise developments, residential estates, and industrial estates and investment properties in the Greater Jakarta and Surabaya. The company also sells houses and land; develops hotels; operates and manages golf courses; and manages industrial and techno parks, fitness centers, sports clubs, and restaurants. In addition, it engages in the telecommunication business. The company was formerly known as PT Dharmala Intiland Tbk and changed its name to PT Intiland Development Tbk in 2007. PT Intiland Development Tbk was founded in 1983 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "DMAS.JK": {
        "short_name": "Puradelta Lestari Tbk.",
        "long_name": "PT Puradelta Lestari Tbk",
        "summary": "PT Puradelta Lestari Tbk engages in the real estate development business in Indonesia. It operates through five segments: Industrial, Residential, Commercial, Hotel, and Rental. The company sells commercial lots and commercial products, including shop houses; residential products, such as landed houses; and develops investment properties of rental factories and hotels, as well as provides clean water supply, waste water treatment, and estate management services comprising cleaning, security, repair and maintenance, and other services. It also develops and manages Kota Deltamas, an integrated township of 3,177 hectares consisting of industrial, residential, and commercial estates. As of December 31, 2019, the company operated 18 residential clusters, seven rental factory units, and one hotel. The company was founded in 1993 and is headquartered in West Jakarta, Indonesia. PT Puradelta Lestari Tbk is a subsidiary of Sinarmas Land Limited.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Barat"
    },
    "DUTI.JK": {
        "short_name": "Duta Pertiwi Tbk",
        "long_name": "PT Duta Pertiwi Tbk",
        "summary": "PT Duta Pertiwi Tbk primarily engages in the real estate business in Indonesia. The company operates through Real Estate, Property, Hotel, and Information Technology segments. It offers houses, shop houses, condominiums, apartments, office buildings, shopping centers, and other buildings, as well as land; and rents real estate properties. It also operates hotels and a recreation arena; and provides information technology services. PT Duta Pertiwi Tbk was founded in 1972 and is headquartered in Jakarta, Indonesia. PT Duta Pertiwi Tbk is a subsidiary of PT Bumi Serpong Damai Tbk.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "FMII.JK": {
        "short_name": "Fortune Mate Indonesia Tbk",
        "long_name": "PT Fortune Mate Indonesia Tbk",
        "summary": "PT Fortune Mate Indonesia Tbk, together with its subsidiaries, provides real estate development and construction services primarily in Indonesia. Its project portfolio includes office, industrial, and residential properties, as well as land. The company was founded in 1989 and is based in Surabaya, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Surabaya"
    },
    "FORZ.JK": {
        "short_name": "Forza Land Indonesia Tbk.",
        "long_name": "PT Forza Land Indonesia Tbk",
        "summary": "PT Forza Land Indonesia Tbk engages in the property development business in Indonesia. It primarily develops industrial estates, apartment buildings, condominiums, offices, and shops and facilities, as well as other residential projects. The company was formerly known as PT Megah Satu Properti and changed its name to PT Forza Land Indonesia Tbk in 2016. PT Forza Land Indonesia Tbk was founded in 2012 and is based in Jakarta Barat, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Barat"
    },
    "GAMA.JK": {
        "short_name": "Aksara Global Development Tbk.",
        "long_name": "PT Aksara Global Development Tbk",
        "summary": "PT Aksara Global Development Tbk develops real estate properties in Indonesia. The company operates through Apartments and Houses segments. Its property portfolio includes land, apartments, shop houses, houses, and other properties. The company also constructs buildings, bridges, roads, docks, housing buildings, schools, recreational parks, market or modern markets, hospitals, and other buildings; and offers consultation service in the areas of business and management, property, architecture, landscape, design and interior, civil, property agent, and others. In addition, it is involved in export and import, and wholesale trading activities; and the manufacture of building materials and construction tools. PT Aksara Global Development Tbk serves middle-class income families in second-tier cities and urban areas. The company was formerly known as PT Gading Development Tbk. The company was founded in 2003 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "GMTD.JK": {
        "short_name": "Gowa Makassar Tourism Developme",
        "long_name": "PT Gowa Makassar Tourism Development Tbk",
        "summary": "PT Gowa Makassar Tourism Development Tbk engages in the real estate and urban development activities in Indonesia. It operates in two segments, Real Estate and Supporting. The company develops residential and commercial buildings, hotels, recreational facilities, and non-commercial supporting facilities; and planned areas, facilities, and infrastructure. It also provides ready-to-build land for consumers; and services related to township management, as well as manages built facilities and infrastructure. The company was founded in 1991 and is headquartered in Makassar, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Makassar"
    },
    "GPRA.JK": {
        "short_name": "Perdana Gapuraprima Tbk.",
        "long_name": "PT Perdana Gapuraprima Tbk",
        "summary": "PT Perdana Gapuraprima Tbk develops real estate properties in Indonesia. The company develops shopping centers, offices, apartments, hotels, condotels, houses, commercial, and mixed used projects. It also engages in planning and supervising housing and building development activities, as well as purchasing and selling of buildings and land rights. The company was founded in 1987 and is based in South Jakarta, Indonesia. PT Perdana Gapuraprima Tbk is a subsidiary of PT Citraabadi Kotapersada.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "South Jakarta"
    },
    "GWSA.JK": {
        "short_name": "Greenwood Sejahtera Tbk.",
        "long_name": "PT Greenwood Sejahtera Tbk",
        "summary": "PT Greenwood Sejahtera Tbk, together with its subsidiaries, develops real estate properties in Indonesia. It is also involved in the sale and rental of apartments, shopping centers, and offices; and operation of a hotel. The company was founded in 1990 and is headquartered in Central Jakarta, Indonesia. PT Greenwood Sejahtera Tbk is a subsidiary of PT Prima Permata Sejahtera.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Central Jakarta"
    },
    "HOMI.JK": {
        "short_name": "Grand House Mulia Tbk.",
        "long_name": "PT Grand House Mulia Tbk",
        "summary": "PT Grand House Mulia Tbk engages in operating residential and commercial properties in Indonesia. It also offers property development consulting service. The company was incorporated in 2006 and is based in Tangerang, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "LCW.SG": {
        "short_name": "PT LIPPO CIKARANG Registered Sh",
        "long_name": "PT Lippo Cikarang Tbk",
        "summary": "PT Lippo Cikarang Tbk, together with its subsidiaries, engages in the development of real estate and industrial estate projects in Indonesia. The company operates through Real Estate and Support Services segments. It is also involved in the provision of supporting services, including estate management, public transport, and recreation services. In addition, the company engages in construction, purchase, sale, lease, and operation of exhibition spaces, storage facilities, private buildings, malls, shopping centers, hospitals, conference halls, houses of worship, hotels, sports centers, golf courses, clubs, restaurants, entertainment venues, medical, laboratories, pharmacies, office buildings, and parking lots. Further, it offers clean and waste water management services; trading, development, and other services; and transportation, waste management, and recycling services. Additionally, the company is involved in the professional, scientific, and technical activities; and remediation, manpower and business support, and other business activities. PT Lippo Cikarang Tbk was founded in 1987 and is headquartered in Bekasi, Indonesia. PT Lippo Cikarang Tbk is a subsidiary of PT Kemuning Satiatama.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Bekasi"
    },
    "LPCK.JK": {
        "short_name": "Lippo Cikarang Tbk",
        "long_name": "PT Lippo Cikarang Tbk",
        "summary": "PT Lippo Cikarang Tbk, together with its subsidiaries, engages in the development of real estate and industrial estate projects in Indonesia. The company operates through Real Estate and Support Services segments. It is also involved in the provision of supporting services, including estate management, public transport, and recreation services. In addition, the company engages in construction, purchase, sale, lease, and operation of exhibition spaces, storage facilities, private buildings, malls, shopping centers, hospitals, conference halls, houses of worship, hotels, sports centers, golf courses, clubs, restaurants, entertainment venues, medical, laboratories, pharmacies, office buildings, and parking lots. Further, it offers clean and waste water management services; trading, development, and other services; and transportation, waste management, and recycling services. Additionally, the company is involved in the professional, scientific, and technical activities; and remediation, manpower and business support, and other business activities. PT Lippo Cikarang Tbk was founded in 1987 and is headquartered in Bekasi, Indonesia. PT Lippo Cikarang Tbk is a subsidiary of PT Kemuning Satiatama.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Bekasi"
    },
    "LPKR.JK": {
        "short_name": "Lippo Karawaci Tbk.",
        "long_name": "PT Lippo Karawaci Tbk",
        "summary": "PT Lippo Karawaci Tbk provides property development services in Indonesia. It operates in three segments: Real Estate Development, Real Estate Management & Services, and Fund Management/Investments. The Real Estate Development segment is involved in the real estate activities, including urban development; development of facilities and its infrastructure; and other investments, as well as large scale integrated development projects and its infrastructure development that include residential condominiums, commercial and entertainment areas, office towers, healthcare facilities, and education facilities. The Real Estate Management & Services segment manages retail malls, hotels, restaurants, and recreation centers; and provides health, town management, water and sewage treatment, transportation, firefighting, and maintenance services. The Fund Management/Investments segment engages in provision of management services and other activities. It also provides trading, printing, agriculture, mining, workshop, home care, installation, construction, gardening, bowling, golf, recreational, building construction and management, clean water and waste management, marketing, clinic and policlinic, and other related services, as well as healthcare and hospital services. In addition, the company engages in the plantation, forestry, electrical, mechanical, engineering, computer programming, trust, financing and financial entity, management consulting, cafe and catering, and tourism activities, as well as management of leased and strata-titled malls. As of December 31, 2019, it managed 41 leased malls and 10 strata-titled malls; 37 hospitals; and 17 food and beverage outlets. The company was formerly known as PT Tunggal Reksakencana. PT Lippo Karawaci Tbk was founded in 1990 and is based in Tangerang, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "MPRO.JK": {
        "short_name": "Maha Properti Indonesia Tbk.",
        "long_name": "PT Maha Properti Indonesia Tbk",
        "summary": "PT Maha Properti Indonesia Tbk engages in the real estate development business in Indonesia. It develops apartments, office buildings, townhouses, and shops. The company was formerly known as PT Propertindo Mulia Investama Tbk. PT Maha Properti Indonesia Tbk was founded in 2004 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "NZIA.JK": {
        "short_name": "Nusantara Almazia Tbk.",
        "long_name": "PT Nusantara Almazia, Tbk.",
        "summary": "PT Nusantara Almazia, Tbk. engages in the property development business in Indonesia. It develops apartments, offices, hospitals, hotels, and schools. The company was founded in 2007 and is based in Karawang, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Karawang"
    },
    "POLI.JK": {
        "short_name": "Pollux Investasi Internasional ",
        "long_name": "PT Pollux Investasi Internasional, Tbk",
        "summary": "PT Pollux Investasi Internasional, Tbk, through its subsidiaries, operates in the property and real estate sector in Indonesia. It is involved in the management and rental of buildings, offices, malls, hotels, shophouses, and amusement parks; property management and development activities; hospitality business; and construction and apartment management activities. The company was formerly known as PT Royal Royce Properties and changed its name to PT Pollux Investasi Internasional, Tbk. PT Pollux Investasi Internasional, Tbk was founded in 2009 and is based in South Jakarta, Indonesia. PT Pollux Investasi Internasional, Tbk is a subsidiary of PT World Apparel.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "South Jakarta"
    },
    "POLL.JK": {
        "short_name": "Pollux Properti Indonesia Tbk.",
        "long_name": "PT Pollux Properti Indonesia Tbk",
        "summary": "PT Pollux Properti Indonesia Tbk operates as a property developer in Indonesia. It operates through Office, Apartment, Hotel, and Others segments. The company develops apartments, condominiums, offices, shopping centers, hospitals, hotels, convention centers, housing, and industrial estates. It also purchases, sells, leases, and operates real estate properties, as well as offers real estate services, such as agents, real estate brokers, and purchasing intermediaries. In addition, the company provides specialist clinic, general polyclinic, medical center, and stem cell laboratory services. Further, it engages in the construction, mining, and transportation businesses. The company was founded in 2014 and is headquartered in South Jakarta, Indonesia. PT Pollux Properti Indonesia, Tbk is a subsidiary of PT Borneo Melawai Perkasa.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "PPRO.JK": {
        "short_name": "PP Properti Tbk.",
        "long_name": "PT Pembangunan Perumahan Properti Tbk",
        "summary": "PT Pembangunan Perumahan Properti Tbk engages in the property development, hospitality, and building construction businesses primarily in Indonesia. The company's portfolio includes housing, office, apartment, as well as retail and commercial properties. It also manages hotels, including Park Hotel Jakarta located in East Jakarta district; and PRIME PARK hotels in Pekanbaru and Bandung; and Swiss-Belhotel Balikpapan located in Balikpapan's central business district and government center. The company was founded in 2013 and is based in East Jakarta, Indonesia. PT Pembangunan Perumahan Properti Tbk is a subsidiary of PT Pembangunan Perumahan (Persero) Tbk.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "East Jakarta"
    },
    "PTLKF": {
        "short_name": "LIPPO KARAWACI",
        "long_name": "PT Lippo Karawaci Tbk",
        "summary": "PT Lippo Karawaci Tbk provides property development services in Indonesia. It operates in three segments: Real Estate Development, Real Estate Management & Services, and Fund Management/Investments. The Real Estate Development segment is involved in the real estate activities, including urban development; development of facilities and its infrastructure; and other investments, as well as large scale integrated development projects and its infrastructure development that include residential condominiums, commercial and entertainment areas, office towers, healthcare facilities, and education facilities. The Real Estate Management & Services segment manages retail malls, hotels, restaurants, and recreation centers; and provides health, town management, water and sewage treatment, transportation, firefighting, and maintenance services. The Fund Management/Investments segment engages in provision of management services and other activities. It also provides trading, printing, agriculture, mining, workshop, home care, installation, construction, gardening, bowling, golf, recreational, building construction and management, clean water and waste management, marketing, clinic and policlinic, and other related services, as well as healthcare and hospital services. In addition, the company engages in the plantation, forestry, electrical, mechanical, engineering, computer programming, trust, financing and financial entity, management consulting, cafe and catering, and tourism activities, as well as management of leased and strata-titled malls. As of December 31, 2019, it managed 41 leased malls and 10 strata-titled malls; 37 hospitals; and 17 food and beverage outlets. The company was formerly known as PT Tunggal Reksakencana. PT Lippo Karawaci Tbk was founded in 1990 and is based in Tangerang, Indonesia.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "RBMS.JK": {
        "short_name": "Ristia Bintang Mahkotasejati Tb",
        "long_name": "PT Ristia Bintang Mahkotasejati Tbk",
        "summary": "PT Ristia Bintang Mahkotasejati Tbk develops housing projects in Indonesia. It sells residential buildings and land plots. The company develops housing projects under the name of Bintang Metropol in Bekasi, Mahkota Simprug in Tangerang, and Saung Riung in Karawang. PT Ristia Bintang Mahkotasejati Tbk was founded in 1985 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "REAL.JK": {
        "short_name": "Repower Asia Indonesia Tbk.",
        "long_name": "PT Repower Asia Indonesia Tbk",
        "summary": "PT Repower Asia Indonesia Tbk engages in the real estate property business in Indonesia. The company purchases, sells, leases, and operates real estate properties, such as apartment buildings, residential buildings, exhibition grounds, personal storage facilities, malls, shopping centers, and others. The company was founded in 2011 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "South Jakarta"
    },
    "RISE.JK": {
        "short_name": "Jaya Sukses Makmur Sentosa Tbk.",
        "long_name": "PT Jaya Sukses Makmur Sentosa Tbk",
        "summary": "PT Jaya Sukses Makmur Sentosa Tbk operates as a property developer in Indonesia. It develops and leases residential properties; and commercial properties, such as apartments, shopping centers, hotels, offices, industrial land, and warehouse properties. The company was founded in 2003 and is based in Sidoarjo, Indonesia.PT Jaya Sukses Makmur Sentosa Tbk is a subsidiary of PT Tancorp Global Sentosa.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Sidoarjo"
    },
    "ROCK.JK": {
        "short_name": "Rockfields Properti Indonesia T",
        "long_name": "PT Rockfields Properti Indonesia Tbk.",
        "summary": "PT Rockfields Properti Indonesia Tbk. develops real estate properties. It designs, develops, markets, and manages commercial and residential real estate projects. The company was founded in 2013 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "RODA.JK": {
        "short_name": "Pikko Land Development Tbk.",
        "long_name": "PT Pikko Land Development Tbk",
        "summary": "PT Pikko Land Development Tbk develops and sells real estate properties in Indonesia. It also invests in shares of stocks, and various property assets, such as land and apartment units. The company was formerly known as PT Royal Oak Development Asia Tbk and changed its name to PT Pikko Land Development Tbk in October 2012. The company was founded in 1984 and is headquartered in Jakarta Pusat, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Pusat"
    },
    "RZU.F": {
        "short_name": "SUMMARECON  RP 500",
        "long_name": "PT Summarecon Agung Tbk",
        "summary": "PT Summarecon Agung Tbk engages in the development and management of real estate properties in Indonesia. The company operates through Property Development, Investment Property, Leisure and Hospitality, and Others segments. It develops and sells houses, commercial buildings, apartments, and residential land and commercial shop plots; manages and leases properties; and provides recreational club facilities. The company develops townships; rents shophouses and office buildings; owns leisure and hospitality facilities, such as sports clubs and hotels; and provides health and estate management services. In addition, it manages residential apartments, offices, and other building facilities; and develops infrastructure facilities. Further, the company operates gas stations and hospitals; retails food and beverages; and provides education, as well as trading services. PT Summarecon Agung Tbk was founded in 1975 and is headquartered in Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta Timur"
    },
    "SATU.JK": {
        "short_name": "Kota Satu Properti Tbk.",
        "long_name": "PT Kota Satu Properti Tbk",
        "summary": "PT Kota Satu Properti Tbk engages in property development activities in Indonesia. The company also engages in the management and trading of real estate property; land transportation; agriculture; provision of accommodation in the form of hotels and lodging services; and printing and workshop businesses. It also operates hotels under the allstay name and provides hotel management services. The company was founded in 2012 and is based in Semarang, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Semarang"
    },
    "SMDM.JK": {
        "short_name": "Suryamas Dutamakmur Tbk.",
        "long_name": "PT Suryamas Dutamakmur Tbk",
        "summary": "PT Suryamas Dutamakmur Tbk engages in the real estate activities in Indonesia. It operates through Real Estate and Property, Golf and Country Club, Estate Management, Hotel, and Investment and Others segments. The company is involved in the sale of land and houses; and operation of the golf courses, country clubs, hotels, and other resort facilities located in Rancamaya, Bogor, West Java. The company was founded in 1989 and is headquartered in Jakarta, Indonesia. PT Suryamas Dutamakmur Tbk is a subsidiary of Top Global Limited.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "SMRA.JK": {
        "short_name": "Summarecon Agung Tbk.",
        "long_name": "PT Summarecon Agung Tbk",
        "summary": "PT Summarecon Agung Tbk engages in the development and management of real estate properties in Indonesia. The company operates through Property Development, Investment Property, Leisure and Hospitality, and Others segments. It develops and sells houses, commercial buildings, apartments, and residential land and commercial shop plots; manages and leases properties; and provides recreational club facilities. The company develops townships; rents shophouses and office buildings; owns leisure and hospitality facilities, such as sports clubs and hotels; and provides health and estate management services. In addition, it manages residential apartments, offices, and other building facilities; and develops infrastructure facilities. Further, the company operates gas stations and hospitals; retails food and beverages; and provides education, as well as trading services. PT Summarecon Agung Tbk was founded in 1975 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Timur"
    },
    "TAMA.JK": {
        "short_name": "Lancartama Sejati Tbk.",
        "long_name": "PT Lancartama Sejati Tbk",
        "summary": "PT Lancartama Sejati TBK provides construction services in Indonesia. It operates as a general contractor for residential and commercial properties, as well as an infrastructural contractor for agricultural and manufacture companies. The company was founded in 1990 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "TRIN.JK": {
        "short_name": "Perintis Triniti Properti Tbk.",
        "long_name": "PT Perintis Triniti Properti Tbk",
        "summary": "PT Perintis Triniti Properti Tbk engages in the real estate business in Indonesia. It purchases, sells, rents, and leases real estate, as well as sells land. The company develops and sells apartments, mixed use properties, office buildings, houses, shophouses, and other buildings. It also offers marketing services. The company was founded in 2009 and is based in Tangerang Selatan, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang Selatan"
    },
    "URBN.JK": {
        "short_name": "Urban Jakarta Propertindo Tbk.",
        "long_name": "PT Urban Jakarta Propertindo Tbk",
        "summary": "PT Urban Jakarta Propertindo Tbk engages in the property development activities in Indonesia. It develops and/or manages office areas, shopping centers, and apartments that are integrated directly with mass transportation. The company was founded in 1995 and is based in South Jakarta, Indonesia. PT Urban Jakarta Propertindo Tbk is a subsidiary of PT Nusa Wijaya Propertindo.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "South Jakarta"
    }
}