{
  "CSMI.JK": {
    "city": "Jakarta Pusat",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Restaurants",
    "long_name": "PT Cipta Selera Murni Tbk",
    "market": "id_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Cipta Selera Murni Tbk.",
    "state": null,
    "summary": "PT Cipta Selera Murni Tbk, together with its subsidiaries, engages in the fast food restaurant business in Indonesia. It offers french fries, honey butter biscuits, mashed potatoes, coleslaw, mixed salad, chicken soup, liver, and gizzard; spicy, white, and fried rice; and potato cutlets, chicken chunks, sphaghetti, spicy and original chicken tender, burger, and wraps. The company also offers mineral water; soft, bottled, and hot drinks; and ice creams. In addition, it trades in household appliances and equipment, consumer electronics, stereo equipment, video game consoles, lighting equipment, porcelain and glass drinking utensils, and other appliances, as well as spoons, knives, forks, tools made of wood, articles of plaiting and articles of cork, wallpaper, carpets etc. As of April 2, 2020, the company operated 37 outlets under the Texas chicken brand name. PT Cipta Selera Murni Tbk was founded in 1983 and is headquartered in Jakarta Pusat, Indonesia.",
    "website": "http://ciptaseleramurni.co.id",
    "zipcode": "10330"
  },
  "DUCK.JK": {
    "city": "West Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Restaurants",
    "long_name": "PT Jaya Bersama Indo Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Jaya Bersama Indo Tbk.",
    "state": null,
    "summary": "PT Jaya Bersama Indo Tbk, together with its subsidiaries, operates various Chinese restaurants in Indonesia. It operates 31 restaurant outlets primarily under the brand names of The Duck King Group, Fook Yew, and Panda Bowl. The company was founded in 2003 and is based in West Jakarta, Indonesia. PT Jaya Bersama Indo Tbk is a subsidiary of PT Asia Kuliner Sejahtera.",
    "website": "http://www.ptjbi.id",
    "zipcode": null
  },
  "FAST.JK": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Restaurants",
    "long_name": "PT Fast Food Indonesia Tbk",
    "market": "id_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Fast Food Indonesia Tbk.",
    "state": null,
    "summary": "PT Fast Food Indonesia Tbk engages in the food and restaurant activities in Indonesia. The company holds the rights to establish and operate Kentucky Fried Chicken (KFC) outlets. As of December 31, 2019, it operated 748 restaurant outlets. The company was founded in 1978 and is headquartered in Jakarta, Indonesia.",
    "website": "http://www.kfcku.com",
    "zipcode": "12810"
  },
  "MAPB.JK": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Restaurants",
    "long_name": "PT. Map Boga Adiperkasa Tbk",
    "market": "id_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MAP Boga Adiperkasa Tbk.",
    "state": null,
    "summary": "PT. Map Boga Adiperkasa Tbk, through its subsidiaries, operates cafés and restaurants in Indonesia. The company operates 566 retail stores across 33 Indonesian cities with a portfolio of Starbucks, Pizza Express/Pizza Marzano, Krispy Kreme, Cold Stone Creamery, Godiva, Genki Sushi, and Paul Bakery brands. The company was formerly known as PT. Creasi Aksesoris Indonesia. The company was founded in 2013 and is headquartered in Jakarta, Indonesia. PT. Map Boga Adiperkasa Tbk is a subsidiary of PT. Mitra Adiperkasa Tbk.",
    "website": "http://www.mbai.co.id",
    "zipcode": "10220"
  },
  "PTSP.JK": {
    "city": "Jakarta Barat",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Restaurants",
    "long_name": "PT Pioneerindo Gourmet International Tbk",
    "market": "id_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Pioneerindo Gourmet Internation",
    "state": null,
    "summary": "PT Pioneerindo Gourmet International Tbk, together with its subsidiaries, operates restaurants in Indonesia. The company operates restaurants under the California Fried Chicken, Sapo Oriental, and Cal Donat trademarks. As of December 31, 2019, it owned and franchised 332 outlets. The company was formerly known as PT Putra Sejahtera Pioneerindo Tbk and changed its name to PT Pioneerindo Gourmet International Tbk in August 2001. PT Pioneerindo Gourmet International Tbk was founded in 1983 and is headquartered in Jakarta Barat, Indonesia.",
    "website": "http://www.cfcindonesia.com",
    "zipcode": "11480"
  },
  "PZZA.JK": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Restaurants",
    "long_name": "PT Sarimelati Kencana Tbk.",
    "market": "id_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Sarimelati Kencana Tbk.",
    "state": null,
    "summary": "PT Sarimelati Kencana Tbk. operates Pizza Hut restaurants under a franchise agreement with Yum! Asia Franchise Pte. Ltd. in Indonesia. As of December 31, 2019, it operated 516 outlets in Jakarta and other cities in Indonesia. The company was founded in 1987 and is headquartered in Jakarta, Indonesia. PT Sarimelati Kencana Tbk. is a subsidiary of PT Sriboga Raturaya.",
    "website": "http://www.sarimelatikencana.co.id",
    "zipcode": "12870"
  }
}
