{
    "CASH.JK": {
        "short_name": "Cashlez Worldwide Indonesia Tbk",
        "long_name": "PT Cashlez Worldwide Indonesia Tbk",
        "summary": "PT Cashlez Worldwide Indonesia Tbk engages in the digital financial technology and payment services businesses in Indonesia. It creates mPOS (mobile point of sales) system, a concept of accepting payments using credit and debit cards or application-based debit cards on smartphones connected by a card reader through Bluetooth. The company provides applications that provide payment facilities, accepting payments using credit cards, debit cards, and digital payments, such as QR Code, Cashlez Link, OVO, and Go-Pay. Its products include Cashlez One, a payment instrument that can process various types of payment methods; Cashlez reader non printers; Cashlez reader printers; and Smartpoz, a POS application that facilitates business owners in running their business. PT Cashlez Worldwide Indonesia Tbk was founded in 2015 and is headquartered in West Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Barat",
        "zipcode": "11470",
        "website": "http://www.cashlez.com",
        "full_time_employees": 124
    },
    "KPAY": {
        "short_name": "KINERJAPAY CORP",
        "long_name": "KinerjaPay Corp.",
        "summary": "KinerjaPay Corp. operates an e-commerce platform in Indonesia. The company's platform, KinerjaPay IP, an e-wallet service for bill transfers and online shopping; and allows top-up phone credit for users. It also provides KMALL, a virtual marketplace for B2B and B2C online transactions; and KGAMES that develops games. The company was formerly known as Solarflex Corp and changed its name to KinerjaPay Corp on February 2016. KinerjaPay Corp. was founded in 2010 and is based in Medan, Indonesia.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "state": null,
        "city": "Medan",
        "zipcode": "20151",
        "website": "http://www.kinerjapay.com",
        "full_time_employees": 54
    }
}