{
    "AMIN.JK": {
        "short_name": "Ateliers Mecaniques D Indonesie",
        "long_name": "PT Ateliers Mecaniques D'Indonesie Tbk",
        "summary": "PT Ateliers Mecaniques D'Indonesie Tbk designs, manufactures, and erects boilers in Indonesia, Nigeria, the Republic of Cote D'Ivoire, Ghana, Cameroon, Belgium, Liberia, Congo, and New Guinea. The company operates through Boiler; Trading, Commission, and Sundry; Spare Part and Service; Palm Oil Equipment; and General Works Mechanical segments. It offers solid fuel membrane wall boilers, solid fuel brick wall boilers, combi boilers, and fire tube boilers for kernel shells, palm fibers, wood chips, coal, shaving, sawdust, gas, woods, coconut fibers, HPO, diesel fuel, and others fuels. The company also provides horizontal and vertical sterilizers; and sterilizer doors, as well as deaerators for use in the removal of air and other dissolved gases primarily oxygen from the feed water to boiler drum. In addition, it provides air-preheater, a heat recovery equipment; economizer that is used to enhance boiler operation efficiency; and super heater, which converts wet saturated steam into dry steam, as well as dust collectors. Further, the company designs and fabricates pressure vessel tanks, piping systems, and boilers for the palm oil industry. Additionally, it offers boiler repair and modification, and technical services, as well as service contract, parts replacement, plant construction, and machinery assembling services. PT Ateliers Mecaniques D'Indonesie Tbk serves palm oil mill, sugar mill, refinery, rubber processing, power plant, power generation, wood processing, chocolate factory, hotel, laundry, textile factory, and plastic factory industries. The company was founded in 1972 and is headquartered in Deli Serdang, Indonesia. PT Ateliers Mecaniques D'Indonesie Tbk is a subsidiary of Sphere Corporation Sdn Bhd.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Deli Serdang",
        "zipcode": "20362",
        "website": "http://www.atmindoboiler.com",
        "market_cap": "Large Cap"
    },
    "PURE.JK": {
        "short_name": "Trinitan Metals and Minerals Tb",
        "long_name": "PT Trinitan Metals and Minerals Tbk",
        "summary": "PT Trinitan Metals and Minerals Tbk operates as a metal and mineral processing company in Indonesia. It offers pure, antimony, calcium, and tin lead products, as well as lead parts for use in various fields, including battery storage, pigments, solder, wire coatings, radiation protection materials, and medical devices; and other products. The company also provides silver for jewelry making, photosensitizers, electric contacts, electro plated products, conductive electronic products, and others; and antimony bullions and metals, and antimony alloys for use in fire resistant materials, paints, ceramics, electronics and rubber, anti-scratch mixtures, polystyrene, PVC, engineering plastics, rubber, paint, coatings, synthetic resins, and fibers. It also exports its products in Japan, India, China, Malaysia, Thailand, Vietnam, and Fiji Island. The company was founded in 2009 and is headquartered in Bogor, Indonesia. PT Trinitan Metals and Minerals Tbk is a subsidiary of PT Trinitan Resourcetama Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bogor",
        "zipcode": "16964",
        "website": "http://www.trinitanmetals.co.id",
        "market_cap": "Large Cap"
    }
}