{
    "ARKA.JK": {
        "short_name": "Arkha Jayanti Persada Tbk.",
        "long_name": "PT Arkha Jayanti Persada Tbk",
        "summary": "PT Arkha Jayanti Persada Tbk provides solutions for parts and components. It also manufactures transport equipment; and engages in steel construction, oil and gas, and telecommunication project activities. The company was founded in 2000 and is based in Bogor, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bogor",
        "zipcode": "16810",
        "website": "http://www.arkhajayanti.co.id",
        "market_cap": "Small Cap"
    },
    "ASGR.JK": {
        "short_name": "Astra Graphia Tbk.",
        "long_name": "PT Astra Graphia Tbk",
        "summary": "PT Astra Graphia Tbk engages in trading, industrial, consulting, office equipment and supplies contractor services, information technology, telecommunications, and investment businesses. It operates in three segments: Document Solution, Information Technology Solution, and Office Services Solution. The Document Solution segment offers hardware and solution based services that include various aspects of the document cycle comprising document input, such as creating, scanning, merging, editing, and capturing, as well as the document management, including sharing, indexing, storing, archiving, and distributing, and document output consisting of printing, faxing, scanning, copying, emailing, and web viewing. This segment also provides digital printing services, such as transactional printing and printing on demand, as well as document imaging and its delivery. The Information Technology Solution segment offers hardware and software solutions; IT solutions and infrastructure services; and IT software development and managed services, including data center and cloud services. The Office Services Solution segment provides general office needs, such as outsourcing service solutions in the form of document printing production, distribution services, and general office services, including office supplies, office equipment, electronic goods, and consumer goods. The company is also involved in the e-commerce service business. It serves customers through a network of 32 branch offices and 92 service points in 514 cities and districts of Indonesia. The company was founded in 1975 and is headquartered in Jakarta, Indonesia. PT Astra Graphia Tbk is a subsidiary of PT Astra International Tbk.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10450",
        "website": "http://www.astragraphia.co.id",
        "market_cap": "Small Cap"
    },
    "ITMA.JK": {
        "short_name": "Sumber Energi Andalan Tbk.",
        "long_name": "PT Sumber Energi Andalan Tbk",
        "summary": "PT Sumber Energi Andalan Tbk provides trading, import and export, consulting, and contract services to the mining and energy sectors. The company was formerly known as PT Itamaraya Tbk and changed its name to PT Sumber Energi Andalan Tbk in June 2010. The company was founded in 1987 and is headquartered in Jakarta, Indonesia. PT Sumber Energi Andalan Tbk is a subsidiary of Trust Energy Resources Pte. Ltd.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10220",
        "website": "http://www.energi-andalan.co.id",
        "market_cap": "Small Cap"
    },
    "JTPE.JK": {
        "short_name": "Jasuindo Tiga Perkasa Tbk.",
        "long_name": "PT Jasuindo Tiga Perkasa Tbk",
        "summary": "PT Jasuindo Tiga Perkasa Tbk, together with its subsidiaries, operates in the printing industry in Indonesia. It operates through two segments, Security Products and Non-Security Products. The company offers payment products, including checks, bank cards, and other payment products; brand protection products comprising stamp duty and labels; commercial printing products, such as promo plus, game plus, pin mailers, reel printing, insurance policy, bills, and delivery orders; and identity documents consisting of passports, identity cards, and certificate/diploma documents. It also provides information technology solutions. The company was founded in 1990 and is headquartered in Sidoarjo, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Sidoarjo",
        "zipcode": "61253",
        "website": "http://jasuindo.com",
        "market_cap": "Small Cap"
    },
    "MFMI.JK": {
        "short_name": "Multifiling Mitra Indonesia Tbk",
        "long_name": "PT Multifiling Mitra Indonesia Tbk",
        "summary": "PT Multifiling Mitra Indonesia Tbk provides record management services in Indonesia. The company's record management services include sorting documents, data entry, maintaining archives, and document destruction. It also offers computer data management services, including backup of data stored on tapes, DVDs, and cartridge. In addition, the company provides valuable document management services, such as sorting, file storage, and retrieval; electronic document management services; and facility management services. Further, it offers application development, security waste and data management, archival related works, and other related data storage services. The company was founded in 1991 and is headquartered in Bekasi, Indonesia. PT Multifiling Mitra Indonesia Tbk is a subsidiary of PT Surya Cipta Investama.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bekasi",
        "zipcode": "17550",
        "website": "http://www.mmi.co.id",
        "market_cap": "Small Cap"
    }
}