{
    "SOSS.JK": {
        "short_name": "Shield On Service Tbk.",
        "long_name": "PT Shield on Service Tbk",
        "summary": "PT Shield on Service Tbk, together with its subsidiaries, provides outsourcing services in Indonesia. It operates through Security Services, Cleaning Services, Human Resource Provider, Parking Services, and Others segments. The company offers security services comprising security management and guarding, security consultancy, corporate and personnel review, and security personnel training services; and cleaning and maintenance services, including daily, full-package, special, and mobile cleaning, as well as landscape/garden maintenance services. It also provides human resource solutions that include talent development, recruitment assessment, and compensation and benefit services; and parking management services, such as parking, valet, car park management, traffic design consultancy, and parking equipment maintenance services. The company was founded in 2004 and is headquartered in Jakarta Pusat, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10160",
        "website": "http://www.sos.co.id",
        "full_time_employees": null
    },
    "TFAS.JK": {
        "short_name": "Telefast Indonesia Tbk.",
        "long_name": "PT Telefast Indonesia Tbk",
        "summary": "PT Telefast Indonesia Tbk, together with its subsidiaries, provides human resources and telecommunications solutions in Indonesia. It operates through Telco Products and Nontelco Products segments. The company offers HR-KU, a human resources information system application, which facilitates all human resources activities and offers a management system for human resource management for developing companies. Its HR-KU provide various modules, such as attendance, leaves, reimbursement, TAS, employee database and information, internal bulletin, and digital store modules. The company also offers manpower supply solutions; and BILIK KERJA, an application for job providers to recruit and manage employees. In addition, it engages in the trading, services, and tourism businesses. PT Telefast Indonesia Tbk was founded in 2008 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12940",
        "website": "http://telefast.co.id",
        "full_time_employees": 14
    }
}