{
    "APII.JK": {
        "short_name": "Arita Prima Indonesia Tbk.",
        "long_name": "PT Arita Prima Indonesia Tbk",
        "summary": "PT Arita Prima Indonesia Tbk imports, distributes, and services valves, fittings, instrumentations, and control products in Indonesia. The company operates in four segments: Valve, Fittings, Instruments, and Others. Its products include valves; instrumentation products; fittings and flanges; pumps; and safety equipment, such as head protection, safety glasses, gloves, protective clothing, fall protection products, respirators, shoes and boots, and others. The company offers its products under the JF Arita, Bells, Q-Flex, Clorius, Ari Armaturen, Thermo, ANS, and other brands. It serves oil and gas, palm oil, marine, waterworks, petrochemical, oleo chemical, building, mining, power plant, and geothermal industries. The company was founded in 2000 and is headquartered in North Jakarta, Indonesia. PT Arita Prima Indonesia Tbk is a subsidiary of PT Arita Global.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "North Jakarta",
        "zipcode": "14350",
        "website": "http://www.arita.co.id",
        "market_cap": 196864081920
    },
    "BOLT.JK": {
        "short_name": "Garuda Metalindo Tbk.",
        "long_name": "PT Garuda Metalindo Tbk",
        "summary": "PT Garuda Metalindo Tbk manufactures and sells precision fasteners and engineered components primarily for the automotive industry in Indonesia. It offers bolts, nuts, screws, and rivets; and special components, and pins and collars for use in engine, suspension, brake, frame and chassis, interior, power train, and other applications. The company serves the motorcycle, automobile, automotive components, electrical equipment, and home appliance industries. It also exports its products to Germany, Brazil, India, Thailand, Malaysia, and other Asian countries. The company was founded in 1966 and is headquartered in North Jakarta, Indonesia. PT Garuda Metalindo Tbk is a subsidiary of PT Garuda Multi Investama.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Utara",
        "zipcode": "14470",
        "website": "http://www.garudametalindo.com",
        "market_cap": 1675781210112
    }
}