{
    "INPS.JK": {
        "short_name": "Indah Prakasa Sentosa Tbk.",
        "long_name": "PT. Indah Prakasa Sentosa Tbk",
        "summary": "PT Indah Prakasa Sentosa Tbk. engages in integrated logistics, transportation, distribution, and retail business in fuel, lubricant, chemical, gasses, and FMCG in Indonesia. The company operates in three segments: Agents of Fuel, Lubricant and Gas; SPPBE; and Transportation and Logistic. Its services include land transportation, warehousing, container depot, and forwarding. The company provides services for industrial and marine fuels, industrial lubricants, and industrial and retail LPG. PT Indah Prakasa Sentosa Tbk. was founded in 1960 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "14350",
        "website": "http://www.inprasegroup.co.id",
        "market_cap": "Micro Cap"
    },
    "JAYA.JK": {
        "short_name": "Armada Berjaya Trans Tbk.",
        "long_name": "PT Armada Berjaya Trans Tbk",
        "summary": "PT Armada Berjaya Trans Tbk engages in the transportation business in Indonesia. It offers land transportation services, such as loose cargo and container transportation; and export and import customs clearance for cargoes. The company also provides multi-modal transport services, including freight forwarding and load consolidation, as well as storage and warehousing services. It operates a fleet of 135 vehicles. The company was formerly known as PT Armada Beton. PT Armada Berjaya Trans Tbk was founded in 2012 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "14350",
        "website": "http://www.armadaberjaya.com",
        "market_cap": "Nano Cap"
    },
    "PURA.JK": {
        "short_name": "Putra Rajawali Kencana Tbk.",
        "long_name": "PT Putra Rajawali Kencana Tbk",
        "summary": "PT Putra Rajawali Kencana Tbk operates as an intra logistic and multimode company in Indonesia and internationally. The company provides transportation management services, including the business of sending and/or packing of goods in large volumes through railroad, land, sea, and air transportation. It also offers multimodal transportation services comprising the transportation of goods using various modes of transportation. In addition, the company provides additional services in the form of freight forwarding, warehousing, cargo consolidation, cargo space, and customs clearance for multimodal transportation; rents and leases cars, buses, and trucks without option rights; and leases cars, trucks, and tow trucks without operational rights. Further, it trades in used cars consisting of special cars, such as ambulances, caravans, microbus, fire engines, etc.; and lorries, trailers, semi-trailers, and various other motorized transport vehicles. The company was founded in 2012 and is headquartered in Surabaya, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Surabaya",
        "zipcode": "60292",
        "website": "http://puratrans.com",
        "market_cap": "Nano Cap"
    },
    "SDMU.JK": {
        "short_name": "Sidomulyo Selaras Tbk.",
        "long_name": "PT Sidomulyo Selaras Tbk",
        "summary": "PT Sidomulyo Selaras Tbk engages in the transportation and storage of toxic and hazardous chemicals in Indonesia. It primarily transports chemicals, oil, and gas. The company also engages in buying and selling spare parts of trucking vehicles, as well as in the customs clearance, isotank washing and repair, and isotank rental activities. It primarily serves companies operating in the upstream chemical industry that produce basic chemicals for domestic and export markets. The company was founded in 1993 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10610",
        "website": "http://www.sidomulyo.com",
        "market_cap": "Nano Cap"
    },
    "TRUK.JK": {
        "short_name": "Guna Timur Raya Tbk.",
        "long_name": "PT Guna Timur Raya Tbk",
        "summary": "PT Guna Timur Raya Tbk provides land transportation services for customers worldwide. It operates trucks. The company was formerly known as PT Timur Jaya and changed its name to PT Guna Timur Raya Tbk in July 1980. The company was founded in 1980 and is based in Jakarta, Indonesia. PT Guna Timur Raya Tbk is a subsidiary of PT Guna Makmur Raya.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "14430",
        "website": "http://gunatimurraya.com",
        "market_cap": "Nano Cap"
    }
}