{
    "1010.SR": {
        "short_name": "Riyad Bank",
        "long_name": "Riyad Bank",
        "summary": "Riyad Bank provides various banking products and services in the Kingdom of Saudi Arabia. The company operates through Retail Banking, Investment Banking and Brokerage, Corporate Banking, and Treasury and Investments segments. The Retail Banking segment offers deposits, credit, and investment products for individuals and small to medium sized businesses. The Investment Banking and Brokerage segment provides investment management services; and asset management services related to dealing, managing, arranging, advising, and custody of securities. The Corporate Banking segment offers current accounts, deposits, loans, overdrafts, and other credit facilities. The Treasury and Investments segment offers money market, trading, and treasury and derivative products and services, as well as manages investment portfolios. The company also provides saving account and term deposit products; personal, car, and home finance; Islamic banking products and services; and digital banking services. In addition, it owns, buys, and sells real estate; and acts as an agent for insurance products. It operates through a network of approximately 341 branches in the Kingdom of Saudi Arabia; a branch in London, the United Kingdom; an agency in Houston, the United States; and a representative office in Singapore. Riyad Bank was founded in 1957 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11416",
        "website": "http://www.riyadbank.com",
        "full_time_employees": 5532
    },
    "1020.SR": {
        "short_name": "Bank AlJazira",
        "long_name": "Bank AlJazira",
        "summary": "Bank AlJazira provides a range of Shari'ah compliant banking products and services for individuals, corporates, small to medium sized businesses, and institutions in the Kingdom of Saudi Arabia. The company operates through Personal Banking, Corporate Banking, Treasury, Brokerage and Asset Management, and Takaful Ta'awuni segments. It offers various personal banking products and services, including saving and current accounts; real estate and personal financing services; safety deposits; money transfer; investment products; and ladies and e-banking services. The company also provides Islamic funding services; global transaction services, such as cash management, trade financing, and corporate payroll services; syndication financing services; and commercial and online banking services, as well as services for the public sector and financial institutions. In addition, it offers investment banking services comprising brokerage and asset management services, as well as corporate investment banking services through initial public offerings, private placement, capital increase, and underwriting. Further, the company provides private banking products and services, including ATM and credit cards, safe deposit lockers, trading commission, foreign currency exchange, short term deposits, and structured products; real-estates investments; wealth management services; and treasury services, including naqa'a and thrift saving programs, foreign exchange, FX forward, structured products, and hedging solutions, as well as margin financing services. As of December 31, 2020, it operated a network of 79 branches and 62 Fawri remittance centers. The company was incorporated in 1975 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": null,
        "website": "http://www.bankaljazira.com",
        "full_time_employees": 2584
    },
    "1050.SR": {
        "short_name": "Banque Saudi Fransi",
        "long_name": "Banque Saudi Fransi",
        "summary": "Banque Saudi Fransi provides banking and financial services in the Kingdom of Saudi Arabia and internationally. Its deposit products include demand accounts, saving accounts, current accounts, money market deposits, term deposits, and notice deposits, as well as mada Pay and Apple Pay products. The company's loan portfolio comprises home and personal loans, consumer loans, overdrafts, corporate finance, working capital finance, contract finance, structured finance, trade finance, Islamic finance, project finance, and credit and debit cards, as well as other credit facilities. It also provides forex and derivative products; treasury services, such as trading activities, investment securities, capital markets, and bank's funding operations; and cash and wealth management services. In addition, the company provides investment management services; asset management activities related to dealing, managing, arranging, advising, and custody of securities; retail investment products; international and brokerage services; education, retirement, travel protection, and car protection insurance plans; and ATM, and Islamic and e-banking services. It operates through a network of 87 branches. Banque Saudi Fransi founded in 1977 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11554",
        "website": "http://www.alfransi.com.sa",
        "full_time_employees": 2881
    },
    "1090.SR": {
        "short_name": "SAMBA Financial Group",
        "long_name": "Samba Financial Group",
        "summary": "Samba Financial Group provides various banking products and services. The company operates through four segments: Consumer Banking, Corporate Banking, Treasury, and Investment Banking. The Consumer Banking segment offers individual customer time deposits, current, call, and savings accounts, as well as credit cards, retail investment products, and individual and consumer loans. The Corporate Banking segment provides corporate time deposits, current and call accounts, overdrafts, loans and other credit facilities, and corporate advisory services, as well as derivative portfolios. The Treasury segment primarily manages money market, foreign exchange, commission rate trading, and derivatives for corporate and institutional customers. The Investment Banking segment is involved in the investment management and asset management activities related to dealing, managing, arranging, advising, and custody businesses. The company also offers Islamic banking products, as well as manages real estate projects; and provides debit cards and online banking services. It operates 73 branches in the Kingdom of Saudi Arabia; and two overseas branches. Samba Financial Group was founded in 1955 and is headquartered in Riyadh, the Kingdom of Saudi Arabia. As of April 1, 2021, Samba Financial Group was acquired by The National Commercial Bank.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11421",
        "website": "http://www.samba.com",
        "full_time_employees": 3609
    },
    "1120.SR": {
        "short_name": "Al Rajhi Bank",
        "long_name": "Al Rajhi Banking and Investment Corporation",
        "summary": "Al Rajhi Banking and Investment Corporation, together with its subsidiaries, engages in banking and investment activities in the Kingdom of Saudi Arabia and internationally. The company operates through four segments: Retail, Corporate, Treasury, and Investment Services and Brokerage. It offers current, affluent, private, ladies, business, and escrow accounts; personal, auto, home, car, real estate, fleet, payroll, POS merchant, contract, invoice, and working capital finance services; credit and debit cards; and vehicle, property, family protection, medical, personal accident, travel, marine and cargo, engineering, machinery breakdown, and professional liability insurance products. The company also provides documentary collection, letters of credit, letters of guarantee, supply chain finance, and e-trade services; cash management services; and investment products. In addition, it offers various corporate products, such as Bai Al Ajel, a financing facility that provides cash to customers; Murabaha contracts that allow customers to purchase raw materials, capital goods, and other consumables from local and international markets; Musharaka that enables customers to import goods and equipment; Istisnaa for financing real estate projects; Akar for investing in properties; and Erad that provides credit facilities against the assignment of rental income for a specific period for those interested in financing a real estate purchase. Further, the company provides treasury products, including direct investment, FX, gold trading, and bank notes; and mutual funds, investment, and local and international share trading services. It operates through a network of 591 branches. The company was founded in 1957 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "12263-2743",
        "website": "http://www.alrajhibank.com.sa",
        "full_time_employees": 13716
    },
    "1140.SR": {
        "short_name": "Bank Albilad",
        "long_name": "Bank Albilad",
        "summary": "Bank Albilad provides various banking products and services in the Kingdom of Saudi Arabia. It operates through Retail Banking, Corporate Banking, Treasury, and Investment Banking and Brokerage segments. The Retail Banking segment offers deposits, financing, remittances, and currency exchange products and services to individuals. The Corporate Banking segment provides deposits, financing, and trade services to corporate customers. The Treasury segment offers money market and treasury services. The Investment Banking and Brokerage segment offers investment management services; and undertakes asset management activities related to dealing, managing, arranging, advising, and custody of securities. It also provides payroll payment and vendor registration services; and debit, credit, medad, and household labor cards, as well as e-services. It operates through a network of 111 banking branches and 177 exchange and remittance centers. The company was founded in 2004 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "3952-12711",
        "website": "http://www.bankalbilad.com",
        "full_time_employees": 3547
    },
    "1150.SR": {
        "short_name": "Alinma Bank",
        "long_name": "Alinma Bank",
        "summary": "Alinma Bank provides banking and investment services in the Kingdom of Saudi Arabia. It operates through Retail Banking, Corporate Banking, Treasury, and Investment and Brokerage segments. The company provides various retail services, including current, family, education, and savings accounts; self-service banking, such as internet, mobile, and phone banking services; debit, credit, traveler, and prepaid cards; point of sale services; car, real estate, personal, and education financing; and bill payment services. It also offers treasury, letters of guarantee, documentary collection, import and export letters of credit, and guarantee verification services; cash management services; corporate partner services; finance and investment products; financial services to small and medium enterprises (SMEs); and payroll management, point of sale, and payment gateway services. In addition, the company provides investment management, asset management, custodianship, advisory, underwriting, and brokerage services; and operates as an insurance agent. Alinma Bank offers its services to individuals, corporates, SMEs, and institutional customers. As of December 31, 2020, the company served through its network of 98 branches. Alinma Bank was founded in 2006 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11586",
        "website": "http://www.alinma.com",
        "full_time_employees": 2592
    },
    "1182.SR": {
        "short_name": "Amlak International for Real Es",
        "long_name": "Amlak International for Real Estate Finance Company",
        "summary": "Amlak International for Real Estate Finance Company provides real estate finance in Saudi Arabia. The company operates through Retail and Corporate segments. It also provides finance products to small and medium sized businesses, and individuals; and financing products to corporate, high net worth individuals, and institutional customers. Amlak International for Real Estate Finance Company was founded in 2007 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Mortgage Finance",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": null,
        "website": "http://www.amlakint.com",
        "full_time_employees": null
    },
    "1202.SR": {
        "short_name": "Middle East Paper Co.",
        "long_name": "Middle East Company for Manufacturing and Producing Paper",
        "summary": "Middle East Company for Manufacturing and Producing Paper, together with its subsidiaries, produces and sells container boards and industrial papers in the Kingdom of Saudi Arabia, the Middle East, Africa, Asia, and Europe. The company operates through two segments, Manufacturing and Trading. It offers MEPFLUTE high performance fluting, MEPLINER test liner, MEPDUAL dual use, MEPKRAFT Kraft liner board, and MEPWHITE white top test liner products for use in beverages, consumer durables, detergents, industrial goods, and processed food industries. The company also provides MEPCHEM semi-chemical fluting products for frozen and fresh food applications; MEPLAMINATE absorbent Kraft products for laminated furniture and shelves, and counters and floors; and MEPGYPSUM plasterboard liners for interior wall lining systems. In addition, it offers MEPCORE core boards for film, tape and label, textiles, and paper applications. Further, the company is involved in the wholesale and retail of paper and used paper, carton, and plastic waste products. Middle East Company for Manufacturing and Producing Paper was founded in 2000 and is based in Jeddah, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21438",
        "website": "http://www.mepco.biz",
        "full_time_employees": null
    },
    "1211.SR": {
        "short_name": "Saudi Arabian Mining Co.",
        "long_name": "Saudi Arabian Mining Company (Ma'aden)",
        "summary": "Saudi Arabian Mining Company (Ma'aden), together with its subsidiaries, operates as a multi-commodity mining company in the Kingdom of Saudi Arabia and internationally. It operates through Phosphate, Aluminium, and Precious and Base Metals segments. The company primarily mines for gold, phosphate rock, bauxite, low-grade bauxite, kaolin, and magnesite, as well as copper, zinc, and silver concentrates. It principally holds interests in the Mahd Ad-Dahab, Bulghah, Al-Amar, Sukhaybarat, As Suq, Ad Duwayhi, Al-Jalamid, Al-Khabra, Az Zabirah, Al-Ghazallah, and Al-Ba'itha mines. The company also produces aluminum ingots, T-shape ingots, slabs, sheets, and billets; and urea, phosphate, and potassium fertilizer, as well as manages and develops infrastructure projects. Saudi Arabian Mining Company (Ma'aden) was founded in 1997 and is based in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11537",
        "website": "http://www.maaden.com.sa",
        "full_time_employees": null
    },
    "1213.SR": {
        "short_name": "Naseej International Trading Co",
        "long_name": "Naseej International Trading Company",
        "summary": "Al Sorayai Trading and Industrial Group Company engages in the manufacture, wholesale, and retail trade of carpets and rugs. The company also imports and sells textiles, curtains, and blankets, as well as polypropylene yarns and threads. It also offers its products online. The company was founded in 1953 and is based in Jeddah, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21441",
        "website": "http://www.al-sorayai.com",
        "full_time_employees": null
    },
    "1214.SR": {
        "short_name": "Al Hassan Ghazi Ibrahim Shaker ",
        "long_name": "Al Hassan Ghazi Ibrahim Shaker Company",
        "summary": "Al Hassan Ghazi Ibrahim Shaker Company, together with its subsidiaries, engages in the trading, wholesale, and maintenance of spare parts, electronic equipment, household equipment, and air-conditioners in Saudi Arabia, Jordan, and the United Arab Emirates. The company operates through three segments: Heating, Ventilation and Air-Conditioning Solutions; Home Appliances; and All Other. The Heating, Ventilation and Air-Conditioning Solutions segment offers residential and commercial air conditioners, including chillers and related services. The Home Appliances segment provides televisions, washing machines, dryers, refrigerators, irons, gas cookers, and floor care. The All Other segment offers energy solutions and mobiles. The company provides agency services to LG air conditioners, as well as other home appliances brands, including Indesit, Ariston, Maytag, Bompani, Midea, and Panasonic. In addition, it engages in importing, manufacturing, and distributing service of air conditioners and home appliances. The company offers its products through a network of sales outlets, service centers, warehousing facilities, and training academies, as well as a network of distributors, such as specialty retailers and hypermarkets. Al Hassan Ghazi Ibrahim Shaker Company was founded in 1950 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11422",
        "website": "http://www.shaker.com.sa",
        "full_time_employees": null
    },
    "1301.SR": {
        "short_name": "United Wire Factories Co.",
        "long_name": "United Wire Factories Company",
        "summary": "United Wire Factories Company manufactures and sells steel wire products for the civil, agricultural, and industrial sectors in the Kingdom of Saudi Arabia. The company provides steel rebars, wire meshes, ladder meshes, nails, and fences, as well as tying, concertina, and barbed wires for use in the construction and building materials sector. It also offers bailing and black annealed wires, cloth hangers, welded wire mesh sheets and rolls, and staple clips for use in civil sector; and black drawn, galvanized, PVC coated, and deformed wires for use in industrial products. In addition, the company also offers lattice wires, metal braiding wires, reinforcing steel bars, reinforcing steels, metal strips, plastic tapes, oxygen wires, metal bondings, and woods, as well as carpentry, iron, angles, rectangles, rectification, cutting, reinforcing, smelting, and rolling of iron, and import and export. United Wire Factories Company was founded in 1990 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11383",
        "website": "http://unitedwires.com.sa",
        "full_time_employees": 472
    },
    "1302.SR": {
        "short_name": "Bawan Co.",
        "long_name": "Bawan Company",
        "summary": "Bawan Company manufactures and sells building materials to infrastructure, industrial, and commercial and residential development projects in Saudi Arabia, the Arab Gulf, the Middle East, and North Africa. It operates through Metal and Wood, Plastic, Electrical, and Concrete segments. It engages in cutting and bending custom-made steel; manufacturing stainless steel wires and resin epoxy corrosion resistant steel re-bars; iron formation activities; production of corrugated sheets, forming steel bars, wire rod coils, and cold and hot rolled coils; and provision of hand trucks and trolleys, plastering nets, decorative metal pipes, metal props and steel frame scaffolds, metal doors, sliding gates, aluminum doors and windows, hanging aluminum and glass products, ceiling domes, and building claddings. It provides various wood products, including wooden panels covered with melamine; wooden decorative panels; wood packaging materials, such as wooden pallets, packaging boxes, cable drums, and others; and doors, cabinets, and supplementary wooden and hardware products. It offers oil filled electrical hermetically sealed transformers; medium and low voltage electrical products, power substations, electric automation systems, electric safety and security systems, and low-current systems; and electrical transformers. It provides precast and pre-stressed products comprising twin tiles, stairways, concrete columns and beams, concrete tiles, pre-stressed concrete sections, reinforced concrete beams, insulated concrete forms, sidewalk tiles, precast concrete panels, hollow ceilings, concrete columns, bridges, load-bearing walls, retaining walls, fences, concrete traffic barriers, aesthetic concrete elements, car bumpers, architectural wall claddings, and insulating walls and stairways, as well as ready-mix concrete products. It offers plastic packaging and insulation products, and logistics services. The company founded in 1980 and is headquartered in Riyadh, Saudi Arabia. Bawan Company operates as a subsidiary of Atheel Holding Co.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": null,
        "website": "http://www.bawan.com.sa",
        "full_time_employees": null
    },
    "1320.SR": {
        "short_name": "Saudi Steel Pipe Co.",
        "long_name": "Saudi Steel Pipes Company",
        "summary": "Saudi Steel Pipes Company manufactures and sells steel pipes in Saudi Arabia and internationally. It operates through Steel Pipe and Process Equipment segments. The Steel Pipe segment manufactures welded steel pipes by high frequency induction welding and galvanizing, coating, threading, and bending of the pipes used in oil and gas, water, and construction sectors. The Process Equipment segment designs, manufactures, assembles, and maintains heavy process equipment for the utilization of oil and gas, power generation, desalination, mining, solar energy, and offshore plants. The company manufactures black and galvanized steel pipes, ERW/HFI galvanized and threaded steel pipes and seamless pipes, pipes with three-layer external coating by polyethylene and polypropylene in different diameters, pipes with epoxy coating inside, bended pipes in different diameters, space frames, and submerged arc welded pipes, as well as stationary process equipment. It also wholesales iron and steel tubes and hollow shapes; ferrous and non-ferrous metal pipes and accessories; locks, hinges, and other hand tools and metal accessories; and construction and metal materials. Saudi Steel Pipes Company was incorporated in 1980 and is headquartered in Dammam, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Dammam",
        "zipcode": "31326",
        "website": "http://www.sspipe.com",
        "full_time_employees": null
    },
    "1330.SR": {
        "short_name": null,
        "long_name": "Abdullah Abdul Mohsin Al-Khodari Sons Company",
        "summary": "Abdullah Abdul Mohsin Al-Khodari Sons Company operates as a general contracting company in the Middle East. The company is primarily involved in civil engineering, roads and bridges, railways, buildings and infrastructure, water and waste water treatment, oil and gas pipelines in support of petrochemical production, city cleaning and environment, land transportation, and operation and maintenance activities. It also undertakes resorts and housing projects. The company was founded in 1966 and is headquartered in Al Khobar, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Al Khobar",
        "zipcode": "31952",
        "website": "http://www.alkhodari.com",
        "full_time_employees": null
    },
    "1810.SR": {
        "short_name": "Seera Group Holding",
        "long_name": "Seera Holding Group",
        "summary": "Seera Holding Group, together with its subsidiaries, provides travel and tourism services primarily in the Kingdom of Saudi Arabia, the United Kingdom, Egypt, the United Arab Emirates, Spain, and Lebanon. The company operates through Ticketing, Tourism, Transportation, Property Rentals, and Hospitality segments. It offers air, ferry, and train ticketing services; hotel booking, package holidays, and rooms on rent; car rental, chartered flights, and delivery of shipments services; and property investment and rental services. The company is also involved in event management, IT support, advertising, insurance brokerage, and triptique and international driving license business; and ownership and operation of aircraft, and sports business association activities. It also provides cargo, telecommunication, and hospitality services; SMS/MMS services; online shopping services for fashion and accessories; Hajj and Umrah tours services; and professional drivers. The company offers its products and services under the Discover Saudi, Almosafer, tajawal, Elaa, Mawasim, and Lumi brands. The company was formerly known as Al Tayyar Travel Group Holding Company and changed its name to Seera Holding Group in April 2019. Seera Holding Group was founded in 1979 and is based in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": null,
        "website": "http://www.seera.sa",
        "full_time_employees": null
    },
    "1820.SR": {
        "short_name": "Abdulmohsen Alhokair Group for ",
        "long_name": "Abdulmohsen Al-Hokair Group for Tourism and Development Company",
        "summary": "Abdulmohsen Al-Hokair Group for Tourism and Development Company operates primarily in the hospitality and entertainment sectors in the Kingdom of Saudi Arabia and the United Arab Emirates. It operates hotels and resorts, restaurants, and meeting and event venues. The company was founded in 1965 and is based in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11584",
        "website": "http://www.alhokair.com",
        "full_time_employees": null
    },
    "1830.SR": {
        "short_name": "Leejam Sports Co",
        "long_name": "Leejam Sports Company",
        "summary": "Leejam Sports Company owns, operates, and manages sports and fitness centers in the Kingdom of Saudi Arabia and the United Arab Emirates. The company primarily operates seven brands, including Fitness Time Plus, a fitness center for high net worth individuals; Fitness Time, a business class center; Fitness Time Pro, an economy class center for fitness professionals; Fitness Time Junior, a special center for kids and youth; Fitness Time Ladies; Fitness Time Ladies Pro; and Fitness Time Academy, a football and team-sports training center for young athletes. As of January 28, 2021, it operated approximately 137 fitness centers. The company was founded in 2005 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11351",
        "website": "http://www.leejam.com.sa",
        "full_time_employees": null
    },
    "1831.SR": {
        "short_name": "Maharah Human Resources Co.",
        "long_name": "Maharah for Human Resources Company",
        "summary": "Maharah for Human Resources Company offers recruitment services for public and private sectors in the Kingdom of Saudi Arabia and the United Arab Emirates. It operates in two segments, Corporate and Individual. The Corporate segment provides labor force services to various industries comprising retail, hospitality, healthcare, operation and maintenance, and banking. The Individual segment offers worker rental services; and khidma, a program for providing part-time housekeepers and home care nurses on an hourly basis, as well as full-time home care nurses. Maharah for Human Resources Company also offers building cleaning services; and operates an online recruitment platform. The company was formerly known as Maharah Foreign Recruitment Company and changed its name to Maharah for Human Resources Company in April 2017. Maharah for Human Resources Company was founded in 2013 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "13325",
        "website": "http://www.maharah.com",
        "full_time_employees": null
    },
    "2001.SR": {
        "short_name": "Methanol Chemicals Co.",
        "long_name": "Methanol Chemicals Company",
        "summary": "Methanol Chemicals Company manufactures and sells methanol derivatives, formaldehyde derivatives, plasticizers, and various amino resins in the Middle East and internationally. It offers aqueous formaldehyde solution, urea formaldehyde concentrates, hexamethylene tetramine, paraformaldehyde, liquid and powder formaldehyde resins, and phenol formaldehyde resins, as well as urea and melamine formaldehyde powder resins, melamine urea formaldehyde powder resins, sulphonated naphthalene formaldehyde liquid and powder, and sulphonated melamine formaldehyde liquid. The company also provides methanol, carbon monoxide, monomethylamine, di-methylamine, tri-mon-methylamine, dimethylformamide, di-methyl carbon, pentaerythritol, sodium formate, and acetaldehyde. Its products have applications in agricultural fertilizers, pharmaceuticals, solvents, intermediates, the laminates/wood industry, plastics, paper, and the production of concrete admixtures. The company was formerly known as Saudi Formaldehyde Chemical Company Limited. Methanol Chemicals Company was founded in 1989 and is headquartered in Dammam, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Dammam",
        "zipcode": "31471",
        "website": "http://chemanol.com",
        "full_time_employees": null
    },
    "2010.SR": {
        "short_name": "Saudi Basic Industries Corp",
        "long_name": "Saudi Basic Industries Corporation",
        "summary": "Saudi Basic Industries Corporation manufactures, markets, and distributes chemicals, polymers, plastics, agri-nutrients, and metal products worldwide. The company operates through Petrochemicals & Specialties, Agri-Nutrients, and Hadeed segments. It offers polymers, such as acrylonitrile butadiene styrene, acrylonitrile styrene acrylate, carbon black, metallocene polyethylene, polybutylene terephthalate, polycarbonate, polycarbonate/acrylonitrile-butadiene-styrene, polyethylene terephthalate, polymethyl methacrylate, polyoxymethylene, polypropylene, polystyrene, polyethylene, polyvinyl chloride, and synthetic rubbers. The company also provides engineering thermoplastic resins and compounds, composites, thermosets and additives, copolymers, and additive manufacturing solutions. In addition, it offers chemicals, including aromatics, chlor-alkali, ethanolamines, ethoxylates, glycols, linear alpha olefins, natural detergent alcohol, olefins and gases, OXO alcohols and performance monomers, and oxygenates. Further, the company provides fertilizers comprising urea, ammonia, and a portfolio of nitrogen-based inorganic products; produces steel products, such as hot and cold rolled flat products, and long products; operates e-business portal for sales; and offers color services under the ColorXpress name. It serves agriculture, automotive, building and construction, consumer, electrical and electronics, healthcare, industrial, mass transportation, and packaging industries. The company was incorporated in 1976 and is headquartered in Riyadh, Saudi Arabia. Saudi Basic Industries Corporation is a subsidiary of Saudi Arabian Oil Company",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11422",
        "website": "http://www.sabic.com",
        "full_time_employees": null
    },
    "2020.SR": {
        "short_name": "SABIC Agri-Nutrients Co.",
        "long_name": "SABIC Agri-Nutrients Company",
        "summary": "SABIC Agri-Nutrients Company engages in the production, conversion, marketing, and trade of fertilizers in Saudi Arabia and internationally. The company offers urea; ammonia; and nitrogen-based inorganic products, including DAP, MAP, 2-ethyl hexanol, dioctyl phthalate, and other products. It serves industrial, agriculture, automotive, building and construction, consumer electrical and electronics, healthcare, industrial, mass transportation, packaging sectors. SABIC Agri-Nutrients Company was formerly known as Saudi Arabian Fertilizers Company. The company was incorporated in 1965 and is headquartered in Jubail, Saudi Arabia. SABIC Agri-Nutrients Company is a subsidiary of National Chemical Fertilizers Company.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jubail",
        "zipcode": "31961",
        "website": "http://www.safco.com.sa",
        "full_time_employees": null
    },
    "2030.SR": {
        "short_name": "Saudi Arabia Refineries Co.",
        "long_name": "Saudi Arabia Refineries Co.",
        "summary": "Saudi Arabia Refineries Co. engages in the extraction of crude oil in the Kingdom of Saudi Arabia. It is also involved in the construction of refineries and petrochemical plants; buying and selling of lands and real estate; and management and leasing of non-residential real estate properties, as well as dealing in securities. Saudi Arabia Refineries Co. was founded in 1960 and is based in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "23215",
        "website": "http://www.almasafi.com.sa",
        "full_time_employees": null
    },
    "2040.SR": {
        "short_name": "Saudi Ceramic Co.",
        "long_name": "Saudi Ceramic Company",
        "summary": "Saudi Ceramic Company manufactures and sells ceramic products, water heaters, and other products in Saudi Arabia and internationally. The company offers floor tiles; sanitary ware, such as wash basins, water closets, seat covers, flushing mechanisms, and wash basin mixers; bathroom accessories, including soap holders, towel rods, tissue roll dispensers, shower heads, shattafs, robe hooks, and mirrors; and other products comprising bathtubs, shower trays, bath mixers, and electrical products. It also provides electric, smart, and solar water heaters, as well as spare parts; ceramic road markers; and plastics and acrylics; boilers, special paints for ceramic products, red pottery bricks and derivatives, plastic and ceramic pipes; and drinking water coolers, bathtubs, plastic and ceramic showers, plastic road signs, and various construction and housing project solutions. In addition, the company engages in the extraction, processing, formation, and marketing of raw materials, including silica sand, dolomite, feldspar, red clay, kaolin, limestone, gypsum powder, sandstone, and sand; quarry and mining sites management; construction and management of crushers and mills in raw material sites; and collection of various materials for recycling, including recycling and collection of waste and materials. Further, it is involved in the import, wholesale and retail trade, and electronic commerce of building materials and other products for government and private enterprises. Additionally, the company engages in the construction, repair, reconstruction, and installation of factories and laboratories, and buildings; prefabricated concrete; installation of machinery, equipment, and industrial machinery; and project implementation; repair of vehicles; and operation of restaurants. It offers its products through distributors and wholesalers, as well as through a network of 30 showrooms. The company was founded in 1977 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11481",
        "website": "http://www.saudiceramics.com",
        "full_time_employees": null
    },
    "2050.SR": {
        "short_name": "SAVOLA Group",
        "long_name": "Savola Group Company",
        "summary": "Savola Group Company, through its subsidiaries, manufactures and distributes food products in the Middle East, North Africa, and Turkey region. The company operates through five segments: Food Processing, Retail, Food Services, Frozen Foods, and Investments. It offers edible oils, vegetable oils, sugar, pasta, bakery products, specialty fats, seafood, confectionery, and frozen food products. The company also engages in the agro cultivation, services and maintenance, trading and distribution, and real estate related investment activities. In addition, it retails groceries through a chain of hypermarkets, supermarkets, and convenience stores. The company was founded in 1979 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "23511-7333",
        "website": "http://www.savola.com",
        "full_time_employees": null
    },
    "2060.SR": {
        "short_name": "National Industrialization Co.",
        "long_name": "National Industrialization Company",
        "summary": "National Industrialization Company operates in the petrochemicals, chemicals, plastics, engineering, and metals sectors worldwide. The company operates in three segments: Chemical, Petrochemical, and Downstream & Others. It manufactures and sells titanium dioxide, sulphuric acid, titanium chemicals, ultrafine titanium dioxide products, and titanium metal powder; mineral sands; ethylene, polyethylene, propylene, and polypropylene; acrylic acid; lead and sodium sulfate; and plastic sheets. The company also offers technical industrial services; manufactures steel and non-steel castings; produces towed steel wires, spring wires, steel wires for cables, and twisted reinforcement wires to carry the electrical conductors, as well as for use in concrete and welding wires; and produces and markets dry and liquid batteries for vehicles and industrial use. In addition, it conducts technical tests on industrial facilities; chemical, petrochemical, and metal plants; and water desalination and electricity generating plants, as well as sets up various plastic industries. Further, the company engages in the inspection of mechanical equipment and industrial instruments, quality management, and environment systems; provides academic training, information technology consultancy, and laboratory testing services; gathers, recycles, and sells used and damaged batteries, lead, plastics, industrial materials, and environmental waste; produces and markets acrylic boards; and markets and exports chemical, petrochemical, and plastic items. National Industrialization Company was founded in 1985 and is based in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11496",
        "website": "http://www.tasnee.com",
        "full_time_employees": null
    },
    "2070.SR": {
        "short_name": "Saudi Pharmaceutical Industries",
        "long_name": "Saudi Pharmaceutical Industries and Medical Appliances Corporation",
        "summary": "Saudi Pharmaceutical Industries and Medical Appliances develops, manufactures, and markets medicinal products and pharmaceutical formulations in the Kingdom of Saudi Arabia, Egypt, the Middle East, Morocco, and Algeria. The company is also involved in the manufacturing of basic chemical substances and products; medicines for human use, including cosmetics; and wholesale and retail of medicines and related products. In addition, it develops, manufactures, and sells pharmaceutical products and medical appliances; operates and maintains healthcare facilities. Further, the company engages in the research and development of medical science. The company was founded in 1986 and is headquartered in Buraydah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Buraydah",
        "zipcode": null,
        "website": "http://www.spimaco.com.sa",
        "full_time_employees": null
    },
    "2080.SR": {
        "short_name": "National Gas and Industrializat",
        "long_name": "National Gas & Industerialization Co.",
        "summary": "National Gas & Industerialization Co. engages in the transportation, filling, and marketing of liquefied petroleum gas primarily in Saudi Arabia. The company's products include underground and ground surface gas tanks; gas and fiber cylinders; gas cylinder and tank regulators; and liquid gas. It also provides installation, refill, and maintenance services; and manufactures, transfers, and markets petroleum products, chemicals, glass, and auto parts, as well as markets cylinders, empty tanks, related spare parts, and tank transportation equipment. In addition, the company is involved in the operation of equipment service centers; and the establishment and maintenance of petroleum equipment and vehicles. Its gases are also used for residential, industrial, agricultural, and commercial purposes. National Gas & Industerialization Co. was incorporated in 1963 and is based in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11421",
        "website": "http://www.gasco.com.sa",
        "full_time_employees": null
    },
    "2081.SR": {
        "short_name": "Alkhorayef Water and Power Tech",
        "long_name": "Alkhorayef Water & Power Technologies",
        "summary": "Alkhorayef Water & Power Technologies designs, constructs, operates, maintains, and manages water and wastewater projects in Saudi Arabia. It provides engineering, procurement, and construction; and operation and maintenance services. The company's services cover domestic and industrial wastewater plants, water treatment plants, water desalination plants, water and wastewater networks and house connections, filtration solutions and membrane systems, main water and sewage lines, strategic tanks, pump/lifting stations, electro-mechanical works, storm water, and water well projects. Its customers include government agencies and institutions, such as Ministry of Water and Electricity, National Water Company, MODON, Sabic, Aramco, Marafiq, Royal Commission, SWCC, Ministry of Defense, etc. The company is based in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11595",
        "website": "http://www.alkhorayef.com/en/Company/CompanyDetails/28",
        "full_time_employees": null
    },
    "2090.SR": {
        "short_name": "National Gypsum Co.",
        "long_name": "National Gypsum Company",
        "summary": "National Gypsum Company manufactures and sells gypsum and its derivatives in the Kingdom of Saudi Arabia and internationally. The company offers regular, and fire and moisture resistant plaster boards; and boards laminated with lead sheet. It also provides gypsum powder products, such as plastering, sprinkling, spraying machine, adhesive, agricultural, and other products. The company was founded in 1958 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11411",
        "website": "http://www.gypsco.com.sa",
        "full_time_employees": null
    },
    "2100.SR": {
        "short_name": "Wafrah for Industry and Develop",
        "long_name": "Wafrah for Industry and Development Company",
        "summary": "Wafrah for Industry and Development Company engages in manufacturing, canning, preserving, processing, and marketing food products in Saudi Arabia and internationally. It provides pasta products, potato chips, frozen French fries products, peanut products, and breakfast cereals, as well as frozen, chilled, and cooked meat products. The company markets its products under the Wafra, Caprini, Saudi Garden, and Nemah brands. It is also involved in the treatment and processing of agricultural products; and investment in land property. The company was formerly known as Food Products Company and changed its name to Wafrah for Industry and Development Company in 2014. Wafrah for Industry and Development Company was founded in 1989 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11383",
        "website": "http://www.wafrah.com",
        "full_time_employees": null
    },
    "2140.SR": {
        "short_name": "AYYAN Investment Co.",
        "long_name": "Ayyan Investment Company",
        "summary": "Ayyan Investment Company, together with its subsidiaries, engages in the construction of non-residential buildings in the Kingdom of Saudi Arabia. Its non-residential buildings include schools, hospital, hotels, etc. The company also establishes and operates health, education, tourism, and agricultural facilities; and establishes cold storage facilities, transport fleets, and gas stations. In addition, it maintains, manages, and operates industrial and residential properties, as well as hospitals, clinics, medical centers, and dispensaries; owns lands; and invests in securities. Further, the company produces and sells dates and its derivatives. The company was formerly known as Al Ahsa Development Company and changed its name to Ayyan Investment Company in July 2020. Ayyan Investment Company was founded in 1993 and is headquartered in Al Khobar, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Al Khobar",
        "zipcode": "31952",
        "website": "http://ayyan.com.sa",
        "full_time_employees": null
    },
    "2160.SR": {
        "short_name": "Saudi Arabian Amiantit Co.",
        "long_name": "The Saudi Arabian Amiantit Company",
        "summary": "The Saudi Arabian Amiantit Company, together with its subsidiaries, manufactures and sells various types of pipes and related products in Saudi Arabia, Europe, and internationally. The company operates in two segments, Pipe Manufacturing and Technology, and Water Management. It offers pipe system products, including glass reinforced polyester, glass reinforced vinylester, glass reinforced epoxy, ductile iron, thermoplastic, and reinforced concrete pipes; and develops and licenses related technologies. The company also manufactures and sells underground and aboveground tanks, such as water tanks, chemical tanks, septic tanks, and fuel tanks for residential and industrial applications; and supplies ribbed and non-ribbed, and single wall and double wall tanks, as well as installs underground tanks. In addition, it provides rubber rings and gaskets for the use in pipes and fittings; grommets and bushes for anti-vibration isolation and compression mounting in A/C systems; duct sealing units for use in air condition ducts; insulation tubes and sheets for thermal insulation in refrigeration, heating, ventilation, and air conditioning applications; and industrial valves for water applications. Further, the company offers manholes for the inspection and maintenance, ventilation, cleaning, and flushing of drains or sewers, as well as for housing of pumping stations and inlet drain pits; and fiberglass products, which are used in pipe and tank, transportation, construction, marine, electrical/electronic, wind energy, consumer goods, aerospace, etc. applications. Additionally, it provides water management, and related consultancy and engineering services. The company serves customers in the municipal and urban development, industrial, oil and gas, water transmission and distribution, and water well industries. The Saudi Arabian Amiantit Company was founded in 1968 and is headquartered in Dammam, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Dammam",
        "zipcode": "32234",
        "website": "http://www.amiantit.com",
        "full_time_employees": null
    },
    "2170.SR": {
        "short_name": "Alujain Holding  Corp.",
        "long_name": "Alujain Holding Corporation",
        "summary": "Alujain Holding Corporation manufactures and sells home care products in Saudi Arabia. It operates in two segments, Investments and Manufacturing Home-Care Products. The company offers home care products, such as spray starches and air fresheners; insecticides; and agricultural pesticides. It also manufactures petrochemical products. The company was formerly known as Alujain Corporation and changed its name to Alujain Holding Corporation in February 2020. Alujain Holding Corporation was founded in 1991 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "12333",
        "website": "http://www.alujain.sa",
        "full_time_employees": null
    },
    "2180.SR": {
        "short_name": "Filing and Packing Materials Ma",
        "long_name": "Filling and Packing Materials Manufacturing Company",
        "summary": "Filling and Packing Materials Manufacturing Company develops, produces, and sells jumbo bags and other woven poly-propylene packaging products for industrial, agricultural, and general applications in the Kingdom of Saudi Arabia and internationally. It offers jumbo bags for packing, handling, storage, and transport of materials in bulk quantities; small PP woven bags for packing fertilizers, feeds, grains, barley, flour, salt, sugar, seeds, and other lumpy and fine materials; and valve bags for packing cement, chemical material, feeds, fertilizers, etc. The company also provides strapping bands, which are used to strap small and big boxes, bales, bricks, and various other products; and cable filler yarns and sewing threads used in the manufacture of electric cables. In addition, it offers flame-retardant and conductive fabrics and sacks, including tubular rolls or sheets; and container liner products for transport of dry flow able products. Filling and Packing Materials Manufacturing Company was founded in 1991 and is based in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11492",
        "website": "http://fipco.com.sa",
        "full_time_employees": null
    },
    "2200.SR": {
        "short_name": "Arabian Pipes Co.",
        "long_name": "Arabian Pipes Company",
        "summary": "Arabian Pipes Company manufactures and markets welded steel pipes for oil and gas, structural, and commercial applications primarily in the Kingdom of Saudi Arabia. The company offers electric resistant welded/HFW, longitudinal submerged-arc welded carbon steel, external coating, threading and coupling, and slitting pipes. It also exports its products to Gulf countries, the Middle East, and North Africa. The company was formerly known as Saudi Joint Stock Co. Arabian Pipes Company was founded in 1991 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11551",
        "website": "http://www.arabian-pipes.com",
        "full_time_employees": null
    },
    "2210.SR": {
        "short_name": "Nama Chemicals Co.",
        "long_name": "Nama Chemicals Co.",
        "summary": "NAMA Chemicals Company, together with its subsidiaries, owns, operates, and manages industrial projects in the petrochemical and chemical sectors in Saudi Arabia and internationally. The company operates through Epoxi Resin Products, Chlor Alkali Products, and Others segments. It provides epoxy, a thermosetting polymer; and anhydrous caustic soda, an indispensable inorganic chemical used in various applications by industries in chemical production, petroleum and natural gas processing, textile finishing process, cleaning products, food processing, beverages, pharmaceuticals, and municipal water and sewage treatment. The company also offers epichlorohydrin, a reactive organic compound for use in the production of epoxy and phenoxy resins, and other polymers, as well as used as a solvent for cellulose, resins, and paints; and other chemical products, such as calcium chloride, hydrochloric acid, and sodium hypochlorite. In addition, it is involved in the real estate business. NAMA Chemicals Company was founded in 1992 and is based in Jubail, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jubail",
        "zipcode": "31961",
        "website": "http://www.nama.com.sa",
        "full_time_employees": null
    },
    "2220.SR": {
        "short_name": "National Metal Manufacturing an",
        "long_name": "National Metal Manufacturing and Casting Co.",
        "summary": "National Metal Manufacturing and Casting Co. manufactures and sells metal engineering products and services. The company offers high carbon steel wire products and PC strands for construction and infrastructure projects. It also provides axles for heavy transport vehicles; and various spare parts for the automotive industry. In addition, the company offers metal castings, including machined castings to the automotive, agri and water, crushing and mining, cement plant, oil and gas, engineering, and general manufacturing industries in Asia, the Middle East, and Europe; and technical and engineering services to the oil and gas, petrochemical, and general engineering industries. National Metal Manufacturing and Casting Co. was founded in 1989 and is headquartered in Jubail, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jubail",
        "zipcode": "31961",
        "website": "http://maadaniyah.com",
        "full_time_employees": null
    },
    "2222.SR": {
        "short_name": "Saudi Arabian Oil Co.",
        "long_name": "Saudi Arabian Oil Company",
        "summary": "Saudi Arabian Oil Company operates as an integrated oil and gas company in the Kingdom of Saudi Arabia and internationally. The company operates through two segments, Upstream and Downstream. The Upstream segment explores, develops, produces, and sells crude oil, condensate, natural gas, and natural gas liquids (NGLs). As of December 31, 2019, its reserves included 258.6 billion barrels of oil equivalent, including 201.9 billion barrels of crude oil and condensate; 25.7 billion barrels of NGLs; and 190.6 trillion standard cubic feet of natural gas, as well as 510 reservoirs within 138 fields distributed throughout the Kingdom and its territorial waters. The Downstream segment produces various chemicals, including ethylene, ethylene glycol, ethylene oxide, methanol, methyl tertiary butyl ether, polyethylene and engineering plastics and their derivatives, and other products; and base oils, as well as in the refining and retail operations. It also supplies oil products; and trades in refined petroleum and liquid chemical products, and polymers. The company also develops, manufactures, and markets high-performance rubber; and provides crude oil storage, financial, and marine management and transportation services. Saudi Arabian Oil Company was founded in 1933 and is headquartered in Dhahran, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Dhahran",
        "zipcode": "31311",
        "website": "http://www.aramco.com",
        "full_time_employees": null
    },
    "2240.SR": {
        "short_name": "Zamil Industrial Investment Co.",
        "long_name": "Zamil Industrial Investment Company",
        "summary": "Zamil Industrial Investment Company, together with its subsidiaries, engages in the design and engineering, manufacturing, and fabrication of construction materials, pre-engineering steel buildings, steel structures, air conditions, and climate control systems for commercial, industrial, and residential applications, as well as for telecom and broadcasting towers, process equipment, fiberglass, rockwool and engineering plastic foam insulation, and solar power projects. It operates through four segments: Air Conditioners Industry, Steel Industry, Insulation Industry, and Corporate and Others. The Air Conditioners Industry segment produces window, split, and central air conditioners; electrical and gas ovens; automatic dryers; microwave ovens; air-conditioning ducts/channels; household refrigerators; and automatic washing machines, as well as engages in the installation, maintenance, operation, and leasing of air conditioning and refrigeration systems. The Steel Industry segment engages in constructing, managing, and operating industrial projects, airports, and warehouses; constructing and providing fire protection services for building and structures; building, repairing, and maintaining the communication towers. This segment is also involved in the business of steel sheets works, heavy equipment and its spare parts, and storage tanks; installation of containers and pumps; and implementation of electric works. The Insulation Industry segment engages in the production of insulation products, including fiberglass for thermal insulation of central air conditioners, pre-insulated pipes, glass wool, rock wool, and engineering plastic foam insulations. The Corporate and Others segment is involved in the provision of corporate and shared services, as well as training and investment activities. It operates in Saudi Arabia, other Asian countries, and Africa. Zamil Industrial Investment Company was founded in 1998 and is headquartered in Dammam, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Dammam",
        "zipcode": "31424",
        "website": "http://www.zamilindustrial.com",
        "full_time_employees": null
    },
    "2270.SR": {
        "short_name": "Saudia Dairy and Foodstuff Co.",
        "long_name": "Saudia Dairy & Foodstuff Company",
        "summary": "Saudia Dairy & Foodstuff Company engages in the production and distribution of dairy products, beverages, and various foodstuffs in the Kingdom of Saudi Arabia, Poland, and other Gulf and Arab countries. It operates through Drinks and NonÂ\u0096Drinks segments. The company offers milk and milk powder, soy drinks, laban, evaporated milk, cheese, cream, fruit drinks, ice cream, butter, tomato products, French fries, and snacks. It provides its products under the Saudia, Crispy, Majestique, and Baboo brands. The company was founded in 1976 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21422",
        "website": "http://www.sadafco.com",
        "full_time_employees": 2426
    },
    "2280.SR": {
        "short_name": "Almarai Co.",
        "long_name": "Almarai Company",
        "summary": "Almarai Company, together with its subsidiaries, operates as an integrated consumer food and beverage company in Saudi Arabia, Egypt, Jordan, and rest of Gulf Cooperation Council countries. The company operates through Dairy and Juice, Bakery, Poultry, and Other Activities segments. It offers dairy, fruit juice, and related food products under the Almarai, Joosy Life, Beyti, and Teeba brand names; bakery products under the L'usine and 7 Days brand names; and poultry products under the Alyoum and AlBashayer brand names. The company also engages in the arable and horticulture activities; and provision of infant nutrition products under the Nuralac and Evolac brand names. Almarai Company was founded in 1977 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11492",
        "website": "http://www.almarai.com",
        "full_time_employees": 36869
    },
    "2290.SR": {
        "short_name": "Yanbu National Petrochemical Co",
        "long_name": "Yanbu National Petrochemical Company",
        "summary": "Yanbu National Petrochemical Company manufactures and sells petrochemical products in Saudi Arabia. It provides ethylene, propylene, mono ethylene glycol, di ethylene glycol, tri ethylene glycol, polypropylene, low linear density polyethylene, high density polyethylene, butene 1, butene 2, MTBE, benzene, and TX. The company was founded in 2006 and is based in Yanbu, Saudi Arabia. Yanbu National Petrochemical Company is a subsidiary of Saudi Basic Industries Corporation.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Yanbu",
        "zipcode": "51000",
        "website": "http://www.yansab.com.sa",
        "full_time_employees": null
    },
    "2310.SR": {
        "short_name": "Sahara International Petrochemi",
        "long_name": "Sahara International Petrochemical Company",
        "summary": "Sahara International Petrochemical Company owns, establishes, operates, and manages industrial projects related to chemical and petrochemical industries in the Kingdom of Saudi Arabia and internationally. The company operates through Basic Chemicals, Intermediate Chemicals, Polymers, Trading, and Corporate and Others segments. It offers basic products, including methanol, butane, tetrahydrofuran, maleic anhydride, carbon monoxide, and gamma butyrolactone; and intermediate products, such as acetic acid, acetic anhydride, vinyl acetate monomer, dichloroethane, and caustic soda, as well as ethyl and butyl acetates. The company also provides polymer products consisting of low-density polyethylene (LDPE), ethylene vinyl acetate, polyvinyl acetate, polyvinyl alcohol, cross linkable and semi-conductive LDPE compounds, polypropylene, and polybutylene terephthalate. In addition, it markets and distributes other petrochemical products; offers electrical connecting wire products; and manufactures and sells molds and dies, and related services, as well as produces ethylene-vinyl acetate films. The company was formerly known as Saudi International Petrochemical Company and changed its name to Sahara International Petrochemical Company in May 2019. Sahara International Petrochemical Company was incorporated in 1999 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11383",
        "website": "http://www.sipchem.com",
        "full_time_employees": null
    },
    "2340.SR": {
        "short_name": "Al Abdullatif Industrial Invest",
        "long_name": "Al Abdullatif Industrial Investment Company",
        "summary": "Al Abdullatif Industrial Investment Company, together with its subsidiaries, manufactures and sells carpets worldwide. The company offers tufted and woven carpets, BCF yarns, carpet backings, masterbatches and colors, paper tubes, blankets, and rugs. It sells its products directly to manufacturers, exporters, importers, and retailers. The company was formerly known as Saudi Carpet Factory and changed its name to Al Abdullatif Industrial Investment Company in 2007. The company was founded in 1981 and is based in Riyadh, the Kingdom of Saudi Arabia. Al Abdullatif Industrial Investment Company is a subsidiary of Al-Abdullatif Group Holding Company.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11421",
        "website": "http://www.carpets.com",
        "full_time_employees": null
    },
    "2350.SR": {
        "short_name": "Saudi Kayan Petrochemical Co.",
        "long_name": "Saudi Kayan Petrochemical Company",
        "summary": "Saudi Kayan Petrochemical Company manufactures chemicals, polymers, and specialty products. The company offers ethylene for use as a feed stock for polyethylene and ethylene glycol; propylene for use as a feed stock for polypropylene and cumene; benzene for use as a feed stock for cumene plant; polypropylene for automotive, electric appliances, hot water pipe systems fibers, and film wraps; and high and low density polyethylene for automotive gasoline tanks, pipes, bottles, and containers. It also provides ethylene oxide for use as a feed stock to ethylene glycols, polycarbonates, and ethanolamines; monoethylene glycol for use in polyester fibers, soft drinks packaging, antifreeze and coolants, heat transfer fluids, and chemical intermediates; diethylene glycol used in unsaturated polyester resin, polyurethane, plasticizer, grinding aid, gas dehydration, printing ink, and paint pigment manufacturing; and triethylene glycol for the dehydration of industrial gases and solvents, and plasticizers. In addition, the company offers cumene used as a feed stock to phenol plant; phenol for use as a feed stock to Bisphenol-A plant; acetone used in solvents, and BPA and methyl methacrylate manufacturing; bisphenol A for use in polycarbonates and epoxy resins; and polycarbonate for use in optical media, construction and housing, automotive, aircraft, electronic components, lenses, toys, hobby items, and medical appliances. Further, it provides diethanolamine, diethanolamine, and monoethanolamine used in gas sweetening, detergent and specialty cleaning formulations, concrete mixtures, foam catalysts, pharmaceuticals, personal care products, and herbicides; ethoxylates for the detergent, paint, and leather industries; N-butanol for use in solvents, plasticizers, and coatings; iso-butanol used in direct solvents, chemical intermediates, and additives; and natural detergent alcohol for use in detergents. The company was founded in 2007 and is headquartered in Jubail, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jubail",
        "zipcode": "31961",
        "website": "http://www.saudikayan.com",
        "full_time_employees": null
    },
    "2360.SR": {
        "short_name": "Saudi vitrified clay pipes co.",
        "long_name": "Saudi Vitrified Clay Pipe co.",
        "summary": "Saudi Vitrified Clay Pipe co. manufactures and sells vitrified clay pipes and fittings in Saudi Arabia and internationally. It offers pipes, perforated pipes, flexible joints, junctions, bends, special fittings, and accessories. The company was founded in 1977 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11442",
        "website": "http://www.svcp-sa.com",
        "full_time_employees": null
    },
    "2380.SR": {
        "short_name": "Rabigh Refining and Petrochemic",
        "long_name": "Rabigh Refining and Petrochemical Company",
        "summary": "Rabigh Refining and Petrochemical Company engages in the development, construction, and operation of an integrated refining and petrochemical complex in the Middle East, the Asia Pacific, and internationally. The company operates through Refined Products and Petrochemicals segments. It offers polymers, such as linear low density polyethylene, high density polyethylene, homopolymer polypropylene, and impact copolymer polypropylene; and monomers, including propylene oxide and mono ethylene glycol. The company also provides refined products comprising liquefied petroleum gas, naphtha, gasoline, gas oil, fuel oil, and kerosene. Its products are used in various end products, such as plastics, detergents, lubricants, resins, coolants, anti-freeze, paint, carpets, rope, clothing, shampoo, auto interiors, epoxy glue, insulation, film, fibers, household appliances, packaging, candles, pipes, and other applications. The company was founded in 2005 and is based in Rabigh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Rabigh",
        "zipcode": "21911",
        "website": "http://www.petrorabigh.com",
        "full_time_employees": null
    },
    "3001.SR": {
        "short_name": "Hail Cement Co.",
        "long_name": "Hail Cement Company",
        "summary": "Hail Cement Company manufactures and sells cement in the Kingdom of Saudi Arabia and internationally. It offers ordinary Portland, sulphate resistant, and masonry cement. The company was founded in 2010 and is headquartered in Hail, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Hail",
        "zipcode": null,
        "website": "http://hailcement.com",
        "full_time_employees": null
    },
    "3002.SR": {
        "short_name": "Najran Cement Co.",
        "long_name": "Najran Cement Company",
        "summary": "Najran Cement Company manufactures and sells cement products in the Kingdom of Saudi Arabia. The company offers ordinary Portland and cement resistant to salt. It also sells its products online. Najran Cement Company was founded in 2005 and is based in Najran, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Najran",
        "zipcode": "66256",
        "website": "http://www.najrancement.com",
        "full_time_employees": null
    },
    "3005.SR": {
        "short_name": "Umm Al-Qura Cement Co.",
        "long_name": "Umm Al-Qura Cement Company",
        "summary": "Umm Al-Qura Cement Company produces and sells cement products. It offers ordinary portland cement, buzlana cement, resistant cement, clinker, and cement finishing products. The company was founded in 2013 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": null,
        "website": "http://www.uacc.com.sa",
        "full_time_employees": null
    },
    "3007.SR": {
        "short_name": "Zahrat Al Waha for Trading Co.",
        "long_name": "Zahrat Al Waha For Trading Company",
        "summary": "Zahrat Al Waha For Trading Company produces and sells plastic bottles preforms and plastic caps. It operates in Asia, Africa, Europe, the Kingdom of Saudi Arabia, and Gulf countries. The company also exports its products. Zahrat Al Waha for Trading Company was founded in 2003 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "12814",
        "website": "http://www.zaoasis.com",
        "full_time_employees": null
    },
    "3008.SR": {
        "short_name": "Al Kathiri Holding Co.",
        "long_name": "Al Kathiri Holding Company",
        "summary": "Al Kathiri Holding Company manufactures, distributes, and transports cement and ready-made concrete to construction companies in the Kingdom of Saudi Arabia. It also distributes construction materials, such as gravel and various types of sand. The company was founded in 2008 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "13523-6695",
        "website": "http://www.alkathiriholding.com",
        "full_time_employees": null
    },
    "3010.SR": {
        "short_name": "Arabian Cement Co.",
        "long_name": "Arabian Cement Company",
        "summary": "Arabian Cement Company engages in the production, trading, and selling of cement primarily in Saudi Arabia and Jordan. It also provides building materials and other related products. The company was incorporated in 1955 and is based in Jeddah, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "23523-2113",
        "website": "http://www.arabiacement.com",
        "full_time_employees": null
    },
    "3020.SR": {
        "short_name": "Yamama Cement Co.",
        "long_name": "Yamama Saudi Cement Company",
        "summary": "Yamama Saudi Cement Company manufactures and sells cement in Saudi Arabia. It offers ordinary Portland, clinker and finishing, sulfate-resistant Portland, white and colored, oil-well, fast cementing Bozolani, and bacteric resistant cement. The company was founded in 1956 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11411",
        "website": "http://www.yamamacement.com",
        "full_time_employees": null
    },
    "3040.SR": {
        "short_name": "The Qassim Cement Co.",
        "long_name": "Qassim Cement Company",
        "summary": "Qassim Cement Company manufactures and sells cement and its derivatives and supplements in the Kingdom of Saudi Arabia. It offers ordinary Portland, Portland pozzolana, sulphate resistant, finishing, and limestone cement. The company was founded in 1976 and is headquartered in Buraydah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Buraydah",
        "zipcode": "52271-6735",
        "website": "http://www.qcc.com.sa",
        "full_time_employees": null
    },
    "3050.SR": {
        "short_name": "Southern Province Cement Co.",
        "long_name": "Southern Province Cement Company",
        "summary": "Southern Province Cement Company engages in the production and sale of cement, clinker, and its derivatives in Saudi Arabia. The company was founded in 1978 and is headquartered in Abha, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Abha",
        "zipcode": "62581",
        "website": "http://www.spcc.sa",
        "full_time_employees": null
    },
    "3060.SR": {
        "short_name": "Yanbou Cement Co.",
        "long_name": "Yanbu Cement Company",
        "summary": "Yanbu Cement Company, together with its subsidiaries, engages in the manufacturing, producing, and trading in cement and related products in the Kingdom of Saudi Arabia. The company offers ordinary Portland, Pozzolana Portland, hydraulic, and sulphate resistance cement products. It also manufactures cement bags. Yanbu Cement Company was founded in 1977 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21422",
        "website": "http://www.yanbucement.com",
        "full_time_employees": null
    },
    "3080.SR": {
        "short_name": "Eastern Province Cement Co.",
        "long_name": "Eastern Province Cement Co.",
        "summary": "Eastern Province Cement Company produces and sells clinker and cement in the Kingdom of Saudi and internationally. It offers ordinary Portland, sulphate resisting, and finishing cement, as well as pre-cast concrete products. The company also engages in the wholesale and retail of cement, gypsum, etc. Eastern Province Cement Company is headquartered in Dammam, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Dammam",
        "zipcode": "31412",
        "website": "http://www.epcco.com.sa",
        "full_time_employees": null
    },
    "3090.SR": {
        "short_name": "Tabouk Cement Co.",
        "long_name": "Tabuk Cement Company",
        "summary": "Tabuk Cement Company manufactures and sells cement and related products for construction industries and infrastructure projects in Saudi Arabia. It offers ordinary Portland cement, sulphate resisting Portland cement, and Portland pozzolan cement. The company also engages in the establishment of factories and plants for manufacturing cement related products and construction materials; and export of cement and related products. The company was founded in 1994 and is based in Duba, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Duba",
        "zipcode": null,
        "website": "http://www.tcc-sa.net",
        "full_time_employees": null
    },
    "3091.SR": {
        "short_name": "Al Jouf Cement Co.",
        "long_name": "Al Jouf Cement Company",
        "summary": "Al Jouf Cement Company produces and sells cement in the Kingdom of Saudi Arabia. It provides ordinary Portland, sulphate resistant cement, and pozzolana Portland cement. The company's cement is used to build bases and foundations, bridges and towers, concert roads, sewage plants, concrete pipes, etc. The company is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": null,
        "website": "http://www.joufcem.com.sa",
        "full_time_employees": null
    },
    "4001.SR": {
        "short_name": "Abdullah Al Othaim Markets Co.",
        "long_name": "Abdullah Al-Othaim Markets Company",
        "summary": "Abdullah Al-Othaim Markets Company, together with its subsidiaries, engages in the wholesale and retail trade of food supplies and other products in the Kingdom of Saudi Arabia and Egypt. The company imports, exports, wholesales, and retails food products, wheat, rice, meat, fish, dairy products, ghee, olive, halawa, pasta, and soft drinks, as well as fruits, vegetables, and agricultural products; livestock and household items; and ready-made clothes, sport clothes, jewelry, sewing tools, bags, leather products, decorations, dropped ceilings, and vehicles spare parts. It also establishes, operates, manages, and maintains supermarkets, commercial complexes, bakeries, and cafes; and provides catering, as well as labor services regarding house workers and employment in the public and private sectors. In addition, the company maintains training and educational, entertainment, and sports centers; offers computer services for application systems and databases; establishes agriculture projects; and undertakes general contracting, electrical and electronic, and reinforcing and carpentry works, as well as construction, maintenance, demolition, and restoration works primarily for highways, roads, streets, and bridges. Further, it is involved in the vegetables and fodder cultivation, livestock, poultry breeding, and general trading businesses; acquisition of land to construct buildings for lease or sale; and contracting of buildings. The company was formerly known as Abdullah Saleh Al-Othaim Markets Company and changed its name to Abdullah Al-Othaim Markets Company in September 2007. Abdullah Al-Othaim Markets Company was founded in 1956 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11531",
        "website": "http://www.othaimmarkets.com",
        "full_time_employees": null
    },
    "4002.SR": {
        "short_name": "Mouwasat Medical Services Co.",
        "long_name": "Mouwasat Medical Services Company",
        "summary": "Mouwasat Medical Services Company acquires, manages, operates, and maintains hospitals, medical centers, drug stores, and pharmacies in the Kingdom of Saudi Arabia. It operates a network of hospitals in Dammam, Jubail, Madinah, Khobar, Qatif, and Riyadh that provides a range of medical services. The company also operates skin care centers that offer clinical and cosmetic dermatology, aesthetic and reconstructive plastic surgery, weight reduction, and esthetician services; a fertility center; and a clinic for bariatric surgery. In addition, it is involved in the wholesale of medical equipment and drugs. The company was founded in 1974 and is based in Dammam, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Dammam",
        "zipcode": "31411",
        "website": "http://www.mouwasat.com",
        "full_time_employees": null
    },
    "4004.SR": {
        "short_name": "Dallah Healthcare Co.",
        "long_name": "Dallah Healthcare Company",
        "summary": "Dallah Healthcare Company provides and operates healthcare programs and utilities in the Kingdom of Saudi Arabia. The company engages in operating, managing, equipping, and developing hospitals and healthcare facilities, medical policlinics, compounds, and lands; and the provision of manpower and support services to hospitals and medical centers. It also manufactures and distributes pharmaceutical, herbal, and cosmetic products to retail pharmacies, health and beauty stores, hospitals, and governmental agencies. In addition, the company engages in the management and operation of hospitals owned by third-parties; and provision of other support services. The company was formerly known as Dallah Healthcare Holding Company and changed its name to Dallah Healthcare Company in November 2016. The company was founded in 1994 and is based in Riyadh, Saudi Arabia. Dallah Healthcare Company is the subsidiary of Dallah Albaraka Group LLC.",
        "currency": "SAR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "12381",
        "website": "http://www.dallahhealth.com",
        "full_time_employees": null
    },
    "4007.SR": {
        "short_name": "Al Hammadi Company for Developm",
        "long_name": "Al Hammadi Company For Development and Investment",
        "summary": "Al Hammadi Company For Development and Investment establishes, maintains, manages, and operates hospitals and medical centers in the Kingdom of Saudi Arabia. The company operates through Medical Services and Pharmaceuticals Products segments. It is also involved in the wholesale and retail trading of medical equipment, pharmaceutical and cosmetic products, and food and beverages; and the acquisition and rental of land for constructing buildings. In addition, the company invests in various industrial projects; and establishes, operates, and maintains commercial centers. It operates three hospitals under the Al Hammadi Hospital name in Olaya, Suwaidi, and Al Nuzha districts of Riyadh. The company was founded in 1985 and is based in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11534",
        "website": "http://www.alhammadi.com",
        "full_time_employees": null
    },
    "4011.SR": {
        "short_name": "Lazurde Company for Jewelry",
        "long_name": "L'azurde Company for Jewelry",
        "summary": "L'azurde Company for Jewelry, together with its subsidiaries, produces, manufactures, forms, and forges golden wares, jewelry, precious stones, and golden alloys. It operates in Wholesale and Retail segments. The company also distributes glasses, watches, accessories, pens, perfumes, and leather products; and manages franchises and trademarks; as well as exports gold wares, alloys, and silver. It primarily operates in the Kingdom of Saudi Arabia, Egypt, the United Arab Emirates, Kuwait, the Sultanate of Oman, and Qatar. The company was founded in 1980 and is headquartered in Riyadh, the Kingdom of Saudi Arabia. L'azurde Company for Jewelry is a subsidiary of L'Azurde Holding Company.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11521",
        "website": "http://www.lazurde.com",
        "full_time_employees": null
    },
    "4012.SR": {
        "short_name": "Thob Al Aseel Co.",
        "long_name": "Thob Al Aseel Co.",
        "summary": "Thob Al Aseel Co. develops, imports, exports, wholesales, and retails fabrics and readymade clothes. It operates through Thobs and Fabrics segments. The company offers thobes, pants, underwear, pajamas, and sleeping robes, as well as miscellaneous products, such as T-shirts, ehram products, and cotton socks. It also sells women's, men's, and children's fabrics and clothing products, as well as sewing supplements. The company operates through a chain of retail outlets under the Al-Jedaie brand. Thob Al Aseel Co. was founded in 1970 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11411",
        "website": "http://www.alaseel.com.sa",
        "full_time_employees": null
    },
    "4013.SR": {
        "short_name": "Dr. Sulaiman Al Habib Medical S",
        "long_name": "Dr. Sulaiman Al Habib Medical Services Group Company",
        "summary": "Dr. Sulaiman Al Habib Medical Services Group Company develops, owns, and operates hospitals and medical centers. The company operates spinal surgery, vascular, general medicine, urology, dental, diabetes and endocrine, ENT, family medicine, gastroenterology, general surgery, sport medicine, rheumatology, internal medicine, nutrition, nephrology, neurology, neurosurgery, orthopedic, OB/GYN, pulmonary, psychiatry, pediatric, and pain treatment clinics. It also operates physiotherapy, plastic surgery, cardiology, dermatology, in vitro fertilization, obesity treatment, ophthalmology, and laser hair removal centers; endoscopy, speech therapy, intensive care, hematology, kidney dialysis, sleep disorder treatment, laser and Lasik eye surgery, nuclear medicine, low vision, and ER units; a tissue laboratory and radiology center; and pharmacies. Dr. Sulaiman Al Habib Medical Services Group Company was founded in 1995 and is based in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11643",
        "website": "http://www.hmg.com",
        "full_time_employees": null
    },
    "4031.SR": {
        "short_name": "Saudi Ground Services Co.",
        "long_name": "Saudi Ground Services Company",
        "summary": "Saudi Ground Services Company provides ground-handling services for passengers and aircraft in the Kingdom of Saudi Arabia. It offers a range of passenger services, including arrival and transfer, passenger manifesting and seat allocation, station management, gate, and VIP services, as well as check-in services, such as boarding pass and baggage tagging, and load planning and pre-flight editing services. The company also provides baggage handling services comprising baggage sorting and transportation, and lost and found services; ramp services; cargo loading/offloading services; and fleet cleaning services, such as cabin grooming, deep cleaning, and turnaround cleaning, as well as water and toilet services. In addition, it offers operation services and traffic control services. The company was founded in 2008 and is based in Jeddah, the Kingdom of Saudi Arabia. Saudi Ground Services Company is a subsidiary of Saudi Arabian Airlines Corporation.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Airports & Air Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21572",
        "website": "http://www.saudiags.com",
        "full_time_employees": null
    },
    "4051.SR": {
        "short_name": "Baazeem Trading Co.",
        "long_name": "Baazeem Trading Co.",
        "summary": "Baazeem Trading Co. operates as a FMCG distribution company. The company offers household cleaning solutions, such as sponge, scrubbers, steel wool, brooms, wipers, trash bags, food storage bags, table covers, and others; liquid detergents; cleaners; tuna; starch sprays; plastic oven bags; toilet cleaning products; and bed linens. It sells its products through business to business, discount store, and wholesale and retail channels in the United Arab Emirates, the Kingdom of Bahrain, and the Sultanate of Oman. The company was founded in 1978 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11451",
        "website": "http://baazeem.com",
        "full_time_employees": null
    },
    "4061.SR": {
        "short_name": "Anaam International Holding Gro",
        "long_name": "Anaam International Holding Group Company",
        "summary": "Anaam International Holding Group Company engages in food, agriculture, and estate development businesses in Saudi Arabia. The company imports, distributes, and sells frozen food products, including chicken, mutton, fish, potatoes, vegetables, fruits, and other products. It also produces grain and fodder products, such as alfalfa, corn, wheat, fruits and vegetables, tomatoes, potatoes, onions, and other products, as well as owns agricultural land with an area of 100,000,000 square meters in the fertile agricultural Albesitae northern Saudi Arabia. In addition, the company manages and leases cold and dry storage facilities; builds, manages, and maintains commercial centers; and builds, manages, and operates industrial projects. Further, it undertakes contracts to build residential complexes, commercial centers, economic cities, and industrial properties; constructs, sells, and leases buildings; leases construction machinery and equipment; and undertakes finishing works in construction, as well as provides construction maintenance, and construction materials wholesale and retail services. Anaam International Holding Group Company was founded in 1980 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11555",
        "website": "http://www.anaamgroup.com",
        "full_time_employees": 76
    },
    "4070.SR": {
        "short_name": "Tihama Advertising and Public R",
        "long_name": "Tihama Advertising and Public Relations Co.",
        "summary": "Tihama Advertising and Public Relations Co. engages in the advertising in Saudi Arabia and internationally. It offers outdoor commercial advertising in Jeddah, Riyadh, Eastern Province, Western Region, and Madinah. Tihama Advertising and Public Relations Co. was founded in 1974 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11412",
        "website": "http://www.tihamaholding.com/en/tihama-advertising/",
        "full_time_employees": null
    },
    "4080.SR": {
        "short_name": "Aseer Trading\\, Tourism and Man",
        "long_name": "Aseer Trading, Tourism and Manufacturing Co.",
        "summary": "Aseer Trading, Tourism and Manufacturing Co., an investment holding company, engages in the industry, trade, tourism, agriculture, real estate development, and contracting activities. It invests in preserved food, real estate development, building and construction materials, electrical and electronic home appliances, petrochemical and derivatives, and financial and service sectors. The company was founded in 1977 and is headquartered in Abha, Saudi Arabia. Aseer Trading, Tourism and Manufacturing Co. is a subsidiary of Dallah Albaraka Holding Company.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Abha",
        "zipcode": null,
        "website": "http://www.aseercorp.com.sa",
        "full_time_employees": null
    },
    "4090.SR": {
        "short_name": "Taiba Investments Co.",
        "long_name": "Taiba Investments Co.",
        "summary": "Taiba Investments Co. invests in, owns, buys, sells, leases, operates, maintains, and manages real estate properties in Saudi Arabia. The company also invests in, owns, operates, maintains, and manages hotels, hospitals, and recreational and tourist facilities; and operates, maintains, and manages cities, and public and private facilities. In addition, the company is involved in architectural, civil, mechanical, and electrical contracting; and agricultural, industrial, and mining activities. Further, it is involved in the provision of credit and mortgage services. The company was formerly known as Taiba Holding Co. and changed its name to Taiba Investments Co. in May 2019. Taiba Investments Co. was founded in 1988 and is headquartered in Medina, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Medina",
        "zipcode": "41472",
        "website": "http://www.taiba.com.sa",
        "full_time_employees": null
    },
    "4100.SR": {
        "short_name": "Makkah Construction and Develop",
        "long_name": "Makkah Construction & Development Company",
        "summary": "Makkah Construction & Development Company invests in, buys, develops, owns, manages, and rents real estate properties in the Kingdom of Saudi Arabia. It also undertakes engineering, construction, reconstruction, maintenance, demolition, and survey works. The company was founded in 1989 and is headquartered in Mecca, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Mecca",
        "zipcode": "21955",
        "website": "http://www.mcdc.com.sa",
        "full_time_employees": null
    },
    "4110.SR": {
        "short_name": "Batic Investments and Logistics",
        "long_name": "Batic Investments and Logistics Company",
        "summary": "Batic Investments and Logistics Co. invests in logistic, private security, and related technologies in the Kingdom of Saudi Arabia. It provides ground and refrigerated transport. The company was founded in 1984 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11472",
        "website": "http://www.batic.com.sa",
        "full_time_employees": null
    },
    "4150.SR": {
        "short_name": "Arriyadh Development Co.",
        "long_name": "Arriyadh Development Co.",
        "summary": "Arriyadh Development Co. builds, manages, rents, and sells facilities, commercial and residential buildings, prefabricated buildings, government buildings, service buildings, public parks, and tourism and residential compounds in Saudi Arabia. It also engages in the management, rental, and sale of construction projects, commercial and industrial exhibitions, and renovations of residential and non-residential buildings. The company was founded in 1993 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11462",
        "website": "http://www.ardco.com.sa",
        "full_time_employees": null
    },
    "4161.SR": {
        "short_name": "BinDawood Holding Co.",
        "long_name": "Bin Dawood Holding Company",
        "summary": "Bin Dawood Holding Company engages in retail trading of foodstuff and household items. The company is also involved in the wholesale of bakery and related products to commercial supermarkets. It operates 74 hypermarkets and supermarkets under the BinDawood and Danube brands in the Kingdom of Saudi Arabia. The company was founded in 1984 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21530",
        "website": "http://www.bindawoodholding.com",
        "full_time_employees": null
    },
    "4180.SR": {
        "short_name": "Fitaihi Holding Group",
        "long_name": "Fitaihi Holding Group",
        "summary": "Fitaihi Holding Group provides gold, jewelry, and luxury products primarily in Saudi Arabia. The company offers gifts, crystal and silverware products, antiques, chinaware, textiles, leather goods, chocolates, bed-linen, toilet sets, and accessories, as well as men's, women's, and children's wear products. It also produces agricultural products comprising wheat, potato, onion, fruits, fodder, honey, yellow corn, olive, and olive oil products, as well as animal products. In addition, the company engages in the cleaning and operation of factories, companies, buildings, and shops; and offers public, air conditioner, machinery, equipment, vehicle and device maintenance, and commercial services. Further, it is involved in the investment business, as well as operates healthcare facilities. The company retails its products and acts as an agent/distributor of various brand names, including Mont Blanc, Dunhill, Sarcar, Louis Erard, Saint Louis, Scintilla Monaco, Marina B, Talento, Rebecca, Robbe & Berking, Moser, Guy DeGrenne, Aynsley, Noritake, Nachtmann, Fratelli Rosetti, Derek Rose, Fabio Inghirami, Lanvin, Zimmerli, etc. It also exports its products. Fitaihi Holding Group was founded in 1907 and is based in Jeddah, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "22234",
        "website": "http://www.fitaihi.com.sa",
        "full_time_employees": null
    },
    "4190.SR": {
        "short_name": "Jarir Marketing Co.",
        "long_name": "Jarir Marketing Company",
        "summary": "Jarir Marketing Company, together with its subsidiaries, engages in the retail and wholesale trading of office and school supplies. It operates through Retail Outlets and Wholesale segments. The company sells office supplies, school supplies, books, computers and peripherals, computer supplies, smartphones and accessories, electronics, art and craft supplies, video games, smart TV's, and kids' development products, as well as after-sale services. It is also involved in the online sale of products through Jarir.com website and Jarir Bookstore app; and investment of office, retail, and residential properties. Jarir Marketing Company sells its products under the Jarir bookstore brand name. As of April 12, 2021, the company had 64 retail showrooms in the Kingdom of Saudi Arabia and other Gulf countries. Jarir Marketing Company was founded in 1974 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11471",
        "website": "http://www.jarir.com",
        "full_time_employees": null
    },
    "4191.SR": {
        "short_name": "Abdullah Saad Mohammed Abo Moat",
        "long_name": "Abdullah Saad Mohammed Abo Moati Stationaries Company",
        "summary": "Abdullah Saad Mohammed Abo Moati Stationaries Company operates bookstores in the Kingdom of Saudi Arabia. Its stores offer stationery products and ink. As of April 26, 2021, the company operates 11 retail showrooms in the Kingdom of Saudi Arabia. The company is based in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11423",
        "website": "http://www.abomoati.com",
        "full_time_employees": 241
    },
    "4200.SR": {
        "short_name": "Aldrees Petroleum and Transport",
        "long_name": "Aldrees Petroleum and Transport Services Company",
        "summary": "Aldrees Petroleum and Transport Services Company engages in the wholesale and retail of fuel, gasoline, lubricant, and oil in the Kingdom of Saudi Arabia. The company operates through Petroleum Services and Transport Services segments. It operates approximately 544 fuel stations. The company offers various services related to additives, car wash, tire servicing, alignment, accessories, food, mosque, ATMs, car rental, etc. at its fuel stations. It also provides transportation and logistics services through a fleet of trucks and trailers. The company was founded in 1957 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11421",
        "website": "http://www.aldrees.com",
        "full_time_employees": null
    },
    "4220.SR": {
        "short_name": "Emaar The Economic City",
        "long_name": "Emaar The Economic City",
        "summary": "Emaar The Economic City operates as a real estate development and management company in Saudi Arabia. The company primarily develops the King Abdullah Economic City. It also develops infrastructures; promotes, markets, and sells land within development areas; transfers/leases land; develops buildings/housing units; and constructs on behalf of other parties. In addition, the company develops, invests in, markets, sells/leases, operates, and maintains properties; and provides higher education services. Emaar The Economic City was founded in 2006 and is headquartered in King Abdullah Economic City, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "King Abdullah Economic City",
        "zipcode": "23965",
        "website": "http://www.kaec.net",
        "full_time_employees": null
    },
    "4240.SR": {
        "short_name": "Fawaz Abdulaziz Alhokair Co.",
        "long_name": "Fawaz Abdulaziz AlHokair & Co.",
        "summary": "Fawaz Abdulaziz AlHokair & Company, together with its subsidiaries, engages in the wholesale and retail of fashion apparels. It operates through three segments: Fashion Retail, Indoor Entertainment, and Food & Beverage. The Fashion Retail segment is involved in the sale of apparels, footwears, and accessories through retail outlets. The Indoor Entertainment segment operates kids play center. The Food & Beverage segment operates cafes and restaurants. The company has operations in the Kingdom of Saudi Arabia, Jordan, Egypt, the Republic of Kazakhstan, the United States, the Republic of Azerbaijan, Georgia, Armenia, and Morocco. It operates approximately 1,842 stores across 100 shopping malls. The company was founded in 1990 and is based in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "12373",
        "website": "http://www.fawazalhokairfashion.com",
        "full_time_employees": 8896
    },
    "4250.SR": {
        "short_name": "Jabal Omar Development Co.",
        "long_name": "Jabal Omar Development Company",
        "summary": "Jabal Omar Development Company operates as a real estate development company in Saudi Arabia. The company operates through Operating Hotels, Commercial Centers, and Properties for Development and Sale segments. It engages in the investment, development, management, and sale of plots in the Jabal Omar project located in Makkah. It is also involved in the construction, maintenance, management, demolishing, surveying, furnishing hotels, commercial facilities, and staff residences, as well as operation of hotels. In addition, the company engages in importing and exporting hotel equipment and furniture. Jabal Omar Development Company operates hotels, including the Marriott, a five-star hotel with 426 rooms and suites; the Hilton Suites, a five-star hotel with 484 suites; the Hyatt Regency, a five-star hotel with 657 rooms and suites; and the Conrad, a five-star hotel with 438 rooms and suites; and Jabal Omar DoubleTree by Hilton with 676 rooms and suites. It also develops residential projects; and a commercial center. Further, the company provides logistic services. Jabal Omar Development Company was founded in 2006 and is based in Mecca, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Mecca",
        "zipcode": null,
        "website": "http://www.jabalomar.com.sa",
        "full_time_employees": null
    },
    "4290.SR": {
        "short_name": "Alkhaleej Training and Educatio",
        "long_name": "Al Khaleej Training and Education Company",
        "summary": "Al Khaleej Training and Education Company engages in the computer, language, education projects, financial and management training, communication centers, and schools businesses in the Kingdom of Saudi Arabia. The company's Computer segment offers advanced programming, networking, and computer solutions to individuals and corporates. Its Language segment provides training courses in English language. The company's Education Projects segment offers educational projects to universities and the Ministry of Education, as well as operates orientation years for Saudi universities. Its Financial and Management Training segment provides management, leadership, stock trading, and other courses. The company's Communication Centers segment provides management and operating services for customer service centers through telephone for companies and bodies. Its School segment operates private educational schools for boys/girls. The company also offers training solutions for women hairdressers, beauty salons staff, students, cosmetic consultants, nutritionists, and fitness specialists through Formul'A Academy. In addition, the company provides lifeboat and fast rescue boat training, as well as management training solutions through New Dimension center. Further, it offers manpower and human resources to call centers and customer care services. Additionally, the company is involved in the establishment and construction of schools and cafeterias; installation of networks; provision of infrastructures, communication systems, operation and maintenance, and computer software, as well as online training and technical support services. It also provides franchise rights to various brands. Al Khaleej Training and Education Company was founded in 1993 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11451",
        "website": "http://www.alkhaleej.com.sa",
        "full_time_employees": null
    },
    "4292.SR": {
        "short_name": "Ataa Educational Co.",
        "long_name": "Ataa Educational Company",
        "summary": "Ataa Educational Company, an education company, engages in the establishment of kindergarten, primary, middle, and secondary schools for boys and girls in the Kingdom of Saudi Arabia. The company operates through Private Schools, International Schools, Indian Schools, and French Schools segments. It is also involved in the establishment, management, and operation and maintenance of computer training centers. Ataa Educational Company was founded in 1992 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11652",
        "website": "http://www.ataa.sa",
        "full_time_employees": null
    },
    "4300.SR": {
        "short_name": "Dar Alarkan Real Estate Develop",
        "long_name": "Dar Al Arkan Real Estate Development Company",
        "summary": "Dar Al Arkan Real Estate Development Company, together with its subsidiaries, primarily engages in the development, sale, and lease of real estate projects in the Kingdom of Saudi Arabia. The company operates in two segments, Development Properties and Asset Management. It is involved in the acquisition, development, construction, management, operation, and maintenance of residential and commercial buildings, and public facilities. The company also engages in the purchase and sale, acquisition, and leasing of real estate investments; and purchase of land and general contracting activities. Dar Al Arkan Real Estate Development Company was founded in 1994 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "12622",
        "website": "http://www.daralarkan.com",
        "full_time_employees": null
    },
    "4310.SR": {
        "short_name": "Knowledge Economic City",
        "long_name": "Knowledge Economic City Company",
        "summary": "Knowledge Economic City develops properties and other land in the economic cities of Saudi Arabia. It undertakes projects, including infrastructure, telecommunications and Internet networks, water and electricity networks, water treatment plants, and other works related to the development of the economic cities. The company also engages in the creation, operation, and management of educational projects; and development of software, scientific research centers, universities, colleges, institutes, and academies. In addition, its activities include marketing and selling real estate properties; buildings and land for development or for ownership of others; and managing housing services, tourist projects, resorts, hotels and furnished apartments, and other activities. The company was founded in 2010 and is based in Medina, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Medina",
        "zipcode": "41561",
        "website": "http://www.madinahkec.com",
        "full_time_employees": null
    },
    "4320.SR": {
        "short_name": "Alandalus property Co.",
        "long_name": "Alandalus Property Company",
        "summary": "Alandalus Property Company engages in the commercial real estate investment and development activities in the Kingdom of Saudi Arabia. It constructs, owns, and manages centers, and commercial and residential complexes. The company is also involved in the general contracting of residential and commercial buildings, educational, recreational, health institutions, roads, dams, water and sewage project, electrical, and mechanical works. In addition, it engages in the leasing, maintenance, and operation of real estate properties, buildings, and commercial complexes, as well as ownership, development, and investment of lands and real estate properties. Alandalus Property Company was founded in 2006 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11342",
        "website": "http://www.alandalus.com.sa",
        "full_time_employees": null
    },
    "4321.SR": {
        "short_name": "Arabian Centres Co.",
        "long_name": "Arabian Centres Company",
        "summary": "Arabian Centres Company develops, owns, and operates contemporary lifestyle centers in the Kingdom of Saudi Arabia. It operates a portfolio of 21 lifestyle centers in 11 cities, which comprise approximately 4,300 retail stores. The company also builds, leases, and sells buildings; and engages in the construction of commercial buildings, including demolition, repair, excavation, and maintenance works. In addition, it is involved in the maintenance and operation of commercial centers, tourist resorts, hotels, and restaurants; and managing and operating temporary and permanent exhibitions, compounds, and hospitals. The company was founded in 2002 and is based in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11333",
        "website": "http://www.arabiancentres.com",
        "full_time_employees": null
    },
    "4330.SR": {
        "short_name": "Riyad REIT Fund",
        "long_name": "Riyad REIT Fund",
        "summary": "Riyad REIT specializes in real estate investing.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "13241",
        "website": "http://www.riyadcapital.com/en/asset-management/public-funds/reits/riyad-reit",
        "full_time_employees": null
    },
    "4331.SR": {
        "short_name": "AlJazira REIT",
        "long_name": "Aljazira Mawten REIT Fund",
        "summary": "Al - Jazira Mawten REIT Fund is a real estate investment trust managed by Al Jazira Capital Company, Asset Management Arm. The firm invests real estate markets of Saudi Arabia. It invests in income-generating property developments. The firm investments are mainly focused on the Jeddah-based Al-Khumra warehouses, which are wholly owned by AlJazira Mawten real estate income fund. Al - Jazira Mawten REIT Fund is based in Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": null,
        "website": null,
        "full_time_employees": null
    },
    "4336.SR": {
        "short_name": "Mulkia Gulf Real Estate REIT",
        "long_name": "Mulkia Gulf Real Estate REIT",
        "summary": "Mulkia Gulf Real Estate REIT is a Shariah compliant real estate investment trust externally managed by Mulkia Investment Company. It invests in real estate markets of Saudi Arabia. The firm primarily invests in income generating real estates, which are under four specific real estate assets in major cities within Saudi Arabia. Mulkia Gulf Real Estate REIT Fund is based in Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11573",
        "website": "http://www.mulkia.com.sa/mulkia-gulf-real-estates-reit-fund/",
        "full_time_employees": null
    },
    "4344.SR": {
        "short_name": "SEDCO Capital REIT Fund",
        "long_name": "SEDCO Capital REIT Fund",
        "summary": "SEDCO Capital REIT is a Shariah-compliant real estate investment traded fund externally managed by SEDCO Capital. it invests in single-tenant and multiple-tenant properties across Saudi Arabia. SEDCO Capital REIT is based in Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21491",
        "website": "http://www.sedcocapital.com/reit",
        "full_time_employees": null
    },
    "6001.SR": {
        "short_name": "Halwani Bros. Co.",
        "long_name": "Halwani Bros. Co. Ltd.",
        "summary": "Halwani Bros. Co. Ltd. produces, manufactures, and distributes food products in the Kingdom of Saudi Arabia. It offers Middle Eastern food products, such as sweets; meat products; breaded chicken and burgers; jams; dairy products; cheese; juices; provisions, such as olive oil, olives, peppers, and pickles; bakery products stuffed with dates, and packaging products. The company was founded in 1950 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21421",
        "website": "http://www.halwani.com.sa",
        "full_time_employees": null
    },
    "6002.SR": {
        "short_name": "Herfy Food Services Co.",
        "long_name": "Herfy Food Services Company",
        "summary": "Herfy Food Services Company establishes, operates, and franchises restaurants primarily in the Kingdom of Saudi Arabia. The company's restaurants offer cooked meals to companies and others. As of December 31, 2020, it owned 40 restaurants and leased 348 restaurants under the HERFY name in the Kingdom of Saudi Arabia. The company also franchises restaurants in Kuwait, the United Arab Emirates, Egypt, and Bahrain; provides catering services; manufactures and sells meat products, as well as bakery and pastry, and sweets and chocolate products; and operates bakeries. In addition, it purchases and sells land for constructing buildings; and owns, uses, maintains, and leases stores and food store fridges. The company was founded in 1981 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11632",
        "website": "http://www.herfy.com",
        "full_time_employees": 5403
    },
    "6004.SR": {
        "short_name": "Saudi Airlines Catering Co.",
        "long_name": "Saudi Airlines Catering Company",
        "summary": "Saudi Airlines Catering Company offers catering and other support services to flights operated by Saudi Arabian and other airlines in the Kingdom of Saudi Arabia. The company operates through three segments: Inflight, Retail, and Catering and Facilities. It offers in-flight catering services; and manages airport lounges. The company also provides SkySales, an in-flight shopping service; catering, accommodation management, laundry, and cleaning services to companies in remote sites; and on-platform and onboard catering services for passengers in rail terminals. In addition, it offers catering services to private sector firms and government offices, as well as hospitals and clinics; commercial laundry services to airlines, hotels, industrial operations, hospitals, and other clients; Hajj and Umrah catering services; and security services. Saudi Airlines Catering Company was founded in 1981 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Airports & Air Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21413",
        "website": "http://www.saudiacatering.com/en/home",
        "full_time_employees": null
    },
    "6012.SR": {
        "short_name": "Raydan Food Co.",
        "long_name": "Raydan Food Co.",
        "summary": "Raydan Food Co. establishes, owns, operates, and manages restaurants. The company offers Arab meals, and cooked and uncooked catering services. It is also involved in the holding of concerts; management of factories; sale and purchase of livestock; sale and delivery of finished paintings; general contracting; real estate investment; import and export; and wholesale and retail trade activities. The company was formerly known as Raydan Co. Raydan Food Co. was founded in 2008 and is headquartered in Jeddah, Saudi Arabia.",
        "currency": null,
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21323",
        "website": "http://raydan.com.sa",
        "full_time_employees": null
    },
    "6020.SR": {
        "short_name": "Al Gassim Investment  Holding C",
        "long_name": "Al Gassim Investment Holding Company",
        "summary": "Al Gassim Investment Holding Company invests in agriculture business in the Kingdom of Saudi Arabia. It engages in the manufacturing and selling of agricultural products; and import of seeds. The company was formerly known as Qassim Agriculture Company and changed its name to Al Gassim Investment Holding Co. in January 2017. Al Gassim Investment Holding Co. was founded in 1984 and is based in Jaradat al Buraykah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jaradat al Buraykah",
        "zipcode": "51451",
        "website": "http://www.gih.sa",
        "full_time_employees": null
    },
    "6040.SR": {
        "short_name": "Tabuk Agriculture Development C",
        "long_name": "Tabuk Agricultural Development Company",
        "summary": "Tabuk Agricultural Development Company produces and sells agricultural products in Saudi Arabia. It offers fruits; vegetables; alfalfa and wheat; and olive oil. The company also engages in the management and leasing of owned or leased properties. It sells its products under the TADCO brand. Tabuk Agricultural Development Company was founded in 1983 and is headquartered in Tabuk, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Tabuk",
        "zipcode": "71421",
        "website": "http://www.tadco-agri.com",
        "full_time_employees": 729
    },
    "6050.SR": {
        "short_name": "Saudi Fisheris Co.",
        "long_name": "Saudi Fisheries Company",
        "summary": "Saudi Fisheries Company engages in fishing, fish-farming, and marketing activities in the Kingdom of Saudi Arabia. The company's seafood products include hareed, hamour baloul, zubaidi, shaour emperor, andak red sea bream, dennis seabream, qarous sea bass, hamor seaman, and nagel fish, as well as crab, peeled shrimp, lobster, squid, and salmon and knad steaks. It also offers meal products, including salmon grilled with rice, sweet sour shrimp with rice, tempura fish, fried prawns with potatoes, daqoos, flour, thome, green salad, spiced eggplant, rabban timbora, his sanctity, and chickpeas, as well as frozen shrimp. In addition, the company is involved in the operation of fish and shrimp farms; ice production and storage facilities; and operation and management of seafood restaurants. In addition, it engages in the sorting, cleaning, and chopping of fish, as well as preservation, cooking, and packing; and provision of logistic services, which include procurement, transportation, and warehouse of products. The company was founded in 1980 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "12641",
        "website": "http://www.alasmak.com.sa",
        "full_time_employees": null
    },
    "6090.SR": {
        "short_name": "Jazan Energy and Development Co",
        "long_name": "Jazan Energy and Development Company",
        "summary": "Jazan Energy and Development Company, together with its subsidiaries, engages in the fisheries, agricultural, industrial, and real estate businesses in Saudi Arabia. The company is involved in the cultivation of mangoes and shrimps; preservation of fish and fish products; cooling and freezing of fruits; production and packaging and distributing of pure filtered water; operates hotels; and other activities. It engages in the buying, selling, and renting of land and real estate properties. Jazan Energy and Development Company was incorporated in 1993 and is headquartered in Jazan, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jazan",
        "zipcode": null,
        "website": "http://www.jazadco.com.sa",
        "full_time_employees": null
    },
    "7010.SR": {
        "short_name": "Saudi Telecom Co.",
        "long_name": "Saudi Telecom Company",
        "summary": "Saudi Telecom Company, together with its subsidiaries, provides telecommunications, information, media, and digital payment services in the Kingdom of Saudi Arabia and internationally. The company offers mobile, landline, Internet, and TV on demand services, as well as international telecommunication, broadband, and other related services; and operates communications projects. It is also involved in the electrical business and telecommunication networks; and wholesale and retail of telecommunications equipment and electrical appliances, and recharge card services. In addition, the company engages in importing, marketing, installing, and maintaining licensed telecommunications and information technology; owning, constructing, operating, leasing, and commercializing telecom towers; the content services and digital media activities; the provision of computer services; the sale and re-sale of fixed and mobile telecommunication services; and the maintenance and operation of commercial centers. Further, it establishes, owns, develops, invests, and manages real estate and contracting activities; and provides consulting, and importing and exporting services. The company was founded in 1998 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "12464",
        "website": "http://www.stc.com.sa",
        "full_time_employees": null
    },
    "7020.SR": {
        "short_name": "Etihad Etisalat Co.",
        "long_name": "Etihad Etisalat Company",
        "summary": "Etihad Etisalat Company operates mobile wireless telecommunication and fiber optic networks in the Kingdom of Saudi Arabia. The company manages, installs, and operates telephone networks, terminals, and communication unit systems; and sells and maintains mobile phones and communication unit systems. It is also involved in the contractual establishment and maintenance of wired telecommunication networks and related works; installation and maintenance of wire and wireless telecommunication networks; installation and maintenance of computer systems and the provision of data services; import, export, sale, and distribution of telecommunications hardware, software and systems, and intelligent building systems; and marketing and distribution of telecommunication services. In addition, the company provides computer services and related software and equipment; consultation services in the telecommunication, computer, software, and media production domains; and marketing and importing services for third parties. Further, it is involved in the wholesale, retail, maintenance, and operation of computers and electronic equipment, as well as the provision of related services. Additionally, the company invests funds in shares, bonds, and other securities; and owns real estate, as well as owns and leases intellectual property rights, such as patents and trademarks, concessions, and other intangible rights. Etihad Etisalat Company was founded in 2004 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11423",
        "website": "http://www.mobily.com.sa",
        "full_time_employees": null
    },
    "7040.SR": {
        "short_name": "Etihad Atheeb Telecommunication",
        "long_name": "Etihad Atheeb Telecommunication Company",
        "summary": "Etihad Atheeb Telecommunication Company provides voice and data services in the Kingdom of Saudi Arabia. The company offers voice, data, value added and directory, and other future services and applications, as well as integrated business solutions. It offers dedicated internet acess, IP-VPN, VPN and IPLC, and VPN over LTE services; SIP trunk, national toll free, and UAN 9200 services; managed routers service and distributed denial of service; and co-location services. The company also provides fibre broadband, LTE broadband, and WiMAX broadband services; and prepaid calling cards to residential and personal customers. Etihad Atheeb Telecommunication Company was founded in 2008 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": null,
        "website": "http://www.go.com.sa",
        "full_time_employees": null
    },
    "7200.SR": {
        "short_name": "Al Moammar Information Systems ",
        "long_name": "Al Moammar Information Systems Company",
        "summary": "Al Moammar Information Systems Company provides information technology solutions and services in the Kingdom of Saudi Arabia. The company operates through six segments: Business Service Management unit, Solutions unit, Systems unit, Information Technology Security unit, Networking unit, and Operation and Maintenance unit. It provides operating systems, system analysis, and software design, programming, and maintenance, as well as web design and hosting, data processing services, and related services. The company also offers software-defined and coveraged storage; servers, such as server infrastructure management, racks and power infrastructure, racks and tower servers, mission-critical, blade system, and hyperscale; and software, including mobility, autonomy portfolio, big data and analysis, automation and cloud, app and desktop virtualization, application lifecycle management, data center and cloud management, desktop virtualization and mobile computing, and data center virtualization and cloud infrastructure. In addition, it provides networks and communication solutions based on SDN, NFV, automation, and management and orchestration technologies; geographic information services and various infrastructure solutions; and information technology security solutions to develop, deploy, and maintain security. Further, the company offers mainframe cost optimization, performance monitoring, remote support solutions, network management solution, IT business and service management, cloud computing, data center automation, data center infrastructure, management solutions, and data center capacity management solutions; and project management support for IT infrastructure business. It serves government, semi-government ministries, and private sectors. The company was incorporated in 1979 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "13315",
        "website": "http://www.mis.com.sa",
        "full_time_employees": null
    },
    "8010.SR": {
        "short_name": "The Company for Coopetative Ins",
        "long_name": "The Company for Cooperative Insurance",
        "summary": "The Company for Cooperative Insurance provides various insurance and reinsurance solutions for individuals and companies in the Kingdom of Saudi Arabia. It operates through Medical, Motor, Property and Casualty, Protection and Saving, and Manafeth segments. The company offers motor, medical, property and casualty, takaful, engineering and contractors, industrial and energy, telecommunications and IT, financial and investment, transportation, retail and trading, fire, marine, aviation, liability, energy, general accidents, home, international travel, medical malpractice, shop owners, and protection and savings insurance products. It also provides third party liability insurance for foreign vehicles. The company was formerly known as National Company for Cooperative Insurance and changed its name to The Company for Cooperative Insurance in 2004. The Company for Cooperative Insurance was founded in 1986 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11632",
        "website": "http://www.tawuniya.com.sa",
        "full_time_employees": 253
    },
    "8012.SR": {
        "short_name": "Aljazira Takaful Taawuni Co.",
        "long_name": "Aljazira Takaful Taawuni Company",
        "summary": "Aljazira Takaful Taawuni Company provides various insurance products and services in the Kingdom of Saudi Arabia. Its Individual segment offers life insurance products, which include unit linked investment-oriented products on an individual basis. The Company's Group segment provides life protection programs to the members of organizations on a group basis, as well as credit protection benefits in respect of personal loan given by financing organization. This segment also includes protection benefits in respect of various credit facilities other than personal loans extended by the financing organizations to its customers. The company was founded in 2013 is based in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21422",
        "website": "http://www.ajt.com.sa",
        "full_time_employees": 108
    },
    "8020.SR": {
        "short_name": "Malath Cooperative Insurance Co",
        "long_name": "Malath Cooperative Insurance Company",
        "summary": "Malath Cooperative Insurance Company provides insurance products and related services to individuals and businesses in the Kingdom of Saudi Arabia. The company operates through Medical, Motor, Property & Casualty, and Protection & Savings segments. It offers marine cargo in transit and ships against marine perils insurance products; engineering insurance that provides coverage for loss or damage to construction works or erection and installation of plant and machinery; and health, motor vehicles, fire and burglary, public liability, personal accident, and workmen compensation insurance products. The company was incorporated in 2007 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Property & Casualty",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11625",
        "website": "http://www.malath.com.sa",
        "full_time_employees": null
    },
    "8030.SR": {
        "short_name": "The Mediterranean and Gulf Insu",
        "long_name": "The Mediterranean and Gulf Cooperative Insurance and Reinsurance Company",
        "summary": "The Mediterranean and Gulf Cooperative Insurance and Reinsurance Company provides insurance and reinsurance products and related activities in the Kingdom of Saudi Arabia. It offers motor third party liability and comprehensive motor insurance products, as well as group health insurance products. The company also provides protection and savings, travel, property, engineering, contractors' all risks, machinery breakdown, stock deterioration, contractors' equipment, erection all risks, electronic device, aviation and air transport, money, comprehensive bank, fidelity, personal accidents, professional and product liability, workers' compensation and employer liability, marine cargo, and marine hull insurance products. The Mediterranean and Gulf Cooperative Insurance and Reinsurance Company was founded in 2007 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11451",
        "website": "http://www.medgulf.com.sa",
        "full_time_employees": null
    },
    "8040.SR": {
        "short_name": "Allianz Saudi Fransi Cooperativ",
        "long_name": "Allianz Saudi Fransi Cooperative Insurance Company",
        "summary": "Allianz Saudi Fransi Cooperative Insurance Company provides insurance products to corporate and individual customers in the Kingdom of Saudi Arabia. The company offers motor, travel, medical, engineering, employee benefits, credit, fidelity guarantee, and protection and savings insurance, as well as property and casualty insurance, such as fire, burglary, money, construction/erection works, liability, and marine. The company was formerly known as Saudi Fransi Cooperative Insurance Company and changed its name to Allianz Saudi Fransi Cooperative Insurance Company in October 2010. Allianz Saudi Fransi Cooperative Insurance Company was founded in 2007 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11481",
        "website": "http://www.allianzsf.com",
        "full_time_employees": null
    },
    "8050.SR": {
        "short_name": "Salama Cooperative Insurance Co",
        "long_name": "Salama Cooperative Insurance Company",
        "summary": "Salama Cooperative Insurance Company provides insurance products and services in the United Arab Emirates, the Kingdom of Saudi Arabia, Algeria, Malaysia, Bahrain, Senegal, and Egypt. It operates through three segments: Medical, Motor, and Others. It offers motor insurance products that cover accident, fire, towing, malicious, theft, estimation, and medical expenses; and medical insurance for care, medicines, chronic diseases, vaccination, maternity and neonatal, physiotherapy, ophthalmology, dental care, oncology, and CCHI. The company also provides travel insurance comprising personal accidents, medical expenses, repatriation of mortal remains, lost baggage, passport loss, cash loss, personal liability, and accidental death; and malpractice insurance that provides specialties, flexible, and medical facilities coverage. In addition, it offers general insurance coverage, such as engineering, liability, marine, property, and general accident insurance products. The company was formerly known as Saudi IAIC Cooperative Insurance Company and changed its name to Salama Cooperative Insurance Company in 2012. Salama Cooperative Insurance Company was founded in 1979 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Property & Casualty",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21491",
        "website": "http://www.salama.com.sa",
        "full_time_employees": null
    },
    "8060.SR": {
        "short_name": "Walaa Cooperative Insurance Co.",
        "long_name": "Walaa Cooperative Insurance Company",
        "summary": "Walaa Cooperative Insurance Company provides cooperative insurance and reinsurance products and services in the Kingdom of Saudi Arabia. It offers various property insurance products, including property all risk, fire and specified perils property damage, home, and loss of profit/business interruption insurance; and engineering insurance products, such as erection and construction all-risk, and contractor's plant and machinery/equipment insurance, as well as machinery breakdown insurance (MBD), loss of profit following MBD, and deterioration of stock following MBD. The company also provides motor insurance products, which include commercial and private motor comprehensive, and third party liability policies; marine insurance products, including marine cargo and hull insurance policies; medical insurance; and miscellaneous accidents insurance products, such as comprehensive general liability, professional indemnity, medical malpractice, directors and officers liability, privacy and network security cyber liability, fidelity guarantee, money, personal accident, workmen's compensation and employers liability, travel, aviation hull, and public and product liability insurance. The company was formerly known as Saudi United Cooperative Insurance Company and changed its name to Walaa Cooperative Insurance Company in May 2017. Walaa Cooperative Insurance Company was founded in 2007 and is headquartered in Al-Khobar, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Al Khobar",
        "zipcode": "31952",
        "website": "http://www.walaa.com",
        "full_time_employees": null
    },
    "8070.SR": {
        "short_name": "Arabian Shield Cooperative Insu",
        "long_name": "Arabian Shield Cooperative Insurance Company",
        "summary": "Arabian Shield Cooperative Insurance Company offers various insurance products to companies and individuals in the Kingdom of Saudi Arabia. It offers medical, motor, property, engineering, marine, liability, accident, casualty, protection and saving, travel, and medical malpractice insurance, as well as reinsurance products. The company was founded in 1998 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Property & Casualty",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11565",
        "website": "http://www.der3.com",
        "full_time_employees": null
    },
    "8080.SR": {
        "short_name": "SABB Takaful Co.",
        "long_name": "SABB Takaful Company",
        "summary": "SABB Takaful Company provides a range of family and general insurance products to individual and corporate customers primarily in the Kingdom of Saudi Arabia. It operates through three segments: Individual Family Takaful, Group Family Takaful, and General Takaful. The company offers various protection plans, including travel, home, and personal accident takaful products; and wealth management plans consisting of investment, saving, education, and retirement takaful products. It also provides business protection products comprising marine cargo, business interruption or loss of profit, public liability, keyman protection, fire-property all risks, group creditors, SME package, fidelity guarantee, and money takaful plans; and employee benefits products, including group personal accident and care plans. The company was founded in 2006 is based in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11413",
        "website": "http://www.sabbtakaful.com",
        "full_time_employees": null
    },
    "8100.SR": {
        "short_name": "Saudi Arabian Cooperative Insur",
        "long_name": "Saudi Arabian Cooperative Insurance Company",
        "summary": "Saudi Arabian Cooperative Insurance Company engages in the insurance business in Saudi Arabia. The company provides group medical and life, motor and vehicle, power, aviation, fire, marine, engineering, hull and goods, property, and liability insurance products, as well as protection and savings insurance products. It serves corporates, SMEs, and individuals. The company was founded in 2006 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11594",
        "website": "http://www.saico.com.sa",
        "full_time_employees": null
    },
    "8110.SR": {
        "short_name": null,
        "long_name": "Saudi Indian Company for Cooperative Insurance Wafa Insurance",
        "summary": "Saudi Indian Company for Cooperative Insurance Wafa Insurance provides general insurance, health insurance, and protection and savings products in the Kingdom of Saudi Arabia. The company operates through Motor, Health, and Other segments. It offers property, accident, and liability insurance comprising fire, property damage, business interruption, personal accident, fidelity, money, theft and burglary, comprehensive general liability, workmen's compensation, medical malpractice, and medical insurance products; comprehensive and third party motor insurance products; and marine cargo insurance products. The company's products also include engineering insurance, such as machinery breakdown, contractor's all risk, contractor's plant and machinery, erection all risks, and electronics equipment insurance products; medical insurance; individual protection and saving products; and individual and group protection plans, as well as a range of reinsurance products and services. Saudi Indian Company for Cooperative Insurance Wafa Insurance is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11333",
        "website": "http://www.wafainsurance.com",
        "full_time_employees": null
    },
    "8120.SR": {
        "short_name": "Gulf Union Alahlia Cooperative ",
        "long_name": "Gulf Union Alahlia Cooperative Insurance Company",
        "summary": "Gulf Union Alahlia Cooperative Insurance Company provides various insurance products and services in the Kingdom of Saudi Arabia. It operates through Medical; Motor; Property and Casualty; and Protections and Savings segments. The company offers out-patient clinic treatment charges, property, marine cargo, third party liability, burglary, and group life and accident insurances; and individual insurances, including auto and health insurances, as well as reinsurance services. Gulf Union Alahlia Cooperative Insurance Company was founded in 1983 and is headquartered in Dammam, Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Dammam",
        "zipcode": null,
        "website": "http://www.gulfunion.com.sa",
        "full_time_employees": null
    },
    "8130.SR": {
        "short_name": "Alahli Takaful Co.",
        "long_name": "AlAhli Takaful Company",
        "summary": "AlAhli Takaful Company provides protection and saving insurance products through insurance solutions for individuals and groups in the Kingdom of Saudi Arabia. The company operates in two segments, Insurance-Individual and Insurance-Group Life. The Insurance-Individual segment offers life insurance products on an individual basis, including unit linked investment-oriented products. The Insurance-Group Life segment provides life protection programs to the members of organizations on a group basis; and credit's protection benefits in respect of personal loan given by financing organization. This segment also offers protection benefits in respect of various credit facilities other than personal loans extended by the financing organizations to its customers. The company was incorporated in 2007 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "23423-3791",
        "website": "http://alahlitakaful.com",
        "full_time_employees": null
    },
    "8150.SR": {
        "short_name": "Allied Cooperative Insurance Gr",
        "long_name": "Allied Cooperative Insurance Group",
        "summary": "Allied Cooperative Insurance Group engages in cooperative insurance operations and related activities in the Kingdom of Saudi Arabia. The company operates in four segments: Motor Insurance, Medical Insurance, General Accident Insurance, and Others. It provides motor comprehensive and third-party liability, medical, travel, home, shop, and visitor insurance products; general accident insurance products, such as money, fidelity guarantee, business all risk, business travel, and exhibition insurance; and liability insurance products, such as general third-party liability, product liability, workmen's compensation/employer's liability, and professional indemnity. The company also offers engineering insurance products comprising deterioration of stocks, machinery breakdown, electronic equipment, contractor's all risks, erection all risks, and loss of profit following machinery breakdown; and property all risks and fire insurance policies. In addition, it offers medical malpractice, personal accident, and medical and marine insurance products. The company was founded in 2006 and is based in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "11511",
        "website": "http://www.acig.com.sa",
        "full_time_employees": null
    },
    "8160.SR": {
        "short_name": "Arabia Insurance Cooperative Co",
        "long_name": "Arabia Insurance Cooperative Company",
        "summary": "Arabia Insurance Cooperative Company provides insurance products and services in the Kingdom of Saudi Arabia. It offers motor, health, property, engineering, medical, general accident, fire, marine, and other insurance products, such as general and aviation, as well as protection and savings insurance. The company was founded in 2007 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Property & Casualty",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": null,
        "website": "http://www.aicc.com.sa",
        "full_time_employees": null
    },
    "8170.SR": {
        "short_name": "Al-Etihad Cooperative Insurance",
        "long_name": "Al-Etihad Cooperative Insurance Company",
        "summary": "Al-Etihad Cooperative Insurance Company provides insurance services in the Kingdom of Saudi Arabia. It offers property, motor, marine and marine cargo, medical and health, general accident and liability, casualty, and engineering and construction insurance. The company was founded in 1983 and is headquartered in Dhahran, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Dhahran",
        "zipcode": "34232-4233",
        "website": "http://www.tuci-sa.com",
        "full_time_employees": null
    },
    "8180.SR": {
        "short_name": "Al Sagr Cooperative Insurance C",
        "long_name": "Al Sagr Cooperative Insurance Company",
        "summary": "Al Sagr Cooperative Insurance Company provides insurance products and solutions in the Kingdom of Saudi Arabia and Singapore. The company operates through Medical, Motor, Property and Casualty, and Protection and Savings segments. It offers fire and allied perils, property all risks, and business interruption insurance products; marine cargo and hull insurance products; and engineering insurance products comprising contractor's all risks and erection all risks, contractors' plant and machinery, machinery breakdown, loss of profit due to machinery breakdown, boiler and pressure vessels, deterioration of stock, and electronics equipment insurance. The company also provides liability insurance products, such as workmen's compensation, employer liability, public liability, and professional indemnity insurance; onshore and offshore energy insurance products; and medical, travel, motor, and medical malpractice insurance products. In addition, it offers miscellaneous insurance products, including personal accident, money, fidelity guarantee, and burglary insurance. The company was founded in 1983 and is based in Dammam, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Dammam",
        "zipcode": null,
        "website": "http://www.alsagr.com",
        "full_time_employees": null
    },
    "8200.SR": {
        "short_name": "Saudi Re for Cooperative Reinsu",
        "long_name": "Saudi Re for Cooperative Reinsurance Company",
        "summary": "Saudi Re for Cooperative Reinsurance Company provides various reinsurance products in the Kingdom of Saudi Arabia, rest of the Middle East, Africa, Asia, and internationally. The company underwrites engineering, property, marine, casualty, motor, retro, life, medical, fire, general accident, term and credit life, aviation, energy, agriculture, and political risk reinsurance products; and various reinsurance products for Takaful industry. Saudi Re for Cooperative Reinsurance Company was incorporated in 2008 and is based in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Reinsurance",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "13313-6684",
        "website": "http://www.saudire.net",
        "full_time_employees": null
    },
    "8210.SR": {
        "short_name": "Bupa Arabia for Cooperative Ins",
        "long_name": "Bupa Arabia for Cooperative Insurance Company",
        "summary": "Bupa Arabia for Cooperative Insurance Company underwrites medical insurance products for businesses and families in the Kingdom of Saudi Arabia. It issues short-term insurance contracts for providing health care services. The company was founded in 1997 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Specialty",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21436",
        "website": "http://www.bupa.com.sa",
        "full_time_employees": null
    },
    "8230.SR": {
        "short_name": "Al-Rajhi Company for Cooperativ",
        "long_name": "Al Rajhi Company for Cooperative Insurance",
        "summary": "Al Rajhi Company for Cooperative Insurance provides various insurance products and services to individuals, SMEs,  and corporates in the Kingdom of Saudi Arabia. The company operates in four segments: General, Motor, Health, and Protection and Savings. It offers motor, unified health, domestic helper, travel, medical malpractice, visitor visa, personal accident, and home owners, as well as general insurance products, such as property all risks, workers injury compensation and employer's liability, fidelity guarantee, and public business liability. The company also provides liability, contractors risk, marine cargo, plant machinery, machinery breakdown, and erection all risk insurance products; and protection and savings products, such as education, marriage, retirement, and investment insurance policies. It is also involved in the re-insurance and agency activities. The company was founded in 2008 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11517",
        "website": "http://www.alrajhitakaful.com",
        "full_time_employees": null
    },
    "8240.SR": {
        "short_name": "CHUBB Arabia Cooperative Insura",
        "long_name": "Chubb Arabia Cooperative Insurance Company",
        "summary": "Chubb Arabia Cooperative Insurance Company operates as a multiline property and casualty insurer in the Kingdom of Saudi Arabia. The company offers property and casualty insurance products comprising property all risks, fire and allied perils, business interruption, householders', terrorism and sabotage, burglary and housebreaking, general liability, workmen's compensation and employer's liability, motor, plate glass, money, crime, fidelity guarantee/employee dishonesty, and travel insurance products. It also provides engineering insurance products comprising contractors all risk, erection all risks, machinery breakdown, business interruption due to machinery breakdown, and computer/electronic data processing, as well as machinery, plant, and equipment all risks insurance products. In addition, the company offers marine cargo, project cargo and DSU, inland transit, and marine hull insurance products; group life and group personal accident insurance products; and financial insurance products, such as bankers blanket bond, financial institutions professional indemnity, civil liability for financial institutions, electronic and computer crime, fraud protector, financial services industry insurance policy, and directors and officers liability insurance. It serves multinational corporations and local businesses, companies, and affinity groups. Chubb Arabia Cooperative Insurance Company was founded in 1974 and is headquartered in Al Khobar, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Al Khobar",
        "zipcode": "31952",
        "website": "http://www.chubb.com/sa-en",
        "full_time_employees": null
    },
    "8250.SR": {
        "short_name": "AXA Cooperative Insurance Co.",
        "long_name": "AXA Cooperative Insurance Company",
        "summary": "AXA Cooperative Insurance Company provides various insurance and reinsurance products for individuals, SME, and business in Saudi Arabia. The company offers car, travel, home, personal accident, and SME fleet and health care insurance; and business insurance, including motor fleet, healthcare, business travel shield, marine, and group personal accident insurance, as well as visa extension services. It also provides money, business all risk, life, general third-party liability, product liability, workmen's compensation/employer's liability, contractors all risk, erection all risk, machinery and electronic equipment failure, death, and disability insurance. The company was founded in 2008 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11421",
        "website": "http://www.axa-cooperative.com",
        "full_time_employees": null
    },
    "8270.SR": {
        "short_name": "Buruj Cooperative Insurance Co.",
        "long_name": "Buruj Cooperative Insurance Company",
        "summary": "Buruj Cooperative Insurance Company provides various general insurance products to individuals and business entities in the Kingdom of Saudi Arabia. The company operates through five segments: Motor Insurance, Medical Products, Property, Marine Products, and Others. The company was incorporated in 2009 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11553",
        "website": "http://www.burujinsurance.com",
        "full_time_employees": null
    },
    "8280.SR": {
        "short_name": "Al Alamiya for Cooperative Insu",
        "long_name": "Al Alamiya for Cooperative Insurance Company",
        "summary": "Al Alamiya for Cooperative Insurance Company engages in the insurance and reinsurance businesses primarily in the Kingdom of Saudi Arabia. The company operates in six segments: Property, Motor, Engineering, Medical, Marine, Group Life, and Others. It offers car, travel, home, and personal accident insurance products; and small and medium business, motor fleet, property, marine, engineering, life, workmen's compensation, liability, and general accident insurance products. The company was founded in 2009 and is headquartered in Riyadh, the Kingdom of Saudi Arabia. Al Alamiya for Cooperative Insurance Company is a subsidiary of Royal and Sun Alliance Insurance (Middle East) BSC(c).",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11442",
        "website": "http://www.alalamiya.sa",
        "full_time_employees": null
    },
    "8300.SR": {
        "short_name": "Wataniya Insurance Co.",
        "long_name": "Wataniya Insurance Company",
        "summary": "Wataniya Insurance Company provides a range of insurance products and services in the Kingdom of Saudi Arabia. It operates through Marine, Property, Motor, Engineering, Accident & Liability, Extended Warranty, and Term Life segments. It offers various insurance products, such as motor insurance; general accident and casualty insurance products, including fidelity guarantee, money, personal accident, public liability, work injury, medical malpractice, burglary, glass breakage, business all risk, business travel, and exhibition insurance products; and liability insurance includes general third-party liability, product liability, workmen's compensation/employer's liability, and professional indemnity. The company also provides marine cargo insurance products, which include land transit, marine cargo, and marine hull insurance; employee benefits insurance; and engineering insurance products comprising contractor all risk, construction, mechanical, electrical, contractors' plant and machinery, electronic equipment, erection all risk, machinery breakdown, and deterioration of stock insurance. In addition, it offers property insurance products comprising property all risk, fire and lightning, household comprehensive, and terrorism risk insurance; extended warranty coverage against damages to motor vehicles; and term life coverage against the insured's death. The was founded in 1975 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21432",
        "website": "http://www.wataniya.com.sa",
        "full_time_employees": null
    },
    "8310.SR": {
        "short_name": "Amana Cooperative Insurance Co.",
        "long_name": "Amana Cooperative Insurance Company",
        "summary": "Amana Cooperative Insurance Company provides various insurance products and services to corporate and individual clients in the Kingdom of Saudi Arabia. The company offers engineering, fidelity, general, healthcare, marine cargo, money, motor, personal, property, travel, and workmen insurance products, as well as other specialized insurance solutions. Amana Cooperative Insurance Company was founded in 2010 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11427",
        "website": "http://www.amana.sa",
        "full_time_employees": null
    },
    "8311.SR": {
        "short_name": "Saudi Enaya Cooperative Insuran",
        "long_name": "Saudi Enaya Cooperative Insurance Company",
        "summary": "Saudi Enaya Cooperative Insurance Company provides health insurance services in the Kingdom of Saudi Arabia. It primarily underwrites medical insurance products for group and individual clients. The company was incorporated in 2012 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Reinsurance",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "23435",
        "website": "http://www.saudienaya.com",
        "full_time_employees": null
    },
    "8312.SR": {
        "short_name": "Alinma Tokio Marine Co.",
        "long_name": "Alinma Tokio Marine Company",
        "summary": "Alinma Tokio Marine Company provides various insurance products and services to individuals and corporates in the Kingdom of Saudi Arabia. It operates through Property and Casualty, Motor, Protection and Savings, and Medical segments. The company offers insurance products in the areas of protection and savings programs; motor; and fidelity guarantee, commercial general liability, trade credit, personal accident, money, bankers blanket bond, hauliers and public liability, and workers compensation. It also provides business interruption, fire and special perils, home package, and property all risk insurance products; health insurance products; marine cargo and cargo voyage risks insurance products; and boiler and pressure vessel, contractor's all risk, contractors' plant and machinery insurance, deterioration of stock in cold storage, electronic equipment, erection all risks, loss of profits following machinery breakdown, and machinery insurance. The company was founded in 2012 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11421",
        "website": "http://www.atmc.com.sa",
        "full_time_employees": null
    },
    "9511.SR": {
        "short_name": "Sumou Real Estate Co.",
        "long_name": "Sumou Real Estate Company",
        "summary": "Sumou Real Estate Company engages in the development, management, maintenance, sale, and rental of residential and non-residential properties in Saudi Arabia. It also engages in the general building contracts, including construction, repair and renovation, and demolition for residential compounds, commercial centers, educational and entertainment, health and sports facilities, and hotels and restaurants; the provision of real estate project management services; and investment in real estate and project development. The company was founded in 2007 and is based in Al Khobar, Saudi Arabia. Sumou Real Estate Company is a subsidiary of Sumou Holding Company.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Al Khobar",
        "zipcode": "31952",
        "website": "http://www.sumou.com.sa",
        "full_time_employees": null
    },
    "9512.SR": {
        "short_name": "Riyadh Cement Co.",
        "long_name": "Riyadh Cement Co.",
        "summary": "Saudi White Cement Company manufactures, produces, and markets various types of clinker and cement in the Kingdom of Saudi Arabia. The company was founded in 1997 and is headquartered in Dammam, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Dammam",
        "zipcode": "11494",
        "website": "http://sawcem.com.sa",
        "full_time_employees": null
    }
}