{
    "AEGN.AT": {
        "short_name": "AEGEAN AIRLINES (CR)",
        "long_name": "Aegean Airlines S.A.",
        "summary": "Aegean Airlines S.A., an airline company, provides public airline transportation services in Greece and internationally. It transports passengers and goods through scheduled and unscheduled flights; and offers aviation, technical support, and ground handling aircraft services. As of June 25, 2020, it operated a fleet of 65 aircraft, 53 jet aircraft, and 12 turboprop aircraft. Aegean Airlines S.A. was founded in 1988 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Major Airlines",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "ANEK.AT": {
        "short_name": "ANEK LINES S.A.(CR)",
        "long_name": "Anonimi Naftiliaki Etaria Kritis S.A.",
        "summary": "Anonimi Naftiliaki Etareia Kritis S.A. operates in the passenger shipping sector. It also transports cargo. The company owns and charters vessels in routes of Adriatic Sea, Crete, Dodecanese, and Cyclades. It provides transportation services to approximately 1,044 thousand passengers. The company also produces and trades in plastic bottles and packaging products; and offers tourism and consulting services. Anonimi Naftiliaki Etareia Kritis S.A. was founded in 1967 and is based in Chania, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Chania"
    },
    "ANEP.AT": {
        "short_name": "ANEK LINES S.A.(PR, issue '90)",
        "long_name": "Anonimi Naftiliaki Etaria Kritis S.A.",
        "summary": "Anonimi Naftiliaki Etareia Kritis S.A. operates in the passenger shipping sector. It also transports cargo. The company owns and charters vessels in routes of Adriatic Sea, Crete, Dodecanese, and Cyclades. It provides transportation services to approximately 1,044 thousand passengers. The company also produces and trades in plastic bottles and packaging products; and offers tourism and consulting services. Anonimi Naftiliaki Etareia Kritis S.A. was founded in 1967 and is based in Chania, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Chania"
    },
    "ANEPO.AT": {
        "short_name": "ANEK LINES S.A.(PR, issue '96)",
        "long_name": "Anonimi Naftiliaki Etaria Kritis S.A.",
        "summary": "Anonimi Naftiliaki Etareia Kritis S.A. operates in the passenger shipping sector. It also transports cargo. The company owns and charters vessels in routes of Adriatic Sea, Crete, Dodecanese, and Cyclades. It provides transportation services to approximately 1,044 thousand passengers. The company also produces and trades in plastic bottles and packaging products; and offers tourism and consulting services. Anonimi Naftiliaki Etareia Kritis S.A. was founded in 1967 and is based in Chania, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Chania"
    },
    "ATEK.AT": {
        "short_name": "ATTICA PUBLICATIONS S.A. (CR)",
        "long_name": "Attica Publications S.A.",
        "summary": "Attica Publications S.A. publishes magazines in Greece and internationally. It also operates radio stations. Attica Publications S.A. was founded in 1994 and is based in Marousi, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Publishing - Newspapers",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Marousi"
    },
    "ATTICA.AT": {
        "short_name": "ATTICA HOLDINGS SA",
        "long_name": "Attica Holdings S.A.",
        "summary": "Attica Holdings S.A., through its subsidiaries, provides passenger shipping and travel agency services in Greece and internationally. The company's vessels offer transportation services to passengers, private vehicles, and freight. It owns and operates 30 vessels, 20 Ro-Pax ferries, 9 high-speed vessels, and 1 Ro-Ro vessel under the Superfast Ferries, Blue Star Ferries, and Hellenic Seaways brands. The company was founded in 1918 and is headquartered in Kallithea, Greece. Attica Holdings S.A. is a subsidiary of MIG Shipping S.A.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Kallithea"
    },
    "AVE.AT": {
        "short_name": "AVE S.A",
        "long_name": "AVE S.A.",
        "summary": "AVE S.A. engages in the distribution of DVD and Blue-ray video films primarily in Greece and Cyprus. The company also operates cinemas; and amusement parks, such as Allou Fun Park. The company was formerly known as Audio Visual Enterprises S.A. and changed its name to AVE S.A. in June 2020. AVE S.A. was founded in 1982 and is based in Marousi, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Entertainment - Diversified",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Marousi"
    },
    "CENTR.AT": {
        "short_name": "CENTRIC HOLDINGS S.A.",
        "long_name": "Centric Holdings S.A.",
        "summary": "Centric Holdings S.A. provides on-board entertainment services on vessels, hotels, and yachts. It also offers mass catering and tourist accommodation services, as well as technology services at sea. In addition, the company engages in renewable energy and commercial real estate business. Centric Holdings S.A. was founded in 1995 and is headquartered in Moschato, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Gaming Activities",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Moschato"
    },
    "ELGEK.AT": {
        "short_name": "ELGEKA S.A (CR)",
        "long_name": "Elgeka S.A.",
        "summary": "Elgeka S.A. operates in the food sector primarily in Greece. The company trades in food and other consumer products; and provides logistics services, such as storage, distribution, and repackaging services, as well as offers real estate management services. Elgeka S.A. was founded in 1974 and is based in Thessaloniki, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Food Wholesale",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Thessaloniki"
    },
    "EVROF.AT": {
        "short_name": "EVROFARMA S.A. (CR)",
        "long_name": "Evrofarma SA",
        "summary": "Evrofarma SA produces and sells dairy products in Greece. It offers milk and liquids, ayran, cheese and organic cheese, and yogurt. The company also exports its products to 13 countries. Evrofarma SA was founded in 1991 and is based in Didymoteicho, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Food Wholesale",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Didymoteicho"
    },
    "FOODL.AT": {
        "short_name": "FOODLINK S.A(CR)",
        "long_name": "Foodlink A.E.",
        "summary": "Foodlink A.E. primarily provides integrated logistics services. It offers warehousing, transportation, supply chain, co-packing, cross docking, and e-commerce delivery services, as well as international forwarding services, such as road, sea, and air transportation services. The company also develops logistics management systems, including warehouse and transport management systems. In addition, it provides value added services, including logistics consulting, change management, and logistics engineering, as well as distribution services, such as solutions for frozen, chilled, climatized, and ambient temperature ranges; full truck loads and less-than-truck loads door-to-door services; reverse logistics; and special deliveries comprising special equipment, spare-parts, small parcels, express, gifts, etc. The company serves various industries, such as FMCG, wholesale, high tech, tobacco, and pharmaceutical and healthcare. It operates through a network of 13 distribution centers in Greece and 5 distribution Centers in Cyprus, as well as in France, Spain, the United Kingdom, Portugal, Netherlands, Poland, and Italy. Foodlink A.E. was founded in 1997 and is based in Aspropyrgos, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Air Delivery & Freight Services",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Aspropyrgos"
    },
    "FOYRK.AT": {
        "short_name": "FOURLIS S.A (CR)",
        "long_name": "Fourlis Holdings S.A.",
        "summary": "Fourlis Holdings S.A., together with its subsidiaries, engages in the retail trading activities in Greece, Romania, Cyprus, Bulgaria, Turkey, and internationally. It is involved in the retail trade of home furniture and household goods through IKEA stores; and sporting goods through INTERSPORT and TAF stores. As of December 31, 2019, the company operated 16 TAF stores, including 13 in Greece and three in Turkey. It also operates 7 IKEA stores, including 5 stores in Greece, 1 in Cyprus, and 1 in Bulgaria; 6 pick-up and order points in Greece and 3 pick-up and order points in Bulgaria; and 3 e-commerce stores in Greece, Cyprus, and Bulgaria. In addition, the company operates 119 INTERSPORT stores, including 50 stores in Greece, 31 in Romania, 24 in Turkey, 9 in Bulgaria, and 6 in Cyprus, as well as e-commerce stores in Greece, Romania, and Cyprus. Further, it has franchised sporting goods stores under the THE ATHLETE'S FOOT name in Greece and Turkey; and provides catering services in Greece, Cyprus, and Bulgaria, as well as warehousing services. The company was formerly known as Fourlis Bros S.A. and changed its name to Fourlis Holding S.A. in March 2000. Fourlis Holding S.A. was founded in 1950 and is headquartered in Marousi, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Specialty Retail, Other",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Marousi"
    },
    "GEBKA.AT": {
        "short_name": "GEN.COMMERCIAL & IND (CR)",
        "long_name": "General Commercial & Industrial S.A.",
        "summary": "General Commercial & Industrial S.A. supplies industrial and hydraulic equipment in Greece and East European countries. It trades in ready-made clothing, underwear, and linen and children's items. The company is also involved in producing, marketing, and supplying energy from renewable energy sources and conventional fuels for domestic, industrial, and other uses. It serves customers in construction, industrial, shipping, and oil industries. The company was founded in 1966 and is based in Aspropyrgos, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Industrial Equipment Wholesale",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Aspropyrgos"
    },
    "HAIDE.AT": {
        "short_name": "HAIDEMENOS (CR)",
        "long_name": "Haidemenos S.A.",
        "summary": "Haidemenos S.A. operates as a printing company in Europe and Africa. It offers magazine and newspaper, catalog, and book printing services; commercial printing services comprising catalogs, flyers, sales and promotional materials, loyalty programms, newsletters, annual reports, signage, indoor and outdoor banners, stands, and floor graphics. In addition, it offers promotional and POP stands; retail insert printing solutions; and outdoor printing solutions. The company also provides digital printing services. It serves retail, IT, electronics, communication, automotive, hospitality, consumer goods, publishing, fashion and clothing; and entertainment industries, as well as AD agencies; health, insurance, and pharmaceutical companies; shopping malls; and organizations like airports, museums, confederations, and foundations. Haidemenos S.A. was founded in 1976 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Business Services",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "INLOT.AT": {
        "short_name": "INTRALOT S.A. (CR)",
        "long_name": "Intralot S.A. Integrated Lottery Systems and Services",
        "summary": "Intralot S.A. Integrated Lottery Systems and Services supplies integrated gaming and transaction processing systems, game content, sports betting management, and interactive gaming services to state-licensed gaming organizations worldwide. The company supplies hardware and software, including gaming machines, central computer systems, gaming software, communication systems, etc., as well as offers installation, technical support, and maintenance services to lotteries. It is also involved in the design, organization, and/or management of games; advertising and sales promotion activities; establishment of sales network; and provision of risk management for fixed odds games, etc., as well as game operating services. The company was founded in 1992 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Gaming Activities",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "KMOL.AT": {
        "short_name": "KARAMOLEGOS BAKERY INDUSTRY",
        "long_name": "Karamolengos Bakery Industry S.A.",
        "summary": "Karamolengos Bakery Industry S.A. manufactures and sells bakery products in Greece. It offers toast bread, sliced bread, buns, pies, wheat bread, and crumbs. The company was founded in 1950 and is based in Koropi, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Grocery Stores",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Koropi"
    },
    "KREKA.AT": {
        "short_name": "KRE.KA S.A. (CR)",
        "long_name": "Kre.Ka. S.A.",
        "summary": "Kre.Ka. S.A. engages in breeding, slaughtering, producing, and selling meat products primarily in Greece. The company offers various types of fresh and frozen meat products, including cattle, pork, lamb, sheep and goat, poultry, and beef products; and gyros, skewers, hamburgers, stewed meatballs, kokoretsi, and kebabs. It also provides fresh and frozen products based on meat, such as smoked products, sausages, and parizaki. In addition, the company is involved in the production of biogas, electric and thermal energy, and organic fertilizers; and provision of environmental management services of solid and liquid waste. It also exports its products. The company is headquartered in Kavala, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Food Wholesale",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Kavala"
    },
    "LAMPS.AT": {
        "short_name": "Lampsa Hotel Co. (C)",
        "long_name": "Lampsa Hellenic Hotels S.A.",
        "summary": "Lampsa Hellenic Hotels S.A. operates hotels primarily in Greece, Cyprus, and Serbia. The company operates the Hotel Grande Bretagne that includes 320 rooms and suites located in Athens; the King George hotel with 59 rooms and 43 suites in Athens; and the Sheraton Rhodes Resort, which comprises 401 guestrooms situated on the island of Rhodes. It also operates the Hyatt Regency Hotel that includes 301 luxury rooms, suites, and facilities for recreation and dining located in Belgrade; and the Hotel Excelsior, which has 76 rooms, 2 junior suites, a banquet area, and a restaurant located in Belgrade. Lampsa Hellenic Hotels S.A. was founded in 1919 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Lodging",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "LIVAN.AT": {
        "short_name": "LIVANI PUBLISHING ORG. S.A.",
        "long_name": "Livanis Publications SA",
        "summary": "Livanis Publications SA operates as a publishing company in Lebanon. The company publishes books, educational CD-ROMs, magazines, and commercial software applications, as well as provides feasibility studies and Internet services. It offers educational books, as well as books in the areas of literature, political economy, children, sciences, psychology, and various other issues. Livanis Publications SA was founded in 1972 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Publishing - Newspapers",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "LYK.AT": {
        "short_name": "INFORM P.LYKOS HOLD. S.A. (CR)",
        "long_name": "Inform P. Lykos Holdings S.A.",
        "summary": "Inform P. Lykos Holdings S.A. engages in the information management and digital security services business in Greece, Romania, and internationally. It offers printing products, such as business forms, paper rolls, security forms, and commercial printing. The company also provides business process outsourcing services, including physical and digital statement and bill printing, fulfilment, electronic bill presentment, card personalization, loyalty software applications, and printing management services for financial institutions, telecommunication companies, transport and infrastructure sectors, and retail and leisure companies, as well as public sector organizations. It offers information management services under the INFORM brand. The company was formerly known as Inform P. Lykos S.A. and changed its name to Inform P. Lykos Holdings S.A. in 2020. Inform P. Lykos Holdings S.A. was founded in 1897 and is headquartered in Koropi, Greece. Inform P. Lykos Holdings S.A. is a subsidiary of AUSTRIACARD HOLDINGS AG.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Business Services",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Koropi"
    },
    "MOTO.AT": {
        "short_name": "Cars,Motorcyc.&mar.eng.tr.&imp",
        "long_name": "Emporiki Eisagogiki Aftokiniton Ditrohon kai Mihanon Thalassis Societe Anonyme",
        "summary": "Emporiki Eisagogiki Aftokiniton Ditrohon kai Mihanon Thalassis Societe Anonyme operates in the automobile, wholesale, and retail markets for motorized two-wheelers and marine products in Greece and internationally. The company engages in the import, representation, distribution, and trade of cars and motorcycles; marine products, including outboard motors, inflatable boats, and jet skis; spare parts; and lubricants. It is also involved in the import, trade, agency, distribution, maintenance, repair, and assembly of motorcycles, motorbikes, machinery, machines, and various types of motors. In addition, the company engages in the representation, distribution, re-export, logistics, and trading of Yamaha brand products in Romania and Bulgaria. Further, it is involved in the car rental business. Emporiki Eisagogiki Aftokiniton Ditrohon kai Mihanon Thalassis Societe Anonyme was founded in 1969 and is based in Aspropyrgos, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Auto Dealerships",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Aspropyrgos"
    },
    "NAKAS.AT": {
        "short_name": "NAKAS MUSIC",
        "long_name": "Philippos Nakas S.A.",
        "summary": "Philippos Nakas S.A. distributes musical instruments in Greece. The company operates stores that offer acoustic musical instruments, including pianos, guitars, percussions, wind instruments, strings, etc.; and electronic musical instruments, such as keyboards, electric pianos, electric guitars, electric basses, guitar amplifiers, synthesizers, samplers, multi-effects, midi-files, etc. Its stores also provide consumer electronics-home systems comprising amplifiers, radio amplifiers, CD and DVD players, CD recorders, plasma TV, projectors, speakers, headphones, cables, and audio mounts and furniture; and professional-audiovisual systems that include mixing consoles, microphones, public address systems, intercom systems, guiding systems, conference systems, telecom systems, stands, and accessories. In addition, the company's stores offer professional lighting systems, which comprise moving heads, theater lightings, light effects for clubs, truss systems, architectural lighting system LEDs, etc.; professional computer audio products, including sound cards, sound and music software, DSP cards, interfaces and remotes, midi keyboards, etc.; and multimedia products, such as TV cards, video cards, Web cameras, PC and headphones, and DJ products for PC applications. Further, it publishes music books; and operates Keyboard Music Schools and Philippos Nakas conservatory. The company was founded in 1937 and is headquartered in Paiania, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Specialty Retail, Other",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Paiania"
    },
    "NEWS.AT": {
        "short_name": "NEWSPHONE HELLAS S.A (CR)",
        "long_name": "Newsphone Hellas S.A.",
        "summary": "Newsphone Hellas S.A. provides communication, content, and application services through alternative networks of fixed and mobile telephony, and the Internet in Greece and internationally. It offers value added services, including interactive and up-to-date services to mass media (TV and radio stations), consumer products companies, mobile telephony companies, etc.; designs and implements mobile marketing programs for large companies in various sectors; provides informative services that enable users to obtain real-time access to preferred information through live communication, recorded messages, the Internet, or teletext; and offers entertainment services for mobile phones, which include ringtones, real tones, full track downloads, Java games, SMS/MMS applications, community services, and mobile WAP portals/i-mode sites. The company also provides its value added services to end users or businesses through various types of communications, such as voice, SMS, MMS, e-Commerce, WAP, etc. In addition, it develops m-government applications, platforms for synchronous and asynchronous distant training of the CSCs employees, and other e-government projects; provides telephone directory assistance services; and develops vertical portals for information retrieval. The company was founded in 1995 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Business Services",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "OLTH.AT": {
        "short_name": "THESSALONIKI PORT AUTHORITY",
        "long_name": "Thessaloniki Port Authority Societe Anonyme",
        "summary": "Thessaloniki Port Authority Societe Anonyme engages in the management and exploitation of the port of Thessaloniki located in Greece. It operates through four segments: Container Terminal, Conventional Cargo, Passenger Traffic, and Utilization of Facilities. The company provides conventional cargo handling services, including loading and unloading services, and SILO services; and containerized cargo handling services. It also offers ships anchoring, mooring, berthing, and other services; and services to passengers on coastal and cruise ships and in transit. In addition, it offers spaces for commercial and other uses; and operates car parking stations. The company primarily serves industries, shipping agents, container transportation companies, and freight transport companies. Thessaloniki Port Authority Societe Anonyme was established in 1999 and is based in Thessaloniki, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Thessaloniki"
    },
    "OPAP.AT": {
        "short_name": "OPAP S.A. (CR)",
        "long_name": "Greek Organization of Football Prognostics S.A.",
        "summary": "Greek Organization of Football Prognostics S.A., together with its subsidiaries, operates and manages numerical lottery and sports betting games. It operates through Lotteries, Sports Betting, Instant & Passives, VLTs, Telecommunication & eMoney Services, and Other segments. The company holds rights to conduct, manage, organize, and operate six numerical lottery games comprising TZOKER, LOTTO, PROTO, EXTRA 5, SUPER 3, and KINO; three sports and other betting games, such as PAME STOIXIMA, PAME STOIXIMA Virtual Sports, PROPO, PROPOGOAL, and HORSE RACING STOIXIMA; three lottery games, including LAIKO, ETHNIKO, and STATE; and Instant SCRATCH games. It also holds license for the instalment and operation of 35,000 video lottery terminals. In addition, the company provides transaction services through electronic means; and intangible talk time selling and bill payments services. Further, it organizes and conducts terrestrial, land-based, and online horseracing mutual betting; and provides software services. The company offers its products and services through online and distribution networks, including agents, street vendors, retailers, wholesalers, and 9,468 points of sales in Greece; 428 play stores; and 199 stores in Cyprus. Greek Organisation of Football Prognostics S.A. was founded in 1958 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Gaming Activities",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "OTOEL.AT": {
        "short_name": "AUTOHELLAS S.A. (CR)",
        "long_name": "Autohellas S.A.",
        "summary": "Autohellas S.A. provides vehicle renting and leasing services under the Hertz brand. The company operates through three segments: Car Rental, Car & Spare Parts Trade and Services, and Car Rental. It offers occasional and small duration rental services to individuals and companies; maintenance, repair, and fleet management services; and consulting and managerial support, as well as car, light truck, and equipment rental services. The company is also involved in the trade of new and used cars of various brands, such as FORD, OPEL, SEAT, FIAT, ALPHA ROMEO, HONDA, SAAB, ABARTH, MITSUBISHI, BMW, MOTO, MINI, HYUNDAI, KIA, and VOLVO; and provision of related after sales support services. It operates through a network of 100 stations in Greece, Bulgaria, Romania, Croatia, Serbia, Montenegro, Ukraine, and Cyprus. The company was formerly known as Hertz Hellas and changed its name to Autohellas S.A. in 1974. Autohellas S.A. was founded in 1962 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Rental & Leasing Services",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "PPA.AT": {
        "short_name": "PIREUS PORT AUTHORITY S.A (CR)",
        "long_name": "Piraeus Port Authority S.A.",
        "summary": "Piraeus Port Authority S.A. provides port services at the port of Piraeus, Greece. The company operates through Container Terminal, Handling Car, Coasting, Cruise, Ship Repairing, and Other segments. It offers anchoring services of vessels, cargo handling, loading, and unloading services, as well as goods storage and car transportation services. The company is also involved in maintenance of port facilities. In addition, it offers port services, including water, electricity, space management, merchandise management, and telephone connection to ships; and services to travelers, as well as rents space to third parties. The company was founded in 1930 and is based in Piraeus, Greece. Piraeus Port Authority S.A. is a subsidiary of COSCO SHIPPING (Hong Kong) Limited.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Piraeus"
    },
    "PRESD.AT": {
        "short_name": "GEKE S.A. (CR)",
        "long_name": "Geke S.A.",
        "summary": "Geke S.A. engages in the hotel business. It operates the President Hotel, which consists of rooms, parking facilities, lobby bar, meeting/banquet and event facilities, library, games room, and various other services, as well as penthouse pool. The company is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Lodging",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    }
}