{
  "HAIDE.AT": {
    "city": "Athens",
    "country": "Greece",
    "currency": "EUR",
    "exchange": "ATH",
    "industry": "Business Services",
    "long_name": "Haidemenos S.A.",
    "market": "gr_market",
    "market_cap": "Nano Cap",
    "sector": "Services",
    "short_name": "HAIDEMENOS (CR)",
    "state": null,
    "summary": "Haidemenos S.A. operates as a printing company in Europe and Africa. It offers magazine and newspaper, catalog, and book printing services; commercial printing services comprising catalogs, flyers, sales and promotional materials, loyalty programms, newsletters, annual reports, signage, indoor and outdoor banners, stands, and floor graphics. In addition, it offers promotional and POP stands; retail insert printing solutions; and outdoor printing solutions. The company also provides digital printing services. It serves retail, IT, electronics, communication, automotive, hospitality, consumer goods, publishing, fashion and clothing; and entertainment industries, as well as AD agencies; health, insurance, and pharmaceutical companies; shopping malls; and organizations like airports, museums, confederations, and foundations. Haidemenos S.A. was founded in 1976 and is based in Athens, Greece.",
    "website": "http://www.haidemenos.gr",
    "zipcode": "174 56"
  },
  "LYK.AT": {
    "city": "Koropi",
    "country": "Greece",
    "currency": "EUR",
    "exchange": "ATH",
    "industry": "Business Services",
    "long_name": "Inform P. Lykos Holdings S.A.",
    "market": "gr_market",
    "market_cap": "Nano Cap",
    "sector": "Services",
    "short_name": "INFORM P.LYKOS HOLD. S.A. (CR)",
    "state": null,
    "summary": "Inform P. Lykos Holdings S.A. engages in the information management and digital security services business in Greece, Romania, and internationally. It offers printing products, such as business forms, paper rolls, security forms, and commercial printing. The company also provides business process outsourcing services, including physical and digital statement and bill printing, fulfilment, electronic bill presentment, card personalization, loyalty software applications, and printing management services for financial institutions, telecommunication companies, transport and infrastructure sectors, and retail and leisure companies, as well as public sector organizations. It offers information management services under the INFORM brand. The company was formerly known as Inform P. Lykos S.A. and changed its name to Inform P. Lykos Holdings S.A. in 2020. Inform P. Lykos Holdings S.A. was founded in 1897 and is headquartered in Koropi, Greece. Inform P. Lykos Holdings S.A. is a subsidiary of AUSTRIACARD HOLDINGS AG.",
    "website": "http://www.informlykos.com",
    "zipcode": "19400"
  },
  "NEWS.AT": {
    "city": "Athens",
    "country": "Greece",
    "currency": "EUR",
    "exchange": "ATH",
    "industry": "Business Services",
    "long_name": "Newsphone Hellas S.A.",
    "market": "gr_market",
    "market_cap": "Nano Cap",
    "sector": "Services",
    "short_name": "NEWSPHONE HELLAS S.A (CR)",
    "state": null,
    "summary": "Newsphone Hellas S.A. provides communication, content, and application services through alternative networks of fixed and mobile telephony, and the Internet in Greece and internationally. It offers value added services, including interactive and up-to-date services to mass media (TV and radio stations), consumer products companies, mobile telephony companies, etc.; designs and implements mobile marketing programs for large companies in various sectors; provides informative services that enable users to obtain real-time access to preferred information through live communication, recorded messages, the Internet, or teletext; and offers entertainment services for mobile phones, which include ringtones, real tones, full track downloads, Java games, SMS/MMS applications, community services, and mobile WAP portals/i-mode sites. The company also provides its value added services to end users or businesses through various types of communications, such as voice, SMS, MMS, e-Commerce, WAP, etc. In addition, it develops m-government applications, platforms for synchronous and asynchronous distant training of the CSCs employees, and other e-government projects; provides telephone directory assistance services; and develops vertical portals for information retrieval. The company was founded in 1995 and is based in Athens, Greece.",
    "website": "http://www.newsphone.gr",
    "zipcode": "176 75"
  }
}
