{
    "ELGEK.AT": {
        "short_name": "ELGEKA S.A (CR)",
        "long_name": "Elgeka S.A.",
        "summary": "Elgeka S.A. operates in the food sector primarily in Greece. The company trades in food and other consumer products; and provides logistics services, such as storage, distribution, and repackaging services, as well as offers real estate management services. Elgeka S.A. was founded in 1974 and is based in Thessaloniki, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Food Wholesale",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Thessaloniki",
        "zipcode": "570 22",
        "website": "http://www.elgeka.gr",
        "market_cap": "Small Cap"
    },
    "EVROF.AT": {
        "short_name": "EVROFARMA S.A. (CR)",
        "long_name": "Evrofarma SA",
        "summary": "Evrofarma SA produces and sells dairy products in Greece. It offers milk and liquids, ayran, cheese and organic cheese, and yogurt. The company also exports its products to 13 countries. Evrofarma SA was founded in 1991 and is based in Didymoteicho, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Food Wholesale",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Didymoteicho",
        "zipcode": "68300",
        "website": "http://www.evrofarma.gr",
        "market_cap": "Small Cap"
    },
    "KREKA.AT": {
        "short_name": "KRE.KA S.A. (CR)",
        "long_name": "Kre.Ka. S.A.",
        "summary": "Kre.Ka. S.A. engages in breeding, slaughtering, producing, and selling meat products primarily in Greece. The company offers various types of fresh and frozen meat products, including cattle, pork, lamb, sheep and goat, poultry, and beef products; and gyros, skewers, hamburgers, stewed meatballs, kokoretsi, and kebabs. It also provides fresh and frozen products based on meat, such as smoked products, sausages, and parizaki. In addition, the company is involved in the production of biogas, electric and thermal energy, and organic fertilizers; and provision of environmental management services of solid and liquid waste. It also exports its products. The company is headquartered in Kavala, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Food Wholesale",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Kavala",
        "zipcode": "642 00",
        "website": "http://www.kreka.gr",
        "market_cap": "Small Cap"
    }
}