{"FOYRK.AT": {"short_name": "FOURLIS S.A (CR)", "long_name": "Fourlis Holdings S.A.", "summary": "Fourlis Holdings S.A., together with its subsidiaries, engages in the retail trading activities in Greece, Romania, Cyprus, Bulgaria, Turkey, and internationally. It is involved in the retail trade of home furniture and household goods through IKEA stores; and sporting goods through INTERSPORT and TAF stores. As of December 31, 2019, the company operated 16 TAF stores, including 13 in Greece and three in Turkey. It also operates 7 IKEA stores, including 5 stores in Greece, 1 in Cyprus, and 1 in Bulgaria; 6 pick-up and order points in Greece and 3 pick-up and order points in Bulgaria; and 3 e-commerce stores in Greece, Cyprus, and Bulgaria. In addition, the company operates 119 INTERSPORT stores, including 50 stores in Greece, 31 in Romania, 24 in Turkey, 9 in Bulgaria, and 6 in Cyprus, as well as e-commerce stores in Greece, Romania, and Cyprus. Further, it has franchised sporting goods stores under the THE ATHLETE'S FOOT name in Greece and Turkey; and provides catering services in Greece, Cyprus, and Bulgaria, as well as warehousing services. The company was formerly known as Fourlis Bros S.A. and changed its name to Fourlis Holding S.A. in March 2000. Fourlis Holding S.A. was founded in 1950 and is headquartered in Marousi, Greece.", "currency": "EUR", "sector": "Services", "industry": "Specialty Retail, Other", "exchange": "ATH", "market": "gr_market", "country": "Greece", "city": "Marousi"}, "NAKAS.AT": {"short_name": "NAKAS MUSIC", "long_name": "Philippos Nakas S.A.", "summary": "Philippos Nakas S.A. distributes musical instruments in Greece. The company operates stores that offer acoustic musical instruments, including pianos, guitars, percussions, wind instruments, strings, etc.; and electronic musical instruments, such as keyboards, electric pianos, electric guitars, electric basses, guitar amplifiers, synthesizers, samplers, multi-effects, midi-files, etc. Its stores also provide consumer electronics-home systems comprising amplifiers, radio amplifiers, CD and DVD players, CD recorders, plasma TV, projectors, speakers, headphones, cables, and audio mounts and furniture; and professional-audiovisual systems that include mixing consoles, microphones, public address systems, intercom systems, guiding systems, conference systems, telecom systems, stands, and accessories. In addition, the company's stores offer professional lighting systems, which comprise moving heads, theater lightings, light effects for clubs, truss systems, architectural lighting system LEDs, etc.; professional computer audio products, including sound cards, sound and music software, DSP cards, interfaces and remotes, midi keyboards, etc.; and multimedia products, such as TV cards, video cards, Web cameras, PC and headphones, and DJ products for PC applications. Further, it publishes music books; and operates Keyboard Music Schools and Philippos Nakas conservatory. The company was founded in 1937 and is headquartered in Paiania, Greece.", "currency": "EUR", "sector": "Services", "industry": "Specialty Retail, Other", "exchange": "ATH", "market": "gr_market", "country": "Greece", "city": "Paiania"}}