{
    "BEW.F": {
        "short_name": "DIVERSIFIED ROYALTY",
        "long_name": "Diversified Royalty Corp.",
        "summary": "Diversified Royalty Corp., a multi-royalty corporation, engages in the acquisition of royalties from multi-location businesses and franchisors in North America. It owns the Mr. Lube, AIR MILES, Sutton, Mr. Mikes, Nurse Next Door, and Oxford Learning Centres trademarks. The company was formerly known as BENEV Capital Inc. and changed its name to Diversified Royalty Corp. in September 2014. Diversified Royalty Corp. was founded in 1992 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "BIMO": {
        "short_name": "BIONEUTRA INTERNATIONAL LTD",
        "long_name": "BioNeutra International, Ltd.",
        "summary": "SuperVision Entertainment, Inc. provides hi tech alternate power systems and environment products. It offers amazing SuperMag technology, which develops electricity from magnetic fields. The company also produces film about the rise of the new King of Canada and the United States. SuperVision Entertainment, Inc. was incorporated in 1984 and is based in Edmonton, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Edmonton"
    },
    "BTCWF": {
        "short_name": "BLUESKY DIGITAL ASSETS CORP",
        "long_name": "Bluesky Digital Assets Corp.",
        "summary": "Bluesky Digital Assets Corp. operates as a digital assets and AI software focused virtual mining company. It mines digital currencies, such as Bitcoin and Ether; and offers value-added technology services for the digital currency market, such as digital mining proprietary methods and applications. The company was formerly known as Gunpowder Capital Corp. and changed its name to Bluesky Digital Assets Corp. in December 2019. Bluesky Digital Assets Corp. is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "DE.V": {
        "short_name": "DECISIVE DIVIDEND CORPORATION",
        "long_name": "Decisive Dividend Corporation",
        "summary": "Decisive Dividend Corporation, through its subsidiaries, manufactures and sells wood and gas burning stoves and fireplace inserts in Canada, the United States, and New Zealand. It operates through Finished Product and Component Manufacturing segments. The company also designs, manufactures, and markets air blast sprayers for agricultural industry under the Turbo Mist brand; and wastewater evaporation systems used in mining and oil industries worldwide. In addition, it designs and distributes wear parts, including diverter valves, apron feeder pans, grinding mill liners, hammers and blow bars, grizzly panels, and cooler grates for the cement, mining, oil and gas, aggregate, and coal industries worldwide. Further, the company offers professional manufacturing, machine work, assembly, and testing services for various industries in North America; and steel and aluminum fabrication and manufacturing services for OEMs, aftermarket components and products, and custom assemblies in various industries. Decisive Dividend Corporation was incorporated in 2012 and is headquartered in Kelowna, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Kelowna"
    },
    "EKNL": {
        "short_name": "EKO INTERNATIONAL CORPORATION",
        "long_name": "EKO International Corp.",
        "summary": "EKO International Corp., through its joint venture interest in NeuroVasc Clinical Inc., promotes and distributes frequency rhythmic electrical modulation system equipment used in the treatment of peripheral neuropathy in Canada. The company, through its joint venture interest in NeuroVasc Clinical Inc., also sets up and/or manage clinics to treat patients using FREMSTM equipment. EKO International Corp. is based in Burlington, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Burlington"
    },
    "FUNN": {
        "short_name": "AMFIL TECHNOLOGIES INC",
        "long_name": "Amfil Technologies Inc.",
        "summary": "Amfil Technologies Inc., through its subsidiary, Interloc-Kings Inc., provides landscape construction and snow removal services in Canada. It supplies and installs a range of interlocking stones for driveways, as well as offers fencing design services, and residential or commercial snow clearing services. The company, through its subsidiary, Snakes & Lagers Inc., operates a tabletop gaming bar and cafe located in Toronto, Ontario. In addition, Amfil Technologies Inc., through its other subsidiary, provides ozone based antimicrobial systems, which eliminate of bacteria, mold, and other pathogens from cannabis cultivation facilities, reducing or eliminating the need for harsh chemicals and pesticides during the cultivation process. The antimicrobial systems used to treat hydroponic reservoirs, plants, and surrounding surface areas during various stages of the grow cycle. Amfil Technologies, Inc. was founded in 2009 and is based in Markham, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Markham"
    },
    "GCCC.V": {
        "short_name": "GCC GLOBAL CAPITAL CORPORATION",
        "long_name": "GCC Global Capital Corporation",
        "summary": "GCC Global Capital Corporation primarily focuses on investing in the natural resources, real estate, and high-tech industries. The company was formerly known as CWN Mining Acquisition Corporation and changed its name to GCC Global Capital Corporation in January 2018. GCC Global Capital Corporation was incorporated in 2012 and is headquartered in Richmond, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Richmond"
    },
    "ICBT": {
        "short_name": "ICBS LTD",
        "long_name": "ICBS, Ltd.",
        "summary": "ICBS Ltd. provides mergers and acquisitions (M&A) advisory services. It also invests in various businesses. The company was incorporated in 2006 and is based in L'Ã\u008ele Perrot, Canada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "L'Ã\u008ele Perrot"
    },
    "LX-H.V": {
        "short_name": "LINCOLN VENTURES LTD",
        "long_name": "Lincoln Ventures Ltd.",
        "summary": "Lincoln Ventures Ltd. does not have significant operations. The company is seeking new opportunities. Previously, it was engaged in the manufacture and distribution of advanced composite materials. The company was formerly known as TekModo Industries Inc. and changed its name to Lincoln Ventures Ltd. in July 2018. Lincoln Ventures Ltd. was incorporated in 2002 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "MUST-H.V": {
        "short_name": "MUST CAPITAL INC",
        "long_name": "Must Capital Inc.",
        "summary": "Must Capital Inc. does not have significant operations. Previously, the company was developed 3D medical imaging software platform for legal, insurance, and medical professions. The company was formerly known as Intrinsic4D Inc. and changed its name to Must Capital Inc. in January 2019. Must Capital Inc. was incorporated in 2010 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "SIQ.V": {
        "short_name": "SIQ MOUNTAIN INDUSTRIES INC",
        "long_name": "SiQ Mountain Industries Inc.",
        "summary": "SiQ Mountain Industries Inc. does not have significant operations. The company intends to search for a new business opportunity. Previously, it was focused on the design, engineering, production, marketing, sale, and distribution of various proprietary outdoor sports entertainment products in Canada and internationally. The company was formerly known as Snobro Enterprises Inc. SiQ Mountain Industries Inc. was founded in 2016 and is headquartered in South Surrey, Canada.",
        "currency": "CAD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "South Surrey"
    }
}