{"CJT.TO": {"short_name": "CARGOJET INC.", "long_name": "Cargojet Inc.", "summary": "Cargojet Inc. provides time sensitive overnight air cargo services in Canada. Its air cargo business activities include operation of domestic overnight air cargo co-load network between 15 cities in North America; and provision of dedicated aircraft to customers on an aircraft, crew, maintenance, and insurance (ACMI) basis operating between points in Canada, North and South America, and Europe. The company also operates scheduled international routes for various cargo customers between the United States and Bermuda; between Canada and Germany; and between Canada and Mexico. In addition, it offers specialty charter services for livestock shipments, military equipment movements, emergency relief supplies, and virtually large shipments across North America, Mexico, South America, the Caribbean, and Europe. Further, the company is involved in the ground handling and ground service equipment business. As of February 20, 2020, it operated a fleet of 26 aircraft. Cargojet Inc. is headquartered in Mississauga, Canada.Cargojet Inc. operates as a subsidiary of Flagship International Marketing Limited.", "currency": "CAD", "sector": "Industrials", "industry": "Integrated Freight & Logistics", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Mississauga"}, "PDO.CN": {"short_name": "PUDOInc.", "long_name": "PUDO Inc.", "summary": "PUDO Inc. provides e-commerce parcel services in Canada and the United States. The company offers consumers with convenient PUDO points to pick-up or drop-off e-commerce parcels. It provides services through online retailers, third party logistics companies, and courier companies. PUDO Inc. is based in Mississauga, Canada.", "currency": "CAD", "sector": "Industrials", "industry": "Integrated Freight & Logistics", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Mississauga"}, "PDPTF": {"short_name": "PUDO INC", "long_name": "PUDO Inc.", "summary": "PUDO Inc. provides e-commerce parcel services in Canada and the United States. The company offers consumers with convenient PUDO points to pick-up or drop-off e-commerce parcels. It provides services through online retailers, third party logistics companies, and courier companies. PUDO Inc. is based in Mississauga, Canada.", "currency": "USD", "sector": "Industrials", "industry": "Integrated Freight & Logistics", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Mississauga"}}