{
    "ABG.JO": {
        "short_name": "Absa Group Limited",
        "long_name": "Absa Group Limited",
        "summary": "Absa Group Limited provides various financial products and services in South Africa and internationally. It offers personal and business banking, corporate and investment banking, wealth and investment management, and insurance services. The company offers retail and business banking products and services to individual, enterprise, and commercial customers, including residential property-related finance solutions; vehicle and asset finance products and services; credit cards; personal loans; short-term insurance products; and transactional banking, savings, and investment products and services. It also provides commercial property finance, term and agriculture loans, and overdraft services; notice, fixed, cheque account, savings and transmission, foreign currency, and call deposits; and transactional products and electronic banking services. In addition, the company offers investment banking services; private equity and infrastructure investments; corporate banking products and services; and wealth management services. Further, it provides life insurance products covering death, disability and retrenchment, funeral, and investment products; investments, such as asset management, multi-management, unit trusts, and linked investment products; treasury services; and fiduciary and financial advisory services. Additionally, the company offers market services; trade and working capital solutions; and cash management, payment, and liquidity products and solutions. The company was formerly known as Barclays Africa Group Limited and changed its name to Absa Group Limited in May 2018. The company is based in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "city": "Johannesburg"
    },
    "ABSP.JO": {
        "short_name": "ABSA Bank Ltd Pref",
        "long_name": "Absa Bank Limited",
        "summary": "Absa Bank Limited provides various banking products and services in South Africa and Namibia. The company accepts cheque, youth, transactional, and business accounts. Its loan products include personal, express, instant, home, car, study, structured, short and medium term, and trade and working capital finance; vehicle and asset, property, and debt finance; and overdraft and revolving facilities. The company also offers credit and debit cards; savings and investment products; home, car, household, life and funeral, travel, will, trust, estate, personal asset risk, and business insurance products; and youth and student, Islamic and international banking, investment management, retirement planning, trust and will, and foreign exchange services. In addition, it provides corporate banking solutions, exchange traded products, retail structures solutions, risk solutions, and equities. The company was founded in 1991 and is headquartered in Johannesburg, South Africa. Absa Bank Limited operates as a subsidiary of Absa Group Limited.",
        "currency": "ZAc",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "city": "Johannesburg"
    },
    "AGRPY": {
        "short_name": "ABSA GROUP LTD",
        "long_name": "Absa Group Limited",
        "summary": "Absa Group Limited provides various financial products and services in South Africa and internationally. It offers personal and business banking, corporate and investment banking, wealth and investment management, and insurance services. The company offers retail and business banking products and services to individual, enterprise, and commercial customers, including residential property-related finance solutions; vehicle and asset finance products and services; credit cards; personal loans; short-term insurance products; and transactional banking, savings, and investment products and services. It also provides commercial property finance, term and agriculture loans, and overdraft services; notice, fixed, cheque account, savings and transmission, foreign currency, and call deposits; and transactional products and electronic banking services. In addition, the company offers investment banking services; private equity and infrastructure investments; corporate banking products and services; and wealth management services. Further, it provides life insurance products covering death, disability and retrenchment, funeral, and investment products; investments, such as asset management, multi-management, unit trusts, and linked investment products; treasury services; and fiduciary and financial advisory services. Additionally, the company offers market services; trade and working capital solutions; and cash management, payment, and liquidity products and solutions. The company was formerly known as Barclays Africa Group Limited and changed its name to Absa Group Limited in May 2018. The company is based in Johannesburg, South Africa.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "city": "Johannesburg"
    },
    "AU61.F": {
        "short_name": "ABSA GROUP LTD.  RC 2",
        "long_name": "Absa Group Limited",
        "summary": "Absa Group Limited provides various financial products and services in South Africa and internationally. It offers personal and business banking, corporate and investment banking, wealth and investment management, and insurance services. The company offers retail and business banking products and services to individual, enterprise, and commercial customers, including residential property-related finance solutions; vehicle and asset finance products and services; credit cards; personal loans; short-term insurance products; and transactional banking, savings, and investment products and services. It also provides commercial property finance, term and agriculture loans, and overdraft services; notice, fixed, cheque account, savings and transmission, foreign currency, and call deposits; and transactional products and electronic banking services. In addition, the company offers investment banking services; private equity and infrastructure investments; corporate banking products and services; and wealth management services. Further, it provides life insurance products covering death, disability and retrenchment, funeral, and investment products; investments, such as asset management, multi-management, unit trusts, and linked investment products; treasury services; and fiduciary and financial advisory services. Additionally, the company offers market services; trade and working capital solutions; and cash management, payment, and liquidity products and solutions. The company was formerly known as Barclays Africa Group Limited and changed its name to Absa Group Limited in May 2018. The company is based in Johannesburg, South Africa.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "city": "Johannesburg"
    },
    "CKHGY": {
        "short_name": "CAPITEC BANK HLDGS",
        "long_name": "Capitec Bank Holdings Limited",
        "summary": "Capitec Bank Holdings Limited, through its subsidiaries, provides various banking products and services in South Africa. It operates through two segment, Retail Banking and Business Banking. The company offers various deposits products, including transactional and savings accounts; rental finance; and term loans, mortgage loans, home loans, commercial property loans, credit facilities, instalment sales and leases, and credit cards, as well as funeral and life insurance products. It also provides treasury products, which includes foreign exchange, money market solutions, and trade finance services; and collection and payment services, authenticated collections, data and bank account validation, salary transfer, Internet banking, and mobile banking services. As of February 2020, the company operated approximately 852 branches and 2,380 ATMs. Capitec Bank Holdings Limited was incorporated in 1999 and is headquartered in Stellenbosch, South Africa.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "city": "Stellenbosch"
    },
    "INL.JO": {
        "short_name": "Investec Ltd",
        "long_name": "Investec Group",
        "summary": "Investec Group provides various financial products and services in the United Kingdom and Europe, South Africa, Mauritius, India, Hong Kong, India, Australia, and the United States. The company offers wealth and investment products and services, including portfolio management, discretionary wealth management, financial planning, stockbroking/execution, pensions and retirement, and investment advisory services for private clients, charities, pension funds and trusts. It also provides specialist banking products and services comprising private banking products, such as lending, savings, foreign exchange, private capital, and transactional banking services; corporate, business, and institutional banking products, including lending, advisory, and treasury and risk management solutions, as well as institutional research, sale, and trading services; and investment services comprising property and property investment and fund management products. The company serves government, institutional, corporate, and high net worth and high-income clients. Investec Group was founded in 1974 and is based in Sandton, South Africa.",
        "currency": "ZAc",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "city": "Sandton"
    },
    "INLP.JO": {
        "short_name": "Investec Bank Ltd Pref",
        "long_name": "Investec Bank Limited",
        "summary": "Investec Bank Limited provides a range of financial products and services to personal and business clients in South Africa and Mauritius. The company offers transactional banking, lending, property finance, and savings to high-income and high net worth private clients; corporate and institutional banking services, such as specialized lending and debt origination activities, and treasury and trading solutions; bespoke lending, other transactional, advisory, and investment offerings to mid-market corporate clients; and principal investments, advisory, and debt and equity capital markets services. It also offers home loans, vehicle finance, high net worth private insurance broking solutions, medical practice finance, and life insurance products. Investec Bank Limited was founded in 1974 and is based in Sandton, South Africa. Investec Bank Limited is a subsidiary of Investec Limited.",
        "currency": "ZAc",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "city": "Sandton"
    },
    "ITCFY": {
        "short_name": "INVESTEC LIMITED",
        "long_name": "Investec Group",
        "summary": "Investec Group provides various financial products and services in the United Kingdom and Europe, South Africa, Mauritius, India, Hong Kong, India, Australia, and the United States. The company offers wealth and investment products and services, including portfolio management, discretionary wealth management, financial planning, stockbroking/execution, pensions and retirement, and investment advisory services for private clients, charities, pension funds and trusts. It also provides specialist banking products and services comprising private banking products, such as lending, savings, foreign exchange, private capital, and transactional banking services; corporate, business, and institutional banking products, including lending, advisory, and treasury and risk management solutions, as well as institutional research, sale, and trading services; and investment services comprising property and property investment and fund management products. The company serves government, institutional, corporate, and high net worth and high-income clients. Investec Group was founded in 1974 and is based in Sandton, South Africa.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "city": "Sandton"
    },
    "IYYA.F": {
        "short_name": "INVESTEC LTD  RC-,0002",
        "long_name": "Investec Group",
        "summary": "Investec Group provides various financial products and services in the United Kingdom and Europe, South Africa, Mauritius, India, Hong Kong, India, Australia, and the United States. The company offers wealth and investment products and services, including portfolio management, discretionary wealth management, financial planning, stockbroking/execution, pensions and retirement, and investment advisory services for private clients, charities, pension funds and trusts. It also provides specialist banking products and services comprising private banking products, such as lending, savings, foreign exchange, private capital, and transactional banking services; corporate, business, and institutional banking products, including lending, advisory, and treasury and risk management solutions, as well as institutional research, sale, and trading services; and investment services comprising property and property investment and fund management products. The company serves government, institutional, corporate, and high net worth and high-income clients. Investec Group was founded in 1974 and is based in Sandton, South Africa.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "city": "Sandton"
    },
    "NBKP.JO": {
        "short_name": "Nedbank Ltd Pref",
        "long_name": "Nedbank Limited",
        "summary": "Nedbank Limited, through its subsidiaries, provides a range of banking and financial services to individuals, small businesses, and government and public sectors. The company accepts various deposit products, including current accounts, savings accounts, call and notice deposits, fixed deposits, negotiable certificates of deposit, term deposits, and cash management deposits, as well as investment accounts. It also provides credit cards; home, vehicle, student, and personal loans; overdrafts; and financial planning and foreign exchange services. In addition, the company offers assets, life, credit protection, and funeral insurance; and general business, specialized, general liability, business overheads, business owner, and key person insurance, as well as direct business cover, investment services, and capital guarantees. Further, it provides a mix of listed offshore equity portfolios; investment plans; portfolio management services; corporate finance, stock broking, trading, debt advisory, and wealth management services; start-up, business growth, and short term loans, as well as structured, property finance, and asset finance solutions; financial assistance and debtor management solutions; and aircraft, carbon, export credit, global commodity, leveraged, mining, oil and gas, private equity, property, public sector, infrastructure, energy, and telecomm finance, as well as corporate lending and advances. Additionally, the company offers payment and receipts, documentary credits and collections, guarantees, trade finance, customer foreign currency accounts, and treasury services; cash management, electronic banking, trade, and custodial services; and merchant payment and support solutions. It operates in South Africa, other African countries, Europe, Asia, the United States, and internationally. The company is headquartered in Sandown, South Africa. Nedbank Limited is a subsidiary of Nedbank Group Limited.",
        "currency": "ZAc",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "city": "Sandown"
    },
    "NCO.F": {
        "short_name": "NEDBANK GROUP LTD.  RC 1",
        "long_name": "Nedbank Group Limited",
        "summary": "Nedbank Group Limited, through its subsidiary, Nedbank Limited, provides various wholesale and retail banking services in South Africa and internationally. It offers personal banking solutions, including savings deposits and investment accounts; home and personal loans, student loans, vehicle finance products, private wealth finance solutions, overdrafts, and credit cards; and investment plans and services, financial and estate planning services, and wills and trust services, as well as professional banking, wealth management, non-resident and embassy banking, insurance, stock broking, and foreign exchange services. The company also provides business banking services, such as business accounts; call, fixed, and flexi deposits; loans and structured solutions; property, asset, and vehicle finance products; value added services; card and cash solutions; treasury solutions; cash management, electronic banking, and merchant payment and support services; life, asset, income and credit protection, funeral, business cover, liability cover, revenue cover, and owners' insurance products; asset management services; and commodities, equities, fixed income, and structured credit products. In addition, the company offers corporate banking services comprising aircraft, asset based, carbon, export credit, global commodity, infrastructure, energy, telecoms, leveraged, mining, oil and gas, private equity, and public sector finance; payments and receipts, documentary credits and collections, guarantees, and trade finance; structured solutions; corporate lending and advances, and specialized distribution products; custodial services; corporate finance and debt advisory services; beta solutions; and corporate and institutional investments. Further, it provides transactional banking services. The company was formerly known as Nedcor Limited and changed its name to Nedbank Group Limited in 2005. The company was founded in 1831 and is headquartered in Johannesburg, South Africa.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "city": "Johannesburg"
    },
    "NDBKF": {
        "short_name": "NEDBANK GROUP LIMITED",
        "long_name": "Nedbank Group Limited",
        "summary": "Nedbank Group Limited, through its subsidiary, Nedbank Limited, provides various wholesale and retail banking services in South Africa and internationally. It offers personal banking solutions, including savings deposits and investment accounts; home and personal loans, student loans, vehicle finance products, private wealth finance solutions, overdrafts, and credit cards; and investment plans and services, financial and estate planning services, and wills and trust services, as well as professional banking, wealth management, non-resident and embassy banking, insurance, stock broking, and foreign exchange services. The company also provides business banking services, such as business accounts; call, fixed, and flexi deposits; loans and structured solutions; property, asset, and vehicle finance products; value added services; card and cash solutions; treasury solutions; cash management, electronic banking, and merchant payment and support services; life, asset, income and credit protection, funeral, business cover, liability cover, revenue cover, and owners' insurance products; asset management services; and commodities, equities, fixed income, and structured credit products. In addition, the company offers corporate banking services comprising aircraft, asset based, carbon, export credit, global commodity, infrastructure, energy, telecoms, leveraged, mining, oil and gas, private equity, and public sector finance; payments and receipts, documentary credits and collections, guarantees, and trade finance; structured solutions; corporate lending and advances, and specialized distribution products; custodial services; corporate finance and debt advisory services; beta solutions; and corporate and institutional investments. Further, it provides transactional banking services. The company was formerly known as Nedcor Limited and changed its name to Nedbank Group Limited in 2005. The company was founded in 1831 and is headquartered in Johannesburg, South Africa.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "city": "Johannesburg"
    },
    "NDBKY": {
        "short_name": "NEDBANK GROUP LIMITED",
        "long_name": "Nedbank Group Limited",
        "summary": "Nedbank Group Limited, through its subsidiary, Nedbank Limited, provides various wholesale and retail banking services in South Africa and internationally. It offers personal banking solutions, including savings deposits and investment accounts; home and personal loans, student loans, vehicle finance products, private wealth finance solutions, overdrafts, and credit cards; and investment plans and services, financial and estate planning services, and wills and trust services, as well as professional banking, wealth management, non-resident and embassy banking, insurance, stock broking, and foreign exchange services. The company also provides business banking services, such as business accounts; call, fixed, and flexi deposits; loans and structured solutions; property, asset, and vehicle finance products; value added services; card and cash solutions; treasury solutions; cash management, electronic banking, and merchant payment and support services; life, asset, income and credit protection, funeral, business cover, liability cover, revenue cover, and owners' insurance products; asset management services; and commodities, equities, fixed income, and structured credit products. In addition, the company offers corporate banking services comprising aircraft, asset based, carbon, export credit, global commodity, infrastructure, energy, telecoms, leveraged, mining, oil and gas, private equity, and public sector finance; payments and receipts, documentary credits and collections, guarantees, and trade finance; structured solutions; corporate lending and advances, and specialized distribution products; custodial services; corporate finance and debt advisory services; beta solutions; and corporate and institutional investments. Further, it provides transactional banking services. The company was formerly known as Nedcor Limited and changed its name to Nedbank Group Limited in 2005. The company was founded in 1831 and is headquartered in Johannesburg, South Africa.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "city": "Johannesburg"
    },
    "NED.JO": {
        "short_name": "Nedbank Group Ltd",
        "long_name": "Nedbank Group Limited",
        "summary": "Nedbank Group Limited, through its subsidiary, Nedbank Limited, provides various wholesale and retail banking services in South Africa and internationally. It offers personal banking solutions, including savings deposits and investment accounts; home and personal loans, student loans, vehicle finance products, private wealth finance solutions, overdrafts, and credit cards; and investment plans and services, financial and estate planning services, and wills and trust services, as well as professional banking, wealth management, non-resident and embassy banking, insurance, stock broking, and foreign exchange services. The company also provides business banking services, such as business accounts; call, fixed, and flexi deposits; loans and structured solutions; property, asset, and vehicle finance products; value added services; card and cash solutions; treasury solutions; cash management, electronic banking, and merchant payment and support services; life, asset, income and credit protection, funeral, business cover, liability cover, revenue cover, and owners' insurance products; asset management services; and commodities, equities, fixed income, and structured credit products. In addition, the company offers corporate banking services comprising aircraft, asset based, carbon, export credit, global commodity, infrastructure, energy, telecoms, leveraged, mining, oil and gas, private equity, and public sector finance; payments and receipts, documentary credits and collections, guarantees, and trade finance; structured solutions; corporate lending and advances, and specialized distribution products; custodial services; corporate finance and debt advisory services; beta solutions; and corporate and institutional investments. Further, it provides transactional banking services. The company was formerly known as Nedcor Limited and changed its name to Nedbank Group Limited in 2005. The company was founded in 1831 and is headquartered in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "city": "Johannesburg"
    },
    "RMH.JO": {
        "short_name": "RMB Holdings Ltd",
        "long_name": "RMB Holdings Limited",
        "summary": "RMB Holdings Limited, an investment holding company, invests in financial services businesses primarily in South Africa. The company was founded in 1987 and is headquartered in Sandton, South Africa.",
        "currency": "ZAc",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "city": "Sandton"
    },
    "SBK.JO": {
        "short_name": "Standard Bank Group Ltd",
        "long_name": "Standard Bank Group Limited",
        "summary": "Standard Bank Group Limited, together with its subsidiaries, offers banking and financial products and services. The company's personal banking products include bank accounts, digital wallets, credit and prepaid cards, saving and investment products, and foreign exchange and Shariah banking services; home loans, personal loans, vehicle financing, and student loans; financial planning and trading services; and wills, estate, and trust services, as well as car, home, income, debt, funeral, travel, legal assist, life, and personal accident insurance. Its business banking products comprise business accounts and cards, attorney accounts, and merchant and cash solutions; loans, overdrafts, revolving credit plans, vehicle and asset finance, debtor finance, and commercial property finance; savings and investment accounts, financial planning, payments, cash and fleet management, merchant, debit order, and other special services; pay and incentive cards; and business, corporate risks, agricultural, vehicles, commercial property, engineering risks, new contracts, cargo, cash, events and directors and officers liability insurance services. The company also provides trading and risk management solutions across financial markets, including foreign exchange, money markets, interest rates, equities, and credit and commodities; international trade finance, working capital, and investor service solutions; advisory and financing solutions, such as term lending, and structured and specialized products across the equity and debt capital markets for governments, parastatals, larger corporates, financial institutions, and multinational corporates. In addition, it offers wealth management products and services; and online, mobile, and telephone banking services. Standard Bank Group Limited was founded in 1862 and is headquartered in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "city": "Johannesburg"
    },
    "SFN.JO": {
        "short_name": "Sasfin Holdings Ltd",
        "long_name": "Sasfin Holdings Limited",
        "summary": "Sasfin Holdings Limited operates as a bank controlling company that provides various financial products and services in South Africa and Hong Kong. It operates through three segments: Banking, Wealth, and Capital. The Banking segment engages in the business banking, transactional banking, and treasury businesses. Its services include transactional banking, digital banking platform, direct feed integration, treasury, forex, trade finance, debt capital market, debtor finance, credit facility, and equipment finance, as well as investment, and business and personal accounts. The Wealth segment offers online investment, asset management, portfolio management and stockbroking, asset consulting, healthcare consulting, wealth advisory, and fixed income products and services, as well as retirement funds and fiduciary solutions. The Capital segment offers specialized lending, private equity, property equity, sponsor, incentive, and global trade services. The company serves entrepreneurs, corporates, institutions, high-net-worth individuals, and business and wealth clients. Sasfin Holdings Limited was founded in 1951 and is headquartered in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "city": "Johannesburg"
    },
    "SFNP.JO": {
        "short_name": "Sasfin Hldgs Ltd Pref",
        "long_name": "Sasfin Holdings Limited",
        "summary": "Sasfin Holdings Limited operates as a bank controlling company that provides various financial products and services in South Africa and Hong Kong. It operates through three segments: Banking, Wealth, and Capital. The Banking segment engages in the business banking, transactional banking, and treasury businesses. Its services include transactional banking, digital banking platform, direct feed integration, treasury, forex, trade finance, debt capital market, debtor finance, credit facility, and equipment finance, as well as investment, and business and personal accounts. The Wealth segment offers online investment, asset management, portfolio management and stockbroking, asset consulting, healthcare consulting, wealth advisory, and fixed income products and services, as well as retirement funds and fiduciary solutions. The Capital segment offers specialized lending, private equity, property equity, sponsor, incentive, and global trade services. The company serves entrepreneurs, corporates, institutions, high-net-worth individuals, and business and wealth clients. Sasfin Holdings Limited was founded in 1951 and is headquartered in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "city": "Johannesburg"
    },
    "SGBLY": {
        "short_name": "STANDARD BANK GROUP LIMITED",
        "long_name": "Standard Bank Group Limited",
        "summary": "Standard Bank Group Limited, together with its subsidiaries, offers banking and financial products and services. The company's personal banking products include bank accounts, digital wallets, credit and prepaid cards, saving and investment products, and foreign exchange and Shariah banking services; home loans, personal loans, vehicle financing, and student loans; financial planning and trading services; and wills, estate, and trust services, as well as car, home, income, debt, funeral, travel, legal assist, life, and personal accident insurance. Its business banking products comprise business accounts and cards, attorney accounts, and merchant and cash solutions; loans, overdrafts, revolving credit plans, vehicle and asset finance, debtor finance, and commercial property finance; savings and investment accounts, financial planning, payments, cash and fleet management, merchant, debit order, and other special services; pay and incentive cards; and business, corporate risks, agricultural, vehicles, commercial property, engineering risks, new contracts, cargo, cash, events and directors and officers liability insurance services. The company also provides trading and risk management solutions across financial markets, including foreign exchange, money markets, interest rates, equities, and credit and commodities; international trade finance, working capital, and investor service solutions; advisory and financing solutions, such as term lending, and structured and specialized products across the equity and debt capital markets for governments, parastatals, larger corporates, financial institutions, and multinational corporates. In addition, it offers wealth management products and services; and online, mobile, and telephone banking services. Standard Bank Group Limited was founded in 1862 and is headquartered in Johannesburg, South Africa.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "city": "Johannesburg"
    },
    "SKC2.F": {
        "short_name": "STD BK GRP  RC -,10",
        "long_name": "Standard Bank Group Limited",
        "summary": "Standard Bank Group Limited, together with its subsidiaries, offers banking and financial products and services. The company's personal banking products include bank accounts, digital wallets, credit and prepaid cards, saving and investment products, and foreign exchange and Shariah banking services; home loans, personal loans, vehicle financing, and student loans; financial planning and trading services; and wills, estate, and trust services, as well as car, home, income, debt, funeral, travel, legal assist, life, and personal accident insurance. Its business banking products comprise business accounts and cards, attorney accounts, and merchant and cash solutions; loans, overdrafts, revolving credit plans, vehicle and asset finance, debtor finance, and commercial property finance; savings and investment accounts, financial planning, payments, cash and fleet management, merchant, debit order, and other special services; pay and incentive cards; and business, corporate risks, agricultural, vehicles, commercial property, engineering risks, new contracts, cargo, cash, events and directors and officers liability insurance services. The company also provides trading and risk management solutions across financial markets, including foreign exchange, money markets, interest rates, equities, and credit and commodities; international trade finance, working capital, and investor service solutions; advisory and financing solutions, such as term lending, and structured and specialized products across the equity and debt capital markets for governments, parastatals, larger corporates, financial institutions, and multinational corporates. In addition, it offers wealth management products and services; and online, mobile, and telephone banking services. Standard Bank Group Limited was founded in 1862 and is headquartered in Johannesburg, South Africa.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "city": "Johannesburg"
    },
    "SKCS.F": {
        "short_name": "STD BK GRP SP.ADRS RC-,10",
        "long_name": "Standard Bank Group Limited",
        "summary": "Standard Bank Group Limited, together with its subsidiaries, offers banking and financial products and services. The company's personal banking products include bank accounts, digital wallets, credit and prepaid cards, saving and investment products, and foreign exchange and Shariah banking services; home loans, personal loans, vehicle financing, and student loans; financial planning and trading services; and wills, estate, and trust services, as well as car, home, income, debt, funeral, travel, legal assist, life, and personal accident insurance. Its business banking products comprise business accounts and cards, attorney accounts, and merchant and cash solutions; loans, overdrafts, revolving credit plans, vehicle and asset finance, debtor finance, and commercial property finance; savings and investment accounts, financial planning, payments, cash and fleet management, merchant, debit order, and other special services; pay and incentive cards; and business, corporate risks, agricultural, vehicles, commercial property, engineering risks, new contracts, cargo, cash, events and directors and officers liability insurance services. The company also provides trading and risk management solutions across financial markets, including foreign exchange, money markets, interest rates, equities, and credit and commodities; international trade finance, working capital, and investor service solutions; advisory and financing solutions, such as term lending, and structured and specialized products across the equity and debt capital markets for governments, parastatals, larger corporates, financial institutions, and multinational corporates. In addition, it offers wealth management products and services; and online, mobile, and telephone banking services. Standard Bank Group Limited was founded in 1862 and is headquartered in Johannesburg, South Africa.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "city": "Johannesburg"
    }
}