{
    "AFH.JO": {
        "short_name": "Alexander Forbes Grp Hldgs",
        "long_name": "Alexander Forbes Group Holdings Limited",
        "summary": "Alexander Forbes Group Holdings Limited provides integrated retirement and investment solutions for individuals and businesses in South Africa and internationally. The company's solutions for individuals cover money management, budgeting, and savings services; goal based, unit trusts, endowments, and offshore investment; retirement pension or provident, and annuity funds; healthcare solutions and support, and consulting services; life and risk cover; and wills and estate planning services, as well as private wealth management services. Its solutions for businesses cover consulting and actuarial services; retirement fund services; healthcare consulting, health management solutions, and technical advisory services; group and business insurance services that cover assets, earnings, and the legal liabilities of business against loss or damage; services that cover emerging markets in Arica; and trust and beneficiary services that cover the management of death benefits for beneficiaries of deceased retirement fund members and employees. The company was formerly known as Alexander Forbes Equity Holdings Proprietary Limited and changed its name to Alexander Forbes Group Holdings Limited in June 2014. Alexander Forbes Group Holdings Limited was founded in 1935 and is headquartered in Sandton, South Africa.",
        "currency": "ZAc",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Sandton",
        "zipcode": "2196",
        "website": "http://www.alexanderforbes.co.za",
        "market_cap": 4960620032
    },
    "P1B.F": {
        "short_name": "PSG GRP LTD.  RC-,01",
        "long_name": "PSG Group Ltd",
        "summary": "PSG Group Ltd, an investment holding company, engages in the banking, education, financial services, and food and related businesses in South Africa and internationally. It operates through seven segments: Capitec, PSG Konsult, PSG Alpha, Zeder, Curro, Dipeo, and PSG Corporate. The company provides retail and business banking solutions; and funeral insurance covers; wealth and asset management, financial planning, insurance, stockbroking and portfolio management, and estate and trust advisory services; and investment management and treasury services. It also operates private schools; and invests in selected growth sectors. The company was formerly known as PAG Ltd. PSG Group Ltd was founded in 1995 and is based in Stellenbosch, South Africa.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Stellenbosch",
        "zipcode": "7600",
        "website": "http://www.psggroup.co.za",
        "market_cap": 1043089728
    },
    "PPE.JO": {
        "short_name": "Purple Group Ltd",
        "long_name": "Purple Group Limited",
        "summary": "Purple Group Limited, a financial services company, through its subsidiaries, engages in trading, investing, and asset management businesses in South Africa. It operates through GT247.com and Emperor Asset Management; and EasyEquities segments. The company operates EasyEquities, a web-based investment platform; GT247.com, a trading platform that provides a range of tradable instruments, such as 153 JSE equity contracts for differences, 5 commodities, 5 crypto currencies, 135 currency pairs, and 12 major indices, as well as private broking and do it yourself trading services; and EasyProperties, an online property investment platform. It also offers managed portfolios on the EasyEquities platform; and secures institutional asset management and consults mandates. The company was formerly known as Purple Capital Limited and changed its name to Purple Group Limited in December 2013. Purple Group Limited was incorporated in 1998 and is based in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2092",
        "website": "http://www.purplegroup.co.za",
        "market_cap": 1558659200
    },
    "SYG.JO": {
        "short_name": "Sygnia Limited",
        "long_name": "Sygnia Limited",
        "summary": "Sygnia Limited provides investment management and administration services to institutional and retail clients in South Africa. The company offers multi-manager investment, index-tracking investment, and umbrella retirement funds; and transition management, and stockbroking and securities lending services, as well as manages and administers custom-designed investment strategies. It also provides investment administration services, such as multi-tier unitization, monthly administration reporting, consolidated financial accounting information, monitoring of compliance with mandates and legislation, regulatory reporting, performance and risk analysis reporting, and asset liability modelling. In addition, the company offers liability administration and consulting, digital financial advisory, and treasury services; and a range of savings products, including retirement annuities, living annuities, preservation pension and provident funds, tax-free savings accounts, and direct unit trust investments. Sygnia Limited was incorporated in 2007 and is headquartered in Cape Town, South Africa.",
        "currency": "ZAc",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "8001",
        "website": "http://www.sygnia.co.za",
        "market_cap": 2707959040
    }
}