{
    "06L.SG": {
        "short_name": "Global Mediacom Tbk, PT Registe",
        "long_name": "PT. Global Mediacom Tbk",
        "summary": "PT. Global Mediacom Tbk operates as an integrated media company in Indonesia and internationally. The company operates through Advertising and Content, and Pay TV and Broadband segments. It operates 4 free-to-air TV stations, including RCTI, MNCTV, GTV, and iNews; and provides content production and content library services. The company also operates Okezone.com, an online news and entertainment portal that publishes approximately 700-800 new items and provides online TV streaming service through Okezone.tv; metube.id, an entertainment video portal; misteraladin.com, an online travel service for ticket sales, accommodation, and travel packages; thefthing.com, an online shopping portal; and mncshop.co.id, an online shopping center. In addition, it offers talent management and advertising services; fixed broadband/IPTV and DTH services; animation games and parenting services; and TV production services. The company was formerly known as PT Bimantara Citra Tbk. and changed its name to PT. Global Mediacom Tbk in March 2007. The company was founded in 1981 and is based in Jakarta, Indonesia. PT. Global Mediacom Tbk is a subsidiary of PT MNC Investama Tbk.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10340",
        "website": "http://mediacom.co.id",
        "market_cap": "Small Cap"
    },
    "2S4A.SG": {
        "short_name": "PT Surya Citra Media Tbk Regist",
        "long_name": "PT Surya Citra Media Tbk",
        "summary": "PT Surya Citra Media Tbk, together with its subsidiaries, provides multimedia services in Indonesia. The company owns SCTV and Indosiar television channels. It also provides soccer management, entertainment, and advertising services; and artist management services. In addition, the company engages in film and content trading, content management and production, production house, and multimedia operations; film production and video recording activities; and provision and utilization of multimedia through telecommunications equipment. Further, it offers film distribution and marketing services; content creative; animation production services; film recording services; and information technology, promotion and marketing, general telecommunication, management agency and production, public relations, and mass media and audio recording services. Additionally, the company provides online media, printed and electronic media, and impresario services; and rental and management services. The company was formerly known as PT Cipta Aneka Selaras and changed its name to PT Surya Citra Media Tbk in January 2002. The company was founded in 1999 and is headquartered in Jakarta, Indonesia. PT Surya Citra Media Tbk is a subsidiary of PT Elang Mahkota Teknologi Tbk.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10270",
        "website": "http://www.scm.co.id",
        "market_cap": "Small Cap"
    },
    "6TB.SG": {
        "short_name": "Tower Bersama Infrastruct.TBK R",
        "long_name": "PT Tower Bersama Infrastructure Tbk",
        "summary": "PT Tower Bersama Infrastructure Tbk provides telecommunication infrastructure solution and services in Indonesia. It leases antenna and other equipment space to Indonesian telecommunications operators for wireless signal transmission related to wireless voice and data transmission. The company also owns and operates distributed antennae system (DAS) networks installed in a building for wireless communications for telecommunications operators in shopping malls and office buildings. As of December 31, 2019, it had 28,740 tenants; and 15,589 telecommunications sites comprising 15,473 telecommunications towers and 116 DAS networks. The company was formerly known as PT Banyan Mas. PT Tower Bersama Infrastructure Tbk was founded in 2004 and is headquartered in Jakarta Selatan, Indonesia.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12940",
        "website": "http://www.tower-bersama.com",
        "market_cap": "Mid Cap"
    },
    "ABBA.JK": {
        "short_name": "Mahaka Media Tbk.",
        "long_name": "PT Mahaka Media Tbk",
        "summary": "PT Mahaka Media Tbk, through its subsidiaries, operates as a multiplatform media company in Indonesia and internationally. It engages in making, selling, collecting, and distributing community contents through various platforms. The company publishes Harian Republika Daily, a Moslem newspaper; Republika Penerbit, which specializes in Islamic reference books, novels, and children stories; Golf Digest, a golf media, including e-magazine, e-newsletter, and social media, as well as golfdigest.id, a Website; and Harian Indonesia, a Chinese-language newspaper. It also provides Republika Media Visual, which offers content and program with Islamic background; Jak TV, a television station; and various commercial radio stations, including JAK 101 FM, GEN 98.7 FM Jakarta, GEN 103.1 FM, Surabaya, HOT 93.2 FM, Most Radio 105.8 FM, KIS 95.1 FM, and Mustang 88.0 FM. In addition, the company offers outdoor advertising media services under the Mahaka Advertising name; brand activation services under the Alive Indonesia name; and discount services under the CardPlus name. Further, it provides online services through Jak-tv.co.id, 98.7 GenFM.co.id, 101 JakFM.co.id, and Republika.co.id. The company was formerly known as PT Abdi Bangsa Tbk and changed its name to PT Mahaka Media Tbk in May 2010. PT Mahaka Media Tbk was founded in 1992 and is headquartered in Jakarta, Indonesia. PT Mahaka Media Tbk is a subsidiary of PT Beyond Media.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10220",
        "website": "http://www.mahakamedia.com",
        "market_cap": "Large Cap"
    },
    "BALI.JK": {
        "short_name": "Bali Towerindo Sentra Tbk.",
        "long_name": "PT Bali Towerindo Sentra Tbk",
        "summary": "PT Bali Towerindo Sentra Tbk, together with its subsidiaries, provides telecommunication infrastructure services in Indonesia. It operates and leases tower buildings or telecommunications towers, and telecommunications facilities. The company provides tower facilities equipped with integrated transmission facilities through fiber optic/wireless network. In addition, it offers BTS tower management and leasing services; and pay TV telecommunication services. The company was founded in 2006 and is based in Bali, Indonesia. PT Bali Towerindo Sentra Tbk is a subsidiary of PT Kharisma Cipta Towerindo.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bali",
        "zipcode": "80361",
        "website": "http://www.balitower.co.id",
        "market_cap": "Large Cap"
    },
    "BHIT.JK": {
        "short_name": "MNC Investama Tbk.",
        "long_name": "PT MNC Investama Tbk",
        "summary": "PT MNC Investama Tbk, an investment holding company, engages in fields of financial services, media, and lifestyle property businesses in Indonesia. It operates four free-to-air television stations, such as RCTI, MNCTV, GTV, and iNews; FTA, third parties, cinemas, and digital platforms; broadcast, content, and animation production; news contents; and broadband and DTH services. The company also provides financial services, which include banking, consumer finance, leasing, securities, asset management, general insurance, life insurance, and financial technology; new car and multi-purpose financing and mortgages; and develops digital application to deliver credit processing. In addition, the company offers leasing, sale and leaseback, factoring, project financing, infrastructure financing, and other financings; and brokerage, margin financing, research, underwriting, financial advisory, mutual funds, and trading services. Further it, provides assurance products, including health, accident, and unit link, as well as, insurances for education, pension, health, accident and life. Additionally, it provides e-money, e-wallet, digital remittance, and loyalty programs. The company engages in lifestyle property, hospitality, and entertainment business, consisting of theme park resort; international four-star, five-star, and six-star hotels; villas and condominiums; golf course; and other supporting facilities. It also develops hotels and resorts. The company also engages in transportation and mining business. The company was formerly known as PT Bhakti Investama Tbk and changed its name to PT MNC Investama Tbk in August 2013. PT MNC Investama Tbk was founded in 1989 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10340",
        "website": "http://www.mncgroup.com",
        "market_cap": "Large Cap"
    },
    "BLTZ.JK": {
        "short_name": "Graha Layar Prima Tbk.",
        "long_name": "PT Graha Layar Prima Tbk",
        "summary": "PT Graha Layar Prima Tbk, through its subsidiary, PT Graha Layar Mitra, operates in the cinema industry in Indonesia. The company also provides food and beverage, event and advertisement, and licensing and management services. As of December 31, 2018, it operated 51 CGV cinemas and 3 blitztheater cinemas. The company was founded in 2004 and is headquartered in South Jakarta, Indonesia. PT Graha Layar Prima Tbk is a subsidiary of CJ CGV Co. Ltd. As per the transaction announced on November 18, 2019, PT Graha Layar Prima Tbkoperates as a subsidiary of CGI Holdings Co., Ltd.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "South Jakarta",
        "zipcode": "12930",
        "website": "http://www.cgv.id",
        "market_cap": "Large Cap"
    },
    "BMTR.JK": {
        "short_name": "Global Mediacom Tbk.",
        "long_name": "PT. Global Mediacom Tbk",
        "summary": "PT. Global Mediacom Tbk operates as an integrated media company in Indonesia and internationally. The company operates through Advertising and Content, and Pay TV and Broadband segments. It operates 4 free-to-air TV stations, including RCTI, MNCTV, GTV, and iNews; and provides content production and content library services. The company also operates Okezone.com, an online news and entertainment portal that publishes approximately 700-800 new items and provides online TV streaming service through Okezone.tv; metube.id, an entertainment video portal; misteraladin.com, an online travel service for ticket sales, accommodation, and travel packages; thefthing.com, an online shopping portal; and mncshop.co.id, an online shopping center. In addition, it offers talent management and advertising services; fixed broadband/IPTV and DTH services; animation games and parenting services; and TV production services. The company was formerly known as PT Bimantara Citra Tbk. and changed its name to PT. Global Mediacom Tbk in March 2007. The company was founded in 1981 and is based in Jakarta, Indonesia. PT. Global Mediacom Tbk is a subsidiary of PT MNC Investama Tbk.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10340",
        "website": "http://mediacom.co.id",
        "market_cap": "Large Cap"
    },
    "CENT.JK": {
        "short_name": "Centratama Telekomunikasi Indon",
        "long_name": "PT Centratama Telekomunikasi Indonesia Tbk",
        "summary": "PT Centratama Telekomunikasi Indonesia Tbk leases and manages telecommunication towers and in-building DAS (distributed antenna system) sites for cellular networks in Indonesia. The company also provides fiber broadband and telephony Internet services for corporate and residential customers. In addition, it offers IP and digital products and services. The company was formerly known as PT Centrin Online Tbk and changed its name to PT Centratama Telekomunikasi Indonesia Tbk in 2013. PT Centratama Telekomunikasi Indonesia Tbk was founded in 1987 and is headquartered in Jakarta Pusat, Indonesia.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10220",
        "website": "http://www.centratamagroup.com",
        "market_cap": "Large Cap"
    },
    "DIGI.JK": {
        "short_name": "Arkadia Digital Media Tbk.",
        "long_name": "PT Arkadia Digital Media Tbk",
        "summary": "PT Arkadia Digital Media Tbk operates as an independent and integrated digital media company in Indonesia. It operates Suara.com, a news portal; Matamata.com, a celebrity and entertainment portal; Bolatimes.com, a soccer and sports portal; and Hitekno.com, a technology and gadget portal. The company also operates Dewiku.com, a platform for females; Mobimoto.com, an automotive and motorsports portal; Guideku.com, a travelling, and food and beverage portal; and Himedik.com, a health and medical portal. In addition, it offers content for mobile phone subscribers through Arkadia Mobile; produces video content for clients ranging from government institutions to corporations; and provides event management services. The company was formerly known as PT Bukit Irama and changed its name to PT Arkadia Digital Media Tbk in February 2018. PT Arkadia Digital Media Tbk was founded in 2012 and is headquartered in Central Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Central Jakarta",
        "zipcode": null,
        "website": "http://www.arkadiacorp.com",
        "market_cap": "Large Cap"
    },
    "DMMX.JK": {
        "short_name": "Digital Mediatama Maxima Tbk.",
        "long_name": "PT Digital Mediatama Maxima Tbk",
        "summary": "PT Digital Mediatama Maxima Tbk develops and provides a digital trade marketing and cloud advertising exchange platform. It offers hardware for advertising and operating systems; maintenance for hardware and infrastructure; advertising operating system; and advertising content management services, such as advertisement on back walls, digital posters, and signage. The company is also involved in the advertising infrastructure leasing business, which includes digital kiosks or signage leasing; maintenance of advertising infrastructure and advertising content; and operation of the Advertising Exchange Hub platform, a cloud-based commercial display platform. In addition, it operates B2B trade marketing program, which includes advertising and marketing promotions, and sales activation solutions; and sells airtime packages in the form of physical and electronic vouchers, as well as cellular phone starter packs. The company was formerly known as PT Digital Marketing Solution and changed its name to PT Digital Mediatama Maxima Tbk in January 2019. PT Digital Mediatama Maxima Tbk was founded in 2015 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12940",
        "website": "http://www.dmmgroup.id",
        "market_cap": "Large Cap"
    },
    "DNET.JK": {
        "short_name": "Indoritel Makmur Internasional ",
        "long_name": "PT Indoritel Makmur Internasional Tbk.",
        "summary": "PT Indoritel Makmur Internasional Tbk., together with its subsidiaries, operates as a fiber optic network provider company in Indonesia. The company operates in segments, Fiber Optic and E-Commerce Daily Deals. The Fiber Optic segment provides infrastructure, pay TV providers, and cellular telecommunication providers. The E-Commerce Daily Deals segment operates OgahRugi.com, an online business portal that offers daily deals discount vouchers from various merchants. The company is involved in the investment, general trading, and agency businesses. The company was formerly known as PT Dyviacom Intrabumi, Tbk. and changed its name to PT Indoritel Makmur Internasional Tbk. in June 2013. PT Indoritel Makmur Internasional Tbk. was founded in 1995 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12910",
        "website": "http://www.indoritel.co.id",
        "market_cap": "Large Cap"
    },
    "DYAN.JK": {
        "short_name": "Dyandra Media International Tbk",
        "long_name": "PT Dyandra Media International Tbk",
        "summary": "PT Dyandra Media International Tbk, together with its subsidiaries, provides event solutions in Indonesia. The company organizes events and exhibitions; and provides supporting events. It also operates venues and halls, including convention and exhibition halls; and hotels. The company was founded in 1994 and is headquartered in Central Jakarta, Indonesia. PT Dyandra Media International Tbk is a subsidiary of PT Teletransmedia.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10310",
        "website": "http://www.dyandramedia.com",
        "market_cap": "Large Cap"
    },
    "E5F.F": {
        "short_name": "PT XL AXIATA TBK RP 100",
        "long_name": "PT XL Axiata Tbk",
        "summary": "PT XL Axiata Tbk provides telecommunication, telecommunications network, and multimedia services for consumers and businesses in Indonesia. The company offers cellular mobile and closed fixed network, Internet service provider, voice over Internet protocol, content provider, money remitter service, e-money issuance services, and Internet interconnection services. It also provides leased line, VPN MPLS, corporate Internet, and voice over Internet protocol services; mobile data and home broadband services; data center and cloud services; mobile communication services; and mobile advertising and big data services, such as messaging services, display services, and digital rewards, as well as Internet of Things based solutions. The company was formerly known as PT Excelcomindo Pratama Tbk. and changed its name to PT XL Axiata Tbk in 2009. The company was founded in 1989 and is headquartered in Jakarta Selatan, Indonesia. PT XL Axiata Tbk is a subsidiary of Axiata Investments (Indonesia) Sdn. Bhd.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12950",
        "website": "http://www.xlaxiata.co.id",
        "market_cap": "Small Cap"
    },
    "EMTK.JK": {
        "short_name": "Elang Mahkota Teknologi Tbk.",
        "long_name": "PT Elang Mahkota Teknologi Tbk",
        "summary": "PT Elang Mahkota Teknologi Tbk, through its subsidiaries, provides media, information technology, connectivity, and other services in Indonesia. The company operates in three segments: Media, Solutions, and Others. The Media segment is involved in free-to-air television broadcasting business through 3 television channels, including PT Indosiar Visual Mandiri, PT Surya Citra Televisi, and PT Omni Intivision, as well as film, video production, megaportal website, and digital publishing businesses. The Solutions segment provides a range of infrastructure solutions and services that include telecommunications and networking, banking software and hardware, integrated very small aperture terminal solutions, and telecommunication's retail distribution solutions. The Others segment offers connectivity services, such as internet, DVBT pay TV, and wireless broadband services; and medical service, as well as engages in fintech and other businesses. The company is also involved in trading of medical equipment, leasing of broadcasting and film studios, trading of multimedia film and content, content management and production, ad based video-on demand and subscription video-on demand, and online media businesses; and provision of tower lease, management, information technology, tourism, artist management, and outdoor media advertising services. PT Elang Mahkota Teknologi Tbk was founded in 1983 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10270",
        "website": "http://www.emtek.co.id",
        "market_cap": "Large Cap"
    },
    "EXCL.JK": {
        "short_name": "XL Axiata Tbk.",
        "long_name": "PT XL Axiata Tbk",
        "summary": "PT XL Axiata Tbk provides telecommunication, telecommunications network, and multimedia services for consumers and businesses in Indonesia. The company offers cellular mobile and closed fixed network, Internet service provider, voice over Internet protocol, content provider, money remitter service, e-money issuance services, and Internet interconnection services. It also provides leased line, VPN MPLS, corporate Internet, and voice over Internet protocol services; mobile data and home broadband services; data center and cloud services; mobile communication services; and mobile advertising and big data services, such as messaging services, display services, and digital rewards, as well as Internet of Things based solutions. The company was formerly known as PT Excelcomindo Pratama Tbk. and changed its name to PT XL Axiata Tbk in 2009. The company was founded in 1989 and is headquartered in Jakarta Selatan, Indonesia. PT XL Axiata Tbk is a subsidiary of Axiata Investments (Indonesia) Sdn. Bhd.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12950",
        "website": "http://www.xlaxiata.co.id",
        "market_cap": "Large Cap"
    },
    "FILM.JK": {
        "short_name": "MD Pictures Tbk.",
        "long_name": "PT MD Pictures Tbk",
        "summary": "PT MD Pictures Tbk produces and distributes films and videos in Indonesia. It is also involved in the studio rental and shooting equipment rental activities. The company was founded in 2002 and is headquartered in Jakarta, Indonesia. PT MD Pictures Tbk is a subsidiary of PT MD Graha Utama.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12910",
        "website": "http://www.mdpictures.com",
        "market_cap": "Large Cap"
    },
    "FORU.JK": {
        "short_name": "Fortune Indonesia Tbk",
        "long_name": "PT Fortune Indonesia Tbk",
        "summary": "PT Fortune Indonesia Tbk operates as an advertising agency in Indonesia. It operates through five segments: Media, Advertising, Activation, Digital, and Public Relations. The Media segment offers consulting services for planning and implementation of the media advertising shopping, which includes electronic, digital, and print, as well as outdoor media, and media monitoring and analysis services. The Advertising segment provides management consulting services, and marketing and production communication strategies comprising graphic design that includes creative concepts, logos, corporate identities, brands and products, packaging and advertising, and community services. The Activation segment offers consulting services for planning and implementing promotions, exhibitions, and interactive audio visual services, including multi-media and event management services. The Digital segment provides consulting services and implementing virtual communications, which consist communication in cyberspace and social media, as well as site and account development and management, and analysis services. The Public Relations segment offers communications services; crisis management, investor, media, and government relations; corporate, investigation, and supervision marketing; and marketing intelligence and analysis services. The company was founded in 1970 and is based in South Jakarta, Indonesia. PT Fortune Indonesia Tbk is a subsidiary of PT Karya Citra Prima.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12550",
        "website": "http://thefortuna.co",
        "market_cap": "Large Cap"
    },
    "FREN.JK": {
        "short_name": "Smartfren Telecom Tbk.",
        "long_name": "PT Smartfren Telecom Tbk",
        "summary": "PT Smartfren Telecom Tbk, together with its subsidiaries, provides telecommunication services in Indonesia. The company develops, builds, owns, operates, leases, and maintains facilities and network to operate telecommunications network and services, as well as information and convergence technology services; imports, trades in, distributes, and sells telecommunication goods, equipment, and/or products; and provides after sales services for telecommunication goods, equipment, and/or products. It also offers multimedia products and related services, including voice services, data/image, and other mobile commercial services; electronic money services; and payment services, and/or domestic and international money remittance services. The company was formerly known as PT Mobile-8 Telecom Tbk and changed its name to PT Smartfren Telecom Tbk in March 2011. PT Smartfren Telecom Tbk was founded in 2002 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10340",
        "website": "http://www.smartfren.com",
        "market_cap": "Large Cap"
    },
    "GHON.JK": {
        "short_name": "Gihon Telekomunikasi Indonesia ",
        "long_name": "PT Gihon Telekomunikasi Indonesia Tbk",
        "summary": "PT Gihon Telekomunikasi Indonesia Tbk provides telecommunications support services in Indonesia. The company engages in the engineering, design, construction, installation, and network integration of telecommunication towers. It also provides leasing, operation, and maintenance services. The company was founded in 2001 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "11470",
        "website": "http://www.gihon-indonesia.com",
        "market_cap": "Large Cap"
    },
    "GOLD.JK": {
        "short_name": "Visi Telekomunikasi Infrastrukt",
        "long_name": "PT Visi Telekomunikasi Infrastruktur Tbk",
        "summary": "PT Visi Telekomunikasi Infrastruktur Tbk provides telecommunication infrastructure services in Indonesia. It offers general telecommunication; telecommunication equipment maintenance; multimedia and utilization; procurement of telecommunication human resources; tower and telecommunication equipment leasing; transportation; and base transceiver station tower leasing and management services, as well as consultation services for the telecommunication and electrical sectors. The company also provides leasing and management services for buildings, office and retail spaces, apartment rooms, and condominiums; and consultation services for management, administration business, business development, and investment strategy, as well as for the construction sector. In addition, it invests in other companies. The company was formerly known as PT Golden Retailindo Tbk and changed its name to PT Visi Telekomunikasi Infrastruktur Tbk in August 2016. PT Visi Telekomunikasi Infrastruktur Tbk was founded in 1995 and is headquartered in Jakarta, Indonesia. PT Visi Telekomunikasi Infrastruktur Tbk is a subsidiary of PT Tower Bersama Infrastruktur Tbk.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12790",
        "website": "http://www.ptvti.co.id",
        "market_cap": "Large Cap"
    },
    "IBST.JK": {
        "short_name": "Inti Bangun Sejahtera Tbk.",
        "long_name": "PT Inti Bangun Sejahtera Tbk",
        "summary": "PT Inti Bangun Sejahtera Tbk provides telecommunication network services in the Republic of Indonesia. It rents and maintains telecommunication towers. The company's products include Build to Suit (B2S), a rental space from the operator base to build the tower; co-location, a basic rental space; telecommunication infrastructure in the form of BTS Hotel; and microcell pole with fiber optic network. Its products also comprise Metro-E, a data network solution, which can be used to serve the bandwidth requirements of telecom operators; and Cluster Based, an integrated indoor and outdoor coverage service solution for wireless mobile service in clustered area with indoor and outdoor distributed antenna systems. PT Inti Bangun Sejahtera Tbk was founded in 2006 and is headquartered in Central Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10350",
        "website": "http://www.ibstower.com",
        "market_cap": "Large Cap"
    },
    "IDO1.F": {
        "short_name": "PT INDOSAT TBK",
        "long_name": "PT Indosat Tbk",
        "summary": "PT Indosat Tbk, together with its subsidiaries, provides telecommunication services in Indonesia. It operates through three segments: Cellular; Fixed Telecommunications (Fixed); and Multimedia, Data Communications and Internet (MIDI). The Cellular segment offers postpaid and prepaid products that include various data and mobile voice solutions on 2G, 3G, and 4G broadband cellular networks. This segment markets its products under the IM3 Ooredoo brand. The Fixed segment provides international direct dial, international roaming, and fixed line services. The MIDI segment offers internet and data communication services, such as high-speed point-to-point international and domestic leased circuits with broadband and narrowband capacity, internet protocol-virtual private network, and multiprotocol label switching-based services. This segment also provides satellite-based services, such as transponder leasing and VSAT services, as well as various types of IT services comprising disaster recovery center and data center services, and infrastructure-as-a-service solutions. It provides services under the Indosat Ooredoo brand name. The company was founded in 1967 and is based in Jakarta, Indonesia. PT Indosat Tbk is a subsidiary of Ooredoo Asia Pte. Ltd.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10110",
        "website": "http://indosatooredoo.com",
        "market_cap": "Mid Cap"
    },
    "IPTV.JK": {
        "short_name": "MNC Vision Networks Tbk.",
        "long_name": "PT MNC Vision Networks Tbk",
        "summary": "PT MNC Vision Networks Tbk, together with its subsidiaries, provides program retransmission, TV advertising, direct-to-home satellite, high speed broadband, IP TV, and digital and other services in Indonesia. It also engages in content production activities; and operates Vision+, an over the top based video streaming platform. The company was formerly known as PT. Sky Vision Networs and changed its name to PT MNC Vision Networks Tbk in February 2018. The company was founded in 1989 and is headquartered in Jakarta Pusat, Indonesia. PT MNC Vision Networks Tbk is a subsidiary of PT. Global Mediacom Tbk.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10340",
        "website": "http://www.mncvisionnetworks.com",
        "market_cap": "Large Cap"
    },
    "ISAT.JK": {
        "short_name": "Indosat Tbk.",
        "long_name": "PT Indosat Tbk",
        "summary": "PT Indosat Tbk, together with its subsidiaries, provides telecommunication services in Indonesia. It operates through three segments: Cellular; Fixed Telecommunications (Fixed); and Multimedia, Data Communications and Internet (MIDI). The Cellular segment offers postpaid and prepaid products that include various data and mobile voice solutions on 2G, 3G, and 4G broadband cellular networks. This segment markets its products under the IM3 Ooredoo brand. The Fixed segment provides international direct dial, international roaming, and fixed line services. The MIDI segment offers internet and data communication services, such as high-speed point-to-point international and domestic leased circuits with broadband and narrowband capacity, internet protocol-virtual private network, and multiprotocol label switching-based services. This segment also provides satellite-based services, such as transponder leasing and VSAT services, as well as various types of IT services comprising disaster recovery center and data center services, and infrastructure-as-a-service solutions. It provides services under the Indosat Ooredoo brand name. The company was founded in 1967 and is based in Jakarta, Indonesia. PT Indosat Tbk is a subsidiary of Ooredoo Asia Pte. Ltd.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10110",
        "website": "http://indosatooredoo.com",
        "market_cap": "Large Cap"
    },
    "JAST.JK": {
        "short_name": "Jasnita Telekomindo Tbk.",
        "long_name": "PT. Jasnita Telekomindo Tbk",
        "summary": "PT. Jasnita Telekomindo Tbk provides telecommunications, communications, and networking services in Indonesia. The company offers digital contact center and managed ICT services to banking and financial institutions; voice and communication API services; and smart city and 112 emergency hotline services to the government. It also provides BlazeID, an Internet service; Jascloud that offers telecommunications and IP based solutions; Jasconnect, a call center; and Jasgrid, an IT as a service. The company was founded in 1996 and is headquartered in Central Jakarta, Indonesia. PT. Jasnita Telekomindo Tbk is a subsidiary of PT Persada Inti Sejahtera.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Central Jakarta",
        "zipcode": "10350",
        "website": "http://jasnita.co.id",
        "market_cap": "Large Cap"
    },
    "KBLV.JK": {
        "short_name": "First Media Tbk.",
        "long_name": "PT First Media Tbk",
        "summary": "PT First Media Tbk, together with its subsidiaries, engages in the technology, media, and telecommunication businesses in Indonesia. The company provides internet services provider; internet interconnection services; telecommunication infrastructure and in-building solutions; subscription television through satellite; and news content, as well as operates as a production house for advertisement and television content. It also offers film and video recording, calling card, and e-commerce services, as well as engages in the trading business; publishes newspapers; and provides radio broadcasting services. The company was formerly known as PT Broadband Multimedia Tbk and changed its name to PT First Media Tbk in 2007. PT First Media Tbk was founded in 1994 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12950",
        "website": "http://www.firstmedia.com",
        "market_cap": "Large Cap"
    },
    "LCKM.JK": {
        "short_name": "LCK Global Kedaton Tbk.",
        "long_name": "PT LCK Global Kedaton Tbk",
        "summary": "PT LCK Global Kedaton Tbk operates in the telecommunication and engineering industries in Indonesia. The company undertakes site investigation survey, base transceiver station construction, mechanical and electrical installation, telecommunication network installation, electric supply connection, and commission tower installation works. It also procures and trades in telecommunication equipment, heavy equipment, and vehicles. The company was founded in 2013 and is based in Jakarta, Indonesia. PT LCK Global Kedaton Tbk is a subsidiary of Pt Lck Investama Prima Indonesia.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10640",
        "website": "http://www.lckglobal.co.id",
        "market_cap": "Large Cap"
    },
    "LINK.JK": {
        "short_name": "Link Net Tbk.",
        "long_name": "PT Link Net Tbk",
        "summary": "PT Link Net Tbk distributes television programs and high-speed Internet through its broadband communication network in Indonesia. The company offers Internet broadband services under the FastNet brand name; interactive Pay TV services under the HomeCable brand, which include educational programs, entertainment, news, music, lifestyle, box office, sports, kids, and house channels; and B2B corporate solutions and data services, data transfer, disaster recovery, storage area network, peering, inter-branch connection, and video streaming services under the DataComm brand. It also provides FirstMediaX, a TV anywhere over-the-top application; and communication system, network access point, telephony value added, trading, management consultancy, call center, and other multimedia services. It serves customers in the Jakarta, Bogor, Tangerang, Bekasi, Surabaya, Bali, Bandung, Medan, Batam, Solo, Semarang, Serang, and Cilegon areas of Indonesia. The company was formerly known as PT Seruling Indah Permai and changed its name to PT Link Net Tbk in March 2000. PT Link Net Tbk was founded in 1996 and is based in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12950",
        "website": "http://www.linknet.co.id",
        "market_cap": "Large Cap"
    },
    "LPLI.JK": {
        "short_name": "Star Pacific Tbk",
        "long_name": "PT Star Pacific Tbk",
        "summary": "PT Star Pacific Tbk, through its subsidiaries, engages in the investment and media businesses in Indonesia. It publishes newspapers and magazines; and offers advertising agency, mass media, general trading, and radio broadcasting services. The company was formerly known as PT Lippo ENet Tbk and changed its name to PT Star Pacific Tbk in November 2008. The company was founded in 1983 and is based in Tangerang, Indonesia. PT Star Pacific Tbk is a subsidiary of PT Inti Anugerah Pratama.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang",
        "zipcode": "15810",
        "website": "http://www.star-pacific.co.id",
        "market_cap": "Large Cap"
    },
    "MARI.JK": {
        "short_name": "Mahaka Radio Integra Tbk.",
        "long_name": "PT Mahaka Radio Integra Tbk",
        "summary": "PT Mahaka Radio Integra Tbk engages in the radio broadcasting business in Indonesia. The company owns radio stations for commercial radio broadcasting. It owns and operates 8 radio stations, including JAK 101 fm, GEN 98.7 fm, GEN 103.1 fm, HOT 93.2 fm, KIS 95.1 fm, MUSTANG 88.0 fm, MOST RADIO 105.8 fm, and NOICE. The company was founded in 2006 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12980",
        "website": "http://www.jak101fm.com",
        "market_cap": "Large Cap"
    },
    "MDIA.JK": {
        "short_name": "Intermedia Capital Tbk.",
        "long_name": "PT Intermedia Capital Tbk",
        "summary": "PT Intermedia Capital Tbk, through its subsidiaries, provides television broadcasting services in Indonesia. It operates ANTV, a free-to-air television channel. The company offers content that are focused on families, children, and entertainment. It is also involved in the provision of communication and management consultancy services; and production house activities. The company was founded in 2008 and is headquartered in Jakarta, Indonesia. PT Intermedia Capital Tbk is a subsidiary of PT Visi Media Asia Tbk.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12940",
        "website": "http://www.imc.co.id",
        "market_cap": "Large Cap"
    },
    "MNCN.JK": {
        "short_name": "Media Nusantara Citra Tbk.",
        "long_name": "PT. Media Nusantara Citra Tbk",
        "summary": "PT. Media Nusantara Citra Tbk operates as a media company in Indonesia. It operates through Television, Radio, Print Media, Content, and Advertising Agency segments. The company owns and operates national free-to-air televisions (TV), such as RCTI TV station that offers a range of programs, including drama series, box office movies, sports events, talent search shows, reality shows, music shows, and infotainment programs; MNCTV, which offers family drama series, sports programs, and various shows; GTV that focuses on animation, variety shows, reality shows, game shows, and talent search programs; and iNews TV, which focuses on news, sports, and other factual programs. In addition, it operates RDTI+, an entertainment app; Sindonews.com, an online edition of Koran Sindo, Okezone.com, a general and news portal, iNews.id, a news portal comprising national news and regional portal; and publishes Koran Sindo, a newspaper; and meTube.id, a user generated content platform, as well as ROOV and MNC. The company was founded in 1997 and is headquartered in Jakarta Pusat, Indonesia. PT. Media Nusantara Citra Tbk is a subsidiary of PT. Global Mediacom Tbk.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10340",
        "website": "http://www.mnc.co.id",
        "market_cap": "Large Cap"
    },
    "MS9.SG": {
        "short_name": "MNC Sky Vision TBK Registered S",
        "long_name": "PT MNC Sky Vision Tbk",
        "summary": "PT MNC Sky Vision Tbk, together with its subsidiaries, provides satellite based pay television services in Indonesia. The company distributes approximately 140 local and international channels in various categories, such as sports, news, movies, knowledge, kids, religion, entertainment, hobby/special interest, and others. It provides its services under the Indovision and TopTV brand names. The company was formerly known as PT Matahari Lintas Cakrawala and changed its name to PT MNC Sky Vision Tbk in December 2006. The company was founded in 1988 and is headquartered in Jakarta, Indonesia. PT MNC Sky Vision Tbk is a subsidiary of PT MNC Vision Networks.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "11520",
        "website": "http://www.mncvision.id",
        "market_cap": "Small Cap"
    },
    "MSIN.JK": {
        "short_name": "MNC Studios International Tbk.",
        "long_name": "PT. MNC Studios International Tbk.",
        "summary": "PT. MNC Studios International Tbk. engages in the television and film program, advertising, digital, and talent management businesses in Indonesia. It produces drama series, TV movies, shows, reality shows, music programming, and documentaries. The company also produces box office films for cinemas through in-house production, co-production, project financing, and national film distribution, as well as provides artist management services. In addition, it produces infotainment content, as well as offers complete and integrated media placement services. The company was founded in 2000 and is headquartered in Jakarta Barat, Indonesia. PT. MNC Studios International Tbk. is a subsidiary of PT Media Nusantara Citra, Tbk.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Barat",
        "zipcode": "11530",
        "website": "http://www.msi.id",
        "market_cap": "Large Cap"
    },
    "MSKY.JK": {
        "short_name": "MNC Sky Vision Tbk.",
        "long_name": "PT MNC Sky Vision Tbk",
        "summary": "PT MNC Sky Vision Tbk, together with its subsidiaries, provides satellite based pay television services in Indonesia. The company distributes approximately 140 local and international channels in various categories, such as sports, news, movies, knowledge, kids, religion, entertainment, hobby/special interest, and others. It provides its services under the Indovision and TopTV brand names. The company was formerly known as PT Matahari Lintas Cakrawala and changed its name to PT MNC Sky Vision Tbk in December 2006. The company was founded in 1988 and is headquartered in Jakarta, Indonesia. PT MNC Sky Vision Tbk is a subsidiary of PT MNC Vision Networks.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "11520",
        "website": "http://www.mncvision.id",
        "market_cap": "Large Cap"
    },
    "NFCX.JK": {
        "short_name": "NFC Indonesia Tbk.",
        "long_name": "PT NFC Indonesia Tbk",
        "summary": "PT NFC Indonesia Tbk provides digital products and services in Indonesia. The company operates through Digital Product Aggregator and Digital Cloud Advertisement segments. The company operates Refira and M-Coupon platforms designed for prompting sale; DMMX, a cloud marketing and advertising platform that provides digital cloud marketing ecosystem solution through hardware and content management system, as well as manages service contracts; and film and media analytic platform that offers moviegoers a rating system for new movie release for local and international films. It also provides digital marketing services, such as creative campaign, performance marketing, and social media analytics; financing services for films; and online television and video streaming services. In addition, the company offers digital cloud advertising, online media, advertising, entertainment, radio broadcasting, telecommunication trading, news publishing, and digital broadcasting message services. Further, it produces movies; and sells digital and hardware products. Additionally, the company engages in trade, development, industry, services, printing, land transportation, and agriculture businesses. The company was founded in 2013 and is headquartered in Jakarta Selatan, Indonesia.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12940",
        "website": "http://www.ptnfc.com",
        "market_cap": "Large Cap"
    },
    "PTFRY": {
        "short_name": "TOWER BERSAMA INFRASTRUCTURE TB",
        "long_name": "PT Tower Bersama Infrastructure Tbk",
        "summary": "PT Tower Bersama Infrastructure Tbk provides telecommunication infrastructure solution and services in Indonesia. It leases antenna and other equipment space to Indonesian telecommunications operators for wireless signal transmission related to wireless voice and data transmission. The company also owns and operates distributed antennae system (DAS) networks installed in a building for wireless communications for telecommunications operators in shopping malls and office buildings. As of December 31, 2019, it had 28,740 tenants; and 15,589 telecommunications sites comprising 15,473 telecommunications towers and 116 DAS networks. The company was formerly known as PT Banyan Mas. PT Tower Bersama Infrastructure Tbk was founded in 2004 and is headquartered in Jakarta Selatan, Indonesia.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12940",
        "website": "http://www.tower-bersama.com",
        "market_cap": "Mid Cap"
    },
    "PTI.F": {
        "short_name": "TELKOM INDONESIA ADR/100",
        "long_name": "Perusahaan Perseroan (Persero) PT Telekomunikasi Indonesia Tbk",
        "summary": "Perusahaan Perseroan (Persero) PT Telekomunikasi Indonesia Tbk provides telecommunications, informatics, and network services worldwide. The company's Mobile segment offers mobile voice, SMS, and mobile broadband services; and digital services, including financial services, video on demand, music, gaming, IoT, big data analytics, and digital advertising services. Its Consumer segment provides fixed voice and broadband services; and IPTV and related consumer digital services. The company's Enterprise segment offers ICT and digital platform that covers enterprise-grade connectivity services, including satellite, IT services, data center and cloud, and business process outsourcing services, as well as CPE trading and managed, cyber security, financial, big data, digital advertising, e-health, managed ATM, and professional services. Its Wholesale and International Business segment provides wholesale voice, managed, A2P SMS, IP transit and connectivity, data center and cloud, security, and value added and digital services; mobile network operator, mobile virtual network operator, and call center services; and tower and infrastructure services to other licensed operator companies and institutions. The company's Others segment offers digital services, such as digital platform, digital content, and e-commerce; and property management services. The company also provides building management and maintenance services, payment, business management consulting and capital venture, health insurance administration, tourism, directory information, telecommunication construction, and multimedia portal services; acts as a civil consultant and developer; and leases offices. As of December 31, 2020, it had approximately 9.1 million fixed wireline subscribers, including 8.0 million fixed broadband subscribers; and 169.5 million cellular subscribers, including 115.9 million mobile broadband subscribers. The company was founded in 1884 and is headquartered in Bandung, Indonesia.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bandung",
        "zipcode": "40133",
        "website": "http://www.telkom.co.id",
        "market_cap": "Large Cap"
    },
    "PTXKY": {
        "short_name": "PT XL AXIATA TBK",
        "long_name": "PT XL Axiata Tbk",
        "summary": "PT XL Axiata Tbk provides telecommunication, telecommunications network, and multimedia services for consumers and businesses in Indonesia. The company offers cellular mobile and closed fixed network, Internet service provider, voice over Internet protocol, content provider, money remitter service, e-money issuance services, and Internet interconnection services. It also provides leased line, VPN MPLS, corporate Internet, and voice over Internet protocol services; mobile data and home broadband services; data center and cloud services; mobile communication services; and mobile advertising and big data services, such as messaging services, display services, and digital rewards, as well as Internet of Things based solutions. The company was formerly known as PT Excelcomindo Pratama Tbk. and changed its name to PT XL Axiata Tbk in 2009. The company was founded in 1989 and is headquartered in Jakarta Selatan, Indonesia. PT XL Axiata Tbk is a subsidiary of Axiata Investments (Indonesia) Sdn. Bhd.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12950",
        "website": "http://www.xlaxiata.co.id",
        "market_cap": "Small Cap"
    },
    "SCMA.JK": {
        "short_name": "Surya Citra Media Tbk.",
        "long_name": "PT Surya Citra Media Tbk",
        "summary": "PT Surya Citra Media Tbk, together with its subsidiaries, provides multimedia services in Indonesia. The company owns SCTV and Indosiar television channels. It also provides soccer management, entertainment, and advertising services; and artist management services. In addition, the company engages in film and content trading, content management and production, production house, and multimedia operations; film production and video recording activities; and provision and utilization of multimedia through telecommunications equipment. Further, it offers film distribution and marketing services; content creative; animation production services; film recording services; and information technology, promotion and marketing, general telecommunication, management agency and production, public relations, and mass media and audio recording services. Additionally, the company provides online media, printed and electronic media, and impresario services; and rental and management services. The company was formerly known as PT Cipta Aneka Selaras and changed its name to PT Surya Citra Media Tbk in January 2002. The company was founded in 1999 and is headquartered in Jakarta, Indonesia. PT Surya Citra Media Tbk is a subsidiary of PT Elang Mahkota Teknologi Tbk.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10270",
        "website": "http://www.scm.co.id",
        "market_cap": "Large Cap"
    },
    "SMNUF": {
        "short_name": "SARANA MENARA NUSA",
        "long_name": "PT Sarana Menara Nusantara Tbk.",
        "summary": "PT Sarana Menara Nusantara Tbk., through its subsidiary, PT Profesional Telekomunikasi Indonesia, owns and operates telecommunication towers for wireless operators in Indonesia. It operates through three segments: Tower Rental; Very Small Aperture Terminal (VSAT) Services; and Metropolitan Wireless Fiber Optic and Internet. The company leases space at its multi-tenant tower for wireless operators under long term lease agreements; and acts as a closed fixed network provider with VSAT and fiber optic. It owns and operates approximately 19,319 towers. The company was founded in 2008 and is headquartered in Kudus, Indonesia. PT Sarana Menara Nusantara Tbk. is a subsidiary of PT Sapta Adhikari Investama.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "state": null,
        "city": "Kudus",
        "zipcode": null,
        "website": "http://www.ptsmn.co.id",
        "market_cap": "Mid Cap"
    },
    "TBIG.JK": {
        "short_name": "Tower Bersama Infrastructure Tb",
        "long_name": "PT Tower Bersama Infrastructure Tbk",
        "summary": "PT Tower Bersama Infrastructure Tbk provides telecommunication infrastructure solution and services in Indonesia. It leases antenna and other equipment space to Indonesian telecommunications operators for wireless signal transmission related to wireless voice and data transmission. The company also owns and operates distributed antennae system (DAS) networks installed in a building for wireless communications for telecommunications operators in shopping malls and office buildings. As of December 31, 2019, it had 28,740 tenants; and 15,589 telecommunications sites comprising 15,473 telecommunications towers and 116 DAS networks. The company was formerly known as PT Banyan Mas. PT Tower Bersama Infrastructure Tbk was founded in 2004 and is headquartered in Jakarta Selatan, Indonesia.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12940",
        "website": "http://www.tower-bersama.com",
        "market_cap": "Large Cap"
    },
    "TCID.F": {
        "short_name": "TELKOM INDONESIA B  RP 50",
        "long_name": "Perusahaan Perseroan (Persero) PT Telekomunikasi Indonesia Tbk",
        "summary": "Perusahaan Perseroan (Persero) PT Telekomunikasi Indonesia Tbk provides telecommunications, informatics, and network services worldwide. The company's Mobile segment offers mobile voice, SMS, and mobile broadband services; and digital services, including financial services, video on demand, music, gaming, IoT, big data analytics, and digital advertising services. Its Consumer segment provides fixed voice and broadband services; and IPTV and related consumer digital services. The company's Enterprise segment offers ICT and digital platform that covers enterprise-grade connectivity services, including satellite, IT services, data center and cloud, and business process outsourcing services, as well as CPE trading and managed, cyber security, financial, big data, digital advertising, e-health, managed ATM, and professional services. Its Wholesale and International Business segment provides wholesale voice, managed, A2P SMS, IP transit and connectivity, data center and cloud, security, and value added and digital services; mobile network operator, mobile virtual network operator, and call center services; and tower and infrastructure services to other licensed operator companies and institutions. The company's Others segment offers digital services, such as digital platform, digital content, and e-commerce; and property management services. The company also provides building management and maintenance services, payment, business management consulting and capital venture, health insurance administration, tourism, directory information, telecommunication construction, and multimedia portal services; acts as a civil consultant and developer; and leases offices. As of December 31, 2020, it had approximately 9.1 million fixed wireline subscribers, including 8.0 million fixed broadband subscribers; and 169.5 million cellular subscribers, including 115.9 million mobile broadband subscribers. The company was founded in 1884 and is headquartered in Bandung, Indonesia.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bandung",
        "zipcode": "40133",
        "website": "http://www.telkom.co.id",
        "market_cap": "Large Cap"
    },
    "TLK": {
        "short_name": "PT Telekomunikasi Indonesia, Tb",
        "long_name": "Perusahaan Perseroan (Persero) PT Telekomunikasi Indonesia Tbk",
        "summary": "Perusahaan Perseroan (Persero) PT Telekomunikasi Indonesia Tbk provides telecommunications, informatics, and network services worldwide. The company's Mobile segment offers mobile voice, SMS, and mobile broadband services; and digital services, including financial services, video on demand, music, gaming, IoT, big data analytics, and digital advertising services. Its Consumer segment provides fixed voice and broadband services; and IPTV and related consumer digital services. The company's Enterprise segment offers ICT and digital platform that covers enterprise-grade connectivity services, including satellite, IT services, data center and cloud, and business process outsourcing services, as well as CPE trading and managed, cyber security, financial, big data, digital advertising, e-health, managed ATM, and professional services. Its Wholesale and International Business segment provides wholesale voice, managed, A2P SMS, IP transit and connectivity, data center and cloud, security, and value added and digital services; mobile network operator, mobile virtual network operator, and call center services; and tower and infrastructure services to other licensed operator companies and institutions. The company's Others segment offers digital services, such as digital platform, digital content, and e-commerce; and property management services. The company also provides building management and maintenance services, payment, business management consulting and capital venture, health insurance administration, tourism, directory information, telecommunication construction, and multimedia portal services; acts as a civil consultant and developer; and leases offices. As of December 31, 2020, it had approximately 9.1 million fixed wireline subscribers, including 8.0 million fixed broadband subscribers; and 169.5 million cellular subscribers, including 115.9 million mobile broadband subscribers. The company was founded in 1884 and is headquartered in Bandung, Indonesia.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bandung",
        "zipcode": "40133",
        "website": "http://www.telkom.co.id",
        "market_cap": "Large Cap"
    },
    "TLKM.JK": {
        "short_name": "Telkom Indonesia (Persero) Tbk.",
        "long_name": "Perusahaan Perseroan (Persero) PT Telekomunikasi Indonesia Tbk",
        "summary": "Perusahaan Perseroan (Persero) PT Telekomunikasi Indonesia Tbk provides telecommunications, informatics, and network services worldwide. The company's Mobile segment offers mobile voice, SMS, and mobile broadband services; and digital services, including financial services, video on demand, music, gaming, IoT, big data analytics, and digital advertising services. Its Consumer segment provides fixed voice and broadband services; and IPTV and related consumer digital services. The company's Enterprise segment offers ICT and digital platform that covers enterprise-grade connectivity services, including satellite, IT services, data center and cloud, and business process outsourcing services, as well as CPE trading and managed, cyber security, financial, big data, digital advertising, e-health, managed ATM, and professional services. Its Wholesale and International Business segment provides wholesale voice, managed, A2P SMS, IP transit and connectivity, data center and cloud, security, and value added and digital services; mobile network operator, mobile virtual network operator, and call center services; and tower and infrastructure services to other licensed operator companies and institutions. The company's Others segment offers digital services, such as digital platform, digital content, and e-commerce; and property management services. The company also provides building management and maintenance services, payment, business management consulting and capital venture, health insurance administration, tourism, directory information, telecommunication construction, and multimedia portal services; acts as a civil consultant and developer; and leases offices. As of December 31, 2020, it had approximately 9.1 million fixed wireline subscribers, including 8.0 million fixed broadband subscribers; and 169.5 million cellular subscribers, including 115.9 million mobile broadband subscribers. The company was founded in 1884 and is headquartered in Bandung, Indonesia.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bandung",
        "zipcode": "40133",
        "website": "http://www.telkom.co.id",
        "market_cap": "Large Cap"
    },
    "TLKMF": {
        "short_name": "TELKOM INDONESIA(PERSERO) TBK",
        "long_name": "Perusahaan Perseroan (Persero) PT Telekomunikasi Indonesia Tbk",
        "summary": "Perusahaan Perseroan (Persero) PT Telekomunikasi Indonesia Tbk provides telecommunications, informatics, and network services worldwide. The company's Mobile segment offers mobile voice, SMS, and mobile broadband services; and digital services, including financial services, video on demand, music, gaming, IoT, big data analytics, and digital advertising services. Its Consumer segment provides fixed voice and broadband services; and IPTV and related consumer digital services. The company's Enterprise segment offers ICT and digital platform that covers enterprise-grade connectivity services, including satellite, IT services, data center and cloud, and business process outsourcing services, as well as CPE trading and managed, cyber security, financial, big data, digital advertising, e-health, managed ATM, and professional services. Its Wholesale and International Business segment provides wholesale voice, managed, A2P SMS, IP transit and connectivity, data center and cloud, security, and value added and digital services; mobile network operator, mobile virtual network operator, and call center services; and tower and infrastructure services to other licensed operator companies and institutions. The company's Others segment offers digital services, such as digital platform, digital content, and e-commerce; and property management services. The company also provides building management and maintenance services, payment, business management consulting and capital venture, health insurance administration, tourism, directory information, telecommunication construction, and multimedia portal services; acts as a civil consultant and developer; and leases offices. As of December 31, 2020, it had approximately 9.1 million fixed wireline subscribers, including 8.0 million fixed broadband subscribers; and 169.5 million cellular subscribers, including 115.9 million mobile broadband subscribers. The company was founded in 1884 and is headquartered in Bandung, Indonesia.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bandung",
        "zipcode": "40133",
        "website": "http://www.telkom.co.id",
        "market_cap": "Large Cap"
    },
    "TMPO.JK": {
        "short_name": "Tempo Intimedia Tbk.",
        "long_name": "PT Tempo Inti Media Tbk",
        "summary": "PT Tempo Inti Media Tbk, together with its subsidiaries, engages in the publishing business in Indonesia. The company is also involved in event convention organizer; publishing press; paper trading; building and transport management; buying and selling of digital newspaper, magazine, and media; training, data processing, and research and consultancy; education; multimedia and creative house; television broadcasting; and industrial general trading activities. PT Tempo Inti Media Tbk was founded in 1971 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12210",
        "website": "http://korporat.tempo.co",
        "market_cap": "Large Cap"
    },
    "TOWR.JK": {
        "short_name": "Sarana Menara Nusantara Tbk.",
        "long_name": "PT Sarana Menara Nusantara Tbk.",
        "summary": "PT Sarana Menara Nusantara Tbk., through its subsidiary, PT Profesional Telekomunikasi Indonesia, owns and operates telecommunication towers for wireless operators in Indonesia. It operates through two segments, Tower Rental and Very Small Aperture Terminal (VSAT) and Wireline Services. The company leases space at its multi-tenant tower for wireless operators under long term lease agreements; and acts as a closed fixed network provider with VSAT and fiber optic. It owns and operates approximately 21,381 towers. The company was founded in 2008 and is headquartered in Kudus, Indonesia. PT Sarana Menara Nusantara Tbk. is a subsidiary of PT Sapta Adhikari Investama.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Kudus",
        "zipcode": null,
        "website": "http://www.ptsmn.co.id",
        "market_cap": "Large Cap"
    },
    "VIVA.JK": {
        "short_name": "Visi Media Asia Tbk.",
        "long_name": "PT Visi Media Asia Tbk",
        "summary": "PT Visi Media Asia Tbk operates as an integrated convergent media company in Indonesia. It operates through Advertisement and Non-Advertisement segments. The company operates tvOne, a news and sports television station; ANTV, which provides entertainment and lifestyle content, such as drama, comedy, animation, and other general entertainment programs for families and children; viva.co.id, an online news and entertainment portal; and Viva and tvOneConnect applications to access and engage with tvOne content. It also offers trading and business management consultancy services; office rental, property management, and other services; internet advertising and website services; multimedia and telecommunication services; general private television broadcasting services; television broadcasting industry services; and production house services. The company was founded in 2004 and is based in Jakarta, Indonesia. PT Visi Media Asia Tbk is a subsidiary of PT Bakrie Global Ventura.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12920",
        "website": "http://www.vivagroup.co.id",
        "market_cap": "Large Cap"
    }
}