{
    "06L.SG": {
        "short_name": "Global Mediacom Tbk, PT Registe",
        "long_name": "PT. Global Mediacom Tbk",
        "summary": "PT. Global Mediacom Tbk operates as an integrated media company in Indonesia and internationally. The company operates through Advertising and Content, and Pay TV and Broadband segments. It operates 4 free-to-air TV stations, including RCTI, MNCTV, GTV, and iNews; and provides content production and content library services. The company also operates Okezone.com, an online news and entertainment portal that publishes approximately 700-800 new items and provides online TV streaming service through Okezone.tv; metube.id, an entertainment video portal; misteraladin.com, an online travel service for ticket sales, accommodation, and travel packages; thefthing.com, an online shopping portal; and mncshop.co.id, an online shopping center. In addition, it offers talent management and advertising services; fixed broadband/IPTV and DTH services; animation games and parenting services; and TV production services. The company was formerly known as PT Bimantara Citra Tbk. and changed its name to PT. Global Mediacom Tbk in March 2007. The company was founded in 1981 and is based in Jakarta, Indonesia. PT. Global Mediacom Tbk is a subsidiary of PT MNC Investama Tbk.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10340",
        "website": "http://mediacom.co.id",
        "market_cap": "Small Cap"
    },
    "BHIT.JK": {
        "short_name": "MNC Investama Tbk.",
        "long_name": "PT MNC Investama Tbk",
        "summary": "PT MNC Investama Tbk, an investment holding company, engages in fields of financial services, media, and lifestyle property businesses in Indonesia. It operates four free-to-air television stations, such as RCTI, MNCTV, GTV, and iNews; FTA, third parties, cinemas, and digital platforms; broadcast, content, and animation production; news contents; and broadband and DTH services. The company also provides financial services, which include banking, consumer finance, leasing, securities, asset management, general insurance, life insurance, and financial technology; new car and multi-purpose financing and mortgages; and develops digital application to deliver credit processing. In addition, the company offers leasing, sale and leaseback, factoring, project financing, infrastructure financing, and other financings; and brokerage, margin financing, research, underwriting, financial advisory, mutual funds, and trading services. Further it, provides assurance products, including health, accident, and unit link, as well as, insurances for education, pension, health, accident and life. Additionally, it provides e-money, e-wallet, digital remittance, and loyalty programs. The company engages in lifestyle property, hospitality, and entertainment business, consisting of theme park resort; international four-star, five-star, and six-star hotels; villas and condominiums; golf course; and other supporting facilities. It also develops hotels and resorts. The company also engages in transportation and mining business. The company was formerly known as PT Bhakti Investama Tbk and changed its name to PT MNC Investama Tbk in August 2013. PT MNC Investama Tbk was founded in 1989 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10340",
        "website": "http://www.mncgroup.com",
        "market_cap": "Large Cap"
    },
    "BLTZ.JK": {
        "short_name": "Graha Layar Prima Tbk.",
        "long_name": "PT Graha Layar Prima Tbk",
        "summary": "PT Graha Layar Prima Tbk, through its subsidiary, PT Graha Layar Mitra, operates in the cinema industry in Indonesia. The company also provides food and beverage, event and advertisement, and licensing and management services. As of December 31, 2018, it operated 51 CGV cinemas and 3 blitztheater cinemas. The company was founded in 2004 and is headquartered in South Jakarta, Indonesia. PT Graha Layar Prima Tbk is a subsidiary of CJ CGV Co. Ltd. As per the transaction announced on November 18, 2019, PT Graha Layar Prima Tbkoperates as a subsidiary of CGI Holdings Co., Ltd.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "South Jakarta",
        "zipcode": "12930",
        "website": "http://www.cgv.id",
        "market_cap": "Large Cap"
    },
    "BMTR.JK": {
        "short_name": "Global Mediacom Tbk.",
        "long_name": "PT. Global Mediacom Tbk",
        "summary": "PT. Global Mediacom Tbk operates as an integrated media company in Indonesia and internationally. The company operates through Advertising and Content, and Pay TV and Broadband segments. It operates 4 free-to-air TV stations, including RCTI, MNCTV, GTV, and iNews; and provides content production and content library services. The company also operates Okezone.com, an online news and entertainment portal that publishes approximately 700-800 new items and provides online TV streaming service through Okezone.tv; metube.id, an entertainment video portal; misteraladin.com, an online travel service for ticket sales, accommodation, and travel packages; thefthing.com, an online shopping portal; and mncshop.co.id, an online shopping center. In addition, it offers talent management and advertising services; fixed broadband/IPTV and DTH services; animation games and parenting services; and TV production services. The company was formerly known as PT Bimantara Citra Tbk. and changed its name to PT. Global Mediacom Tbk in March 2007. The company was founded in 1981 and is based in Jakarta, Indonesia. PT. Global Mediacom Tbk is a subsidiary of PT MNC Investama Tbk.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10340",
        "website": "http://mediacom.co.id",
        "market_cap": "Large Cap"
    },
    "DYAN.JK": {
        "short_name": "Dyandra Media International Tbk",
        "long_name": "PT Dyandra Media International Tbk",
        "summary": "PT Dyandra Media International Tbk, together with its subsidiaries, provides event solutions in Indonesia. The company organizes events and exhibitions; and provides supporting events. It also operates venues and halls, including convention and exhibition halls; and hotels. The company was founded in 1994 and is headquartered in Central Jakarta, Indonesia. PT Dyandra Media International Tbk is a subsidiary of PT Teletransmedia.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10310",
        "website": "http://www.dyandramedia.com",
        "market_cap": "Large Cap"
    },
    "FILM.JK": {
        "short_name": "MD Pictures Tbk.",
        "long_name": "PT MD Pictures Tbk",
        "summary": "PT MD Pictures Tbk produces and distributes films and videos in Indonesia. It is also involved in the studio rental and shooting equipment rental activities. The company was founded in 2002 and is headquartered in Jakarta, Indonesia. PT MD Pictures Tbk is a subsidiary of PT MD Graha Utama.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12910",
        "website": "http://www.mdpictures.com",
        "market_cap": "Large Cap"
    },
    "IPTV.JK": {
        "short_name": "MNC Vision Networks Tbk.",
        "long_name": "PT MNC Vision Networks Tbk",
        "summary": "PT MNC Vision Networks Tbk, together with its subsidiaries, provides program retransmission, TV advertising, direct-to-home satellite, high speed broadband, IP TV, and digital and other services in Indonesia. It also engages in content production activities; and operates Vision+, an over the top based video streaming platform. The company was formerly known as PT. Sky Vision Networs and changed its name to PT MNC Vision Networks Tbk in February 2018. The company was founded in 1989 and is headquartered in Jakarta Pusat, Indonesia. PT MNC Vision Networks Tbk is a subsidiary of PT. Global Mediacom Tbk.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10340",
        "website": "http://www.mncvisionnetworks.com",
        "market_cap": "Large Cap"
    },
    "KBLV.JK": {
        "short_name": "First Media Tbk.",
        "long_name": "PT First Media Tbk",
        "summary": "PT First Media Tbk, together with its subsidiaries, engages in the technology, media, and telecommunication businesses in Indonesia. The company provides internet services provider; internet interconnection services; telecommunication infrastructure and in-building solutions; subscription television through satellite; and news content, as well as operates as a production house for advertisement and television content. It also offers film and video recording, calling card, and e-commerce services, as well as engages in the trading business; publishes newspapers; and provides radio broadcasting services. The company was formerly known as PT Broadband Multimedia Tbk and changed its name to PT First Media Tbk in 2007. PT First Media Tbk was founded in 1994 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12950",
        "website": "http://www.firstmedia.com",
        "market_cap": "Large Cap"
    },
    "MNCN.JK": {
        "short_name": "Media Nusantara Citra Tbk.",
        "long_name": "PT. Media Nusantara Citra Tbk",
        "summary": "PT. Media Nusantara Citra Tbk operates as a media company in Indonesia. It operates through Television, Radio, Print Media, Content, and Advertising Agency segments. The company owns and operates national free-to-air televisions (TV), such as RCTI TV station that offers a range of programs, including drama series, box office movies, sports events, talent search shows, reality shows, music shows, and infotainment programs; MNCTV, which offers family drama series, sports programs, and various shows; GTV that focuses on animation, variety shows, reality shows, game shows, and talent search programs; and iNews TV, which focuses on news, sports, and other factual programs. In addition, it operates RDTI+, an entertainment app; Sindonews.com, an online edition of Koran Sindo, Okezone.com, a general and news portal, iNews.id, a news portal comprising national news and regional portal; and publishes Koran Sindo, a newspaper; and meTube.id, a user generated content platform, as well as ROOV and MNC. The company was founded in 1997 and is headquartered in Jakarta Pusat, Indonesia. PT. Media Nusantara Citra Tbk is a subsidiary of PT. Global Mediacom Tbk.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10340",
        "website": "http://www.mnc.co.id",
        "market_cap": "Large Cap"
    },
    "MS9.SG": {
        "short_name": "MNC Sky Vision TBK Registered S",
        "long_name": "PT MNC Sky Vision Tbk",
        "summary": "PT MNC Sky Vision Tbk, together with its subsidiaries, provides satellite based pay television services in Indonesia. The company distributes approximately 140 local and international channels in various categories, such as sports, news, movies, knowledge, kids, religion, entertainment, hobby/special interest, and others. It provides its services under the Indovision and TopTV brand names. The company was formerly known as PT Matahari Lintas Cakrawala and changed its name to PT MNC Sky Vision Tbk in December 2006. The company was founded in 1988 and is headquartered in Jakarta, Indonesia. PT MNC Sky Vision Tbk is a subsidiary of PT MNC Vision Networks.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "11520",
        "website": "http://www.mncvision.id",
        "market_cap": "Small Cap"
    },
    "MSIN.JK": {
        "short_name": "MNC Studios International Tbk.",
        "long_name": "PT. MNC Studios International Tbk.",
        "summary": "PT. MNC Studios International Tbk. engages in the television and film program, advertising, digital, and talent management businesses in Indonesia. It produces drama series, TV movies, shows, reality shows, music programming, and documentaries. The company also produces box office films for cinemas through in-house production, co-production, project financing, and national film distribution, as well as provides artist management services. In addition, it produces infotainment content, as well as offers complete and integrated media placement services. The company was founded in 2000 and is headquartered in Jakarta Barat, Indonesia. PT. MNC Studios International Tbk. is a subsidiary of PT Media Nusantara Citra, Tbk.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Barat",
        "zipcode": "11530",
        "website": "http://www.msi.id",
        "market_cap": "Large Cap"
    },
    "MSKY.JK": {
        "short_name": "MNC Sky Vision Tbk.",
        "long_name": "PT MNC Sky Vision Tbk",
        "summary": "PT MNC Sky Vision Tbk, together with its subsidiaries, provides satellite based pay television services in Indonesia. The company distributes approximately 140 local and international channels in various categories, such as sports, news, movies, knowledge, kids, religion, entertainment, hobby/special interest, and others. It provides its services under the Indovision and TopTV brand names. The company was formerly known as PT Matahari Lintas Cakrawala and changed its name to PT MNC Sky Vision Tbk in December 2006. The company was founded in 1988 and is headquartered in Jakarta, Indonesia. PT MNC Sky Vision Tbk is a subsidiary of PT MNC Vision Networks.",
        "currency": "IDR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "11520",
        "website": "http://www.mncvision.id",
        "market_cap": "Large Cap"
    }
}