{
  "DIGI.JK": {
    "city": "Central Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Internet Content & Information",
    "long_name": "PT Arkadia Digital Media Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "Arkadia Digital Media Tbk.",
    "state": null,
    "summary": "PT Arkadia Digital Media Tbk operates as an independent and integrated digital media company in Indonesia. It operates Suara.com, a news portal; Matamata.com, a celebrity and entertainment portal; Bolatimes.com, a soccer and sports portal; and Hitekno.com, a technology and gadget portal. The company also operates Dewiku.com, a platform for females; Mobimoto.com, an automotive and motorsports portal; Guideku.com, a travelling, and food and beverage portal; and Himedik.com, a health and medical portal. In addition, it offers content for mobile phone subscribers through Arkadia Mobile; produces video content for clients ranging from government institutions to corporations; and provides event management services. The company was formerly known as PT Bukit Irama and changed its name to PT Arkadia Digital Media Tbk in February 2018. PT Arkadia Digital Media Tbk was founded in 2012 and is headquartered in Central Jakarta, Indonesia.",
    "website": "http://www.arkadiacorp.com",
    "zipcode": null
  },
  "NFCX.JK": {
    "city": "Jakarta Selatan",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Internet Content & Information",
    "long_name": "PT NFC Indonesia Tbk",
    "market": "id_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "NFC Indonesia Tbk.",
    "state": null,
    "summary": "PT NFC Indonesia Tbk provides digital products and services in Indonesia. The company operates through Digital Product Aggregator and Digital Cloud Advertisement segments. The company operates Refira and M-Coupon platforms designed for prompting sale; DMMX, a cloud marketing and advertising platform that provides digital cloud marketing ecosystem solution through hardware and content management system, as well as manages service contracts; and film and media analytic platform that offers moviegoers a rating system for new movie release for local and international films. It also provides digital marketing services, such as creative campaign, performance marketing, and social media analytics; financing services for films; and online television and video streaming services. In addition, the company offers digital cloud advertising, online media, advertising, entertainment, radio broadcasting, telecommunication trading, news publishing, and digital broadcasting message services. Further, it produces movies; and sells digital and hardware products. Additionally, the company engages in trade, development, industry, services, printing, land transportation, and agriculture businesses. The company was founded in 2013 and is headquartered in Jakarta Selatan, Indonesia.",
    "website": "http://www.ptnfc.com",
    "zipcode": "12940"
  }
}
