{
    "0058.HK": {
        "short_name": "SUNWAY INT'L",
        "long_name": "Sunway International Holdings Limited",
        "summary": "Sunway International Holdings Limited, an investment holding company, engages in manufacturing and trading of construction materials in Hong Kong and the People's Republic of China. The company offers pre-stressed high strength concrete piles, ready-mixed concrete, autoclaved sand-lime bricks, aerated concrete products, and eco-permeable concrete products. It also engages in the property development activities. The company was incorporated in 1999 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.hk0058.com",
        "market_cap": 78126000
    },
    "0094.HK": {
        "short_name": "GREENHEART GP",
        "long_name": "Greenheart Group Limited",
        "summary": "Greenheart Group Limited, an investment holding company, engages in forestry business worldwide. It operates in two segments, Suriname and New Zealand. The company is involved in hardwood log harvesting and timber processing, as well as the marketing, sale, and trading of logs and timber products. It offers softwood products, such as radiata pine logs for sawn timber and plywood and veneer; and hardwood products used for furniture, flooring, decking, windows/doors, outdoor timber/heavy construction, interior decoration, and marine applications. As of December 31, 2020, the company managed radiata pine plantation forest assets with a total freehold title land base of approximately 12,700 hectares located in Northland region of New Zealand, as well as approximately 340,000 hectares of concessions and cutting rights in Suriname, South America. It also provides corporate, administrative and management, forest management, and shipping services; holds timber concessions, and harvests and sells logs and timber products; manufactures and sells pallets; and administers forestry operations. The company was formerly known as Omnicorp Limited and changed its name to Greenheart Group Limited in December 2010. The company was incorporated in 1991 and is headquartered in Wanchai, Hong Kong. Greenheart Group Limited is a subsidiary of Newforest Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.greenheartgroup.com",
        "market_cap": 255988608
    },
    "0103.HK": {
        "short_name": "SHOUGANG CENT",
        "long_name": "Shougang Concord Century Holdings Limited",
        "summary": "Shougang Concord Century Holdings Limited, an investment holding company, manufactures and sells steel cords for use in radial tyres in the People's Republic of China. It also engages in the manufacture of sawing wires and hose wires under the Eastern brand. In addition, the company invests in properties, as well as provides management, investment trading, and consulting services. It exports its products to Europe, the Middle East, and Africa, as well as North America, South America, and rest of Asia. The company was incorporated in 1991 and is based in Chai Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Chai Wan",
        "zipcode": null,
        "website": "http://www.shougangcentury.com.hk",
        "market_cap": 569595008
    },
    "0159.HK": {
        "short_name": "BROCKMAN MINING",
        "long_name": "Brockman Mining Limited",
        "summary": "Brockman Mining Limited, an investment holding company, engages in the acquisition, exploration, and development of iron ore mining projects in Australia. Its principal projects include the Marillana Project covering an area of 82 square kilometers; and the Ophthalmia Project and other exploration projects located in the Pilbara region of Western Australia. The company was formerly known as Wah Nam International Holdings Limited and changed its name to Brockman Mining Limited in September 2012. Brockman Mining Limited is headquartered in Admiralty, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.brockmanmining.com",
        "market_cap": 2087826688
    },
    "0195.HK": {
        "short_name": "GREENTECH INTL",
        "long_name": "Greentech Technology International Limited",
        "summary": "Greentech Technology International Limited, an investment holding company, engages in the exploration, development, and mining of tin and copper bearing ores in Australia. It holds 50% interests in the Renison underground mine, the Mount Bischoff open cut tin project, and the Renison tailings retreatment project located in Tasmania. The company was formerly known as L'sea Resources International Holdings Limited and changed its name to Greentech Technology International Limited in October 2017. Greentech Technology International Limited was incorporated in 2008 and is based in Tsim Sha Tsui, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.green-technology.com.hk",
        "market_cap": 730810048
    },
    "0274.HK": {
        "short_name": "C BILLION RES",
        "long_name": "China Billion Resources Limited",
        "summary": "China Billion Resources Limited, an investment holding company, engages in the exploration, development, and mining of gold in the People's Republic of China and Hong Kong. The company operates through Mining Products and Money Lending segments. It also provides money lending services; and trades in coal. The company was formerly known as Global Green Tech Group Limited and changed its name to China Billion Resources Limited in September 2011. China Billion Resources Limited was incorporated 2000 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Gold",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.chinabillion.net",
        "market_cap": 279058912
    },
    "0276.HK": {
        "short_name": "MONGOLIA ENERGY",
        "long_name": "Mongolia Energy Corporation Limited",
        "summary": "Mongolia Energy Corporation Limited, an investment holding company, engages in the coal mining, processing, and other resources related operations in the People's Republic of China and Mongolia. It sells coking and thermal coal. The company's principal project is the Khushuut coking coal project in Western Mongolia. It holds approximately 13,981 hectares of exploration and mining concession areas for coal and ferrous resources in Western Mongolia at Khovd, Gobi Altay, Olon Bulag, and Bayan-Ulgii. The company is also involved in the provision of management services, and secretarial and nominee services, as well as mining and exploration advisory service; trading of coal; and operation of coal washing plants. Mongolia Energy Corporation Limited is based in Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.mongolia-energy.com",
        "market_cap": 210701120
    },
    "0297.HK": {
        "short_name": "SINOFERT",
        "long_name": "Sinofert Holdings Limited",
        "summary": "Sinofert Holdings Limited, an investment holding company, engages in the production, import and export, distribution, and retail of fertilizer raw materials and finished products primarily in Mainland China and Macao Special Administrative Region. The company operates through Basic Fertilizers, Distribution, and Production segments. It offers nitrogen, phosphate, and potash; compound fertilizers; and monocalcium/dicalcium phosphate. The company also provides technological research and development, and services relating to the fertilizer business and products; trades in pesticides and fertilizers; develops agriculture products; and manufactures and sells textiles and feed stuffs. In addition, it explores for and exploits phosphate mine. The company is based in Wan Chai, Hong Kong. Sinofert Holdings Limited in incorporated in 1994 and is a subsidiary of Sinochem Hong Kong (Group) Company Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.sinofert.com",
        "market_cap": 8148372992
    },
    "0336.HK": {
        "short_name": "HUABAO INTL",
        "long_name": "Huabao International Holdings Limited",
        "summary": "Huabao International Holdings Limited, an investment holding company, researches, develops, produces, distributes, and sells flavors and fragrances, aroma and tobacco raw materials, and condiment products primarily in the People's Republic of China. The company operates through four segments: Flavours and Fragrances, Tobacco Raw Materials, Aroma Raw Materials, and Condiment. It offers paper-making reconstituted tobacco leaves and new materials products for the tobacco industry. The company is also involved in the production and sale of natural extracts; tobacco flavours and fragrances; filter materials; synthetic perfume; and food flavours and fragrances. Huabao International Holdings Limited was founded in 1996 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.hbglobal.com",
        "market_cap": 40153292800
    },
    "0340.HK": {
        "short_name": "TONGGUAN GOLD",
        "long_name": "Tongguan Gold Group Limited",
        "summary": "Tongguan Gold Group Limited, an investment holding company, primarily engages in the exploration, mining, processing, and sale of gold and related products in the People's Republic of China. The company was formerly known as China Mining Resources Group Limited and changed its name to Tongguan Gold Group Limited in April 2018. The company is headquartered in Admiralty, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Gold",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.tongguangold.com",
        "market_cap": 1187294464
    },
    "0366.HK": {
        "short_name": "LUKS GROUP (VN)",
        "long_name": "Luks Group (Vietnam Holdings) Company Limited",
        "summary": "Luks Group (Vietnam Holdings) Company Limited, an investment holding company, manufactures and sells cement products for use in the construction industry in Vietnam, Hong Kong, and Mainland China. It operates through five segments: Cement Products; Property Investment; Hotel Operation; Property Development; and Corporate and Others. The company offers cement products under the KIM DINH brand to construction sites and retail markets; provides clinkers; and invests in and rents various properties, including industrial, commercial, and residential premises, as well as provides property management and related services. It also develops and sells properties; operates and manages the Pentahotel Hong Kong with 298 rooms located in Tuen Mun; sells and trades in electronic products, including printed circuits boards and other electronics components; and manufactures and sells plywood products. The company was founded in 1975 and is based in To Kwa Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "To Kwa Wan",
        "zipcode": null,
        "website": "http://www.luks.com.hk",
        "market_cap": 678451968
    },
    "0377.HK": {
        "short_name": "CHINA HUAJUN GP",
        "long_name": "China Huajun Group Limited",
        "summary": "China Huajun Group Limited, an investment holding company, manufactures and sells multi-color packaging products, carton boxes, books, brochures, and other paper products in the People's Republic of China, the United States, Hong Kong, European countries, and internationally. It operates through five segments: Printing, Trading and Logistics, Property Development and Investments, Solar Photovoltaic, and Financial Services. The company also offers logistics and supply chain management services; finance leasing and money lending services; securities brokerage, asset management and other related services, as well as invests in equity securities, funds, and bonds; marketing, fund management, management, energy development, and consulting services. In addition, it trades in petrochemical, rubber, and paper products. Further, the company develops, invests, and manages real estate properties; and manufactures and sells solar control equipment, monocrystalline silicon wafers, solar stent, polycrystalline silicones, solar cells, coated glasses, rare metals, solar modules, silicon materials, and related products. Additionally, it manufactures and sells hydraulic machinery, and automobile and related product; and operates hotels. The company was formerly known as Huajun International Group Limited and changed its name to China Huajun Group Limited in October 2020. The company was incorporated in 1968 and is headquartered in Central, Hong Kong. China Huajun Group Limited is a subsidiary of China Huajun Group Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.huajunintlgroup.com",
        "market_cap": 369257984
    },
    "0408.HK": {
        "short_name": "YIP'S CHEMICAL",
        "long_name": "Yip's Chemical Holdings Limited",
        "summary": "Yip's Chemical Holdings Limited, an investment holding company, produces and sells petrochemical products in the People's Republic of China and Hong Kong. It operates through Solvents, Coatings, Inks, Lubricants, and Properties segments. The Solvents segment produces industrial organic solvents, such as ethyl acetate, normal butyl acetate, mixed butyl acetate, ethanol, and butyl acrylate used in coatings, tannery, medicine, and adhesives industries. The Coatings segment provides architectural coatings, including inner and outer wall paints, and water-based emulsion and wood paints for the household paints market; industrial coatings comprising coatings for furniture, and plastic and mechanical products; and alkyd, acrylic, UV, amino, and water-based resins, as well as PU hardeners. This segment offers its products under the Camel, Aquapro, and VIVA brands. The Inks segment provides plastic and paper printing inks for use in food, drinks and gift packaging, and paper printing applications under the Bauhinia Variegata brand. The Lubricants segment offers automotive and industrial lubricants, including engine oils, antifreezes, system coolants, brake fluids, greases, gear oils, automatic transmission fluids, hydraulic oils, turbine oils, heat conducting oils, slideway oils, compressor oils, and circulating oils under the Hercules brand. It also provides specialty lubricants under the Pacoil brand to the metal processing, automobiles, home appliances, electronics, steel, toys, power generation, cement, textiles, foundry, plastics, chemicals, paper making, glass, wires, and cables industries. The Properties segment invests in properties. The company also trades in coatings, solvents, resins, inks, lubricants, and sanitizing products; offers treasury and car maintenance services; and generates and sells electricity. The company was formerly known as Hang Cheung Hong. Yip's Chemical Holdings Limited was founded in 1971 and is headquartered in Wanchai, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.yipschemical.com",
        "market_cap": 2453683712
    },
    "0505.HK": {
        "short_name": "XINGYE ALLOY",
        "long_name": "Xingye Alloy Materials Group Limited",
        "summary": "Xingye Alloy Materials Group Limited manufactures, sells, and trades in high precision copper plates and strips in Mainland China, Thailand, Taiwan, and internationally. It operates through Copper Products and Online Games segments. The company's products include high precision tin-phosphor bronze strips, copper tin zinc alloys, brass strips, zinc copper strips, multicomponent copper alloys, copper alloy strips, copper alloys, and red copper strips. It also trades in raw materials; develops, publishes, and operates online games and provides related services; and provides processing and property services. The company's products are used in electronic equipment, automobile, and electric power and household appliances. It also exports its products to Southeast Asia, India, and other countries. The company was formerly known as Huan Yue Interactive Holdings Limited and changed its name to Xingye Alloy Materials Group Limited in July 2020. Xingye Alloy Materials Group Limited was founded in 1985 and is headquartered in Kowloon, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.xingyealloy.com",
        "market_cap": 953033984
    },
    "0509.HK": {
        "short_name": "SUNSHINE",
        "long_name": "Century Sunshine Group Holdings Limited",
        "summary": "Century Sunshine Group Holdings Limited, an investment holding company, engages in the fertilizer, magnesium product, and metallurgical flux businesses in the People's Republic of China. The company offers organic, si-mg, functional, and ecological fertilizers for use in food crops and tea, fruit, vegetables, peanuts, bamboo, and eucalyptus under the Le He He, Feng Shou, Zhan Lan, Yanyangtian, and Dongfanghong brands, as well as basic magnesium products and rare earth magnesium alloys. It also explores and sells serpentine. The company was founded in 2000 and is headquartered in Tsim Sha Tsui, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.centurysunshine.com.hk",
        "market_cap": 233637120
    },
    "0521.HK": {
        "short_name": "CWT INT'L",
        "long_name": "CWT International Limited",
        "summary": "CWT International Limited, an investment holding company, provides commodity marketing services. The company operates through four segments: Logistics Services, Commodity Marketing, Engineering Services, and Financial Services. It engages in the trading and supply chain management of base metal non-ferrous concentrates with a focus on copper, lead, zinc, and other minor metals, as well as energy products, including naphtha and distillates. The company also offers logistics services, such as warehousing, transportation, freight forwarding and cargo consolidation, and supply chain management services. In addition, it provides engineering services comprising management and maintenance of facilities, vehicles, and equipment; supplies and installs engineering products; property management services; and designs and builds logistic properties. Further, the company offers financial brokerage, structured trade, and assets management services. It operates in Mainland China, Singapore, and other parts of the Asia Pacific region; Europe; Africa; North America; and South America. The company was formerly known as HNA Holding Group Co. Limited and changed its name to CWT International Limited in December 2017. CWT International Limited was incorporated in 1983 and is based in Wan Chai, Hong Kong. CWT International Limited is a subsidiary of Hong Kong HNA Holding Group Co. Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.cwtinternational.com",
        "market_cap": 1037399936
    },
    "0601.HK": {
        "short_name": "REMT",
        "long_name": "Rare Earth Magnesium Technology Group Holdings Limited",
        "summary": "Rare Earth Magnesium Technology Group Holdings Limited, an investment holding company, develops, manufactures, and sells magnesium alloy new material products in Mainland China and Europe. It also operates a dolomite mine in Baishan City, Jilin Province. The company was formerly known as Group Sense (International) Limited and changed its name to Rare Earth Magnesium Technology Group Holdings Limited in July 2018. Rare Earth Magnesium Technology Group Holdings Limited was incorporated in 1992 and is based in Tsim Sha Tsui, Hong Kong. Rare Earth Magnesium Technology Group Holdings Limited is a subsidiary of Ming Xin Developments Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.remt.com.hk",
        "market_cap": 381894624
    },
    "0621.HK": {
        "short_name": "TAUNG GOLD",
        "long_name": "Taung Gold International Limited",
        "summary": "Taung Gold International Limited, an investment holding company, engages in the exploration, development, and mining of gold and related minerals in the Republic of South Africa and Hong Kong. Its flagship projects include the Evander project, which comprises the No. 6 Shaft area and the Twistdraai area on the northeastern limb of the Witwatersrand basin located in the Mpumalanga Province; and the Jeanette project located in the southwest limb of the Witwatersrand basin to the northeast of Welkom in the Free State Province of South Africa. The company also trades in and sells minerals. Taung Gold International Limited was founded in 2004 and is headquartered in Tsuen Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Gold",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsuen Wan",
        "zipcode": null,
        "website": "http://www.taunggold.com",
        "market_cap": 544544960
    },
    "0639.HK": {
        "short_name": "SHOUGANG RES",
        "long_name": "Shougang Fushan Resources Group Limited",
        "summary": "Shougang Fushan Resources Group Limited, an investment holding company, engages in the mining and exploration of coal resources, and production and sale of raw and clean coking coal in the People's Republic of China. The company owns and operates the Xingwu coal mine covering an area of approximately 11.63 sq. km; the Jinjiazhuang coal mine covering an area of approximately 6.35 sq. km; and the Zhaiyadi coal mine covering an area of approximately 13.91 sq. km located in the Liulin County, Shanxi Province. It primarily serves steel manufacturers. The company was formerly known as Fushan International Energy Group Limited and changed its name to Shougang Fushan Resources Group Limited in May 2011. Shougang Fushan Resources Group Limited is based in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.shougang-resources.com.hk",
        "market_cap": 11972859904
    },
    "0661.HK": {
        "short_name": "CDAYENONFER",
        "long_name": "China Daye Non-Ferrous Metals Mining Limited",
        "summary": "China Daye Non-Ferrous Metals Mining Limited, an investment holding company, engages in the exploration, development, mining, and processing of mineral ores in the People's Republic of China, Hong Kong, and the Republic of Mongolia. It explores for copper, gold, silver, iron, and molybdenum deposits. The company holds interests in the Tonglvshan and Tongshankou mines located in Daye City; Fengshan and Chimashan mines located in Yangxin County; and Sareke copper mine located in Wuqia County. It is also involved in the trading of metals, minerals, and concentrates; quality testing of construction projects; and provision of research and development services. The company is headquartered in Kowloon, Hong Kong. China Daye Non-Ferrous Metals Mining Limited is a subsidiary of China Times Development Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.hk661.com",
        "market_cap": 2040098432
    },
    "0758.HK": {
        "short_name": "MACROLINK CAP",
        "long_name": "Macrolink Capital Holdings Limited",
        "summary": "Macrolink Capital Holdings Limited, an investment holding company, develops, manufactures, and sells construction materials in the People's Republic of China, Peru, Hong Kong. The company operates in six segments: Property Investment and Development, Manufacture and Sale of Construction Materials, Securities Investments, Trading of Mineral Concentrates, Coal Mining, and Others. It is involved in the leasing and sale of properties; manufacture and sale of slag powder; trading of mineral concentrates; exploration and development of coal mine concessions, and sale of coal; and sale of parts of mining equipment, as well as invests in listed securities. The company was formerly known as Junefield Department Store Group Limited and changed its name to Macrolink Capital Holdings Limited in June 2018. Macrolink Capital Holdings Limited was incorporated in 1998 and is headquartered in Causeway Bay, Hong Kong. Macrolink Capital Holdings Limited is a subsidiary of Macrolink Group Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://macrolinkcapital.etnet.com.hk",
        "market_cap": 367906240
    },
    "0794.HK": {
        "short_name": "COME SURE GROUP",
        "long_name": "Come Sure Group (Holdings) Limited",
        "summary": "Come Sure Group (Holdings) Limited, an investment holding company, engages in the manufacture and sale of corrugated paperboards and paper-based packaging products in the People's Republic of China. It operates through three segments: Corrugated Products, Offset Printed Corrugated Products, and Properties Leasing. The company also provides offset printed corrugated paper-based packaging products; holds investment properties; and offers management services. In addition, it produces and trades in molded pulp products, and corrugated paperboard and paper-based packaging products; and trades in raw papers and production supplies. The company was incorporated in 2006 and is headquartered in Chai Wan, Hong Kong. Come Sure Group (Holdings) Limited is a subsidiary of Perfect Group Version Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Chai Wan",
        "zipcode": null,
        "website": "http://www.comesure.com",
        "market_cap": 233823424
    },
    "0803.HK": {
        "short_name": "PROSPERITY INTL",
        "long_name": "Prosperity International Holdings (H.K.) Limited",
        "summary": "Prosperity International Holdings (H.K.) Limited, an investment holding company, engages in the real estate investment, development, and leasing business in the People's Republic of China, Taiwan, and internationally. It is also involved in the trading of clinker, cement, granulated blast furnace slag, and other building materials, as well as steel. In addition, the company engages in mining, processing, and trading of iron ore, iron ore equipment, and raw materials. Further, it is involved in the provision of advisory, planning, and administrative; human resource; and transportation services. Prosperity International Holdings (H.K.) Limited was founded in 1980 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.pihl-hk.com",
        "market_cap": 51058700
    },
    "0893.HK": {
        "short_name": "CHINAVTM MINING",
        "long_name": "China Vanadium Titano-Magnetite Mining Company Limited",
        "summary": "China Vanadium Titano-Magnetite Mining Company Limited, an investment holding company, engages in mining and ore processing activities in the People's Republic of China. It operates through three segments: High-Fe Mining Operation; Trading; and Corporate and Others. The company engages in the operation of sale of self-produced products, and trading of coal and steel. It is also involved in the provision of specialized mining services; and management of strategic investments. In addition, the company engages in the iron ore and gypsum ore beneficiation activities, as well as provision of contract mining and construction consulting services. China Vanadium Titano-Magnetite Mining Company Limited was founded in 2004 and is based in Causeway Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.chinavtmmining.com",
        "market_cap": 472294176
    },
    "0990.HK": {
        "short_name": "THEME INT'L",
        "long_name": "Theme International Holdings Limited",
        "summary": "Theme International Holdings Limited, an investment holding company, engages in the distribution and trading of bulk commodities and related products in the People's Republic of China, Hong Kong, and Singapore. It provides personal loan, mortgage, installment credit, market making, margin financing, structured trade, and other credit granting services; and securities and commodity contracts dealing, securities brokerage, commodity futures and gold bullion broking and dealing, and fund management services, as well as trades in metals and metal ores. The company was incorporated in 1993 and is headquartered in Sheung Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sheung Wan",
        "zipcode": null,
        "website": "http://www.990.com.hk",
        "market_cap": 11896922112
    },
    "1047.HK": {
        "short_name": "NGAI HING HONG",
        "long_name": "Ngai Hing Hong Company Limited",
        "summary": "Ngai Hing Hong Company Limited, an investment holding company, manufactures and trades plastic materials, pigments, colorants, compounded plastic resins, engineering plastics, and biodegradable plastics. The company operates through Trading, Colorants, Engineering Plastics, and Others segments. It is also involved in the property holding activities. The company was founded in 1970 and is headquartered in Shatin, Hong Kong. Ngai Hing Hong Company Limited is a subsidiary of Good Benefit Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sha Tin",
        "zipcode": null,
        "website": "http://www.nhh.com.hk",
        "market_cap": 180908000
    },
    "1091.HK": {
        "short_name": "SOUTH MANGANESE",
        "long_name": "South Manganese Investment Limited",
        "summary": "South Manganese Investment Limited, an investment holding company, engages in manganese mining, ore processing, and downstream processing operations in Mainland China, rest of Asia, Europe, and North America. It operates through four segments: Manganese Mining and Ore Processing, EMM and Alloying Materials, Battery Materials, and Other Business. The Manganese Mining and Ore Processing segment mines and produces manganese products, including manganese concentrate, and natural discharging manganese powder and sand. This segment also has interests in the Daxin mine located to the west of Daxin County in Guangxi; the Tiandeng manganese mine located to the north of Tiandeng County in Guangxi; the Waifu manganese mine located in Jingxi, Guangxi; the Changgou manganese mine located in Guizhou; and the BembÃ©lÃ© manganese mine located to the north of NdjolÃ© town in the Moyen-Ogooue Province of Gabon. The EMM and Alloying Materials segment mines and processes ores used in hydrometallurgical processing activities for/and the production of electrolytic manganese metal (EMM) and manganese briquette, and pyrometallurgical processing for production of silicomanganese alloys. The Battery Materials segment manufactures and sells of battery materials products, including Electrolytic Manganese Dioxide (EMD), manganese sulfate, lithium manganese oxide, lithium nickel cobalt manganese oxide, and lithium manganese oxide. The Other Business segment trades in various commodities, such as manganese ores, EMM, manganese alloys, non-manganese metals, and related raw materials, as well as sells scraps, and rents investment properties and leasehold lands. It also manufactures and sells equipment, develops properties, and produces sulphuric acid and steam. The company was formerly known as CITIC Dameng Holdings Limited and changed its name to South Manganese Investment Limited in February 2021. The company was incorporated in 2005 and is headquartered in Admiralty, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.dameng.citic.com",
        "market_cap": 1662803200
    },
    "1116.HK": {
        "short_name": "MAYER HOLDINGS",
        "long_name": "Mayer Holdings Limited",
        "summary": "Mayer Holdings Limited, an investment holding company, engages in the processing, manufacture, and sale of steel sheets and pipes, and other steel products in the People's Republic of China. The company provides its products under the MAYER brand. It also offers urban renewal project planning and consulting, business and economic consulting, and real estate development services. The company also exports its products. Mayer Holdings Limited was incorporated in 2003 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.mayer.com.hk",
        "market_cap": 502814016
    },
    "1118.HK": {
        "short_name": "GOLIK HOLDINGS",
        "long_name": "Golik Holdings Limited",
        "summary": "Golik Holdings Limited, an investment holding company, manufactures and sells metal products and building construction materials in Hong Kong and Mainland China. The company offers steel coil products, including cold rolled, galvanized, aluminum coated, silicon, electrolytic tinplate, and electrical steel products; and elevator, crane, and oilfield ropes. It also provides steel wire products, such as carbon steel spring wires, piano wires, bedding spring wires, core wires for ACSR conductors, and galvanized low carbon steel wires for cable armoring; galvanized wire strands, fiber optic cable strength members, and zinc-coated steel strands; and steel wire ropes. In addition, the company distributes reinforcing steel bars, sheet piles, and H-beams; and offers reinforcing steel products, services, and accessories, including reinforcement solutions, bored pile cages, lattice girders, rebar couplers, Hy-Rib formworks, and concreting accessories, as well as expanded metal meshes, beads and laths, lintels, and corrugated sheets. Further, it produces and supplies ready mixed concrete for the construction industry; and operates a decoiling center and concrete batching plants. Additionally, the company provides concrete and metal products, and warehousing services, as well as engages in the property holding activities. Golik Holdings Limited was founded in 1977 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.golik.com",
        "market_cap": 482477504
    },
    "1203.HK": {
        "short_name": "GUANGNAN (HOLD)",
        "long_name": "GDH Guangnan (Holdings) Limited",
        "summary": "GDH Guangnan (Holdings) Limited, an investment holding company, manufactures and sells tinplates and related products primarily in Hong Kong and Mainland China. It operates through three divisions: Tinplating, Fresh and Live Foodstuffs, and Property Leasing. The Tinplating division provides tinplates and tin-free steel; and processed products, such as coated/printed tinplate/tin-free steel, as well as cold-rolled steel plates. Its tinplate and tin-free steel products are used in food, light, and chemical industries. It is also involved in the research and development, production, and sale of tinplated steel sheets, chrome-plated steel sheets, and other processed products. The Fresh and Live Foodstuffs division engages in the distribution of livestock and poultry, such as cattle and chicken; sale of live pigs; wholesale of poultry; and trading of foodstuffs, including chilled poultry and pork, frozen poultry, and rice and starch. The Property Leasing division leases offices and factory buildings. The company was formerly known as Guangnan (Holdings) Limited and changed its name to GDH Guangnan (Holdings) Limited in June 2020. GDH Guangnan (Holdings) Limited was incorporated in 1982 and is based in Wan Chai, Hong Kong. GDH Guangnan (Holdings) Limited is a subsidiary of GDH Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.gdguangnan.com",
        "market_cap": 635315136
    },
    "1312.HK": {
        "short_name": "TONGFANG KONTA",
        "long_name": "Tongfang Kontafarma Holdings Limited",
        "summary": "Tongfang Kontafarma Holdings Limited, an investment holding company, engages in the manufacture and sale of cement, clinker, and slag in the People's Republic of China. It operates through Medical, and Pharmaceutical and Health Business; Fitness Business; and Cement Business segments. The company also manufactures and sales prescription drugs and laboratory related products; operates fitness centers under the True Fitness and True Yoga brands; operates in the franchise business; and provides consultation services for fitness and health activities. In addition, it trades in cement and clinker, and laboratory related products; researches and develops medical products; and offers corporate advisory and energy contracting services. The company was formerly known as Allied Cement Holdings Limited and changed its name to Tongfang Kontafarma Holdings Limited in August 2016. The company was incorporated in 2011 and is headquartered in Wanchai, Hong Kong. Tongfang Kontafarma Holdings Limited is a subsidiary of China Health Management Investment Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.tfkf.com.hk",
        "market_cap": 384930976
    },
    "1894.HK": {
        "short_name": "HANG YICK HLDGS",
        "long_name": "Hang Yick Holdings Company Limited",
        "summary": "Hang Yick Holdings Company Limited, a steel and metal engineering company, designs, manufactures, supplies, and installs steel and metal products for construction projects in the People's Republic of China. It offers bespoke steel and metal engineering solutions, such as balustrades, rolling shutters, mailboxes, handrails, cat ladders, etc.; and structural design solutions, including appearance, functionality, material, accurate fabrication tolerance, and ease of installation solutions. The company also designs, manufactures, supplies, and installs various passive fire products comprising insulation or non-insulation fire rolling shutters and gates; and provides metal gates engineering services. In addition, it manufactures and sells metal gates, collapsible gates, fire-insulated shutters, rolling shutters, metal doors, and other steel and metal products. The company was founded in 1982 and is headquartered in Yau Tong, Hong Kong. Hang Yick Holdings Company Limited is a subsidiary of Hy Steel Company Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Yau Tong",
        "zipcode": null,
        "website": "http://www.hy-engineering.com",
        "market_cap": 506616032
    },
    "2078.HK": {
        "short_name": "PANASIALUM",
        "long_name": "PanAsialum Holdings Company Limited",
        "summary": "PanAsialum Holdings Company Limited, an investment holding company, manufactures and trades in aluminum products. The company operates through three segments: Electronics Parts; Construction and Industrial Products; and Door and Window Frames Systems. It offers electronic, mechanical equipment, and LED heatsinks; skirt boards and auto parts; solar module frame series; electronic products and accessories series; and fences series, as well as doors, windows and related accessories development, profiles die development, specialized and customized products, and related installation guidance. The company's products are used in electronic products accessories, solar system, rail transit, lightweight of automobile, shipbuilding, outdoor equipment, medical devices, high-end machinery, frames for doors, windows and curtain walls, municipal construction, and general industrial profiles. It has operations in the People's Republic of China, Australia, North America, Honk Kong, and internationally. PanAsialum Holdings Company Limited was founded in 1990 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.palum.com",
        "market_cap": 317999968
    },
    "2320.HK": {
        "short_name": "HOP FUNG GROUP",
        "long_name": "Hop Fung Group Holdings Limited",
        "summary": "Hop Fung Group Holdings Limited, an investment holding company, manufactures and sells corrugated paper ware products in the People's Republic of China and internationally. The company operates through Containerboard and Corrugated Packaging segments. The Containerboard segment offers corrugating medium and linerboards. The Corrugated Packaging segment provides corrugated paper boards and carton boxes. It also offers management and accounting services. The company was founded in 1983 and is based in Tsuen Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsuen Wan",
        "zipcode": null,
        "website": "http://www.hopfunggroup.com",
        "market_cap": 257557872
    },
    "2326.HK": {
        "short_name": "NPE HOLDINGS",
        "long_name": "New Provenance Everlasting Holdings Limited",
        "summary": "New Provenance Everlasting Holdings Limited, an investment holding company, sources and sells metal minerals and related industrial materials in the People's Republic of China. It is also involved in the production and sale of industrial products; provision of logistics, including warehousing, transportation, and cargo handling services; and provision of management services. The company was formerly known as BEP International Holdings Limited and changed its name to New Provenance Everlasting Holdings Limited in October 2017. New Provenance Everlasting Holdings Limited is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.npegroup.com.hk",
        "market_cap": 463850208
    },
    "2341.HK": {
        "short_name": "ECOGREEN",
        "long_name": "EcoGreen International Group Limited",
        "summary": "EcoGreen International Group Limited, an investment holding company, produces and trades in fine chemicals from natural resources for use in aroma chemicals and pharmaceutical products. It operates through Scent and Taste, Naturals, and Specialties and Others segments. The company offers components of flavors and fragrances in food and beverage, tobacco, pharmaceuticals, and hygienic products. It also provides natural extracts, such as botanic essential oils and herbal extracts for flavor and fragrance, and pharmaceutical industries; components for Chinese medicine and functional food products; and natural food ingredients for the food industry. In addition, the company manufactures and sells chiral fine chemicals, pharmaceutical intermediates, and agrochemicals for the pharmacy and farm chemical industries; and food additives and seasonings, as well as sells forestry products. It operates in Mainland China, Europe, rest of Asia, North America, and internationally. The company was formerly known as EcoGreen Fine Chemicals Group Limited and changed its name to EcoGreen International Group Limited in February 2015. EcoGreen International Group Limited was founded in 1994 and is headquartered in Wanchai, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.ecogreen.com",
        "market_cap": 1488113280
    },
    "2362.HK": {
        "short_name": "JINCHUAN INTL",
        "long_name": "Jinchuan Group International Resources Co. Ltd",
        "summary": "Jinchuan Group International Resources Co. Ltd, an investment holding company, engages in the mining operations. The company primarily explores for copper, cobalt, copper concentrates, and copper blisters. It operates Ruashi mine, a copper and cobalt mine located in Lubumbashi and Kinsenda mine, a copper mine located in Haut-Katanga Province, the Democratic Republic of the Congo; and Chibuluma South mine located in Zambia, as well as Musonoi and Lubembe projects located in the Democratic Republic of the Congo. The company also trades in copper concentrates, cathode, and blister; cobalt; and other related raw materials. It has operations in Hong Kong, South Africa, the Democratic Republic of the Congo, Switzerland, Zambia, Singapore, and South Korea. The company was founded in 1958 and is headquartered in Admiralty, Hong Kong. Jinchuan Group International Resources Co. Ltd is a subsidiary of Jinchuan (BVI) Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.jinchuan-intl.com",
        "market_cap": 14123087872
    },
    "3318.HK": {
        "short_name": "CHINA BOTON",
        "long_name": "China Boton Group Company Limited",
        "summary": "China Boton Group Company Limited, together with its subsidiaries, researches and develops, manufactures, trades in, and sells extracts, flavors, and fragrances in the People's Republic of China, Europe, the United States, Asia, and internationally. The company operates through five segments: Flavor Enhancers, Food Flavors, Fine Fragrances, Healthcare Products, and Investment Properties. It provides its flavors primarily to manufacturers of tobacco, beverages, daily foods, preserved food, and savory and confectionery industries; and fragrances to manufacturers of cosmetics, perfumes, soaps, toiletries, hair care products, deodorants, detergents, and air fresheners industries. The company also designs, manufactures, and sells electronic cigarette (e-cigarette) products, including disposable and re-chargeable e-cigarettes, and e-cigarette accessories to the tobacco companies, independent e-cigarette makers, and other customers. In addition, it is involved in the rental of investment properties. The company was formerly known as China Flavors and Fragrances Company Limited and changed its name to China Boton Group Company Limited in June 2020. China Boton Group Company Limited was founded in 1991 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.boton.com.hk",
        "market_cap": 4397675520
    },
    "3330.HK": {
        "short_name": "LINGBAO GOLD",
        "long_name": "Lingbao Gold Group Company Ltd.",
        "summary": "Lingbao Gold Group Company Ltd., together with its subsidiaries, primarily engages in gold mining, smelting, and refining in the People's Republic of China. Its products include gold bullion, silver, copper products, and sulphuric acid. The company has 31 exploration rights, with an area of 289.2 square kilometers, gold reserves and resources of about 39.69 and 92.02 tonnes. It is also involved in the sale of mineral products, machinery, equipment, and components for gold processing; and design of mineral engineering. In addition, the company engages in the sale of metallurgy products and provision of technical services; and production and sale of precious metal products. The company was formerly known as Lingbao Gold Company Ltd. and changed its name to Lingbao Gold Group Company Ltd. in May 2017. Lingbao Gold Group Company Ltd. was founded in 2002 and is based in Causeway Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Gold",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.lbgold.com",
        "market_cap": 1071668800
    },
    "4141.TW": {
        "short_name": "ROTAM GLOBAL AGROSCIENCES LTD",
        "long_name": "Rotam Global AgroSciences Limited",
        "summary": "Rotam Global AgroSciences Limited, together with its subsidiaries, engages in the research and development, production, and sale of various crop protectants, crop nutrition products, and chemicals worldwide. It offers insecticides, fungicides, herbicides, biostimulants, plant nutrients, and seed treatments. Rotam Global AgroSciences Limited was founded in 2009 and is headquartered in Chai Wan, Hong Kong.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Chai Wan",
        "zipcode": null,
        "website": "http://www.rotam.com",
        "market_cap": 2118407680
    },
    "6128.HK": {
        "short_name": "GRAPHEX GROUP",
        "long_name": "Graphex Group Limited",
        "summary": "Graphex Group Limited, an investment holding company, manufactures and sells graphene products in the People's Republic of China. It operates through three segments: Manufacturing and Sale of Graphene Products; Landscape Design; and The Catering Business Focuses on the Operation of Restaurants. The company provides spherical graphite and graphene for the use in electric vehicle batteries, lithium-ion batteries, advanced solar energy products, and other applications; high purity graphite for magnesia carbon bricks, high grade refractories, stabilizers, carbon brushes, and fire-resistant composite materials applications; and micronized graphite for corrosion-resistant coating, lubricants, and other composite materials applications. It also offers landscape architecture services urban renewals, corporate campuses, hotels/resorts, and theme parks projects for governments, property developers, design service companies, and engineering businesses. In addition, the company provides catering services, including the operation and management of Thai Gallery restaurants, which serves Thai cuisine. Further, it offers interior design and catering management services; and invests in food industry. The company was formerly known as Earthasia International Holdings Limited and changed its name to Graphex Group Limited in April 2021. Graphex Group Limited was founded in 1981 and is headquartered in Causeway Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.graphexgroup.com",
        "market_cap": 497504768
    },
    "6193.HK": {
        "short_name": "TAILAM TECHCON",
        "long_name": "Tailam Tech Construction Holdings Limited",
        "summary": "Tailam Tech Construction Holdings Limited, an investment holding company, manufactures and sells pre-stressed high-strength concrete piles and commercial concrete in the People's Republic of China. It also offers ceramsite concrete boards. The company sells its products primarily to property developers and construction companies in Jiangsu province. Its products are used in residential, commercial, bridges, railways, ports, public works, and large scale projects. The company was founded in 2011 and is based in Causeway Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.tailamgroup.com",
        "market_cap": 316000000
    },
    "688363.SS": {
        "short_name": "BLOOMAGE BIOTECHNOLOGY CORPORAT",
        "long_name": "Bloomage BioTechnology Corporation Limited",
        "summary": "Bloomage BioTechnology Corporation Limited, an investment holding company, develops, manufactures, and sells bio-chemical products in China, rest of Asia, the Americas, Europe, and internationally. It offers sodium hyaluronic acid (HA) raw materials and end products for use in pharmaceutical, cosmetic, and health care products. The company's HA materials include pharmaceutical grade sodium hyaluronate under the Hyatrue name; food grade sodium hyaluronate under the HAPLEX name; cosmetic grade sodium hyaluronate under the Freda name; and Oligo HA under the Mini HA name. Its end products comprise modified sodium hyaluronic gel for injection under the BioHyalux and Dermallure names. The company also trades in HA end products and raw materials, cosmetic products, and medical devices. Bloomage BioTechnology Corporation Limited was founded in 2003 and is based in Central, Hong Kong.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.bloomagebioactive.com",
        "market_cap": 109488005120
    },
    "8028.HK": {
        "short_name": "TIMELESS",
        "long_name": "Timeless Software Limited",
        "summary": "Timeless Software Limited, an investment holding company, engages in mining business in the People's Republic of China. The company operates in two segments, Mining Business and Other Business. It explores, exploits, processes, and sells nickel and copper ores, as well as gold and iron ores. The company has interest in the Baishiquan nickel-copper mine located in Xinjiang. It is also involved in the provision of consultancy, software maintenance and development, and e-commerce services, as well as invests in IT and innovation projects, including e-Sport tournament organizing, bio and nano new materials, IT startup fund, and intelligent agricultural applications. In addition, the company engages in the technology and business investment activities; and research and development of Styrofoam. Timeless Software Limited was founded in 1996 and is based in Hong Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.timeless.com.hk",
        "market_cap": 132205352
    },
    "8053.HK": {
        "short_name": "PIZU GROUP",
        "long_name": "Pizu Group Holdings Limited",
        "summary": "Pizu Group Holdings Limited, an investment holding company, trades in non-ferrous metals and bulk minerals in the People's Republic of China and Tajikistan. The company operates in Bulk Mineral Trade, and Explosives Trading and Blasting Services segments. It also manufactures and sells civil explosives; and offers blasting operation and related services, as well as provision of mining and subcontracting services. The company was formerly known as China Electric Power Technology Holdings Limited and changed its name to Pizu Group Holdings Limited in May 2012. Pizu Group Holdings Limited is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.pizugroup.com",
        "market_cap": 2277587200
    },
    "8140.HK": {
        "short_name": "BOSATECH",
        "long_name": "BOSA Technology Holdings Limited",
        "summary": "BOSA Technology Holdings Limited, an investment holding company, provides mechanical splicing services to the reinforced concrete construction industry in Hong Kong. It is involved in processing reinforcing bars, including cutting, crimping, chamfering, and threading of reinforcing bars at its premises or at the premises of customers; and connecting reinforcing bars by couplers. The company serves various contractors and subcontractors. BOSA Technology Holdings Limited was founded in 2012 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.bosa-tech.com",
        "market_cap": 131200000
    },
    "8277.HK": {
        "short_name": "STEEDORIENTAL",
        "long_name": "Steed Oriental (Holdings) Company Limited",
        "summary": "Steed Oriental (Holdings) Company Limited, an investment holding company, sources, manufactures, and sells plywood and other wooden products in Japan, Mainland China, Thailand, Hong Kong, and internationally. The company provides general plywood used for manufacture of furniture for home and office; packing plywood used for packaging; structural panels for house construction; floor base products for flooring applications; supplementary materials used for construction; and other wooden products It sells its plywood products to construction materials trading companies and wholesalers; retailers, including supermarkets; flooring and furniture manufacturers; and individual or corporate end-users. Steed Oriental (Holdings) Company Limited was incorporated in 2013 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.steedoriental.com.hk",
        "market_cap": 63432564
    },
    "8481.HK": {
        "short_name": "SHENGLONG INTL",
        "long_name": "Shenglong Splendecor International Limited",
        "summary": "Shenglong Splendecor International Limited, an investment holding company, manufactures and sells decorative printing materials. The company offers decorative papers, melamine impregnated papers, finish foil papers, PVC furniture films, and PVC flooring films. It also manufactures and sells craft pictures. The company's products are primarily used in furniture, cabinets, framework, door panels, fireproof boards, melamine boards, chipboards, density boards, and floorboards. It sells its products under the Splendecor brand in the People's Republic of China, Pakistan, India, Kenya, the United Arab Emirates, and internationally. The company was founded in 1993 and is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://splendecor.com",
        "market_cap": 112000000
    },
    "A2P3.F": {
        "short_name": "CN BILLION RES  HD-,01",
        "long_name": "China Billion Resources Limited",
        "summary": "China Billion Resources Limited, an investment holding company, engages in the exploration, development, and mining of gold in the People's Republic of China and Hong Kong. The company operates through Mining Products and Money Lending segments. It also provides money lending services; and trades in coal. The company was formerly known as Global Green Tech Group Limited and changed its name to China Billion Resources Limited in September 2011. China Billion Resources Limited was incorporated 2000 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Gold",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.chinabillion.net",
        "market_cap": 27308342
    },
    "AHAD": {
        "short_name": "ALPHACOM HOLDINGS INC",
        "long_name": "Alphacom Holdings, Inc.",
        "summary": "Alphacom Holdings Inc., a multi-technology incubator, engages in converting technologies into commercialized forms for licensing into distribution across various industry sectors. The company is based in Sheung Wan, Hong Kong. As of February 22, 2021, Alphacom Holdings, Inc. operates as a subsidiary of Marc&Hem Publicidad S.A. de C.V.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sheung Wan",
        "zipcode": "999077",
        "website": "http://alphacomholdings.com",
        "market_cap": 1773
    },
    "AIHA.F": {
        "short_name": "GREENTECH TECH. INTL",
        "long_name": "Greentech Technology International Limited",
        "summary": "Greentech Technology International Limited, an investment holding company, engages in the exploration, development, and mining of tin and copper bearing ores in Australia. It holds 50% interests in the Renison underground mine, the Mount Bischoff open cut tin project, and the Renison tailings retreatment project located in Tasmania. The company was formerly known as L'sea Resources International Holdings Limited and changed its name to Greentech Technology International Limited in October 2017. Greentech Technology International Limited was incorporated in 2008 and is based in Tsim Sha Tsui, Hong Kong.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.green-technology.com.hk",
        "market_cap": 88869200
    },
    "BCK.AX": {
        "short_name": "BROCKMAN FPO",
        "long_name": "Brockman Mining Limited",
        "summary": "Brockman Mining Limited, an investment holding company, engages in the acquisition, exploration, and development of iron ore mining projects in Australia. Its principal projects include the Marillana Project covering an area of 82 square kilometers; and the Ophthalmia Project and other exploration projects located in the Pilbara region of Western Australia. The company was formerly known as Wah Nam International Holdings Limited and changed its name to Brockman Mining Limited in September 2012. Brockman Mining Limited is headquartered in Admiralty, Hong Kong.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.brockmanmining.com",
        "market_cap": 230999856
    },
    "BME.F": {
        "short_name": "BEIJING MEDIA CORP.H YC 1",
        "long_name": "Beijing Media Corporation Limited",
        "summary": "Beijing Media Corporation Limited, together with its subsidiaries, provides newspaper, magazine, and outdoor advertising services in the People's Republic of China. The company operates through Advertising, Printing, Trading of Print-Related Material, and Distribution segments. The Advertising segment sells advertising spaces and outdoor advertising of media. The Printing segment provides printing services. The Trading of Print-Related Material segment sells papers, inks, lubricants, films, pre-coating photosensitive liquid plates, and rubber plates used for printing and other print-related materials. The Distribution segment engages in the distribution of newspapers that are primarily published by Chongqing Youth Daily. In addition, it is involved in the provision of logistics and warehousing services; investment management, travel rental and services, and game development businesses; and the provision of commerce related services. The company was incorporated in 2001 and is based in Central, Hong Kong. Beijing Media Corporation Limited is a subsidiary of Beijing Youth Daily Agency.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.bjmedia.com.cn",
        "market_cap": 17482332
    },
    "BRNE": {
        "short_name": "BORNEO RESOURCE INVESTMENTS LTD",
        "long_name": "Borneo Resource Investments Ltd.",
        "summary": "Borneo Resource Investments Ltd. engages in the mineral exploration activities in the Republic of Indonesia. It primarily develops gold mines. The company holds interests in the Ratatotok South property covering approximately 8.6 hectares; and Ratatotok Southeast property covering approximately 14.7 hectare, which are located in the North Sulawesi area of the Indonesian archipelago. Borneo Resource Investments Ltd. was founded in 2009 and is headquartered in Admiralty, Hong Kong.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.borneore.com",
        "market_cap": 24159
    },
    "C44.F": {
        "short_name": "CHIN.RES CEMENT HLD (NEW)",
        "long_name": "China Resources Cement Holdings Limited",
        "summary": "China Resources Cement Holdings Limited, an investment holding company, manufactures and sells cement, concrete and related products and services in Mainland China and Hong Kong. The company engages in the excavation of limestone; and production, sale, and distribution of cement, clinker, and concrete. It offers Portland, ordinary Portland, composite Portland, and slag Portland cement under the Runfeng name. The company's products are primarily used in the construction of infrastructure projects, such as railways, highways, subways, bridges, airports, ports, dams, and hydroelectric and nuclear power stations, as well as high-rise buildings, and suburban and rural area development. It also trades in cement products and construction materials; provides environmental protection engineering, and building materials testing and consultancy services; mines aggregates; holds properties; and manufactures and sells prefabricated construction materials. The company was incorporated in 2003 and is headquartered in Wanchai, Hong Kong. China Resources Cement Holdings Limited is a subsidiary of CRH (Cement) Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.crcement.com",
        "market_cap": 5937564672
    },
    "CARCY": {
        "short_name": "CHINA RESOURCES CEMENT HLDGS",
        "long_name": "China Resources Cement Holdings Limited",
        "summary": "China Resources Cement Holdings Limited, an investment holding company, manufactures and sells cement, concrete and related products and services in Mainland China and Hong Kong. The company engages in the excavation of limestone; and production, sale, and distribution of cement, clinker, and concrete. It offers Portland, ordinary Portland, composite Portland, and slag Portland cement under the Runfeng name. The company's products are primarily used in the construction of infrastructure projects, such as railways, highways, subways, bridges, airports, ports, dams, and hydroelectric and nuclear power stations, as well as high-rise buildings, and suburban and rural area development. It also trades in cement products and construction materials; provides environmental protection engineering, and building materials testing and consultancy services; mines aggregates; holds properties; and manufactures and sells prefabricated construction materials. The company was incorporated in 2003 and is headquartered in Wanchai, Hong Kong. China Resources Cement Holdings Limited is a subsidiary of CRH (Cement) Limited.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.crcement.com",
        "market_cap": 7579397120
    },
    "CEY2.F": {
        "short_name": "HUABAO INTL HLDGS  HD-,10",
        "long_name": "Huabao International Holdings Limited",
        "summary": "Huabao International Holdings Limited, an investment holding company, researches, develops, produces, distributes, and sells flavors and fragrances, aroma and tobacco raw materials, and condiment products primarily in the People's Republic of China. The company operates through four segments: Flavours and Fragrances, Tobacco Raw Materials, Aroma Raw Materials, and Condiment. It offers paper-making reconstituted tobacco leaves and new materials products for the tobacco industry. The company is also involved in the production and sale of natural extracts; tobacco flavours and fragrances; filter materials; synthetic perfume; and food flavours and fragrances. Huabao International Holdings Limited was founded in 1996 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.hbglobal.com",
        "market_cap": 4173194496
    },
    "CHNR": {
        "short_name": "China Natural Resources, Inc.",
        "long_name": "China Natural Resources, Inc.",
        "summary": "China Natural Resources, Inc., through its subsidiaries, engages in the exploration and mining of metal properties in the People's Republic of China. The company explores for lead, silver, and other metal deposits. It holds interest in the Moruogu Tong mine that covers an area of 10.43 square kilometers located in Bayannaoer City, Inner Mongolia. The company was incorporated in 1993 and is headquartered in Sheung Wan, Hong Kong. China Natural Resources, Inc. is a subsidiary of Feishang Group Limited.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sheung Wan",
        "zipcode": null,
        "website": "http://www.chnr.net",
        "market_cap": 58819552
    },
    "CJRCF": {
        "short_name": "CHINA RESOURCES CEMENT HLDGS",
        "long_name": "China Resources Cement Holdings Limited",
        "summary": "China Resources Cement Holdings Limited, an investment holding company, manufactures and sells cement, concrete and related products and services in Mainland China and Hong Kong. The company engages in the excavation of limestone; and production, sale, and distribution of cement, clinker, and concrete. It offers Portland, ordinary Portland, composite Portland, and slag Portland cement under the Runfeng name. The company's products are primarily used in the construction of infrastructure projects, such as railways, highways, subways, bridges, airports, ports, dams, and hydroelectric and nuclear power stations, as well as high-rise buildings, and suburban and rural area development. It also trades in cement products and construction materials; provides environmental protection engineering, and building materials testing and consultancy services; mines aggregates; holds properties; and manufactures and sells prefabricated construction materials. The company was incorporated in 2003 and is headquartered in Wanchai, Hong Kong. China Resources Cement Holdings Limited is a subsidiary of CRH (Cement) Limited.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.crcement.com",
        "market_cap": 7146295296
    },
    "CMIM": {
        "short_name": "CHANGMING INDL MGMT GROUP HLDG",
        "long_name": "Changming Industrial Management Group Holding",
        "summary": "Changming Industrial Management Group Holding provides hospital management consultancy services to VIP maternity and gynecological centers (VIP Birthing Centers) in China. It also manages a private hospital in Macau. The company's obstetric services include outpatient services such as pre-delivery check-up and consultation, and prenatal genetic consultation; and inpatient and minor surgery services, including vaginal birth, caesarean, and prenatal education. Its gynecology services comprise various outpatient services consisting of gynecologic check up and pre-marriage body checkup; and inpatient and minor surgery services, such as gynecologic minor operation and minor operation for planned childbirth. The company was formerly known as China Health Care Corporation and changed its name to Changming Industrial Management Group Holding in February 2019. Changming Industrial Management Group Holding was founded in 2001 and is based in Wan Chai, Hong Kong.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": null,
        "market_cap": 9026637
    },
    "CV8S.F": {
        "short_name": "CHINA VAN.T.M.REGS HD-,10",
        "long_name": "China Vanadium Titano-Magnetite Mining Company Limited",
        "summary": "China Vanadium Titano-Magnetite Mining Company Limited, an investment holding company, engages in mining and ore processing activities in the People's Republic of China. It operates through three segments: High-Fe Mining Operation; Trading; and Corporate and Others. The company engages in the operation of sale of self-produced products, and trading of coal and steel. It is also involved in the provision of specialized mining services; and management of strategic investments. In addition, the company engages in the iron ore and gypsum ore beneficiation activities, as well as provision of contract mining and construction consulting services. China Vanadium Titano-Magnetite Mining Company Limited was founded in 2004 and is based in Causeway Bay, Hong Kong.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.chinavtmmining.com",
        "market_cap": 53629100
    },
    "CVH4.F": {
        "short_name": "CST GRP LTD CONS.",
        "long_name": "CST Group Limited",
        "summary": "CST Group Limited, an investment holding company, engages in the exploration, development, mining, processing, and sale of coal in Canada. It operates through five segments: Mining Business, Investment in Financial Instruments, Property Investment, and Money Lending. The company is involved in the securities and property investment, money lending, and aircraft and vessel holding businesses; and provision of secretarial services. It operates in the People's Republic of China, Hong Kong, Canada, the United Kingdom, Singapore, and internationally. The company was formerly known as NetMind Financial Holdings Limited and changed its name to CST Group Limited in September 2017. CST Group Limited was founded in 1993 and is headquartered in Wanchai, Hong Kong.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wanchai",
        "zipcode": null,
        "website": "http://www.cstgrouphk.com",
        "market_cap": 99224216
    },
    "CW7.F": {
        "short_name": "SHOU.CON.CENT.HLDGS",
        "long_name": "Shougang Concord Century Holdings Limited",
        "summary": "Shougang Concord Century Holdings Limited, an investment holding company, manufactures and sells steel cords for use in radial tyres in the People's Republic of China. It also engages in the manufacture of sawing wires and hose wires under the Eastern brand. In addition, the company invests in properties, as well as provides management, investment trading, and consulting services. It exports its products to Europe, the Middle East, and Africa, as well as North America, South America, and rest of Asia. The company was incorporated in 1991 and is based in Chai Wan, Hong Kong.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Chai Wan",
        "zipcode": null,
        "website": "http://www.shougangcentury.com.hk",
        "market_cap": 57694780
    },
    "CZR.F": {
        "short_name": "CITIC RES.HLDGS  HD -,05",
        "long_name": "CITIC Resources Holdings Limited",
        "summary": "CITIC Resources Holdings Limited, an investment holding company, engages in the exploration, development, and production of oil and coal. It operates through four segments: Aluminum Smelting, Coal, Import and Export of Commodities, and Crude Oil. The Aluminum smelting segment operates Portland aluminum smelter, which sources alumina and produces aluminum ingots in Australia. The Coal segment mines and sells coal in Australia. The Import and Export of Commodities segment exports various commodity products, such as aluminum ingots, alumina, and copper; and imports other commodities and manufactured goods, including steel, vehicle and industrial batteries, and tyres in Australia. The Crude Oil segment explores, develops, and operates oilfields, as well as engages in the sale of oil in Indonesia and China. The company also engages in financing; oil technology development; and property holding activities, as well as provides consulting and management services. The company was incorporated in 1997 and is headquartered in Kowloon, Hong Kong. CITIC Resources Holdings Limited is a subsidiary of CITIC Group Corporation.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://resources.citic",
        "market_cap": 309383200
    },
    "EJF.F": {
        "short_name": "ECOGREEN INTL GRP  HD-,10",
        "long_name": "EcoGreen International Group Limited",
        "summary": "EcoGreen International Group Limited, an investment holding company, produces and trades in fine chemicals from natural resources for use in aroma chemicals and pharmaceutical products. It operates through Scent and Taste, Naturals, and Specialties and Others segments. The company offers components of flavors and fragrances in food and beverage, tobacco, pharmaceuticals, and hygienic products. It also provides natural extracts, such as botanic essential oils and herbal extracts for flavor and fragrance, and pharmaceutical industries; components for Chinese medicine and functional food products; and natural food ingredients for the food industry. In addition, the company manufactures and sells chiral fine chemicals, pharmaceutical intermediates, and agrochemicals for the pharmacy and farm chemical industries; and food additives and seasonings, as well as sells forestry products. It operates in Mainland China, Europe, rest of Asia, North America, and internationally. The company was formerly known as EcoGreen Fine Chemicals Group Limited and changed its name to EcoGreen International Group Limited in February 2015. EcoGreen International Group Limited was founded in 1994 and is headquartered in Wanchai, Hong Kong.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.ecogreen.com",
        "market_cap": 156776736
    },
    "EMEXF": {
        "short_name": "EMERALD PLANTATION HLDGS LTD",
        "long_name": "Emerald Plantation Holdings Limited",
        "summary": "Emerald Plantation Holdings Limited operates as a forest plantation company primarily in China. The company produces and sells standing timber and logs, wood panels, blockboards, plywood cabinetry, and other products that are used for the construction of buildings and infrastructure, and furniture and interior decorative fixtures. It also offers engineered-wood flooring products, sawn timber, and finger-joint boards, as well as plywood and veneer products. In addition, the company is involved in greenery nursery operations; and supplying and managing landscaping products for property developers, local governments, and other organizations. Emerald Plantation Holdings Limited was founded in 1994 and is based in Wanchai, Hong Kong.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wanchai",
        "zipcode": null,
        "website": "http://www.emeraldplantationholdings.com",
        "market_cap": 4650000
    },
    "ETIHY": {
        "short_name": "EARTHASIA INTERNATIONAL HLDGS L",
        "long_name": "Graphex Group Limited",
        "summary": "Graphex Group Limited, an investment holding company, provides landscape architecture services in Hong Kong and Mainland China. It operates through three segments: Landscape Design, The Catering Business Focuses on the Operation of Restaurants, and Manufacture and Sale of Graphene Products. The company undertakes the residential development, infrastructure and public open space, commercial and mixed-use development, and tourism and hotel projects, as well as provides landscape design, master planning, and urban design services. It also provides design development and drawing support, and interior design services; invests in food industry; and operates restaurants in Mainland China and Italy. In addition, the company manufactures and sells of graphene product. It offers landscape architecture services to governments, public bodies, private property developers, state-owned property developers, town planning companies, architecture companies, and engineering companies. The company was formerly known as Earthasia International Holdings Limited and changed its name to Graphex Group Limited in April 2021. Graphex Group Limited was founded in 1981 and is headquartered in Causeway Bay, Hong Kong.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.graphexgroup.com",
        "market_cap": 69640720
    },
    "FU7.F": {
        "short_name": "SHOUGANG FUS.RES.GR.",
        "long_name": "Shougang Fushan Resources Group Limited",
        "summary": "Shougang Fushan Resources Group Limited, an investment holding company, engages in the mining and exploration of coal resources, and production and sale of raw and clean coking coal in the People's Republic of China. The company owns and operates the Xingwu coal mine covering an area of approximately 11.63 sq. km; the Jinjiazhuang coal mine covering an area of approximately 6.35 sq. km; and the Zhaiyadi coal mine covering an area of approximately 13.91 sq. km located in the Liulin County, Shanxi Province. It primarily serves steel manufacturers. The company was formerly known as Fushan International Energy Group Limited and changed its name to Shougang Fushan Resources Group Limited in May 2011. Shougang Fushan Resources Group Limited is based in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.shougang-resources.com.hk",
        "market_cap": 1290384256
    },
    "GBE.V": {
        "short_name": "LIFESTYLE GLOBAL BRANDS LIMITED",
        "long_name": "Lifestyle Global Brands Limited",
        "summary": "Lifestyle Global Brands Limited, through its subsidiaries, engages in the exploration of gold in West Africa. It owns 100% interest of an exploration permit for the exploration of gold and base metals on the South Morila (Kola) concession, which covers an area of 150 square kilometers located in the Sikasso Region of southern Mali. The company was formerly known as Goldbelt Empires Limited and changed its name to Lifestyle Global Brands Limited in December 2018. Lifestyle Global Brands Limited is headquartered in Wan Chai, Hong Kong.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Gold",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.goldbeltempires.com",
        "market_cap": 543750
    },
    "GDZD.F": {
        "short_name": "JINCHUAN GR.INT.RES.HD-01",
        "long_name": "Jinchuan Group International Resources Co. Ltd",
        "summary": "Jinchuan Group International Resources Co. Ltd, an investment holding company, engages in the mining operations. The company primarily explores for copper, cobalt, copper concentrates, and copper blisters. It operates Ruashi mine, a copper and cobalt mine located in Lubumbashi and Kinsenda mine, a copper mine located in Haut-Katanga Province, the Democratic Republic of the Congo; and Chibuluma South mine located in Zambia, as well as Musonoi and Lubembe projects located in the Democratic Republic of the Congo. The company also trades in copper concentrates, cathode, and blister; cobalt; and other related raw materials. It has operations in Hong Kong, South Africa, the Democratic Republic of the Congo, Switzerland, Zambia, Singapore, and South Korea. The company was founded in 1958 and is headquartered in Admiralty, Hong Kong. Jinchuan Group International Resources Co. Ltd is a subsidiary of Jinchuan (BVI) Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.jinchuan-intl.com",
        "market_cap": 1519885056
    },
    "GPS.SG": {
        "short_name": "Rare Earth Magnesium T.G.H.LtdR",
        "long_name": "Rare Earth Magnesium Technology Group Holdings Limited",
        "summary": "Rare Earth Magnesium Technology Group Holdings Limited, an investment holding company, develops, manufactures, and sells magnesium alloy new material products in Mainland China and Europe. It also operates a dolomite mine in Baishan City, Jilin Province. The company was formerly known as Group Sense (International) Limited and changed its name to Rare Earth Magnesium Technology Group Holdings Limited in July 2018. Rare Earth Magnesium Technology Group Holdings Limited was incorporated in 1992 and is based in Tsim Sha Tsui, Hong Kong. Rare Earth Magnesium Technology Group Holdings Limited is a subsidiary of Ming Xin Developments Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.remt.com.hk",
        "market_cap": 56959564
    },
    "GREN": {
        "short_name": "GREENSMART CORPORATION",
        "long_name": "Greensmart Corporation",
        "summary": "In June 2003, AgroCan Corporation changed its name to Greensmart Corporation in connection with an asset acquisition agreement with Winsmart Development, Ltd. According to the basic terms of the agreement, the company would issue to Winsmart 29,868,737 shares of its common stock. Also, Winsmart would sell to the company approximately 553,212 young eucalyptus trees planted in a total of 340 leased hectares; and a tree seedling and nursery farm situated on 3.3 leased hectares. Greensmart Corporation, through its subsidiary, AgroCan (China), Inc., specializes in producing compound fertilizers, which are custom-made to suit local conditions, such as plant, soil, and climate. Compound fertilizers are the end product made from the combination of the three primary nutrients: nitrogen, phosphate, and potassium, together with other elements, such as iron, zinc, copper, and manganese. These elements are blended in different proportions, and are made into pellets and packed into bags. Fertilizer applications include mainly paddy rice, wheat, corn, sugar cane, tobacco, cotton, vegetables, tree plantation, and fruit trees. The company's fertilizers are sold under the brand name Â\u0091AgroCan Three Leaves'. Its main customers for the fertilizers comprise the farming supply bureaus and cooperatives under the State Internal Trade Bureau of the People's Republic of China. These entities act as wholesalers to individual farmers. State-owned farms and plantations are also major accounts of the company. Greensmart Corporation was founded in 1996 and is based in Kwun Tong, Hong Kong.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": null,
        "market_cap": 381253
    },
    "GUJB.F": {
        "short_name": "GDH GUANGNAN (HOLDINGS)",
        "long_name": "GDH Guangnan (Holdings) Limited",
        "summary": "GDH Guangnan (Holdings) Limited, an investment holding company, manufactures and sells tinplates and related products primarily in Hong Kong and Mainland China. It operates through three divisions: Tinplating, Fresh and Live Foodstuffs, and Property Leasing. The Tinplating division provides tinplates and tin-free steel; and processed products, such as coated/printed tinplate/tin-free steel, as well as cold-rolled steel plates. Its tinplate and tin-free steel products are used in food, light, and chemical industries. It is also involved in the research and development, production, and sale of tinplated steel sheets, chrome-plated steel sheets, and other processed products. The Fresh and Live Foodstuffs division engages in the distribution of livestock and poultry, such as cattle and chicken; sale of live pigs; wholesale of poultry; and trading of foodstuffs, including chilled poultry and pork, frozen poultry, and rice and starch. The Property Leasing division leases offices and factory buildings. The company was formerly known as Guangnan (Holdings) Limited and changed its name to GDH Guangnan (Holdings) Limited in June 2020. GDH Guangnan (Holdings) Limited was incorporated in 1982 and is based in Wan Chai, Hong Kong. GDH Guangnan (Holdings) Limited is a subsidiary of GDH Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.gdguangnan.com",
        "market_cap": 68021696
    },
    "HUABF": {
        "short_name": "HUABAO INTERNATIONAL HOLDINGS L",
        "long_name": "Huabao International Holdings Limited",
        "summary": "Huabao International Holdings Limited, an investment holding company, researches, develops, produces, distributes, and sells flavors and fragrances, aroma and tobacco raw materials, and condiment products primarily in the People's Republic of China. The company operates through four segments: Flavours and Fragrances, Tobacco Raw Materials, Aroma Raw Materials, and Condiment. It offers paper-making reconstituted tobacco leaves and new materials products for the tobacco industry. The company is also involved in the production and sale of natural extracts; tobacco flavours and fragrances; filter materials; synthetic perfume; and food flavours and fragrances. Huabao International Holdings Limited was founded in 1996 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.hbglobal.com",
        "market_cap": 4948614144
    },
    "HUIHY": {
        "short_name": "HUABAO INTERNATIONAL HOLDINGS L",
        "long_name": "Huabao International Holdings Limited",
        "summary": "Huabao International Holdings Limited, an investment holding company, researches, develops, produces, distributes, and sells flavors and fragrances, aroma and tobacco raw materials, and condiment products primarily in the People's Republic of China. The company operates through four segments: Flavours and Fragrances, Tobacco Raw Materials, Aroma Raw Materials, and Condiment. It offers paper-making reconstituted tobacco leaves and new materials products for the tobacco industry. The company is also involved in the production and sale of natural extracts; tobacco flavours and fragrances; filter materials; synthetic perfume; and food flavours and fragrances. Huabao International Holdings Limited was founded in 1996 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.hbglobal.com",
        "market_cap": 6369263616
    },
    "LI9.F": {
        "short_name": "LINGBAO GOLD GR. H YC-,20",
        "long_name": "Lingbao Gold Group Company Ltd.",
        "summary": "Lingbao Gold Group Company Ltd., together with its subsidiaries, primarily engages in gold mining, smelting, and refining in the People's Republic of China. Its products include gold bullion, silver, copper products, and sulphuric acid. The company has 31 exploration rights, with an area of 289.2 square kilometers, gold reserves and resources of about 39.69 and 92.02 tonnes. It is also involved in the sale of mineral products, machinery, equipment, and components for gold processing; and design of mineral engineering. In addition, the company engages in the sale of metallurgy products and provision of technical services; and production and sale of precious metal products. The company was formerly known as Lingbao Gold Company Ltd. and changed its name to Lingbao Gold Group Company Ltd. in May 2017. Lingbao Gold Group Company Ltd. was founded in 2002 and is based in Causeway Bay, Hong Kong.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Gold",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.lbgold.com",
        "market_cap": 105222776
    },
    "LMP.F": {
        "short_name": "LEE+MAN PAPER MAN.HD-,025",
        "long_name": "Lee and Man Paper Manufacturing Limited",
        "summary": "Lee and Man Paper Manufacturing Limited, an investment holding company, manufactures and trades in packaging papers, pulps, and tissue papers in the People's Republic of China, Vietnam, Malaysia, and Hong Kong. The company operates through Packaging Paper, Tissue Paper, and Pulp segments. It offers various pulp products, such as dissolved pulps for use in viscose chemical fibers, bamboo fibers, glass papers, acetate fibers, refined rayons, etc.; unbleached bamboo kraft pulps for use in ecru life papers, environmental table wares, food bags, etc.; and bleached bamboo kraft pulps for use in tissue papers, fine papers, cigarette papers, cup papers, etc. The company also provides containerboard products, including kraft and test linerboards for use in cartons, paper bags, file boxes, paperboards, wall papers, etc.; and corrugating liners for use in corrugated layer and septi-layer of paperboards, and honeycomb-like products. In addition, it offers white lined chipboards and environment friendly white linerboard coated products for use in graphic cartons, color card printing, and offset printing, as well as in packaging of commodities, household appliances, IT products, medicine/health care products, food products, toys, gifts, ceramic products, stationery products, beverages, etc.; unbleached paper for use in various applications, such as baby care, menstruation, facial, sensitive skin, table, kitchen, etc.; and toilet rolls for wiping and cleaning of hands, faces, food, etc., as well as procures raw materials. Lee and Man Paper Manufacturing Limited was founded in 1994 and is based in Kwun Tong, Hong Kong.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.leemanpaper.com",
        "market_cap": 2890724608
    },
    "LMPMY": {
        "short_name": "LEE & MAN PAPER MANUFACTURING L",
        "long_name": "Lee and Man Paper Manufacturing Limited",
        "summary": "Lee and Man Paper Manufacturing Limited, an investment holding company, manufactures and trades in packaging papers, pulps, and tissue papers in the People's Republic of China, Vietnam, Malaysia, and Hong Kong. The company operates through Packaging Paper, Tissue Paper, and Pulp segments. It offers various pulp products, such as dissolved pulps for use in viscose chemical fibers, bamboo fibers, glass papers, acetate fibers, refined rayons, etc.; unbleached bamboo kraft pulps for use in ecru life papers, environmental table wares, food bags, etc.; and bleached bamboo kraft pulps for use in tissue papers, fine papers, cigarette papers, cup papers, etc. The company also provides containerboard products, including kraft and test linerboards for use in cartons, paper bags, file boxes, paperboards, wall papers, etc.; and corrugating liners for use in corrugated layer and septi-layer of paperboards, and honeycomb-like products. In addition, it offers white lined chipboards and environment friendly white linerboard coated products for use in graphic cartons, color card printing, and offset printing, as well as in packaging of commodities, household appliances, IT products, medicine/health care products, food products, toys, gifts, ceramic products, stationery products, beverages, etc.; unbleached paper for use in various applications, such as baby care, menstruation, facial, sensitive skin, table, kitchen, etc.; and toilet rolls for wiping and cleaning of hands, faces, food, etc., as well as procures raw materials. Lee and Man Paper Manufacturing Limited was founded in 1994 and is based in Kwun Tong, Hong Kong.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.leemanpaper.com",
        "market_cap": 3792782592
    },
    "LU4.F": {
        "short_name": "LUKS GROUP (VN)  HD -,01",
        "long_name": "Luks Group (Vietnam Holdings) Company Limited",
        "summary": "Luks Group (Vietnam Holdings) Company Limited, an investment holding company, manufactures and sells cement products for use in the construction industry in Vietnam, Hong Kong, and Mainland China. It operates through five segments: Cement Products; Property Investment; Hotel Operation; Property Development; and Corporate and Others. The company offers cement products under the KIM DINH brand to construction sites and retail markets; provides clinkers; and invests in and rents various properties, including industrial, commercial, and residential premises, as well as provides property management and related services. It also develops and sells properties; operates and manages the Pentahotel Hong Kong with 298 rooms located in Tuen Mun; sells and trades in electronic products, including printed circuits boards and other electronics components; and manufactures and sells plywood products. The company was founded in 1975 and is based in To Kwa Wan, Hong Kong.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "To Kwa Wan",
        "zipcode": null,
        "website": "http://www.luks.com.hk",
        "market_cap": 73096840
    },
    "MJDA.F": {
        "short_name": null,
        "long_name": "M-Resources Group Limited",
        "summary": "M-Resources Group Limited, an investment holding company, primarily engages in forestry and agricultural, financial services, cultural, and logistics businesses in the People's Republic of China and Hong Kong. It is involved in timber logging, as well as the plantation and sale of wood and agricultural products. The company also plants and cultivates rubber trees for latex production; and distributes agricultural products. In addition, it provides securities brokerage and trading services; underwriting and placing services; asset management services; and loan financing services. Further, the company develops and upgrades Chinese cultural related online application. It owns three forests measuring 31,000 hectares in Kratie Province, the Kingdom of Cambodia. The company was formerly known as IR Resources Limited and changed its name to M-Resources Group Limited in April 2021. M-Resources Group Limited is based in Lai Chi Kok, Hong Kong.",
        "currency": null,
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Lai Chi Kok",
        "zipcode": null,
        "website": "http://www.m-resources.com.hk",
        "market_cap": 0
    },
    "MNSF": {
        "short_name": "MANSFELDER METALS LTD",
        "long_name": "Mansfelder Metals Ltd.",
        "summary": "Mansfelder Metals, Ltd., through its subsidiaries, engages in the manufacture and trading of aluminum products. The company's products include aluminum sheets, foils, strips, and blanks for use by industrial and commercial fabricators of aluminum products. It also produces aluminum foil for food and beverage packaging, pharmaceutical packaging, and technical applications. Mansfelder Metals, Ltd. was formerly known as Cathay Merchant Group, Inc. and it changed its name to Mansfelder Metals, Ltd. in 2004. The company was incorporated in 1977 and is based in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": null,
        "market_cap": 519490
    },
    "MOAEF": {
        "short_name": "MONGOLIA ENERGY CORP LTD",
        "long_name": "Mongolia Energy Corporation Limited",
        "summary": "Mongolia Energy Corporation Limited, an investment holding company, engages in the coal mining, processing, and other resources related operations in the People's Republic of China and Mongolia. It sells coking and thermal coal. The company's principal project is the Khushuut coking coal project in Western Mongolia. It holds approximately 13,981 hectares of exploration and mining concession areas for coal and ferrous resources in Western Mongolia at Khovd, Gobi Altay, Olon Bulag, and Bayan-Ulgii. The company is also involved in the provision of management services, and secretarial and nominee services, as well as mining and exploration advisory service; trading of coal; and operation of coal washing plants. Mongolia Energy Corporation Limited is based in Hong Kong.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.mongolia-energy.com",
        "market_cap": 25782654
    },
    "NY6.SG": {
        "short_name": "China Natural Resources Inc. Re",
        "long_name": "China Natural Resources, Inc.",
        "summary": "China Natural Resources, Inc., through its subsidiaries, engages in the exploration and mining of metal properties in the People's Republic of China. The company explores for lead, silver, and other metal deposits. It holds interest in the Moruogu Tong mine that covers an area of 10.43 square kilometers located in Bayannaoer City, Inner Mongolia. The company was incorporated in 1993 and is headquartered in Sheung Wan, Hong Kong. China Natural Resources, Inc. is a subsidiary of Feishang Group Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sheung Wan",
        "zipcode": null,
        "website": "http://www.chnr.net",
        "market_cap": 49021364
    },
    "ORG.F": {
        "short_name": "CHINA ORIENTAL GRP HD-,10",
        "long_name": "China Oriental Group Company Limited",
        "summary": "China Oriental Group Company Limited, an investment holding company, manufactures and sells iron and steel products for downstream steel manufacturers in the People's Republic of China. The company operates through Iron and Steel, and Real Estate segments. It offers H-section steel products for use in non-residential construction and infrastructure projects as structural supports; strips and strip products; cold rolled sheets for use in manufacturing home electric appliances, hardware, pipes, etc.; galvanized sheets for the production of civil-purpose sheets; and billets for use as substrate in downstream steel products; and rebars for use in residential and non-residential projects. The company is also involved in the trade of steel, and iron ore and related products; leasing and financial leasing business; import and export of goods and technology; purchase and sale of ferrous metal and coke; development and sale of real estate properties; environmental protection engineering activities; non-metallic ore mining and trading; recycling of steel and waste materials; processing and sale of railway transmission lines and accessories; manufacturing of casting products; and research and development of recycling and energy-saving technology, as well as other recycling and construction engineering business. In addition, it provides equipment maintenance, motor vehicle scrap, and crush demolition solutions; publication, construction project management, wholesale and retail trade, asset management, logistics, commercial management, hotel and catering, cargo transit agency, and investment and management services; and architectural design, sale, and installation services, commercial consulting, technical advisory and software development, technology promotion, new material technology and building engineering design services, and loans. China Oriental Group Company Limited was incorporated in 2003 and is based in Wanchai, Hong Kong.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.chinaorientalgroup.com",
        "market_cap": 1018233024
    },
    "P0A.F": {
        "short_name": "PANASIALUM HLDGS CO.HD-10",
        "long_name": "PanAsialum Holdings Company Limited",
        "summary": "PanAsialum Holdings Company Limited, an investment holding company, manufactures and trades in aluminum products. The company operates through three segments: Electronics Parts; Construction and Industrial Products; and Door and Window Frames Systems. It offers electronic, mechanical equipment, and LED heatsinks; skirt boards and auto parts; solar module frame series; electronic products and accessories series; and fences series, as well as doors, windows and related accessories development, profiles die development, specialized and customized products, and related installation guidance. The company's products are used in electronic products accessories, solar system, rail transit, lightweight of automobile, shipbuilding, outdoor equipment, medical devices, high-end machinery, frames for doors, windows and curtain walls, municipal construction, and general industrial profiles. It has operations in the People's Republic of China, Australia, North America, Honk Kong, and internationally. PanAsialum Holdings Company Limited was founded in 1990 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.palum.com",
        "market_cap": 52480892
    },
    "SNFRF": {
        "short_name": "SINOFERT HOLDINGS",
        "long_name": "Sinofert Holdings Limited",
        "summary": "Sinofert Holdings Limited, an investment holding company, engages in the production, import and export, distribution, and retail of fertilizer raw materials and finished products primarily in Mainland China and Macao Special Administrative Region. The company operates through Basic Fertilizers, Distribution, and Production segments. It offers nitrogen, phosphate, and potash; compound fertilizers; and monocalcium/dicalcium phosphate. The company also provides technological research and development, and services relating to the fertilizer business and products; trades in pesticides and fertilizers; develops agriculture products; and manufactures and sells textiles and feed stuffs. In addition, it explores for and exploits phosphate mine. The company is based in Wan Chai, Hong Kong. Sinofert Holdings Limited in incorporated in 1994 and is a subsidiary of Sinochem Hong Kong (Group) Company Limited.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.sinofert.com",
        "market_cap": 889585216
    },
    "SUO.F": {
        "short_name": "CWT INTERNATIONAL LTD.",
        "long_name": "CWT International Limited",
        "summary": "CWT International Limited, an investment holding company, provides commodity marketing services. The company operates through four segments: Logistics Services, Commodity Marketing, Engineering Services, and Financial Services. It engages in the trading and supply chain management of base metal non-ferrous concentrates with a focus on copper, lead, zinc, and other minor metals, as well as energy products, including naphtha and distillates. The company also offers logistics services, such as warehousing, transportation, freight forwarding and cargo consolidation, and supply chain management services. In addition, it provides engineering services comprising management and maintenance of facilities, vehicles, and equipment; supplies and installs engineering products; property management services; and designs and builds logistic properties. Further, the company offers financial brokerage, structured trade, and assets management services. It operates in Mainland China, Singapore, and other parts of the Asia Pacific region; Europe; Africa; North America; and South America. The company was formerly known as HNA Holding Group Co. Limited and changed its name to CWT International Limited in December 2017. CWT International Limited was incorporated in 1983 and is based in Wan Chai, Hong Kong. CWT International Limited is a subsidiary of Hong Kong HNA Holding Group Co. Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.cwtinternational.com",
        "market_cap": 40438552
    },
    "TFTB.F": {
        "short_name": "CN DAYE NON-FE.M.M.HD-,05",
        "long_name": "China Daye Non-Ferrous Metals Mining Limited",
        "summary": "China Daye Non-Ferrous Metals Mining Limited, an investment holding company, engages in the exploration, development, mining, and processing of mineral ores in the People's Republic of China, Hong Kong, and the Republic of Mongolia. It explores for copper, gold, silver, iron, and molybdenum deposits. The company holds interests in the Tonglvshan and Tongshankou mines located in Daye City; Fengshan and Chimashan mines located in Yangxin County; and Sareke copper mine located in Wuqia County. It is also involved in the trading of metals, minerals, and concentrates; quality testing of construction projects; and provision of research and development services. The company is headquartered in Kowloon, Hong Kong. China Daye Non-Ferrous Metals Mining Limited is a subsidiary of China Times Development Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.hk661.com",
        "market_cap": 169716752
    },
    "VRDR": {
        "short_name": "VERDE RES INC",
        "long_name": "Verde Resources, Inc.",
        "summary": "Verde Resources, Inc. engages in the gold mining business in Malaysia. The company holds interests in the Merapoh gold mine that covers an area of 400 acres located in northern Pahang, Malaysia. Verde Resources, Inc. is based in Wanchai, Hong Kong.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Gold",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wanchai",
        "zipcode": null,
        "website": "http://www.verderesources.us",
        "market_cap": 6382145
    },
    "WCQ1.F": {
        "short_name": "SINOFERT HLDGS  HD-,10",
        "long_name": "Sinofert Holdings Limited",
        "summary": "Sinofert Holdings Limited, an investment holding company, engages in the production, import and export, distribution, and retail of fertilizer raw materials and finished products primarily in Mainland China and Macao Special Administrative Region. The company operates through Basic Fertilizers, Distribution, and Production segments. It offers nitrogen, phosphate, and potash; compound fertilizers; and monocalcium/dicalcium phosphate. The company also provides technological research and development, and services relating to the fertilizer business and products; trades in pesticides and fertilizers; develops agriculture products; and manufactures and sells textiles and feed stuffs. In addition, it explores for and exploits phosphate mine. The company is based in Wan Chai, Hong Kong. Sinofert Holdings Limited in incorporated in 1994 and is a subsidiary of Sinochem Hong Kong (Group) Company Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.sinofert.com",
        "market_cap": 844614848
    },
    "YCK.F": {
        "short_name": "CHU KONG PET.+NAT.ST.P.H.",
        "long_name": "Chu Kong Petroleum and Natural Gas Steel Pipe Holdings Limited",
        "summary": "Chu Kong Petroleum and Natural Gas Steel Pipe Holdings Limited, an investment holding company, manufactures, sells, and exports longitudinal welded steel pipes in the People's Republic of China and internationally. It operates through two segments, Steel Pipes, and Property Development and Investment. The company offers longitudinal and spiral submerged arc-welded steel pipes. It also trades in steel pipes; manufactures and sells petrol fittings, oil country tubular goods, steel pipe equipment and metallurgy equipment, and screw-thread steels; and provides steel pipe casing and lining, and port services. In addition, the company is involved in the property investment, development, and management activities; provision of manufacturing services for processing raw materials into steel pipes; trading of steel plates; and sale of steel fittings and scrap materials. Its steel pipes are primarily used for energy transmission, including oil and gas transmission pipelines, deep sea pipelines, city gas networks, and petrochemicals, as well as mining, infrastructure construction, offshore engineering, steel structure, and water utilities industries. The company was founded in 1993 and is headquartered in Tsim Sha Tsui, Hong Kong. Chu Kong Petroleum and Natural Gas Steel Pipe Holdings Limited is a subsidiary of Bournam Profits Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.pck.com.cn",
        "market_cap": 38258960
    },
    "YIPCF": {
        "short_name": "YIP'S CHEMICAL HOLDINGS",
        "long_name": "Yip's Chemical Holdings Limited",
        "summary": "Yip's Chemical Holdings Limited, an investment holding company, produces and sells petrochemical products in the People's Republic of China and Hong Kong. It operates through Solvents, Coatings, Inks, Lubricants, and Properties segments. The Solvents segment produces industrial organic solvents, such as ethyl acetate, normal butyl acetate, mixed butyl acetate, ethanol, and butyl acrylate used in coatings, tannery, medicine, and adhesives industries. The Coatings segment provides architectural coatings, including inner and outer wall paints, and water-based emulsion and wood paints for the household paints market; industrial coatings comprising coatings for furniture, and plastic and mechanical products; and alkyd, acrylic, UV, amino, and water-based resins, as well as PU hardeners. This segment offers its products under the Camel, Aquapro, and VIVA brands. The Inks segment provides plastic and paper printing inks for use in food, drinks and gift packaging, and paper printing applications under the Bauhinia Variegata brand. The Lubricants segment offers automotive and industrial lubricants, including engine oils, antifreezes, system coolants, brake fluids, greases, gear oils, automatic transmission fluids, hydraulic oils, turbine oils, heat conducting oils, slideway oils, compressor oils, and circulating oils under the Hercules brand. It also provides specialty lubricants under the Pacoil brand to the metal processing, automobiles, home appliances, electronics, steel, toys, power generation, cement, textiles, foundry, plastics, chemicals, paper making, glass, wires, and cables industries. The Properties segment invests in properties. The company also trades in coatings, solvents, resins, inks, lubricants, and sanitizing products; offers treasury and car maintenance services; and generates and sells electricity. The company was formerly known as Hang Cheung Hong. Yip's Chemical Holdings Limited was founded in 1971 and is headquartered in Wanchai, Hong Kong.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.yipschemical.com",
        "market_cap": 381343392
    }
}