{
    "0094.HK": {
        "short_name": "GREENHEART GP",
        "long_name": "Greenheart Group Limited",
        "summary": "Greenheart Group Limited, an investment holding company, engages in forestry business worldwide. It operates in two segments, Suriname and New Zealand. The company is involved in hardwood log harvesting and timber processing, as well as the marketing, sale, and trading of logs and timber products. It offers softwood products, such as radiata pine logs for sawn timber and plywood and veneer; and hardwood products used for furniture, flooring, decking, windows/doors, outdoor timber/heavy construction, interior decoration, and marine applications. As of December 31, 2020, the company managed radiata pine plantation forest assets with a total freehold title land base of approximately 12,700 hectares located in Northland region of New Zealand, as well as approximately 340,000 hectares of concessions and cutting rights in Suriname, South America. It also provides corporate, administrative and management, forest management, and shipping services; holds timber concessions, and harvests and sells logs and timber products; manufactures and sells pallets; and administers forestry operations. The company was formerly known as Omnicorp Limited and changed its name to Greenheart Group Limited in December 2010. The company was incorporated in 1991 and is headquartered in Wanchai, Hong Kong. Greenheart Group Limited is a subsidiary of Newforest Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.greenheartgroup.com",
        "market_cap": "Small Cap"
    },
    "8277.HK": {
        "short_name": "STEEDORIENTAL",
        "long_name": "Steed Oriental (Holdings) Company Limited",
        "summary": "Steed Oriental (Holdings) Company Limited, an investment holding company, sources, manufactures, and sells plywood and other wooden products in Japan, Mainland China, Thailand, Hong Kong, and internationally. The company provides general plywood used for manufacture of furniture for home and office; packing plywood used for packaging; structural panels for house construction; floor base products for flooring applications; supplementary materials used for construction; and other wooden products It sells its plywood products to construction materials trading companies and wholesalers; retailers, including supermarkets; flooring and furniture manufacturers; and individual or corporate end-users. Steed Oriental (Holdings) Company Limited was incorporated in 2013 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.steedoriental.com.hk",
        "market_cap": "Small Cap"
    },
    "EMEXF": {
        "short_name": "EMERALD PLANTATION HLDGS LTD",
        "long_name": "Emerald Plantation Holdings Limited",
        "summary": "Emerald Plantation Holdings Limited operates as a forest plantation company primarily in China. The company produces and sells standing timber and logs, wood panels, blockboards, plywood cabinetry, and other products that are used for the construction of buildings and infrastructure, and furniture and interior decorative fixtures. It also offers engineered-wood flooring products, sawn timber, and finger-joint boards, as well as plywood and veneer products. In addition, the company is involved in greenery nursery operations; and supplying and managing landscaping products for property developers, local governments, and other organizations. Emerald Plantation Holdings Limited was founded in 1994 and is based in Wanchai, Hong Kong.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wanchai",
        "zipcode": null,
        "website": "http://www.emeraldplantationholdings.com",
        "market_cap": "Small Cap"
    },
    "MJDA.F": {
        "short_name": null,
        "long_name": "M-Resources Group Limited",
        "summary": "M-Resources Group Limited, an investment holding company, primarily engages in forestry and agricultural, financial services, cultural, and logistics businesses in the People's Republic of China and Hong Kong. It is involved in timber logging, as well as the plantation and sale of wood and agricultural products. The company also plants and cultivates rubber trees for latex production; and distributes agricultural products. In addition, it provides securities brokerage and trading services; underwriting and placing services; asset management services; and loan financing services. Further, the company develops and upgrades Chinese cultural related online application. It owns three forests measuring 31,000 hectares in Kratie Province, the Kingdom of Cambodia. The company was formerly known as IR Resources Limited and changed its name to M-Resources Group Limited in April 2021. M-Resources Group Limited is based in Lai Chi Kok, Hong Kong.",
        "currency": null,
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Lai Chi Kok",
        "zipcode": null,
        "website": "http://www.m-resources.com.hk",
        "market_cap": null
    }
}