{
  "0159.HK": {
    "city": "Admiralty",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Other Industrial Metals & Mining",
    "long_name": "Brockman Mining Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "BROCKMAN MINING",
    "state": null,
    "summary": "Brockman Mining Limited, an investment holding company, engages in the acquisition, exploration, and development of iron ore mining projects in Australia. Its principal projects include the Marillana Project covering an area of 82 square kilometers; and the Ophthalmia Project and other exploration projects located in the Pilbara region of Western Australia. The company was formerly known as Wah Nam International Holdings Limited and changed its name to Brockman Mining Limited in September 2012. Brockman Mining Limited is headquartered in Admiralty, Hong Kong.",
    "website": "http://www.brockmanmining.com",
    "zipcode": null
  },
  "0195.HK": {
    "city": "Tsim Sha Tsui",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Other Industrial Metals & Mining",
    "long_name": "Greentech Technology International Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "GREENTECH INTL",
    "state": null,
    "summary": "Greentech Technology International Limited, an investment holding company, engages in the exploration, development, and mining of tin and copper bearing ores in Australia. It holds 50% interests in the Renison underground mine, the Mount Bischoff open cut tin project, and the Renison tailings retreatment project located in Tasmania. The company was formerly known as L'sea Resources International Holdings Limited and changed its name to Greentech Technology International Limited in October 2017. Greentech Technology International Limited was incorporated in 2008 and is based in Tsim Sha Tsui, Hong Kong.",
    "website": "http://www.green-technology.com.hk",
    "zipcode": null
  },
  "0521.HK": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Other Industrial Metals & Mining",
    "long_name": "CWT International Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "CWT INT'L",
    "state": null,
    "summary": "CWT International Limited, an investment holding company, provides commodity marketing services. The company operates through four segments: Logistics Services, Commodity Marketing, Engineering Services, and Financial Services. It engages in the trading and supply chain management of base metal non-ferrous concentrates with a focus on copper, lead, zinc, and other minor metals, as well as energy products, including naphtha and distillates. The company also offers logistics services, such as warehousing, transportation, freight forwarding and cargo consolidation, and supply chain management services. In addition, it provides engineering services comprising management and maintenance of facilities, vehicles, and equipment; supplies and installs engineering products; property management services; and designs and builds logistic properties. Further, the company offers financial brokerage, structured trade, and assets management services. It operates in Mainland China, Singapore, and other parts of the Asia Pacific region; Europe; Africa; North America; and South America. The company was formerly known as HNA Holding Group Co. Limited and changed its name to CWT International Limited in December 2017. CWT International Limited was incorporated in 1983 and is based in Wan Chai, Hong Kong. CWT International Limited is a subsidiary of Hong Kong HNA Holding Group Co. Limited.",
    "website": "http://www.cwtinternational.com",
    "zipcode": null
  },
  "0601.HK": {
    "city": "Tsim Sha Tsui",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Other Industrial Metals & Mining",
    "long_name": "Rare Earth Magnesium Technology Group Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "REMT",
    "state": null,
    "summary": "Rare Earth Magnesium Technology Group Holdings Limited, an investment holding company, develops, manufactures, and sells magnesium alloy new material products in Mainland China and Europe. It also operates a dolomite mine in Baishan City, Jilin Province. The company was formerly known as Group Sense (International) Limited and changed its name to Rare Earth Magnesium Technology Group Holdings Limited in July 2018. Rare Earth Magnesium Technology Group Holdings Limited was incorporated in 1992 and is based in Tsim Sha Tsui, Hong Kong. Rare Earth Magnesium Technology Group Holdings Limited is a subsidiary of Ming Xin Developments Limited.",
    "website": "http://www.remt.com.hk",
    "zipcode": null
  },
  "0758.HK": {
    "city": "Causeway Bay",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Other Industrial Metals & Mining",
    "long_name": "Macrolink Capital Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "MACROLINK CAP",
    "state": null,
    "summary": "Macrolink Capital Holdings Limited, an investment holding company, develops, manufactures, and sells construction materials in the People's Republic of China, Peru, Hong Kong. The company operates in six segments: Property Investment and Development, Manufacture and Sale of Construction Materials, Securities Investments, Trading of Mineral Concentrates, Coal Mining, and Others. It is involved in the leasing and sale of properties; manufacture and sale of slag powder; trading of mineral concentrates; exploration and development of coal mine concessions, and sale of coal; and sale of parts of mining equipment, as well as invests in listed securities. The company was formerly known as Junefield Department Store Group Limited and changed its name to Macrolink Capital Holdings Limited in June 2018. Macrolink Capital Holdings Limited was incorporated in 1998 and is headquartered in Causeway Bay, Hong Kong. Macrolink Capital Holdings Limited is a subsidiary of Macrolink Group Limited.",
    "website": "http://macrolinkcapital.etnet.com.hk",
    "zipcode": null
  },
  "1091.HK": {
    "city": "Admiralty",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Other Industrial Metals & Mining",
    "long_name": "South Manganese Investment Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "SOUTH MANGANESE",
    "state": null,
    "summary": "South Manganese Investment Limited, an investment holding company, engages in manganese mining, ore processing, and downstream processing operations in Mainland China, rest of Asia, Europe, and North America. It operates through four segments: Manganese Mining and Ore Processing, EMM and Alloying Materials, Battery Materials, and Other Business. The Manganese Mining and Ore Processing segment mines and produces manganese products, including manganese concentrate, and natural discharging manganese powder and sand. This segment also has interests in the Daxin mine located to the west of Daxin County in Guangxi; the Tiandeng manganese mine located to the north of Tiandeng County in Guangxi; the Waifu manganese mine located in Jingxi, Guangxi; the Changgou manganese mine located in Guizhou; and the Bembélé manganese mine located to the north of Ndjolé town in the Moyen-Ogooue Province of Gabon. The EMM and Alloying Materials segment mines and processes ores used in hydrometallurgical processing activities for/and the production of electrolytic manganese metal (EMM) and manganese briquette, and pyrometallurgical processing for production of silicomanganese alloys. The Battery Materials segment manufactures and sells of battery materials products, including Electrolytic Manganese Dioxide (EMD), manganese sulfate, lithium manganese oxide, lithium nickel cobalt manganese oxide, and lithium manganese oxide. The Other Business segment trades in various commodities, such as manganese ores, EMM, manganese alloys, non-manganese metals, and related raw materials, as well as sells scraps, and rents investment properties and leasehold lands. It also manufactures and sells equipment, develops properties, and produces sulphuric acid and steam. The company was formerly known as CITIC Dameng Holdings Limited and changed its name to South Manganese Investment Limited in February 2021. The company was incorporated in 2005 and is headquartered in Admiralty, Hong Kong.",
    "website": "http://www.dameng.citic.com",
    "zipcode": null
  },
  "2326.HK": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Other Industrial Metals & Mining",
    "long_name": "New Provenance Everlasting Holdings Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "NPE HOLDINGS",
    "state": null,
    "summary": "New Provenance Everlasting Holdings Limited, an investment holding company, sources and sells metal minerals and related industrial materials in the People's Republic of China. It is also involved in the production and sale of industrial products; provision of logistics, including warehousing, transportation, and cargo handling services; and provision of management services. The company was formerly known as BEP International Holdings Limited and changed its name to New Provenance Everlasting Holdings Limited in October 2017. New Provenance Everlasting Holdings Limited is headquartered in Wan Chai, Hong Kong.",
    "website": "http://www.npegroup.com.hk",
    "zipcode": null
  },
  "6128.HK": {
    "city": "Causeway Bay",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Other Industrial Metals & Mining",
    "long_name": "Graphex Group Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "GRAPHEX GROUP",
    "state": null,
    "summary": "Graphex Group Limited, an investment holding company, manufactures and sells graphene products in the People's Republic of China. It operates through three segments: Manufacturing and Sale of Graphene Products; Landscape Design; and The Catering Business Focuses on the Operation of Restaurants. The company provides spherical graphite and graphene for the use in electric vehicle batteries, lithium-ion batteries, advanced solar energy products, and other applications; high purity graphite for magnesia carbon bricks, high grade refractories, stabilizers, carbon brushes, and fire-resistant composite materials applications; and micronized graphite for corrosion-resistant coating, lubricants, and other composite materials applications. It also offers landscape architecture services urban renewals, corporate campuses, hotels/resorts, and theme parks projects for governments, property developers, design service companies, and engineering businesses. In addition, the company provides catering services, including the operation and management of Thai Gallery restaurants, which serves Thai cuisine. Further, it offers interior design and catering management services; and invests in food industry. The company was formerly known as Earthasia International Holdings Limited and changed its name to Graphex Group Limited in April 2021. Graphex Group Limited was founded in 1981 and is headquartered in Causeway Bay, Hong Kong.",
    "website": "http://www.graphexgroup.com",
    "zipcode": null
  },
  "8028.HK": {
    "city": "Hong Kong",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Other Industrial Metals & Mining",
    "long_name": "Timeless Software Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "TIMELESS",
    "state": null,
    "summary": "Timeless Software Limited, an investment holding company, engages in mining business in the People's Republic of China. The company operates in two segments, Mining Business and Other Business. It explores, exploits, processes, and sells nickel and copper ores, as well as gold and iron ores. The company has interest in the Baishiquan nickel-copper mine located in Xinjiang. It is also involved in the provision of consultancy, software maintenance and development, and e-commerce services, as well as invests in IT and innovation projects, including e-Sport tournament organizing, bio and nano new materials, IT startup fund, and intelligent agricultural applications. In addition, the company engages in the technology and business investment activities; and research and development of Styrofoam. Timeless Software Limited was founded in 1996 and is based in Hong Kong, Hong Kong.",
    "website": "http://www.timeless.com.hk",
    "zipcode": null
  },
  "AHAD": {
    "city": "Sheung Wan",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Other Industrial Metals & Mining",
    "long_name": "Alphacom Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "ALPHACOM HOLDINGS INC",
    "state": null,
    "summary": "Alphacom Holdings Inc., a multi-technology incubator, engages in converting technologies into commercialized forms for licensing into distribution across various industry sectors. The company is based in Sheung Wan, Hong Kong. As of February 22, 2021, Alphacom Holdings, Inc. operates as a subsidiary of Marc&Hem Publicidad S.A. de C.V.",
    "website": "http://alphacomholdings.com",
    "zipcode": "999077"
  },
  "AIHA.F": {
    "city": "Tsim Sha Tsui",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Other Industrial Metals & Mining",
    "long_name": "Greentech Technology International Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "GREENTECH TECH. INTL",
    "state": null,
    "summary": "Greentech Technology International Limited, an investment holding company, engages in the exploration, development, and mining of tin and copper bearing ores in Australia. It holds 50% interests in the Renison underground mine, the Mount Bischoff open cut tin project, and the Renison tailings retreatment project located in Tasmania. The company was formerly known as L'sea Resources International Holdings Limited and changed its name to Greentech Technology International Limited in October 2017. Greentech Technology International Limited was incorporated in 2008 and is based in Tsim Sha Tsui, Hong Kong.",
    "website": "http://www.green-technology.com.hk",
    "zipcode": null
  },
  "BCK.AX": {
    "city": "Admiralty",
    "country": "Hong Kong",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Other Industrial Metals & Mining",
    "long_name": "Brockman Mining Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "BROCKMAN FPO",
    "state": null,
    "summary": "Brockman Mining Limited, an investment holding company, engages in the acquisition, exploration, and development of iron ore mining projects in Australia. Its principal projects include the Marillana Project covering an area of 82 square kilometers; and the Ophthalmia Project and other exploration projects located in the Pilbara region of Western Australia. The company was formerly known as Wah Nam International Holdings Limited and changed its name to Brockman Mining Limited in September 2012. Brockman Mining Limited is headquartered in Admiralty, Hong Kong.",
    "website": "http://www.brockmanmining.com",
    "zipcode": null
  },
  "CHNR": {
    "city": "Sheung Wan",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Other Industrial Metals & Mining",
    "long_name": "China Natural Resources, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "China Natural Resources, Inc.",
    "state": null,
    "summary": "China Natural Resources, Inc., through its subsidiaries, engages in the exploration and mining of metal properties in the People's Republic of China. The company explores for lead, silver, and other metal deposits. It holds interest in the Moruogu Tong mine that covers an area of 10.43 square kilometers located in Bayannaoer City, Inner Mongolia. The company was incorporated in 1993 and is headquartered in Sheung Wan, Hong Kong. China Natural Resources, Inc. is a subsidiary of Feishang Group Limited.",
    "website": "http://www.chnr.net",
    "zipcode": null
  },
  "CMIM": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Other Industrial Metals & Mining",
    "long_name": "Changming Industrial Management Group Holding",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "CHANGMING INDL MGMT GROUP HLDG",
    "state": null,
    "summary": "Changming Industrial Management Group Holding provides hospital management consultancy services to VIP maternity and gynecological centers (VIP Birthing Centers) in China. It also manages a private hospital in Macau. The company's obstetric services include outpatient services such as pre-delivery check-up and consultation, and prenatal genetic consultation; and inpatient and minor surgery services, including vaginal birth, caesarean, and prenatal education. Its gynecology services comprise various outpatient services consisting of gynecologic check up and pre-marriage body checkup; and inpatient and minor surgery services, such as gynecologic minor operation and minor operation for planned childbirth. The company was formerly known as China Health Care Corporation and changed its name to Changming Industrial Management Group Holding in February 2019. Changming Industrial Management Group Holding was founded in 2001 and is based in Wan Chai, Hong Kong.",
    "website": null,
    "zipcode": null
  },
  "CZR.F": {
    "city": "Kowloon",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Other Industrial Metals & Mining",
    "long_name": "CITIC Resources Holdings Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "CITIC RES.HLDGS  HD -,05",
    "state": null,
    "summary": "CITIC Resources Holdings Limited, an investment holding company, engages in the exploration, development, and production of oil and coal. It operates through four segments: Aluminum Smelting, Coal, Import and Export of Commodities, and Crude Oil. The Aluminum smelting segment operates Portland aluminum smelter, which sources alumina and produces aluminum ingots in Australia. The Coal segment mines and sells coal in Australia. The Import and Export of Commodities segment exports various commodity products, such as aluminum ingots, alumina, and copper; and imports other commodities and manufactured goods, including steel, vehicle and industrial batteries, and tyres in Australia. The Crude Oil segment explores, develops, and operates oilfields, as well as engages in the sale of oil in Indonesia and China. The company also engages in financing; oil technology development; and property holding activities, as well as provides consulting and management services. The company was incorporated in 1997 and is headquartered in Kowloon, Hong Kong. CITIC Resources Holdings Limited is a subsidiary of CITIC Group Corporation.",
    "website": "http://resources.citic",
    "zipcode": null
  },
  "ETIHY": {
    "city": "Causeway Bay",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Other Industrial Metals & Mining",
    "long_name": "Graphex Group Limited",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "EARTHASIA INTERNATIONAL HLDGS L",
    "state": null,
    "summary": "Graphex Group Limited, an investment holding company, provides landscape architecture services in Hong Kong and Mainland China. It operates through three segments: Landscape Design, The Catering Business Focuses on the Operation of Restaurants, and Manufacture and Sale of Graphene Products. The company undertakes the residential development, infrastructure and public open space, commercial and mixed-use development, and tourism and hotel projects, as well as provides landscape design, master planning, and urban design services. It also provides design development and drawing support, and interior design services; invests in food industry; and operates restaurants in Mainland China and Italy. In addition, the company manufactures and sells of graphene product. It offers landscape architecture services to governments, public bodies, private property developers, state-owned property developers, town planning companies, architecture companies, and engineering companies. The company was formerly known as Earthasia International Holdings Limited and changed its name to Graphex Group Limited in April 2021. Graphex Group Limited was founded in 1981 and is headquartered in Causeway Bay, Hong Kong.",
    "website": "http://www.graphexgroup.com",
    "zipcode": null
  },
  "GPS.SG": {
    "city": "Tsim Sha Tsui",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Other Industrial Metals & Mining",
    "long_name": "Rare Earth Magnesium Technology Group Holdings Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "Rare Earth Magnesium T.G.H.LtdR",
    "state": null,
    "summary": "Rare Earth Magnesium Technology Group Holdings Limited, an investment holding company, develops, manufactures, and sells magnesium alloy new material products in Mainland China and Europe. It also operates a dolomite mine in Baishan City, Jilin Province. The company was formerly known as Group Sense (International) Limited and changed its name to Rare Earth Magnesium Technology Group Holdings Limited in July 2018. Rare Earth Magnesium Technology Group Holdings Limited was incorporated in 1992 and is based in Tsim Sha Tsui, Hong Kong. Rare Earth Magnesium Technology Group Holdings Limited is a subsidiary of Ming Xin Developments Limited.",
    "website": "http://www.remt.com.hk",
    "zipcode": null
  },
  "NY6.SG": {
    "city": "Sheung Wan",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Other Industrial Metals & Mining",
    "long_name": "China Natural Resources, Inc.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "China Natural Resources Inc. Re",
    "state": null,
    "summary": "China Natural Resources, Inc., through its subsidiaries, engages in the exploration and mining of metal properties in the People's Republic of China. The company explores for lead, silver, and other metal deposits. It holds interest in the Moruogu Tong mine that covers an area of 10.43 square kilometers located in Bayannaoer City, Inner Mongolia. The company was incorporated in 1993 and is headquartered in Sheung Wan, Hong Kong. China Natural Resources, Inc. is a subsidiary of Feishang Group Limited.",
    "website": "http://www.chnr.net",
    "zipcode": null
  },
  "SUO.F": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Other Industrial Metals & Mining",
    "long_name": "CWT International Limited",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "CWT INTERNATIONAL LTD.",
    "state": null,
    "summary": "CWT International Limited, an investment holding company, provides commodity marketing services. The company operates through four segments: Logistics Services, Commodity Marketing, Engineering Services, and Financial Services. It engages in the trading and supply chain management of base metal non-ferrous concentrates with a focus on copper, lead, zinc, and other minor metals, as well as energy products, including naphtha and distillates. The company also offers logistics services, such as warehousing, transportation, freight forwarding and cargo consolidation, and supply chain management services. In addition, it provides engineering services comprising management and maintenance of facilities, vehicles, and equipment; supplies and installs engineering products; property management services; and designs and builds logistic properties. Further, the company offers financial brokerage, structured trade, and assets management services. It operates in Mainland China, Singapore, and other parts of the Asia Pacific region; Europe; Africa; North America; and South America. The company was formerly known as HNA Holding Group Co. Limited and changed its name to CWT International Limited in December 2017. CWT International Limited was incorporated in 1983 and is based in Wan Chai, Hong Kong. CWT International Limited is a subsidiary of Hong Kong HNA Holding Group Co. Limited.",
    "website": "http://www.cwtinternational.com",
    "zipcode": null
  }
}
