{
    "0794.HK": {
        "short_name": "COME SURE GROUP",
        "long_name": "Come Sure Group (Holdings) Limited",
        "summary": "Come Sure Group (Holdings) Limited, an investment holding company, engages in the manufacture and sale of corrugated paperboards and paper-based packaging products in the People's Republic of China. It operates through three segments: Corrugated Products, Offset Printed Corrugated Products, and Properties Leasing. The company also provides offset printed corrugated paper-based packaging products; holds investment properties; and offers management services. In addition, it produces and trades in molded pulp products, and corrugated paperboard and paper-based packaging products; and trades in raw papers and production supplies. The company was incorporated in 2006 and is headquartered in Chai Wan, Hong Kong. Come Sure Group (Holdings) Limited is a subsidiary of Perfect Group Version Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Chai Wan",
        "zipcode": null,
        "website": "http://www.comesure.com",
        "market_cap": "Nano Cap"
    },
    "2320.HK": {
        "short_name": "HOP FUNG GROUP",
        "long_name": "Hop Fung Group Holdings Limited",
        "summary": "Hop Fung Group Holdings Limited, an investment holding company, manufactures and sells corrugated paper ware products in the People's Republic of China and internationally. The company operates through Containerboard and Corrugated Packaging segments. The Containerboard segment offers corrugating medium and linerboards. The Corrugated Packaging segment provides corrugated paper boards and carton boxes. It also offers management and accounting services. The company was founded in 1983 and is based in Tsuen Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsuen Wan",
        "zipcode": null,
        "website": "http://www.hopfunggroup.com",
        "market_cap": "Nano Cap"
    },
    "8481.HK": {
        "short_name": "SHENGLONG INTL",
        "long_name": "Shenglong Splendecor International Limited",
        "summary": "Shenglong Splendecor International Limited, an investment holding company, manufactures and sells decorative printing materials. The company offers decorative papers, melamine impregnated papers, finish foil papers, PVC furniture films, and PVC flooring films. It also manufactures and sells craft pictures. The company's products are primarily used in furniture, cabinets, framework, door panels, fireproof boards, melamine boards, chipboards, density boards, and floorboards. It sells its products under the Splendecor brand in the People's Republic of China, Pakistan, India, Kenya, the United Arab Emirates, and internationally. The company was founded in 1993 and is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://splendecor.com",
        "market_cap": "Nano Cap"
    },
    "LMP.F": {
        "short_name": "LEE+MAN PAPER MAN.HD-,025",
        "long_name": "Lee and Man Paper Manufacturing Limited",
        "summary": "Lee and Man Paper Manufacturing Limited, an investment holding company, manufactures and trades in packaging papers, pulps, and tissue papers in the People's Republic of China, Vietnam, Malaysia, and Hong Kong. The company operates through Packaging Paper, Tissue Paper, and Pulp segments. It offers various pulp products, such as dissolved pulps for use in viscose chemical fibers, bamboo fibers, glass papers, acetate fibers, refined rayons, etc.; unbleached bamboo kraft pulps for use in ecru life papers, environmental table wares, food bags, etc.; and bleached bamboo kraft pulps for use in tissue papers, fine papers, cigarette papers, cup papers, etc. The company also provides containerboard products, including kraft and test linerboards for use in cartons, paper bags, file boxes, paperboards, wall papers, etc.; and corrugating liners for use in corrugated layer and septi-layer of paperboards, and honeycomb-like products. In addition, it offers white lined chipboards and environment friendly white linerboard coated products for use in graphic cartons, color card printing, and offset printing, as well as in packaging of commodities, household appliances, IT products, medicine/health care products, food products, toys, gifts, ceramic products, stationery products, beverages, etc.; unbleached paper for use in various applications, such as baby care, menstruation, facial, sensitive skin, table, kitchen, etc.; and toilet rolls for wiping and cleaning of hands, faces, food, etc., as well as procures raw materials. Lee and Man Paper Manufacturing Limited was founded in 1994 and is based in Kwun Tong, Hong Kong.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.leemanpaper.com",
        "market_cap": "Mid Cap"
    },
    "LMPMY": {
        "short_name": "LEE & MAN PAPER MANUFACTURING L",
        "long_name": "Lee and Man Paper Manufacturing Limited",
        "summary": "Lee and Man Paper Manufacturing Limited, an investment holding company, manufactures and trades in packaging papers, pulps, and tissue papers in the People's Republic of China, Vietnam, Malaysia, and Hong Kong. The company operates through Packaging Paper, Tissue Paper, and Pulp segments. It offers various pulp products, such as dissolved pulps for use in viscose chemical fibers, bamboo fibers, glass papers, acetate fibers, refined rayons, etc.; unbleached bamboo kraft pulps for use in ecru life papers, environmental table wares, food bags, etc.; and bleached bamboo kraft pulps for use in tissue papers, fine papers, cigarette papers, cup papers, etc. The company also provides containerboard products, including kraft and test linerboards for use in cartons, paper bags, file boxes, paperboards, wall papers, etc.; and corrugating liners for use in corrugated layer and septi-layer of paperboards, and honeycomb-like products. In addition, it offers white lined chipboards and environment friendly white linerboard coated products for use in graphic cartons, color card printing, and offset printing, as well as in packaging of commodities, household appliances, IT products, medicine/health care products, food products, toys, gifts, ceramic products, stationery products, beverages, etc.; unbleached paper for use in various applications, such as baby care, menstruation, facial, sensitive skin, table, kitchen, etc.; and toilet rolls for wiping and cleaning of hands, faces, food, etc., as well as procures raw materials. Lee and Man Paper Manufacturing Limited was founded in 1994 and is based in Kwun Tong, Hong Kong.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.leemanpaper.com",
        "market_cap": "Mid Cap"
    }
}