{
  "ABOIF": {
    "city": "Taguig City",
    "country": "Philippines",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Utilities - Regulated Electric",
    "long_name": "Aboitiz Equity Ventures, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "ABOITIZ EQUITY VENTURE INC",
    "state": null,
    "summary": "Aboitiz Equity Ventures, Inc., a conglomerate, engages in the power, banking and financial services, food, real estate, and infrastructure businesses in the Philippines. It is involved in the power generation, distribution, and retail of electricity supply; provision of banking and financial services; production of feeds and flour, hog and layer farm, and animal nutrition products; development of residential, commercial, and industrial communities, as well as development and operation of economic zones; and operation of airports. The company also offers water and wastewater-related services to residential, commercial, and industrial customers; digital infrastructure services; operates regional airports; operates integrated economic center projects; and manufactures and distributes cement. In addition, it provides aviation services; insurance products; and portfolio investment services. The company was formerly known as Cebu Pan Asian Holdings, Inc. and changed its name to Aboitiz Equity Ventures, Inc. in December 1993. Aboitiz Equity Ventures, Inc. was incorporated in 1989 and is headquartered in Taguig City, the Philippines.",
    "website": "http://aboitiz.com/about-us/aboitiz-equity-ventures/",
    "zipcode": "1634"
  },
  "ABTZY": {
    "city": "Taguig City",
    "country": "Philippines",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Utilities - Regulated Electric",
    "long_name": "Aboitiz Equity Ventures, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "ABOITIZ EQUITY VENTURE INC",
    "state": null,
    "summary": "Aboitiz Equity Ventures, Inc., a conglomerate, engages in the power, banking and financial services, food, real estate, and infrastructure businesses in the Philippines. It is involved in the power generation, distribution, and retail of electricity supply; provision of banking and financial services; production of feeds and flour, hog and layer farm, and animal nutrition products; development of residential, commercial, and industrial communities, as well as development and operation of economic zones; and operation of airports. The company also offers water and wastewater-related services to residential, commercial, and industrial customers; digital infrastructure services; operates regional airports; operates integrated economic center projects; and manufactures and distributes cement. In addition, it provides aviation services; insurance products; and portfolio investment services. The company was formerly known as Cebu Pan Asian Holdings, Inc. and changed its name to Aboitiz Equity Ventures, Inc. in December 1993. Aboitiz Equity Ventures, Inc. was incorporated in 1989 and is headquartered in Taguig City, the Philippines.",
    "website": "http://aboitiz.com/about-us/aboitiz-equity-ventures/",
    "zipcode": "1634"
  },
  "ABZPF": {
    "city": "Taguig City",
    "country": "Philippines",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Utilities - Regulated Electric",
    "long_name": "Aboitiz Power Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "ABOITIZ POWER CORPORATION",
    "state": null,
    "summary": "Aboitiz Power Corporation, through its subsidiaries, engages in the power generation, distribution, and retail electricity businesses in the Philippines. It operates hydropower, geothermal, solar, coal, and oil power plants. The company sells its electricity through bilateral contracts with private distribution utilities, electric cooperatives, and industrial and commercial companies, as well as Wholesale Electricity Spot market. It also distributes electricity to the industrial, residential, commercial, and other customers; and has interests in nine distribution utilities that supply electricity to franchise areas covering 18 cities and municipalities in Luzon, Visayas, and Mindanao. In addition, the company is involved in the retail of electricity to various industries, including property development, meat processing, semiconductors, steel, and cement; and provision of electricity-related services, such as installation of electrical equipment. As of February 28, 2021, it owns 4,429 megawatts of net attributable capacity. The company was incorporated in 1998 and is headquartered in Taguig City, the Philippines. Aboitiz Power Corporation is a subsidiary of Aboitiz Equity Ventures, Inc.",
    "website": "http://www.aboitizpower.com",
    "zipcode": "1634"
  },
  "ABZPY": {
    "city": "Taguig City",
    "country": "Philippines",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Utilities - Regulated Electric",
    "long_name": "Aboitiz Power Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "ABOITIZ POWER CORPORATION",
    "state": null,
    "summary": "Aboitiz Power Corporation, through its subsidiaries, engages in the power generation, distribution, and retail electricity businesses in the Philippines. It operates hydropower, geothermal, solar, coal, and oil power plants. The company sells its electricity through bilateral contracts with private distribution utilities, electric cooperatives, and industrial and commercial companies, as well as Wholesale Electricity Spot market. It also distributes electricity to the industrial, residential, commercial, and other customers; and has interests in nine distribution utilities that supply electricity to franchise areas covering 18 cities and municipalities in Luzon, Visayas, and Mindanao. In addition, the company is involved in the retail of electricity to various industries, including property development, meat processing, semiconductors, steel, and cement; and provision of electricity-related services, such as installation of electrical equipment. As of February 28, 2021, it owns 4,429 megawatts of net attributable capacity. The company was incorporated in 1998 and is headquartered in Taguig City, the Philippines. Aboitiz Power Corporation is a subsidiary of Aboitiz Equity Ventures, Inc.",
    "website": "http://www.aboitizpower.com",
    "zipcode": "1634"
  },
  "FSGCY": {
    "city": "Pasig",
    "country": "Philippines",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Utilities - Renewable",
    "long_name": "First Gen Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "FIRST GEN CORPORATION",
    "state": null,
    "summary": "First Gen Corporation, through its subsidiaries, engages in the power generation business in Philippines. As of December 31, 2020, the company had an installed capacity of 3,492 megawatts (MW). It operates through FGPC, FGP, FNPC, Prime Meridian, EDC and Subsidiaries, and FG Hydro segments. The FGPC segment operates Santa Rita, a 1,000 MW combined cycle, natural gas-fired power plant. The FGP segment operates San Lorenzo, a 500 MW combined cycle, natural gas-fired power plant. The FNPC segment owns and operates San Gabriel, a 420 MW natural gas-fired power flex plant. The Prime Meridian segment owns and operates Avion plant, a 97 MW open-cycle natural gas-fired power plant. The EDC and Subsidiaries segment holds service contracts with the Department of Energy to explore, develop, and utilize the resources in the relevant 10 geothermal contract areas. It also owns a 150 MW Burgos Wind and 6.82 MW Burgos Solar power plants that are situated in Burgos, Ilocos Norte. FG Hydro segment operates Pantabangan-Masiway, a 132 MW Hydroelectric Plant. It serves electric cooperatives, privately-owned distribution utilities, and large industrial clients. The company has a joint cooperation agreement with Tokyo Gas Co., Ltd to pursue the design, development, testing, commissioning, construction, ownership, and operations and maintenance of the IOT Project. First Gen Corporation was incorporated in 1998 and is based in Pasig, the Philippines. First Gen Corporation is a subsidiary of First Philippine Holdings Corporation.",
    "website": "http://www.firstgen.com.ph",
    "zipcode": "1604"
  },
  "MAEOY": {
    "city": "Pasig",
    "country": "Philippines",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Utilities - Renewable",
    "long_name": "Manila Electric Company",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "MANILA ELECTRIC CO",
    "state": null,
    "summary": "Manila Electric Company, together with its subsidiaries, holds a congressional franchise to construct, operate, and maintain an electric distribution system in the Philippines. The company operates in two segments, Power and Other Services. It offers power to approximately 7.1 million industrial, commercial, and residential customers in 36 cities and 75 municipalities, including Metro Manila; the provinces of Rizal, Cavite, and Bulacan; and parts of the provinces of Pampanga, Batangas, Laguna, and Quezon; distributes power to 2,613 customers in Clark Special Economic Zone; and develops, finances, constructs, and operates solar-powered generation facilities, as well as owns coal and diesel-fired and liquefied natural gas power plants. The company also provides electromechanical engineering, construction, consulting, and related manpower services; rail-related operations and maintenance services; insurance and re-insurance services; e-business development; power distribution management; and electric vehicle and charging infrastructure solutions, as well as consultancy, engineering, and integration services to telecommunication service providers. In addition, it offers engineering, procurement, and construction services; testing and commissioning services; building and facilities management and renovation services; vehicle leasing and fleet management services; and undertakes electrical, foundation, waterproofing, and general engineering and building works. Further, the company provides e-transaction, outsourced payment collection, outsourced tellering, and other administrative services; energy efficiency and urban services, such as energy management system, smart street lighting, sewage treatment plant, and HVAC and lighting solutions; and data connectivity solutions, as well as engages in the energy sourcing and trading, and wholesale contracting and aggregating of electricity. Manila Electric Company was founded in 1903 and is based in Pasig, the Philippines.",
    "website": "http://www.meralco.com.ph",
    "zipcode": "1605"
  },
  "MWTCF": {
    "city": "Quezon City",
    "country": "Philippines",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Utilities - Regulated Water",
    "long_name": "Manila Water Company, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "MANILA WATER COMPANY",
    "state": null,
    "summary": "Manila Water Company, Inc., together with its subsidiaries, provides water treatment, water distribution, sewerage, and sanitation services to residential, commercial, industrial, and semi-business customers in the Philippines, Thailand, Vietnam, Indonesia, and internationally. It also offers water supply system, used water treatment, sewerage and sanitation as well as sells packaged purified water in selected areas in Metro Manila; and bulk water in the province of Cebu. The company provides its services to approximately seven million people in the six encompassing 23 cities and municipalities, including Makati, Mandaluyong, Pasig, Pateros, San Juan, Taguig, Marikina, Quezon City, and Manila, as well as various towns of Rizal; including Angono, Antipolo, Baras, Binangonan, Cainta, Cardona, Jala-Jala, Morong, Pililia, Rodriguez, San Mateo, Tanay, Taytay, and Teresa.. Manila Water Company, Inc. was incorporated in 1997 and is based in Quezon City, the Philippines. Manila Water Company, Inc. is a subsidiary of Ayala Corporation.",
    "website": "http://www.manilawater.com",
    "zipcode": "1105"
  },
  "MWTCY": {
    "city": "Quezon City",
    "country": "Philippines",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Utilities - Regulated Water",
    "long_name": "Manila Water Company, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "MANILA WATER COMPANY",
    "state": null,
    "summary": "Manila Water Company, Inc., together with its subsidiaries, provides water treatment, water distribution, sewerage, and sanitation services to residential, commercial, industrial, and semi-business customers in the Philippines, Thailand, Vietnam, Indonesia, and internationally. It also offers water supply system, used water treatment, sewerage and sanitation as well as sells packaged purified water in selected areas in Metro Manila; and bulk water in the province of Cebu. The company provides its services to approximately seven million people in the six encompassing 23 cities and municipalities, including Makati, Mandaluyong, Pasig, Pateros, San Juan, Taguig, Marikina, Quezon City, and Manila, as well as various towns of Rizal; including Angono, Antipolo, Baras, Binangonan, Cainta, Cardona, Jala-Jala, Morong, Pililia, Rodriguez, San Mateo, Tanay, Taytay, and Teresa.. Manila Water Company, Inc. was incorporated in 1997 and is based in Quezon City, the Philippines. Manila Water Company, Inc. is a subsidiary of Ayala Corporation.",
    "website": "http://www.manilawater.com",
    "zipcode": "1105"
  }
}
