{
    "ABTZY": {
        "short_name": "ABOITIZ EQUITY VENTURE INC",
        "long_name": "Aboitiz Equity Ventures, Inc.",
        "summary": "Aboitiz Equity Ventures, Inc., a conglomerate, engages in the power, banking and financial services, food, real estate, and infrastructure businesses in the Philippines. It is involved in the power generation, distribution, and retail electricity supply; provision of banking and financial services; produces of feeds and flour, hog and layer farm, and animal nutrition products; development of residential, commercial, and industrial communities, as well as develops and operates economic zones; and operation of airports. The company also offers water supply and distribution services to residential, commercial, and industrial customers, as well as wastewater treatment services and water-related infrastructure; and manufactures and supplies building materials and products, which include cement. In addition, it provides aviation services; insurance products; and portfolio investment services. The company was formerly known as Cebu Pan Asian Holdings, Inc. and changed its name to Aboitiz Equity Ventures, Inc. in December 1993. Aboitiz Equity Ventures, Inc. was incorporated in 1989 and is headquartered in Taguig, the Philippines.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Electric",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Philippines",
        "city": "Taguig City"
    },
    "ABZPY": {
        "short_name": "ABOITIZ POWER CORPORATION",
        "long_name": "Aboitiz Power Corporation",
        "summary": "Aboitiz Power Corporation, through its subsidiaries, engages in the power generation, distribution, and retail business in the Philippines. The company operates hydropower, geothermal, solar, coal, and oil power plants. It sells its electricity through bilateral contracts with private distribution utilities, electric cooperatives, and industrial and commercial companies, as well as Wholesale Electricity Spot market. The company also distributes electricity to the industrial, residential, commercial, and other customers; and has interests in 9 distribution utilities that supply electricity to franchise areas covering 18 cities and municipalities in Luzon, Visayas, and Mindanao. In addition, it is involved in the retail of electricity to various industries, including property development, meat processing, semiconductors, steel, and cement. The company was founded in 1998 and is headquartered in Taguig City, the Philippines. Aboitiz Power Corporation is a subsidiary of Aboitiz Equity Ventures, Inc.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Electric",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Philippines",
        "city": "Taguig City"
    },
    "FPHHF": {
        "short_name": "FIRST PHILIPPINE HLDGS",
        "long_name": "First Philippine Holdings Corporation",
        "summary": "First Philippine Holdings Corporation engages in the power generation business in the Philippines. The company operates through Power Generation, Real Estate Development, Manufacturing, and Construction and Others Services segments. It generates power through natural gas-fired, hydroelectric, geothermal, and wind and solar power plants. The company develops residential and commercial projects; operates cinema and hotels, as well as involved in the retail and office leasing activities; develops and manages industrial estate; and leases, owns, acquires, and sells real and personal properties, and land. It also manufactures current, dry-type, and small kilo-volt ampere distribution transformers; distribution and power transformers, automatic voltage regulators, and special line equipment, as well as offers technical services. In addition, the company engages in the construction of power plants, transmission lines, public infrastructure, and electro-mechanical works; provides services for the drilling and workover of exploratory or development geothermal wells; rents and leases trucks, tractors, vans, buses, trailers, and light and heavy equipment for use in transportation, construction, and related services; and produces crush concrete aggregates and other related products. Further, it is involved in the hauling, trucking, and delivery of various goods and materials; quarrying and production of rocks, stones, and other related products; oil transporting, securities transfer, medical and research, education, financing, and others activities; and constructs and operates liquid or gas pipeline. The company was formerly known as Meralco Securities Corporation and changed its name to First Philippine Holdings Corporation in September 1972. The company was founded in 1961 and is based in Pasig, the Philippines. First Philippine Holdings Corporation is a subsidiary of Lopez, Inc.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Electric",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Philippines",
        "city": "Pasig"
    }
}