{
    "MAEOY": {
        "short_name": "MANILA ELECTRIC CO",
        "long_name": "Manila Electric Company",
        "summary": "Manila Electric Company, together with its subsidiaries, holds a congressional franchise to construct, operate, and maintain an electric distribution system in the Philippines. The company operates in two segments, Power and Other Services. It offers power to approximately 6.8 million industrial, commercial, and residential customers in 36 cities and 75 municipalities, including Metro Manila; the provinces of Rizal, Cavite, and Bulacan; and parts of the provinces of Pampanga, Batangas, Laguna, and Quezon. The company also provides engineering, procurement, construction, and maintenance services related to power generation, transmission, and distribution, as well as industrial plants, water resources, and telecommunications; and testing, commissioning, and distribution utility operation and maintenance services, as well as handles architectural and fit-out construction works, including building and facilities logistics management services. In addition, it holds a congressional telecommunications franchise to construct, install, establish, operate, and maintain for commercial purposes; and basic and enhanced telecommunications services in the Philippines, and between the Philippines and other countries and territories. Further, the company invests in and manages commercial centers; owns, builds, develops, and operates a portfolio of power plants; and generates and retails electricity. Additionally, it provides electro-mechanical engineering, construction, consulting and related manpower, e-transaction, bills collection, telecom, rail-related operations and maintenance, insurance and reinsurance, e-business development, power distribution and energy systems management, renewable energy, and electric vehicle and charging infrastructure solutions, as well as information system/technology and consultancy services. Manila Electric Company was founded in 1903 and is based in Pasig, the Philippines.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Philippines",
        "city": "Pasig"
    }
}