{
    "BABAN.MX": {
        "short_name": "ALIBABA GROUP HOLDING LTD",
        "long_name": "Alibaba Group Holding Limited",
        "summary": "Alibaba Group Holding Limited, through its subsidiaries, provides online and mobile commerce businesses in the People's Republic of China and internationally. It operates through four segments: Core Commerce, Cloud Computing, Digital Media and Entertainment, and Innovation Initiatives and Others. The company operates Taobao Marketplace, a mobile commerce destination; Tmall, a third-party online and mobile commerce platform for brands and retailers; Alibaba Health Internet platforms for pharmaceutical and healthcare products; Alimama, a monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, an e-commerce platform; and Tmall Global, an import e-commerce platform. It also operates Lingshoutong, a digital sourcing platform; Cainiao Network logistic services platform; Ele.me, a delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, the company offers pay-for-performance and display marketing services; and Taobao Ad Network and Exchange, a real-time bidding online marketing exchange. Further, it provides elastic computing, database, storage, virtualization network, large-scale computing, security, management and application, big data analytics, and Internet of Things and other services for enterprises; payment and escrow services; and movies, television series, variety shows, animations, and other video content. Additionally, the company operates Youku, an online video platform; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency app; and Tmall Genie, an AI-powered smart speaker. The company was founded in 1999 and is based in Hangzhou, the People's Republic of China.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Specialty Retail, Other",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "JDN.MX": {
        "short_name": "JD.COM INC",
        "long_name": "JD.com, Inc.",
        "summary": "JD.com, Inc. operates as an e-commerce company and retail infrastructure service provider in the People's Republic of China. It operates in two segments, JD Retail and New Businesses. The company offers home appliances; mobile handsets and other digital products; desktop, laptop, and other computers, as well as printers and other office equipment; furniture and household goods; apparel; cosmetics, personal care items, and pet products; women's shoes, bags, jewelry, and luxury goods; men's shoes, sports gears, and fitness equipment; automobiles and accessories; maternal and childcare products, toys, and musical instruments; and food, beverage, and fresh produce. It also provides gifts, flowers, and plants; pharmaceutical and healthcare products, including OCT pharmaceutical products, nutritional supplements, healthcare services, and other healthcare equipment; books, e-books, music, movie, and other media products; and virtual goods, such as online travel agency, attraction tickets, and prepaid phone and game cards, as well as industrial products and installation and maintenance services. In addition, the company offers an online marketplace for third-party merchants to sell products to customers; and transaction processing and billing, and other services. Further, it provides online marketing services for suppliers, third-party merchants, and other business partners; supply chain and logistics services for various industries; and consumer financing services to individual customers, as well as online-to-offline solutions. JD.com, Inc. offers its products through its website jd.com and mobile apps, as well as directly to customers. As of December 31, 2020, JD.com, Inc. operated fulfillment centers with a network of approximately 900 warehouses in various counties and districts in China. The company has strategic cooperation agreement with Tencent Holdings Limited. JD.com, Inc. was incorporated in 2006 and is headquartered in Beijing, China.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Specialty Retail, Other",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "China",
        "city": "Beijing"
    },
    "VIPSN.MX": {
        "short_name": "VIPSHOP HLDGS LTD",
        "long_name": "Vipshop Holdings Limited",
        "summary": "Vipshop Holdings Limited operates as an online discount retailer for various brands in the People's Republic of China. It operates in Vip.com, Shan Shan Outlets, and Others segments. The company offers women's apparel, such as casual wear, jeans, dresses, outerwear, lingerie, pajamas, and maternity clothes; men's apparel comprising casual and smart-casual T-shirts, polo shirts, jackets, pants, and underwear; skin care and cosmetic products, including cleansers, lotions, face and body creams, face masks, sunscreen, foundations, lipsticks, eye shadows, and other cosmetics-related items; and accessories that include belts, jewelry, watches, and glasses for women and men. It also provides handbags, which comprise purses, satchels, luggage, duffel bags, and wallets; apparel, gears and accessories, furnishings and decor, toys, and games for boys, girls, infants, and toddlers; sportswear, sports gear, and footwear for tennis, badminton, soccer, swimming, and other sporting activities; home furnishings, such as bed and bath products, home decor, kitchen and tabletop items, and small household appliances; and consumer electronic products. Further, it provides designer apparel, footwear, and accessories; food and snacks, beverages, health supplements; home appliances; beauty products, fresh produce, and pet goods; and internet finance services, which comprise consumer and supplier financing, and microcredit. The company offers its branded products through its vip.com and vipshop.com online platforms, as well as through its internet website and cellular phone application. Additionally, it offers warehousing, logistics, product procurement, research and development, technology development, and consulting services. Vipshop Holdings Limited was founded in 2008 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Specialty Retail, Other",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "China",
        "city": "Guangzhou"
    }
}