{
    "AJMERA.NS": {
        "short_name": "AJMERA REALTY & IN",
        "long_name": "Ajmera Realty & Infra India Limited",
        "summary": "Ajmera Realty & Infra India Limited, together with its subsidiaries, engages in the real estate business in India, the United Kingdom, and Bahrain. It develops residential and commercial projects. The company was founded in 1985 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400053",
        "website": "http://www.aril.co.in",
        "market_cap": 5901015040
    },
    "AMJLAND.NS": {
        "short_name": "AMJ LAND HOLDINGS",
        "long_name": "AMJ Land Holdings Limited",
        "summary": "AMJ Land Holdings Limited, together with its subsidiary, develops and leases real estate properties in India. It operates through Real Estate Business, Wind Power Generation, and Investment segments. The company develops properties for residential housing and commercial spaces. It also operates 3 wind power plants with an aggregate generation capacity of 4.6 MW located at Satara and Sangli in Maharashtra. The company was formerly known as Pudumjee Pulp & Paper Mills Limited and changed its name to AMJ Land Holdings Limited in December 2017. AMJ Land Holdings Limited was incorporated in 1964 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400001",
        "website": "http://www.amjland.com",
        "market_cap": 1271187840
    },
    "ANANTRAJ.NS": {
        "short_name": "ANANT RAJ LTD",
        "long_name": "Anant Raj Limited",
        "summary": "Anant Raj Limited primarily develops and constructs information and technology parks, hospitality projects, special economic zones, office complexes, shopping malls, and residential projects in Delhi, Haryana, Rajasthan, and the National Capital Region in India. The company also leases and rents commercial properties. The company was formerly known as Anant Raj Industries Limited and changed its name to Anant Raj Limited in October 2012. Anant Raj Limited was founded in 1969 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.anantrajlimited.com",
        "market_cap": 18763489280
    },
    "ANSALAPI.NS": {
        "short_name": "ANSAL PROPS & INFR",
        "long_name": "Ansal Properties & Infrastructure Limited",
        "summary": "Ansal Properties & Infrastructure Limited, together with its subsidiaries, engages in the real estate development business in India. The company develops integrated townships, condominiums, group housings, malls, shopping complexes, hotels, clubs, SEZs, IT parks, and infrastructure and utility services, as well as other mixed-use and standalone developments in the residential, commercial, retail, and hospitality segments. It also provides facilities management services. The company was founded in 1967 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.ansalapi.com",
        "market_cap": 1442781056
    },
    "ANSALHSG.NS": {
        "short_name": "ANSAL HOUSING LTD",
        "long_name": "Ansal Housing Limited",
        "summary": "Ansal Housing Limited, together with its subsidiaries, engages in the development and construction of real estate properties in India. Its project portfolio includes townships, residential and commercial complexes, multistoried buildings, flats, houses, apartments, shopping malls, hotels, and movie halls. The company also operates restaurants under The Great Kabab Factory brand name. The company was formerly known as Ansal Housing & Construction Limited and changed its name to Ansal Housing Limited in December 2018. Ansal Housing Limited was founded in 1983 and is headquartered in Ghaziabad, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ghaziabad",
        "zipcode": "201010",
        "website": "http://www.ansals.com",
        "market_cap": 504779296
    },
    "ARIHANT.NS": {
        "short_name": "ARIHANT FOUNDATION",
        "long_name": "Arihant Foundations & Housing Limited",
        "summary": "Arihant Foundations & Housing Limited primarily engages in real estate development and related activities in India. The company develops and constructs residential properties, commercial complexes, and IT parks. Arihant Foundations & Housing Limited was incorporated in 1992 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600018",
        "website": "http://www.arihantfoundations.com",
        "market_cap": 178444896
    },
    "ARIHANTSUP.NS": {
        "short_name": "ARIHANT SUPERSTRUC",
        "long_name": "Arihant Superstructures Limited",
        "summary": "Arihant Superstructures Limited operates as a real estate development company in India. The company's operations comprise various aspects of real estate development comprising identification and acquisition of land, planning, execution, construction, and marketing of projects. Its projects include residential properties, studios, 1 BHK flats, 2 BHK flats, 3 BHK flats, 4 BHK flats, apartments, and lands. The company was formerly known as Shaktiman Constructions Limited and changed its name to Arihant Superstructures Ltd. in August 2009. Arihant Superstructures Limited was incorporated in 1983 and is based in Navi Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Navi Mumbai",
        "zipcode": "400705",
        "website": "http://www.asl.net.in",
        "market_cap": 4112891392
    },
    "ARVSMART.NS": {
        "short_name": "ARVIND SMARTSPACES",
        "long_name": "Arvind SmartSpaces Limited",
        "summary": "Arvind SmartSpaces Limited engages in the development of real estate projects in India. It develops residential, commercial, and industrial projects in Ahmedabad, Pune, and Bengaluru. The company was formerly known as Arvind Infrastructure Limited and changed its name to Arvind SmartSpaces Limited in November 2016. Arvind SmartSpaces Limited was incorporated in 2008 and is headquartered in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380009",
        "website": "http://arvindsmartspaces.com",
        "market_cap": 4039635200
    },
    "ASHIANA.NS": {
        "short_name": "ASHIANA HOUSING LD",
        "long_name": "Ashiana Housing Limited",
        "summary": "Ashiana Housing Limited, through its subsidiaries, engages in the real estate business in India. The company develops comfort homes in Bhiwadi, Halol, Jaipur, Jamshedpur, Neemrana, and Jodhpur cities; senior living homes in Bhiwadi, Lavasa, Jaipur, and Chennai cities; kid centric homes in Bhiwadi, Jaipur, and Sohna cities; and care homes in Bhiwadi and Jaipur cities. It also engages in the resale and rental of properties; and the provision of maintenance services. The company was formerly known as Ashiana Housing and Finance (India) Limited and changed its name to Ashiana Housing Limited in May 2007. Ashiana Housing Limited was founded in 1979 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110017",
        "website": "http://www.ashianahousing.com",
        "market_cap": 14192159744
    },
    "BHAGYAPROP.NS": {
        "short_name": "BHAGYANAGAR PROPPE",
        "long_name": "Bhagyanagar Properties Limited",
        "summary": "Bhagyanagar Properties Limited engages in the development of real estate properties in India. It also engages in buying, selling, and leasing properties. The company was incorporated in 2006 and is based in Secunderabad, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Secunderabad",
        "zipcode": "500003",
        "website": "http://www.bhagyanagarproperties.com",
        "market_cap": 902259008
    },
    "BOMDYEING.NS": {
        "short_name": "BOMBAY DYEING &MFG",
        "long_name": "The Bombay Dyeing and Manufacturing Company Limited",
        "summary": "The Bombay Dyeing and Manufacturing Company Limited produces and sells polyester staple fiber products in India. It operates through Real Estate, Polyester, and Retail/Textile segments. The company is also involved in the manufacture of textile grade PET chips; and retail of home textiles. In addition, it develops real estate properties, such as residences, offices, hotels, serviced apartments, hospitals, schools, and retail facilities. The company exports its products to Europe, North and South America, the Middle East, Africa, and Asia. The Bombay Dyeing and Manufacturing Company Limited was founded in 1879 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400038",
        "website": "http://bombaydyeing.com",
        "market_cap": 16089077760
    },
    "BRIGADE.NS": {
        "short_name": "BRIGADE ENTERPRISE",
        "long_name": "Brigade Enterprises Limited",
        "summary": "Brigade Enterprises Limited provides real estate development, leasing, and hospitality and related services in India. The company operates in three segments: Real Estate, Hospitality, and Leasing. The Real Estate segment develops and sells various residential and commercial properties. The Hospitality segment develops and manages hospitality projects, including serviced residence facilities, clubs, hotels, resorts, and convention centers. This segment also provides celebrations catering and event services; and operates The Baking Company, an in-house bakery. The Leasing segment is involved in leasing office and retail spaces. Brigade Enterprises Limited was founded in 1986 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560055",
        "website": "http://www.brigadegroup.com",
        "market_cap": 58895360000
    },
    "BSELINFRA.NS": {
        "short_name": "BSEL INFRASTRUCTUR",
        "long_name": "BSEL Infrastructure Realty Limited",
        "summary": "BSEL Infrastructure Realty Limited develops, operates, and maintains real estate properties and related activities in India and the United Arab Emirates. The company was formerly known as BSEL Information System Limited and changed its name to BSEL Infrastructure Realty Limited in August 2003. BSEL Infrastructure Realty Limited was founded in 1995 and is based in Navi Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Navi Mumbai",
        "zipcode": "400705",
        "website": "http://www.bsel.com",
        "market_cap": 141614960
    },
    "CINELINE.NS": {
        "short_name": "CINELINE INDIA LTD",
        "long_name": "Cineline India Limited",
        "summary": "Cineline India Limited, together with its subsidiaries, engages in the ownership and leasing of real estate properties in India. It is involved in renting out commercial and retail properties, and parking and advertising spaces in high-street malls. The company owns and leases nine theatres, which include seven in and around Mumbai, as well as one each in Nasik and Nagpur to PVR Cinemas; and owns a mall under the Eternity Mall name located in Nagpur, as well as provides maintenance services. It also generates renewable energy through a windmill with capacity of 0.6 MWA located at Viswada in Gujarat; and a windmill with capacity of 1.6 MWA situated at Revangaon in Maharashtra. The company was formerly known as Cinemax Properties Limited and changed its name to Cineline India Limited in March 2013. Cineline India Limited was incorporated in 2002 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400093",
        "website": "http://www.cineline.co.in",
        "market_cap": 1246194432
    },
    "COUNCODOS.NS": {
        "short_name": "COUNTRY CONDO'S",
        "long_name": "Country Condo's Limited",
        "summary": "Country Condo's Limited engages in the real estate business in India. It develops and sells residential layouts; and constructs compound walls, etc. The company was formerly known as Neocure Therapeutics Ltd. and changed its name to Country Condo's Limited in April 2007. Country Condo's Limited was incorporated in 1987 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500034",
        "website": "http://www.countrycondos.co.in",
        "market_cap": 257290432
    },
    "DBREALTY.NS": {
        "short_name": "DB REALTY LTD",
        "long_name": "D B Realty Limited",
        "summary": "D B Realty Limited operates as a real estate development company in India. It develops residential projects, including condominiums and duplexes; and commercial, retail, and other projects, such as mass housing and cluster redevelopment. The company was incorporated in 2007 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400011",
        "website": "http://www.dbrealty.co.in",
        "market_cap": 6580155904
    },
    "DLF.NS": {
        "short_name": "DLF LIMITED",
        "long_name": "DLF Limited",
        "summary": "DLF Limited, together with its subsidiaries, engages in the business of colonization and real estate development in India. Its activities include identification and acquisition of land; and planning, execution, construction, and marketing of projects. The company develops and sells residential properties, such as plotted developments, houses, and villas and apartments; and commercial and retail properties. It also engages in the lease of developed office space, ITes, and retail properties. In addition, the company owns and operates The Lodhi hotel and the Hilton Garden Inn in New Delhi; and golf and country clubs. Further, it engages in the provision of maintenance services; generation and sale of power; and recreational activities. DLF Limited was founded in 1946 and is based in Gurugram, India. DLF Limited operates as a subsidiary of Rajdhani Investments & Agencies Private Limited.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122002",
        "website": "http://www.dlf.in",
        "market_cap": 767159762944
    },
    "EMAMIREAL.NS": {
        "short_name": "EMAMI REALTY LTD",
        "long_name": "Emami Realty Limited",
        "summary": "Emami Realty Limited engages in the construction and real estate development business in India. It undertakes projects in residential, commercial, and retail sectors. The company was formerly known as Emami Infrastructure Limited and changed its name to Emami Realty Limited in October 2018. Emami Realty Limited was incorporated in 2006 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700107",
        "website": "http://www.emamirealty.com",
        "market_cap": 1648395136
    },
    "FMNL.NS": {
        "short_name": "FUTURE MKT NETWORK",
        "long_name": "Future Market Networks Limited",
        "summary": "Future Market Networks Limited, together with its subsidiaries, engages in the development and management of commercial, retail, and infra logistic projects in India. It also constructs, develops, and sells integrated large-scale warehouses. The company was formerly known as Agre Developers Limited and changed its name to Future Market Networks Limited in February 2012. The company was incorporated in 2008 and is based in Mumbai, India. Future Market Networks Limited is a subsidiary of Future Corporate Resources Private Limited.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400064",
        "website": "http://www.fmn.co.in",
        "market_cap": 951972032
    },
    "GANESHHOUC.NS": {
        "short_name": "GANESH HOUSING CP",
        "long_name": "Ganesh Housing Corporation Limited",
        "summary": "Ganesh Housing Corporation Limited engages in the real estate and construction businesses in India. It is involved in the promotion and development of residential, commercial, retail, and township projects. As of March 31, 2020, the company had a land bank of approximately 639.13 acres. It also constructs infrastructure projects. The company was formerly known as Ganesh Housing Finance Corporation Limited. Ganesh Housing Corporation Limited was founded in 1991 and is headquartered in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380054",
        "website": "http://www.ganeshhousing.com",
        "market_cap": 4610559488
    },
    "GEECEE.NS": {
        "short_name": "GEECEE VENTURES",
        "long_name": "GeeCee Ventures Limited",
        "summary": "Geecee Ventures Limited engages in the real estate development, wind power generation, and financing and investing businesses in India. The company was formerly known as Gwalior Chemical Industries Limited and changed its name to Geecee Ventures Limited in January 2010. Geecee Ventures Limited was incorporated in 1984 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.geeceeventures.com",
        "market_cap": 2871516928
    },
    "GODREJPROP.NS": {
        "short_name": "GODREJ PROPERTIES",
        "long_name": "Godrej Properties Limited",
        "summary": "Godrej Properties Limited, together with its subsidiaries, primarily engages in the real estate construction, development, and other related activities in India. It develops residential, commercial, and township projects. Godrej Properties Limited was incorporated in 1985 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400079",
        "website": "http://www.godrejproperties.com",
        "market_cap": 390093012992
    },
    "HDIL.NS": {
        "short_name": "HOUSING DEVELOPMEN",
        "long_name": "Housing Development and Infrastructure Limited",
        "summary": "Housing Development and Infrastructure Limited engages in the real estate construction, development, and other related activities in India. Its residential projects include apartment complexes, towers, and townships; commercial projects comprise office spaces and multiplex cinemas; and retail projects consists of shopping malls. The company also develops slum rehabilitation projects. Housing Development and Infrastructure Limited was incorporated in 1996 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400050",
        "website": "http://www.hdil.in",
        "market_cap": 3270235648
    },
    "HEMIPROP.NS": {
        "short_name": "Hemisphere Prop Ind Ltd",
        "long_name": "Hemisphere Properties India Limited",
        "summary": "Hemisphere Properties India Limited operates as a real estate company in India. It owns or leases various properties, as well as has access to 739.69 acres of land. The company was incorporated in 2005 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://hpil.co.in",
        "market_cap": 43827949568
    },
    "HUBTOWN.NS": {
        "short_name": "HUBTOWN LIMITED",
        "long_name": "Hubtown Limited",
        "summary": "Hubtown Limited constructs and develops real estate properties in India. It develops residential and commercial premises. The company was formerly known as Ackruti City Limited and changed its name to Hubtown Limited in November 2011. Hubtown Limited was incorporated in 1989 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400007",
        "website": "http://www.hubtown.co.in",
        "market_cap": 2115857280
    },
    "IBREALEST.NS": {
        "short_name": "INDIABULLS REAL ES",
        "long_name": "Indiabulls Real Estate Limited",
        "summary": "Indiabulls Real Estate Limited operates as a real estate company in India. The company is involved in the purchase, development, construction, and sale of real estate projects, as well as other related activities; and provision of consultancy and advisory services to companies engaged in the development and construction of real estate and infrastructure projects. Its project portfolio includes residential and commercial, as well as SEZ projects. Indiabulls Real Estate Limited was incorporated in 2006 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.indiabullsrealestate.com",
        "market_cap": 49908781056
    },
    "KARDA.NS": {
        "short_name": "KARDA CONSTRUCTIO.",
        "long_name": "Karda Constructions Limited",
        "summary": "Karda Constructions Limited develops real estate properties in India. The company develops and sells residential and residential and office projects. It also undertakes construction contracts. The company was founded in 1994 and is based in Nashik, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Nashik",
        "zipcode": "422005",
        "website": "http://www.kardaconstruction.com",
        "market_cap": 11110250496
    },
    "KOLTEPATIL.NS": {
        "short_name": "KOLTE-PATIL DEVELO",
        "long_name": "Kolte-Patil Developers Limited",
        "summary": "Kolte-Patil Developers Limited operates as a real estate company in India. It constructs and develops residential projects, commercial and retail projects, IT parks, and integrated townships; rents immovable properties; and provides project management services for managing and developing real estate projects. The company markets its projects under the Kolte-Patil and 24K brands. Kolte-Patil Developers Limited was founded in 1991 and is based in Pune, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411001",
        "website": "http://www.koltepatil.com",
        "market_cap": 18763782144
    },
    "LODHA.NS": {
        "short_name": "Macrotech Developers Ltd",
        "long_name": "Macrotech Developers Limited",
        "summary": "Macrotech Developers Limited, through its subsidiaries, engages in the construction and development of residential and commercial real estate properties in India and the United Kingdom. Its residential portfolio includes affordable, mid-income, and premium and luxury housing projects; and commercial portfolio comprises office and retail projects. The company also develops logistics and industrial parks. It develops and markets its affordable and mid-income housing projects under the CASA by Lodha and Crown Â\u0096 Lodha Quality Homes brands; premium and luxury projects under the Lodha and Lodha Luxury brands; and office spaces under the iThink, Lodha Excelus, and Lodha Supremus brands. As of December 31, 2020, the company had 36 ongoing projects with a developable area of 28.78 million square feet; 18 planned projects with a developable area of 54 million square feet; and land reserves of approximately 3,803 acres. It is also involved in the non-banking financial company, project management, marketing and sales, and support activities. The company was formerly known as Lodha Developers Limited and changed its name to Macrotech Developers Limited in May 2019. Macrotech Developers Limited was founded in 1980 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400011",
        "website": "http://www.lodhagroup.in",
        "market_cap": 299313332224
    },
    "LPDC.NS": {
        "short_name": "LANDMARK PROP DEV",
        "long_name": "Landmark Property Development Company Limited",
        "summary": "Landmark Property Development Company Limited engages in the real estate development business in India. It also offers advisory and consultancy services to overseas investors for investment reports, including presentation of the financial and economic aspects of the proposed investment, business plans for the proposed investment, and various other information requested by the advisee. The company was formerly known as Konark Minerals Limited and changed its name to Landmark Property Development Company Limited in January 2008. Landmark Property Development Company Limited was incorporated in 1976 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.landmarkproperty.in",
        "market_cap": 507679200
    },
    "MAHLIFE.NS": {
        "short_name": "MAHINDRA LIFESPACE",
        "long_name": "Mahindra Lifespace Developers Limited",
        "summary": "Mahindra Lifespace Developers Limited, together with its subsidiaries, operates as a real estate development company in India. It operates through Projects, Project Management & Development; and Operating of Commercial Complexes segments. The Projects, Project Management & Development segment sells residential units. The Operating of Commercial Complexes segment rents commercial properties. The company engages in the development of residential projects under the Mahindra Lifespaces and Happinest brands; integrated cities and industrial clusters under the Mahindra World City and Origins by Mahindra World City brands; and infrastructure projects and multi product special economic zones, as well as operates and maintains water collection, treatment, and distribution facilities. The company was founded in 1994 and is based in Mumbai, India. Mahindra Lifespace Developers Limited is a subsidiary of Mahindra & Mahindra Limited.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400018",
        "website": "http://www.mahindralifespaces.com",
        "market_cap": 30209050624
    },
    "MARATHON.NS": {
        "short_name": "MARATHON NEXTGEN",
        "long_name": "Marathon Nextgen Realty Limited",
        "summary": "Marathon Nextgen Realty Limited constructs, develops, and sells commercial and residential real estate projects in India. The company was founded in 1969 and is based in Mumbai, India. Marathon Nextgen Realty Limited is a subsidiary of Marathon Realty Private Limited.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400080",
        "website": "http://www.marathonnextgen.com",
        "market_cap": 2605141248
    },
    "MODIRUBBER.NS": {
        "short_name": "MODI RUBBER",
        "long_name": "Modi Rubber Limited",
        "summary": "Modi Rubber Limited, together with its subsidiaries, provides automobile tires, tubes, and flaps in India. The company also manufacture and sell resin coated sand; and operates salons. Modi Rubber Limited was founded in 1971 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110025",
        "website": "http://www.modirubberlimited.com",
        "market_cap": 1947827584
    },
    "MOTOGENFIN.NS": {
        "short_name": "MOTOR & GEN FINANC",
        "long_name": "The Motor & General Finance Limited",
        "summary": "The Motor & General Finance Limited engages in leasing and developing real estate properties in India. The company was incorporated in 1930 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110002",
        "website": "http://www.mgfltd.com",
        "market_cap": 825397824
    },
    "NILAINFRA.NS": {
        "short_name": "NILA INFRASTRUCTUR",
        "long_name": "Nila Infrastructures Limited",
        "summary": "Nila Infrastructures Limited constructs and develops infrastructure and real estate projects in India. The company is involved in the construction of civic urban infrastructure projects, including bus stations, multilevel parking, medical college, bus port, office complex, community hall, and other projects. It also develops residential real estate properties, such as flats and apartments; and leases commercial properties. The company was incorporated in 1990 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380015",
        "website": "http://www.nilainfra.com",
        "market_cap": 2230648320
    },
    "NILASPACES.NS": {
        "short_name": "NILA SPACES LTD",
        "long_name": "Nila Spaces Limited",
        "summary": "Nila Spaces Limited engages in the real estate development activities. It is involved in the construction and development of buildings for sale and other real estate activities. The company was formerly known as Parmananday Superstructure Limited and changed its name to Nila Spaces Limited in November 2017. Nila Spaces Limited was incorporated in 2000 and is headquartered in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380015",
        "website": "http://www.nilaspaces.com",
        "market_cap": 728694656
    },
    "OBEROIRLTY.NS": {
        "short_name": "OBEROI REALTY LTD",
        "long_name": "Oberoi Realty Limited",
        "summary": "Oberoi Realty Limited, together with its subsidiaries, engages in real estate development and hospitality businesses in India. The company develops residential, commercial, retail and social infrastructure projects. It also leases office and retail spaces. In addition, the company engages in the hotel operations comprising sale of rooms, food and beverages, and allied services; and provision of property management services. Oberoi Realty Limited was incorporated in 1998 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400063",
        "website": "http://www.oberoirealty.com",
        "market_cap": 236904906752
    },
    "OMAXE.NS": {
        "short_name": "OMAXE LTD",
        "long_name": "Omaxe Limited",
        "summary": "Omaxe Limited operates as a real estate development company in India. It develops and sells integrated and hi-tech townships, group housing projects, office spaces, shopping malls, shops, SCOs, hotel projects, and serviced and studio apartments. The company was formerly known as Omaxe Construction Limited and changed its name to Omaxe Limited in June 2006. Omaxe Limited was founded in 1987 and is based in New Delhi, India. Omaxe Limited is a subsidiary of Guild Builders Private Limited.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110019",
        "website": "http://www.omaxe.com",
        "market_cap": 13003552768
    },
    "OSWALAGRO.NS": {
        "short_name": "OSWAL AGRO MILLS",
        "long_name": "Oswal Agro Mills Limited",
        "summary": "Oswal Agro Mills Limited trades in commodities and agricultural products in India. It operates through Trading, Real Estate, and Investment segments. It is involved in the trading and development of real estate properties. The company also invests in equity instruments and other securities, as well as lends funds in the form of interest bearing inter-corporate deposits. Oswal Agro Mills Limited was incorporated in 1979 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.oswalagromills.com",
        "market_cap": 1871495936
    },
    "PARSVNATH.NS": {
        "short_name": "PARSVNATH DEVELOPE",
        "long_name": "Parsvnath Developers Limited",
        "summary": "Parsvnath Developers Limited engages in the real estate development business in India. It promotes, constructs, and develops integrated townships, residential and commercial complexes, multistoried buildings, flats, houses, apartments, shopping malls, IT parks, hotels, special economic zones, etc. The company was incorporated in 1990 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110032",
        "website": "http://www.parsvnath.com",
        "market_cap": 6132616192
    },
    "PENINLAND.NS": {
        "short_name": "PENINSULA LAND LTD",
        "long_name": "Peninsula Land Limited",
        "summary": "Peninsula Land Limited operates as a real estate development company in India. The company develops residential complexes; commercial spaces and IT parks under the Peninsula brand; and shopping malls under the Crossroads brand. It also rents properties. The company was incorporated in 1871 and is headquartered in Mumbai, India. Peninsula Land Limited is a subsidiary of Ashok Piramal Group Real Estate Trust.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.peninsula.co.in",
        "market_cap": 2977622784
    },
    "PHOENIXLTD.NS": {
        "short_name": "PHOENIX MILLS",
        "long_name": "The Phoenix Mills Limited",
        "summary": "The Phoenix Mills Limited constructs, operates, and manages malls, and commercial and residential property in India. The company operates in two segments, Property and Related Services, and Hospitality. Its real estate asset portfolio comprises retail malls, commercial office, residential, and hospitality projects located in Mumbai, Chennai, Bengaluru, Pune, Lucknow, Bareilly, Agra, Ahmedabad, and Indore. As of June 30, 2020, the company owns and operates hotels under The St. Regis name with 395 keys, serviced apartments, ten food and beverage venues, six ball rooms and prefunction areas, and eleven meeting rooms and business centers, as well as health club and a spa in Mumbai; and Courtyard by Marriott brand name with 193 keys, four restaurants and a bar, and a banquet hall in Agra. It operates malls under the Phoenix MarketCity, Palladium, Phoenix United, and Phoenix Palassio brand names. The Phoenix Mills Limited was founded in 1905 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400011",
        "website": "http://www.thephoenixmills.com",
        "market_cap": 125985767424
    },
    "PODDARHOUS.NS": {
        "short_name": "PODDAR HOUSING AND",
        "long_name": "Poddar Housing and Development Limited",
        "summary": "Poddar Housing and Development Limited engages in the real estate construction, development, and other related activities in India. The company was formerly known as Poddar Developers Limited and changed its name to Poddar Housing and Development Limited in January 2016. Poddar Housing and Development Limited was founded in 1982 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.poddarhousing.com",
        "market_cap": 1127228672
    },
    "PRAENG.NS": {
        "short_name": "PRAJAY ENGINEERS S",
        "long_name": "Prajay Engineers Syndicate Limited",
        "summary": "Prajay Engineers Syndicate Limited, a real estate company, engages in the construction and development of residential, commercial, hospitality, and retail properties in India. It operates through Real Estate, and Hotels and Resorts segments. The Real Estate segment is involved in the development, sale, management, and operation of town ships and housing projects, which includes leasing of self owned commercial premises. The Hotels and Resorts segment maintains hotels, restaurants, and resorts. Prajay Engineers Syndicate Limited was incorporated in 1994 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500016",
        "website": "http://www.prajayengineers.com",
        "market_cap": 878237696
    },
    "PRESTIGE.NS": {
        "short_name": "PRESTIGE ESTATES P",
        "long_name": "Prestige Estates Projects Limited",
        "summary": "Prestige Estates Projects Limited, together with its subsidiaries, engages in the development, construction, and leasing of real estate properties in India. The company develops a range of residential projects, including townships, apartments, luxury villas, mansions, row houses, town homes and golf developments; commercial projects comprising office spaces, built-to-suit campuses, special economic zones, and IT parks; and retail properties, such as malls. It also develops and owns hospitality properties, which include resorts, convention centers and serviced apartments, and hotels. In addition, Prestige Estates Projects Limited provides real estate services that comprise fit-out services, interior design and execution, facilities and property management, and project and construction management services. The company was founded in 1986 and is headquartered in Bengaluru, India. Prestige Estates Projects Limited is a subsidiary of Razack Family Trust.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560025",
        "website": "http://www.prestigeconstructions.com",
        "market_cap": 109075267584
    },
    "PROZONINTU.NS": {
        "short_name": "PROZONE INTU PROPE",
        "long_name": "Prozone Intu Properties Limited",
        "summary": "Prozone Intu Properties Limited designs, develops, owns, and operates shopping malls, and commercial and residential premises in India. The company operates through Leasing and Outright Sales segments. It develops regional shopping and entertainment centers; and mixed-use residential townships and commercial office blocks, as well as provides related management consultancy services. The company was formerly known as Prozone Capital Shopping Centres Limited and changed its name to Prozone Intu Properties Limited in July 2014. Prozone Intu Properties Limited was incorporated in 2007 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400053",
        "website": "http://www.prozoneintu.com",
        "market_cap": 7945436672
    },
    "PTL.NS": {
        "short_name": "PTL ENTERPRISES",
        "long_name": "PTL Enterprises Limited",
        "summary": "PTL Enterprises Limited engages in the lease of plant to Apollo Tyres Limited. The company was formerly known as Premier Tyres Ltd. PTL Enterprises Limited was incorporated in 1959 and is based in Gurugram, India. PTL Enterprises Limited is a subsidiary of Sunrays Properties and Investments Co. Pvt Ltd.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122001",
        "website": "http://www.ptlenterprise.com",
        "market_cap": 3139833344
    },
    "RVHL.NS": {
        "short_name": "Ravinder Heights Limited",
        "long_name": "Ravinder Heights Limited",
        "summary": "Ravinder Heights Limited engages in the real estate business in India. It is involved in the acquisition, construction, and development of townships, built-up infrastructure, housing, commercial premises, hotels, resorts, hospitals, educational institutions, recreational facilities, and city and regional level infrastructure. The company was incorporated in 2019 and is based in New Delhi, India. Ravinder Heights Limited is a subsidiary of Panacea Biotec Limited.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.ravinderheights.com",
        "market_cap": 1277762688
    },
    "SHRADHA.NS": {
        "short_name": "Shradha Infraprojects Ltd",
        "long_name": "Shradha Infraprojects Limited",
        "summary": "Shradha Infraprojects Limited, a real estate construction company, engages in the real estate development business in India. It is involved in the construction of commercial complexes, residential houses, and business premises or civil works, as well as deals in real estate properties. The company was formerly known as Shradha Infraprojects (Nagpur) Limited and changed its name to Shradha Infraprojects Limited. Shradha Infraprojects Limited was incorporated in 1997 and is based in Nagpur, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Nagpur",
        "zipcode": "440001",
        "website": "http://www.shradhainfra.in",
        "market_cap": 511803584
    },
    "SOBHA.NS": {
        "short_name": "SOBHA LIMITED",
        "long_name": "Sobha Limited",
        "summary": "Sobha Limited engages in the construction, development, sale, management, and operation of residential and commercial projects primarily in India. The company operates through two segments, Real Estate, and Contractual and Manufacturing. Its residential projects include luxury and super luxury apartments, presidential apartments, villas, row houses, plotted developments, and aspirational homes; and contractual projects for corporates comprise offices, convention centers, software development blocks, multiplex theatres, hostel facilities, hotels, guest houses, food courts, restaurants, research centers, club houses, and factory buildings. The company also manufactures doors and door frames; fitted and loose furniture for hotels and serviced apartments; panelings, partitions, discussion tables, office workstations, reception desks, lift claddings, etc.; and modular kitchens, wardrobes, sofas, dining tables, exclusive chairs, etc. In addition, it undertakes contracts for corporate interiors for offices and hospitals; manufactures and markets aluminum doors, windows, structural glazing products, aluminum composite panels and SS claddings, and pre-engineered buildings; and undertakes other architectural metal works. Further, the company manufactures concrete products, such as concrete blocks, pavers, kerbs, water drainage channels, paving slabs, and landscape products; and mattresses under the Restoplus brand. The company was formerly known as Sobha Developers Limited and changed its name to Sobha Limited in August 2014. Sobha Limited was founded in 1995 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560103",
        "website": "http://www.sobha.com",
        "market_cap": 48054005760
    },
    "SUMIT.NS": {
        "short_name": "Sumit Woods Limited",
        "long_name": "Sumit Woods Limited",
        "summary": "Sumit Woods Limited engages in the real estate development activities in India. The company develops and sells residential, commercial, retail, and social infrastructure projects. Sumit Woods Limited was incorporated in 1997 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400097",
        "website": "http://www.sumitwoods.com",
        "market_cap": 402219040
    },
    "SUNTECK.NS": {
        "short_name": "SUNTECK REALTY LTD",
        "long_name": "Sunteck Realty Limited",
        "summary": "Sunteck Realty Limited, together with its subsidiaries, engages in real estate development business. The company designs, develops, and manages premium residential, commercial, retail, and mixed-use properties under the Signature, Signia, Sunteck, Sunteck City, Sunteck World, and Gilbird brands. It also engages in the leasing of properties. The company sells its properties through sales offices, channel partners, wealth managers, institutions, and property exhibitions to corporate customers, high-net worth individuals, and retail customers in India and internationally. Sunteck Realty Limited was incorporated in 1981 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400057",
        "website": "http://www.sunteckindia.com",
        "market_cap": 45106601984
    },
    "TARC.NS": {
        "short_name": "Anant Raj Global Limited",
        "long_name": "TARC Limited",
        "summary": "Anant Raj Global Limited operates in the real estate business in India. The company engages in lease rentals of its assets, project sales, and trading of land parcels. Its property portfolio includes residential, mall and retail, hospitality, commercial and IT, and industrial properties. The company was incorporated in 2016 and is based in Gurugram, India. Anant Raj Global Limited (BSE:543249) operates independently of Anant Raj Limited as of August 25, 2020.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122051",
        "website": "http://anantrajlimited.com/projects-division-introduction.php",
        "market_cap": 9057935360
    },
    "TCIDEVELOP.NS": {
        "short_name": "TCI DEVELOPERS LTD",
        "long_name": "TCI Developers Limited",
        "summary": "TCI Developers Limited engages in the real estate and warehousing development businesses in India. The company rents or leases land, office complexes, residential buildings, warehouses, and logistics parks. It also provides project management services for construction projects. The company was founded in 2008 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122001",
        "website": "http://www.tcidevelopers.com",
        "market_cap": 1119956992
    },
    "TECHIN.NS": {
        "short_name": "TECHINDIA NIRMAN L",
        "long_name": "Techindia Nirman Limited",
        "summary": "Techindia Nirman Limited focuses in the real estate and infrastructure development businesses in India. The company was formerly known as Nath Seeds Limited. Techindia Nirman Limited was incorporated in 1980 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400020",
        "website": "http://www.techindianirman.com",
        "market_cap": 92303976
    },
    "TEXINFRA.NS": {
        "short_name": "TEXMACO INFRA & HO",
        "long_name": "Texmaco Infrastructure & Holdings Limited",
        "summary": "Texmaco Infrastructure & Holdings Limited engages in the real estate, hydro power generation, and job work businesses primarily in India. The company operates in three segments: Real Estate, Hydro Power, and Job work. It operates a 3 megawatt mini hydel power project located at Neora, West Bengal. The company was formerly known as Texmaco Limited and changed its name to Texmaco Infrastructure & Holdings Limited in February 2012. Texmaco Infrastructure & Holdings Limited was founded in 1939 and is based in Delhi, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Delhi",
        "zipcode": "110007",
        "website": "http://www.texinfra.in",
        "market_cap": 8894491648
    },
    "UNITECH.NS": {
        "short_name": "UNITECH LIMITED",
        "long_name": "Unitech Limited",
        "summary": "Unitech Limited develops and leases real estate properties in India. The company develops commercial complexes, IT/ITes parks, SEZs, schools, hotels, malls, golf courses, and amusement parks. It also develops integrated residential projects, which include villas, apartments, offices, retail spaces, schools, clubs, floors, plots, and townships. In addition, the company leases IT/ITes and commercial office spaces; and provides property management and consultancy services. Further, it engages in the power transmission and hospitality businesses. Unitech Limited was incorporated in 1971 and is headquartered in Gurugram, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122007",
        "website": "http://www.unitechgroup.com",
        "market_cap": 6805006336
    },
    "VIPULLTD.NS": {
        "short_name": "VIPUL LTD",
        "long_name": "Vipul Limited",
        "summary": "Vipul Limited engages in real estate development and services business in India. Its project portfolio includes residential, commercial, and retail projects, as well as integrated townships and lifestyle gated communities. The company was incorporated in 1991 and is headquartered in Gurugram, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122009",
        "website": "http://www.vipulgroup.in",
        "market_cap": 4263670016
    }
}