{"BHAGYAPROP.NS": {"short_name": "BHAGYANAGAR PROPPE", "long_name": "Bhagyanagar Properties Limited", "summary": "Bhagyanagar Properties Limited engages in the development of real estate properties in India. It also engages in buying, selling, and leasing properties. The company was incorporated in 2006 and is based in Secunderabad, India.", "currency": "INR", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Secunderabad"}, "BOMDYEING.NS": {"short_name": "BOMBAY DYEING &MFG", "long_name": "The Bombay Dyeing and Manufacturing Company Limited", "summary": "The Bombay Dyeing and Manufacturing Company Limited produces and sells polyester staple fiber products in India. It operates through Real Estate, Polyester, and Retail/Textile segments. The company is also involved in the manufacture of textile grade PET chips; and retail of home textiles. In addition, it develops real estate properties, such as residences, offices, hotels, serviced apartments, hospitals, schools, and retail facilities. The company exports its products to Europe, North and South America, the Middle East, Africa, and Asia. The Bombay Dyeing and Manufacturing Company Limited was founded in 1879 and is headquartered in Mumbai, India.", "currency": "INR", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "CINELINE.NS": {"short_name": "CINELINE INDIA LTD", "long_name": "Cineline India Limited", "summary": "Cineline India Limited, together with its subsidiaries, engages in the ownership and leasing of real estate properties in India. It is involved in renting out commercial and retail properties, and parking and advertising spaces in high-street malls. The company owns and leases nine theatres, which include seven in and around Mumbai, as well as one each in Nasik and Nagpur to PVR Cinemas; and owns a mall under the Eternity Mall name located in Nagpur, as well as provides maintenance services. It also generates renewable energy through a windmill with capacity of 0.6 MWA located at Viswada in Gujarat; and a windmill with capacity of 1.6 MWA situated at Revangaon in Maharashtra. The company was formerly known as Cinemax Properties Limited and changed its name to Cineline India Limited in March 2013. Cineline India Limited was incorporated in 2002 and is headquartered in Mumbai, India.", "currency": "INR", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "FMNL.NS": {"short_name": "FUTURE MKT NETWORK", "long_name": "Future Market Networks Limited", "summary": "Future Market Networks Limited, together with its subsidiaries, engages in the development and management of commercial, retail, and infra logistic projects in India. It also constructs, develops, and sells integrated large-scale warehouses. The company was formerly known as Agre Developers Limited and changed its name to Future Market Networks Limited in February 2012. The company was incorporated in 2008 and is based in Mumbai, India. Future Market Networks Limited is a subsidiary of Future Corporate Resources Private Limited.", "currency": "INR", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "LPDC.NS": {"short_name": "LANDMARK PROP DEV", "long_name": "Landmark Property Development Company Limited", "summary": "Landmark Property Development Company Limited engages in the real estate development business in India. It also offers advisory and consultancy services to overseas investors for investment reports, including presentation of the financial and economic aspects of the proposed investment, business plans for the proposed investment, and various other information requested by the advisee. The company was formerly known as Konark Minerals Limited and changed its name to Landmark Property Development Company Limited in January 2008. Landmark Property Development Company Limited was incorporated in 1976 and is based in New Delhi, India.", "currency": "INR", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "NSI", "market": "in_market", "country": "India", "city": "New Delhi"}, "MODIRUBBER.NS": {"short_name": "MODI RUBBER", "long_name": "Modi Rubber Limited", "summary": "Modi Rubber Limited, together with its subsidiaries, provides automobile tires, tubes, and flaps in India. The company also manufacture and sell resin coated sand; and operates salons. Modi Rubber Limited was founded in 1971 and is headquartered in New Delhi, India.", "currency": "INR", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "NSI", "market": "in_market", "country": "India", "city": "New Delhi"}, "SHRADHA.NS": {"short_name": "Shradha Infraprojects Ltd", "long_name": "Shradha Infraprojects Limited", "summary": "Shradha Infraprojects Limited, a real estate construction company, engages in the real estate development business in India. It is involved in the construction of commercial complexes, residential houses, and business premises or civil works, as well as deals in real estate properties. The company was formerly known as Shradha Infraprojects (Nagpur) Limited and changed its name to Shradha Infraprojects Limited. Shradha Infraprojects Limited was incorporated in 1997 and is based in Nagpur, India.", "currency": "INR", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Nagpur"}, "TCIDEVELOP.NS": {"short_name": "TCI DEVELOPERS LTD", "long_name": "TCI Developers Limited", "summary": "TCI Developers Limited engages in the real estate and warehousing development businesses in India. The company rents or leases land, office complexes, residential buildings, warehouses, and logistics parks. It also provides project management services for construction projects. The company was founded in 2008 and is based in Gurugram, India.", "currency": "INR", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Gurugram"}, "TEXINFRA.NS": {"short_name": "TEXMACO INFRA & HO", "long_name": "Texmaco Infrastructure & Holdings Limited", "summary": "Texmaco Infrastructure & Holdings Limited engages in the real estate, hydro power generation, and job work businesses primarily in India. The company operates in three segments: Real Estate, Hydro Power, and Job work. It operates a 3 megawatt mini hydel power project located at Neora, West Bengal. The company was formerly known as Texmaco Limited and changed its name to Texmaco Infrastructure & Holdings Limited in February 2012. Texmaco Infrastructure & Holdings Limited was founded in 1939 and is based in Delhi, India.", "currency": "INR", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Delhi"}}