{
    "1514.T": {
        "short_name": "SUMISEKI HOLDINGS INC",
        "long_name": "Sumiseki Holdings,Inc.",
        "summary": "Sumiseki Holdings,Inc. imports, purchases, and sells coal in Japan. It also manufactures and sells artificial diamonds; and collects, processes, and sells crushed stones. In addition, it invests in coal companies and others. The company was founded in 2008 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0004",
        "website": "http://www.sumiseki.co.jp",
        "full_time_employees": 58
    },
    "1518.T": {
        "short_name": "MITSUI MATSUSHIMA HOLDINGS CO L",
        "long_name": "Mitsui Matsushima Holdings Co., Ltd.",
        "summary": "Mitsui Matsushima Holdings Co., Ltd. engages in the production and sale of coal products in Japan and internationally. It also produces and markets coal to steel mills, power utilities, and general industries; and operates, generates, and sells solar power to electric power companies. In addition, the company provides coal mine development/operation and coal preparation technologies; shredders, office security products, pouches, and window guidance systems; mask blanks to photomask manufacturers for various applications; straw products for dairy and beverage companies; paper and PET beverage cup and food package products for various customers; custom-made suits, as well as manufactures and sells facilities and measuring equipment for the production of crystal devices. Further, it engages in the provision of nursing care services for the elderly, in-home, and outpatient; operation of coal storage and transportation equipment, sample testing of coal, inspection of conveyors used to transport ash and gypsum, and deployment and recovery of marine oil fences; operation of an LPG filling station in Saikai city, as well as the convenience store; provision of investment and lending services to coal mines; and port and harbor businesses. Additionally, the company sells food containers; manages elderly housing; produces and sells men's and women's clothing and dress shirts; and provides mining instruction, ventilation analysis, safety and security, and rescue and relief training services. The company was formerly known as Mitsui Matsushima Co., Ltd. and changed its name to Mitsui Matsushima Holdings Co., Ltd. in 2018. Mitsui Matsushima Holdings Co., Ltd. was founded in 1913 and is headquartered in Fukuoka, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuoka",
        "zipcode": "810-8527",
        "website": "http://www.mitsui-matsushima.co.jp",
        "full_time_employees": 1274
    },
    "1605.T": {
        "short_name": "INPEX CORPORATION",
        "long_name": "Inpex Corporation",
        "summary": "Inpex Corporation engages in the research, exploration, development, production, and sale of oil, natural gas, and other mineral resources in Japan, rest of Asia and Oceania, Europe and NIS countries, the Middle East and Africa, and the Americas. It is also involved in the investment and lending to the companies engaged in mineral resources business, etc. As of December 31, 2019, its proved reserves were 2,974 million barrels for crude oil, condensate, and LPG; and 6,012 billion cubic feet for natural gas. Inpex Corporation was founded in 1966 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-6332",
        "website": "http://www.inpex.co.jp",
        "full_time_employees": 3163
    },
    "5008.T": {
        "short_name": "TOA OIL COMPANY LIMITED",
        "long_name": "TOA Oil Co., Ltd.",
        "summary": "TOA Oil Co., Ltd., together with its subsidiaries, engages in petroleum refining and power generation business in Japan. The company offers various oil products, such as gasoline, kerosene, diesel oil and heavy oil. The company was formerly known as Nippon Jyuyu Co., Ltd. and changed its name to TOA Oil Co., Ltd. in April 1942. The company was founded in 1924 and is headquartered in Kawasaki, Japan. TOA Oil Co., Ltd. is a subsidiary of Showa Shell Sekiyu K.K.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kawasaki",
        "zipcode": "210-0866",
        "website": "http://www.toaoil.co.jp",
        "full_time_employees": null
    },
    "5009.T": {
        "short_name": "FUJI KOSAN COMPANY",
        "long_name": "Fuji Kosan Company, Ltd.",
        "summary": "Fuji Kosan Company, Ltd. supplies petroleum products in Japan. The company offers fuel oils, such as kerosene, light oil, and heavy oil; asphalt products, including straight asphalt, additives for asphalt regeneration, and asphalt adhesion inhibitors, as well as provides materials for manufacturing asphalt road paving and other road materials. It also provides automobiles, agricultural machinery, marine, and industrial lubricants, as well as lubricating oil for raw materials and rubber. In addition, the company offers AdBlue, a commodity for purifying the diesel exhaust gas; and solar power generation systems. Fuji Kosan Company, Ltd. was founded in 1949 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0042",
        "website": "http://www.fkoil.co.jp",
        "full_time_employees": 187
    },
    "5010.T": {
        "short_name": "NIPPON SEIRO CO",
        "long_name": "Nippon Seiro Co., Ltd.",
        "summary": "Nippon Seiro Co., Ltd. manufactures and sells petroleum waxes, physically and chemically converted wax products, and fuel oil in Japan and internationally. It offers paraffin wax, microcrystalline wax, oxidized and chemical wax, special wax, anti-ozonant wax, and wax emulsion. The company provides its products in slab, pellet, powder, and granule forms for use in various applications, such as hotmelt adhesives, paper cups, plastic lubricants, paper converting, rubber anti-ozonants, polishes, cosmetics and pharmaceuticals, candles, water proof corrugated paperboards, chlorinated paraffins, matches, rust prevention, plywood, textiles, electric insulation, modification of paraffin wax, laminations, chewing gums, water repellents, inks, binders, slip agents, ink additives, toners, release agents, rubbers and tires, polymer additive agents, and paraffin wax reformers. Nippon Seiro Co., Ltd. was founded in 1929 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0031",
        "website": "http://www.seiro.co.jp",
        "full_time_employees": 306
    },
    "5015.T": {
        "short_name": "BP CASTROL KK",
        "long_name": "BP Castrol K.K.",
        "summary": "BP Castrol K.K. manufactures and sells automotive lubricants in Japan. It sells its products under the BP and Castrol brand names to car dealers. The company was incorporated in 1978 and is headquartered in Tokyo, Japan. BP Castrol K.K. is a subsidiary of Castrol Limited.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-0032",
        "website": "http://www.bp.com/ja_jp/bp-castrol-japan.html",
        "full_time_employees": null
    },
    "5019.T": {
        "short_name": "IDEMITSU KOSAN CO.LTD",
        "long_name": "Idemitsu Kosan Co.,Ltd.",
        "summary": "Idemitsu Kosan Co.,Ltd. manufactures and sells fuel oils and lubricant oils in Japan and internationally. It operates through Petroleum, Basic Chemicals, Functional Materials, Power and Renewable Energy, and Resources segments. The company's Petroleum segment engages in the procurement and sale of crude oil and refining of petroleum products; gasoline, diesel oil, kerosene, and automotive lubricants to service stations; and industrial kerosene, diesel oil, and heavy oil, and aviation and marine fuel. Its Basic Chemicals segment manufactures and sells olefins, such as ethylene, propylene, and butadiene; aromatics, including benzene, styrene monomer, mixed xylene, and paraxylene; and other chemicals. The company's Functional Materials segment researches, develops, manufactures, and sells automotive, marine, and industrial lubricants, as well as grease; engineering plastic, adhesive materials, derivative products, and solvents; electronic materials, such as OLED; asphalt; microbial pesticides, soil amendments, and livestock related materials; and solid state lithium ion battery materials. Its Power and Renewable Energy segment operates thermal power plants; develops and operates renewable energy sources, including solar, wind, and biomass power plants; engages in the supply, wholesale, and retail of electric power; researches, develops, and manufactures CIS thin-film solar modules; and sale of solar power systems. The company Resources segments explores, develops, and produces oil and gas; produces and sells coal and uranium; operates geothermal power plants; and sale of electric power and steam. Idemitsu Kosan Co.,Ltd. was founded in 1911 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8321",
        "website": "http://www.idemitsu.co.jp",
        "full_time_employees": 13766
    },
    "5020.T": {
        "short_name": "ENEOS HOLDINGS INC",
        "long_name": "ENEOS Holdings, Inc.",
        "summary": "ENEOS Holdings, Inc., through its subsidiaries, engages in the energy, oil and natural gas exploration and production (E&P), and metals businesses Japan, China, and internationally. The company operates through Energy, Oil and Natural Gas E&P, Metals, and Other segments. It manufactures and sells petroleum products, including gasoline, kerosene, lubricants, etc., as well as petrochemicals; imports and sells gas, such as LNG and liquefied petroleum gas; and offers copper concentrate, electrolytic coppers, electronic materials, etc. The company also explores, develops, produces, and sells crude oil, natural gas, other mineral resources, etc.; develops and mines nonferrous metals resources; refines and markets copper, gold, silver, sulfuric acid, copper foils, materials for rolling and processing, and thin film materials; recycles nonferrous metals; treats industrial waste; and generates and supplies electricity. In addition, it engages in the asphalt paving, civil engineering, construction, land transportation, and fund procurement businesses, as well as transportation by ships of non-ferrous metal products, titanium, and electric wires. Further, the company stores and transports crude oil and petroleum products; leases automobile-related supplies and goods; and purchases, leases, manages, and sells real estate properties. Additionally, it provides financial, accounting, salary and welfare, researching, studying, evaluating, designing and planning, and consulting services. The company was formerly known as JXTG Holdings, Inc. and changed its name to ENEOS Holdings, Inc. in June 2020. ENEOS Holdings, Inc. was founded in 1888 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8162",
        "website": "http://hd.eneos.co.jp",
        "full_time_employees": 40983
    },
    "5021.T": {
        "short_name": "COSMO ENERGY HLDGS CO LTD",
        "long_name": "Cosmo Energy Holdings Co., Ltd.",
        "summary": "Cosmo Energy Holdings Co., Ltd., through its subsidiaries, engages in the oil business in Japan and internationally. The company operates through three segments: Petroleum, Petrochemical, and Oil Exploration and Production. Its Petroleum segment produces and markets gasoline, naphtha, kerosene, gas oil, heavy oil, crude oil, lubricants, liquefied petroleum gas, asphalt, and other petroleum products. The company's Petrochemical segment produces and sells ethylene, mixed xylene, para-xylene, benzene, toluene, petrochemical solvents, and other petrochemical products. Its Oil Exploration and Production segment develops, produces, and sells crude oil. The company also engages in the wind and solar power generation business. In addition, it leases cars for individual customers. The company was founded in 1986 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8302",
        "website": "http://ceh.cosmo-oil.co.jp",
        "full_time_employees": 6846
    },
    "6239.T": {
        "short_name": "NAGAOKA INTERNATIONAL CORPORATI",
        "long_name": "Nagaoka International Corporation",
        "summary": "Nagaoka International Corporation develops and sells water intake and treatment systems, and screen internals to oil refining and petrochemical industries worldwide. It offers screen internals for oil refining, and petrochemical and chemical fertilizer complexes. The company also provides screens used for groundwater intake purposes; and CHEMILES, a groundwater treatment system that is used in food processing, linen industry, hospitals, and other applications. In addition, it provides HiSIS, which is high-speed seabed infiltration system for seawater desalination; and ENERLES, a water treatment system for dam water. The company was founded in 1934 and is headquartered in Osaka, Japan. Nagaoka International Corporation is a subsidiary of HAMADA Co., Ltd.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0052",
        "website": "http://www.nagaokajapan.co.jp",
        "full_time_employees": 168
    },
    "6269.T": {
        "short_name": "MODEC INC(JAPAN)",
        "long_name": "MODEC, Inc.",
        "summary": "MODEC, Inc., a general contractor, engages in the engineering, procurement, construction, and installation of floating production systems worldwide. The company provides floating production storage and offloading vessels; floating storage and offloading vessels; floating LNGs; floating storage regasification water-desalination and power generation; tension leg platforms; production semi-submersibles; mooring systems; and other technologies. It also offers floating production system operation and maintenance services. The company was founded in 1968 and is headquartered in Tokyo, Japan. MODEC, Inc. is a subsidiary of Mitsui E&S Holdings Co., Ltd.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0027",
        "website": "http://www.modec.com",
        "full_time_employees": 4781
    },
    "7462.T": {
        "short_name": "DAIYA TSUSHO",
        "long_name": "Daiya Tsusho Co.,Ltd.",
        "summary": "Daiya Tsusho Co.,Ltd. engages in the wholesale and direct sale of petroleum products in Japan. The company operates seven service stations in the Tokyo metropolitan area. It also operates community-based and specialized bicycle stores; and manages and rents office and store buildings. The company was founded in 1949 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "170-0002",
        "website": "http://www.daiya-tsusho.co.jp",
        "full_time_employees": 83
    },
    "7486.T": {
        "short_name": "SANRIN CO LTD",
        "long_name": "Sanrin Co., Ltd.",
        "summary": "Sanrin Co., Ltd. manufactures and sells briquette, bean coal, petroleum, LP gas, and other fuel products in Japan. It offers petroleum products, including gasoline, white kerosene, light oil, heavy oil, lubricates, and other products; LP gas for household, commercial, automobile, and industrial uses; and oxygen, nitrogen, and laughing gases, as well as other general high-pressure gases. The company also supplies hot pot, oil FF heaters, bathtub boilers, water heaters, LP gas/table water heaters, rice cookers, stoves, and machine bath kettles; and household equipment comprising bathtubs, washbasin units, sinks, clean flush toilets, septic tanks, solar hot water systems, central cleaner exhaust fans, ventilators, commercial kitchen equipment, and system kitchen and bath units. In addition, it provides solar power generation system and fuel cells; refrigerators, air-conditioners, fans, radiators, pump and cooling towers, warm-up machines, and other cold equipment; LP gas supply equipment, including propane containers, fuse cocks, regulators, steel pipes, and microcomputer gas meters; and household goods, such as gas leak alarms, fire alarms, anti-freeze products, and other consumer home appliances. Further, the company offers tires, car air-conditioners, batteries, and other car accessories; and high-pressure gas equipment for industrial and medical purposes, as well as operates golf practice fields. Additionally, it designs and constructs air-conditioning and hot water supply facility; housing renovations; and high-pressure gas facilities for oxygen. Sanrin Co., Ltd. was founded in 1934 and is headquartered in Higashichikuma, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Higashichikuma-gun",
        "zipcode": "390-1393",
        "website": "http://www.sanrinkk.co.jp",
        "full_time_employees": null
    },
    "8037.T": {
        "short_name": "KAMEI CORP",
        "long_name": "Kamei Corporation",
        "summary": "Kamei Corporation operates as a general trading company in Japan and internationally. The company operates through Corporate Sales, Residential, Carlife, Food, Construction Materials, and Pharmacy divisions. It provides eco-friendly products, including LED lighting, eco pumps, and warm glasses; energy management-related products, such as solar power generation systems, lithium-ion storage batteries, etc.; chemical products comprising industrial chemicals, water treatment agents, alcohol, etc.; industrial materials and equipment consisting of logistics materials, compressors, generators, Karcher products, etc.; office supplies; ICT solutions and services; insurance products; and emergency earthquake warning systems, fire extinguishers, and fire-extinguishing equipment. The company also supplies automobile and industrial lubricants, oil products, LNG and LPG products, and home-use propane gas and kerosene; kitchen and hot water supply systems, as well as equipment; household fuel cells; built-in kitchens and baths; and alcoholic beverages, soft drinks, food products, restaurant ingredients, processing ingredients, etc. In addition, it operates a network of service stations that offer refueling services, as well as car wash, tire change, oil change, safety and vehicle inspection, coating, and other maintenance services; provides auto leasing services; and undertakes steel frame, exterior cladding, and metal siding construction works. Further, the company operates pharmacies; and offers renovation services. As of October 1, 2020, it operated 291 gas stations, 34 oil depots, 16 gas terminals, 6 automobile LPG stations, 2 food distribution centers, 104 pharmacies, and 1 supermarket. The company was formerly known as Kamei Shoten Co. and changed its name to Kamei Corporation in 1985. Kamei Corporation was founded in 1903 and is headquartered in Sendai, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sendai",
        "zipcode": "980-8583",
        "website": "http://www.kamei.co.jp",
        "full_time_employees": null
    },
    "8131.T": {
        "short_name": "MITSUUROKO GROUP HOLDINGS CO LT",
        "long_name": "Mitsuuroko Group Holdings Co.,Ltd.",
        "summary": "Mitsuuroko Group Holdings Co.,Ltd. engages in energy, power and electricity, food, living and wellness, and other businesses. It supplies liquefied petroleum gas, liquefied natural gas, autogas, compressed natural gas for vehicles, and other petroleum products. The company also sells and installs household systems and appliances; provides fiber optic communication services; and supplies solid fuel, solar power generation systems, lithium-ion batteries, and residential-use fuel cells. In addition, it operates wind, biomass, and solar power plants. Further, the company produces and sell beverages, such as mineral water; and operates restaurants, stores, and cafeterias. Additionally, it develops and leases office buildings and commercial facilities, as well as manages a sports and wellness facility; leases office equipment, information and communications equipment, industrial machinery, and transportation equipment; and offers shared services and IT solutions, and insurance brokerage services. The company was formerly known as MITSUUROKO Co.,Ltd. and changed its name to Mitsuuroko Group Holdings Co.,Ltd. in October 2011. Mitsuuroko Group Holdings Co.,Ltd. was founded in 1926 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0031",
        "website": "http://www.mitsuuroko.com",
        "full_time_employees": null
    },
    "8132.T": {
        "short_name": "SINANEN HOLDINGS CO LTD",
        "long_name": "Sinanen Holdings Co., Ltd.",
        "summary": "Sinanen Holdings Co., Ltd. engages in the energy and non-energy related businesses in Japan and internationally. It provides products and services related to energy, such as LP gas and kerosene; and solutions comprising renovation and housing equipment, as well as housework and house cleaning services. The company also offers petroleum products to corporate customers that include gasoline, kerosene, diesel oil and fuel oil sales, and LP gas. In addition, it provides support for reducing energy costs and CO2 emissions, consultation for energy savings facilities, and electricity sales. Further, the company is involved in the retail of electricity to companies, local municipalities, public offices, and schools; and supply of fuel to ships. Additionally, it provides inorganic antimicrobial agents for various purposes, such as resin, fiber, and paint; ERP systems for the LP gas business; waste recycled fuels and materials comprising wood chips and recycled fuels, such as waste plastic and paper, and intermediate processing system of various mixed waste; coal consumer use; a range of services, including maintenance, management, and operation of buildings, cleaning, security, various construction works, material supply, and energy-related services. It also engages in the import and sale of bicycles; maintenance of apartments/condominiums; and installation, maintenance, and follow-up of air-conditioning, floor heating, and heat source equipment for detached/apartment houses. The company was formerly known as Sinanen Co., Ltd. and changed its name to Sinanen Holdings Co., Ltd. in October 2015. Sinanen Holdings Co., Ltd. was founded in 1927 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-6306",
        "website": "http://www.sinanengroup.co.jp",
        "full_time_employees": null
    },
    "8133.T": {
        "short_name": "ITOCHU ENEX CO LTD",
        "long_name": "Itochu Enex Co.,Ltd.",
        "summary": "Itochu Enex Co.,Ltd. engages in the sale of petroleum and gas businesses in Japan and internationally. It operates through four divisions: Home-Life, Car-Life, Industrial Business, and Power & Utility. The Home-Life division is involved in the sale of liquefied petroleum gas (LPG), town gas, industrial gas, and specialty gas, electricity, and kerosene; gas for medical and automotive usage; household and smart energy equipment; solar power systems; ENEFARM residential fuel cells; ENE-POWABOL residential lithium-ion electricity storage systems; and welding materials, as well as supply of LPG and city gas to 1.5 million customers. This segment also engages in the remodeling and gas container pressure resistance inspection businesses. The Car-Life division sells gasoline, kerosene, diesel oil, electricity, automobiles, and lifestyle and automotive products; offers credit card services; and rents cars and terminal tanks, as well as engages in the import/export and trading of petroleum products. This segment also operates approximately 1,700 car-life stations and 420 rent-a-car service stores. The Industrial Business division sells gasoline, kerosene, diesel and fuel oil, GTL fuel, marine fuel, LPG, corporate fleet refueling card, and asphalt, as well as high-grade urea solution under the AdBlue name; and engages in the recycling of fly ash, and recovery and recycling of slop businesses. The Power & Utility division engages in the sale of electricity from coal-fired, natural gas-fired, wind, hydro, and photovoltaic power; and sells steam. This segment also offers district heating, energy, electricity/heat supply, and electricity power supply/demand management, as well as asset management services. The company was formerly known as Itochu Fuel Corporation and changed its name to Itochu Enex Co.,Ltd. in July 2001. The company was founded in 1961 and is headquartered in Tokyo, Japan. Itochu Enex Co.,Ltd. is a subsidiary of ITOCHU Corporation.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-6028",
        "website": "http://www.itcenex.com",
        "full_time_employees": null
    },
    "9535.T": {
        "short_name": "HIROSHIMA GAS CO",
        "long_name": "HIROSHIMA GAS Co.,Ltd.",
        "summary": "HIROSHIMA GAS Co.,Ltd. engages in the gas business in Japan. The company operates through Gas Business, LPG Business, and Others segments. It engages in the production, supply, and sale of gas; wholesale supply of gas to other gas companies; sale of gas devices; and installation of gas equipment associated with gas devices, as well as safety inspection and gas meter data collection activities. The company is also involved in the sale of LPG and LPG devices; refilling of LPG tanks; installation of LPG pipes; and construction of gas pipes and lines. In addition, it engages in the engineering; machinery installation; fees collection and call center operation; and information distribution activities, as well as provision of services for seniors. The company was formerly known as Hiroshima Gas Electric Railway Co., Ltd. and changed its name to HIROSHIMA GAS Co.,Ltd. in 1942. HIROSHIMA GAS Co.,Ltd. was founded in 1909 and is headquartered in Hiroshima, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Hiroshima",
        "zipcode": "734-8555",
        "website": "http://www.hiroshima-gas.co.jp",
        "full_time_employees": null
    },
    "96P.F": {
        "short_name": "ITOCHU ENEX",
        "long_name": "Itochu Enex Co.,Ltd.",
        "summary": "Itochu Enex Co.,Ltd. engages in the sale of petroleum and gas businesses in Japan and internationally. It operates through four divisions: Home-Life, Car-Life, Industrial Business, and Power & Utility. The Home-Life division is involved in the sale of liquefied petroleum gas (LPG), town gas, industrial gas, and specialty gas, electricity, and kerosene; gas for medical and automotive usage; household and smart energy equipment; solar power systems; ENEFARM residential fuel cells; ENE-POWABOL residential lithium-ion electricity storage systems; and welding materials, as well as supply of LPG and city gas to 1.5 million customers. This segment also engages in the remodeling and gas container pressure resistance inspection businesses. The Car-Life division sells gasoline, kerosene, diesel oil, electricity, automobiles, and lifestyle and automotive products; offers credit card services; and rents cars and terminal tanks, as well as engages in the import/export and trading of petroleum products. This segment also operates approximately 1,700 car-life stations and 420 rent-a-car service stores. The Industrial Business division sells gasoline, kerosene, diesel and fuel oil, GTL fuel, marine fuel, LPG, corporate fleet refueling card, and asphalt, as well as high-grade urea solution under the AdBlue name; and engages in the recycling of fly ash, and recovery and recycling of slop businesses. The Power & Utility division engages in the sale of electricity from coal-fired, natural gas-fired, wind, hydro, and photovoltaic power; and sells steam. This segment also offers district heating, energy, electricity/heat supply, and electricity power supply/demand management, as well as asset management services. The company was formerly known as Itochu Fuel Corporation and changed its name to Itochu Enex Co.,Ltd. in July 2001. The company was founded in 1961 and is headquartered in Tokyo, Japan. Itochu Enex Co.,Ltd. is a subsidiary of ITOCHU Corporation.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-6028",
        "website": "http://www.itcenex.com",
        "full_time_employees": null
    },
    "ACK.F": {
        "short_name": "FUJI OIL CO. LTD.",
        "long_name": "Fuji Oil Company, Ltd.",
        "summary": "Fuji Oil Company, Ltd., together with its subsidiaries, engages in refining, producing, processing, storing, and selling petroleum products and petrochemical feedstock. The company imports crude oil, as well as gasoline, kerosene, and diesel fuel; and processes the crude oil into a range of petroleum products, including gasoline, kerosene, and LPG. The company distributes its petroleum products to clients in Japan by sea, rail, road, and pipeline, as well as exports its petroleum products. The company was formerly known as AOC Holdings, Inc. and changed its name to Fuji Oil Company, Ltd. in October 2013. Fuji Oil Company, Ltd. was founded in 2003 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "140-0002",
        "website": "http://www.foc.co.jp",
        "full_time_employees": 678
    },
    "I7B.F": {
        "short_name": "IDEMITSU KOSAN CO. LTD",
        "long_name": "Idemitsu Kosan Co.,Ltd.",
        "summary": "Idemitsu Kosan Co.,Ltd. manufactures and sells fuel oils and lubricant oils in Japan and internationally. It operates through Petroleum, Basic Chemicals, Functional Materials, Power and Renewable Energy, and Resources segments. The company's Petroleum segment engages in the procurement and sale of crude oil and refining of petroleum products; gasoline, diesel oil, kerosene, and automotive lubricants to service stations; and industrial kerosene, diesel oil, and heavy oil, and aviation and marine fuel. Its Basic Chemicals segment manufactures and sells olefins, such as ethylene, propylene, and butadiene; aromatics, including benzene, styrene monomer, mixed xylene, and paraxylene; and other chemicals. The company's Functional Materials segment researches, develops, manufactures, and sells automotive, marine, and industrial lubricants, as well as grease; engineering plastic, adhesive materials, derivative products, and solvents; electronic materials, such as OLED; asphalt; microbial pesticides, soil amendments, and livestock related materials; and solid state lithium ion battery materials. Its Power and Renewable Energy segment operates thermal power plants; develops and operates renewable energy sources, including solar, wind, and biomass power plants; engages in the supply, wholesale, and retail of electric power; researches, develops, and manufactures CIS thin-film solar modules; and sale of solar power systems. The company Resources segments explores, develops, and produces oil and gas; produces and sells coal and uranium; operates geothermal power plants; and sale of electric power and steam. Idemitsu Kosan Co.,Ltd. was founded in 1911 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8321",
        "website": "http://www.idemitsu.co.jp",
        "full_time_employees": 13766
    },
    "I8U.F": {
        "short_name": "INPEX CORP.",
        "long_name": "Inpex Corporation",
        "summary": "Inpex Corporation engages in the research, exploration, development, production, and sale of oil, natural gas, and other mineral resources in Japan, rest of Asia and Oceania, Europe and NIS countries, the Middle East and Africa, and the Americas. It is also involved in the investment and lending to the companies engaged in mineral resources business, etc. As of December 31, 2019, its proved reserves were 2,974 million barrels for crude oil, condensate, and LPG; and 6,012 billion cubic feet for natural gas. Inpex Corporation was founded in 1966 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-6332",
        "website": "http://www.inpex.co.jp",
        "full_time_employees": 3163
    },
    "IDKOY": {
        "short_name": "IDEMITSU KOSAN CO.LTD",
        "long_name": "Idemitsu Kosan Co.,Ltd.",
        "summary": "Idemitsu Kosan Co.,Ltd. manufactures and sells fuel oils and lubricant oils in Japan and internationally. It operates through Petroleum, Basic Chemicals, Functional Materials, Power and Renewable Energy, and Resources segments. The company's Petroleum segment engages in the procurement and sale of crude oil and refining of petroleum products; gasoline, diesel oil, kerosene, and automotive lubricants to service stations; and industrial kerosene, diesel oil, and heavy oil, and aviation and marine fuel. Its Basic Chemicals segment manufactures and sells olefins, such as ethylene, propylene, and butadiene; aromatics, including benzene, styrene monomer, mixed xylene, and paraxylene; and other chemicals. The company's Functional Materials segment researches, develops, manufactures, and sells automotive, marine, and industrial lubricants, as well as grease; engineering plastic, adhesive materials, derivative products, and solvents; electronic materials, such as OLED; asphalt; microbial pesticides, soil amendments, and livestock related materials; and solid state lithium ion battery materials. Its Power and Renewable Energy segment operates thermal power plants; develops and operates renewable energy sources, including solar, wind, and biomass power plants; engages in the supply, wholesale, and retail of electric power; researches, develops, and manufactures CIS thin-film solar modules; and sale of solar power systems. The company Resources segments explores, develops, and produces oil and gas; produces and sells coal and uranium; operates geothermal power plants; and sale of electric power and steam. Idemitsu Kosan Co.,Ltd. was founded in 1911 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8321",
        "website": "http://www.idemitsu.co.jp",
        "full_time_employees": 13766
    },
    "IPXHF": {
        "short_name": "INPEX CORPORATION",
        "long_name": "Inpex Corporation",
        "summary": "Inpex Corporation engages in the research, exploration, development, production, and sale of oil, natural gas, and other mineral resources in Japan, rest of Asia and Oceania, Europe and NIS countries, the Middle East and Africa, and the Americas. It is also involved in the investment and lending to the companies engaged in mineral resources business, etc. As of December 31, 2019, its proved reserves were 2,974 million barrels for crude oil, condensate, and LPG; and 6,012 billion cubic feet for natural gas. Inpex Corporation was founded in 1966 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-6332",
        "website": "http://www.inpex.co.jp",
        "full_time_employees": 3163
    },
    "IPXHY": {
        "short_name": "INPEX CORPORATION",
        "long_name": "Inpex Corporation",
        "summary": "Inpex Corporation engages in the research, exploration, development, production, and sale of oil, natural gas, and other mineral resources in Japan, rest of Asia and Oceania, Europe and NIS countries, the Middle East and Africa, and the Americas. It is also involved in the investment and lending to the companies engaged in mineral resources business, etc. As of December 31, 2019, its proved reserves were 2,974 million barrels for crude oil, condensate, and LPG; and 6,012 billion cubic feet for natural gas. Inpex Corporation was founded in 1966 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-6332",
        "website": "http://www.inpex.co.jp",
        "full_time_employees": 3163
    },
    "JHJ.F": {
        "short_name": "ENEOS HOLDINGS INC.",
        "long_name": "ENEOS Holdings, Inc.",
        "summary": "ENEOS Holdings, Inc., through its subsidiaries, engages in the energy, oil and natural gas exploration and production (E&P), and metals businesses Japan, China, and internationally. The company operates through Energy, Oil and Natural Gas E&P, Metals, and Other segments. It manufactures and sells petroleum products, including gasoline, kerosene, lubricants, etc., as well as petrochemicals; imports and sells gas, such as LNG and liquefied petroleum gas; and offers copper concentrate, electrolytic coppers, electronic materials, etc. The company also explores, develops, produces, and sells crude oil, natural gas, other mineral resources, etc.; develops and mines nonferrous metals resources; refines and markets copper, gold, silver, sulfuric acid, copper foils, materials for rolling and processing, and thin film materials; recycles nonferrous metals; treats industrial waste; and generates and supplies electricity. In addition, it engages in the asphalt paving, civil engineering, construction, land transportation, and fund procurement businesses, as well as transportation by ships of non-ferrous metal products, titanium, and electric wires. Further, the company stores and transports crude oil and petroleum products; leases automobile-related supplies and goods; and purchases, leases, manages, and sells real estate properties. Additionally, it provides financial, accounting, salary and welfare, researching, studying, evaluating, designing and planning, and consulting services. The company was formerly known as JXTG Holdings, Inc. and changed its name to ENEOS Holdings, Inc. in June 2020. ENEOS Holdings, Inc. was founded in 1888 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8162",
        "website": "http://hd.eneos.co.jp",
        "full_time_employees": 40983
    },
    "JP9.F": {
        "short_name": "JAPAN PETROLEUM EXPLORAT.",
        "long_name": "Japan Petroleum Exploration Co., Ltd.",
        "summary": "Japan Petroleum Exploration Co., Ltd. engages in the exploration, development, production, transportation, and sale of oil, natural gas, and other energy resources in Japan and internationally. The company operates 10 domestic oil and gas fields in onshore and offshore of Hokkaido, Akita, Yamagata, and Niigata prefectures. It also owns and manages a natural gas pipeline network with a total length of approximately 800 kilometers. In addition, the company is involved in contract engineering and well drilling business; manufacturing and selling petroleum products; real estate management and insurance agency activities; the sale and contracted transportation of crude oil; reprocessing of waste oil; and pipeline management and maintenance operations. Further, it engages in the contract geophysical surveys and contract mud logging operations; development of geophysical exploration technologies; exploration, development, and production of oil sands and shale gas; purchase and sale of LNG, petroleum products, etc.; provision of disaster protection for industrial facilities and security services; and manufacture and sale of drilling mud for well drilling, as well as provision of mud technical services. The company was founded in 1955 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.japex.co.jp",
        "full_time_employees": 1739
    },
    "JXHLY": {
        "short_name": "ENEOS HOLDINGS INC",
        "long_name": "ENEOS Holdings, Inc.",
        "summary": "ENEOS Holdings, Inc., through its subsidiaries, engages in the energy, oil and natural gas exploration and production (E&P), and metals businesses Japan, China, and internationally. The company operates through Energy, Oil and Natural Gas E&P, Metals, and Other segments. It manufactures and sells petroleum products, including gasoline, kerosene, lubricants, etc., as well as petrochemicals; imports and sells gas, such as LNG and liquefied petroleum gas; and offers copper concentrate, electrolytic coppers, electronic materials, etc. The company also explores, develops, produces, and sells crude oil, natural gas, other mineral resources, etc.; develops and mines nonferrous metals resources; refines and markets copper, gold, silver, sulfuric acid, copper foils, materials for rolling and processing, and thin film materials; recycles nonferrous metals; treats industrial waste; and generates and supplies electricity. In addition, it engages in the asphalt paving, civil engineering, construction, land transportation, and fund procurement businesses, as well as transportation by ships of non-ferrous metal products, titanium, and electric wires. Further, the company stores and transports crude oil and petroleum products; leases automobile-related supplies and goods; and purchases, leases, manages, and sells real estate properties. Additionally, it provides financial, accounting, salary and welfare, researching, studying, evaluating, designing and planning, and consulting services. The company was formerly known as JXTG Holdings, Inc. and changed its name to ENEOS Holdings, Inc. in June 2020. ENEOS Holdings, Inc. was founded in 1888 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8162",
        "website": "http://hd.eneos.co.jp",
        "full_time_employees": 40983
    },
    "MDIKF": {
        "short_name": "MODEC INC(JAPAN)",
        "long_name": "MODEC, Inc.",
        "summary": "MODEC, Inc., a general contractor, engages in the engineering, procurement, construction, and installation of floating production systems worldwide. The company provides floating production storage and offloading vessels; floating storage and offloading vessels; floating LNGs; floating storage regasification water-desalination and power generation; tension leg platforms; production semi-submersibles; mooring systems; and other technologies. It also offers floating production system operation and maintenance services. The company was founded in 1968 and is headquartered in Tokyo, Japan. MODEC, Inc. is a subsidiary of Mitsui E&S Holdings Co., Ltd.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0027",
        "website": "http://www.modec.com",
        "full_time_employees": 4781
    },
    "MITSF": {
        "short_name": "MITSUI & CO",
        "long_name": "Mitsui & Co., Ltd.",
        "summary": "Mitsui & Co., Ltd. operates as a general trading company worldwide. The company engages in the manufacture, export, and import of iron and steel products; automotive components, EV motors, and power trains; operation of steel processing service centers; trading of automotive, electrical, special, and stainless steel; electric-arc-furnace, construction materials processing, construction flat-rolled steel, shapes, bars, wire rods, steel structure materials, and construction pipes; manufacture, repair, and fabrication of wind turbine towers and flanges; and coal mining, power generation, ferrous alloy, infrastructure maintenance, and water pumping activities. It explores, develops, and produces oil, natural gas, and LNG; trades in petroleum products, crude oil, coal, uranium, and LNG; FPSO /FSO, fright car, truck, and locomotive leasing activities; gas distribution businesses; sells electric power facilities; and develops railway and transportation infrastructures. The company engages in logistics businesses; wholesale, retail, rental, and finance of construction and mining equipment; transportation, warehousing, and railway peripheral businesses; sale, purchase, and leasing of aircraft and aero engines; leasing and financing activities; and development, process, and marketing of underground resources, and recycling of surface resources. The company offers methanol, ammonia, chlor-alkali, industrial, gas, and basic chemicals; salt; performance, advanced, specialty, and living, and environmental materials; agrochemicals and fertilizers, and animal and human nutrition products; refined sugar, oils and fats, proteins, and food and beverage products; contract food services; and healthcare products. It provides information and communication systems; telecommunications and digital marketing services; food and retail management services; and real estate sale, leasing, management, and consulting services. The company was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8631",
        "website": "http://www.mitsui.com/jp/en",
        "full_time_employees": null
    },
    "MITSY": {
        "short_name": "MITSUI & CO",
        "long_name": "Mitsui & Co., Ltd.",
        "summary": "Mitsui & Co., Ltd. operates as a general trading company worldwide. The company engages in the manufacture, export, and import of iron and steel products; automotive components, EV motors, and power trains; operation of steel processing service centers; trading of automotive, electrical, special, and stainless steel; electric-arc-furnace, construction materials processing, construction flat-rolled steel, shapes, bars, wire rods, steel structure materials, and construction pipes; manufacture, repair, and fabrication of wind turbine towers and flanges; and coal mining, power generation, ferrous alloy, infrastructure maintenance, and water pumping activities. It explores, develops, and produces oil, natural gas, and LNG; trades in petroleum products, crude oil, coal, uranium, and LNG; FPSO /FSO, fright car, truck, and locomotive leasing activities; gas distribution businesses; sells electric power facilities; and develops railway and transportation infrastructures. The company engages in logistics businesses; wholesale, retail, rental, and finance of construction and mining equipment; transportation, warehousing, and railway peripheral businesses; sale, purchase, and leasing of aircraft and aero engines; leasing and financing activities; and development, process, and marketing of underground resources, and recycling of surface resources. The company offers methanol, ammonia, chlor-alkali, industrial, gas, and basic chemicals; salt; performance, advanced, specialty, and living, and environmental materials; agrochemicals and fertilizers, and animal and human nutrition products; refined sugar, oils and fats, proteins, and food and beverage products; contract food services; and healthcare products. It provides information and communication systems; telecommunications and digital marketing services; food and retail management services; and real estate sale, leasing, management, and consulting services. The company was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8631",
        "website": "http://www.mitsui.com/jp/en",
        "full_time_employees": null
    },
    "MTS1.F": {
        "short_name": "MITSUI + CO.",
        "long_name": "Mitsui & Co., Ltd.",
        "summary": "Mitsui & Co., Ltd. operates as a general trading company worldwide. The company engages in the manufacture, export, and import of iron and steel products; automotive components, EV motors, and power trains; operation of steel processing service centers; trading of automotive, electrical, special, and stainless steel; electric-arc-furnace, construction materials processing, construction flat-rolled steel, shapes, bars, wire rods, steel structure materials, and construction pipes; manufacture, repair, and fabrication of wind turbine towers and flanges; and coal mining, power generation, ferrous alloy, infrastructure maintenance, and water pumping activities. It explores, develops, and produces oil, natural gas, and LNG; trades in petroleum products, crude oil, coal, uranium, and LNG; FPSO /FSO, fright car, truck, and locomotive leasing activities; gas distribution businesses; sells electric power facilities; and develops railway and transportation infrastructures. The company engages in logistics businesses; wholesale, retail, rental, and finance of construction and mining equipment; transportation, warehousing, and railway peripheral businesses; sale, purchase, and leasing of aircraft and aero engines; leasing and financing activities; and development, process, and marketing of underground resources, and recycling of surface resources. The company offers methanol, ammonia, chlor-alkali, industrial, gas, and basic chemicals; salt; performance, advanced, specialty, and living, and environmental materials; agrochemicals and fertilizers, and animal and human nutrition products; refined sugar, oils and fats, proteins, and food and beverage products; contract food services; and healthcare products. It provides information and communication systems; telecommunications and digital marketing services; food and retail management services; and real estate sale, leasing, management, and consulting services. The company was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8631",
        "website": "http://www.mitsui.com/jp/en",
        "full_time_employees": null
    }
}