{"5021.T": {"short_name": "COSMO ENERGY HLDGS CO LTD", "long_name": "Cosmo Energy Holdings Co., Ltd.", "summary": "Cosmo Energy Holdings Co., Ltd., through its subsidiaries, engages in the oil business in Japan and internationally. The company operates through three segments: Petroleum, Petrochemical, and Oil Exploration and Production. Its Petroleum segment produces and markets gasoline, naphtha, kerosene, gas oil, heavy oil, crude oil, lubricants, liquefied petroleum gas, asphalt, and other petroleum products. The company's Petrochemical segment produces and sells ethylene, mixed xylene, para-xylene, benzene, toluene, petrochemical solvents, and other petrochemical products. Its Oil Exploration and Production segment develops, produces, and sells crude oil. The company also engages in the wind and solar power generation business. In addition, it leases cars for individual customers. The company was founded in 1986 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Energy", "industry": "Oil & Gas Integrated", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9535.T": {"short_name": "HIROSHIMA GAS CO", "long_name": "HIROSHIMA GAS Co.,Ltd.", "summary": "HIROSHIMA GAS Co.,Ltd. engages in the gas business in Japan. The company operates through Gas Business, LPG Business, and Others segments. It engages in the production, supply, and sale of gas; wholesale supply of gas to other gas companies; sale of gas devices; and installation of gas equipment associated with gas devices, as well as safety inspection and gas meter data collection activities. The company is also involved in the sale of LPG and LPG devices; refilling of LPG tanks; installation of LPG pipes; and construction of gas pipes and lines. In addition, it engages in the engineering; machinery installation; fees collection and call center operation; and information distribution activities, as well as provision of services for seniors. The company was formerly known as Hiroshima Gas Electric Railway Co., Ltd. and changed its name to HIROSHIMA GAS Co.,Ltd. in 1942. HIROSHIMA GAS Co.,Ltd. was founded in 1909 and is headquartered in Hiroshima, Japan.", "currency": "JPY", "sector": "Energy", "industry": "Oil & Gas Integrated", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Hiroshima"}}