{"5008.T": {"short_name": "TOA OIL COMPANY LIMITED", "long_name": "TOA Oil Co., Ltd.", "summary": "TOA Oil Co., Ltd., together with its subsidiaries, engages in petroleum refining and power generation business in Japan. The company offers various oil products, such as gasoline, kerosene, diesel oil and heavy oil. The company was formerly known as Nippon Jyuyu Co., Ltd. and changed its name to TOA Oil Co., Ltd. in April 1942. The company was founded in 1924 and is headquartered in Kawasaki, Japan. TOA Oil Co., Ltd. is a subsidiary of Showa Shell Sekiyu K.K.", "currency": "JPY", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kawasaki"}, "5009.T": {"short_name": "FUJI KOSAN COMPANY", "long_name": "Fuji Kosan Company, Ltd.", "summary": "Fuji Kosan Company, Ltd. supplies petroleum products in Japan. The company offers fuel oils, such as kerosene, light oil, and heavy oil; asphalt products, including straight asphalt, additives for asphalt regeneration, and asphalt adhesion inhibitors, as well as provides materials for manufacturing asphalt road paving and other road materials. It also provides automobiles, agricultural machinery, marine, and industrial lubricants, as well as lubricating oil for raw materials and rubber. In addition, the company offers AdBlue, a commodity for purifying the diesel exhaust gas; and solar power generation systems. Fuji Kosan Company, Ltd. was founded in 1949 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "5010.T": {"short_name": "NIPPON SEIRO CO", "long_name": "Nippon Seiro Co., Ltd.", "summary": "Nippon Seiro Co., Ltd. manufactures and sells petroleum waxes, physically and chemically converted wax products, and fuel oil in Japan and internationally. It offers paraffin wax, microcrystalline wax, oxidized and chemical wax, special wax, anti-ozonant wax, and wax emulsion. The company provides its products in slab, pellet, powder, and granule forms for use in various applications, such as hotmelt adhesives, paper cups, plastic lubricants, paper converting, rubber anti-ozonants, polishes, cosmetics and pharmaceuticals, candles, water proof corrugated paperboards, chlorinated paraffins, matches, rust prevention, plywood, textiles, electric insulation, modification of paraffin wax, laminations, chewing gums, water repellents, inks, binders, slip agents, ink additives, toners, release agents, rubbers and tires, polymer additive agents, and paraffin wax reformers. Nippon Seiro Co., Ltd. was founded in 1929 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "5015.T": {"short_name": "BP CASTROL KK", "long_name": "BP Castrol K.K.", "summary": "BP Castrol K.K. manufactures and sells automotive lubricants in Japan. It sells its products under the BP and Castrol brand names to car dealers. The company was incorporated in 1978 and is headquartered in Tokyo, Japan. BP Castrol K.K. is a subsidiary of Castrol Limited.", "currency": "JPY", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "5019.T": {"short_name": "IDEMITSU KOSAN CO.LTD", "long_name": "Idemitsu Kosan Co.,Ltd.", "summary": "Idemitsu Kosan Co.,Ltd. manufactures and sells fuel oils and lubricant oils in Japan and internationally. It operates through Petroleum, Basic Chemicals, Functional Materials, Power and Renewable Energy, and Resources segments. The company's Petroleum segment engages in the procurement and sale of crude oil and refining of petroleum products; gasoline, diesel oil, kerosene, and automotive lubricants to service stations; and industrial kerosene, diesel oil, and heavy oil, and aviation and marine fuel. Its Basic Chemicals segment manufactures and sells olefins, such as ethylene, propylene, and butadiene; aromatics, including benzene, styrene monomer, mixed xylene, and paraxylene; and other chemicals. The company's Functional Materials segment researches, develops, manufactures, and sells automotive, marine, and industrial lubricants, as well as grease; engineering plastic, adhesive materials, derivative products, and solvents; electronic materials, such as OLED; asphalt; microbial pesticides, soil amendments, and livestock related materials; and solid state lithium ion battery materials. Its Power and Renewable Energy segment operates thermal power plants; develops and operates renewable energy sources, including solar, wind, and biomass power plants; engages in the supply, wholesale, and retail of electric power; researches, develops, and manufactures CIS thin-film solar modules; and sale of solar power systems. The company Resources segments explores, develops, and produces oil and gas; produces and sells coal and uranium; operates geothermal power plants; and sale of electric power and steam. Idemitsu Kosan Co.,Ltd. was founded in 1911 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "5020.T": {"short_name": "ENEOS HOLDINGS INC", "long_name": "ENEOS Holdings, Inc.", "summary": "ENEOS Holdings, Inc., through its subsidiaries, engages in the energy, oil and natural gas exploration and production (E&P), and metals businesses Japan, China, and internationally. The company operates through Energy, Oil and Natural Gas E&P, Metals, and Other segments. It manufactures and sells petroleum products, including gasoline, kerosene, lubricants, etc., as well as petrochemicals; imports and sells gas, such as LNG and liquefied petroleum gas; and offers copper concentrate, electrolytic coppers, electronic materials, etc. The company also explores, develops, produces, and sells crude oil, natural gas, other mineral resources, etc.; develops and mines nonferrous metals resources; refines and markets copper, gold, silver, sulfuric acid, copper foils, materials for rolling and processing, and thin film materials; recycles nonferrous metals; treats industrial waste; and generates and supplies electricity. In addition, it engages in the asphalt paving, civil engineering, construction, land transportation, and fund procurement businesses, as well as transportation by ships of non-ferrous metal products, titanium, and electric wires. Further, the company stores and transports crude oil and petroleum products; leases automobile-related supplies and goods; and purchases, leases, manages, and sells real estate properties. Additionally, it provides financial, accounting, salary and welfare, researching, studying, evaluating, designing and planning, and consulting services. The company was formerly known as JXTG Holdings, Inc. and changed its name to ENEOS Holdings, Inc. in June 2020. ENEOS Holdings, Inc. was founded in 1888 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6239.T": {"short_name": "NAGAOKA INTERNATIONAL CORPORATI", "long_name": "Nagaoka International Corporation", "summary": "Nagaoka International Corporation develops and sells water intake and treatment systems, and screen internals to oil refining and petrochemical industries worldwide. It offers screen internals for oil refining, and petrochemical and chemical fertilizer complexes. The company also provides screens used for groundwater intake purposes; and CHEMILES, a groundwater treatment system that is used in food processing, linen industry, hospitals, and other applications. In addition, it provides HiSIS, which is high-speed seabed infiltration system for seawater desalination; and ENERLES, a water treatment system for dam water. The company was founded in 1934 and is headquartered in Osaka, Japan. Nagaoka International Corporation is a subsidiary of HAMADA Co., Ltd.", "currency": "JPY", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "7462.T": {"short_name": "DAIYA TSUSHO", "long_name": "Daiya Tsusho Co.,Ltd.", "summary": "Daiya Tsusho Co.,Ltd. engages in the wholesale and direct sale of petroleum products in Japan. The company operates seven service stations in the Tokyo metropolitan area. It also operates community-based and specialized bicycle stores; and manages and rents office and store buildings. The company was founded in 1949 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7486.T": {"short_name": "SANRIN CO LTD", "long_name": "Sanrin Co., Ltd.", "summary": "Sanrin Co., Ltd. manufactures and sells briquette, bean coal, petroleum, LP gas, and other fuel products in Japan. It offers petroleum products, including gasoline, white kerosene, light oil, heavy oil, lubricates, and other products; LP gas for household, commercial, automobile, and industrial uses; and oxygen, nitrogen, and laughing gases, as well as other general high-pressure gases. The company also supplies hot pot, oil FF heaters, bathtub boilers, water heaters, LP gas/table water heaters, rice cookers, stoves, and machine bath kettles; and household equipment comprising bathtubs, washbasin units, sinks, clean flush toilets, septic tanks, solar hot water systems, central cleaner exhaust fans, ventilators, commercial kitchen equipment, and system kitchen and bath units. In addition, it provides solar power generation system and fuel cells; refrigerators, air-conditioners, fans, radiators, pump and cooling towers, warm-up machines, and other cold equipment; LP gas supply equipment, including propane containers, fuse cocks, regulators, steel pipes, and microcomputer gas meters; and household goods, such as gas leak alarms, fire alarms, anti-freeze products, and other consumer home appliances. Further, the company offers tires, car air-conditioners, batteries, and other car accessories; and high pressure gas equipment for industrial and medical purposes, as well as operates golf practice fields. Additionally, it designs and constructs air-conditioning and hot water supply facility construction; housing renovations; and high-pressure gas facilities for oxygen. Sanrin Co., Ltd. was founded in 1934 and is headquartered in Higashichikuma, Japan.", "currency": "JPY", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Higashichikuma-gun"}, "8037.T": {"short_name": "KAMEI CORP", "long_name": "Kamei Corporation", "summary": "Kamei Corporation operates as a general trading company in Japan and internationally. The company operates through Corporate Sales, Residential, Carlife, Food, Construction Materials, and Pharmacy divisions. It provides eco-friendly products, including LED lighting, eco pumps, and warm glasses; energy management-related products, such as solar power generation systems, lithium-ion storage batteries, etc.; chemical products comprising industrial chemicals, water treatment agents, alcohol, etc.; industrial materials and equipment consisting of logistics materials, compressors, generators, Karcher products, etc.; office supplies; ICT solutions and services; insurance products; and emergency earthquake warning systems, fire extinguishers, and fire-extinguishing equipment. The company also supplies automobile and industrial lubricants, oil products, LNG and LPG products, and home-use propane gas and kerosene; kitchen and hot water supply systems, as well as equipment; household fuel cells; built-in kitchens and baths; and alcoholic beverages, soft drinks, food products, restaurant ingredients, processing ingredients, etc. In addition, it operates a network of service stations that offer refueling services, as well as car wash, tire change, oil change, safety and vehicle inspection, coating, and other maintenance services; provides auto leasing services; and undertakes steel frame, exterior cladding, and metal siding construction works. Further, the company operates pharmacies; and offers renovation services. As of October 1, 2020, it operated 291 gas stations, 34 oil depots, 16 gas terminals, 6 automobile LPG stations, 2 food distribution centers, 104 pharmacies, and 1 supermarket. The company was formerly known as Kamei Shoten Co. and changed its name to Kamei Corporation in 1985. Kamei Corporation was founded in 1903 and is headquartered in Sendai, Japan.", "currency": "JPY", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Sendai"}, "8097.T": {"short_name": "SAN-AI OIL CO", "long_name": "San-Ai Oil Co.,Ltd.", "summary": "San-Ai Oil Co.,Ltd. engages in the wholesale and retail of petroleum products and liquefied petroleum gas. The company is also involved in the storage and related operation of petroleum products; gas pipeline service business; and general and community gas utility business. In addition, it engages in the aviation fuel storage facility and into-plane fuel service operations; sale and operation of energy-saving devices; design, construction, and consulting of airport fuel storage and hydrant systems; and generation and sale of electric power. Further, the company offers chemical products, including solvent and industrial chemicals, biocide products, microbial commissioned test products, commercial car wash products, fire extinguishing agents, and other chemical products. San-Ai Oil Co.,Ltd. was incorporated in 1947 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8132.T": {"short_name": "SINANEN HOLDINGS CO LTD", "long_name": "Sinanen Holdings Co., Ltd.", "summary": "Sinanen Holdings Co., Ltd. engages in the energy and non-energy related businesses in Japan and internationally. It provides products and services related to energy, such as LP gas and kerosene; and solutions comprising renovation and housing equipment, as well as housework and house cleaning services. The company also offers petroleum products to corporate customers that include gasoline, kerosene, diesel oil and fuel oil sales, and LP gas. In addition, it provides support for reducing energy costs and CO2 emissions, consultation for energy savings facilities, and electricity sales. Further, the company is involved in the retail of electricity to companies, local municipalities, public offices, and schools; and supply of fuel to ships. Additionally, it provides inorganic antimicrobial agents for various purposes, such as resin, fiber, and paint; ERP systems for the LP gas business; waste recycled fuels and materials comprising wood chips and recycled fuels, such as waste plastic and paper, and intermediate processing system of various mixed waste; coal consumer use; a range of services, including maintenance, management, and operation of buildings, cleaning, security, various construction works, material supply, and energy-related services. It also engages in the import and sale of bicycles; maintenance of apartments/condominiums; and installation, maintenance, and follow-up of air-conditioning, floor heating, and heat source equipment for detached/apartment houses. The company was formerly known as Sinanen Co., Ltd. and changed its name to Sinanen Holdings Co., Ltd. in October 2015. Sinanen Holdings Co., Ltd. was founded in 1927 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8133.T": {"short_name": "ITOCHU ENEX CO LTD", "long_name": "Itochu Enex Co.,Ltd.", "summary": "Itochu Enex Co.,Ltd. engages in the sale of petroleum and gas businesses in Japan and internationally. It operates through four divisions: Home-Life, Car-Life, Industrial Business, and Power & Utility. The Home-Life division is involved in the sale of liquefied petroleum gas (LPG), town gas, industrial gas, and specialty gas, electricity, and kerosene; gas for medical and automotive usage; household and smart energy equipment; solar power systems; ENEFARM residential fuel cells; ENE-POWABOL residential lithium-ion electricity storage systems; and welding materials, as well as supply of LPG and city gas to 1.5 million customers. This segment also engages in the remodeling and gas container pressure resistance inspection businesses. The Car-Life division sells gasoline, kerosene, diesel oil, electricity, automobiles, and lifestyle and automotive products; offers credit card services; and rents cars and terminal tanks, as well as engages in the import/export and trading of petroleum products. This segment also operates approximately 1,700 car-life stations and 420 rent-a-car service stores. The Industrial Business division sells gasoline, kerosene, diesel and fuel oil, GTL fuel, marine fuel, LPG, corporate fleet refueling card, and asphalt, as well as high-grade urea solution under the AdBlue name; and engages in the recycling of fly ash, and recovery and recycling of slop businesses. The Power & Utility division engages in the sale of electricity from coal-fired, natural gas-fired, wind, hydro, and photovoltaic power; and sells steam. This segment also offers district heating, energy, electricity/heat supply, and electricity power supply/demand management, as well as asset management services. The company was formerly known as Itochu Fuel Corporation and changed its name to Itochu Enex Co.,Ltd. in July 2001. The company was founded in 1961 and is headquartered in Tokyo, Japan. Itochu Enex Co.,Ltd. is a subsidiary of ITOCHU Corporation.", "currency": "JPY", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "I7B.F": {"short_name": "IDEMITSU KOSAN CO. LTD", "long_name": "Idemitsu Kosan Co.,Ltd.", "summary": "Idemitsu Kosan Co.,Ltd. manufactures and sells fuel oils and lubricant oils in Japan and internationally. It operates through Petroleum, Basic Chemicals, Functional Materials, Power and Renewable Energy, and Resources segments. The company's Petroleum segment engages in the procurement and sale of crude oil and refining of petroleum products; gasoline, diesel oil, kerosene, and automotive lubricants to service stations; and industrial kerosene, diesel oil, and heavy oil, and aviation and marine fuel. Its Basic Chemicals segment manufactures and sells olefins, such as ethylene, propylene, and butadiene; aromatics, including benzene, styrene monomer, mixed xylene, and paraxylene; and other chemicals. The company's Functional Materials segment researches, develops, manufactures, and sells automotive, marine, and industrial lubricants, as well as grease; engineering plastic, adhesive materials, derivative products, and solvents; electronic materials, such as OLED; asphalt; microbial pesticides, soil amendments, and livestock related materials; and solid state lithium ion battery materials. Its Power and Renewable Energy segment operates thermal power plants; develops and operates renewable energy sources, including solar, wind, and biomass power plants; engages in the supply, wholesale, and retail of electric power; researches, develops, and manufactures CIS thin-film solar modules; and sale of solar power systems. The company Resources segments explores, develops, and produces oil and gas; produces and sells coal and uranium; operates geothermal power plants; and sale of electric power and steam. Idemitsu Kosan Co.,Ltd. was founded in 1911 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "IDKOY": {"short_name": "IDEMITSU KOSAN CO.LTD", "long_name": "Idemitsu Kosan Co.,Ltd.", "summary": "Idemitsu Kosan Co.,Ltd. manufactures and sells fuel oils and lubricant oils in Japan and internationally. It operates through Petroleum Products, Petrochemical Products, Resources, and Others segments. The company offers lubricants, including marine and maintenance oils, metal working and industrial oils, grease products, traction drive fluids, polyvinyl ethers, and polyalkylene glycol oils; and petrochemicals, such as basic and performance chemicals, and engineering plastics. It also investigates, explores, develops, and sells oil and gas, coal, uranium, and geothermal resources; and provides agricultural biotechnology products, as well as animal feeds. In addition, the company generates renewable energy from wind, solar, biofuels, and hydrogen; and produces and sells electronic materials consisting of OLED materials. Further, it transports petroleum products; sells service station products; and offers credit card services. Additionally, the company is involved in the research and development, production, and distribution of synthetic plastic processed products. Idemitsu Kosan Co.,Ltd. was founded in 1911 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "JHJ.F": {"short_name": "ENEOS HOLDINGS INC.", "long_name": "ENEOS Holdings, Inc.", "summary": "ENEOS Holdings, Inc., through its subsidiaries, engages in the energy, oil and natural gas exploration and production (E&P), and metals businesses Japan, China, and internationally. The company operates through Energy, Oil and Natural Gas E&P, Metals, and Other segments. It manufactures and sells petroleum products, including gasoline, kerosene, lubricants, etc., as well as petrochemicals; imports and sells gas, such as LNG and liquefied petroleum gas; and offers copper concentrate, electrolytic coppers, electronic materials, etc. The company also explores, develops, produces, and sells crude oil, natural gas, other mineral resources, etc.; develops and mines nonferrous metals resources; refines and markets copper, gold, silver, sulfuric acid, copper foils, materials for rolling and processing, and thin film materials; recycles nonferrous metals; treats industrial waste; and generates and supplies electricity. In addition, it engages in the asphalt paving, civil engineering, construction, land transportation, and fund procurement businesses, as well as transportation by ships of non-ferrous metal products, titanium, and electric wires. Further, the company stores and transports crude oil and petroleum products; leases automobile-related supplies and goods; and purchases, leases, manages, and sells real estate properties. Additionally, it provides financial, accounting, salary and welfare, researching, studying, evaluating, designing and planning, and consulting services. The company was formerly known as JXTG Holdings, Inc. and changed its name to ENEOS Holdings, Inc. in June 2020. ENEOS Holdings, Inc. was founded in 1888 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "JXHGF": {"short_name": "ENEOS HOLDINGS INC", "long_name": "ENEOS Holdings, Inc.", "summary": "ENEOS Holdings, Inc., through its subsidiaries, engages in the energy, oil and natural gas exploration and production (E&P), and metals businesses Japan, China, and internationally. The company operates through Energy, Oil and Natural Gas E&P, Metals, and Other segments. It manufactures and sells petroleum products, including gasoline, kerosene, lubricants, etc., as well as petrochemicals; imports and sells gas, such as LNG and liquefied petroleum gas; and offers copper concentrate, electrolytic coppers, electronic materials, etc. The company also explores, develops, produces, and sells crude oil, natural gas, other mineral resources, etc.; develops and mines nonferrous metals resources; refines and markets copper, gold, silver, sulfuric acid, copper foils, materials for rolling and processing, and thin film materials; recycles nonferrous metals; treats industrial waste; and generates and supplies electricity. In addition, it engages in the asphalt paving, civil engineering, construction, land transportation, and fund procurement businesses, as well as transportation by ships of non-ferrous metal products, titanium, and electric wires. Further, the company stores and transports crude oil and petroleum products; leases automobile-related supplies and goods; and purchases, leases, manages, and sells real estate properties. Additionally, it provides financial, accounting, salary and welfare, researching, studying, evaluating, designing and planning, and consulting services. The company was formerly known as JXTG Holdings, Inc. and changed its name to ENEOS Holdings, Inc. in June 2020. ENEOS Holdings, Inc. was founded in 1888 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "JXHLY": {"short_name": "ENEOS HOLDINGS INC", "long_name": "ENEOS Holdings, Inc.", "summary": "ENEOS Holdings, Inc., through its subsidiaries, engages in the energy, oil and natural gas exploration and production (E&P), and metals businesses Japan, China, and internationally. The company operates through Energy, Oil and Natural Gas E&P, Metals, and Other segments. It manufactures and sells petroleum products, including gasoline, kerosene, lubricants, etc., as well as petrochemicals; imports and sells gas, such as LNG and liquefied petroleum gas; and offers copper concentrate, electrolytic coppers, electronic materials, etc. The company also explores, develops, produces, and sells crude oil, natural gas, other mineral resources, etc.; develops and mines nonferrous metals resources; refines and markets copper, gold, silver, sulfuric acid, copper foils, materials for rolling and processing, and thin film materials; recycles nonferrous metals; treats industrial waste; and generates and supplies electricity. In addition, it engages in the asphalt paving, civil engineering, construction, land transportation, and fund procurement businesses, as well as transportation by ships of non-ferrous metal products, titanium, and electric wires. Further, the company stores and transports crude oil and petroleum products; leases automobile-related supplies and goods; and purchases, leases, manages, and sells real estate properties. Additionally, it provides financial, accounting, salary and welfare, researching, studying, evaluating, designing and planning, and consulting services. The company was formerly known as JXTG Holdings, Inc. and changed its name to ENEOS Holdings, Inc. in June 2020. ENEOS Holdings, Inc. was founded in 1888 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "TOAOF": {"short_name": "TOA OIL COMPANY LIMITED", "long_name": "TOA Oil Co., Ltd.", "summary": "TOA Oil Co., Ltd., together with its subsidiaries, engages in petroleum refining and power generation business in Japan. The company offers various oil products, such as gasoline, kerosene, diesel oil and heavy oil. The company was formerly known as Nippon Jyuyu Co., Ltd. and changed its name to TOA Oil Co., Ltd. in April 1942. The company was founded in 1924 and is headquartered in Kawasaki, Japan. TOA Oil Co., Ltd. is a subsidiary of Showa Shell Sekiyu K.K.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Kawasaki"}}