{"1775.HK": {"short_name": "BEXCELLENT GP", "long_name": "BExcellent Group Holdings Limited", "summary": "BExcellent Group Holdings Limited, an investment holding company, provides private supplementary secondary school education in Hong Kong. It operates private supplementary secondary school education services for students from secondary 1 to secondary 6 under the Beacon College brand; and private secondary day school services to secondary 4, 5, and 6 level students under the Beacon Day School brand. The company also provides various ancillary education services and products, including interview preparation, language and supplementary primary school education, and tutorial and consultation services under our Diverse Learning Club, Beacon Childhood, BeConfident, Glocal Education, and Mathgic brands; mock examination, VIP self-study, and online course scheduling and management services; IELTS, general interest, and foreign language courses under the Beacon BExcellent brand; higher national diploma in business under the Beacon CAPE brand; other education services Ascent Prep brand name; overseas study consultation services under GES brand; and online retail business under Beacon Living brand name. In addition, it offers childhood education services; and information technology services, as well as operates advertising agency. As at 31 July 2020, it operated 17 teaching centers with a total of 131 classrooms. The company was founded in 1989 and is headquartered in Tsuen Wan, Hong Kong. BExcellent Group Holdings Limited is a subsidiary of Beacon Enterprise Limited.", "currency": "HKD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Tsuen Wan"}, "8055.HK": {"short_name": "CHI E-INFO TECH", "long_name": "China E-Information Technology Group Limited", "summary": "China E-Information Technology Group Limited, an investment holding company, provides internet platform for education programs in Chinese medicines, and other advisory and training programs in the People's Republic of China. The company offers occupational education, industry certification courses, skills training, and education consultation services; management services; distance learning program in Chinese medicine; and healthcare services. It also operates Chinese medicine health centers, and training centers. The company was formerly known as China E-Learning Group Limited and changed its name to China E-Information Technology Group Limited in June 2017. China E-Information Technology Group Limited was incorporated in 2001 and is headquartered in Wanchai, Hong Kong.", "currency": "HKD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "8363.HK": {"short_name": "SDM GROUP", "long_name": "SDM Group Holdings Limited", "summary": "SDM Group Holdings Limited, an investment holding company, operates dance institutions for children. It offers a range of dance courses, including elementary, RAD ballet, CSTD jazz, pop, and other dance courses. The company also sells dance uniforms, shoes, and accessories. It provides its services for children between the age of 1 and 16 under the SDM Jazz & Ballet Academie brand name. In addition, the company offers swallowing and speech treatments; photographic services for children. As of December 31, 2019, it had 22 self-operated dance centers, 3 joint venture dance centers, 2 kindergartens in Hong Kong, seven international pre-schools in Singapore, and two colleges in Australia. The company was founded in 2006 and is headquartered in Kwun Tong, Hong Kong. SDM Group Holdings Limited is a subsidiary of Wealthy Together Limited.", "currency": "HKD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Kwun Tong"}, "8417.HK": {"short_name": "DADI EDU", "long_name": "Dadi Education Holdings Limited", "summary": "Dadi Education Holdings Limited, an investment holding company, provides overseas studies consultancy services in Hong Kong. The company also provides education information technology services. It serves students seeking secondary and higher education studies in the United Kingdom, Australia, Canada, New Zealand, the United States, and internationally. The company was founded in 1990 and is headquartered in Mong Kok, Hong Kong. Dadi Education Holdings Limited is a subsidiary of Grand Courage Investments Limited.", "currency": "HKD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Mong Kok"}, "RTE.AX": {"short_name": "RETECH CDI 1:1", "long_name": "Retech Technology Co., Limited", "summary": "Retech Technology Co., Limited, an investment holding company, provides technology solutions to corporate customers, vocational schools, and training providers in the People's Republic of China, Hong Kong, and Australia. The company also develops E-Learning platforms and E-Course, which enables its clients to deliver their offline training content online through various channels or devices, such as desktop, mobile, etc. It also provides consultancy services; and software licensing services, as well as operates language coaching schools. The company was incorporated in 2016 and is based in Wan Chai, Hong Kong.", "currency": "AUD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "ASX", "market": "au_market", "country": "Hong Kong", "city": "Central"}, "UMEWF": {"short_name": "UMEWORLD LTD", "long_name": "UMeWorld Limited", "summary": "UMeWorld Limited, a holding company, operates as an educational technology company with a focus on the K-12 education market in China. The company's K-12 flagship product is UMFun, a cloud-based assessment and learning analytics platform that analyzes and adapts to a student's performance and personalizes the delivery of proprietary educational items in accordance with the student's learning needs. The company's platform provides standards-based instruction, practice, assessments, and productivity tools that enhance the performance of educators and students. Its products also enable educators to track student performance in real-time to address individual student learning gaps, while allowing administrators to monitor student progress and measure teacher effectiveness. UMeWorld Limited serves schools, teachers, students, and parents through online and mobile platforms. The company was formerly known as AlphaRx, Inc. and changed its name to UMeWorld Limited in March 2013. UMeWorld has a strategic cooperation with Miniso. UMeWorld Limited was founded in 1997 and is headquartered in Causeway Bay, Hong Kong.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Causeway Bay"}}