{
    "000025.SZ": {
        "short_name": "SHN TELLUS HLDNGS",
        "long_name": "Shenzhen Tellus Holding Co., Ltd.",
        "summary": "Shenzhen Tellus Holding Co., Ltd., together with its subsidiaries, engages in the sale and maintenance of cars in the People's Republic of China. It engages in the inspection and repair of motor vehicles; manufacture and maintenance of automobiles; sale of accessories; sale of jewelry; manufacture of inspection equipment for motor vehicles; and rental and management of real estate properties. It also provides resource asset management services. The company was formerly known as Shenzhen Tellus Machinery Holding Company Limited and changed its name to Shenzhen Tellus Holding Co., Ltd. in March 1993. The company was founded in 1986 and is based in Shenzhen, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "1268.HK": {
        "short_name": "MEIDONG AUTO",
        "long_name": "China MeiDong Auto Holdings Limited",
        "summary": "China MeiDong Auto Holdings Limited, an investment holding company, operates as an automobile dealer in the People's Republic of China. The company is involved in the sale of new passenger cars and spare parts; and the provision of service and survey. It also provides after-sales services, such as auto registration, insurance, auto parts, repair and replacement, sales and maintenance of automotive supplies, etc.; financing referral solutions; and other value added services. In addition, the company engages in the trading of used vehicle and finance leasing activities. Its dealership stores cover various automobile brands comprising BMW/Mini, Audi, Lexus, Toyota, Hyundai, and Porsche. As of December 31, 2019, it operated 58 4S dealership stores in Beijing, Guangdong, Fujian, Jiangxi, Hunan, Hubei, Hebei, Anhui, and Gansu provinces. The company was founded in 2003 and is headquartered in Dongguan, the People's Republic of China. China MeiDong Auto Holdings Limited is a subsidiary of Apex Sail Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Dongguan"
    },
    "1293.HK": {
        "short_name": "GRAND BAOXIN",
        "long_name": "Grand Baoxin Auto Group Limited",
        "summary": "Grand Baoxin Auto Group Limited, an investment holding company, engages in the sale and service of motor vehicles primarily in Mainland China. The company also provides after-sales services, such as maintenance, repair, and vehicle customization, as well as sells related auto parts; sells accessories and other automobile related products, as well as used cars; and provides auto insurance services. In addition, it offers finance leasing, insurance agency, real estate, services. As of December 31, 2019, Grand Baoxin Auto Group Limited operated 113 stores, including 91 luxury and ultra-luxury brand dealing stores, 17 mid-to-high brand dealing stores and 5 independent after-sales service stores. The company was formerly known as Baoxin Auto Group Limited and changed its name to Grand Baoxin Auto Group Limited in April 2017. Grand Baoxin Auto Group Limited was founded in 1999 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "1365.HK": {
        "short_name": "RUNDONG AUTO",
        "long_name": "China Rundong Auto Group Limited",
        "summary": "China Rundong Auto Group Limited, an investment holding company, engages in the sale and service of motor vehicles in Mainland China. The company's brand portfolio includes 8 luxury brands, which comprise BMW, MINI, Jaguar, Land Rover, Audi, Lexus, Cadillac, and Chrysler; 2 ultra-luxury brands, such as Maserati and Ferrari; and 15 mid and high end brands consisting of Buick, Hyundai, Ford, Chevrolet, Shanghai-Volkswagen, Kia, Dongfeng Honda, Guangqi Honda, FAW-Toyota, GAC Toyota, Toyota, Dongfeng Nissan, Zhengzhou Nissan, FAW-Volkswagen, and BAIC New Energy. It also provides after-sale services; and sells spare parts and accessories. In addition, the company engages in the brokerage of automobile insurance; and provision of automobile financing and leasing services. As of December 31, 2019, it operated 38 stores. The company was formerly known as China Greenland Rundong Auto Group Limited and changed its name to China Rundong Auto Group Limited in February 2017. China Rundong Auto Group Limited was founded in 1998 and is headquartered in Shanghai, China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "1771.HK": {
        "short_name": "SUNFONDA GP",
        "long_name": "Sunfonda Group Holdings Limited",
        "summary": "Sunfonda Group Holdings Limited, an investment holding company, engages in the sale and service of motor vehicles in Mainland China. The company sells imported and domestically manufactured luxury and ultra-luxury automobiles. It also offers after-sales services comprising maintenance and repair services, sale of spare parts, and automobile detailing services; and other value-added services, such as automobile insurance agency, automobile financing, automobile licensing, and automobile survey services. In addition, the company provides logistics and storage services; technology development and Internet services; and sale and service of second-hand cars. The company was founded in 2000 and is headquartered in Xi'an, the People's Republic of China. Sunfonda Group Holdings Limited is a subsidiary of Top Wheel Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Xi'an"
    },
    "1CY.F": {
        "short_name": "CHINA YONG.AUTOM.S.HD-,01",
        "long_name": "China Yongda Automobiles Services Holdings Limited",
        "summary": "China Yongda Automobiles Services Holdings Limited, an investment holding company, operates as a passenger vehicle retailer and service provider. The company focuses on luxury and ultra-luxury brands. It offers repair and maintenance services; automobile extended products and services, including spare parts and accessories, automobile decoration products, automobile care services, agency services of vehicle title registration, and vehicle inspection services; and agency services for automobile finance and insurance products. The company also provides automobile rental services and finance leasing services; and sells pre-owned vehicles, as well as offers after-sales services primarily through its 4S dealerships, including sales, spare parts, service, and survey. As of December 31, 2019, it had 246 outlets located across 4 municipalities and 18 provinces in the People's Republic of China. In addition, the company provides information consultancy services. China Yongda Automobiles Services Holdings Limited was incorporated in 2011 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shanghai"
    },
    "1GV.SG": {
        "short_name": "Gallant Venture Ltd. Registered",
        "long_name": "Gallant Venture Ltd.",
        "summary": "Gallant Venture Ltd., an investment holding company, operates as an integrated automotive company primarily in Indonesia. Its Industrial parks segment develops, constructs, operates, and maintains industrial properties in Batam and Bintan Islands with supporting infrastructure activities. The company's Utilities segment provides electricity and water supply, telecommunications, waste management, and sewage treatment services to the industrial parks and resorts in Batam and Bintan Islands. It operates 18 dual fuel fired generators with an installed capacity of approximately 125MW at Batamindo Industrial Park; 6 generators with an installed capacity of approximately 10MW at Bintan Industrial Estate; and 4 generators with an installed capacity of approximately 24MW at Bintan Resorts. Its Resort Operations segment offers services to resort operators in Bintan Resort, including ferry services and ferry terminal operations, tour operations, property rental, workers accommodation, security, fire-fighting, and medical support services, as well as facilities required by resort operators. This segment also provides estate and township maintenance services, such as road maintenance and drainage, as well as operates a 24-hour crisis center. The company's Property Development segment develops industrial and resort properties in Batam and Bintan Islands. Its Automotive segment engages in the vehicle sales distribution, after sales services, vehicle ownership financing, spare part distribution, vehicle assembly, automotive parts manufacturing, and other related supporting activities. The company also offers business management consultancy services; engages in the Wholesaler of hotels, resorts, and golf courses. The company was incorporated in 2003 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "200025.SZ": {
        "short_name": "SHN TELLUS HLDNGS",
        "long_name": "Shenzhen Tellus Holding Co., Ltd.",
        "summary": "Shenzhen Tellus Holding Co., Ltd., together with its subsidiaries, engages in the sale and maintenance of cars in the People's Republic of China. It engages in the inspection and repair of motor vehicles; manufacture and maintenance of automobiles; sale of accessories; sale of jewelry; manufacture of inspection equipment for motor vehicles; and rental and management of real estate properties. It also provides resource asset management services. The company was formerly known as Shenzhen Tellus Machinery Holding Company Limited and changed its name to Shenzhen Tellus Holding Co., Ltd. in March 1993. The company was founded in 1986 and is based in Shenzhen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "2207.TW": {
        "short_name": "HOTAI MOTOR CO",
        "long_name": "Hotai Motor Co.,Ltd.",
        "summary": "Hotai Motor Co., Ltd. primarily engages in assembling, trading, importing, selling, and repairing vehicles, automobile air conditioners, and related parts in Taiwan and Mainland China. The company provides products of various auto brands, including TOYOTA, LEXUS, HINO, and TOYOTA industrial equipment. It is also involved in the installment sales and vehicle leasing, used vehicles selling, and property insurance activities. The company was founded in 1947 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "2754.T": {
        "short_name": "TOKATSU HOLDINGS CO LTD",
        "long_name": "Tokatsu Holdings Co., Ltd.",
        "summary": "Tokatsu Holdings Co., Ltd. engages in the sale of automobiles in Japan. The company sells new and used cars. It also provides maintenance services, as well as engages in the life and property insurance agency business. The company was founded in 1969 and is headquartered in Matsudo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Matsudo"
    },
    "3011.T": {
        "short_name": "BANNERS CO LTD",
        "long_name": "Banners Co., Ltd.",
        "summary": "Banners Co., Ltd. engages in the real estate, and automobile and musical instruments sales businesses in Japan. The company creates and rents living-oriented stores and facilities; and sells Honda vehicles and related non-life insurance products. It also imports and sells oboe and bathoons through a specialty store of double reed musical instruments; and provides after-sales services for musical instruments customers. In addition, the company sells various building materials. Banners Co., Ltd. was founded in 1950 and is headquartered in Kumagaya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kumagaya"
    },
    "3184.T": {
        "short_name": "INTERNATIONAL CONGLOMERATE DSB ",
        "long_name": "International Conglomerate of Distribution for Automobile Holdings Co., Ltd.",
        "summary": "International Conglomerate of Distribution for Automobile Holdings Co., Ltd. engages in the automobile sales-related and automobile recycling businesses in Japan and internationally. It is involved in the sale of new and used cars; car rental, inspection, maintenance, and repair activities; and automobile insurance business, including automobile liability and voluntary insurance products. The company was founded in 1967 and is headquartered in Suzuka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Suzuka"
    },
    "3186.T": {
        "short_name": "NEXTAGE CO LTD",
        "long_name": "NEXTAGE Co., Ltd.",
        "summary": "NEXTAGE Co., Ltd. engages in the retail sale of new and used cars in Japan. It also engages in the provision of vehicle maintenance and repair, as well as vehicle safety inspection services; operation of an insurance agency; purchase of used cars; and car exterior coating business. The company was founded in 1998 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Nagoya"
    },
    "31K.F": {
        "short_name": "AUTOCANADA INC.",
        "long_name": "AutoCanada Inc.",
        "summary": "AutoCanada Inc., through its subsidiaries, operates franchised automobile dealerships in British Columbia, Alberta, Saskatchewan, Manitoba, Ontario, Quebec, Nova Scotia, and New Brunswick, Canada; and Illinois, the United States. The company offers a range of automotive products and services, including new and used vehicles, vehicle leasing, vehicle parts, vehicle maintenance and collision repair services, extended service contracts, and vehicle protection and other after-market products. It also arranges financing and insurance for vehicle purchases by its customers through third-party finance and insurance sources. The company sells its vehicles under the Chrysler, Dodge, Jeep, Ram, FIAT, Alfa Romeo, Chevrolet, GMC, Buick, Cadillac, Ford, Infiniti, Nissan, Hyundai, Subaru, Audi, Volkswagen, Kia, Mazda, Mercedes-Benz, BMW, MINI, Volvo, Toyota, Lincoln, and Honda brands. As of April 20, 2020, it operated 63 franchised dealerships in Canada, as well as in Illinois. AutoCanada Inc. was incorporated in 2009 and is headquartered in Edmonton, Canada.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Edmonton"
    },
    "3377.T": {
        "short_name": "BIKE O & CO LTD",
        "long_name": "BIKE O & COMPANY Ltd.",
        "summary": "BIKE O & COMPANY Ltd. distributes and retails used motorcycles in Japan. It manages the purchasing motorcycle-only special shops; and sells purchased motorcycles at auction halls to motorcycle retailers. The company was founded in 1994 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3538.T": {
        "short_name": "WILLPLUS HOLDINGS CORPORATION",
        "long_name": "WILLPLUS Holdings Corporation",
        "summary": "WILLPLUS Holdings Corporation imports and sells new and used cars through stores in Japan. The company was founded in 2007 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3669.HK": {
        "short_name": "YONGDA AUTO",
        "long_name": "China Yongda Automobiles Services Holdings Limited",
        "summary": "China Yongda Automobiles Services Holdings Limited, an investment holding company, operates as a passenger vehicle retailer and service provider. The company focuses on luxury and ultra-luxury brands. It offers repair and maintenance services; automobile extended products and services, including spare parts and accessories, automobile decoration products, automobile care services, agency services of vehicle title registration, and vehicle inspection services; and agency services for automobile finance and insurance products. The company also provides automobile rental services and finance leasing services; and sells pre-owned vehicles, as well as offers after-sales services primarily through its 4S dealerships, including sales, spare parts, service, and survey. As of December 31, 2019, it had 246 outlets located across 4 municipalities and 18 provinces in the People's Republic of China. In addition, the company provides information consultancy services. China Yongda Automobiles Services Holdings Limited was incorporated in 2011 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "4Q01.F": {
        "short_name": "RUMBLEON CL.B  DL-,001",
        "long_name": "RumbleON, Inc.",
        "summary": "RumbleON, Inc., a development stage company, provides an e-commerce platform that facilitates consumers and dealers to buy, sell, trade, and finance pre-owned recreation vehicles. It primarily focuses on pre-owned Harley-Davidson motorcycles and other powersports. The company also provides third-party financing services. The company was formerly known as Smart Server, Inc. and changed its name to RumbleON, Inc. in February 2017. RumbleON, Inc. was incorporated in 2013 and is based in Irving, Texas.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Irving"
    },
    "55M.SG": {
        "short_name": "China Meidong Auto Hldgs Ltd. R",
        "long_name": "China MeiDong Auto Holdings Limited",
        "summary": "China MeiDong Auto Holdings Limited, an investment holding company, operates as an automobile dealer in the People's Republic of China. The company is involved in the sale of new passenger cars and spare parts; and the provision of service and survey. It also provides after-sales services, such as auto registration, insurance, auto parts, repair and replacement, sales and maintenance of automotive supplies, etc.; financing referral solutions; and other value added services. In addition, the company engages in the trading of used vehicle and finance leasing activities. Its dealership stores cover various automobile brands comprising BMW/Mini, Audi, Lexus, Toyota, Hyundai, and Porsche. As of December 31, 2019, it operated 58 4S dealership stores in Beijing, Guangdong, Fujian, Jiangxi, Hunan, Hubei, Hebei, Anhui, and Gansu provinces. The company was founded in 2003 and is headquartered in Dongguan, the People's Republic of China. China MeiDong Auto Holdings Limited is a subsidiary of Apex Sail Limited.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "STU",
        "market": "dr_market",
        "country": "China",
        "city": "Dongguan"
    },
    "5IG.SI": {
        "short_name": "Gallant Venture",
        "long_name": "Gallant Venture Ltd.",
        "summary": "Gallant Venture Ltd., an investment holding company, operates as an integrated automotive company primarily in Indonesia. Its Industrial parks segment develops, constructs, operates, and maintains industrial properties in Batam and Bintan Islands with supporting infrastructure activities. The company's Utilities segment provides electricity and water supply, telecommunications, waste management, and sewage treatment services to the industrial parks and resorts in Batam and Bintan Islands. It operates 18 dual fuel fired generators with an installed capacity of approximately 125MW at Batamindo Industrial Park; 6 generators with an installed capacity of approximately 10MW at Bintan Industrial Estate; and 4 generators with an installed capacity of approximately 24MW at Bintan Resorts. Its Resort Operations segment offers services to resort operators in Bintan Resort, including ferry services and ferry terminal operations, tour operations, property rental, workers accommodation, security, fire-fighting, and medical support services, as well as facilities required by resort operators. This segment also provides estate and township maintenance services, such as road maintenance and drainage, as well as operates a 24-hour crisis center. The company's Property Development segment develops industrial and resort properties in Batam and Bintan Islands. Its Automotive segment engages in the vehicle sales distribution, after sales services, vehicle ownership financing, spare part distribution, vehicle assembly, automotive parts manufacturing, and other related supporting activities. The company also offers business management consultancy services; engages in the Wholesaler of hotels, resorts, and golf courses. The company was incorporated in 2003 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "5ZL.F": {
        "short_name": "LAZYDAYS HOLDINGS INC.",
        "long_name": "Lazydays Holdings, Inc.",
        "summary": "Lazydays Holdings, Inc. operates recreation vehicle (RV) dealerships under the Lazydays name in the United States. It provides RV sales, RV parts and services, after-market parts and accessories, and RV camping facilities. The company offers various new and used RVs; onsite general RV maintenance and repair services; and collision repair services, as well as sells and installs various parts and accessories. It also operates the Lazydays RV resort at Tampa, Florida. In addition, the company arranges financing for vehicle purchases through third-party finance sources; and offers various third-party protection plans and services to the purchasers of its RVs. It operates dealerships locations at The Villages, Florida; Tucson, Arizona; Minneapolis, Minnesota; Knoxville, Tennessee; and Loveland and Denver, Colorado. The company was founded in 1976 and is based in Seffner, Florida.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Seffner"
    },
    "600653.SS": {
        "short_name": "LIAONING SHENHUA HOLDINGS CO LT",
        "long_name": "Liaoning Shenhua Holdings CO.,LTD.",
        "summary": "Liaoning Shenhua Holdings CO.,LTD. engages in the automobile sales and after-market services, new energy, real estate, financial investment, and industrial management businesses in China. The company sells China motors, and BMW and other brand cars, as well as VIP cars; manages office buildings and factory buildings; and offers building investment and real estate project services. It also operates wind and photovoltaic power projects. In addition, the company is involved in the automotive expo park business; provision of online travel management services through ltstar.com, lthotel.cn, and ltfly.com.cn platforms; supply of automotive products, electronic products, auto parts, and aftermarket products; financial leasing business; and research and development, modification, and sale of medical emergency products for imported and domestic medical vehicles, including ambulances and medical examination vehicles. Further, it provides higher vocational education, and middle and senior vocational skills education services. The company was formerly known as Shanghai Shenhua Holdings Co., Ltd. and changed its name to Liaoning Shenhua Holdings CO.,LTD. in December 2020. Liaoning Shenhua Holdings CO.,LTD. was founded in 1986 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "601258.SS": {
        "short_name": "PANGDA AUTOMOBILE TRADE CO. LTD",
        "long_name": "Pang Da Automobile Trade Co., Ltd",
        "summary": "Pang Da Automobile Trade Co., Ltd trades in automobiles in of China and Mongolia. It provides passenger cars, trucks, minibuses, and agricultural and engineering vehicles under various brands. The company was founded in 1988 and is headquartered in Tangshan, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Tangshan"
    },
    "6BA.F": {
        "short_name": "GRAND BAOXIN AUTO GRP LTD",
        "long_name": "Grand Baoxin Auto Group Limited",
        "summary": "Grand Baoxin Auto Group Limited, an investment holding company, engages in the sale and service of motor vehicles primarily in Mainland China. The company also provides after-sales services, such as maintenance, repair, and vehicle customization, as well as sells related auto parts; sells accessories and other automobile related products, as well as used cars; and provides auto insurance services. In addition, it offers finance leasing, insurance agency, real estate, services. As of December 31, 2019, Grand Baoxin Auto Group Limited operated 113 stores, including 91 luxury and ultra-luxury brand dealing stores, 17 mid-to-high brand dealing stores and 5 independent after-sales service stores. The company was formerly known as Baoxin Auto Group Limited and changed its name to Grand Baoxin Auto Group Limited in April 2017. Grand Baoxin Auto Group Limited was founded in 1999 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shanghai"
    },
    "7599.T": {
        "short_name": "IDOM INC",
        "long_name": "IDOM Inc.",
        "summary": "IDOM Inc. purchases and sells used cars in Japan and internationally. The company also sells new cars. It operates through a network of approximately 500 stores under the Gulliver brand. The company was formerly known as Gulliver International Co. Ltd. and changed its name to IDOM Inc. in July 2016. IDOM Inc. was founded in 1994 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7602.T": {
        "short_name": "CARCHS HOLDINGS CO.LTD",
        "long_name": "Carchs Holdings Co., Ltd.",
        "summary": "Carchs Holdings Co., Ltd. purchases, sells, and distributes automobiles. It sells used cars through its retail stores, as well as exports through the Internet site, PicknBuy24.com. The company also engages in the wholesale and distribution of spare parts and accessories of automobile through the online shop. In addition, it provides car maintenance services; and property and casualty insurance products, primarily car insurance. The company operates 38 stores in Japan. Carchs Holdings Co., Ltd. was founded in 1987 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7623.T": {
        "short_name": "SUNAUTAS CO LTD",
        "long_name": "Sunautas Co., Ltd.",
        "summary": "Sunautas Co., Ltd. sells automobile and petroleum products in Japan. It also provides maintenance, rent-a-car, and property and casualty insurance agency services. In addition, the company operates gas stations under the ENEOS KYGNUS brand; acts as an automotive dealer for Shonan BMW and Peugeot; and provides various services related to fuel oil, as well as new cars, used cars, service maintenance, and Jeep accessories and parts. The company was formerly known as Asahi Shokai Co., Ltd. and changed its name to Sunautas Co., Ltd. in 1992. Sunautas Co., Ltd. was founded in 1945 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "7680.T": {
        "short_name": "KEIJIDOUSHAKAN CO LTD",
        "long_name": "KEIJIDOUSYAKAN. Co., Ltd.",
        "summary": "KEIJIDOUSYAKAN. Co., Ltd. engages in buying and selling new/used cars. It also sells auto parts, as well as provides car maintenance and insurance agency services. The company was founded in 1998 and is headquartered Sapporo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Sapporo"
    },
    "8291.T": {
        "short_name": "NISSAN TOKYO SALES HLDG",
        "long_name": "Nissan Tokyo Sales Holdings Co., Ltd.",
        "summary": "Nissan Tokyo Sales Holdings Co., Ltd. engages in the automobile dealership business in Japan. It is involved in the Nissan and Renault car sales, maintenance, and parts supplies and sales activities; purchase and sale of used cars; sports car rental business; and vehicle inspection, race management, system solution, vehicle transport, registration agency, and taxi businesses. The company also offers general and life insurance agency services; and plans, develops, and sells campers. In addition, it operates a sports car main portal site. Nissan Tokyo Sales Holdings Co., Ltd. was founded in 1942 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "ABG": {
        "short_name": "Asbury Automotive Group Inc",
        "long_name": "Asbury Automotive Group, Inc.",
        "summary": "Asbury Automotive Group, Inc., together with its subsidiaries, operates as an automotive retailer in the United States. It offers a range of automotive products and services, including new and used vehicles; and vehicle repair and maintenance services, replacement parts, and collision repair services. The company also provides finance and insurance products, including arranging vehicle financing through third parties; and aftermarket products, such as extended service contracts, guaranteed asset protection debt cancellation, prepaid maintenance, and credit life and disability insurance. As of December 31, 2019, the company owned and operated 107 new vehicle franchises representing 31 brands of automobiles at 88 dealership locations; and 25 collision centers in the United States. Asbury Automotive Group, Inc. was founded in 1996 and is headquartered in Duluth, Georgia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Duluth"
    },
    "ACG-R.BK": {
        "short_name": "AUTOCORP HOLDING PUBLIC COMPANY",
        "long_name": "Autocorp Holding Public Company Limited",
        "summary": "Autocorp Holding Public Company Limited, a dealer, distributes cars and spare parts in Thailand. It also offers car leasing and insurance services; and maintenance, repair, and after sale services. The company was founded in 2015 and is headquartered in Khon Kaen, Thailand.",
        "currency": "THB",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Khon Kaen"
    },
    "ACG.BK": {
        "short_name": "AUTOCORP HOLDING PUBLIC COMPANY",
        "long_name": "Autocorp Holding Public Company Limited",
        "summary": "Autocorp Holding Public Company Limited, a dealer, distributes cars and spare parts in Thailand. It also offers car leasing and insurance services; and maintenance, repair, and after sale services. The company was founded in 2015 and is headquartered in Khon Kaen, Thailand.",
        "currency": "THB",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Khon Kaen"
    },
    "ACQ.TO": {
        "short_name": "AUTOCANADA INC",
        "long_name": "AutoCanada Inc.",
        "summary": "AutoCanada Inc., through its subsidiaries, operates franchised automobile dealerships in British Columbia, Alberta, Saskatchewan, Manitoba, Ontario, Quebec, Nova Scotia, and New Brunswick, Canada; and Illinois, the United States. The company offers a range of automotive products and services, including new and used vehicles, vehicle leasing, vehicle parts, vehicle maintenance and collision repair services, extended service contracts, and vehicle protection and other after-market products. It also arranges financing and insurance for vehicle purchases by its customers through third-party finance and insurance sources. The company sells its vehicles under the Chrysler, Dodge, Jeep, Ram, FIAT, Alfa Romeo, Chevrolet, GMC, Buick, Cadillac, Ford, Infiniti, Nissan, Hyundai, Subaru, Audi, Volkswagen, Kia, Mazda, Mercedes-Benz, BMW, MINI, Volvo, Toyota, Lincoln, and Honda brands. As of April 20, 2020, it operated 63 franchised dealerships in Canada, as well as in Illinois. AutoCanada Inc. was incorporated in 2009 and is headquartered in Edmonton, Canada.",
        "currency": "CAD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Edmonton"
    },
    "ALPAR.PA": {
        "short_name": "GPE PAROT (AUTO)",
        "long_name": "Groupe Parot SA",
        "summary": "Groupe Parot SA engages in the distribution of new and used vehicles in France. The company distributes private vehicles under the BMW, MINI, Ford, Mazda, Mitsubishi, Alfa Romeo, Fiat, Fiat Professional, and Jeep brands for individuals; and commercial vehicles, such as industrial vehicles, semi-trailers, and light-duty vehicles, as well as spare parts under the IVECO, FIAT PROFESSIONAL, MAN, ZF, GRANALU, KRONE, NOOTEBOOM, and TVI brands for professionals. It also provides after-sales services, such as maintenance and repair, as well as mechanical and bodywork of vehicles; and offers financial solutions comprising financing, insurance, and guarantee services. The company was founded in 1978 and is based in Bruges, France.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "city": "Bruges"
    },
    "ALTB": {
        "short_name": "ALPINE AUTO BROKERS INC",
        "long_name": "Balincan International Inc.",
        "summary": "Balincan International Inc., through its subsidiary, BKG International Limited, operates a retail shop that sells skincare and cosmetic products in Hong Kong and China. The company's skincare and cosmetic products include skin lotions, cleansers, toners, eye creams, moisturizers, and lipsticks. It also engages in the online business, which sells consumer products, such as skincare and cosmetic products, as well as milk powder, organic honey, health and beauty food, hair care, and baby care products for the female and family markets. The company was formerly known as Alpine Auto Brokers, Inc. and changed its name to Balincan International Inc. in July 2016. Balincan International Inc. was founded in 2010 and is based in Kowloon, Hong Kong.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Kowloon"
    },
    "AN": {
        "short_name": "AutoNation, Inc.",
        "long_name": "AutoNation, Inc.",
        "summary": "AutoNation, Inc., through its subsidiaries, operates as an automotive retailer in the United States. The company operates through three segments: Domestic, Import, and Premium Luxury. It offers a range of automotive products and services, including new and used vehicles; and parts and services, such as automotive repair and maintenance, and wholesale parts and collision services. The company also provides automotive finance and insurance products comprising vehicle services and other protection products, as well as arranges finance for vehicle purchases through third-party finance sources. As of December 31, 2019, it owned and operated 317 new vehicle franchises from 231 stores located primarily in metropolitan markets in the Sunbelt region. It also owned and operated 81 AutoNation-branded collision centers, 5 AutoNation USA stores, 4 automotive auction operations, and 17 parts distribution centers. The company was founded in 1991 and is headquartered in Fort Lauderdale, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Fort Lauderdale"
    },
    "APE.AX": {
        "short_name": "EAGERS FPO",
        "long_name": "Eagers Automotive Limited",
        "summary": "Eagers Automotive Limited engages in the ownership and operation of motor vehicle and truck dealerships in Australia and New Zealand. It operates through four segments: Car Retailing, Truck Retailing, Property, and Investments. The Car Retailing segment offers a range of automotive products and services, including new vehicles, used vehicles, vehicle maintenance and repair services, vehicle parts, service contracts, vehicle brokerage services, vehicle protection products, and other aftermarket products. It also facilitates financing for vehicle purchases through third-party sources. In addition, this segment is involved in motor auction and forklift rental businesses. The Truck Retailing segment offers various products and services comprising new trucks, used trucks, truck maintenance and repair services, truck parts, service contracts, truck protection products, and other aftermarket products; and facilitates financing for truck purchases through third-party sources. The Property segment acquires and rents commercial properties. The Investment segment is involved in investment activities. The company was formerly known as A.P. Eagers Limited and changed its name to Eagers Automotive Limited in July 2020. Eagers Automotive Limited was founded in 1913 and is based in Newstead, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Newstead"
    },
    "ASG.AX": {
        "short_name": "AUTOSPORTS FPO",
        "long_name": "Autosports Group Limited",
        "summary": "Autosports Group Limited, together with its subsidiaries, operates in the retail automotive industry in Australia. It sells new and used motor vehicles, aftermarket products, and spare parts; distributes finance and insurance products; and provides motor vehicle servicing and collision repair services. As of June 30, 2020, it operates 41 franchised dealerships; 3 used motor vehicle outlets; and 6 motor vehicle collision repair facilities. Autosports Group Limited was founded in 2006 and is based in Leichhardt, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Leichhardt"
    },
    "AWG.F": {
        "short_name": "ASBURY AUTOMOTIVE  DL-,01",
        "long_name": "Asbury Automotive Group, Inc.",
        "summary": "Asbury Automotive Group, Inc., together with its subsidiaries, operates as an automotive retailer in the United States. It offers a range of automotive products and services, including new and used vehicles; and vehicle repair and maintenance services, replacement parts, and collision repair services. The company also provides finance and insurance products, including arranging vehicle financing through third parties; and aftermarket products, such as extended service contracts, guaranteed asset protection debt cancellation, prepaid maintenance, and credit life and disability insurance. As of December 31, 2019, the company owned and operated 107 new vehicle franchises representing 31 brands of automobiles at 88 dealership locations; and 25 collision centers in the United States. Asbury Automotive Group, Inc. was founded in 1996 and is headquartered in Duluth, Georgia.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Duluth"
    },
    "BHJC.F": {
        "short_name": "BILIA AB A FRIA  SK 2,50",
        "long_name": "Bilia AB (publ)",
        "summary": "Bilia AB (publ) engages in the sale and service of cars and transport vehicles. The company operates through Service, Cars, and Fuels segments. It sells new and used cars primarily of Volvo, BMW, Toyota, Renault, Lexus, MINI, Dacia, and Alpine brands; and transport vehicles from Renault, Toyota, and Dacia brand names. The company also provides petrol, diesel, ethanol, and compressed gas; workshop services, spare parts, and accessories; supplementary services, such as financing and insurance services; and car wash and dismantling services. In addition, it operates service and damage centers, stores and e-commerce, tire hotels, and tire and glass centers; and online auction sites in Sweden and Norway. The company sells its products through stores and online. It operated 136 facilities in Sweden, Norway, Germany, Luxembourg, and Belgium. The company was founded in 1967 and is headquartered in Gothenburg, Sweden.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Sweden",
        "city": "Gothenburg"
    },
    "BILI-A.ST": {
        "short_name": "Bilia AB ser. A",
        "long_name": "Bilia AB (publ)",
        "summary": "Bilia AB (publ) engages in the sale and service of cars and transport vehicles. The company operates through Service, Cars, and Fuels segments. It sells new and used cars primarily of Volvo, BMW, Toyota, Renault, Lexus, MINI, Dacia, and Alpine brands; and transport vehicles from Renault, Toyota, and Dacia brand names. The company also provides petrol, diesel, ethanol, and compressed gas; workshop services, spare parts, and accessories; supplementary services, such as financing and insurance services; and car wash and dismantling services. In addition, it operates service and damage centers, stores and e-commerce, tire hotels, and tire and glass centers; and online auction sites in Sweden and Norway. The company sells its products through stores and online. It operated 136 facilities in Sweden, Norway, Germany, Luxembourg, and Belgium. The company was founded in 1967 and is headquartered in Gothenburg, Sweden.",
        "currency": "SEK",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Gothenburg"
    },
    "BOGA.JK": {
        "short_name": "Bintang Oto Global Tbk.",
        "long_name": "PT Bintang Oto Global Tbk",
        "summary": "PT Bintang Oto Global Tbk operates as an integrated automotive company in Indonesia. It engages in the vehicle dealership and rental business; buying and sale of used cars; and provision of vehicle maintenance and repair services. The company was founded in 2011 and is based in Malang, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Malang"
    },
    "CALI": {
        "short_name": "CHINA AUTO LOGISTICS",
        "long_name": "China Auto Logistics Inc.",
        "summary": "China Auto Logistics Inc., together with its subsidiaries, sells and trades in imported automobiles in the People's Republic of China. It operates through Sales of Automobiles, Financing Services, and Other Services segments. The company also offers financing services, including letter of credit issuance, purchase deposit financing, and import duty advances services, as well as automobile value-added services comprising assistance related to customs clearance, storage, and delivery services. In addition, it provides Web-based advertising services through its Websites, such as at188.com that provides sales and trading information related to imported automobiles, as well as parts and components information; and at160.com, which offers real-time price comparison, and sales and trading information. It primarily serves authorized dealers and agents, free traders or wholesalers, and individual customers. The company is headquartered in Tianjin, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Tianjin"
    },
    "CARS": {
        "short_name": "Cars.com Inc.",
        "long_name": "Cars.com, LLC",
        "summary": "Cars.com, LLC, through its subsidiaries, operates as a digital marketplace, and provides solutions for the automotive industry. Its platform connects car shoppers with sellers and original equipment manufacturers (OEMs) in the United States. The company's platform provides information in the areas of find a car, certified pre-owned cars, sell your car, car book values, car dealers, compare car prices, listings by city, and advertisers. It also offers social media marketing tools, such as cars social that enables automotive dealers to reach an unduplicated, unique audience on social media; social sales drive that enables automotive retailers to maximize the impact of their used car listings with seamless integration on Facebook marketplace; fuel, a digital video solution for OEM's and car dealers to reduce the cost of reaching the target audience; social extension; social link; and social data. In addition, the company offers website platform hosting services; review and reputation management solutions that enable dealers to build, measure, monitor, and manage their review programs; online shopper, a digital retailing solution that allows shoppers to customize and compare payments across multiple vehicles to make real buying decisions with dealers' inventory; Roxanne, an event-based attribution and customer models; PRIZM, a dashboard with proactive data alerts; and AI Chat Tool. Cars.com, LLC was founded in 1998 and is based in Chicago, Illinois.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Chicago"
    },
    "CARS.JK": {
        "short_name": "Industri dan Perdagangan Bintra",
        "long_name": "PT Industri dan Perdagangan Bintraco Dharma Tbk",
        "summary": "PT Industri dan Perdagangan Bintraco Dharma Tbk engages in the services, trade, workshop, property and real estate, industry, and companies investment businesses. It operates through Automotive and Financing segments. The company provides sales and after-sales vehicle services under the Nasmoco brand; automotive financing for corporates and individuals; and car finance for new or used vehicles. It is also involved in the trading activities; distribution of spare parts; and operation of car services shop. In addition, the company offers electronic system trading and management services related to automotive that are accessible through Website and software app with Android platform. The company was founded in 1969 and is headquartered in South Tangerang, Indonesia. PT Industri dan Perdagangan Bintraco Dharma Tbk is a subsidiary of PT Ahabe Niaga Selaras.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "South Tangerang"
    },
    "CFYN.L": {
        "short_name": "CAFFYNS PLC ORD 50P",
        "long_name": "Caffyns plc",
        "summary": "Caffyns plc operates as a motor vehicle retailer in the Southeast of England. The company offers a range of new and used cars; and sells tyres, oil, parts, and accessories, as well as provides aftersales, maintenance, and other services. It provides products of various brands, such as Audi, SEAT, Skoda, Vauxhall, Volkswagen, and Volvo. Caffyns plc was founded in 1865 and is headquartered in Eastbourne, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Eastbourne"
    },
    "CMH.JO": {
        "short_name": "Combined Motor Hldgs Ltd",
        "long_name": "Combined Motor Holdings Limited",
        "summary": "Combined Motor Holdings Limited, an investment holding company, engages in the motor retail and car hire businesses in South Africa. It offers new and used vehicles, parts, and related service; and life, disability, retrenchment, and vehicle warranty insurance products, as well as vehicle financing solutions. The company also operates a fleet of approximately 7,000 vehicles through First Car Rental. In addition, it is involved in the distribution and franchising business. The company was founded in 1976 and is headquartered in Umhlanga, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "city": "Umhlanga"
    },
    "CRMT": {
        "short_name": "America's Car-Mart, Inc.",
        "long_name": "America's Car-Mart, Inc.",
        "summary": "America's Car-Mart, Inc., through its subsidiaries, operates as an automotive retailer in the United States. The company primarily sells older model used vehicles and provides financing for its customers. As of December 17, 2020, it operated 151 dealerships in the South-Central United States. America's Car-Mart, Inc. was founded in 1981 and is based in Rogers, Arkansas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Rogers"
    },
    "CRSO.TA": {
        "short_name": "CARASSO MOTORS LTD",
        "long_name": "Carasso Motors Ltd.",
        "summary": "Carasso Motors Ltd. engages in the import and sale of automobiles in Israel. The company offers new and used cars; and various financing programs. It operates through 11 branches in Haifa, Nazareth, Afula, Tiberias, Carmiel, Netanya, Jerusalem, Kfar Saba, Rishon LeZion, Ashdod, and Be'er Sheva. Carasso Motors Ltd. was founded in 2007 and is based in Bnei Ayish, Israel. Carasso Motors Ltd. is a subsidiary of The Carasso Group.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Bnei Ayish"
    },
    "CZASF": {
        "short_name": "CHINA ZHENGTONG AUTO SVCS HLDGS",
        "long_name": "China ZhengTong Auto Services Holdings Limited",
        "summary": "China ZhengTong Auto Services Holdings Limited, an investment holding company, operates as a 4S dealership company in the People's Republic of China. The company operates through four segments: 4S Dealership Business, Supply Chain Business, Financial Services Business, and Comprehensive Properties Business. It is involved in the sale of motor vehicles and automobile spare parts; and provision of maintenance and repair services. The company also provides motor-related and automobile related logistics services; and trades in lubricant oil and auto supplies. It focuses on the dealership of branded automobiles, including Porsche, Benz, BMW, Audi, Jaguar and Land Rover, Volvo, Cadillac, and Infiniti; and operates dealership stores of middle market brands, such as FAW-Volkswagen, Buick, Nissan, Toyota, Honda, and Hyundai. In addition, the company offers financial services, including auto financing, insurance brokerage, finance leasing, and other value-added services to auto customers and dealers. Further, it engages in the development and sale of real estate properties, property management, and pre-owned automobiles trading activities; e-commerce platform; and provision of consulting and automobile trading agency services. As of December 31, 2019, it operated 135 dealership outlets in 41 cities across 17 provinces and municipalities. The company was founded in 1999 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "DJDA.F": {
        "short_name": "D'IETEREN P.S.",
        "long_name": "D'Ieteren SA",
        "summary": "D'Ieteren SA, together with its subsidiaries, provides various services to the motorists worldwide. The company operates through D'Ieteren Auto, Belron, and Moleskine segments. It imports and distributes Volkswagen, Audi, SEAT, Â\u008akoda, Bentley, Lamborghini, Bugatti, Porsche, and Yamaha vehicles, as well as its spare parts and accessories. The company also provides vehicle glass repair and replacement services under the Carglass, Safelite AutoGlass, and Autoglass brands; and manages vehicle glass and other insurance claims on behalf of insurance customers. In addition, it develops and sells branded notebooks, as well as writing, travel, and reading accessories under the Moleskine brand name. Further, the company sells used vehicles; and provides after-sales services, including bodywork, maintenance, glass, and tyre replacement services. D'Ieteren SA was founded in 1805 and is headquartered in Brussels, Belgium.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Belgium",
        "city": "Brussels"
    },
    "DLEA.TA": {
        "short_name": "DELEK AUTOMOTIVE S",
        "long_name": "Delek Automotive Systems Ltd.",
        "summary": "Delek Automotive Systems Ltd. imports and distributes cars and motorcycles in Israel. The company also operates technical training centers, garages, distribution centers for spare parts, and car supply centers. In addition, it offers insurance services for vehicles and car repair services. It operates through showrooms and sub-agencies, as well as operates approximately 60 service centers. The company was formerly known as Gal Â\u0096 Wisepiler and Karts Indsutiries Ltd. and changed its name to Delek Automotive Systems Ltd. in February 1994. Delek Automotive Systems Ltd. was founded in 1965 and is headquartered in Nir Tzvi, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Nir Tzvi"
    },
    "DOAS.IS": {
        "short_name": "DOGUS OTOMOTIV",
        "long_name": "Dogus Otomotiv Servis ve Ticaret A.S.",
        "summary": "Dogus Otomotiv Servis ve Ticaret A.S., together with its subsidiaries, imports, markets, and sells passenger cars, light commercial vehicles, heavy vehicles, industrial and marine engines, and cooling systems in Turkey. The company distributes vehicles of various brands, including Volkswagen, Audi, SEAT, Â\u008aKODA, Bentley, Lamborghini, Bugatti, Porsche, and Scania. It also provides industrial and marine engines under the Scania Engines brand; and climate control systems under the Thermoking brand. In addition, the company is involved in used car operations through its dealer network under the DOD brand. The company was founded in 1994 and is headquartered in Ã\u0087ayirova, Turkey.",
        "currency": "TRY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "city": "Ã\u0087ayirova"
    },
    "DRVN": {
        "short_name": "Driven Brands Holdings Inc.",
        "long_name": "Driven Brands Holdings Inc.",
        "summary": "Driven Brands Holdings Inc. automotive repair and maintenance services. The company offers services, such as automotive needs, paint, collision, glass, vehicle repair, oil change, maintenance, and car wash services. Driven Brands Holdings Inc. was founded in 1972 and is headquartered in Charlotte, North Carolina.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Charlotte"
    },
    "ETFM": {
        "short_name": "2050 MOTORS INC",
        "long_name": "FOMO Corp.",
        "summary": "FOMO Corp. owns and operates kanab.club, a social network site that targets cannabis market worldwide. The company was formerly known as 2050 Motors, Inc. and changed its name to FOMO Corp. in December 2019. FOMO Corp. was founded in 2012 and is based in Chicago, Illinois.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Chicago"
    },
    "GPI": {
        "short_name": "Group 1 Automotive, Inc.",
        "long_name": "Group 1 Automotive, Inc.",
        "summary": "Group 1 Automotive, Inc., through its subsidiaries, operates in the automotive retail industry. The company sells new and used cars, light trucks, and vehicle parts, as well as service insurance contracts; arranges related vehicle financing; and offers automotive maintenance and repair services. It operates primarily in the metropolitan areas in 15 states in the United States; 33 towns in the United Kingdom; and 3 states in Brazil. As of February 5, 2020, the company owned and operated 186 automotive dealerships, 242 franchises, and 49 collision centers that offer 31 brands of automobiles. Group 1 Automotive, Inc. was founded in 1995 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "HC9.F": {
        "short_name": "AM.CAR-MART  DL-,01",
        "long_name": "America's Car-Mart, Inc.",
        "summary": "America's Car-Mart, Inc., through its subsidiaries, operates as an automotive retailer in the United States. The company primarily sells older model used vehicles and provides financing for its customers. As of December 17, 2020, it operated 151 dealerships in the South-Central United States. America's Car-Mart, Inc. was founded in 1981 and is based in Rogers, Arkansas.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Rogers"
    },
    "IDSA.SG": {
        "short_name": "Indomobil Sukses Intl TBK,PT Re",
        "long_name": "PT Indomobil Sukses Internasional Tbk",
        "summary": "PT Indomobil Sukses Internasional Tbk, together with its subsidiaries, engages in the integrated automotive business in Indonesia. The company operates through four segments: Automotive, Financial Services, Rental and Services, and Others. The company distributes vehicles and spare parts, as well as fuel; assembles vehicle; manufactures automotive parts/component; and provides after sales services, vehicle financing, car rental, used cars trading, logistics, non-formal education services, and other related supporting services, as well as acts as a trademark license holder. Its products include two-wheel and four-wheel vehicles, buses, trucks, and heavy equipment. The company offers products of Audi, Bandit, Datsun, HIAB, Hino, John Deere, Kalmar, KIA, Manitou, Nissan, Renault Trucks, SDLG, Suzuki, Volkswagen, Volvo Bus, Volvo Construction Equipment, and Volvo Trucks brands. In addition, it is involved in the rental and building management activities; operation of gas stations; mining, plantation, and forestry contracting business; industrial plantations management; and transportation and logistics businesses. Further, the company provides e-learning, manpower, and data processing services; and automotive services, such as dealership, workshop, and financing. The company was founded in 1987 and is headquartered in Jakarta, Indonesia. PT Indomobil Sukses Internasional Tbk is a subsidiary of Gallant Venture Ltd.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "IJCA.F": {
        "short_name": "INCHCAPE PLC  LS -,10",
        "long_name": "Inchcape plc",
        "summary": "Inchcape plc operates as an automotive distributor and retailer. The company sells and distributes new and used cars. It also provides aftersales service, bodyshop repairs, and parts sales; and finance and insurance products and services. The company operates in Asia; Australasia; the United Kingdom and rest of Europe; and emerging markets, including Argentina, Chile, Colombia, Costa Rica, Ethiopia and Djibouti, Ecuador, Kenya, Panama, Peru, Russia, and Uruguay. Inchcape plc was founded in 1847 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "IMAS.JK": {
        "short_name": "Indomobil Sukses Internasional ",
        "long_name": "PT Indomobil Sukses Internasional Tbk",
        "summary": "PT Indomobil Sukses Internasional Tbk, together with its subsidiaries, engages in the integrated automotive business in Indonesia. The company operates through four segments: Automotive, Financial Services, Rental and Services, and Others. The company distributes vehicles and spare parts, as well as fuel; assembles vehicle; manufactures automotive parts/component; and provides after sales services, vehicle financing, car rental, used cars trading, logistics, non-formal education services, and other related supporting services, as well as acts as a trademark license holder. Its products include two-wheel and four-wheel vehicles, buses, trucks, and heavy equipment. The company offers products of Audi, Bandit, Datsun, HIAB, Hino, John Deere, Kalmar, KIA, Manitou, Nissan, Renault Trucks, SDLG, Suzuki, Volkswagen, Volvo Bus, Volvo Construction Equipment, and Volvo Trucks brands. In addition, it is involved in the rental and building management activities; operation of gas stations; mining, plantation, and forestry contracting business; industrial plantations management; and transportation and logistics businesses. Further, the company provides e-learning, manpower, and data processing services; and automotive services, such as dealership, workshop, and financing. The company was founded in 1987 and is headquartered in Jakarta, Indonesia. PT Indomobil Sukses Internasional Tbk is a subsidiary of Gallant Venture Ltd.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "INCH.L": {
        "short_name": "INCHCAPE PLC ORD 10P",
        "long_name": "Inchcape plc",
        "summary": "Inchcape plc operates as an automotive distributor and retailer. The company sells and distributes new and used cars. It also provides aftersales service, bodyshop repairs, and parts sales; and finance and insurance products and services. The company operates in Asia; Australasia; the United Kingdom and rest of Europe; and emerging markets, including Argentina, Chile, Colombia, Costa Rica, Ethiopia and Djibouti, Ecuador, Kenya, Panama, Peru, Russia, and Uruguay. Inchcape plc was founded in 1847 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "INCPY": {
        "short_name": "INCHCAPE",
        "long_name": "Inchcape plc",
        "summary": "Inchcape plc operates as an automotive distributor and retailer. The company sells and distributes new and used cars. It also provides aftersales service, bodyshop repairs, and parts sales; and finance and insurance products and services. The company operates in Asia; Australasia; the United Kingdom and rest of Europe; and emerging markets, including Argentina, Chile, Colombia, Costa Rica, Ethiopia and Djibouti, Ecuador, Kenya, Panama, Peru, Russia, and Uruguay. Inchcape plc was founded in 1847 and is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "KAMUX.HE": {
        "short_name": "Kamux Corporation",
        "long_name": "Kamux Oyj",
        "summary": "Kamux Oyj engages in the retail and wholesale of used cars and integrated services through showrooms and website. As of December 31, 2019, it operated 48 showrooms in Finland; 17 showrooms in Sweden; and 6 showrooms in Germany. It also offers financing and insurance products to its customers; and sells used cars in auctions. The company was founded in 2003 and is headquartered in HÃ¤meenlinna, Finland.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "city": "HÃ¤meenlinna"
    },
    "KFS": {
        "short_name": "Kingsway Financial Services, In",
        "long_name": "Kingsway Financial Services Inc.",
        "summary": "Kingsway Financial Services Inc., through its subsidiaries, engages in the extended warranty and leased real estate business. It operates through two segments, Extended Warranty and Leased Real Estate. The Extended Warranty segment markets and administers vehicle service agreements and related products for new and used automobiles. This segment also markets and distributes warranty products to manufacturers, distributors, and installers of heating, ventilation and air conditioning, standby generator, commercial LED lighting, and refrigeration equipment; and equipment breakdown and maintenance support services to companies. The Leased Real Estate segment owns a parcel of real property consisting of approximately 192 acres located in the State of Texas. The company offers its products and services to credit unions, consumers, businesses, and homebuilders. Kingsway Financial Services Inc. was founded in 1989 and is based in Itasca, Illinois.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Itasca"
    },
    "KMX": {
        "short_name": "CarMax Inc",
        "long_name": "CarMax, Inc.",
        "summary": "CarMax, Inc., through its subsidiaries, operates as a retailer of used vehicles in the United States. The company operates in two segments, CarMax Sales Operations and CarMax Auto Finance. It offers customers a range of makes and models of used vehicles, including domestic, imported, and luxury vehicles; vehicles that do not meet its retail standards to licensed dealers through on-site wholesale auctions; and extended protection plans to customers at the time of sale. The company also provides reconditioning and vehicle repair services; and financing alternatives for retail customers across a range of credit spectrum through its CarMax Auto Finance and arrangements with various financial institutions. As of February 29, 2020, it operated approximately 216 stores and 2 new car franchises. CarMax, Inc. was founded in 1993 and is based in Richmond, Virginia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Richmond"
    },
    "KMX.MX": {
        "short_name": "CARMAX INC",
        "long_name": "CarMax, Inc.",
        "summary": "CarMax, Inc., through its subsidiaries, operates as a retailer of used vehicles in the United States. The company operates in two segments, CarMax Sales Operations and CarMax Auto Finance. It offers customers a range of makes and models of used vehicles, including domestic, imported, and luxury vehicles; vehicles that do not meet its retail standards to licensed dealers through on-site wholesale auctions; and extended protection plans to customers at the time of sale. The company also provides reconditioning and vehicle repair services; and financing alternatives for retail customers across a range of credit spectrum through its CarMax Auto Finance and arrangements with various financial institutions. As of February 29, 2020, it operated approximately 216 stores and 2 new car franchises. CarMax, Inc. was founded in 1993 and is based in Richmond, Virginia.",
        "currency": "MXN",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Richmond"
    },
    "KXIN": {
        "short_name": "Kaixin Auto Holdings",
        "long_name": "Kaixin Auto Holdings",
        "summary": "Kaixin Auto Holdings operates as a used car dealership in the People's Republic of China. As of December 31, 2019, the company had 14 dealerships. It also provides financing channels to its customers through its partnership with financial institutions; and value-added services to its customers, including insurance, extended warranties, and after-sales services. The company was founded in 2015 and is headquartered in Beijing, the People's Republic of China. Kaixin Auto Holdings is a subsidiary of Renren Inc.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "LAD": {
        "short_name": "Lithia Motors, Inc.",
        "long_name": "Lithia Motors, Inc.",
        "summary": "Lithia Motors, Inc. operates as an automotive retailer in the United States. The company operates through three segments: Domestic, Import, and Luxury. It offers new and used vehicles; vehicle financing services; warranties, insurance contracts, and vehicle and theft protection services; and automotive repair and maintenance services, as well as sells vehicle body and parts. As of July 29, 2020, the company operated through 190 stores. It also offers its products online through 200 websites. Lithia Motors, Inc. was founded in 1946 and is headquartered in Medford, Oregon.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Medford"
    },
    "LASLY": {
        "short_name": "LENTUO INTERNATIONAL INC",
        "long_name": "Lentuo International Inc.",
        "summary": "Lentuo International Inc. operates automobile franchise dealerships in the People's Republic of China. The company offers various automobile products and services, including new passenger vehicles, auto parts, and accessories; automobile repair and maintenance services; assistance services in procuring automobile insurance and financing, and other automobile-related services; and automobile leasing services. Its dealerships sell seven automobile brands comprising FAW-Volkswagen, Audi, FAW-Mazda, Shanghai-Volkswagen, Toyota, Chang An-Mazda, and GAC-Honda. The company operates 12 franchise dealerships, 10 automobile showrooms, and 1 automobile repair shop. It sells new vehicles to individual retail customers, as well as to institutional customers, such as taxi companies and government entities. Lentuo International Inc. was founded in 1994 and is based in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "LAZY": {
        "short_name": "Lazydays Holdings, Inc.",
        "long_name": "Lazydays Holdings, Inc.",
        "summary": "Lazydays Holdings, Inc. operates recreation vehicle (RV) dealerships under the Lazydays name in the United States. It provides RV sales, RV parts and services, after-market parts and accessories, and RV camping facilities. The company offers various new and used RVs; onsite general RV maintenance and repair services; and collision repair services, as well as sells and installs various parts and accessories. It also operates the Lazydays RV resort at Tampa, Florida. In addition, the company arranges financing for vehicle purchases through third-party finance sources; and offers various third-party protection plans and services to the purchasers of its RVs. It operates dealerships locations at The Villages, Florida; Tucson, Arizona; Minneapolis, Minnesota; Knoxville, Tennessee; and Loveland and Denver, Colorado. The company was founded in 1976 and is based in Seffner, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "city": "Seffner"
    },
    "LMO.F": {
        "short_name": "LITHIA MOTORS INC. A",
        "long_name": "Lithia Motors, Inc.",
        "summary": "Lithia Motors, Inc. operates as an automotive retailer in the United States. The company operates through three segments: Domestic, Import, and Luxury. It offers new and used vehicles; vehicle financing services; warranties, insurance contracts, and vehicle and theft protection services; and automotive repair and maintenance services, as well as sells vehicle body and parts. As of July 29, 2020, the company operated through 190 stores. It also offers its products online through 200 websites. Lithia Motors, Inc. was founded in 1946 and is headquartered in Medford, Oregon.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Medford"
    },
    "LMPX": {
        "short_name": "LMP Automotive Holdings, Inc.",
        "long_name": "LMP Automotive Holdings, Inc.",
        "summary": "LMP Automotive Holdings, Inc. operates an e-commerce and facilities-based platform for consumers who desire to buy, sell, subscribe for, or finance pre-owned and new automobiles in the United States. It buys pre-owned automobiles primarily through auctions or directly from other automobile dealers and new automobiles from manufacturers and manufacturer distributors at fleet rates. The company also subscribes the automobiles to its customers by allowing them to enter into its subscription plan for automobiles in which customers have use of an automobile for a minimum of thirty days. Its all-inclusive vehicle subscription membership includes monthly swaps and covers insurance, maintenance, and upkeep. In addition, it sells its inventory, including automobiles to customers and repeats the process. LMP Automotive Holdings, Inc. was incorporated in 2017 and is headquartered in Fort Lauderdale, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Fort Lauderdale"
    },
    "LOTZ": {
        "short_name": "CarLotz, Inc.",
        "long_name": "CarLotz, Inc.",
        "summary": "CarLotz, Inc. operates as a used car and motorcycles retailer. It offers cars, compacts, convertibles, coupes, SUVs, trucks, vans, and wagons. The company's services include inspection, cleaning, photography, listings on major car buying websites, and management of buyer inquiries and test drives at its retail stores. The company was incorporated in 2011 and is based in Richmond, Virginia with locations in Midlothian and Chesapeake, Virginia; Tampa, Florida; Downers Grove, Illinois; San Antonio, Texas; and Charlotte, Monroe, and Greensboro, North Carolina.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Richmond"
    },
    "MITSIB-R.BK": {
        "short_name": "MITSIB LEASING PUBLIC COMPANY L",
        "long_name": "Mitsib Leasing Public Company Limited",
        "summary": "Mitsib Leasing Public Company Limited primarily engages in selling cars in Thailand. It also provides hire purchase; factoring; car loans; insurance; and retail financing services. The company is headquartered in Mueang Samut Prakan, Thailand.",
        "currency": "THB",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Samut Prakan"
    },
    "MITSIB.BK": {
        "short_name": "MITSIB LEASING PUBLIC COMPANY L",
        "long_name": "Mitsib Leasing Public Company Limited",
        "summary": "Mitsib Leasing Public Company Limited primarily engages in selling cars in Thailand. It also provides hire purchase; factoring; car loans; insurance; and retail financing services. The company is headquartered in Mueang Samut Prakan, Thailand.",
        "currency": "THB",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Samut Prakan"
    },
    "MOTR.L": {
        "short_name": "MOTORPOINT GROUP PLC ORD 1P",
        "long_name": "Motorpoint Group plc",
        "summary": "Motorpoint Group Plc operates as an independent vehicle retailer in the United Kingdom. It primarily sells nearly-new vehicles and vehicles from various brands, including Ford, Vauxhall, Volkswagen, Nissan, Hyundai, Audi, BMW, and Mercedes-Benz. The company operates 13 retail sites across Great Britain. It also operates Auction4Cars.com, a business to business digital auction platform for selling part-exchange vehicles. In addition, the company sells motor related services comprising extended guarantees, paint protection, and gap insurance. Motorpoint Group Plc was founded in 1998 and is headquartered in Derby, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Derby"
    },
    "MPMX.JK": {
        "short_name": "Mitra Pinasthika Mustika Tbk.",
        "long_name": "PT Mitra Pinasthika Mustika Tbk",
        "summary": "PT Mitra Pinasthika Mustika Tbk, through its subsidiaries, engages in the distribution of two-wheel vehicle and spare parts under Honda brand primarily in Indonesia. It operates through four segments: Distribution and Retail, Aftermarket, Transportation, and Others. The company operates MPMMotor retail outlets. It is also involved in the four-wheel vehicle rental, general insurance, and financing activities, as well as sale of four wheels-vehicle and its supporting activities. In addition, the company provides after-market parts and services; investment, management consulting, and advisory services; auction services; outsourcing services; land, sea, and air freight forwarding; and other, trading, and workshop services. Further, it manufactures and packages oil lubricants; trades in new and used motor vehicles, and supporting components; and offers general and motor vehicle trading and agency services. PT Mitra Pinasthika Mustika Tbk was founded in 1987 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "MTO.AX": {
        "short_name": "MOTORCYCLE FPO",
        "long_name": "MotorCycle Holdings Limited",
        "summary": "MotorCycle Holdings Limited owns and operates motorcycle dealerships in Australia. It operates in two segments, Motorcycle Retailing and Motorcycle Accessories Wholesaling. The company is involved in the sale of new motorcycles, used motorcycles, accessories and parts, and mechanical protection plan contracts; wholesaling and retailing of motorcycle accessories; and finance, insurance, and warranty activities, as well as servicing and repair of motorcycles. It also owns and operates a rider training school and a motorcycle repair business that performs smash repair work for insurers. The company operates 48 franchises from 31 dealership and 8 retail accessory locations in Queensland, New South Wales, Victoria, and the Australian Capital Territory. MotorCycle Holdings Limited was founded in 1989 and is based in Slacks Creek, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Slacks Creek"
    },
    "MTPTF": {
        "short_name": "MOTORPOINT GROUP PLC",
        "long_name": "Motorpoint Group plc",
        "summary": "Motorpoint Group Plc operates as an independent vehicle retailer in the United Kingdom. It primarily sells nearly-new vehicles and vehicles from various brands, including Ford, Vauxhall, Volkswagen, Nissan, Hyundai, Audi, BMW, and Mercedes-Benz. The company operates 13 retail sites across Great Britain. It also operates Auction4Cars.com, a business to business digital auction platform for selling part-exchange vehicles. In addition, the company sells motor related services comprising extended guarantees, paint protection, and gap insurance. Motorpoint Group Plc was founded in 1998 and is headquartered in Derby, the United Kingdom.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Derby"
    },
    "MVXM": {
        "short_name": "MOVEIX INC",
        "long_name": "Moveix Inc.",
        "summary": "Moveix Inc. intends to resell various types of electric transportation products through its Website platform worldwide. Its products would include electric bikes, scooters, Segway, and hover boards. The company was founded in 2016 and is based in Suceava, Romania. As of May 6, 2019, Moveix Inc. operates as a subsidiary of SeriesOne, Inc.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Romania",
        "city": "Suceava"
    },
    "NWAU": {
        "short_name": "NOWAUTO INC",
        "long_name": "Consumer Automotive Finance, Inc.",
        "summary": "Consumer Automotive Finance Inc. operates as a retailer in the used vehicle market of the United States. It focuses primarily on the buy here/pay here segment of the independent used vehicle sales and finance market. The company sells approximately 2000 and newer model-year used vehicles and provides related financing through sale type leases. As of December 31, 2010, it had two retail locations in Arizona. The company was formerly known as NowAuto Group, Inc. Consumer Automotive Finance Inc. is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Las Vegas"
    },
    "NWFAF": {
        "short_name": "NEW FOCUS AUTO TECH HLDGS LTD",
        "long_name": "New Focus Auto Tech Holdings Limited",
        "summary": "New Focus Auto Tech Holdings Limited, an investment holding company, manufactures and sells electronic and power-related automotive parts and accessories. The company operates through three segments: Manufacturing Business, Wholesale Business, and Automobile Dealership and Service Business. It offers automotive lighting and automotive electronic power products, including the automotive converter boxes, multi-function power supplies, cooler and warmer boxes, chargers, automotive lighting products high intensity discharge lamps, automotive auxiliary lights, work lights, etc. The company is also involved in the provision of automotive sales and after-sales services, including maintenance and repair, automobile customization and furnishing, and automobile recall and consultancy services; distribution of automobile insurance and financial products; and sale of automobiles, auto parts, and accessories, as well as operation of e-commerce platform. It operates in the People's Republic of China, the United States, Europe, and the Asia Pacific regions. New Focus Auto Tech Holdings Limited was incorporated in 2002 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Shanghai"
    },
    "PAG": {
        "short_name": "Penske Automotive Group, Inc.",
        "long_name": "Penske Automotive Group, Inc.",
        "summary": "Penske Automotive Group, Inc., a diversified transportation services company, operates automotive and commercial truck dealerships. The company operates through four segments: Retail Automotive, Retail Commercial Truck, Other, and Non-Automotive Investments. It operates dealerships under franchise agreements with various automotive manufacturers and distributors. The company engages in the sale of new and used motor vehicles; and related products and services, including vehicle and collision repair services, as well as in the placement of finance and lease contracts, third-party insurance products, and other aftermarket products. It also operates used vehicle supercenters that retails and wholesales used vehicles. The company also operates a heavy and medium duty trucks dealership, offering primarily Freightliner and Western Star branded trucks, as well as a range of used trucks, services and parts, and maintenance and repair services. In addition, it imports and distributes Western Star heavy-duty trucks, MAN heavy and medium duty trucks, buses, and Dennis Eagle refuse collection vehicles, together with associated parts. Further, the company distributes diesel and gas engines, and power systems. The company operates 317 retail automotive franchises, including 145 franchises located in the United States and 172 franchises located outside of the United States; sixteen used vehicle supercenters in the United States and the United Kingdom; and 25 commercial truck dealerships in Texas, Oklahoma, Tennessee, Georgia, Utah, Idaho, and Canada. Penske Automotive Group, Inc. was incorporated in 1990 and is headquartered in Bloomfield Hills, Michigan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Bloomfield Hills"
    },
    "PDG.L": {
        "short_name": "PENDRAGON PLC ORD 5P",
        "long_name": "Pendragon PLC",
        "summary": "Pendragon PLC, together with its subsidiaries, operates in the automotive retail sector in the United Kingdom. It operates through five segments: Car Store, Franchised UK Motor, Software, Leasing, and US Motor. The company sells new and used motor cars, motorbikes, trucks, and vans together with associated aftersales activities of service, body repair, and parts sales. It also operates carstore.com, an online marketplace for used cars; and distributes aftermarket parts, accessories, and workshop consumables under Quickco brand. In addition, the company provides cloud-based dealer management systems; and Licence Link, an online license checking tool for fleets, as well as leases cars and vans to small, medium, and large fleets under the Pendragon Vehicle Management brand. It operates 161 franchise points. Pendragon PLC was incorporated in 1988 and is headquartered in Nottingham, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Nottingham"
    },
    "PMJS.JK": {
        "short_name": "Putra Mandiri Jembar Tbk.",
        "long_name": "PT Putra Mandiri Jembar Tbk",
        "summary": "PT Putra Mandiri Jembar Tbk engages in the vehicle dealership business. The company also engages in the provision of automotive rental services; and e-commerce business. It operates 45 Mitsubishi dealer showrooms, 1 Mercedes-Benz dealer showroom, and 2 Nissan dan Datsun dealer showrooms located in 31 cities and 10 provinces in Sumatera, DKI Jakarta, and Jawa. The company was founded in 2003 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "PREC": {
        "short_name": "PRESTIGE CARS",
        "long_name": "Prestige Cars International, Inc.",
        "summary": "Prestige Cars International, Inc. operates as a restorer and dealer of pre-owned Rolls Royce, Bentley and other high-end motor cars, including many collector's editions. The company is based in Ft. Lauderdale, Florida. As per the transaction announced on March 27, 2007, Prestige Cars International, Inc. is a subsidiary of Cambridge Park Limited, Inc.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Ft. Lauderdale"
    },
    "RENN": {
        "short_name": "Renren Inc.",
        "long_name": "Renren Inc.",
        "summary": "Renren Inc. sells used automobiles and related products in the People's Republic of China. The company also arranges financing options for customers through its financial services partners; provides credit financing to used automobile dealers; and sells new cars, as well as provides value-added services, such as warranties, insurance, and after-sale products and services. It offers vehicles of Audi, BMW, Mercedes-Benz, Land Rover, and Porsche brands at its in-store showrooms; and through Kaixin Auto app, as well as through other online vertical channels, such as Autohome and 58.com. In addition, the company develops Chime, a Software as a Solution platform that offers lead generation and customer relationship management solutions for real estate professionals; and provides customizable lead capture landing pages that offer multiple home value estimates in the United States. Further, it provides online and mobile services for the trucking industry in the United States. The company was formerly known as Oak Pacific Interactive and changed its name to Renren Inc. in December 2010. Renren Inc. was founded in 2002 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "RMBL": {
        "short_name": "RumbleOn, Inc.",
        "long_name": "RumbleON, Inc.",
        "summary": "RumbleON, Inc., a development stage company, provides an e-commerce platform that facilitates consumers and dealers to buy, sell, trade, and finance pre-owned recreation vehicles. It primarily focuses on pre-owned Harley-Davidson motorcycles and other powersports. The company also provides third-party financing services. The company was formerly known as Smart Server, Inc. and changed its name to RumbleON, Inc. in February 2017. RumbleON, Inc. was incorporated in 2013 and is based in Irving, Texas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "city": "Irving"
    },
    "RUNA.F": {
        "short_name": "RUSH ENTERPRISES A DL-,01",
        "long_name": "Rush Enterprises, Inc.",
        "summary": "Rush Enterprises, Inc., through its subsidiaries, operates as an integrated retailer of commercial vehicles and related services in the United States. The company operates a network of commercial vehicle dealerships under the Rush Truck Centers name. Its Rush Truck Centers primarily sell commercial vehicles manufactured by Peterbilt, International, Hino, Ford, Isuzu, Mitsubishi Fuso, IC Bus, or Blue Bird; provides new and used commercial vehicles, and aftermarket parts, as well as service and repair, financing, and leasing and rental services; and offers property and casualty insurance, including collision and liability insurance on commercial vehicles, cargo insurance, and credit life insurance to its commercial vehicle customers. The company also offers equipment installation and repair, parts installation, and paint and body repair services; new vehicle pre-delivery inspection, truck modification, and natural gas fuel system installation services; body, chassis upfit, and component installation services, as well as sells tires for use on commercial vehicles, new and used trailers, and vehicle telematics products; and manufactures compressed natural gas fuel systems and related component parts for commercial vehicles. It serves regional and national truck fleets, corporations, local and state governments, and owner operators. The company operates a network of centers located in the states of Alabama, Arizona, California, Colorado, Florida, Georgia, Idaho, Illinois, Indiana, Kansas, Kentucky, Missouri, Nevada, Nebraska, New Mexico, North Carolina, Ohio, Oklahoma, Pennsylvania, Tennessee, Texas, Utah, and Virginia. Rush Enterprises, Inc. was founded in 1965 and is headquartered in New Braunfels, Texas.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "New Braunfels"
    },
    "RUSHA": {
        "short_name": "Rush Enterprises, Inc.",
        "long_name": "Rush Enterprises, Inc.",
        "summary": "Rush Enterprises, Inc., through its subsidiaries, operates as an integrated retailer of commercial vehicles and related services in the United States. The company operates a network of commercial vehicle dealerships under the Rush Truck Centers name. Its Rush Truck Centers primarily sell commercial vehicles manufactured by Peterbilt, International, Hino, Ford, Isuzu, Mitsubishi Fuso, IC Bus, or Blue Bird; provides new and used commercial vehicles, and aftermarket parts, as well as service and repair, financing, and leasing and rental services; and offers property and casualty insurance, including collision and liability insurance on commercial vehicles, cargo insurance, and credit life insurance to its commercial vehicle customers. The company also offers equipment installation and repair, parts installation, and paint and body repair services; new vehicle pre-delivery inspection, truck modification, and natural gas fuel system installation services; body, chassis upfit, and component installation services, as well as sells tires for use on commercial vehicles, new and used trailers, and vehicle telematics products; and manufactures compressed natural gas fuel systems and related component parts for commercial vehicles. It serves regional and national truck fleets, corporations, local and state governments, and owner operators. The company operates a network of centers located in the states of Alabama, Arizona, California, Colorado, Florida, Georgia, Idaho, Illinois, Indiana, Kansas, Kentucky, Missouri, Nevada, Nebraska, New Mexico, North Carolina, Ohio, Oklahoma, Pennsylvania, Tennessee, Texas, Utah, and Virginia. Rush Enterprises, Inc. was founded in 1965 and is headquartered in New Braunfels, Texas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "New Braunfels"
    },
    "RUSHB": {
        "short_name": "Rush Enterprises, Inc.",
        "long_name": "Rush Enterprises, Inc.",
        "summary": "Rush Enterprises, Inc., through its subsidiaries, operates as an integrated retailer of commercial vehicles and related services in the United States. The company operates a network of commercial vehicle dealerships under the Rush Truck Centers name. Its Rush Truck Centers primarily sell commercial vehicles manufactured by Peterbilt, International, Hino, Ford, Isuzu, Mitsubishi Fuso, IC Bus, or Blue Bird; provides new and used commercial vehicles, and aftermarket parts, as well as service and repair, financing, and leasing and rental services; and offers property and casualty insurance, including collision and liability insurance on commercial vehicles, cargo insurance, and credit life insurance to its commercial vehicle customers. The company also offers equipment installation and repair, parts installation, and paint and body repair services; new vehicle pre-delivery inspection, truck modification, and natural gas fuel system installation services; body, chassis upfit, and component installation services, as well as sells tires for use on commercial vehicles, new and used trailers, and vehicle telematics products; and manufactures compressed natural gas fuel systems and related component parts for commercial vehicles. It serves regional and national truck fleets, corporations, local and state governments, and owner operators. The company operates a network of centers located in the states of Alabama, Arizona, California, Colorado, Florida, Georgia, Idaho, Illinois, Indiana, Kansas, Kentucky, Missouri, Nevada, Nebraska, New Mexico, North Carolina, Ohio, Oklahoma, Pennsylvania, Tennessee, Texas, Utah, and Virginia. Rush Enterprises, Inc. was founded in 1965 and is headquartered in New Braunfels, Texas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "New Braunfels"
    },
    "RWGI": {
        "short_name": "RODEDAWG INTERNATIONAL INDUSTRI",
        "long_name": "Rodedawg International Industries, Inc.",
        "summary": "Rodedawg International Industries, Inc. engages in manufacture and distribution of recreational, amphibious, and off road vehicles worldwide. It offers truck utility, sports utility, and convertible vehicles. The company was formerly known as E Jet Holdings, Inc. and changed its name to China Global Distribution Corporation. Later, the name was changed to Rodedawg International Industries, Inc. in 2005. Rodedawg International Industries is based in Hayward, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Hayward"
    },
    "SAH": {
        "short_name": "Sonic Automotive, Inc.",
        "long_name": "Sonic Automotive, Inc.",
        "summary": "Sonic Automotive, Inc. operates as an automotive retailer in the United States. It operates in two segments, Franchised Dealerships and EchoPark. The Franchised Dealerships segment is involved in the sale of new and used cars and light trucks, and replacement parts; provision of vehicle maintenance, manufacturer warranty repair, and paint and collision repair services; and arrangement of extended warranties, service contracts, financing, insurance, and other aftermarket products. The EchoPark segment sells used cars and light trucks; and arranges finance and insurance product sales in pre-owned vehicle specialty retail locations. As of December 31, 2019, the company operated 99 new vehicle franchises representing 21 brands of cars and light trucks; 15 collision repair centers in 12 states; and 9 EchoPark stores. Sonic Automotive, Inc. was founded in 1997 and is based in Charlotte, North Carolina.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Charlotte"
    },
    "SIETY": {
        "short_name": "D'IETEREN NV",
        "long_name": "D'Ieteren SA",
        "summary": "D'Ieteren SA, together with its subsidiaries, provides various services to the motorists worldwide. The company operates through D'Ieteren Auto, Belron, and Moleskine segments. It imports and distributes Volkswagen, Audi, SEAT, Â\u008akoda, Bentley, Lamborghini, Bugatti, Porsche, and Yamaha vehicles, as well as its spare parts and accessories. The company also provides vehicle glass repair and replacement services under the Carglass, Safelite AutoGlass, and Autoglass brands; and manages vehicle glass and other insurance claims on behalf of insurance customers. In addition, it develops and sells branded notebooks, as well as writing, travel, and reading accessories under the Moleskine brand name. Further, the company sells used vehicles; and provides after-sales services, including bodywork, maintenance, glass, and tyre replacement services. D'Ieteren SA was founded in 1805 and is headquartered in Brussels, Belgium.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Belgium",
        "city": "Brussels"
    },
    "SJY.SI": {
        "short_name": "$ MeGroup",
        "long_name": "MeGroup Ltd.",
        "summary": "MeGroup Ltd., through its subsidiaries, primarily engages in the automobile dealership business in Malaysia. The company operates in two segments, Manufacturing Business and Dealership Business. It engages in the sale of new automobiles, as well as automobile parts and accessories; and provision of automobile body paintwork, collision repair, and after-sales services. The company also manufactures noise, vibration, and harshness (NVH) components, such as headliners and engine outers that are incorporated into various parts of automobiles, including top ceiling, dashboard, hood, and boot; and non-NVH components comprising parcel trays and board assembly decks for the automotive industry, as well as provides related support services. MeGroup Ltd. was incorporated in 2018 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "SPMI": {
        "short_name": "SPEEDEMISSIONS INC",
        "long_name": "Speedemissions, Inc.",
        "summary": "Speedemissions, Inc. provides vehicle emissions testing and safety inspection services in the United States. The company performs accelerated simulated model and on-board diagnostic emissions tests for the automobile fleets of the federal, state, and local governments; and various new and used car dealers in Atlanta, Georgia. As of March 24, 2017, it operated 21 vehicle emissions testing and safety inspection stations under the trade names of Speedemissions and Auto Emissions Express in Atlanta, Georgia, and St. Louis in Missouri. The company also operates 3 mobile testing units in Atlanta, Georgia. In addition, it sells automotive parts and supplies, such as windshield wipers, taillight bulbs, and gas caps; and offers oil change and other services. Further, the company provides Carbonga, an iPhone application that diagnoses an automobile's computer system using the on board diagnostic port on vehicles; and receives vehicle safety recalls and technical service bulletins. Speedemissions, Inc. was founded in 2001 and is based in Tyrone, Georgia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Tyrone"
    },
    "STRN.AS": {
        "short_name": "STERN GROEP",
        "long_name": "Stern Groep N.V.",
        "summary": "Stern Groep N.V. operates as an automotive retail and services company in the Netherlands. The company operates through Dealergroup Stern, Stern Mobility Solutions, Stern Car Services, and Other segments. The Dealergroup Stern segment engages in the sale of new and used passenger cars and light commercial vehicles; and provision of maintenance and repair services for passenger cars and light commercial vehicles. The Stern Mobility Solutions segment provides car rental, fleet management, and e-mobility services, as well as sells financial and other mobility products to small and medium-sized enterprises. The Stern Car Services segment offers car body repair and passenger cars maintenance services; and interiors fitting services for light commercial vehicles. The company also provides used-car warranty, car insurance, and lettering services, as well as parts. It sells cars under various brands, including Abarth, Alfa Romeo, Dacia, Fiat, Ford, Jaguar, Jeep, Kia, Land Rover, Mercedes-Benz, Mitsubishi Motors, Nissan, Opel, Renault, Smart, Subaru, and Volvo. Stern Groep N.V. is headquartered in Amsterdam, the Netherlands.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "AMS",
        "market": "nl_market",
        "country": "Netherlands",
        "city": "Amsterdam"
    },
    "T15.SI": {
        "short_name": "h TCIL HK$",
        "long_name": "Tan Chong International Limited",
        "summary": "Tan Chong International Limited, an investment holding company, distributes and retails motor vehicles in Singapore, Malaysia, the People's Republic of China, the Philippines, Cambodia, Vietnam, Thailand, Japan, and internationally. The company distributes various models of Nissan and Subaru passenger cars; and Nissan light commercial vehicles. It also distributes heavy commercial vehicles and industrial equipment, including Nissan forklift trucks, as well as auto spare parts. In addition, the company engages in the rental of machinery and provision of workshop services; trading of used cars; and investment, development, and sale of properties. Further, it manufactures vehicle seats; and provides vehicle transportation and maintenance, cargo logistics, human resource, hire purchase financing, leasing, and insurance agency services. The company was founded in 1957 and is based in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "TRA.AX": {
        "short_name": "TURNERS FPO NZX",
        "long_name": "Turners Automotive Group Limited",
        "summary": "Turners Automotive Group Limited engages in the automotive retail business in New Zealand and Australia. It operates through five segments: Automotive Retail, Finance, Credit Management, Insurance, and Corporate & Other. The company buys and sells second hand cars, trucks, machinery, and commercial goods under the Turners and Buy Right Cars brand names. It also provides financial solutions for personal, vehicle, and small to medium business customers under the Oxford Finance brand; and underwrites and distributes a range of life and non-life consumer insurance products under the Autosure and Greenwich Life Insurance brands. In addition, the company offers automotive-owner protection insurance policies for the retail motor vehicle industry through various dealers under the Autosure brand; and debt collection, credit management and reporting, and terms of trade documentation services to the SME market under the EC Credit Control brand. Further, it is involved in trustee and auction businesses. The company was formerly known as Turners Limited and changed its name to Turners Automotive Group Limited in May 2017. Turners Automotive Group Limited was incorporated in 1984 and is based in Auckland, New Zealand.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "ASX",
        "market": "au_market",
        "country": "New Zealand",
        "city": "Auckland"
    },
    "TRA.NZ": {
        "short_name": "Turners Automotive Group Ltd Or",
        "long_name": "Turners Automotive Group Limited",
        "summary": "Turners Automotive Group Limited engages in the automotive retail business in New Zealand and Australia. It operates through five segments: Automotive Retail, Finance, Credit Management, Insurance, and Corporate & Other. The company buys and sells second hand cars, trucks, machinery, and commercial goods under the Turners and Buy Right Cars brand names. It also provides financial solutions for personal, vehicle, and small to medium business customers under the Oxford Finance brand; and underwrites and distributes a range of life and non-life consumer insurance products under the Autosure and Greenwich Life Insurance brands. In addition, the company offers automotive-owner protection insurance policies for the retail motor vehicle industry through various dealers under the Autosure brand; and debt collection, credit management and reporting, and terms of trade documentation services to the SME market under the EC Credit Control brand. Further, it is involved in trustee and auction businesses. The company was formerly known as Turners Limited and changed its name to Turners Automotive Group Limited in May 2017. Turners Automotive Group Limited was incorporated in 1984 and is based in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "city": "Auckland"
    },
    "TURI.JK": {
        "short_name": "Tunas Ridean Tbk.",
        "long_name": "PT Tunas Ridean Tbk",
        "summary": "PT Tunas Ridean Tbk engages in the automotive dealership business in Indonesia. The company operates in three segments: Automotive, Rental Services, and Financial Services. It acts as a dealer for Toyota, BMW, Daihatsu, Isuzu, and Honda brands. The company also rents motor vehicles; and provides driver, cleaning, and auction services, as well as offers vehicle financing services. PT Tunas Ridean Tbk was founded in 1967 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "UA9.F": {
        "short_name": "PENSKE AUTOMOTIVE DL-0001",
        "long_name": "Penske Automotive Group, Inc.",
        "summary": "Penske Automotive Group, Inc., a diversified transportation services company, operates automotive and commercial truck dealerships. The company operates through four segments: Retail Automotive, Retail Commercial Truck, Other, and Non-Automotive Investments. It operates dealerships under franchise agreements with various automotive manufacturers and distributors. The company engages in the sale of new and used motor vehicles; and related products and services, including vehicle and collision repair services, as well as in the placement of finance and lease contracts, third-party insurance products, and other aftermarket products. It also operates used vehicle supercenters that retails and wholesales used vehicles. The company also operates a heavy and medium duty trucks dealership, offering primarily Freightliner and Western Star branded trucks, as well as a range of used trucks, services and parts, and maintenance and repair services. In addition, it imports and distributes Western Star heavy-duty trucks, MAN heavy and medium duty trucks, buses, and Dennis Eagle refuse collection vehicles, together with associated parts. Further, the company distributes diesel and gas engines, and power systems. The company operates 317 retail automotive franchises, including 145 franchises located in the United States and 172 franchises located outside of the United States; sixteen used vehicle supercenters in the United States and the United Kingdom; and 25 commercial truck dealerships in Texas, Oklahoma, Tennessee, Georgia, Utah, Idaho, and Canada. Penske Automotive Group, Inc. was incorporated in 1990 and is headquartered in Bloomfield Hills, Michigan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Bloomfield Hills"
    },
    "VRM": {
        "short_name": "Vroom, Inc.",
        "long_name": "Vroom, Inc.",
        "summary": "Vroom, Inc. operates an e-commerce platform for buying, selling, and trading of new and used cars in the United States. It also offers financing solutions. The company was formerly known as Auto America, Inc. and changed its name to Vroom, Inc. in July 2015. The company was founded in 2012 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "VTU.L": {
        "short_name": "VERTU MOTORS PLC ORD 10P",
        "long_name": "Vertu Motors plc",
        "summary": "Vertu Motors plc operates as an automotive retailer in the United Kingdom. The company sells new cars, motorcycles, commercial vehicles, and used vehicles, as well as provides related aftersales services. It operates a chain of franchised motor dealerships offering sales, service, parts, and bodyshop facilities for new and used cars, and commercial vehicles under the Bristol Street Motors, Farnell Land Rover, Farnell Jaguar, Vertu Mercedes-Benz, Macklin Motors, and Hereford Audi brands. The company's franchise dealerships include Audi, Citroen, CUPRA, Dacia, DS, Ford, Honda, Hyundai, Infiniti, Jaguar, Jeep, Land Rover, Mazda, Mercedes-Benz, Nissan, Peugeot, Renault, Seat, Skoda, smart, Toyota, Vauxhall, Volkswagen, and Volvo. In addition, the company operates as a pension scheme trustee; and provides vehicle financing and related insurance products. Further, it is involved in the online van and parts retailing businesses; and online advertising business. The company operates through a network of 121 franchised and 3 non-franchised outlets in 130 locations. Vertu Motors plc was founded in 2006 and is headquartered in Gateshead, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Gateshead"
    },
    "WJP.SI": {
        "short_name": "VICOM Ltd",
        "long_name": "VICOM Ltd",
        "summary": "VICOM Ltd provides technical testing and inspection services in Singapore. The company offers vehicle inspection services, including inspection for petrol-driven and diesel-driven vehicles, motorcycles, and power assisted bicycles; vehicle assessment services; and emission test laboratory services. It also provides vehicle evaluation, vehicle inspection and type approval system, in-vehicle unit, speed limiter check, chassis dynamometer smoke test, road tax renewal, motor and general insurance, car buying tips and maintenance talks, and consultancy services. The company offers testing, calibration, inspection, consultancy, and training services to aerospace, marine and offshore, biotechnology, oil and petrochemical, building construction, and electronics manufacturing industries. The company was incorporated in 1981 and is based in Singapore. VICOM Ltd is a subsidiary of ComfortDelGro Corporation Limited.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "WLMM3.SA": {
        "short_name": "WLM IND COM ON",
        "long_name": "WLM Participações e Comércio de Máquinas e Veículos S.A.",
        "summary": "WLM ParticipaÃ§Ãµes e ComÃ©rcio de MÃ¡quinas e VeÃ­culos S.A. engages in the marketing and sale of heavy trucks, road and urban bus chassis, and spare parts under the Scania brand in Brazil. The company also provides maintenance services and specialized technical assistance. In addition, it engages in the production, breeding, and commercialization of beef cattle; and cultivation and commercialization of grains. The company was formerly known as WLM IndÃºstria e ComÃ©rcio S.A. and changed its name to WLM ParticipaÃ§Ãµes e ComÃ©rcio de MÃ¡quinas e VeÃ­culos S.A. in December 2017. The company was founded in 1946 and is headquartered in Rio de Janeiro, Brazil. WLM ParticipaÃ§Ãµes e ComÃ©rcio de MÃ¡quinas e VeÃ­culos S.A. is a subsidiary of SajuthÃ¡-Rio ParticipaÃ§Ãµes S.A.",
        "currency": "BRL",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "city": "Rio De Janeiro"
    },
    "WLMM4.SA": {
        "short_name": "WLM IND COM PN",
        "long_name": "WLM Participações e Comércio de Máquinas e Veículos S.A.",
        "summary": "WLM ParticipaÃ§Ãµes e ComÃ©rcio de MÃ¡quinas e VeÃ­culos S.A. engages in the marketing and sale of heavy trucks, road and urban bus chassis, and spare parts under the Scania brand in Brazil. The company also provides maintenance services and specialized technical assistance. In addition, it engages in the production, breeding, and commercialization of beef cattle; and cultivation and commercialization of grains. The company was formerly known as WLM IndÃºstria e ComÃ©rcio S.A. and changed its name to WLM ParticipaÃ§Ãµes e ComÃ©rcio de MÃ¡quinas e VeÃ­culos S.A. in December 2017. The company was founded in 1946 and is headquartered in Rio de Janeiro, Brazil. WLM ParticipaÃ§Ãµes e ComÃ©rcio de MÃ¡quinas e VeÃ­culos S.A. is a subsidiary of SajuthÃ¡-Rio ParticipaÃ§Ãµes S.A.",
        "currency": "BRL",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "city": "Rio De Janeiro"
    },
    "XA4.F": {
        "short_name": "CARMAX INC.  DL-,50",
        "long_name": "CarMax, Inc.",
        "summary": "CarMax, Inc., through its subsidiaries, operates as a retailer of used vehicles in the United States. The company operates in two segments, CarMax Sales Operations and CarMax Auto Finance. It offers customers a range of makes and models of used vehicles, including domestic, imported, and luxury vehicles; vehicles that do not meet its retail standards to licensed dealers through on-site wholesale auctions; and extended protection plans to customers at the time of sale. The company also provides reconditioning and vehicle repair services; and financing alternatives for retail customers across a range of credit spectrum through its CarMax Auto Finance and arrangements with various financial institutions. As of February 29, 2020, it operated approximately 216 stores and 2 new car franchises. CarMax, Inc. was founded in 1993 and is based in Richmond, Virginia.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Richmond"
    }
}