{"000007.SZ": {"short_name": "SHENZHEN QUANXINHA", "long_name": "Shenzhen Quanxinhao Co., Ltd.", "summary": "Shenzhen Quanxinhao Co., Ltd. owns and operates hotels in China. The company operates the Grand hotel located in Shenzhen and the Asia Gulf hotel located in Xiamen. It also provides property management, financial information consulting, venture capital, financial investment, equity investment, and investment management services. The company was founded in 1983 and is based in Shenzhen, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Shenzhen"}, "000428.SZ": {"short_name": "HUATIAN HOTEL GP", "long_name": "Huatian Hotel Group Co.,Ltd.", "summary": "Huatian Hotel Group Co.,Ltd. operates hotels in China. The company operates hotels that offer mall, food, banquet, spa, and other services. Huatian Hotel Group Co.,Ltd. is based in Changsha, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Changsha"}, "000524.SZ": {"short_name": "GUANGZHOU LINGNAN", "long_name": "Guangzhou Lingnan Group Holdings Company Limited", "summary": "Guangzhou Lingnan Group Holdings Company Limited engages in the tourism, hotel, exhibition, and travel businesses in China. It provides outbound tourism, domestic tourism, inbound tourism, etc.; operates international and domestic air ticketing agents, conventions, scenic spot development and management, overseas study consultation, property management, information technology consulting services, computer technology development, technical, and other services; and travel agency. The company also operates hotels. In addition, it engages in the planning, organizing, and reception of various exhibitions and conferences. Additionally, the company offers various imported or domestic cars, commercial vehicles, station wagons, and taxis on long-term and temporary rental basis, as well as for conferences, travel, wedding banquets, and guest transfers; and other car services. The company was formerly known as Guangzhou Dongfang Hotel Co., Ltd. and changed its name to Guangzhou Lingnan Group Holdings Company Limited in May 2015. Guangzhou Lingnan Group Holdings Company Limited is based in Guangzhou, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Guangzhou"}, "000613.SZ": {"short_name": "HAINAN DADONGHAI", "long_name": "Hainan Dadonghai Tourism Centre (Holdings) Co., Ltd.", "summary": "Hainan Dadonghai Tourism Centre (Holdings) Co., Ltd. provides hotel accommodation and catering services in the People's Republic of China. The company was founded in 1993 and is based in Sanya, the People's Republic of China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Sanya"}, "000978.SZ": {"short_name": "GUILIN TOURISM COR", "long_name": "Guilin Tourism Corporation Limited", "summary": "Guilin Tourism Corporation Limited provides tourism and related services in China. It is also involved in the cruise passenger, scenic tourism, hotel, road travel passenger transportation, and taxi businesses. Guilin Tourism Corporation Limited is based in Guilin, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Guilin"}, "002033.SZ": {"short_name": "LIJIANG YULONG TOU", "long_name": "LiJiang YuLong Tourism Co., LTD.", "summary": "LiJiang YuLong Tourism Co., LTD. operates hotels in China. It operates the Intercontinental Hotel, the Hotel Indigo, and Lijiang Lishi Hotel; Impression Lijiang; Lijiang 5596; White Deer Tour; Longde Tourism; Long Yue Restaurant; and Lijiang Longtu Travel Agency located in the city of Lijiang, as well as provides cableway services. The company was founded in 2001 and is based in Lijiang, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Lijiang"}, "0022.HK": {"short_name": "MEXAN", "long_name": "Mexan Limited", "summary": "Mexan Limited, an investment holding company, operates a Winland 800 Hotel in Tsing Yi, Hong Kong. Winland 800 Hotel consists of 800 rooms. The company also invests in and holds properties. Mexan Limited was incorporated in 1991 and is based in Tsing Yi, Hong Kong. Mexan Limited is a subsidiary of Winland Wealth (BVI) Limited.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Tsing Yi"}, "0045.HK": {"short_name": "HK&S HOTELS", "long_name": "The Hongkong and Shanghai Hotels, Limited", "summary": "The Hongkong and Shanghai Hotels, Limited, an investment holding company, engages in the ownership, development, and management of hotels, and commercial and residential properties in Asia, the United States, and Europe. It operates through three divisions: Hotels, Commercial Properties, and Clubs and Services. The Hotels division is involved in the operation of hotels; and lease of commercial shopping arcades and office premises located within the hotel buildings. The Commercial Properties division engages in the development, lease, and sale of luxury residential apartments; and lease of retail and office premises, as well as operation of food and beverage outlets in such premises. The Clubs and Services division operates golf courses, as well as The Peak Tram, a tramway; wholesales and retails food and beverage products; and offers laundry, and management and consultancy services for clubs. The company is also involved in the wholesale and retail of merchandise; provision of dry cleaning, and marketing services; lending and borrowing of funds; and operation of golf clubs, as well as in the resort and property investment activities. In addition, it offers tourism, leisure, and other services; and operates Peninsula Boutiques. The company was formerly known as The Hongkong Hotel Company, Limited. The Hongkong and Shanghai Hotels, Limited was founded in 1866 and is headquartered in Central, Hong Kong.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "0078.HK": {"short_name": "REGAL INT'L", "long_name": "Regal Hotels International Holdings Limited", "summary": "Regal Hotels International Holdings Limited, an investment holding company, owns, operates, and manages hotels in Hong Kong, Mainland China, and internationally. It operates through six segments: Hotel Operation and Management and Hotel Ownership, Asset Management, Property Development and Investment, Financial Assets Investments, Aircraft Ownership and Leasing, and Others. The company is also involved in the provision of hotel management services; and ownership of hotel properties for rental income. In addition, it invests in, develops, sells, and rents properties, as well as offers property agency and management services. Further, the company is involved in the development and distribution of multimedia entertainment and digital educational content, and multi-platform social games; operation and management of restaurants; operation of security storage lounge; provision of housekeeping services; security and guarding services; room reservation services; and sale of food products, as well as securities trading and investment, and aircraft ownership and leasing activities. Additionally, it offers nominee, financing, and contracting agency; and asset management services. The company is headquartered in Causeway Bay, Hong Kong. Regal Hotels International Holdings Limited is a subsidiary of Century City International Holdings Limited.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Causeway Bay"}, "0184.HK": {"short_name": "KECK SENG INV", "long_name": "Keck Seng Investments (Hong Kong) Limited", "summary": "Keck Seng Investments (Hong Kong) Limited, an investment holding company, engages in the hotel and club operations, and property investment and development activities. It operates through three segments: Hotel, Property, and Investment and Corporate. The Hotel segment offers hotel room accommodation services; and food and beverages at hotel restaurant outlets, as well as operates slot machines. The Property segment leases investment properties, which primarily consist of retail, commercial, and office properties; and develops, sells, and markets trading properties, as well as offers management services. The Investment and Corporate segment is involved in the non-trading and trading securities; financial instruments; and other treasury operations. It has operations primarily in Macau, Vietnam, the People's Republic of China, Japan, Canada, the United States, and Hong Kong. The company was incorporated in 1973 and is based in Central, Hong Kong.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "0559.HK": {"short_name": "DETAI NEWENERGY", "long_name": "DeTai New Energy Group Limited", "summary": "DeTai New Energy Group Limited, an investment holding company, engages in the hotel hospitality business. It operates the hotel, One Niseko Resort Towers located in the Niseko, Hokkaido, Japan. The company also provides money lending services; trades in and distributes liquor and wine; invests in funds; and develops, manufactures, and distributes EuroAd, a vegetable of additive. It primarily operates in Hong Kong, Sweden, Japan, and the People's Republic of China. The company was formerly known as Guocang Group Limited and changed its name to DeTai New Energy Group Limited in December 2015. DeTai New Energy Group Limited is headquartered in Wan Chai, Hong Kong.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "0617.HK": {"short_name": "PALIBURG HOLD", "long_name": "Paliburg Holdings Limited", "summary": "Paliburg Holdings Limited, through its subsidiaries, engages in the property investment and development, construction and building related, and hotel ownership businesses in Hong Kong, Mainland China, and internationally. The company's Property Development and Investment segment develops, sells, and leases properties; and provides estate agency services. Its Construction and Building Related Businesses segment engages in the construction works and building related businesses, including the provision of development consultancy and project management services, and property management services. This segment also develops and distributes security systems and products, and other software. The company's Hotel Operation and Management and Hotel Ownership segment owns, operates, and rents hotels; and provides hotel management services. Its Asset Management segment provides asset management services to Regal REIT. The company's Financial Assets Investments segment trades in financial assets at fair value through profit or loss; and other financial assets investments. Its Aircraft Ownership and Leasing segment owns, leases, and rents aircraft. The company's Others segment provides financing services, sells food products, operates and manages restaurants, operates security storage lounge, offers housekeeping and related services, and develops and distributes multimedia entertainment and digital educational content and multi-platform social games. Paliburg Holdings Limited also offers securities investment, management, financing, nominee, lighting technology, mechanical and electrical engineering, contracting agency, and trademark holding services. The company is headquartered in Causeway Bay, Hong Kong. Paliburg Holdings Limited is a subsidiary of Century City International Holdings Limited.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Causeway Bay"}, "1189.HK": {"short_name": "GBA DYNAMIC", "long_name": "Greater Bay Area Dynamic Growth Holding Limited", "summary": "Greater Bay Area Dynamic Growth Holding Limited, an investment holding company, owns, operates, and manages hotels in the People's Republic of China and Hong Kong. The company operates through two segments, Hotel Operations and Securities Trading. It operates three hotels under the Rosedale brand, including the Rosedale Hotel in Hong Kong, the Rosedale Hotel & Suites in Guangzhou, and the Rosedale Hotel Shenyang, as well as the Luoyang Golden Gulf Hotel. The company is also involved in the trading of equity securities; and property investment business. In addition, it engages in the rental of shop units in hotels. The company was formerly known as Rosedale Hotel Holdings Limited. The company was incorporated in 1997 and is headquartered in Wan Chai, Hong Kong.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "1270.HK": {"short_name": "LANGHAM-SS", "long_name": "Langham Hospitality Investments Limited", "summary": "Langham Hospitality Investments Limited, an investment holding company, engages in the property investment business in Hong Kong. It owns and invests in a portfolio of hotels under The Langham, Hong Kong; Cordis, Hong Kong; and Eaton HK brands. The company manages 23 hotels. It also engages in the provision of administrative, financing, and treasury management services. The company was incorporated in 2013 and is based in Wanchai, Hong Kong. Langham Hospitality Investments Limited is a subsidiary of LHIL Assets Holdings Limited.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wanchai"}, "1820.SR": {"short_name": "Abdulmohsen Alhokair Group for ", "long_name": "Abdulmohsen Al-Hokair Group for Tourism and Development Company", "summary": "Abdulmohsen Al-Hokair Group for Tourism and Development Company operates primarily in the hospitality and entertainment sectors in the Kingdom of Saudi Arabia and the United Arab Emirates. It operates hotels and resorts, restaurants, and meeting and event venues. The company was founded in 1965 and is based in Riyadh, Saudi Arabia.", "currency": "SAR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SAU", "market": "sr_market", "country": "Saudi Arabia", "city": "Riyadh"}, "1HTA.F": {"short_name": "HYATT HOTELS CL. A DL-,01", "long_name": "Hyatt Hotels Corporation", "summary": "Hyatt Hotels Corporation, a hospitality company, develops, owns, operates, manages, franchises, licenses, or provides services to hotels, resorts, and other properties. It operates through four segments: Owned and Leased Hotels, Americas Management and Franchising, ASPAC Management and Franchising, and EAME/SW Asia Management and Franchising. The company operates its properties under the Park Hyatt, Miraval, Grand Hyatt, Alila, Andaz, The Unbound Collection by Hyatt, Destination, Hyatt Regency, Hyatt, Hyatt Ziva, Hyatt Zilara, Thompson Hotels, Hyatt Centric, Caption by Hyatt, Hyatt House, Hyatt Place, tommie, Hyatt Residence Club, Hyatt Residences, Exhale, World of Hyatt, and Hyatt Resorts brands. As of September 30, 2020, its hotel portfolio consisted of approximately 950 hotels in 67 countries. It primarily serves corporations; national, state, and regional associations; specialty market accounts, including social, government, military, educational, religious, and fraternal accounts; travel agency and luxury organizations; and a group of individual consumers. Hyatt Hotels Corporation has a strategic alliance with Small Luxury Hotels to provide benefits to the members of World of Hyatt loyalty program by providing additional stay opportunities at luxury hotels primarily in Europe. The company was formerly known as Global Hyatt Corporation and changed its name to Hyatt Hotels Corporation in June 2009. Hyatt Hotels Corporation was founded in 1957 and is headquartered in Chicago, Illinois.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Chicago"}, "200613.SZ": {"short_name": "HAINAN DADONGHAI", "long_name": "Hainan Dadonghai Tourism Centre (Holdings) Co., Ltd.", "summary": "Hainan Dadonghai Tourism Centre (Holdings) Co., Ltd. provides hotel accommodation and catering services in the People's Republic of China. The company was founded in 1993 and is based in Sanya, the People's Republic of China.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Sanya"}, "2404.T": {"short_name": "TETSUJIN INC", "long_name": "TETSUJIN Inc.", "summary": "TETSUJIN Inc. operates in the karaoke entertainment business. The company provides space for amusement facilities; operates luxury space business; sells and rents audio equipment and karaoke peripherals; and produces and sells sound sources for content providers, as well as business content for mobile phones. It also offers inbound music distribution application service provider services; and rents cosplay costumes. The company was founded in 1999 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2704.TW": {"short_name": "AMBASSADOR HOTEL", "long_name": "The Ambassador Hotel,Ltd.", "summary": "The Ambassador Hotel,Ltd. operates hotels and restaurants under the Ambassador Hotels and Restaurants, and amba Hotels & Resorts brands in Taiwan. The company was founded in 1962 and is based in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "2705.TW": {"short_name": "LEOFOO DEVELOPMENT", "long_name": "Leofoo Development Co., Ltd.", "summary": "Leofoo Development Co., Ltd. engages in the tourism and travel industry in Taiwan. It operates hotels under the Courtyard by Marriott Taipei and Leofoo Hotel brands; apartment-style boutique hotel under the Leofoo Residences brand; theme park under the Leofoo Village brand; resort hotel under the Leofoo Resort Guanshi brand; water theme park under the Leofoo Water Park brand; and bakeries under the Elite Bakery, and Elite Concept brands. The company was founded in 1968 and is based in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu"}, "2707.TW": {"short_name": "FORMOSA INTERNATIONAL HOTELS CO", "long_name": "Formosa International Hotels Corporation", "summary": "Formosa International Hotels Corporation operates in the hotel industry in Taiwan and internationally. It owns and manages Regent Hotels & Resorts, an international luxury hotel brand; Silks Place, a lifestyle hotel brand; and Just Sleep, an affordable business hotel chain. The company operates 18 hotels with 3,849 rooms and suites. It also operates restaurants in National Palace Museum and various other renowned attractions in Taiwan, as well as operates Domino's Pizza chain in Taiwan. The company was founded in 1991 and is based in Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "2739.TW": {"short_name": "MY HUMBLE HOUSE HOSPITALITY MGM", "long_name": "My Humble House Hospitality Management Consulting Co., Ltd.", "summary": "My Humble House Hospitality Management Consulting Co., Ltd. operates tourism hotels in Taiwan and internationally. The company also provides hospitality consulting services. Its property portfolio includes the Sheraton Grand Taipei Hotel, Le Meridien Taipei, and Mu Jiao Xi Hotel, as well as My Humble House Art Gallery that presents contemporary works of art. My Humble House Hospitality Management Consulting Co., Ltd. was founded in 2000 and is based in Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "2WY.F": {"short_name": "WYNDHAM HT + RSTS INC.", "long_name": "Wyndham Hotels & Resorts, Inc.", "summary": "Wyndham Hotels & Resorts, Inc. operates as a hotel franchisor worldwide. The company operates a portfolio of 20 hotel brands, including Super 8, Days Inn, Ramada, Microtel, La Quinta, Baymont, Wingate, AmericInn, Hawthorn Suites, Trademark Collection, and Wyndham. Its Hotel Franchising segments licenses its lodging brands and provides related services to third-party hotel owners and others. The company's Hotel Management segment provides hotel management services for full-service and limited service hotels. As of November 25, 2020, it operated a network of approximately 9,000 hotels with approximately 804,000 rooms in 90 countries. Wyndham Hotels & Resorts, Inc. is also involved in the loyalty program business. The company was incorporated in 2017 and is headquartered in Parsippany, New Jersey.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Parsippany"}, "32P.F": {"short_name": "PPHE HOTEL GROUP LTD.", "long_name": "PPHE Hotel Group Limited", "summary": "PPHE Hotel Group Limited owns, develops, leases, operates, and franchises full-service upscale and lifestyle hotels in Netherlands, Germany and Hungary, Croatia, and the United Kingdom. It owns and operates hotels and resorts under the Park Plaza, the art'otel, and the Arena Campsites brands, as well as the Arena Hotels & Apartments. As of January 30, 2020, the company owned/operated 37 hotels and resorts with approximately 8,800 rooms; and 8 campsites offering approximately 6,000 units in central London. It also operates restaurants and bars; and coffee shop and Spa. The company was formerly known as Park Plaza Hotels Limited and changed its name to PPHE Hotel Group Limited in March 2012. PPHE Hotel Group Limited was founded in 1989 and is based in Amsterdam, the Netherlands.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "Netherlands", "city": "Amsterdam"}, "3R8.F": {"short_name": "AGORA HOSPITALITY GP CO.", "long_name": "AGORA Hospitality Group Co., Ltd", "summary": "AGORA Hospitality Group Co., Ltd engages in the hotel operation and property development activities in Japan. The company operates various hotels, including full service, limited service, resort, and traditional ryokans type hotels. It also provides cafeteria and hotel management, operation and asset management, due diligence and renewal project, and repositioning and rebranding planning services. The company was formerly known as Tokai Kanko Co., Ltd. and changed its name to AGORA Hospitality Group Co., Ltd in April 2012. AGORA Hospitality Group Co., Ltd was founded in 1948 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "3WY.F": {"short_name": "BARKBY GRP PLC LS 0,00860", "long_name": "The Barkby Group PLC", "summary": "The Barkby Group PLC engages in consumer and hospitality, real estate, and life sciences businesses. The company operates specialty coffee bars; and gastropubs, inns, and function spaces. It also sells luxury vehicles through showrooms, as well as through online. In addition, the company is involved in sourcing and developing commercial property projects, including retail warehouses, car dealerships, and storage. Further, it offers SleepHub, a product that re-trains the brain to revert to natural sleep cycles through use of audible beats and pulses; and VivoPlex, a device allows clinicians to optimize and personalize fertility treatments. The company was incorporated in 2010 and is based in Abingdon, the United Kingdom.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Abingdon"}, "5HH.SI": {"short_name": "$ Sinjia Land", "long_name": "Sinjia Land Limited", "summary": "Sinjia Land Limited, an investment holding company, operates and manages lodging and boarding houses, and backpackers hostels in Singapore, Thailand, and the United States. It also invests in fund management business. The company was formerly known as HLN Technologies Limited and changed its name to Sinjia Land Limited in April 2013. Sinjia Land Limited was founded in 1979 and is headquartered in Singapore.", "currency": "SGD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "5I1.SI": {"short_name": "$ KOP", "long_name": "KOP Limited", "summary": "KOP Limited, an investment holding company, operates as a real estate development and entertainment company. It operates through Real Estate Development and Investment, Real Estate Origination and Management Services, Hospitality, and Entertainment segments. The company invests in, develops, constructs, manages, and sells real estate properties. It is also involved in the properties acquisition and development conceptualization, construction management, and marketing and branding strategizing activities, as well as retail sale of projects; and development, management, and operation of hotels and resorts, including restaurants and spas. In addition, the company sells goods and tickets; and assigns distribution rights, as well as engages in the sponsorship, theatrical distribution, and concert promotions activities. Further, it is involved in business and management consultancy services; property management and consultancy activities; ownership and lease of real estate properties; investment management and consultancy activities; and operation of cafes and coffee houses. The company has operations in Singapore, Indonesia, and the People's Republic of China. KOP Limited was incorporated in 2004 and is headquartered in Singapore.", "currency": "SGD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "600054.SS": {"short_name": "HUANGSHAN TOURISM DEVELOPMENT C", "long_name": "Huangshan Tourism Development Co., Ltd.", "summary": "Huangshan Tourism Development Co., Ltd. engages in the tourism business in China. It is also involved in the hotel, Huizhou cuisine catering, cableways, garden development, travel agencies, and environmental sanitation and cleaning of scenic spots businesses. The company was founded in 1996 and is based in Huangshan, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Huangshan"}, "600138.SS": {"short_name": "CHINA CYTS TOURS HOLDING CO. LT", "long_name": "China Cyts Tours Holding Co., Ltd.", "summary": "China Cyts Tours Holding Co., Ltd. operates as a tour operator in China. It offers inbound, domestic, and outbound travel services; conferences and exhibitions services; and technical support, travel-affiliated resources development, and online information services. The company also operates ChinaTravelDepot.com, a travel Website that offers a range of travel services, such as tour packages, cruise, hotel, flight, car rental, and international travel services; and offers airport transfer, tour guides, and fleet of luxury buses. It operates through a network of approximately 60 chain stores and outlets in China, as well as 3 branch offices in Hong Kong, Japan, and North America. The company was founded in 1980 and is headquartered in Beijing, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Beijing"}, "600258.SS": {"short_name": "BTG HOTELS (GROUP) CO LTD", "long_name": "BTG Hotels (Group) Co., Ltd.", "summary": "BTG Hotels (Group) Co., Ltd. engages in the operation and management of hotels in the People's Republic of China. The company was formerly known as Beijing Capital Tourism Co.,Ltd. and changed its name to BTG Hotels (Group) Co., Ltd. in August 2013. The company was founded in 1999 and is headquartered in Beijing, the People's Republic of China. BTG Hotels (Group) Co., Ltd. operates as a subsidiary of Beijing Tourism Group.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Beijing"}, "600749.SS": {"short_name": "TIBET TOURISM CO. LTD.", "long_name": "Tibet Tourism Co.,Ltd", "summary": "Tibet Tourism Co.,Ltd provides tourism services in China. The company operates scenic spots, including the Yarlung Zangbo Grand Canyon in Linzhi City, Tibet Autonomous Region, the Shenshen Lake Ba Songcuo, the Benzri Mountain, the Lulang Huahai Ranch, and the Ali Area of the Tibet Autonomous Region. It also operates hotels, such as Himalaya Lhasa, Himalaya Grand Canyon, Himalaya Bazoncuo, Himalayan Pran, Himalaya Gang Rinpoche, Tarchin Xixia Bangma Xiangke, and Payang Town Xixiabangma, as well as Lulang Huahai Forest Villa Resort, and Ba Songcuo self-driving and outdoor camp. In addition, the company provides travel agency, tourist passenger transportation, and other tourism services. Tibet Tourism Co.,Ltd was founded in 1996 and is based in Lhasa, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Lhasa"}, "601007.SS": {"short_name": "JINLING HOTEL CORPORATION LTD.", "long_name": "Jinling Hotel Corporation, Ltd.", "summary": "Jinling Hotel Corporation, Ltd. operates hotels in China. The company also operates business building; develops tourism ecological parks; hotel materials trade business; and distributes wine. Jinling Hotel Corporation, Ltd. was founded in 1983 and is based in Nanjing, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Nanjing"}, "603136.SS": {"short_name": "JIANGSU TIANMU LAKE TOURISM CO ", "long_name": "Jiangsu Tianmu Lake Tourism Co.,Ltd", "summary": "Jiangsu Tianmu Lake Tourism Co.,Ltd. operates a tourism resort in China. Its resort has three sightseeing and leisure facilities with hotel and food facilities under the names of Tianmu Lake Landscape Park Scenic Spot, Tianmu Lake Nanshan Bamboo Sea Scenic Spot, and Tianmu Lake Yushui Hot Spring. The company is based in Liyang, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Liyang"}, "6076.F": {"short_name": "AMAZE CO LTD", "long_name": "Amaze Co., Ltd.", "summary": "Amaze Co., Ltd. engages in the hotel and restaurant businesses in Japan. It operates a chain of hotels under the HOTEL AZ name. The company was founded in 1911 and is headquartered in Oita, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FKA", "market": "jp_market", "country": "Japan", "city": "Oita"}, "648.F": {"short_name": "KYORITSU MAINTEN.", "long_name": "Kyoritsu Maintenance Co., Ltd.", "summary": "Kyoritsu Maintenance Co., Ltd. operates dormitories for students and companies. It also supplies meals for students; operates hotels under the Dormy Inn name, as well as spring and resort hotels; and offers housing for senior citizens. The company was founded in 1979 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "6565.T": {"short_name": "ABHOTEL CO LTD", "long_name": "Abhotel Co., Ltd.", "summary": "Abhotel Co., Ltd. operates hotel business in Japan. The company was founded in 2014 and is based in Anjo, Japan. Abhotel Co., Ltd. is a subsidiary of Tosho Co., Ltd.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Anjo"}, "8920.T": {"short_name": "TOSHO CO LTD", "long_name": "Tosho Co., Ltd.", "summary": "Tosho Co., Ltd. engages in sports club, hotel, and real estate businesses in Japan. The company was founded in 1979 and is headquartered in Anjo, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Anjo"}, "900929.SS": {"short_name": "SHANGHAI JINJIANG INTL TRAVEL C", "long_name": "Shanghai Jinjiang International Travel Co., Ltd.", "summary": "Shanghai Jinjiang International Travel Co., Ltd. provides travel agency services. It organizes outbound and domestic tourism for Chinese citizens; and inbound tourism for international travelers; and conferences and exhibitions. The company is based in Shanghai, China. Shanghai Jinjiang International Travel Co., Ltd. is a subsidiary of Shanghai Jinjiang International Hotels (Group) Co., Ltd.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Shanghai"}, "900942.SS": {"short_name": "HUANGSHAN TOURISM DEVELOPMENT C", "long_name": "Huangshan Tourism Development Co., Ltd.", "summary": "Huangshan Tourism Development Co., Ltd. engages in the tourism business in China. It is also involved in the hotel, Huizhou cuisine catering, cableways, garden development, travel agencies, and environmental sanitation and cleaning of scenic spots businesses. The company was founded in 1996 and is based in Huangshan, China.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Huangshan"}, "9616.T": {"short_name": "KYORITSU MAINTENANCE", "long_name": "Kyoritsu Maintenance Co., Ltd.", "summary": "Kyoritsu Maintenance Co., Ltd. operates dormitories for students and companies. It also supplies meals for students; operates hotels under the Dormy Inn name, as well as spring and resort hotels; and offers housing for senior citizens. The company was founded in 1979 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9695.T": {"short_name": "KAMOGAWA GRAND HOTEL", "long_name": "The Kamogawa Grand Hotel, Ltd.", "summary": "The Kamogawa Grand Hotel, Ltd. engages in hotel and resort related businesses in Japan. The company was formerly known as Yoshidaya Ryokan, Ltd. and changed its name to The Kamogawa Grand Hotel, Ltd. in 1965. The Kamogawa Grand Hotel, Ltd. was founded in 1952 and is headquartered in Kamogawa, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kamogawa"}, "9704.T": {"short_name": "AGORA HOSPITALITY GROUP CO LTD", "long_name": "AGORA Hospitality Group Co., Ltd", "summary": "AGORA Hospitality Group Co., Ltd engages in the hotel operation and property development activities in Japan. The company operates various hotels, including full service, limited service, resort, and traditional ryokans type hotels. It also provides cafeteria and hotel management, operation and asset management, due diligence and renewal project, and repositioning and rebranding planning services. The company was formerly known as Tokai Kanko Co., Ltd. and changed its name to AGORA Hospitality Group Co., Ltd in April 2012. AGORA Hospitality Group Co., Ltd was founded in 1948 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9720.T": {"short_name": "HOTEL NEW GRAND CO", "long_name": "Hotel Newgrand Co.,Ltd.", "summary": "Hotel Newgrand Co.,Ltd. engages in the hotel and resorts businesses in Japan. It operates the Hotel New Grand in Yokohama. The company was incorporated in 1926 and is based in Yokohama, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Yokohama"}, "9722.T": {"short_name": "FUJITA KANKO INC", "long_name": "Fujita Kanko Inc.", "summary": "Fujita Kanko Inc. operates as a tourism company in Japan and East Asia. It operates hotels, wedding and banquet venues, restaurants, and resorts, as well as leisure facilities, such as theme parks, aquariums, and golf courses. The company also offers supplementary services, including hotel room cleaning, flower provision and arrangement, garden care and landscaping, and photography. In addition, it provides management services for resorts and urban condominiums, and property management services for land to be used for building villas. Fujita Kanko Inc. was founded in 1955 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9723.T": {"short_name": "KYOTO HOTEL", "long_name": "The Kyoto Hotel, Ltd.", "summary": "The Kyoto Hotel, Ltd. operates accommodation, banquet, restaurant, and other facilitates in Japan. The company operates hotels under the Karasuma Kyoto Hotel and Kyoto Hotel Okura names. The Kyoto Hotel, Ltd. was founded in 1927 and is headquartered in Kyoto, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kyoto"}, "A34.SI": {"short_name": "Amara", "long_name": "Amara Holdings Limited", "summary": "Amara Holdings Limited, an investment holding company, engages in the hotel investment and management; property investment and development; and specialty restaurants and food services businesses in Singapore, the People's Republic of China, and Thailand. It invests in and develops office, retail, and residential properties. The company is also involved in the share trading and investment activities; and the provision of construction services, as well as in franchising business. In addition, it offers management and technical advisory services for the management and development of hotels and resorts; and general management and administrative services. The company was incorporated in 1970 and is based in Singapore. Amara Holdings Limited is a subsidiary of First Security Pte Ltd.", "currency": "SGD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "AC.PA": {"short_name": "ACCOR", "long_name": "Accor SA", "summary": "Accor SA operates a chain of hotels. It operates through three segments: HotelServices, Hotel Assets & Others, and New Businesses. The company owns, operates, manages, and franchises hotels. It also provides digital solutions to independent hotel operators and restaurant owners through D-edge, ResDiary, and Adoria platforms; and hotel booking services for travels agencies and corporates through Gekko solutions. In addition, the company offers concierge services; and digital sales through VeryChic, which offers private sales with luxury and high-end partners, as well as rents private luxury homes, such as onefinestay. As of December 31, 2019, it operated 5,089 hotels with 746,504 rooms in 111 countries worldwide. The company was founded in 1967 and is headquartered in Issy-les-Moulineaux, France.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PAR", "market": "fr_market", "country": "France", "city": "Issy-les-Moulineaux"}, "ACCYY": {"short_name": "ACCOR SA", "long_name": "Accor SA", "summary": "Accor SA operates a chain of hotels. It operates through three segments: HotelServices, Hotel Assets & Others, and New Businesses. The company owns, operates, manages, and franchises hotels. It also provides digital solutions to independent hotel operators and restaurant owners through D-edge, ResDiary, and Adoria platforms; and hotel booking services for travels agencies and corporates through Gekko solutions. In addition, the company offers concierge services; and digital sales through VeryChic, which offers private sales with luxury and high-end partners, as well as rents private luxury homes, such as onefinestay. As of December 31, 2019, it operated 5,089 hotels with 746,504 rooms in 111 countries worldwide. The company was founded in 1967 and is headquartered in Issy-les-Moulineaux, France.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "France", "city": "Issy-les-Moulineaux"}, "ACRFF": {"short_name": "ACCOR SA", "long_name": "Accor SA", "summary": "Accor SA operates a chain of hotels. It operates through three segments: HotelServices, Hotel Assets & Others, and New Businesses. The company owns, operates, manages, and franchises hotels. It also provides digital solutions to independent hotel operators and restaurant owners through D-edge, ResDiary, and Adoria platforms; and hotel booking services for travels agencies and corporates through Gekko solutions. In addition, the company offers concierge services; and digital sales through VeryChic, which offers private sales with luxury and high-end partners, as well as rents private luxury homes, such as onefinestay. As of December 31, 2019, it operated 5,089 hotels with 746,504 rooms in 111 countries worldwide. The company was founded in 1967 and is headquartered in Issy-les-Moulineaux, France.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "France", "city": "Issy-les-Moulineaux"}, "ACZ.JO": {"short_name": "Arden Capital Limited", "long_name": "Arden Capital Limited", "summary": "Arden Capital Limited, an investment holding company, operates in the hospitality, real estate, and logistics sectors in Zimbabwe. It owns and manages Victoria Falls hotel, a five star hotel with 161 rooms; Kingdom at Victoria Falls, a three star hotel with 294 rooms; and Elephant Hills, Victoria Falls, a four star hotel with 276 rooms, as well as Monomotapa Hotel Harare, a four star hotel with 243 rooms. The company also owns other hotels and resorts that comprise 83 rooms, as well as recreational harbours in Lake Kariba and game farms. In addition, it provides fuel transportation services. Further, the company engages in the property development and consulting businesses. The company was formerly known as Brainworks Limited and changed its name to Arden Capital Limited in December 2019. Arden Capital Limited was founded in 2011 and is based in EbÃ¨ne Cybercity, the Republic of Mauritius.", "currency": "ZAc", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JNB", "market": "za_market", "country": "Mauritius", "city": "Ebene"}, "AHLEAST.NS": {"short_name": "ASIAN HOTELS (EAST", "long_name": "Asian Hotels (East) Limited", "summary": "Asian Hotels (East) Limited engages in the hotel business in India. It operates Hyatt Regency Kolkata, a five-star hotel located in the city of Kolkata; and Hyatt Regency Chennai, a hotel situated in the city of Chennai. The company was formerly known as Vardhman Hotels Limited and changed its name to Asian Hotels (East) Limited in February 2010. Asian Hotels (East) Limited was incorporated in 2007 and is based in Kolkata, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Kolkata"}, "AHLWEST.NS": {"short_name": "ASIAN HOTELS (WEST", "long_name": "Asian Hotels (West) Limited", "summary": "Asian Hotels (West) Limited, together with its subsidiaries, engages in the hotel business in India. It owns and operates the Hotel Hyatt Regency in Mumbai; and the JW Marriott Hotel, a five-star deluxe hotel with 523 rooms in New Delhi. The company was formerly known as Chillwinds Hotels Limited and changed its name to Asian Hotels (West) Limited in February 2010. Asian Hotels (West) Limited was incorporated in 2007 and is based in New Delhi, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NSI", "market": "in_market", "country": "India", "city": "New Delhi"}, "AHP.V": {"short_name": "Allied Hotel Properties Inc", "long_name": "Allied Hotel Properties Inc.", "summary": "Allied Hotel Properties Inc. engages in the ownership, management, and development of hotels and real estate properties in Canada. It operates in two segments, Hotel Operations and Real Estate Development. The company owns and manages the Toronto Don Valley Hotel and Suites, a 353-room full service hotel located in Toronto, Ontario. It also has an interest in a residential condominium development project in Toronto. The company was founded in 1968 and is based in Vancouver, Canada. Allied Hotel Properties Inc. is a subsidiary of Allied Holdings Ltd.", "currency": "CAD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "ALLHB.PA": {"short_name": "LES HOTELS BAVEREZ", "long_name": "Les Hôtels Baverez S.A.", "summary": "Les HÃ´tels Baverez S.A. owns and operates 5-star hotels in Paris. It operates three hotels, including Hotel Regina; Hotel Raphael; and Majestic HÃ´tel-Spa. The company is based in Paris, France.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PAR", "market": "fr_market", "country": "France", "city": "Paris"}, "APOLSINHOT.NS": {"short_name": "APOLLO SINDOORI HO", "long_name": "Apollo Sindoori Hotels Limited", "summary": "Apollo Sindoori Hotels Limited operates as a hospitality service management and support services company in India. It provides catering services to corporates, institutions, hospitals, and industries; and kitchen planning and management services. The company also operates hotels in Chennai and Bengaluru. Apollo Sindoori Hotels Limited was incorporated in 1998 and is based in Chennai, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Chennai"}, "ARTA.JK": {"short_name": "Arthavest Tbk", "long_name": "PT Arthavest Tbk", "summary": "PT Arthavest Tbk, together with its subsidiaries, engages in the hospitality business in Central Jakarta. The company owns and operates Redtop, a 4-star business hotel with 390-suite rooms. Its Redtop hotel offers convention and banquet, meeting rooms, and business center, as well as sports center and spa. The company also provides information technology and payment system services. The company was formerly known as PT Artha Securities Tbk. PT Arthavest Tbk was founded in 1990 and is based in Central Jakarta, Indonesia. PT Arthavest Tbk is a subsidiary of Lucas SH CN.", "currency": "IDR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Pusat"}, "ASIA-R.BK": {"short_name": "ASIA HOTEL PUBLIC COMPANY LIMIT", "long_name": "Asia Hotel Public Company Limited", "summary": "Asia Hotel Public Company Limited, together with its subsidiaries, engages in the hotel and restaurant business in Thailand and internationally. The company is also involved in the rental of a shopping complex and hotel; and provision of utility, security, and cleaning services. Asia Hotel Public Company Limited was incorporated in 1964 and is based in Bangkok, Thailand.", "currency": "THB", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Bangkok"}, "AVX.SI": {"short_name": "HL Global Ent", "long_name": "HL Global Enterprises Limited", "summary": "HL Global Enterprises Limited, an investment holding company, operates in the hospitality operations and property development activities in Singapore, Malaysia, and the People's Republic of China. It operates in three segments: Investments and Others, Hospitality and Restaurant, and Property Development. The company operates and manages hotels and restaurants; and develops, sells, and rents properties. It also provides property and development project management, and hotel management and consultancy services. The company was formerly known as HLG Enterprise Limited and changed its name to HL Global Enterprises Limited in April 2008. HL Global Enterprises Limited was incorporated in 1961 and is based in Singapore.", "currency": "SGD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "AWC-R.BK": {"short_name": "ASSET WORLD CORP PUBLIC COMPANY", "long_name": "Asset World Corp Public Company Limited", "summary": "Asset World Corp Public Company Limited develops and invests in real estate properties in Thailand. The company operates through two segments, Hotel and Related Services, and Rental and Rendering of Commercial Building Services. It owns and develops a portfolio of hotels, retail and office buildings, and integrated mixed-use properties. Asset World Corp Public Company Limited was founded in 1960 and is headquartered in Bangkok, Thailand.", "currency": "THB", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Bangkok"}, "AWC.BK": {"short_name": "ASSET WORLD CORP PUBLIC COMPANY", "long_name": "Asset World Corp Public Company Limited", "summary": "Asset World Corp Public Company Limited develops and invests in real estate properties in Thailand. The company operates through two segments, Hotel and Related Services, and Rental and Rendering of Commercial Building Services. It owns and develops a portfolio of hotels, retail and office buildings, and integrated mixed-use properties. Asset World Corp Public Company Limited was founded in 1960 and is headquartered in Bangkok, Thailand.", "currency": "THB", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Bangkok"}, "B28.SI": {"short_name": "Bonvests", "long_name": "Bonvests Holdings Limited", "summary": "Bonvests Holdings Limited, an investment holding company, engages in the property development and investment, hotel ownership and management, and waste management and contract cleaning businesses. The company operates through Rental, Hotel, Industrial, Investment, and Others segments. It owns and manages various commercial and residential properties. The company also engages in the operation of the golf course, hotels and restaurants, bars, and thalassotherapy center; and investment, operation, and management of resorts, spas, and food and beverage outlets; and securities trading and investment holding activities. In addition, the company offers business and management, and public relations consultancy services; sales and marketing support; contract cleaning; laundry; and waste management services, such as waste disposal services to commercial, industrial, and residential properties, as well as other waste disposal related services. It operates in Singapore, Tunisia, Mauritius, Zanzibar, Maldives, Indonesia, Morocco, and Australia. Bonvests Holdings Limited was founded in 1982 and is based in Singapore. Bonvests Holdings Limited is a subsidiary of Goldvein Holdings Pte. Ltd.", "currency": "SGD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "BARK.L": {"short_name": null, "long_name": "The Barkby Group PLC", "summary": "The Barkby Group PLC engages in consumer and hospitality, real estate, and life sciences businesses. The company operates specialty coffee bars; and gastropubs, inns, and function spaces. It also sells luxury vehicles through showrooms, as well as through online. In addition, the company is involved in sourcing and developing commercial property projects, including retail warehouses, car dealerships, and storage. Further, it offers SleepHub, a product that re-trains the brain to revert to natural sleep cycles through use of audible beats and pulses; and VivoPlex, a device allows clinicians to optimize and personalize fertility treatments. The company was incorporated in 2010 and is based in Abingdon, the United Kingdom.", "currency": "GBp", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Abingdon"}, "BDX.SI": {"short_name": "GSH", "long_name": "GSH Corporation Limited", "summary": "GSH Corporation Limited, an investment holding company, engages in the development and sale of properties primarily in Malaysia and China. It operates through Hospitality, Property, and Others segments. The company is also involved in the rental of investment properties. In addition, it owns and operates the Sutera Harbour Resort comprising two five-star hotels, a 104-berth marina, and a 27-hole championship golf course in Kota Kinabalu, Malaysia, as well as the idyllic Sutera@Mantanani Resort, a 30-room resort on the Mantanani Islands in Sabah. Further, the company is involved in the retailing of clothing, souvenirs, and convenience items, as well as provision of upmarket train and facilities management services. Additionally, it engages in the sale of fuel and other related bunkering services; and frozen food trading business. The company was formerly known as JEL Corporation (Holdings) Ltd. and changed its name to GSH Corporation Limited in May 2012. GSH Corporation Limited was incorporated in 2001 and is based in Singapore.", "currency": "SGD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "BKW.SI": {"short_name": "Datapulse Tech", "long_name": "Datapulse Technology Limited", "summary": "Datapulse Technology Limited, an investment holding company, engages in the hotel and hospitality property investment business in South Korea and Singapore. The company is involved in the acquisition, property development, and trading of real estate, such as hotels and hospitality, commercial, industrial, residential, and mixed development properties; and operation of a hotel. It also provides asset management services, as well as engages in the investment activity of holding long-term and trading in short-term investments. The company was founded in 1980 and is headquartered in Singapore.", "currency": "SGD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "BUVA.JK": {"short_name": "Bukit Uluwatu Villa Tbk.", "long_name": "PT Bukit Uluwatu Villa Tbk", "summary": "PT Bukit Uluwatu Villa Tbk operates environmental friendly hotels and resorts in Indonesia. It operates through three segments: Hotel; Lifestyle, Recreation, and Entertainment; and Real Estate. The company primarily owns and operates Alila Ubud, Alila Manggis, Alila Villas Uluwatu, Alila SCBD, and Dialoog Banyuwangi properties. It provides hospitality, food, and beverage services; trading, construction, industrial, agricultural, printing, transportation, and workshop services; and hotel guest rooms and restaurant services. The company also sells land or villas. PT Bukit Uluwatu Villa Tbk was founded in 2000 and is headquartered in Jakarta, Indonesia.", "currency": "IDR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "BYKE.NS": {"short_name": "THE BYKE HOSPITALI", "long_name": "The Byke Hospitality Limited", "summary": "The Byke Hospitality Limited owns, operates, and manages hotels and resorts in India. It operates 20 properties with a capacity of 1,190 rooms and 145 rooms under management contract under the The Byke brand. The company was founded in 1990 and is headquartered in Mumbai, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "CAGU": {"short_name": "CASTLE GROUP INC UTAH", "long_name": "The Castle Group, Inc.", "summary": "The Castle Group, Inc., through its subsidiaries, operates in the hotel and resort management industry in the state of Hawaii, New Zealand, and the Commonwealth of Saipan under the Castle Resorts and Hotels trade name. It manages luxury and mid-range resort condominiums and hotels on various islands in the state of Hawaii; and a property located in New Zealand. The company also provides reservations staffing and operation, advertising, sales and marketing, and accounting services to property owners. The Castle Group, Inc. was incorporated in 1981 and is headquartered in Honolulu, Hawaii.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Honolulu"}, "CCHHL.NS": {"short_name": "COUNTRY CLUB HOSPI", "long_name": "Country Club Hospitality & Holidays Limited", "summary": "Country Club Hospitality & Holidays Limited provides leisure hospitality membership services in India. The company sells vacation ownership and other related services. It also provides clubbing hub, holiday destination, fitness center, and entertainment event services. The company has approximately 50 clubs, resorts, and hotels in India, the Middle East, Bangkok, and Sri Lanka. The company was formerly known as Country Club (India) Limited and changed its name to Country Club Hospitality & Holidays Limited in December 2014. Country Club Hospitality & Holidays Limited was founded in 1989 and is headquartered in Hyderabad, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Hyderabad"}, "CHALET.NS": {"short_name": "CHALET HOTELS LTD", "long_name": "Chalet Hotels Limited", "summary": "Chalet Hotels Limited develops, owns, and manages hotels in India. Its hotel platform comprises six operating hotels, including a hotel with a co-located serviced residence, located in Mumbai, Hyderabad, Pune, and Bengaluru representing 2,554 keys under the JW Marriott, Westin, Marriott, Marriott Executive Apartments, Renaissance, Four Points by Sheraton, and Novotel brands. The company is also involved in the commercial and retail operations, and real estate development. The company was formerly known as Chalet Hotels Pvt. Ltd and changed its name to Chalet Hotels Limited in June 2018. Chalet Hotels Limited was incorporated in 1986 and is headquartered in Mumbai, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "CHH": {"short_name": "Choice Hotels International, In", "long_name": "Choice Hotels International, Inc.", "summary": "Choice Hotels International, Inc., together with its subsidiaries, operates as a hotel franchisor worldwide. The company operates through Hotel Franchising and Corporate & Other segments. It franchises lodging properties under the brand names of Comfort Inn, Comfort Suites, Quality, Clarion, Clarion Pointe, Sleep Inn, Econo Lodge, Rodeway Inn, MainStay Suites, Suburban Extended Stay Hotel, WoodSpring Suites, Everhome Suites, Cambria Hotels, and Ascend Hotel Collection. The company also develops and markets cloud-based property management software to non-franchised hoteliers and vacation rental management companies. As of June 30, 2020, the company had approximately 7,100 hotels representing 600,000 rooms in approximately 40 countries and territories. Choice Hotels International, Inc. has a strategic agreement with Penn National Gaming, Inc. The company was founded in 1939 and is based in Rockville, Maryland.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Rockville"}, "CHJ.SI": {"short_name": "Uni-Asia Grp", "long_name": "Uni-Asia Group Limited", "summary": "Uni-Asia Group Limited, together with its subsidiaries, operates as an alternative investment company. It operates hotels under the Hotel Vista and Hotel Vista Premio brands. The company also owns and charters ships, as well as offers ship investment and asset management services. In addition, it provides ship commercial and technical management services; and shipping related brokerage services, as well as involved in finance arrangement business. Further, the company provides property management and investment, project management, accounting, and administration, as well as investment advisory; and property leasing and construction management services. The company has operations in Japan, Asia, and internationally. Uni-Asia Group Limited was founded in 1997 and is based in Singapore.", "currency": "SGD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "CL4A.F": {"short_name": "HUAZHU GROUP SP.ADR/1", "long_name": "Huazhu Group Limited", "summary": "Huazhu Group Limited, together with its subsidiaries, develops leased and owned, manachised, and franchised hotels primarily in the People's Republic of China. It operates hotels under its own brands, such as Hi Inn, Elan Hotel, HanTing Hotel, JI Hotel, Starway Hotel, Orange Hotel, Crystal Orange Hotel, Manxin Hotel, Madison Hotel, Joya Hotel, and Blossom Hill Hotels & Resorts. The company also operates hotels under brand franchise agreements that include Ibis, Ibis Styles, Mercure, Novotel, and Grand Mercure. As of March 31, 2020, it operated 5,953 hotels with 575,488 rooms in 15 countries. The company was formerly known as China Lodging Group, Limited and changed its name to Huazhu Group Limited in June 2018. Huazhu Group Limited was founded in 2005 and is headquartered in Shanghai, the People's Republic of China.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "China", "city": "Shanghai"}, "CLAY.JK": {"short_name": "Citra Putra Realty Tbk.", "long_name": "PT Citra Putra Realty Tbk", "summary": "PT Citra Putra Realty Tbk engages in the property and hospitality business in Indonesia. The company operates hotels. The company was founded in 2009 and is headquartered in Jakarta, Indonesia. PT Citra Putra Realty Tbk is a subsidiary of PT Citra Putra Mandiri.", "currency": "IDR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "CLH.JO": {"short_name": "City Lodge Hotels Ltd", "long_name": "City Lodge Hotels Limited", "summary": "City Lodge Hotels Limited operates hotels in South Africa and internationally. The company operates hotels under the Courtyard, City Lodge, Fairview, Town Lodge, and Road Lodge brand names. It operates 5 Courtyard hotels with 381 rooms; 20 City Lodge hotels with 3,531 rooms; 14 Town Lodge hotels with 1,804 rooms; 22 Road Lodge hotels with 2,059 rooms; and 1 Fairview hotel with 127 rooms. The company was founded in 1985 and is headquartered in Bryanston, South Africa.", "currency": "ZAc", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Bryanston"}, "CNDL": {"short_name": "CANDLEWOOD HOTEL CO INC", "long_name": "Candlewood Hotel Company, Inc.", "summary": "As of December, 2003 Candlewood Hotel Company, Inc. is out of business. Candlewood Hotel Company, Inc. operates, franchises, owns, and manages business-travel hotels. It offers studios, one-bedroom suites, and accommodations to mid-market business and personal travelers. Each hotel is equipped with an exercise room, a complimentary guest laundry facility, a dry cleaning drop, free local calls and long distance calls, and self-service packaged foods and beverages; and a free Â\u0091First Night Kit' complete with items, such as coffee and popcorn. In addition, studio and one-bedroom suite offers amenities, such as two telephones, with two incoming direct dial lines and computer connections; an executive desk with a quad-outlet to accommodate office equipment needs, an executive chair, a bulletin board, a guest chair, and personalized remote accessible telephone mail; a television, video cassette player, and compact disc player; an iron and ironing board; and a kitchen. In addition, it operates recreational facilities, such as swimming pool and fitness center; a kitchen in every suite; a complimentary Â\u0091cooked to order' breakfast; and a hospitality area for breakfast and socializing. The company was founded in 1995 and is based in Wichita, Kansas.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Wichita"}, "CQA2.F": {"short_name": "CENTURY CITY INTL  HD-,10", "long_name": "Century City International Holdings Limited", "summary": "Century City International Holdings Limited, an investment holding company, engages in property development and investment, construction and building related, hotel ownership, hotel operation and management, asset management, financial assets investments, aircraft ownership and leasing, and other investment businesses. The company's Property Development and Investment segment develops and sells properties; leases properties; and provides estate agency services. Its Construction and Building Related Businesses segment is involved in construction works and building related businesses, including the provision of development consultancy and project management services, property management, security systems and products, and other software development and distribution services. The company's Hotel Operation and Management and Hotel Ownership segment engages in hotel operations and providing hotel management services, and the ownership of hotel properties for rental. Its Asset Management segment offers asset management services to Regal REIT. The company's Financial Assets Investments segment is involved in trading financial assets, and other financial assets investments. Its Aircraft Ownership and leasing segment owns and leases aircrafts. The company's Others segment provides financing, housekeeping, logistics, and related services; sells food products; operates and manages restaurants; operates security storage lounges; and develops and distributes multimedia entertainment, and digital educational content, as well as multi-platform social games. It also offers mechanical and electrical engineering services; and nominee, secretarial, and management services. The company operates in Hong Kong, Mainland China, and internationally. Century City International Holdings Limited is headquartered in Causeway Bay, Hong Kong.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Causeway Bay"}, "CZH.F": {"short_name": "CHOICE HOTELS INT. DL-,01", "long_name": "Choice Hotels International, Inc.", "summary": "Choice Hotels International, Inc., together with its subsidiaries, operates as a hotel franchisor worldwide. The company operates through Hotel Franchising and Corporate & Other segments. It franchises lodging properties under the brand names of Comfort Inn, Comfort Suites, Quality, Clarion, Clarion Pointe, Sleep Inn, Econo Lodge, Rodeway Inn, MainStay Suites, Suburban Extended Stay Hotel, WoodSpring Suites, Everhome Suites, Cambria Hotels, and Ascend Hotel Collection. The company also develops and markets cloud-based property management software to non-franchised hoteliers and vacation rental management companies. As of June 30, 2020, the company had approximately 7,100 hotels representing 600,000 rooms in approximately 40 countries and territories. Choice Hotels International, Inc. has a strategic agreement with Penn National Gaming, Inc. The company was founded in 1939 and is based in Rockville, Maryland.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Rockville"}, "DAL.L": {"short_name": "DALATA HOTEL GROUP PLC ORD EUR0", "long_name": "Dalata Hotel Group plc", "summary": "Dalata Hotel Group plc owns and operates hotels under the Clayton Hotels and Maldron Hotels brand names in Ireland and the United Kingdom. It operates in three segments: Dublin, Regional Ireland, and United Kingdom. The company operates three-star and four-star hotels. It also operates Red Bean Roastery coffee outlets; Grain & Grill restaurants; and Club Vitae leisure centers in hotels. In addition, the company provides catering, asset management, third party hotel management, property investment and holding, and financing services. As of February 25, 2020, it had a portfolio of 30 owned hotels, 11 leased hotels, and three management contracts with a total of 9,208 bedrooms. The company was founded in 2007 and is based in Dublin, Ireland.", "currency": "GBp", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "LSE", "market": "gb_market", "country": "Ireland", "city": "Dublin"}, "DANH.TA": {"short_name": "DAN HOTELS LTD", "long_name": "Dan Hotels Ltd", "summary": "Dan Hotels Ltd owns and operates a chain of hotels in Israel. It operates 15 hotels with a total of 3,950 rooms. The company also operates and manages five business lounges and a VIP lounge at Ben Gurion Airport; owns and manages apartments and commercial space at Â\u0091King David Towers' in Tel Aviv; and owns a third of the Panorama Mall commercial center in Haifa. In addition, it operates two vocational schools; and provides catering services to the Israel Defense Forces. The company was founded in 1947 and is headquartered in Tel Aviv, Israel.", "currency": "ILA", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Tel Aviv"}, "DHG.F": {"short_name": "DALATA HOTEL GROUP EO-,01", "long_name": "Dalata Hotel Group plc", "summary": "Dalata Hotel Group plc owns and operates hotels under the Clayton Hotels and Maldron Hotels brand names in Ireland and the United Kingdom. It operates in three segments: Dublin, Regional Ireland, and United Kingdom. The company operates three-star and four-star hotels. It also operates Red Bean Roastery coffee outlets; Grain & Grill restaurants; and Club Vitae leisure centers in hotels. In addition, the company provides catering, asset management, third party hotel management, property investment and holding, and financing services. As of February 25, 2020, it had a portfolio of 30 owned hotels, 11 leased hotels, and three management contracts with a total of 9,208 bedrooms. The company was founded in 2007 and is based in Dublin, Ireland.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "Ireland", "city": "Dublin"}, "DHG.IR": {"short_name": "DALATA HOTEL GP.", "long_name": "Dalata Hotel Group plc", "summary": "Dalata Hotel Group plc owns and operates hotels under the Clayton Hotels and Maldron Hotels brand names in Ireland and the United Kingdom. It operates in three segments: Dublin, Regional Ireland, and United Kingdom. The company operates three-star and four-star hotels. It also operates Red Bean Roastery coffee outlets; Grain & Grill restaurants; and Club Vitae leisure centers in hotels. In addition, the company provides catering, asset management, third party hotel management, property investment and holding, and financing services. As of February 25, 2020, it had a portfolio of 30 owned hotels, 11 leased hotels, and three management contracts with a total of 9,208 bedrooms. The company was founded in 2007 and is based in Dublin, Ireland.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "ISE", "market": "ie_market", "country": "Ireland", "city": "Dublin"}, "DTC-R.BK": {"short_name": "DUSIT THANI PUBLIC COMPANY LIMI", "long_name": "Dusit Thani Public Company Limited", "summary": "Dusit Thani Public Company Limited, together with its subsidiaries, owns and operates hotels and resorts in Thailand and internationally. The company operates through four segments: Hotel and Hotel Management, Education, Foods, and Others. It operates hotels under the Dusit Thani, Dusit Devarana, dusitD2, Dusit Princess, ASAI HOTELS, and Dusit Residence brands; spas which provide various treatments, including massages, facials, body treatments, and various exclusive programs under the Devarana Spa, Namm Spa, DVN Spa, d v n urban, and dvn brands; and healthy food restaurants. The company also provides hotel management and consultancy services; as well as engages in the food and beverage catering business, and manufactures and distributes sauces, seasonings mixes, condiments, ready to eat meals, vegetarian food, and plant-based protein products. In addition, it operates Dusit Thani College that offers undergraduate and postgraduate hospitality degrees; Dusit Thani Excellence Centre, which provides short courses and corporate training services; and as a REIT manager for real estate investment trust. Further, the company is involved in the leasing and sub-leasing of properties business. Dusit Thani Public Company Limited was founded in 1948 and is headquartered in Bangkok, Thailand.", "currency": "THB", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Bangkok"}, "DTC.BK": {"short_name": "DUSIT THANI PUBLIC COMPANY LIMI", "long_name": "Dusit Thani Public Company Limited", "summary": "Dusit Thani Public Company Limited, together with its subsidiaries, owns and operates hotels and resorts in Thailand and internationally. The company operates through four segments: Hotel and Hotel Management, Education, Foods, and Others. It operates hotels under the Dusit Thani, Dusit Devarana, dusitD2, Dusit Princess, ASAI HOTELS, and Dusit Residence brands; spas which provide various treatments, including massages, facials, body treatments, and various exclusive programs under the Devarana Spa, Namm Spa, DVN Spa, d v n urban, and dvn brands; and healthy food restaurants. The company also provides hotel management and consultancy services; as well as engages in the food and beverage catering business, and manufactures and distributes sauces, seasonings mixes, condiments, ready to eat meals, vegetarian food, and plant-based protein products. In addition, it operates Dusit Thani College that offers undergraduate and postgraduate hospitality degrees; Dusit Thani Excellence Centre, which provides short courses and corporate training services; and as a REIT manager for real estate investment trust. Further, the company is involved in the leasing and sub-leasing of properties business. Dusit Thani Public Company Limited was founded in 1948 and is headquartered in Bangkok, Thailand.", "currency": "THB", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Bangkok"}, "DTPA.MU": {"short_name": "DATAPULSE TECHNOLOGY NEW", "long_name": "Datapulse Technology Limited", "summary": "Datapulse Technology Limited, an investment holding company, engages in the hotel and hospitality property investment business in South Korea and Singapore. The company is involved in the acquisition, property development, and trading of real estate, such as hotels and hospitality, commercial, industrial, residential, and mixed development properties; and operation of a hotel. It also provides asset management services, as well as engages in the investment activity of holding long-term and trading in short-term investments. The company was founded in 1980 and is headquartered in Singapore.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "MUN", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "EA71.F": {"short_name": "EXTENDED STAY PA.C.1S.1B", "long_name": "Extended Stay America, Inc.", "summary": "Extended Stay America, Inc., together with its subsidiaries, owns, operates, develops, and manages hotels in the United States. As of November 20, 2020, the company had a network of 646 hotels. It serves customers in the mid-priced extended stay segment. The company also licenses Extended Stay America brand to third party franchisees. Extended Stay America, Inc. was founded in 1995 and is headquartered in Charlotte, North Carolina.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Charlotte"}, "EAST.JK": {"short_name": "Eastparc Hotel Tbk.", "long_name": "PT Eastparc Hotel Tbk", "summary": "PT Eastparc Hotel Tbk owns and operates hotels in Indonesia. It operates Eastparc Hotel, a 5 star hotel with 189 guestrooms located in Yogyakarta. PT Eastparc Hotel Tbk is based in Yogyakarta, Indonesia.", "currency": "IDR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Yogyakarta"}, "EBG.AX": {"short_name": "EUMUNDI FPO", "long_name": "Eumundi Group Limited", "summary": "Eumundi Group Limited engages in the hotel management and retail property investment businesses in Australia. The company's Hotel Operations segment sells owns and operates public hotels with bar, bistro, and gaming facilities; and conducts commercial and retail liquor sales through owned and leased premises. It operates the Ashmore Tavern, Aspley Central Taverns hotels, and Aspley Shopping Centre and Aspley Arcade Shopping Village. The company's Investment Property Operations segment owns and leases investment property assets to retail tenants. Eumundi Group Limited was incorporated in 1989 and is headquartered in Ashmore, Australia.", "currency": "AUD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Ashmore"}, "EIHAHOTELS.NS": {"short_name": "EIH ASSOC HOTELS", "long_name": "EIH Associated Hotels Limited", "summary": "EIH Associated Hotels Limited engages in the ownership, management, and operation of five star deluxe and five star hotels in India. It operates The Oberoi Cecil at Shimla and The Oberoi Rajvilas at Jaipur; and hotels under the Trident name in Agra, Bhubaneswar, Chennai, Cochin, Jaipur, and Udaipur. The company was formerly known as Oberoi Associated Hotels Limited and changed its name to EIH Associated Hotels Limited in November 1996. EIH Associated Hotels Limited was incorporated in 1983 and is based in Delhi, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Delhi"}, "EIHOTEL.NS": {"short_name": "EIH LTD", "long_name": "EIH Limited", "summary": "EIH Limited engages in the ownership, development, management, and operation of hotels and cruisers in India and internationally. It owns a 100% equity interest in the six Â\u0091The Oberoi Hotels' located in Mumbai, New Delhi, Kolkata, Bengaluru, Udaipur, and Ranthambhore, as well as in Agra, Jaipur, and Shimla. The company also has a 100% equity interest in and manages the Trident, Nariman Point and Trident, and Bandra-Kurla Complex in Mumbai; and 36% equity interest in the Trident Hotels located in Agra, Bhubaneswar, Chennai, Cochin, Jaipur, and Udaipur, as well as manages the Trident in Gurugram. Further, it owns and operates Oberoi Flight Services and Oberoi Airport Services, which provide catering and other services to international airlines; operates restaurants and lounges in various airports; operates a commercial printing press; and provides air charter, car rental, and project management services, as well as operates the Maidens Hotel in Delhi. EIH Limited was incorporated in 1949 and is based in Delhi, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Delhi"}, "ERW-R.BK": {"short_name": "THE ERAWAN GROUP PUBLIC COMPANY", "long_name": "The Erawan Group Public Company Limited", "summary": "The Erawan Group Public Company Limited, through its subsidiaries, engages in hotel and building rental businesses in Thailand. The company operates hotels and resorts under the Grand Hyatt Erawan Bangkok, JW Marriott Bangkok, The Naka Island, Renaissance Koh Samui Resort and Spa, Courtyard by Marriott Bangkok, Holiday Inn Pattaya, Mercure Bangkok Siam, ibis Hotel, Novotel Bangkok Sukhumvit 4, Mercure Bangkok Sukhumvit 24, ibis Style Bangkok Sukhumvit 4, ibis Bangkok Siam, ibis Styles Krabi Ao Nang, ibis Pattaya, ibis Phuket Patong, ibis Phuket Kata, ibis Samui Bophut, ibis Hua Hin, and HOP INN names. As of December 31, 2019, it owned 70 hotels and 9,569 rooms. The company is also involved in the development of properties; provision of management services; rental of units in office buildings and shopping centers; and ownership of land. The Erawan Group Public Company Limited was founded in 1982 and is headquartered in Bangkok, Thailand.", "currency": "THB", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Bangkok"}, "ERW.BK": {"short_name": "THE ERAWAN GROUP PUBLIC COMPANY", "long_name": "The Erawan Group Public Company Limited", "summary": "The Erawan Group Public Company Limited, through its subsidiaries, engages in hotel and building rental businesses in Thailand. The company operates hotels and resorts under the Grand Hyatt Erawan Bangkok, JW Marriott Bangkok, The Naka Island, Renaissance Koh Samui Resort and Spa, Courtyard by Marriott Bangkok, Holiday Inn Pattaya, Mercure Bangkok Siam, ibis Hotel, Novotel Bangkok Sukhumvit 4, Mercure Bangkok Sukhumvit 24, ibis Style Bangkok Sukhumvit 4, ibis Bangkok Siam, ibis Styles Krabi Ao Nang, ibis Pattaya, ibis Phuket Patong, ibis Phuket Kata, ibis Samui Bophut, ibis Hua Hin, and HOP INN names. As of December 31, 2019, it owned 70 hotels and 9,569 rooms. The company is also involved in the development of properties; provision of management services; rental of units in office buildings and shopping centers; and ownership of land. The Erawan Group Public Company Limited was founded in 1982 and is headquartered in Bangkok, Thailand.", "currency": "THB", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Bangkok"}, "ESTA.JK": {"short_name": "Esta Multi Usaha Tbk.", "long_name": "PT Esta Multi Usaha Tbk", "summary": "PT Esta Multi Usaha Tbk owns and operates a hotel under the Hotel 88 name in Indonesia. The company's Hotel 88 operates a total of 70 rooms located in Bekasi City. It also engages in the rental of shops, as well as rental and trade of passenger cars. The company was formerly known as PT Esta Asri Propertindo and changed its name to PT Esta Multi Usaha Tbk in September 2019. PT Esta Multi Usaha Tbk was founded in 2011 and is headquartered in South Tangerang, Indonesia. PT Esta Multi Usaha Tbk is a subsidiary of PT Esta Utama Corpora.", "currency": "IDR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "South Tangerang"}, "FITT.JK": {"short_name": "Hotel Fitra International Tbk.", "long_name": "PT Hotel Fitra International Tbk", "summary": "PT Hotel Fitra International Tbk owns and operates hotels in Indonesia. The company operates Fitra Hotel, a three-star hotel with 113 rooms located in Majalengka. It also provides travel and tourism services. The company is based in Majalengka, Indonesia.", "currency": "IDR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Majalengka"}, "FTAL.TA": {"short_name": "FATTAL HOLDINGS", "long_name": "Fattal Holdings (1998) Ltd", "summary": "Fattal Holdings (1998) Ltd owns and operates hotels. It operates 39 hotels with 16,700 rooms in Israel; and approximately 150 Leonardo-branded hotels in Europe. The company was founded in 1998 and is based in Tel Aviv, Israel.", "currency": "ILA", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Tel Aviv"}, "G80.F": {"short_name": "DETAI NEW ENERGY GR.HD-05", "long_name": "DeTai New Energy Group Limited", "summary": "DeTai New Energy Group Limited, an investment holding company, engages in the hotel hospitality business. It operates the hotel, One Niseko Resort Towers located in the Niseko, Hokkaido, Japan. The company also provides money lending services; trades in and distributes liquor and wine; invests in funds; and develops, manufactures, and distributes EuroAd, a vegetable of additive. It primarily operates in Hong Kong, Sweden, Japan, and the People's Republic of China. The company was formerly known as Guocang Group Limited and changed its name to DeTai New Energy Group Limited in December 2015. DeTai New Energy Group Limited is headquartered in Wan Chai, Hong Kong.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Wan Chai"}, "GEAHF": {"short_name": "GREAT EAGLE HLDGS", "long_name": "Great Eagle Holdings Limited", "summary": "Great Eagle Holdings Limited, an investment holding company, invests in, develops, and manages residential, office, retail, and hotel properties in Asia, North America, Australasia, and Europe. It operates through Hotel Operation, Property Investment, Property Development, Other Operations, Champion REIT, Langham, and US Real Estate Fund segments. The company engages in leasing furnished apartments; and workspace, asset management, hotel accommodation, food and banquet, and restaurant operations. It also owns and operates a portfolio of hotels under The Langham, Langham Place, and Cordis brand names. In addition, the company offers property management services, including facilities management, security services, cleanliness and hygiene, financial management, staff training, green and risk management, maintenance and repairs, building survey, car park management, consultancy, and club house management services, as well as property maintenance and agency services. Further, it sells building materials; invests in securities; offers real estate investment trust, project, treasury, investment, and investment fund management services, as well as procurement and financing services; and issues medium term notes. Great Eagle Holdings Limited was founded in 1963 and is headquartered in Wanchai, Hong Kong.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Wanchai"}, "GHG": {"short_name": "GreenTree Hospitality Group Ltd", "long_name": "GreenTree Hospitality Group Ltd.", "summary": "GreenTree Hospitality Group Ltd., through its subsidiaries, develops leased-and-operated, and franchised-and-managed hotels under the GreenTree brand in the People's Republic of China. As of December 31, 2019, it operated 34 leased-and-operated hotels; and had franchised-and-managed hotels network consisting of 3,957 hotels with 290,026 rooms in operation covering 339 cities in China, and an additional 949 hotels with 68,522 rooms that were contracted for or under development. The company was founded in 2004 and is headquartered in Shanghai, the People's Republic of China. GreenTree Hospitality Group Ltd. is a subsidiary of GreenTree Inns Hotel Management Group, Inc.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NYQ", "market": "us_market", "country": "China", "city": "Shanghai"}, "GHK.F": {"short_name": "GREAT EAGLE HLDGS  HD-,50", "long_name": "Great Eagle Holdings Limited", "summary": "Great Eagle Holdings Limited, an investment holding company, invests in, develops, and manages residential, office, retail, and hotel properties in Asia, North America, Australasia, and Europe. It operates through Hotel Operation, Property Investment, Property Development, Other Operations, Champion REIT, Langham, and US Real Estate Fund segments. The company engages in leasing furnished apartments; and workspace, asset management, hotel accommodation, food and banquet, and restaurant operations. It also owns and operates a portfolio of hotels under The Langham, Langham Place, and Cordis brand names. In addition, the company offers property management services, including facilities management, security services, cleanliness and hygiene, financial management, staff training, green and risk management, maintenance and repairs, building survey, car park management, consultancy, and club house management services, as well as property maintenance and agency services. Further, it sells building materials; invests in securities; offers real estate investment trust, project, treasury, investment, and investment fund management services, as well as procurement and financing services; and issues medium term notes. Great Eagle Holdings Limited was founded in 1963 and is headquartered in Wanchai, Hong Kong.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Wanchai"}, "H": {"short_name": "Hyatt Hotels Corporation", "long_name": "Hyatt Hotels Corporation", "summary": "Hyatt Hotels Corporation, a hospitality company, develops, owns, operates, manages, franchises, licenses, or provides services to hotels, resorts, and other properties. It operates through four segments: Owned and Leased Hotels, Americas Management and Franchising, ASPAC Management and Franchising, and EAME/SW Asia Management and Franchising. The company operates its properties under the Park Hyatt, Miraval, Grand Hyatt, Alila, Andaz, The Unbound Collection by Hyatt, Destination, Hyatt Regency, Hyatt, Hyatt Ziva, Hyatt Zilara, Thompson Hotels, Hyatt Centric, Caption by Hyatt, Hyatt House, Hyatt Place, tommie, Hyatt Residence Club, Hyatt Residences, Exhale, World of Hyatt, and Hyatt Resorts brands. As of September 30, 2020, its hotel portfolio consisted of approximately 950 hotels in 67 countries. It primarily serves corporations; national, state, and regional associations; specialty market accounts, including social, government, military, educational, religious, and fraternal accounts; travel agency and luxury organizations; and a group of individual consumers. Hyatt Hotels Corporation has a strategic alliance with Small Luxury Hotels to provide benefits to the members of World of Hyatt loyalty program by providing additional stay opportunities at luxury hotels primarily in Europe. The company was formerly known as Global Hyatt Corporation and changed its name to Hyatt Hotels Corporation in June 2009. Hyatt Hotels Corporation was founded in 1957 and is headquartered in Chicago, Illinois.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Chicago"}, "H07.SI": {"short_name": "Stamford Land", "long_name": "Stamford Land Corporation Ltd", "summary": "Stamford Land Corporation Ltd, an investment holding company, owns, operates, and manages luxury hotels in Singapore, Australia, the United Kingdom, and New Zealand. The company operates through five segments: Hotel Owning and Management, Property Development, Property Investment, Trading, and Others. It owns and operates hotels and resorts under the Sir Stamford Circular Quay, Stamford Plaza Sydney Airport, Stamford Grand Adelaide, Stamford Plaza Adelaide, Stamford Plaza Melbourne, Stamford Plaza Brisbane, and Stamford Plaza Auckland names. The company also invests in, develops, constructs, trades in, rents, and manages real estate properties. In addition, it trades in interior  decoration products; and offers trustee, travel agency, and management services. Further, the company invests in securities; and provides treasury functions. The company was formerly known as Hai Sun Hup Group Ltd. Stamford Land Corporation Ltd was founded in 1935 and is based in Singapore.", "currency": "SGD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "HAVISHA.NS": {"short_name": "SRI HAVISHA HOSP A", "long_name": "Sri Havisha Hospitality and Infrastructure Limited", "summary": "Sri Havisha Hospitality and Infrastructure Limited does not have significant operations. The company intends to acquire or merge with other company, which is in hospitality/tourism business. Previously, it was engaged in bottling liquid petroleum gas. The company was formerly known as Shri Matre Power & Infrastructure Limited and changed its name to Sri Havisha Hospitality and Infrastructure Limited in November 2016. Sri Havisha Hospitality and Infrastructure Limited was incorporated in 1993 and is based in Hyderabad, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Hyderabad"}, "HCITY.MX": {"short_name": "HOTELES CITY EXPRESS SAB DE CV", "long_name": "Hoteles City Express, S.A.B. de C.V.", "summary": "Hoteles City Express, S.A.B. de C.V. operates and franchises a chain of limited-service hotels in Mexico, Costa Rica, Colombia, and Chile. As of May 22, 2019, it operated 152 hotels under the City Express, City Express Plus, City Express Suites, City Express Junior, and City Centro brands. The company also leases commercial space for rent. It primarily serves business travelers. The company was founded in 2002 and is based in Mexico City, Mexico.", "currency": "MXN", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "MEX", "market": "mx_market", "country": "Mexico", "city": "Mexico City"}, "HDP.PA": {"short_name": "HOTELS DE PARIS", "long_name": "Les Hôtels de Paris SA", "summary": "Les HÃ´tels de Paris SA operates and manages 3-star, 4-star, and 5-star hotels in Paris, France. It operates 21 hotels. The company was founded in 1992 and is headquartered in Paris, France.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PAR", "market": "fr_market", "country": "France", "city": "Paris"}, "HFUS": {"short_name": "HARTFORD GREAT HEALTH CORP", "long_name": "Hartford Great Health Corp.", "summary": "Hartford Great Health Corp., through its subsidiaries, provides hospitality services. It operates through Hospitality and Education segments. The company provides hotel and travel agency services. It also offers early childhood education services, such as parent-child and bilingual childcare classes. The company was formerly known as PhotoAmigo, Inc. and changed its name to Hartford Great Health Corp. in August 2018. Hartford Great Health Corp. was founded in 2008 and is based in Rosemead, California.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Rosemead"}, "HI91.F": {"short_name": "HILTON WORLD.HDGS DL -,01", "long_name": "Hilton Worldwide Holdings Inc.", "summary": "Hilton Worldwide Holdings Inc., a hospitality company, owns, leases, manages, develops, and franchises hotels and resorts. It operates through two segments, Management and Franchise, and Ownership. The company engages in the hotel management and licensing of its brands. It operates hotels under the Waldorf Astoria Hotels & Resorts, LXR Hotels & Resorts, Conrad Hotels & Resorts, Canopy by Hilton, Signia by Hilton, Hilton Hotels & Resorts, Curio Collection by Hilton, DoubleTree by Hilton, Tapestry Collection by Hilton, Embassy Suites by Hilton, Motto by Hilton, Hilton Garden Inn, Hampton by Hilton, Tru by Hilton, Homewood Suites by Hilton, Home2 Suites by Hilton, Hilton Grand Vacations, and Tempo by Hilton brands. The company operates in North America, South America, and Central America, including various Caribbean nations; Europe, the Middle East, and Africa; and the Asia Pacific. As of December 15, 2020, the company had approximately 6,300 properties with approximately 971,000 rooms in 118 countries and territories. Hilton Worldwide Holdings Inc. was founded in 1919 and is headquartered in McLean, Virginia.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "McLean"}, "HKSHY": {"short_name": "HONG KONG & SHANGHAI HOTELS", "long_name": "The Hongkong and Shanghai Hotels, Limited", "summary": "The Hongkong and Shanghai Hotels, Limited, an investment holding company, engages in the ownership, development, and management of hotels, and commercial and residential properties in Asia, the United States, and Europe. It operates through three divisions: Hotels, Commercial Properties, and Clubs and Services. The Hotels division is involved in the operation of hotels; and lease of commercial shopping arcades and office premises located within the hotel buildings. The Commercial Properties division engages in the development, lease, and sale of luxury residential apartments; and lease of retail and office premises, as well as operation of food and beverage outlets in such premises. The Clubs and Services division operates golf courses, as well as The Peak Tram, a tramway; wholesales and retails food and beverage products; and offers laundry, and management and consultancy services for clubs. The company is also involved in the wholesale and retail of merchandise; provision of dry cleaning, and marketing services; lending and borrowing of funds; and operation of golf clubs, as well as in the resort and property investment activities. In addition, it offers tourism, leisure, and other services; and operates Peninsula Boutiques. The company was formerly known as The Hongkong Hotel Company, Limited. The Hongkong and Shanghai Hotels, Limited was founded in 1866 and is headquartered in Central, Hong Kong.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "HLT": {"short_name": "Hilton Worldwide Holdings Inc.", "long_name": "Hilton Worldwide Holdings Inc.", "summary": "Hilton Worldwide Holdings Inc., a hospitality company, owns, leases, manages, develops, and franchises hotels and resorts. It operates through two segments, Management and Franchise, and Ownership. The company engages in the hotel management and licensing of its brands. It operates hotels under the Waldorf Astoria Hotels & Resorts, LXR Hotels & Resorts, Conrad Hotels & Resorts, Canopy by Hilton, Signia by Hilton, Hilton Hotels & Resorts, Curio Collection by Hilton, DoubleTree by Hilton, Tapestry Collection by Hilton, Embassy Suites by Hilton, Motto by Hilton, Hilton Garden Inn, Hampton by Hilton, Tru by Hilton, Homewood Suites by Hilton, Home2 Suites by Hilton, Hilton Grand Vacations, and Tempo by Hilton brands. The company operates in North America, South America, and Central America, including various Caribbean nations; Europe, the Middle East, and Africa; and the Asia Pacific. As of December 15, 2020, the company had approximately 6,300 properties with approximately 971,000 rooms in 118 countries and territories. Hilton Worldwide Holdings Inc. was founded in 1919 and is headquartered in McLean, Virginia.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "McLean"}, "HLTW.VI": {"short_name": "HILTON WORLDWIDE HOLDINGS INC", "long_name": "Hilton Worldwide Holdings Inc.", "summary": "Hilton Worldwide Holdings Inc., a hospitality company, owns, leases, manages, develops, and franchises hotels and resorts. It operates through two segments, Management and Franchise, and Ownership. The company engages in the hotel management and licensing of its brands. It operates hotels under the Waldorf Astoria Hotels & Resorts, LXR Hotels & Resorts, Conrad Hotels & Resorts, Canopy by Hilton, Signia by Hilton, Hilton Hotels & Resorts, Curio Collection by Hilton, DoubleTree by Hilton, Tapestry Collection by Hilton, Embassy Suites by Hilton, Motto by Hilton, Hilton Garden Inn, Hampton by Hilton, Tru by Hilton, Homewood Suites by Hilton, Home2 Suites by Hilton, Hilton Grand Vacations, and Tempo by Hilton brands. The company operates in North America, South America, and Central America, including various Caribbean nations; Europe, the Middle East, and Africa; and the Asia Pacific. As of December 15, 2020, the company had approximately 6,300 properties with approximately 971,000 rooms in 118 countries and territories. Hilton Worldwide Holdings Inc. was founded in 1919 and is headquartered in McLean, Virginia.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "VIE", "market": "at_market", "country": "United States", "city": "McLean"}, "HLVLTD.NS": {"short_name": "HLV LIMITED", "long_name": "HLV Limited", "summary": "HLV Limited owns, operates, and manages hotel in Mumbai, India. It operates The Leela hotel with 391 guest rooms. The company was formerly known as Hotel Leelaventure Limited and changed its name to HLV Limited in December 2019. HLV Limited was incorporated in 1981 and is based in Mumbai, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "HOOT4.SA": {"short_name": "HOTEIS OTHONPN", "long_name": "Hotéis Othon S.A.", "summary": "HotÃ©is Othon S.A. operates hotels in Brazil. It operates 1,928 apartments in 12 hotels in the Rio Janeiro, SÃ£o Paulo, Belo Horizonte, Salvador, Fortaleza, Natal and Recifel regions. The company was founded in 1943 and is based in Rio De Janeiro, Brazil.", "currency": "BRL", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SAO", "market": "br_market", "country": "Brazil", "city": "Rio De Janeiro"}, "HOTL.JK": {"short_name": "Saraswati Griya Lestari Tbk.", "long_name": "PT. Saraswati Griya Lestari Tbk", "summary": "PT. Saraswati Griya Lestari Tbk operates in the field of hospitality in Indonesia. It operates in two segments, Hotel and Property. It operates hotels, condotels, and resorts. The company was founded in 2006 and is headquartered in South Jakarta, Indonesia. PT. Saraswati Griya Lestari Tbk is a subsidiary of PT Tiara Realty.", "currency": "IDR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Selatan"}, "HRME.JK": {"short_name": "Menteng Heritage Realty Tbk.", "long_name": "PT Menteng Heritage Realty Tbk", "summary": "PT Menteng Heritage Realty Tbk, together with its subsidiaries, owns and operates hotels in Indonesia. The company owns The Hermitage, a hotel located in Menteng, Central Jakarta. It is also involved in mining; general trading and services; and sea and domestic transportation businesses. The company was formerly known as PT Citra Prestasi Abadi and changed its name to PT Menteng Heritage Realty Tbk in October 2007. The company was founded in 2007 and is based in Jakarta, Indonesia. PT Menteng Heritage Realty Tbk is a subsidiary of PT Wijaya Wisesa Realty.", "currency": "IDR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "HSG.F": {"short_name": "H.K. SHANGHAI HOT.", "long_name": "The Hongkong and Shanghai Hotels, Limited", "summary": "The Hongkong and Shanghai Hotels, Limited, an investment holding company, engages in the ownership, development, and management of hotels, and commercial and residential properties in Asia, the United States, and Europe. It operates through three divisions: Hotels, Commercial Properties, and Clubs and Services. The Hotels division is involved in the operation of hotels; and lease of commercial shopping arcades and office premises located within the hotel buildings. The Commercial Properties division engages in the development, lease, and sale of luxury residential apartments; and lease of retail and office premises, as well as operation of food and beverage outlets in such premises. The Clubs and Services division operates golf courses, as well as The Peak Tram, a tramway; wholesales and retails food and beverage products; and offers laundry, and management and consultancy services for clubs. The company is also involved in the wholesale and retail of merchandise; provision of dry cleaning, and marketing services; lending and borrowing of funds; and operation of golf clubs, as well as in the resort and property investment activities. In addition, it offers tourism, leisure, and other services; and operates Peninsula Boutiques. The company was formerly known as The Hongkong Hotel Company, Limited. The Hongkong and Shanghai Hotels, Limited was founded in 1866 and is headquartered in Central, Hong Kong.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Central"}, "HTHT": {"short_name": "Huazhu Group Limited", "long_name": "Huazhu Group Limited", "summary": "Huazhu Group Limited, together with its subsidiaries, develops leased and owned, manachised, and franchised hotels primarily in the People's Republic of China. It operates hotels under its own brands, such as Hi Inn, Elan Hotel, HanTing Hotel, JI Hotel, Starway Hotel, Orange Hotel, Crystal Orange Hotel, Manxin Hotel, Madison Hotel, Joya Hotel, and Blossom Hill Hotels & Resorts. The company also operates hotels under brand franchise agreements that include Ibis, Ibis Styles, Mercure, Novotel, and Grand Mercure. As of March 31, 2020, it operated 5,953 hotels with 575,488 rooms in 15 countries. The company was formerly known as China Lodging Group, Limited and changed its name to Huazhu Group Limited in June 2018. Huazhu Group Limited was founded in 2005 and is headquartered in Shanghai, the People's Republic of China.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NMS", "market": "us_market", "country": "China", "city": "Shanghai"}, "ICHGF": {"short_name": "INTERCONTINENTAL HOTELS GROUP", "long_name": "InterContinental Hotels Group PLC", "summary": "InterContinental Hotels Group PLC owns, manages, franchises, and leases hotels in the Americas, Europe, Asia, the Middle East, Africa, and Greater China. The company operates hotels, resorts, restaurants, and spas under the InterContinental Hotels & Resorts, Regent, Six Senses, Kimpton Hotels & Restaurants, Hotel Indigo, EVEN HOTELS, HUALUXE, Crowne Plaza, Voco, Holiday Inn, Holiday Inn Express, Holiday Inn Club Vacations, avid, Staybridge Suites, Atwell Suites, and Candlewood Suites brand names. It also provides IHG Rewards Club, a hotel loyalty program. As of February 28, 2020, the company had approximately 5,900 hotels and 884,000 rooms in approximately 100 countries. InterContinental Hotels Group PLC was founded in 1777 and is headquartered in Denham, the United Kingdom.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Denham"}, "IHG": {"short_name": "Intercontinental Hotels Group", "long_name": "InterContinental Hotels Group PLC", "summary": "InterContinental Hotels Group PLC owns, manages, franchises, and leases hotels in the Americas, Europe, Asia, the Middle East, Africa, and Greater China. The company operates hotels, resorts, restaurants, and spas under the InterContinental Hotels & Resorts, Regent, Six Senses, Kimpton Hotels & Restaurants, Hotel Indigo, EVEN HOTELS, HUALUXE, Crowne Plaza, Voco, Holiday Inn, Holiday Inn Express, Holiday Inn Club Vacations, avid, Staybridge Suites, Atwell Suites, and Candlewood Suites brand names. It also provides IHG Rewards Club, a hotel loyalty program. As of February 28, 2020, the company had approximately 5,900 hotels and 884,000 rooms in approximately 100 countries. InterContinental Hotels Group PLC was founded in 1777 and is headquartered in Denham, the United Kingdom.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NYQ", "market": "us_market", "country": "United Kingdom", "city": "Denham"}, "IHG.L": {"short_name": "INTERCONTINENTAL HOTELS GROUP P", "long_name": "InterContinental Hotels Group PLC", "summary": "InterContinental Hotels Group PLC owns, manages, franchises, and leases hotels in the Americas, Europe, Asia, the Middle East, Africa, and Greater China. The company operates hotels, resorts, restaurants, and spas under the InterContinental Hotels & Resorts, Regent, Six Senses, Kimpton Hotels & Restaurants, Hotel Indigo, EVEN HOTELS, HUALUXE, Crowne Plaza, Voco, Holiday Inn, Holiday Inn Express, Holiday Inn Club Vacations, avid, Staybridge Suites, Atwell Suites, and Candlewood Suites brand names. It also provides IHG Rewards Club, a hotel loyalty program. As of February 28, 2020, the company had approximately 5,900 hotels and 884,000 rooms in approximately 100 countries. InterContinental Hotels Group PLC was founded in 1777 and is headquartered in Denham, the United Kingdom.", "currency": "GBp", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Denham"}, "IKAI.JK": {"short_name": "Intikeramik Alamasri Industri T", "long_name": "PT Intikeramik Alamasri Industri Tbk", "summary": "PT Intikeramik Alamasri Industri Tbk, together with its subsidiaries, manufactures, distributes, and sells porcelain tiles in Indonesia and internationally. The company operates in two segments, Ceramic Industry and Hotel Industry. It also engages in the hospitality business. The company was founded in 1991 and is based in Central Jakarta, Indonesia.", "currency": "IDR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Pusat"}, "INDHOTEL.NS": {"short_name": "INDIAN HOTELS", "long_name": "The Indian Hotels Company Limited", "summary": "The Indian Hotels Company Limited, together with its subsidiaries, owns, operates, and manages hotels, palaces, and resorts in India and internationally. The company operates hotels under the Taj, SeleQtions, Vivanta, and Ginger brand names. It also operates salons, wellness spas, and boutiques, as well as provides ayurvedic services. As of March 31, 2020, the company operated approximately 200 hotels with 25,168 rooms in 100 locations. The Indian Hotels Company Limited was founded in 1899 and is based in Mumbai, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "INDO.JK": {"short_name": "Royalindo Investa Wijaya Tbk.", "long_name": "PT Royalindo Investa Wijaya Tbk", "summary": "PT Royalindo Investa Wijaya, through its subsidiaries, operates boarding facilities in Indonesia. The company operates two boarding facilities, including the PJ Mansion boarding house and Puri Cempaka 04 boarding house located in Central Jakarta. PT Royalindo Investa Wijaya was founded in 2005 and is based in Central Jakarta, Indonesia.", "currency": "IDR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Central Jakarta"}, "INPP.JK": {"short_name": "Indonesian Paradise Property Tb", "long_name": "PT Indonesian Paradise Property Tbk", "summary": "PT Indonesian Paradise Property Tbk develops, owns, and operates hotels and resorts in Indonesia. The company also engages in the real estate, general trading, and development businesses, as well as in the ownership of shopping centers, office buildings, and apartments. The company was formerly known as PT Penta Karsa Lubrindo and changed its name to PT Indonesian Paradise Property Tbk in 2004. PT Indonesian Paradise Property Tbk was founded in 1996 and is headquartered in Jakarta, Indonesia.", "currency": "IDR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "INTG": {"short_name": "The Intergroup Corporation", "long_name": "The InterGroup Corporation", "summary": "The InterGroup Corporation, through its subsidiaries, operates a hotel under the Hilton San Francisco Financial District name located in San Francisco, California. It operates through three segments: Hotel Operations, Real Estate Operations, and Investment Transactions. The company's hotel consists of 544 guest rooms and luxury suites with approximately 22,000 square feet of meeting room space, grand ballroom, 5 level underground parking garage, pedestrian bridge, and Chinese culture center. As of June 30, 2020, it owned, managed, and invested in real estate consisted of 20 properties, which included 16 apartment complexes, 3 single-family houses as strategic investments, and 1 commercial real estate property located in the United States. In addition, the company invests in multi-family and commercial real estate properties; and owns approximately 2 acres of unimproved land in Maui, Hawaii. Further, it invests in instruments, corporate debt and equity securities, publicly traded investment funds, mortgage backed securities, securities issued by REIT's, and other companies that invest primarily in real estate. The InterGroup Corporation was founded in 1965 and is based in Los Angeles, California.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NCM", "market": "us_market", "country": "United States", "city": "Los Angeles"}, "ISRO.TA": {"short_name": "ISROTEL LTD", "long_name": "Isrotel Ltd.", "summary": "Isrotel Ltd. operates a chain of hotels in Israel. It operates 16 hotels that consist of approximately 3,300 suites and rooms with various facilities comprising restaurants, halls, swimming pools, entertainment shows, recreation, and various vacation facilities. The company was founded in 1984 and is based in Tel Aviv, Israel.", "currency": "ILA", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Tel Aviv"}, "ITDC.NS": {"short_name": "INDIA TOURISM DEV", "long_name": "India Tourism Development Corporation Limited", "summary": "India Tourism Development Corporation Limited, together with its subsidiaries, acquires, constructs, and operates hotels, beach resorts, and lodges/restaurants for tourists in India. The company also provides transport, entertainment, and shopping facilities; produces, distributes, and sells tourist publicity literature; and offers tourism and hospitality related training and education services, full-fledged money changer services, engineering related consultancy services, etc. In addition, it provides engineering technical services; management consultancy and advisory services; and consultancy services for adventure tourism sector, as well as prepares techno-economic feasibility reports. Further, the company manages events, conferences, and exhibitions; offers advertising and catering services; operates sound and light shows. As of March 31, 2020, it operated 4 Ashok Group of Hotels, 4 joint venture hotels, a restaurant, 14 duty free shops, 1 sound and light shows, 1 managed unit, and 4 catering establishments. India Tourism Development Corporation Limited was incorporated in 1965 and is based in New Delhi, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NSI", "market": "in_market", "country": "India", "city": "New Delhi"}, "JIHD.JK": {"short_name": "Jakarta International Hotels & ", "long_name": "PT Jakarta International Hotels & Development Tbk", "summary": "PT Jakarta International Hotels & Development Tbk, through its subsidiaries, engages in the hotel and property businesses in Indonesia. It operates through four segments: Hotel, Real Estate, Telecommunication Services, and Hotel Management Services. The Hotel segment owns and operates two hotels under the Hotel Borobudur Jakarta and Ritz-Carlton Pacific Place names. The Real Estate segment engages in the real estate development business and services, including the construction of office buildings, shopping malls, and trade centers, as well as their supporting facilities; leasing of office buildings and rooms, and shopping mall complex units, as well as their supporting facilities; provision of infrastructures and facilities for integrated commercial centers construction, commercialization, and development; and provision of general services with the exception of legal and financial services. The Telecommunication Services segment offers telecommunication service management, closed fixed network, Internet service provider and its feature, and data center and managed services. The Hotel Management Services segment manages and operates Hotel Borobudur Jakarta, Discovery Kartika Plaza Hotel, Discovery Hotel & Convention Ancol, and Palace Hotel Cipanas. The company also engages in the tourism and related activities; and apartment development and trading businesses. PT Jakarta International Hotels & Development Tbk was founded in 1969 and is headquartered in Jakarta, Indonesia.", "currency": "IDR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "KAMATHOTEL.NS": {"short_name": "KAMAT HOTELS (IND)", "long_name": "Kamat Hotels (India) Limited", "summary": "Kamat Hotels (India) Limited, through its subsidiaries, engages in the hospitality business in India. It operates hotels and resorts under the brands, such as The Orchid, Fort Jadhavgadh, and Lotus Konark Resorts, as well as Mahodadhi Palace. The company also operates restaurants; and provides hotel consultancy, setups, and other related services. Kamat Hotels (India) Limited was founded in 1986 and is based in Mumbai, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "KCKSF": {"short_name": "KECK SENG INVESTMENTS(HONK KONG", "long_name": "Keck Seng Investments (Hong Kong) Limited", "summary": "Keck Seng Investments (Hong Kong) Limited, an investment holding company, engages in the hotel and club operations, and property investment and development activities. It operates through three segments: Hotel, Property, and Investment and Corporate. The Hotel segment offers hotel room accommodation services; and food and beverages at hotel restaurant outlets, as well as operates slot machines. The Property segment leases investment properties, which primarily consist of retail, commercial, and office properties; and develops, sells, and markets trading properties, as well as offers management services. The Investment and Corporate segment is involved in the non-trading and trading securities; financial instruments; and other treasury operations. It has operations primarily in Macau, Vietnam, the People's Republic of China, Japan, Canada, the United States, and Hong Kong. The company was incorporated in 1973 and is based in Central, Hong Kong.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "KEC.F": {"short_name": "KECK SENG INV.", "long_name": "Keck Seng Investments (Hong Kong) Limited", "summary": "Keck Seng Investments (Hong Kong) Limited, an investment holding company, engages in the hotel and club operations, and property investment and development activities. It operates through three segments: Hotel, Property, and Investment and Corporate. The Hotel segment offers hotel room accommodation services; and food and beverages at hotel restaurant outlets, as well as operates slot machines. The Property segment leases investment properties, which primarily consist of retail, commercial, and office properties; and develops, sells, and markets trading properties, as well as offers management services. The Investment and Corporate segment is involved in the non-trading and trading securities; financial instruments; and other treasury operations. It has operations primarily in Macau, Vietnam, the People's Republic of China, Japan, Canada, the United States, and Hong Kong. The company was incorporated in 1973 and is based in Central, Hong Kong.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Central"}, "LBA.HM": {"short_name": "DESIGN HOTELS AG", "long_name": "Design Hotels AG", "summary": "Design Hotels AG operates as a full-service hospitality consultant to its member hotels. It offers customized B2B services, including global launch campaigns, sales representation, revenue management, strategic marketing, public relations, and branding. The company represents and markets a selection of approximately 300 hotels in approximately 60 countries worldwide. Design Hotels AG was founded in 1993 and is headquartered in Berlin, Germany. Design Hotels AG operates as a subsidiary of Marriott International, Inc.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "HAM", "market": "dr_market", "country": "Germany", "city": "Berlin"}, "LEMONTREE.NS": {"short_name": "LEMON TREE HOTELS", "long_name": "Lemon Tree Hotels Limited", "summary": "Lemon Tree Hotels Limited owns and operates a chain of business and leisure hotels. As of January 14, 2021, it operated 83 hotels with approximately 8,200 rooms across 50 destinations in India and internationally under various brands, including Aurika Hotels & Resorts, Lemon Tree Premier, Lemon Tree Hotels, Red Fox Hotels, Keys Prima, Keys Select and Keys Lite. The company also provides project design and management, as well as housing rental services. Lemon Tree Hotels Limited was founded in 1992 and is based in New Delhi, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NSI", "market": "in_market", "country": "India", "city": "New Delhi"}, "LHR.V": {"short_name": "LAKEVIEW HOTEL INVEST CORP", "long_name": "Lakeview Hotel Investment Corp.", "summary": "Lakeview Hotel Investment Corp is listed on the TSX Venture Exchange under the symbol \"LHR\". Lakeview Hotel Investment Corp received income from ownership, management and licensing of hotel properties.", "currency": "CAD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Winnipeg"}, "LRH-R.BK": {"short_name": "LAGUNA RESORTS & HOTELS PUBLIC ", "long_name": "Laguna Resorts & Hotels Public Company Limited", "summary": "Laguna Resorts & Hotels Public Company Limited, together with its subsidiaries, engages in the hotel and property development businesses. The company operates through Hotel Business, Property Development, and Office Rental segments. It operates five hotels in Laguna Phuket, including Angsana Laguna Phuket, Banyan Tree Phuket, Angsana Villas Resort Phuket, Cassia Phuket, and Laguna Holiday Club Phuket Resort; the Banyan Tree Bangkok hotel located in Bangkok; and golf clubs comprising Laguna Golf Phuket and Laguna Golf Bintan, as well as sells merchandise. The company also develops and sells properties; sells holiday club memberships; and leases land, buildings, offices, and shops. In addition, it is involved in the travel operations. The company was founded in 1983 and is headquartered in Bangkok, Thailand. Laguna Resorts & Hotels Public Company Limited is a subsidiary of Banyan Tree Holdings Limited.", "currency": "THB", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Bangkok"}, "LRH.BK": {"short_name": "LAGUNA RESORTS & HOTELS PUBLIC ", "long_name": "Laguna Resorts & Hotels Public Company Limited", "summary": "Laguna Resorts & Hotels Public Company Limited, together with its subsidiaries, engages in the hotel and property development businesses. The company operates through Hotel Business, Property Development, and Office Rental segments. It operates five hotels in Laguna Phuket, including Angsana Laguna Phuket, Banyan Tree Phuket, Angsana Villas Resort Phuket, Cassia Phuket, and Laguna Holiday Club Phuket Resort; the Banyan Tree Bangkok hotel located in Bangkok; and golf clubs comprising Laguna Golf Phuket and Laguna Golf Bintan, as well as sells merchandise. The company also develops and sells properties; sells holiday club memberships; and leases land, buildings, offices, and shops. In addition, it is involved in the travel operations. The company was founded in 1983 and is headquartered in Bangkok, Thailand. Laguna Resorts & Hotels Public Company Limited is a subsidiary of Banyan Tree Holdings Limited.", "currency": "THB", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Bangkok"}, "LZNR.TA": {"short_name": "A.LUZON REAL ESTA", "long_name": "A. Luzon Real Estate & Finance Ltd", "summary": "A. Luzon Real Estate & Finance Ltd engages in the real estate, trade, and leisure businesses in Israel. It owns and manages rental residential and commercial units in the United States. It provides asset services, including administration, leasing, maintenance, and construction. The company also operates 7 hotels under the brand Holiday Inn & Crown Plaza. The company was formerly known as Netz Hotels Ltd. A. Luzon Real Estate & Finance Ltd was founded in 1992 and is based in Tel Aviv, Israel. As of December 6, 2017, A. Luzon Real Estate & Finance Ltd  operates as a subsidiary of Amos Luzon Development and Energy Group Ltd.", "currency": "ILA", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Tel Aviv"}, "M04.SI": {"short_name": "Man Oriental USD", "long_name": "Mandarin Oriental International Limited", "summary": "Mandarin Oriental International Limited, together with its subsidiaries, owns and operates hotels, resorts, and residences in Asia, Europe, the Middle East, Africa, and the Americas. The company operates 33 hotels and seven residences in 23 countries and territories. It is also involved in the hotel and residences branding, and management; and property development activities. The company was founded in 1963 and is based in Quarry Bay, Hong Kong. Mandarin Oriental International Limited is a subsidiary of Jardine Strategic Holdings Limited.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SES", "market": "sg_market", "country": "Hong Kong", "city": "Quarry Bay"}, "M1TT34.SA": {"short_name": "MARRIOTT INTDRN", "long_name": "Marriott International, Inc.", "summary": "Marriott International, Inc. operates, franchises, and licenses hotel, residential, and timeshare properties worldwide. The company operates through North American Full-Service, North American Limited-Service, and Asia Pacific segments. It operates its properties under the JW Marriott, The Ritz-Carlton, Ritz-Carlton Reserve, W Hotels, The Luxury Collection, St. Regis, EDITION, Bulgari, Marriott Hotels, Sheraton, Delta Hotels, Marriott Executive Apartments, Marriott Vacation Club, Westin, Renaissance, Le MÃ©ridien, Autograph Collection, Gaylord Hotels, Tribute Portfolio, Design Hotels, Courtyard, Residence Inn, Fairfield by Marriott, SpringHill Suites, Four Points, TownePlace Suites, Aloft, AC Hotels by Marriott, Protea Hotels, Element, and Moxy brand names. As of December 21, 2020, it operated approximately 7,500 properties under 30 hotel brands in 132 countries and territories. Marriott International, Inc. was founded in 1927 and is headquartered in Bethesda, Maryland.", "currency": "BRL", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SAO", "market": "br_market", "country": "United States", "city": "Bethesda"}, "MAALT.IS": {"short_name": "MARMARIS ALTINYUNUS", "long_name": "Marmaris Altinyunus Turistik Tesisler Anonim Sirketi", "summary": "Marmaris Altinyunus Turistik Tesisler Anonim Sirketi operates two tourist hotels in Antalya and Marmaris, Turkey. It also provides tourism services. The company was founded in 1986 and is based in Antalya, Turkey. Marmaris Altinyunus Turistik Tesisler Anonim Sirketi is a subsidiary of Koc Holding A.S.", "currency": "TRY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "IST", "market": "tr_market", "country": "Turkey", "city": "Antalya"}, "MAMI.JK": {"short_name": "Mas Murni Indonesia Tbk", "long_name": "PT Mas Murni Indonesia, Tbk", "summary": "PT Mas Murni Indonesia, Tbk owns, operates, and manages the Garden Palace Hotel located in Surabaya, Indonesia. It operates through Hospitality Services; Office Space Rental Services; and Catering, Laundry and Recreation Services segments. The company also owns the Crystal Garden, an apartment block and shopping center. It also engages in the restaurant, club, fitness center, advertising, entertainment, fisheries, aquaculture, livestock, and general trading activities, as well as provision of laundry service business; construction and development of residential and real estate properties; and trading of food and beverages. The company was formerly known as PT Rantai Mas Murni and changed its name to PT Mas Murni Indonesia, Tbk in October 1971. PT Mas Murni Indonesia, Tbk was founded in 1970 and is headquartered in Surabaya, Indonesia.", "currency": "IDR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Surabaya"}, "MANRIN-R.BK": {"short_name": "THE MANDARIN HOTEL PUBLIC COMPA", "long_name": "Mandarin Hotel Public Company Limited", "summary": "Mandarin Hotel Public Company Limited engages in hotel and resort business in Thailand. It operates hotels in Bangkok and Pakchong. Mandarin Hotel Public Company Limited was founded in 1965 and is headquartered in Bangkok, Thailand.", "currency": "THB", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Bangkok"}, "MANRIN.BK": {"short_name": "THE MANDARIN HOTEL PUBLIC COMPA", "long_name": "Mandarin Hotel Public Company Limited", "summary": "Mandarin Hotel Public Company Limited engages in hotel and resort business in Thailand. It operates hotels in Bangkok and Pakchong. Mandarin Hotel Public Company Limited was founded in 1965 and is headquartered in Bangkok, Thailand.", "currency": "THB", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Bangkok"}, "MAORF": {"short_name": "MANDARIN ORIENTAL INTERNATIONAL", "long_name": "Mandarin Oriental International Limited", "summary": "Mandarin Oriental International Limited, together with its subsidiaries, owns and operates hotels, resorts, and residences in Asia, Europe, the Middle East, Africa, and the Americas. The company operates 33 hotels and seven residences in 23 countries and territories. It is also involved in the hotel and residences branding, and management; and property development activities. The company was founded in 1963 and is based in Quarry Bay, Hong Kong. Mandarin Oriental International Limited is a subsidiary of Jardine Strategic Holdings Limited.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Quarry Bay"}, "MAQ.F": {"short_name": "MARRIOTT INTL A  DL-,01", "long_name": "Marriott International, Inc.", "summary": "Marriott International, Inc. operates, franchises, and licenses hotel, residential, and timeshare properties worldwide. The company operates through North American Full-Service, North American Limited-Service, and Asia Pacific segments. It operates its properties under the JW Marriott, The Ritz-Carlton, Ritz-Carlton Reserve, W Hotels, The Luxury Collection, St. Regis, EDITION, Bulgari, Marriott Hotels, Sheraton, Delta Hotels, Marriott Executive Apartments, Marriott Vacation Club, Westin, Renaissance, Le MÃ©ridien, Autograph Collection, Gaylord Hotels, Tribute Portfolio, Design Hotels, Courtyard, Residence Inn, Fairfield by Marriott, SpringHill Suites, Four Points, TownePlace Suites, Aloft, AC Hotels by Marriott, Protea Hotels, Element, and Moxy brand names. As of December 21, 2020, it operated approximately 7,500 properties under 30 hotel brands in 132 countries and territories. Marriott International, Inc. was founded in 1927 and is headquartered in Bethesda, Maryland.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Bethesda"}, "MAR": {"short_name": "Marriott International", "long_name": "Marriott International, Inc.", "summary": "Marriott International, Inc. operates, franchises, and licenses hotel, residential, and timeshare properties worldwide. The company operates through North American Full-Service, North American Limited-Service, and Asia Pacific segments. It operates its properties under the JW Marriott, The Ritz-Carlton, Ritz-Carlton Reserve, W Hotels, The Luxury Collection, St. Regis, EDITION, Bulgari, Marriott Hotels, Sheraton, Delta Hotels, Marriott Executive Apartments, Marriott Vacation Club, Westin, Renaissance, Le MÃ©ridien, Autograph Collection, Gaylord Hotels, Tribute Portfolio, Design Hotels, Courtyard, Residence Inn, Fairfield by Marriott, SpringHill Suites, Four Points, TownePlace Suites, Aloft, AC Hotels by Marriott, Protea Hotels, Element, and Moxy brand names. As of December 21, 2020, it operated approximately 7,500 properties under 30 hotel brands in 132 countries and territories. Marriott International, Inc. was founded in 1927 and is headquartered in Bethesda, Maryland.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Bethesda"}, "MARTI.IS": {"short_name": "MARTI OTEL", "long_name": "Marti Otel Isletmeleri A.S.", "summary": "Marti Otel Isletmeleri A.S. operates and leases hotels, motels, holiday resorts, marinas, restaurants, and other touristic facilities in Turkey. The company was founded in 1967 and is based in Istanbul, Turkey.", "currency": "TRY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "IST", "market": "tr_market", "country": "Turkey", "city": "Istanbul"}, "MCK.NZ": {"short_name": "Millennium & Copthorne Hotels N", "long_name": "Millennium & Copthorne Hotels New Zealand Limited", "summary": "Millennium & Copthorne Hotels New Zealand Limited owns, operates, manages, leases, and franchises hotels. The company operates three segments: Hotel Operations, Residential Land Development, and Residential and Commercial Property Development. It is involved in the residential development and sale of land; and development and sale of residential units and commercial properties. The company also owns and develops residential apartments. It has operations in New Zealand and Australia. The company was incorporated in 1985 and is headquartered in Auckland, New Zealand. Millennium & Copthorne Hotels New Zealand Limited is a subsidiary of CDL Hotels Holdings New Zealand Limited.", "currency": "NZD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NZE", "market": "nz_market", "country": "New Zealand", "city": "Auckland"}, "MCKPA.NZ": {"short_name": "Millennium & Copthorne Hotels N", "long_name": "Millennium & Copthorne Hotels New Zealand Limited", "summary": "Millennium & Copthorne Hotels New Zealand Limited owns, operates, manages, leases, and franchises hotels. The company operates three segments: Hotel Operations, Residential Land Development, and Residential and Commercial Property Development. It is involved in the residential development and sale of land; and development and sale of residential units and commercial properties. The company also owns and develops residential apartments. It has operations in New Zealand and Australia. The company was incorporated in 1985 and is headquartered in Auckland, New Zealand. Millennium & Copthorne Hotels New Zealand Limited is a subsidiary of CDL Hotels Holdings New Zealand Limited.", "currency": "NZD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NZE", "market": "nz_market", "country": "New Zealand", "city": "Auckland"}, "MEL.F": {"short_name": "MELIA HOTELS INTL EO -,20", "long_name": "Meliá Hotels International, S.A.", "summary": "MeliÃ¡ Hotels International, S.A. owns, manages, operates, leases, and franchises hotels worldwide. The company operates approximately 388 business units in 40 countries, as well as one hundred thousand rooms under the Gran MeliÃ¡, Paradisus Resorts, ME by MeliÃ¡, MeliÃ¡ Hotels & Resorts, INNSIDE by MeliÃ¡, Sol by MeliÃ¡, TRYP by Wyndham, and circle by Melia brand names. It also operates Club MeliÃ¡ vacation club; develops and operates real estate properties; and casinos and tour-agency. The company was formerly known as Sol MeliÃ¡, S.A. and changed its name to MeliÃ¡ Hotels International, S.A. in June 2011. MeliÃ¡ Hotels International, S.A. was founded in 1956 and is based in Palma de Mallorca, Spain.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "Spain", "city": "Palma de Mallorca"}, "MEL.MC": {"short_name": "MELIA HOTELS INTERNATIONAL, S.A", "long_name": "Meliá Hotels International, S.A.", "summary": "MeliÃ¡ Hotels International, S.A. owns, manages, operates, leases, and franchises hotels worldwide. The company operates approximately 388 business units in 40 countries, as well as one hundred thousand rooms under the Gran MeliÃ¡, Paradisus Resorts, ME by MeliÃ¡, MeliÃ¡ Hotels & Resorts, INNSIDE by MeliÃ¡, Sol by MeliÃ¡, TRYP by Wyndham, and circle by Melia brand names. It also operates Club MeliÃ¡ vacation club; develops and operates real estate properties; and casinos and tour-agency. The company was formerly known as Sol MeliÃ¡, S.A. and changed its name to MeliÃ¡ Hotels International, S.A. in June 2011. MeliÃ¡ Hotels International, S.A. was founded in 1956 and is based in Palma de Mallorca, Spain.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "MCE", "market": "es_market", "country": "Spain", "city": "Palma de Mallorca"}, "METUR.IS": {"short_name": "METEMTUR OTELCILIK", "long_name": "Metemtur Otelcilik ve Turizm Isletmeleri A.S.", "summary": "Metemtur Otelcilik ve Turizm Isletmeleri A.S. operates a holiday village in Bodrum GÃ¼mbet, Turkey. It is also involved in the construction and sale of Fugayaz GÃ¼ndogan houses; and generation and sale of electricity through solar power plants. The company was founded in 1985 and is based in Istanbul, Turkey.", "currency": "TRY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "IST", "market": "tr_market", "country": "Turkey", "city": "Istanbul"}, "MINA.JK": {"short_name": "Sanurhasta Mitra Tbk.", "long_name": "PT Sanurhasta Mitra Tbk", "summary": "PT Sanurhasta Mitra Tbk engages in property development and hospitality business in Indonesia. It primarily develops housing projects; and manages cottages. The company was founded in 1993 and is headquartered in Jakarta Selatan, Indonesia.", "currency": "IDR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Selatan"}, "MINT-R.BK": {"short_name": "MINOR INTERNATIONAL PUBLIC COMP", "long_name": "Minor International Public Company Limited", "summary": "Minor International Public Company Limited, together with its subsidiaries, operates as a hospitality and leisure company in Thailand, China, Australia, and internationally. It operates through four segments: Hotel & Spa, Mixed use, Restaurant, and Retail. As of March 5, 2020, the company had approximately 2,300 restaurant outlets in approximately 26 countries under The Pizza Company, Swensen's, Sizzler, Dairy Queen, Burger King, Bonchon, Thai Express, The Coffee Club, Riverside, and Benihana brands. It also invested in, owned, and operated a portfolio of 530 hotels and serviced suites under the Anantara, AVANI, Oaks, Tivoli, NH Collection, NH Hotels, nhow, Elewana Collection, JW Marriott, Four Seasons, St. Regis, Radisson Blu, and Minor International brands in 57 countries across the Asia Pacific, the Middle East, Africa, the Indian Ocean, Europe, and the Americas. In addition, the company distributes fashion and lifestyle products under the Anello, Bodum, Bossini, Brooks Brothers, Charles & Keith, Esprit, Etam, Joseph Joseph, OVS, Radley, Scomadi, Zwilling J.A. Henckels, and Minor Smart Kids brands through approximately 485 points of sale; and provides online shopping, as well as offers contract manufacturing services. Further, it is involved in the entertainment venues and property rental and sale, food and beverage sale, supply chain management, spa, vacation club point sale, distribution, management, catering service, franchise, consulting, sales and marketing, real estate, travel agency, asset management, accommodation, and property development; and manufacture and sale of cheese and ice-cream. The company was formerly known as Royal Garden Resorts Plc. and changed its name to Minor International Public Company Limited in 2005. Minor International Public Company Limited was founded in 1978 and is headquartered in Bangkok, Thailand.", "currency": "THB", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Bangkok"}, "MINT.BK": {"short_name": "MINOR INTERNATIONAL PUBLIC COMP", "long_name": "Minor International Public Company Limited", "summary": "Minor International Public Company Limited, together with its subsidiaries, operates as a hospitality and leisure company in Thailand, China, Australia, and internationally. It operates through four segments: Hotel & Spa, Mixed use, Restaurant, and Retail. As of March 5, 2020, the company had approximately 2,300 restaurant outlets in approximately 26 countries under The Pizza Company, Swensen's, Sizzler, Dairy Queen, Burger King, Bonchon, Thai Express, The Coffee Club, Riverside, and Benihana brands. It also invested in, owned, and operated a portfolio of 530 hotels and serviced suites under the Anantara, AVANI, Oaks, Tivoli, NH Collection, NH Hotels, nhow, Elewana Collection, JW Marriott, Four Seasons, St. Regis, Radisson Blu, and Minor International brands in 57 countries across the Asia Pacific, the Middle East, Africa, the Indian Ocean, Europe, and the Americas. In addition, the company distributes fashion and lifestyle products under the Anello, Bodum, Bossini, Brooks Brothers, Charles & Keith, Esprit, Etam, Joseph Joseph, OVS, Radley, Scomadi, Zwilling J.A. Henckels, and Minor Smart Kids brands through approximately 485 points of sale; and provides online shopping, as well as offers contract manufacturing services. Further, it is involved in the entertainment venues and property rental and sale, food and beverage sale, supply chain management, spa, vacation club point sale, distribution, management, catering service, franchise, consulting, sales and marketing, real estate, travel agency, asset management, accommodation, and property development; and manufacture and sale of cheese and ice-cream. The company was formerly known as Royal Garden Resorts Plc. and changed its name to Minor International Public Company Limited in 2005. Minor International Public Company Limited was founded in 1978 and is headquartered in Bangkok, Thailand.", "currency": "THB", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Bangkok"}, "MLHIN.PA": {"short_name": "HOTL.IMMOB.NICE", "long_name": "Société Hôtelière et Immobilière de Nice S.A.", "summary": "SociÃ©tÃ© HÃ´teliÃ¨re et ImmobiliÃ¨re de Nice S.A. provides all the facilities of a hotel. The company was founded in 1920 and is based in Nice, France.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PAR", "market": "fr_market", "country": "France", "city": "Nice"}, "MLHMC.PA": {"short_name": "HOT.MAJESTIC CANNE", "long_name": "Hotel Majestic Cannes", "summary": "HÃ´tel Majestic Cannes engages in operating the HÃ´tel Majestic BarriÃ¨re Cannes. It owns 349 rooms and suites, as well as operates 3 restaurants and 2 bars. It is also involved in shop leasing activities. The company is based in Cannes, France.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PAR", "market": "fr_market", "country": "France", "city": "Cannes"}, "MNILY": {"short_name": "MINOR INTERNATIONAL PUBLIC COMP", "long_name": "Minor International Public Company Limited", "summary": "Minor International Public Company Limited, together with its subsidiaries, operates as a hospitality and leisure company in Thailand, China, Australia, and internationally. It operates through four segments: Hotel & Spa, Mixed use, Restaurant, and Retail. As of March 5, 2020, the company had approximately 2,300 restaurant outlets in approximately 26 countries under The Pizza Company, Swensen's, Sizzler, Dairy Queen, Burger King, Bonchon, Thai Express, The Coffee Club, Riverside, and Benihana brands. It also invested in, owned, and operated a portfolio of 530 hotels and serviced suites under the Anantara, AVANI, Oaks, Tivoli, NH Collection, NH Hotels, nhow, Elewana Collection, JW Marriott, Four Seasons, St. Regis, Radisson Blu, and Minor International brands in 57 countries across the Asia Pacific, the Middle East, Africa, the Indian Ocean, Europe, and the Americas. In addition, the company distributes fashion and lifestyle products under the Anello, Bodum, Bossini, Brooks Brothers, Charles & Keith, Esprit, Etam, Joseph Joseph, OVS, Radley, Scomadi, Zwilling J.A. Henckels, and Minor Smart Kids brands through approximately 485 points of sale; and provides online shopping, as well as offers contract manufacturing services. Further, it is involved in the entertainment venues and property rental and sale, food and beverage sale, supply chain management, spa, vacation club point sale, distribution, management, catering service, franchise, consulting, sales and marketing, real estate, travel agency, asset management, accommodation, and property development; and manufacture and sale of cheese and ice-cream. The company was formerly known as Royal Garden Resorts Plc. and changed its name to Minor International Public Company Limited in 2005. Minor International Public Company Limited was founded in 1978 and is headquartered in Bangkok, Thailand.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "Thailand", "city": "Bangkok"}, "MNOIY": {"short_name": "MANDARIN ORIENTAL INTERNATIONAL", "long_name": "Mandarin Oriental International Limited", "summary": "Mandarin Oriental International Limited, together with its subsidiaries, owns and operates hotels, resorts, and residences in Asia, Europe, the Middle East, Africa, and the Americas. The company operates 33 hotels and seven residences in 23 countries and territories. It is also involved in the hotel and residences branding, and management; and property development activities. The company was founded in 1963 and is based in Quarry Bay, Hong Kong. Mandarin Oriental International Limited is a subsidiary of Jardine Strategic Holdings Limited.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Quarry Bay"}, "NATO.JK": {"short_name": "Surya Permata Andalan Tbk.", "long_name": "PT Surya Permata Andalan Tbk", "summary": "PT Surya Permata Andalan Tbk develops and operates boutique hotels, villas, and resorts in Indonesia. The company was formerly known as PT Nusantara Properti Internasional Tbk. PT Surya Permata Andalan Tbk is based in Bali, Indonesia.", "currency": "IDR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Bali"}, "NHH.MC": {"short_name": "NH HOTEL GROUP, S.A.", "long_name": "NH Hotel Group, S.A.", "summary": "NH Hotel Group, S.A. operates hotels in Spain, Benelux, Italy, Germany, Latin America, and internationally. It operates in two segments, Real Estate and Hotel. As of December 31, 2019, the company operated 368 hotels and 57,466 rooms. It is also involved in the real estate, investment, procurement network, and financing businesses; and provision of catering, management, corporate, call center, and other services. The company was formerly known as NH Hoteles, S.A. and changed its name to NH Hotel Group, S.A. in June 2014. NH Hotel Group, S.A. was founded in 1978 and is headquartered in Madrid, Spain. NH Hotel Group, S.A. is a subsidiary of MHG Continental Holding (Singapore) Pte. Ltd.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "MCE", "market": "es_market", "country": "Spain", "city": "Madrid"}, "ODHN.SW": {"short_name": "ORASCOM DEVELOPMENT HLD AG N", "long_name": "Orascom Development Holding AG", "summary": "Orascom Development Holding AG, together with its subsidiaries, develops integrated towns in Egypt, the United Arab Emirates, Oman, Switzerland, Morocco, Montenegro, and the United Kingdom. It operates through four segments: Hotels, Real Estate and Construction, Land Sales, and Destination Management. The Hotels segment provides hospitality services in two- to five-star hotels. The Real Estate and Construction segment acquires land in undeveloped areas, as well as builds residential real estate and other facilities in stages. The Land Sales segment sells land and land rights to third parties. The Destination Management segment provides facility and infrastructure services at operational resorts and towns. Orascom Development Holding AG also rents investment properties; and offers mortgage, sport, hospital, educational, marina, limousine rental, laundry, and other services. The company was formerly known as Orascom Hotels & Development AG and changed its name to Orascom Development Holding AG in February 2008. Orascom Development Holding AG was founded in 1989 and is based in Altdorf, Switzerland.", "currency": "CHF", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "EBS", "market": "ch_market", "country": "Switzerland", "city": "Altdorf"}, "OHTL-R.BK": {"short_name": "OHTL PUBLIC COMPANY LIMITED", "long_name": "OHTL Public Company Limited", "summary": "OHTL Public Company Limited, together with its subsidiaries, operates hotels and restaurants in Thailand. It operates through Hotel Operation, and Food and Beverage segments. The company is based in Bangkok, Thailand.", "currency": "THB", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Bangkok"}, "OHTL.BK": {"short_name": "OHTL PUBLIC COMPANY LIMITED", "long_name": "OHTL Public Company Limited", "summary": "OHTL Public Company Limited, together with its subsidiaries, operates hotels and restaurants in Thailand. It operates through Hotel Operation, and Food and Beverage segments. The company is based in Bangkok, Thailand.", "currency": "THB", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Bangkok"}, "PGLI.JK": {"short_name": "Pembangunan Graha Lestari Indah", "long_name": "PT Pembangunan Graha Lestari Indah Tbk", "summary": "PT Pembangunan Graha Lestari Indah Tbk engages in the hotel and restaurant businesses in Indonesia. The company owns and operates a hotel under the Travellers Suites name; restaurants under the Le Chic name; and a banquet and restaurant under the Tia CafÃ© name. It also generates hydroelectricity power. PT Pembangunan Graha Lestari Indah Tbk was founded in 1994 and is based in Medan, Indonesia.", "currency": "IDR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Medan"}, "PNDX-B.ST": {"short_name": "Pandox AB ser. B", "long_name": "Pandox AB (publ)", "summary": "Pandox AB (publ) develops, owns, manages, operates, and leases hotel properties. The company operates through Property Management and Operator Activities segments. As of April 03, 2020, it had 156 hotels with approximately 35,000 hotel rooms in 15 countries. The company was founded in 1995 and is based in Stockholm, Sweden.", "currency": "SEK", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "STO", "market": "se_market", "country": "Sweden", "city": "Stockholm"}, "POSADASA.MX": {"short_name": "GRUPO POSADAS SAB DE CV", "long_name": "Grupo Posadas, S.A.B. de C.V.", "summary": "Grupo Posadas, S.A.B. de C.V. owns, operates, and manages hotels primarily in Mexico. The company operates hotels primarily under the Live Aqua, Grand Fiesta Americana, Fiesta Americana, The Explorean, Fiesta Inn, One Hotels, and Gamma brand names. It also operates Fiesta Americana Vacation Club that sells vacation club memberships, as well as purchases and sells real estate properties in the tourism industry. As of December 30, 2019, the company operated 184 hotels with approximately 29, 851 rooms. Grupo Posadas, S.A.B. de C.V. was founded in 1967 and is based in Mexico City, Mexico.", "currency": "MXN", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "MEX", "market": "mx_market", "country": "Mexico", "city": "Mexico City"}, "POX.F": {"short_name": "PANDOX AB B", "long_name": "Pandox AB (publ)", "summary": "Pandox AB (publ) develops, owns, manages, operates, and leases hotel properties. The company operates through Property Management and Operator Activities segments. As of April 03, 2020, it had 156 hotels with approximately 35,000 hotel rooms in 15 countries. The company was founded in 1995 and is based in Stockholm, Sweden.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "Sweden", "city": "Stockholm"}, "PPH.L": {"short_name": "PPHE HOTEL GROUP LIMITED ORD NP", "long_name": "PPHE Hotel Group Limited", "summary": "PPHE Hotel Group Limited owns, develops, leases, operates, and franchises full-service upscale and lifestyle hotels in Netherlands, Germany and Hungary, Croatia, and the United Kingdom. It owns and operates hotels and resorts under the Park Plaza, the art'otel, and the Arena Campsites brands, as well as the Arena Hotels & Apartments. As of January 30, 2020, the company owned/operated 37 hotels and resorts with approximately 8,800 rooms; and 8 campsites offering approximately 6,000 units in central London. It also operates restaurants and bars; and coffee shop and Spa. The company was formerly known as Park Plaza Hotels Limited and changed its name to PPHE Hotel Group Limited in March 2012. PPHE Hotel Group Limited was founded in 1989 and is based in Amsterdam, the Netherlands.", "currency": "GBp", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "LSE", "market": "gb_market", "country": "Netherlands", "city": "Amsterdam"}, "PRSI": {"short_name": "PORTSMOUTH SQUARE INC", "long_name": "Portsmouth Square, Inc.", "summary": "Portsmouth Square, Inc., through its general and limited partnership interest in Justice Investors Limited Partnership, owns and operates a hotel under the Hilton brand in San Francisco, California. Its hotel property consists of 544 guest rooms and luxury suites, and related facilities, including a five-level underground parking garage. The company was incorporated in 1967 and is based in Los Angeles, California.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Los Angeles"}, "PSKT.JK": {"short_name": "Red Planet Indonesia Tbk.", "long_name": "PT Red Planet Indonesia Tbk", "summary": "PT Red Planet Indonesia Tbk, together with its subsidiaries, engages in the hospitality business in Indonesia. The company also provides function, accommodation, and recreation services. It owns and operates eight hotels located in Jakarta, Bekasi, Makassar, Palembang, Pekanbaru, Solo, Surabaya, and Bukittinggi. The company was formerly known as PT Pusako Tarinka Tbk and changed its name to PT Red Planet Indonesia Tbk in May 2014. PT Red Planet Indonesia Tbk was founded in 1989 and is headquartered in Jakarta, Indonesia. PT Red Planet Indonesia Tbk is a subsidiary of Red Planet Holdings (Indonesia) Limited.", "currency": "IDR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "PV6.F": {"short_name": "PIERRE ET VACANC.INH.EO10", "long_name": "Pierre et Vacances SA", "summary": "Pierre et Vacances SA, through its subsidiaries, engages in the holiday accommodation and holiday property investment business. It operates through two segments, Property Development and Tourism. The Property Development engages in the land prospection, site design, construction, and marketing of holiday residences for individual buyers or institutional buyers primarily in France and internationally. The Tourism segment operates residences and villages marketed under the Pierre & Vacances, Center Parcs, Sunparks, Villages, Nature Paris, Maeva.com, and Adagio brands primarily in France, the Netherlands, Germany, Belgium, and Spain. As of September 30, 2020, it operated approximately 282 sites in Europe; 4 destinations across seaside, mountain, countryside, and city; and 45,801 apartments. The company was founded in 1967 and is headquartered in Paris, France. Pierre et Vacances SA is a subsidiary of SociÃ©tÃ© d'Investissement Touristique et Immobilier.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "France", "city": "Paris"}, "RH6B.F": {"short_name": "REGAL HOTELS INTL  HD-,10", "long_name": "Regal Hotels International Holdings Limited", "summary": "Regal Hotels International Holdings Limited, an investment holding company, owns, operates, and manages hotels in Hong Kong, Mainland China, and internationally. It operates through six segments: Hotel Operation and Management and Hotel Ownership, Asset Management, Property Development and Investment, Financial Assets Investments, Aircraft Ownership and Leasing, and Others. The company is also involved in the provision of hotel management services; and ownership of hotel properties for rental income. In addition, it invests in, develops, sells, and rents properties, as well as offers property agency and management services. Further, the company is involved in the development and distribution of multimedia entertainment and digital educational content, and multi-platform social games; operation and management of restaurants; operation of security storage lounge; provision of housekeeping services; security and guarding services; room reservation services; and sale of food products, as well as securities trading and investment, and aircraft ownership and leasing activities. Additionally, it offers nominee, financing, and contracting agency; and asset management services. The company is headquartered in Causeway Bay, Hong Kong. Regal Hotels International Holdings Limited is a subsidiary of Century City International Holdings Limited.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Causeway Bay"}, "RLH": {"short_name": "Red Lions Hotels Corporation", "long_name": "Red Lion Hotels Corporation", "summary": "Red Lion Hotels Corporation, doing business as RLH Corporation, operates as a hospitality and leisure company in the United States. It operates in two segments, Company Operated Hotels and Franchised Hotels. The company owns, manages, and franchises hotels under the Hotel RL, Red Lion Hotels, Red Lion Inn & Suites, GuestHouse, Settle Inn, Americas Best Value Inn, Canadas Best Value Inn, Signature and Signature Inn, Knights Inn, and Country Hearth Inns & Suites brands. As of December 31, 2019, it had a network of 1,056 franchised hotels, including a total of 66,700 rooms. The company was formerly known as WestCoast Hospitality Corporation and changed its name to Red Lion Hotels Corporation in September 2005. The company was founded in 1937 and is headquartered in Denver, Colorado.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Denver"}, "ROH-R.BK": {"short_name": "ROYAL ORCHID HOTEL (THAILAND)", "long_name": "Royal Orchid Hotel (Thailand) Public Company Limited", "summary": "Royal Orchid Hotel (Thailand) Public Company Limited operates a hotel in Thailand. It serves travel agents, credit card companies, and companies with secure financial position. The company is based in Bangkok, Thailand. Royal Orchid Hotel (Thailand) Public Company Limited is a subsidiary of Grande Asset Hotels & Property Public Company Limited.", "currency": "THB", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Bangkok"}, "ROH.BK": {"short_name": "ROYAL ORCHID HOTEL (THAILAND)", "long_name": "Royal Orchid Hotel (Thailand) Public Company Limited", "summary": "Royal Orchid Hotel (Thailand) Public Company Limited operates a hotel in Thailand. It serves travel agents, credit card companies, and companies with secure financial position. The company is based in Bangkok, Thailand. Royal Orchid Hotel (Thailand) Public Company Limited is a subsidiary of Grande Asset Hotels & Property Public Company Limited.", "currency": "THB", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Bangkok"}, "ROHLTD.NS": {"short_name": "ROYAL ORCHID HOTEL", "long_name": "Royal Orchid Hotels Limited", "summary": "Royal Orchid Hotels Limited operates and manages hotels and resorts in India. The company also provides restaurants and mobile food services. It operates 58 hotels and resorts with approximately 3,920 guest rooms, as well as 110 restaurants and bars in 39 cities. The company was formerly known as Universal Resorts Limited and changed its name to Royal Orchid Hotels Limited in 1997. Royal Orchid Hotels Limited was founded in 1973 and is based in Bengaluru, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Bengaluru"}, "SFEF": {"short_name": "SANTA FE FINANCIAL CORP", "long_name": "Santa Fe Financial Corporation", "summary": "Santa Fe Financial Corporation owns and operates a hotel under the Hilton San Francisco Financial District name located in San Francisco, California. The company operates through three segments: Hotel Operations, Real Estate Operations, and Investment Transactions. Its hotel property consists of 544 guest rooms and luxury suites, and related facilities, including a five level underground parking garage. The company also owns and operates a 27-unit and a 2-unit multi-family apartment complex located in Los Angeles, California, as well as owns approximately 2 acres of unimproved land for development in Maui, Hawaii. Further, it invests in instruments, corporate debt and equity securities, publicly traded investment funds, mortgage backed securities, securities issued by REIT's, and other companies, which invest primarily in real estate. The company was formerly known as Tri Financial Corporation and changed its name to Santa Fe Financial Corporation in September 1970. The company was founded in 1967 and is based in Los Angeles, California. Santa Fe Financial Corporation is a subsidiary of The InterGroup Corporation.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Los Angeles"}, "SHALF": {"short_name": "SHANGRI-LA ASIA", "long_name": "Shangri-La Asia Limited", "summary": "Shangri-La Asia Limited, an investment holding company, owns/leases, operates, and manages hotels and associated properties worldwide. It operates through four segments: Hotel Properties, Hotel Management and Related Services, Investment Properties, and Property Development for Sale. The company develops, owns, and operates office and commercial properties, and serviced apartments/residences; and operates restaurants. It is also involved in the hotel ownership, and property rental and sale business; and property investment, as well as wines trading activities. The company operates hotels under the Shangri-La Hotels and Resorts, Kerry Hotels, JEN by Shangri-La, Traders Hotel, Rasa, Summer Palace, and Shang Palace, as well as CHI, The Spa at Shangri-La brand names. As of December 31, 2019, it had equity interests in 78 operating hotels with 34,996 rooms. Shangri-La Asia Limited was founded in 1971 and is headquartered in Quarry Bay, Hong Kong.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Quarry Bay"}, "SHALY": {"short_name": "SHANGRI-LA ASIA", "long_name": "Shangri-La Asia Limited", "summary": "Shangri-La Asia Limited, an investment holding company, owns/leases, operates, and manages hotels and associated properties worldwide. It operates through four segments: Hotel Properties, Hotel Management and Related Services, Investment Properties, and Property Development for Sale. The company develops, owns, and operates office and commercial properties, and serviced apartments/residences; and operates restaurants. It is also involved in the hotel ownership, and property rental and sale business; and property investment, as well as wines trading activities. The company operates hotels under the Shangri-La Hotels and Resorts, Kerry Hotels, JEN by Shangri-La, Traders Hotel, Rasa, Summer Palace, and Shang Palace, as well as CHI, The Spa at Shangri-La brand names. As of December 31, 2019, it had equity interests in 78 operating hotels with 34,996 rooms. Shangri-La Asia Limited was founded in 1971 and is headquartered in Quarry Bay, Hong Kong.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Quarry Bay"}, "SHID.JK": {"short_name": "Hotel Sahid Jaya International ", "long_name": "PT Hotel Sahid Jaya International Tbk", "summary": "PT Hotel Sahid Jaya International Tbk engages in the hotel and accommodation businesses in Indonesia. It also leases facilities related to the hotel business; and offers management and other services for hotel and tourism sectors. PT Hotel Sahid Jaya International Tbk was founded in 1969 and is headquartered in Jakarta, Indonesia. PT Hotel Sahid Jaya International Tbk is a subsidiary of PT Empu Sahid International.", "currency": "IDR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "SHOT.ST": {"short_name": "Scandic Hotels Group AB", "long_name": "Scandic Hotels Group AB (publ)", "summary": "Scandic Hotels Group AB (publ), together with its subsidiaries, operates and franchises hotels in Sweden, Norway, Finland, Denmark, Germany, Poland, and other European Countries. The company operates hotels under the Scandic, Hilton, Holiday Inn, Crown Plaza, and Indigo brands. As of September 9, 2020, it operated approximately 280 hotels. The company was founded in 1963 and is headquartered in Stockholm, Sweden.", "currency": "SEK", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "STO", "market": "se_market", "country": "Sweden", "city": "Stockholm"}, "SKTP": {"short_name": "SKYTOP LODGE CORP", "long_name": "Skytop Lodge Corporation", "summary": "Skytop Lodge Corporation operates a resort and spa. Its amenities include lodging and accommodations, and a floral shop; wedding venues, executive conferences centers, and conference and meeting rooms; a golf course, dinning, a tennis court, and swimming pools; and hiking, dog sledding, skiing, ice-skating, snowshoeing, and winter beer garden activities. The company also provides wedding planning services; and sells gift certificate, ornaments, books, chocolate mints, and its company logo T-shirts online. Skytop Lodge Corporation was formerly known as Pocono Hotels Corp. and changed its name to Skytop Lodge Corporation in February 2000. The company was founded in 1925 and is based in Skytop, Pennsylvania.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Skytop"}, "SKTPP": {"short_name": "SKYTOP LODGE CORP", "long_name": "Skytop Lodge Corporation", "summary": "Skytop Lodge Corporation operates a resort and spa. Its amenities include lodging and accommodations, and a floral shop; wedding venues, executive conferences centers, and conference and meeting rooms; a golf course, dinning, a tennis court, and swimming pools; and hiking, dog sledding, skiing, ice-skating, snowshoeing, and winter beer garden activities. The company also provides wedding planning services; and sells gift certificate, ornaments, books, chocolate mints, and its company logo T-shirts online. Skytop Lodge Corporation was formerly known as Pocono Hotels Corp. and changed its name to Skytop Lodge Corporation in February 2000. The company was founded in 1925 and is based in Skytop, Pennsylvania.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Skytop"}, "SMIZF": {"short_name": "MELIA HOTELS INTERNATIONAL SA", "long_name": "Meliá Hotels International, S.A.", "summary": "MeliÃ¡ Hotels International, S.A. owns, manages, operates, leases, and franchises hotels worldwide. The company operates approximately 388 business units in 40 countries, as well as one hundred thousand rooms under the Gran MeliÃ¡, Paradisus Resorts, ME by MeliÃ¡, MeliÃ¡ Hotels & Resorts, INNSIDE by MeliÃ¡, Sol by MeliÃ¡, TRYP by Wyndham, and circle by Melia brand names. It also operates Club MeliÃ¡ vacation club; develops and operates real estate properties; and casinos and tour-agency. The company was formerly known as Sol MeliÃ¡, S.A. and changed its name to MeliÃ¡ Hotels International, S.A. in June 2011. MeliÃ¡ Hotels International, S.A. was founded in 1956 and is based in Palma de Mallorca, Spain.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "Spain", "city": "Palma de Mallorca"}, "SOST": {"short_name": "SOUTHERN STS SIGN COMPANY", "long_name": "Southern States Sign Company", "summary": "Southern States Sign Company owns and operates hotels and resorts. Southern States Sign Company was formerly known as Conte Rosso & Partners S.r.l. and changed its name to Southern States Sign Company in November 2012, due to a reverse merger transaction. The company is based in Rome, Italy.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "Italy", "city": "Rome"}, "SOTS.JK": {"short_name": "Satria Mega Kencana Tbk.", "long_name": "PT Satria Mega Kencana Tbk", "summary": "PT Satria Mega Kencana Tbk., through its subsidiary, PT Dwimukti Mitra Wisata, operates hotels under the Sotis name in Indonesia. It also provides spa services. The company was founded in 2004 and is headquartered in South Jakarta, Indonesia.", "currency": "IDR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Selatan"}, "SSTY.L": {"short_name": "SAFESTAY PLC ORD 1P", "long_name": "Safestay plc", "summary": "Safestay plc operates and develops traveler accommodation under the Safestay brand in the United Kingdom. It provides overnight hostel accommodation services and owns properties. The company serves families, backpackers, and business travelers. Safestay plc was incorporated in 2014 and is based in London, the United Kingdom.", "currency": "GBp", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "STAY": {"short_name": "Extended Stay America, Inc. Pai", "long_name": "Extended Stay America, Inc.", "summary": "Extended Stay America, Inc., together with its subsidiaries, owns, operates, develops, and manages hotels in the United States. As of November 20, 2020, the company had a network of 646 hotels. It serves customers in the mid-priced extended stay segment. The company also licenses Extended Stay America brand to third party franchisees. Extended Stay America, Inc. was founded in 1995 and is headquartered in Charlotte, North Carolina.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Charlotte"}, "TAJGVK.NS": {"short_name": "TAJ GVK HOTELS", "long_name": "TAJGVK Hotels & Resorts Limited", "summary": "TAJGVK Hotels & Resorts Limited owns, operates, and manages hotels, palaces, and resorts under the Taj brand in India. It operates Taj Krishna, a 5-star hotel with 260 rooms, Taj Banjara with 122 rooms, Taj Deccan with 151 rooms, and Vivanta by Taj, a five star hotel with 181 rooms in Hyderabad. The company also operates Taj Chandigarh with 149 rooms in Chandigarh; Taj Club House with 220 rooms in Chennai; and Taj Santacruz with 279 rooms in Mumbai. The company was incorporated in 1995 and is based in Hyderabad, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Hyderabad"}, "TEKTU.IS": {"short_name": "TEK-ART TURIZM", "long_name": "Tek-Art Insaat Ticaret Turizm Sanayi ve Yatirimlar Anonim Sirketi", "summary": "Tek-Art Insaat Ticaret Turizm Sanayi ve Yatirimlar Anonim Sirketi engages in the tourism business in Turkey and internationally. It invests, builds, and operates hotels, resorts, golf, restaurants, cafeterias, casinos and entertainment venues, beaches, amusement parks, marinas, yacht berths, tourist goods sales points, and regulation schools and related facilities. The company operates Club Zigana holiday village and Zigana Hotel resort. In addition, it offers tourism transport and car rental services, as well as acts as a travel agent. Further, the company operates stores, showrooms, and warehouses in ports and free zones. Tek-Art Insaat Ticaret Turizm Sanayi ve Yatirimlar Anonim Sirketi was founded in 1987 and is headquartered in Istanbul, Turkey.", "currency": "TRY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "IST", "market": "tr_market", "country": "Turkey", "city": "Istanbul"}, "TGBHOTELS.NS": {"short_name": "TGB BANQUETS AND H", "long_name": "TGB Banquets and Hotels Limited", "summary": "TGB Banquets and Hotels Limited provides restaurant, banquet, and hotel services in India and internationally. It operates hotels under The Grand Bhagwati name in Ahmedabad. The company also offers dining under the CafÃ© Piano and Mr. & Mrs. Somani name; and catering services. In addition, it operates convention centers under The Grand Bhagwati name, as well as clubs and events. The company was formerly known as Bhagwati Banquets and Hotels Limited and changed its name to TGB Banquets and Hotels Limited in April 2013. TGB Banquets and Hotels Limited was founded in 1989 and is based in Ahmedabad, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Ahmedabad"}, "TGO.JO": {"short_name": "Tsogo Sun Hotels LTD", "long_name": "Tsogo Sun Hotels Limited", "summary": "Tsogo Sun Hotels Limited owns, leases, and manages hotels in South Africa. The company operates through four segments: Manco, Rental Income Â\u0096 HPF, Internally Managed, and Offshore. The company operates hotels and resorts under the Southern Sun Hotels and Resorts, SunSquare, Garden Court, StayEasy, SUN1, hi Hotels brand names. It consists of a portfolio of 110 hotels. The company was founded in 1969 and is headquartered in Johannesburg, South Africa.", "currency": "ZAc", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Johannesburg"}, "ULAS.IS": {"short_name": "ULASLAR TURIZM YAT.", "long_name": "Ulaslar Turizm Yatirimlari ve Dayanikli Tüketim Mallari Ticaret Pazarlama A.S.", "summary": "Ulaslar Turizm Yatirimlari ve Dayanikli TÃ¼ketim Mallari Ticaret Pazarlama A.S. operates a hotel in Turkey. Its hotel has 466 beds in 125 rooms and 41 suites. The company was founded in 1977 and is headquartered in Ankara, Turkey.", "currency": "TRY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "IST", "market": "tr_market", "country": "Turkey", "city": "Ankara"}, "UTPYA.IS": {"short_name": "UTOPYA TURIZM", "long_name": "Utopya Turizm Insaat Isletmecilik Ticaret A.S.", "summary": "Utopya Turizm Insaat Isletmecilik Ticaret A.S. engages in the operation of tourism, hotel, and shopping mall businesses in Turkey. It operates Utopia World Hotel, a five-star hotel with 348 villa standard rooms, 194 main buildings with standard rooms, 4 deluxe rooms, 21 junior suites, 16 corner suites, 1 king suites, 1 queen suites, and 10 duplex rooms. The company also provides tourism agency services under the REC TRAVEL brand name, which includes ticket sales, reservations and sales of hotels, conferences and events, and vehicle and long-term fleet rental services. In addition, it engages in contracting activities for infrastructure, canal, sewer, and tunnel construction projects, as well as the production and sale of electricity. Further, the company is involved in the construction of public housing estates, commercial and shopping centers, factories, hotels, and holiday villages. Utopya Turizm Insaat Isletmecilik Ticaret A.S. was founded in 1980 and is headquartered in Ankara, Turkey.", "currency": "TRY", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "IST", "market": "tr_market", "country": "Turkey", "city": "Ankara"}, "VAC.PA": {"short_name": "PIERRE VACANCES", "long_name": "Pierre et Vacances SA", "summary": "Pierre et Vacances SA, through its subsidiaries, engages in the holiday accommodation and holiday property investment business. It operates through two segments, Property Development and Tourism. The Property Development engages in the land prospection, site design, construction, and marketing of holiday residences for individual buyers or institutional buyers primarily in France and internationally. The Tourism segment operates residences and villages marketed under the Pierre & Vacances, Center Parcs, Sunparks, Villages, Nature Paris, Maeva.com, and Adagio brands primarily in France, the Netherlands, Germany, Belgium, and Spain. As of September 30, 2020, it operated approximately 282 sites in Europe; 4 destinations across seaside, mountain, countryside, and city; and 45,801 apartments. The company was founded in 1967 and is headquartered in Paris, France. Pierre et Vacances SA is a subsidiary of SociÃ©tÃ© d'Investissement Touristique et Immobilier.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PAR", "market": "fr_market", "country": "France", "city": "Paris"}, "VICEROY.NS": {"short_name": "VICEROY HOTELS LTD", "long_name": "Viceroy Hotels Limited", "summary": "Viceroy Hotels Limited engages in the hoteliering business in India. The company owns, operates, franchises, and markets a 297 room hotel with restaurants and a convention center under the Marriott name; a 120 room hotel with banquet halls and fine dine restaurant under the Courtyard Marriott name; a 56 room budget hotel under the Minerva name; restaurants under the Minerva Coffee Shop name; and fine dine bars under the Bluefox name in Hyderabad and Vijayawada. It also operates Eat Street, a food court with Minerva Coffee Shop and other kiosks, as well as Waterfront fine dine restaurant. Viceroy Hotels Limited was founded in 1965 and is based in Hyderabad, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Hyderabad"}, "VRANDA-R.BK": {"short_name": "VERANDA RESORT PUBLIC COMPANY L", "long_name": "Veranda Resort Public Company Limited", "summary": "Veranda Resort Public Company Limited operates hotels and resorts in Thailand. The company operates its facilities under the Veranda Resort and Spa Hua Hin Cha Am, Veranda The High Resort Chiang Mai, Sofitel so Bangkok, Veranda Resort Pattaya, and Rocky's Boutique Resort names. It is also involved in the development and rental of properties; sale of food and beverages; and provision of human resource outsourcing services. Veranda Resort Public Company Limited is based in Bangkok, Thailand.", "currency": "THB", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Bangkok"}, "VRANDA.BK": {"short_name": "VERANDA RESORT PUBLIC COMPANY L", "long_name": "Veranda Resort Public Company Limited", "summary": "Veranda Resort Public Company Limited operates hotels and resorts in Thailand. The company operates its facilities under the Veranda Resort and Spa Hua Hin Cha Am, Veranda The High Resort Chiang Mai, Sofitel so Bangkok, Veranda Resort Pattaya, and Rocky's Boutique Resort names. It is also involved in the development and rental of properties; sale of food and beverages; and provision of human resource outsourcing services. Veranda Resort Public Company Limited is based in Bangkok, Thailand.", "currency": "THB", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Bangkok"}, "WD5.F": {"short_name": "WYNDHAM DESTINATIO.DL-,01", "long_name": "Wyndham Destinations, Inc.", "summary": "Wyndham Destinations, Inc. provides hospitality services and products in the United States and internationally. The company operates in two segments, Vacation Ownership and Vacation Exchange. The Vacation Ownership segment develops, markets, and sells vacation ownership interests (VOIs) to individual consumers; provides consumer financing in connection with the sale of VOIs; and provides property management services at resorts. The Vacation Exchange segment offers vacation exchange services and products to owners of VOIs. As of December 31, 2019, it had approximately 230 vacation ownership resorts. The company also offers private-label travel booking technology solutions. The company's travel business Panorama includes vacation exchange, leisure travel, and technology brands, including RCI, vacation exchange that provides access to 4,200+ affiliated resorts worldwide; and Extra Holidays, offering condo vacations at hotel prices. The company was formerly known as Wyndham Worldwide Corporation and changed its name to Wyndham Destinations, Inc. in May 2018. Wyndham Destinations, Inc. was founded in 1990 and is headquartered in Orlando, Florida.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Orlando"}, "WFS.DE": {"short_name": "WARIMPEX FIN.U.BETEIL. AG", "long_name": "Warimpex Finanz- und Beteiligungs AG", "summary": "Warimpex Finanz- und Beteiligungs AG operates as a real estate development and investment company in Central and Eastern Europe. The company operates through Hotels, Investment Properties, and Development and Services segments. It develops, owns, and operates hotel properties; and develops real estate projects, such as office buildings or shopping centres. The company invests in and develops projects in the Czech Republic, Poland, Hungary, Russia, Germany, Austria, and France. As of December 31, 2019, it owned and operated four hotels with 1,000 rooms; and eight commercial and office buildings with a total floor area of approximately 104,600 square meters. The company was founded in 1959 and is headquartered in Vienna, Austria.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "GER", "market": "de_market", "country": "Austria", "city": "Vienna"}, "WFS.F": {"short_name": "WARIMPEX FIN.U.BETEIL. AG", "long_name": "Warimpex Finanz- und Beteiligungs AG", "summary": "Warimpex Finanz- und Beteiligungs AG operates as a real estate development and investment company in Central and Eastern Europe. The company operates through Hotels, Investment Properties, and Development and Services segments. It develops, owns, and operates hotel properties; and develops real estate projects, such as office buildings or shopping centres. The company invests in and develops projects in the Czech Republic, Poland, Hungary, Russia, Germany, Austria, and France. As of December 31, 2019, it owned and operated four hotels with 1,000 rooms; and eight commercial and office buildings with a total floor area of approximately 104,600 square meters. The company was founded in 1959 and is headquartered in Vienna, Austria.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "Austria", "city": "Vienna"}, "WH": {"short_name": "Wyndham Hotels & Resorts, Inc.", "long_name": "Wyndham Hotels & Resorts, Inc.", "summary": "Wyndham Hotels & Resorts, Inc. operates as a hotel franchisor worldwide. The company operates a portfolio of 20 hotel brands, including Super 8, Days Inn, Ramada, Microtel, La Quinta, Baymont, Wingate, AmericInn, Hawthorn Suites, Trademark Collection, and Wyndham. Its Hotel Franchising segments licenses its lodging brands and provides related services to third-party hotel owners and others. The company's Hotel Management segment provides hotel management services for full-service and limited service hotels. As of November 25, 2020, it operated a network of approximately 9,000 hotels with approximately 804,000 rooms in 90 countries. Wyndham Hotels & Resorts, Inc. is also involved in the loyalty program business. The company was incorporated in 2017 and is headquartered in Parsippany, New Jersey.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Parsippany"}, "WXF.VI": {"short_name": "WARIMPEX FINANZ- UND BET. AG", "long_name": "Warimpex Finanz- und Beteiligungs AG", "summary": "Warimpex Finanz- und Beteiligungs AG operates as a real estate development and investment company in Central and Eastern Europe. The company operates through Hotels, Investment Properties, and Development and Services segments. It develops, owns, and operates hotel properties; and develops real estate projects, such as office buildings or shopping centres. The company invests in and develops projects in the Czech Republic, Poland, Hungary, Russia, Germany, Austria, and France. As of December 31, 2019, it owned and operated four hotels with 1,000 rooms; and eight commercial and office buildings with a total floor area of approximately 104,600 square meters. The company was founded in 1959 and is headquartered in Vienna, Austria.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "VIE", "market": "at_market", "country": "Austria", "city": "Vienna"}, "WYND": {"short_name": "Wyndham Destinations, Inc.", "long_name": "Wyndham Destinations, Inc.", "summary": "Wyndham Destinations, Inc. provides hospitality services and products in the United States and internationally. The company operates in two segments, Vacation Ownership and Vacation Exchange. The Vacation Ownership segment develops, markets, and sells vacation ownership interests (VOIs) to individual consumers; provides consumer financing in connection with the sale of VOIs; and provides property management services at resorts. The Vacation Exchange segment offers vacation exchange services and products to owners of VOIs. As of December 31, 2019, it had approximately 230 vacation ownership resorts. The company also offers private-label travel booking technology solutions. The company's travel business Panorama includes vacation exchange, leisure travel, and technology brands, including RCI, vacation exchange that provides access to 4,200+ affiliated resorts worldwide; and Extra Holidays, offering condo vacations at hotel prices. The company was formerly known as Wyndham Worldwide Corporation and changed its name to Wyndham Destinations, Inc. in May 2018. Wyndham Destinations, Inc. was founded in 1990 and is headquartered in Orlando, Florida.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Orlando"}}