{
    "0W0.F": {
        "short_name": "WATKIN JONES PLC  LS -,01",
        "long_name": "Watkin Jones Plc",
        "summary": "Watkin Jones Plc engages in the development and the management of properties for residential occupation in the United Kingdom. The company operates through Student Accommodation, Build to Rent, Residential, and Accommodation Management segments. It is involved in the development of purpose-built student accommodation, build to rent accommodation, and traditional residential property; and management of student accommodation and build to rent property. The company was formerly known as Watkin Jones Limited and changed its name to Watkin Jones Plc in March 2016. Watkin Jones Plc was founded in 1791 and is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W1B 4DE",
        "website": "http://www.watkinjonesplc.com",
        "market_cap": "Small Cap"
    },
    "1413.T": {
        "short_name": "HINOKIYA GROUP CO LTD",
        "long_name": "Hinokiya Group Co.,Ltd.",
        "summary": "Hinokiya Group Co.,Ltd. operates as a custom housing company in Japan. It is also involved in real estate, insulating material, renovation, nursing care, childcare, and other business. The company was founded in 1988 and is headquartered in Tokyo, Japan. Hinokiya Group Co.,Ltd. is a subsidiary of Yamada Holdings Co.,Ltd.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.hinokiya-group.jp",
        "market_cap": "Micro Cap"
    },
    "1420.T": {
        "short_name": "SANYO HOMES CORPORATION",
        "long_name": "Sanyo Homes Corporation",
        "summary": "Sanyo Homes Corporation engages in construction business in Japan. It operates in two segments, Housing Business and the Condominium Business. The Housing Business segment is involved in the design, construction, supervision and contracting, sale, and other activities for detached houses, rental welfare housing, and housing renovations. The Condominium Business segment develops, rents, and sells condominium buildings. The company is also involved in the sale of eco-energy facilities, such as solar power and storage batteries, as well as structural steel frameworks; and life support services comprising management of condominiums, and nursing and child care facilities. Sanyo Homes Corporation was founded in 1969 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "550-0005",
        "website": "http://www.sanyohomes.co.jp",
        "market_cap": "Micro Cap"
    },
    "1728.T": {
        "short_name": "MISAWA HOMES CHUGOKU CO.LTD",
        "long_name": "Misawa Homes Chugoku Co., Ltd.",
        "summary": "Misawa Homes Chugoku Co., Ltd. designs, constructs, and sells wooden prefabricated houses, ceramic houses, apartments, condominiums, buildings, and stores in Japan. It is also involved in the real estate-related business; and sale, design, and construction of housing-related products, such as interior and exterior. The company was founded in 1971 and is headquartered in Okayama, Japan. Misawa Homes Chugoku Co., Ltd. operates as a subsidiary of Misawa Homes Co., Ltd.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Okayama",
        "zipcode": "700-0971",
        "website": "http://www.misawa-c.co.jp",
        "market_cap": "Nano Cap"
    },
    "1739.T": {
        "short_name": "SEEDHEIWA CO LTD",
        "long_name": "SeedHeiwa Co., Ltd.",
        "summary": "SeedHeiwa Co., Ltd. engages in the design, construction, and supervision of construction works in Japan. The company constructs small and large buildings, as well as undertakes renovations and repair works. It is also involved in the sale, lease, management, and brokerage of condominiums, detached houses, and commercial facilities; and management of hotels. The company was formerly known as SEED Co., Ltd. and changed its name to SeedHeiwa Co., Ltd. in July 2014. The company was incorporated in 1993 and is headquartered in Osaka, Japan. SeedHeiwa Co., Ltd. is a subsidiary of Sanei Architecture Planning Co.,Ltd.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "532-0004",
        "website": "http://www.seedheiwa.co.jp",
        "market_cap": "Nano Cap"
    },
    "1808.T": {
        "short_name": "HASEKO CORPORATION",
        "long_name": "HASEKO Corporation",
        "summary": "HASEKO Corporation plans, designs, constructs, sells, renovates, and rents condominiums in Japan and internationally. The company operates through Construction-Related Business, Service-Related Business, and Overseas-Related Business segments. It is also involved in the real estate development, including for-sale housing and real estate, and condominium and apartment management operation and administration business; real estate brokerage, such as selling and buying, exchanging, leasing, and agency of real estate; purchase and resale comprising condominiums and other properties; and provision of real estate solutions that include asset management and project proposals, as well as consultation for use of land and real estate investment management and admiration of real estate. In addition, the company is involved in the for-sale condominium management business, which comprises monitoring, management and cleaning, maintenance, clerical, and life support; and rental condominium management and operation. Further, it provides large-scale repair, earthquake-resistant structure and facility renovation, environmental friendliness and energy saving renovation, value enhancement renovation, and remolding works, as well as condominium rehabilitation and building replacement services. Additionally, the company manages facilities for the elderly; and offers home nursing care, and senior living planning and consultation. It also provides interior enhancement services; and sells and leases construction materials. The company was founded in 1937 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8507",
        "website": "http://www.haseko.co.jp",
        "market_cap": "Mid Cap"
    },
    "1840.T": {
        "short_name": "TSUCHIYA HLDG",
        "long_name": "Tsuchiya Holdings Co., Ltd.",
        "summary": "Tsuchiya Holdings Co., Ltd., through its subsidiaries, provides control, management, and consulting services for companies operating in the construction industry in Japan. The company is involved in the construction of homes, as well as remodeling of buildings. It also offers real estate brokerage and leasing services, as well as offers solar power generation equipment. The company was formerly known as Tsuchiya Home Co., Ltd. and changed its name to Tsuchiya Holdings Co., Ltd. in November 2008. Tsuchiya Holdings Co., Ltd. was founded in 1969 and is headquartered in Sapporo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sapporo",
        "zipcode": null,
        "website": "http://www.tsuchiya.co.jp",
        "market_cap": "Nano Cap"
    },
    "1902.HK": {
        "short_name": "YINCHENG INTL",
        "long_name": "Yincheng International Holding Co., Ltd.",
        "summary": "Yincheng International Holding Co., Ltd., an investment holding company, engages in the property development activities in Mainland China. It develops and sells residential properties, including high-rise and multi-story apartments, and low-density houses, as well as commercial properties; operates exhibitions; provides property management services; operates hotels; and leasing of investment properties. The company also engages in medical management and consulting activities. Yincheng International Holding Co., Ltd. was founded in 1993 and is headquartered in Nanjing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": null,
        "website": "http://www.yincheng.hk",
        "market_cap": "Small Cap"
    },
    "1911.T": {
        "short_name": "SUMITOMO FORESTRY CO",
        "long_name": "Sumitomo Forestry Co., Ltd.",
        "summary": "Sumitomo Forestry Co., Ltd. engages in the timber and building materials, housing and construction, overseas housing and real estate, environment and resources, and other businesses in Japan, the United States, and internationally. The company's Timber and Building Materials segment procures, manufactures, processes, and sells timber and building materials, such as interior materials, plywood, medium density fiberboard, particle board, laminated veneer lumber, and other timber and building materials; develops and produces building materials, including structural members, and special interior products; and sells housing materials. Its Housing and Construction segment is involved in the construction, maintenance, and renovation of detached houses and apartment buildings; lease, management, purchase, sale, and brokerage of real estate; and house exterior fixtures, urban greening works, CAD, site surveys, etc. The company's Overseas Housing and Real Estate segment sells specs home; constructs detached houses, etc.; and develops multi-family housing and commercial complexes, etc. Its Environment and Resources segment engages in the biomass power generation business and forestation, etc. The company's Other segment is involved in the private-pay elderly care facilities and insurance agency businesses; and contracted civil engineering/construction works, etc. The company also engages in the management of forest and golf courses; secondary processing and sale of aluminum sashes and exterior finishing products; processing industrial waste products; wholesale of electric power; supply and sale of wood chips; development of computer systems, etc.; landscaping for private residences, plant management and rental, equipment leasing, office services, staffing, training, business contracting, and home nursing care services; and production and sale of nursery compost, culture soil for gardening, etc. The company was founded in 1691 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8270",
        "website": "http://sfc.jp",
        "market_cap": "Mid Cap"
    },
    "1928.T": {
        "short_name": "SEKISUI HOUSE",
        "long_name": "Sekisui House, Ltd.",
        "summary": "Sekisui House, Ltd. designs, constructs, and contracts built-to-order detached houses in Japan and internationally. It also engages in the design, construction, and contracting of built-to-order properties for lease, medical and nursing care facilities, commercial facilities, and hotels; design, construction, and contracting of construction of buildings and civil engineering works; remodeling and renovation of houses, etc.; sub-lease, management, operation, and brokerage of real estate; sale of houses and residential land; design, construction, and sale of condominiums; and development of office and commercial buildings, as well as management and operation of owned properties. The company was founded in 1960 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "531-0076",
        "website": "http://www.sekisuihouse.co.jp",
        "market_cap": "Large Cap"
    },
    "1HO1.F": {
        "short_name": "REDROW PLC  LS-,105",
        "long_name": "Redrow plc",
        "summary": "Redrow plc focuses on housebuilding activities in the United Kingdom. The company acquires land; and develops and sells residential housing properties. Redrow plc was founded in 1974 and is based in Flintshire, the United Kingdom.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Flintshire",
        "zipcode": "CH5 3RX",
        "website": "http://www.redrowplc.co.uk",
        "market_cap": "Mid Cap"
    },
    "1NN.F": {
        "short_name": "NEINOR HOMES SA EO 10",
        "long_name": "Neinor Homes, S.A.",
        "summary": "Neinor Homes, S.A., together with its subsidiaries, develops, promotes, rental, and manages real estate properties in Spain. The company operates through Legacy, Development, Assets Management-Servicing, and Rental segments. Its land portfolio consists of 160 lots with a total of 9.700 buildable units in Madrid, Catalonia, the Basque Country, Valencia, and Andalusia. Neinor Homes, S.A. was founded in 1988 and is headquartered in Bilbao, Spain.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Spain",
        "state": null,
        "city": "Bilbao",
        "zipcode": null,
        "website": "http://www.neinorhomes.com",
        "market_cap": "Small Cap"
    },
    "1QK.F": {
        "short_name": "AEDAS HOMES S.A. EO 1",
        "long_name": "Aedas Homes, S.A.",
        "summary": "Aedas Homes, S.A. engages in the development of residential buildings in Spain. The company was incorporated in 2016 and is based in Madrid, Spain. Aedas Homes, S.A. is a subsidiary of Hipoteca 43 Lux, S.A.R.L.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Spain",
        "state": null,
        "city": "Madrid",
        "zipcode": "28046",
        "website": "http://www.aedashomes.com",
        "market_cap": "Small Cap"
    },
    "1UY.F": {
        "short_name": "ATAL SA  ZY 5",
        "long_name": "Atal S.A.",
        "summary": "Atal S.A. develops and sells residential building complexes in Poland. The company develops housing estates, and single and multi-family houses. It operates in Gliwice, Katowice, Cracow, Lodz, Wroclaw, Warsaw, Tricity, and Poznan. The company was founded in 1990 and is headquartered in Cieszyn, Poland. Atal S.A. is a subsidiary of Juroszek Investments Sp. z o.o.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Poland",
        "state": null,
        "city": "Cieszyn",
        "zipcode": "43-400",
        "website": "http://www.atal.pl",
        "market_cap": "Small Cap"
    },
    "2231.HK": {
        "short_name": "JY GRANDMARK",
        "long_name": "JY Grandmark Holdings Limited",
        "summary": "JY Grandmark Holdings Limited, an investment holding company, engages in the property development activities in the People's Republic of China. The company operates through four segments: Property Development and Sales, Commercial Properties Investment, Hotel Operations, and Property Management. It develops residential properties; operates hotels, such as Just Stay Hotel and Just Stay Resort; offers property management and health management services; and owns and operates commercial properties. JY Grandmark Holdings Limited was founded in 2013 and is headquartered in Guangzhou, the People's Republic of China. JY Grandmark Holdings Limited is a subsidiary of IQ EQ (BVI) Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.jygrandmark.com",
        "market_cap": "Small Cap"
    },
    "2546.TW": {
        "short_name": "KEDGE CONSTRUCTION CO",
        "long_name": "Kedge Construction Co., Ltd.",
        "summary": "Kedge Construction Co. Ltd. constructs, develops, leases, and sells housing and buildings in Taiwan. It also engages in the electrical equipment and fire safety equipment installation, etc.; and general investment activities. The company was founded in 1982 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "106",
        "website": "http://www.kedge.com.tw",
        "market_cap": "Micro Cap"
    },
    "2G1.F": {
        "short_name": "GREEN BRICK PART.  DL-,01",
        "long_name": "Green Brick Partners, Inc.",
        "summary": "Green Brick Partners, Inc. operates as a homebuilding and land development company in the United States. It operates in three segments: Builder operations Central, Builder operations Southeast, and Land development. The company is involved in the land acquisition and development, entitlements, design, construction, title and mortgage services, marketing, and sale of townhomes, patio homes, single family homes, and luxury semi-custom homes in residential neighborhoods and master planned communities; development and sale of lots; and land and construction financing business. It owns or controls approximately 14,500 home sites in Dallas-Forth Worth, Atlanta metropolitan areas, and the Treasure Coast, Florida market. The company sells its homes through sales representatives and independent real estate brokers. Green Brick Partners, Inc. was incorporated in 2006 and is based in Plano, Texas.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Plano",
        "zipcode": "75093",
        "website": "http://greenbrickpartners.com",
        "market_cap": "Small Cap"
    },
    "3284.T": {
        "short_name": "HOOSIERS HOLDINGS",
        "long_name": "Hoosiers Holdings",
        "summary": "Hoosiers Holdings, through its subsidiaries, engages in planning, selling, and managing condominiums, self-owned detached houses, and apartments in Japan. The company operates through six segments: Condominium Apartments for Families and Singles, CCRC, Houses and Flats, Real Estate Investment, Property Management and Related Services, and Other. It engages in the real estate investment, development, leasing, and brokerage activities, as well as management of hotels; insurance business; management of sports facilities; and investment management, advisory, and consulting business activities. The company was founded in 2013 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.hoosiers.co.jp",
        "market_cap": "Micro Cap"
    },
    "3291.T": {
        "short_name": "IIDA GROUP HOLDINGS CO LTD",
        "long_name": "Iida Group Holdings Co., Ltd.",
        "summary": "Iida Group Holdings Co., Ltd. constructs and sells detached houses, and detached house condominiums in Japan. The company was founded in 1967 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.ighd.co.jp",
        "market_cap": "Mid Cap"
    },
    "3477.T": {
        "short_name": "FORLIFE CO LTD",
        "long_name": "FORLIFE Co., Ltd.",
        "summary": "FORLIFE Co., Ltd. provides condominiums and custom-built homes in Yokohama city, Kanagawa prefecture, Kawasaki city, and Jonan District of Tokyo. The company also offers ready-built houses. The company was formerly known as Four Life & Company Co., Ltd. and changed its name to FORLIFE Co., Ltd. in May 2013. FORLIFE Co., Ltd. was founded in 1996 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "222-0037",
        "website": "http://www.forlifeand.com",
        "market_cap": "Nano Cap"
    },
    "3BA.F": {
        "short_name": "BARRATT DEV. PLC  LS-,10",
        "long_name": "Barratt Developments plc",
        "summary": "Barratt Developments plc engages in the housebuilding and commercial development businesses in Great Britain. It acquires and develops land; plans, designs, and constructs homes, apartments, penthouses, and communities; and retail, leisure, office, industrial, and mixed-use properties. The company offers homes under the Barratt Homes, David Wilson Homes, and Barratt London brands. It is also involved in the commercial development activities under the Wilson Bowden Developments brand. The company was founded in 1958 and is headquartered in Coalville, the United Kingdom.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Coalville",
        "zipcode": "LE67 1UF",
        "website": "http://www.barrattdevelopments.co.uk",
        "market_cap": "Mid Cap"
    },
    "3BAA.F": {
        "short_name": "BARRATT DEVEL. UNSP.ADR/2",
        "long_name": "Barratt Developments plc",
        "summary": "Barratt Developments plc engages in the housebuilding and commercial development businesses in Great Britain. It acquires and develops land; plans, designs, and constructs homes, apartments, penthouses, and communities; and retail, leisure, office, industrial, and mixed-use properties. The company offers homes under the Barratt Homes, David Wilson Homes, and Barratt London brands. It is also involved in the commercial development activities under the Wilson Bowden Developments brand. The company was founded in 1958 and is headquartered in Coalville, the United Kingdom.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Coalville",
        "zipcode": "LE67 1UF",
        "website": "http://www.barrattdevelopments.co.uk",
        "market_cap": "Large Cap"
    },
    "41B.F": {
        "short_name": "BELLWAY PLC  LS -,125",
        "long_name": "Bellway p.l.c.",
        "summary": "Bellway p.l.c., together with its subsidiaries, engages in the home building business in the United Kingdom. The company builds and sells homes ranging from one-bedroom apartments to six-bedroom family homes, as well as provides homes to housing associations for social housing. It offers homes under Bellway and Ashberry brands. Bellway p.l.c. was incorporated in 1978 and is headquartered in Newcastle upon Tyne, the United Kingdom.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Newcastle upon Tyne",
        "zipcode": "NE13 8BF",
        "website": "http://www.bellwayplc.co.uk",
        "market_cap": "Mid Cap"
    },
    "4204.T": {
        "short_name": "SEKISUI CHEMICAL CO",
        "long_name": "Sekisui Chemical Co., Ltd.",
        "summary": "Sekisui Chemical Co., Ltd. engages in housing, urban infrastructure and environmental products (UIEP), and high performance plastics (HPP) businesses. The Housing segment engages in the manufacturing, construction, sale, refurbishing, and other operations related to unit housing, real estate, and residential service business. The UIEP segment manufactures, constructs, and sells PVC pipes and joints, polyethylene pipes and joints, pipe and drain renewal materials and construction methods, reinforced plastic pipe, construction materials, and FFU. The HPP segment engages in the manufacture and sale of interlayer films for laminated glass, polyolefin foam, tape, LCD fine particles and photosensitive materials, functional resin for infrastructure, diagnostic drugs, and other products. It operates in Japan, the United States, Europe, Asia, and internationally. The company was formerly known as Sekisui Sangyo Co., Ltd. and changed its name to Sekisui Chemical Co., Ltd. in 1948. Sekisui Chemical Co., Ltd. was founded in 1947 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-8565",
        "website": "http://www.sekisui.co.jp",
        "market_cap": "Mid Cap"
    },
    "44B.F": {
        "short_name": "VISTRY GROUP PLC  LS-,50",
        "long_name": "Vistry Group PLC",
        "summary": "Vistry Group PLC, together with its subsidiaries, operates as a builder of homes in the United Kingdom. The company offers two-bed to four and five-bed family homes. It owns a land bank of 40,218 plots. The company was formerly known as Bovis Homes Group PLC and changed its name to Vistry Group PLC in January 2020. Vistry Group PLC was founded in 1885 and is headquartered in West Malling, the United Kingdom.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "West Malling",
        "zipcode": "ME19 4UY",
        "website": "http://www.vistrygroup.co.uk",
        "market_cap": "Mid Cap"
    },
    "4GJ.F": {
        "short_name": "CONSORCIO ARA SAB DE CV",
        "long_name": "Consorcio ARA, S. A. B. de C. V.",
        "summary": "Consorcio ARA, S. A. B. de C. V., together with its subsidiaries, designs, develops, builds, and sells entry-level and middle-income residential housing developments in Mexico. The company also develops and leases shopping malls and commercial premises. As of December 31, 2019, it had a land bank of approximately 32.7 million square meters, as well as operated 6 shopping centers, unicenters, and minicenters. The company was founded in 1977 and is based in Mexico City, Mexico.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Mexico",
        "state": "DF",
        "city": "Mexico City",
        "zipcode": "05120",
        "website": "http://consorcioara.com.mx",
        "market_cap": "Micro Cap"
    },
    "4GP.F": {
        "short_name": "URBI DESARROLLOS URBANOS",
        "long_name": "Urbi, Desarrollos Urbanos, S.A.B. de C.V.",
        "summary": "Urbi, Desarrollos Urbanos, S.A.B. de C.V. engages in the housing development business in Mexico. It develops housing properties aimed at lower income population. The company was founded in 1981 and is based in Mexicali, Mexico.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Mexico",
        "state": "BJ",
        "city": "Mexicali",
        "zipcode": "21100",
        "website": "http://www.urbi.com",
        "market_cap": "Nano Cap"
    },
    "6073.T": {
        "short_name": "ASANTE INCORPORATED",
        "long_name": "Asante Incorporated",
        "summary": "Asante Incorporated engages in the house amenity and total sanitation businesses in Japan. The company offers house maintenance services, which include termite control; measures against humidity; earthquake countermeasures; and remodeling/new construction services, as well as handles solar power generation system, and electric home remodeling services. It also provides pest control and bedbug control services, as well as takes countermeasures against vermin and birds. The company was formerly known as Sanyo Shodoku Co., Ltd. and changed its name to Asante Incorporated in January 1994. Asante Incorporated was founded in 1970 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.asante.co.jp",
        "market_cap": "Micro Cap"
    },
    "66B.F": {
        "short_name": "BONAVA AB B FRIA  SK 8",
        "long_name": "Bonava AB (publ)",
        "summary": "Bonava AB (publ) develops and sells residential units in Sweden, Germany, Finland, Denmark, Norway, St. Petersburg, Estonia, and Latvia. The company offers multi-family and single-family houses; and develops homes for consumers and investors, such as pension funds, alongside municipalities, and other stakeholders. As of December 31, 2020, it had 31,800 building rights. Bonava AB (publ) is headquartered in Stockholm, Sweden.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Sweden",
        "state": null,
        "city": "Stockholm",
        "zipcode": "112 18",
        "website": "http://www.bonava.com",
        "market_cap": "Small Cap"
    },
    "6CO.F": {
        "short_name": "COUNTRYSIDE PR.PLC LS0,01",
        "long_name": "Countryside Properties PLC",
        "summary": "Countryside Properties PLC operates as a home builder and urban regeneration partner in the United Kingdom. It operates through two segments, Partnerships and Housebuilding. The Partnerships segment specializes in the urban regeneration of public sector land that delivers private, affordable, and private rented sector homes in partnership with local authorities and housing associations. This segment also develops brownfield land in the Midlands, the North West of England, and Yorkshire. The Housebuilding segment delivers homes to local owner occupiers; and develops primarily private and affordable homes located in outer London and the home counties. The company also offers estate management services. It has a total land bank of 42,000 plots. The company was formerly known as Hackplimco (No. 121) plc and changed its name to Countryside Properties PLC in January 2016. Countryside Properties PLC was founded in 1958 and is headquartered in Brentwood, the United Kingdom.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Brentwood",
        "zipcode": "CM13 3AT",
        "website": "http://www.countrysideproperties.com",
        "market_cap": "Mid Cap"
    },
    "7O4.F": {
        "short_name": "OSCAR PROPERT.HLDG (PUBL)",
        "long_name": "Oscar Properties Holding AB (publ)",
        "summary": "Oscar Properties Holding AB (publ) acquires, develops, and markets real estate properties in Stockholm. The company develops homes through new build developments, as well as through the conversion of former industrial, office, school, factory, post office, and other buildings. It also provides property management services. Oscar Properties Holding AB (publ) was founded in 2004 and is based in Stockholm, Sweden.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Sweden",
        "state": null,
        "city": "Stockholm",
        "zipcode": "102 43",
        "website": "http://oscarproperties.com",
        "market_cap": "Micro Cap"
    },
    "88M.SG": {
        "short_name": "Hexaom S.A. Actions au Porteur ",
        "long_name": "Hexaom S.A.",
        "summary": "Hexaom S.A. engages in the home building and renovation, and home ownership businesses in France. It also provides home renovation, fitting, and improving services, as well as financing brokerage services. The company was founded in 1919 and is headquartered in AlenÃ§on, France.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "STU",
        "market": "dr_market",
        "country": "France",
        "state": null,
        "city": "AlenÃ§on",
        "zipcode": "61001",
        "website": "http://www.hexaom.fr",
        "market_cap": "Small Cap"
    },
    "8904.T": {
        "short_name": "AVANTIA CO LTD",
        "long_name": "Avantia Co.,Ltd.",
        "summary": "Avantia Co.,Ltd. engages in the custom-build housing business in Japan. It involved in the planning, design, construction, interior coordination, and exterior design of houses; detached housing business; residential land development and sale; remodeling business; development business; residential land development business; condominium business; and brokerage business. The company was formerly known as Sanyo Housing Nagoya Co., Ltd. and changed its name to Avantia Co.,Ltd. in January 2020. Avantia Co.,Ltd. was founded in 1989 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "467-0842",
        "website": "http://avantia-g.co.jp",
        "market_cap": "Micro Cap"
    },
    "8917.T": {
        "short_name": "FIRST JUKEN CO LTD",
        "long_name": "First Juken Co., Ltd.",
        "summary": "First Juken Co., Ltd. engages in the construction and sale of detached houses in Japan. The company also provides subcontracting work and related services; and construction consulting services. In addition, it offers real estate sales, brokerage, placement, rental, and management services; and non-life insurance agency and life insurance solicitation services. The company was founded in 1999 and is headquartered in Amagasaki, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Amagasaki",
        "zipcode": "660-0892",
        "website": "http://www.f-juken.co.jp",
        "market_cap": "Micro Cap"
    },
    "9MZ.F": {
        "short_name": "SPRINGFIELD PROP. LS-,125",
        "long_name": "Springfield Properties Plc",
        "summary": "Springfield Properties Plc, together with its subsidiary, engages in the house building business in the United Kingdom. The company operates through two markets, Private Housing and Affordable. It is also involved in hiring plants and machineries, property development, buys and sells real estate and residential property, and management services. The company was founded in 1956 and is based in Elgin, the United Kingdom.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Elgin",
        "zipcode": "IV30 6GR",
        "website": "http://www.springfield.co.uk",
        "market_cap": "Micro Cap"
    },
    "AEDAS.MC": {
        "short_name": "AEDAS HOMES, S.A",
        "long_name": "Aedas Homes, S.A.",
        "summary": "Aedas Homes, S.A. engages in the development of residential buildings in Spain. The company was incorporated in 2016 and is based in Madrid, Spain. Aedas Homes, S.A. is a subsidiary of Hipoteca 43 Lux, S.A.R.L.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "MCE",
        "market": "es_market",
        "country": "Spain",
        "state": null,
        "city": "Madrid",
        "zipcode": "28046",
        "website": "http://www.aedashomes.com",
        "market_cap": "Small Cap"
    },
    "ALMA.TA": {
        "short_name": "ALMOGIM HOLDINGS",
        "long_name": "Almogim Holdings Ltd.",
        "summary": "Almogim Holdings Ltd. develops, sells, and operates of real estate properties in Israel and internationally. It focuses on the development, construction, marketing, sale, and rental of residential neighborhoods and commercial complexes; construction, rental, and operation of residential complexes for young people; and provision of property management services. The company was founded in 1986 and is headquartered in Tirat Carmel, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tirat Carmel",
        "zipcode": "3912001",
        "website": "http://www.almogim.co.il",
        "market_cap": null
    },
    "ALUNT.PA": {
        "short_name": "UNITI",
        "long_name": "Uniti S.A",
        "summary": "Uniti S.A develops residential real estate properties. It provides managed residences, and serviced residences for seniors and students. The company was founded in 2012 and is headquartered in Paris, France.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "Paris",
        "zipcode": "75008",
        "website": "http://uniti-habitat.fr",
        "market_cap": "Nano Cap"
    },
    "ARA.MX": {
        "short_name": "CONSORCIO ARA SAB",
        "long_name": "Consorcio ARA, S. A. B. de C. V.",
        "summary": "Consorcio ARA, S. A. B. de C. V., together with its subsidiaries, designs, develops, builds, and sells entry-level and middle-income residential housing developments in Mexico. The company also develops and leases shopping malls and commercial premises. As of December 31, 2019, it had a land bank of approximately 32.7 million square meters, as well as operated 6 shopping centers, unicenters, and minicenters. The company was founded in 1977 and is based in Mexico City, Mexico.",
        "currency": "MXN",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Mexico",
        "state": "DF",
        "city": "Mexico City",
        "zipcode": "05120",
        "website": "http://consorcioara.com.mx",
        "market_cap": "Micro Cap"
    },
    "ASCK": {
        "short_name": "AUSCRETE CORP",
        "long_name": "Auscrete Corporation",
        "summary": "Auscrete Corporation intends to manufacture construction products for commercial and residential structures. The company was incorporated in 2009 and is based in Goldendale, Washington.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WA",
        "city": "Goldendale",
        "zipcode": "98620",
        "website": "http://www.auscretehomes.com",
        "market_cap": "Nano Cap"
    },
    "ASP.PA": {
        "short_name": "A.S.T. GROUPE",
        "long_name": "AST Groupe",
        "summary": "AST Groupe operates as a real estate developer in France. The company engages in the development and construction of houses and apartments, as well as develops land. The company's projects include individual houses, homes, timber frame houses, detached houses, and club house villas. It also provides valuation, feasibility study, planning proposal, and encryption and consultation studies, as well as funding, kitchen and interior fitting, and franchise services. The company was founded in 1993 and is based in DÃ©cines-Charpieu, France.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "DÃ©cines-Charpieu",
        "zipcode": "69150",
        "website": "http://www.ast-groupe.fr",
        "market_cap": "Micro Cap"
    },
    "ASPI.JK": {
        "short_name": "Andalan Sakti Primaindo Tbk.",
        "long_name": "PT Andalan Sakti Primaindo, Tbk",
        "summary": "PT Andalan Sakti Primaindo, Tbk engages in property business in Indonesia. It develops residential properties. The company was founded in 2012 and is based in South Jakarta, Indonesia. PT Andalan Sakti Primaindo, Tbk is a subsidiary of PT Andalan Sakti Inti.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12920",
        "website": "http://ansa-land.com",
        "market_cap": "Nano Cap"
    },
    "ATAP.JK": {
        "short_name": "Trimitra Prawara Goldland Tbk.",
        "long_name": "PT Trimitra Prawara Goldland Tbk",
        "summary": "PT Trimitra Prawara Goldland Tbk engages in the property development business in Indonesia. The company is based in Bogor, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bogor",
        "zipcode": null,
        "website": "http://trimitraprawaraland.co.id/",
        "market_cap": "Nano Cap"
    },
    "BAL.VI": {
        "short_name": "B-A-L GERMANY AG VZ",
        "long_name": "B-A-L Germany AG",
        "summary": "B-A-L Germany AG owns and operates residential real estate properties primarily in Saxony, Germany. The company was founded in 2014 and is based in Meissen, Germany.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Germany",
        "state": null,
        "city": "Meissen",
        "zipcode": "01662",
        "website": "http://www.bal-ag.de",
        "market_cap": null
    },
    "BASS.PA": {
        "short_name": "BASSAC",
        "long_name": "BASSAC Société anonyme",
        "summary": "BASSAC SociÃ©tÃ© anonyme operates as a real estate development company primarily in France, Germany, and Spain. It offers homes and apartments. The company was founded in 1972 and is based in Boulogne-Billancourt, France. BASSAC SociÃ©tÃ© anonyme is a subsidiary of Premier Investissement SAS.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "Boulogne-Billancourt",
        "zipcode": "92100",
        "website": "http://www.bassac.fr",
        "market_cap": "Small Cap"
    },
    "BDEV.L": {
        "short_name": "BARRATT DEVELOPMENTS PLC ORD 10",
        "long_name": "Barratt Developments plc",
        "summary": "Barratt Developments plc engages in the housebuilding and commercial development businesses in Great Britain. It acquires and develops land; plans, designs, and constructs homes, apartments, penthouses, and communities; and retail, leisure, office, industrial, and mixed-use properties. The company offers homes under the Barratt Homes, David Wilson Homes, and Barratt London brands. It is also involved in the commercial development activities under the Wilson Bowden Developments brand. The company was founded in 1958 and is headquartered in Coalville, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Coalville",
        "zipcode": "LE67 1UF",
        "website": "http://www.barrattdevelopments.co.uk",
        "market_cap": null
    },
    "BE4A.F": {
        "short_name": "BEAZER HOMES USA  DL-,01",
        "long_name": "Beazer Homes USA, Inc.",
        "summary": "Beazer Homes USA, Inc. operates as a homebuilder in the United States. It designs, constructs, and sells single-family and multi-family homes under the Beazer Homes, Gatherings, and Choice Plans names. The company sells its homes through commissioned new home sales counselors and independent brokers in Arizona, California, Nevada, Texas, Delaware, Indiana, Maryland, Tennessee, Virginia, Florida, Georgia, North Carolina, and South Carolina. Beazer Homes USA, Inc. was founded in 1985 and is headquartered in Atlanta, Georgia.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30328",
        "website": "http://www.beazer.com",
        "market_cap": "Small Cap"
    },
    "BKG.L": {
        "short_name": "BERKELEY GROUP HOLDINGS (THE) P",
        "long_name": "The Berkeley Group Holdings plc",
        "summary": "The Berkeley Group Holdings plc, together with its subsidiaries, engages in the residential-led and mixed-use property development activities in the United Kingdom. It operates under the Berkeley, St Edward, St George, St James, St Joseph, St William, Berkeley First, Berkeley Commercial, Berkeley Partnership, and Berkeley Modular brand names. The company was founded in 1976 and is headquartered in Cobham, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Cobham",
        "zipcode": "KT11 1JG",
        "website": "http://www.berkeleygroup.co.uk",
        "market_cap": null
    },
    "BKGFY": {
        "short_name": "BERKELEY GROUP HLDGS UNSP ADS E",
        "long_name": "The Berkeley Group Holdings plc",
        "summary": "The Berkeley Group Holdings plc, together with its subsidiaries, engages in the residential-led and mixed-use property development activities in the United Kingdom. It operates under the Berkeley, St Edward, St George, St James, St Joseph, St William, Berkeley First, Berkeley Commercial, Berkeley Partnership, and Berkeley Modular brand names. The company was founded in 1976 and is headquartered in Cobham, the United Kingdom.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Cobham",
        "zipcode": "KT11 1JG",
        "website": "http://www.berkeleygroup.co.uk",
        "market_cap": "Mid Cap"
    },
    "BONAV-A.ST": {
        "short_name": "Bonava AB ser. A",
        "long_name": "Bonava AB (publ)",
        "summary": "Bonava AB (publ) develops and sells residential units in Sweden, Germany, Finland, Denmark, Norway, St. Petersburg, Estonia, and Latvia. The company offers multi-family and single-family houses; and develops homes for consumers and investors, such as pension funds, alongside municipalities, and other stakeholders. As of December 31, 2020, it had 31,800 building rights. Bonava AB (publ) is headquartered in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "state": null,
        "city": "Stockholm",
        "zipcode": "112 18",
        "website": "http://www.bonava.com",
        "market_cap": "Small Cap"
    },
    "BONAV-B.ST": {
        "short_name": "Bonava AB ser. B",
        "long_name": "Bonava AB (publ)",
        "summary": "Bonava AB (publ) develops and sells residential units in Sweden, Germany, Finland, Denmark, Norway, St. Petersburg, Estonia, and Latvia. The company offers multi-family and single-family houses; and develops homes for consumers and investors, such as pension funds, alongside municipalities, and other stakeholders. As of December 31, 2020, it had 31,800 building rights. Bonava AB (publ) is headquartered in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "state": null,
        "city": "Stockholm",
        "zipcode": "112 18",
        "website": "http://www.bonava.com",
        "market_cap": "Small Cap"
    },
    "BTDPF": {
        "short_name": "BARRATT DEVELOPMENTS",
        "long_name": "Barratt Developments plc",
        "summary": "Barratt Developments plc engages in the housebuilding and commercial development businesses in Great Britain. It acquires and develops land; plans, designs, and constructs homes, apartments, penthouses, and communities; and retail, leisure, office, industrial, and mixed-use properties. The company offers homes under the Barratt Homes, David Wilson Homes, and Barratt London brands. It is also involved in the commercial development activities under the Wilson Bowden Developments brand. The company was founded in 1958 and is headquartered in Coalville, the United Kingdom.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Coalville",
        "zipcode": "LE67 1UF",
        "website": "http://www.barrattdevelopments.co.uk",
        "market_cap": "Large Cap"
    },
    "BTDPY": {
        "short_name": "BARRATT DEVELOPMENTS",
        "long_name": "Barratt Developments plc",
        "summary": "Barratt Developments plc engages in the housebuilding and commercial development businesses in Great Britain. It acquires and develops land; plans, designs, and constructs homes, apartments, penthouses, and communities; and retail, leisure, office, industrial, and mixed-use properties. The company offers homes under the Barratt Homes, David Wilson Homes, and Barratt London brands. It is also involved in the commercial development activities under the Wilson Bowden Developments brand. The company was founded in 1958 and is headquartered in Coalville, the United Kingdom.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Coalville",
        "zipcode": "LE67 1UF",
        "website": "http://www.barrattdevelopments.co.uk",
        "market_cap": "Large Cap"
    },
    "BWY.L": {
        "short_name": "BELLWAY PLC ORD 12.5P",
        "long_name": "Bellway p.l.c.",
        "summary": "Bellway p.l.c., together with its subsidiaries, engages in the home building business in the United Kingdom. The company builds and sells homes ranging from one-bedroom apartments to six-bedroom family homes, as well as provides homes to housing associations for social housing. It offers homes under Bellway and Ashberry brands. Bellway p.l.c. was incorporated in 1978 and is headquartered in Newcastle upon Tyne, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Newcastle upon Tyne",
        "zipcode": "NE13 8BF",
        "website": "http://www.bellwayplc.co.uk",
        "market_cap": null
    },
    "BZH": {
        "short_name": "Beazer Homes USA, Inc.",
        "long_name": "Beazer Homes USA, Inc.",
        "summary": "Beazer Homes USA, Inc. operates as a homebuilder in the United States. It designs, constructs, and sells single-family and multi-family homes under the Beazer Homes, Gatherings, and Choice Plans names. The company sells its homes through commissioned new home sales counselors and independent brokers in Arizona, California, Nevada, Texas, Delaware, Indiana, Maryland, Tennessee, Virginia, Florida, Georgia, North Carolina, and South Carolina. Beazer Homes USA, Inc. was founded in 1985 and is headquartered in Atlanta, Georgia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30328",
        "website": "http://www.beazer.com",
        "market_cap": "Small Cap"
    },
    "C38.F": {
        "short_name": "CREST NICHOLS.HLDGS LS-05",
        "long_name": "Crest Nicholson Holdings plc",
        "summary": "Crest Nicholson Holdings plc builds homes in the United Kingdom. It develops and sells apartments, houses, and regeneration schemes, as well as commercial properties. The company serves first-time buyers, families, and investors. Crest Nicholson Holdings plc was founded in 1963 and is headquartered in Chertsey, the United Kingdom.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Chertsey",
        "zipcode": "KT16 9GN",
        "website": "http://www.crestnicholson.com",
        "market_cap": "Small Cap"
    },
    "C5H.F": {
        "short_name": "CAIRN HOMES (WI) EO -,001",
        "long_name": "Cairn Homes plc",
        "summary": "Cairn Homes plc operates as a homebuilder in Ireland. The company develops and sells residential properties. It is also involved in the rental of properties. The company was incorporated in 2014 and is based in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.cairnhomes.com",
        "market_cap": "Small Cap"
    },
    "C5H.IR": {
        "short_name": "CAIRN HOMES PLC",
        "long_name": "Cairn Homes plc",
        "summary": "Cairn Homes plc operates as a homebuilder in Ireland. The company develops and sells residential properties. It is also involved in the rental of properties. The company was incorporated in 2014 and is based in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "ISE",
        "market": "ie_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.cairnhomes.com",
        "market_cap": "Small Cap"
    },
    "CCS": {
        "short_name": "Century Communities, Inc.",
        "long_name": "Century Communities, Inc.",
        "summary": "Century Communities, Inc., together with its subsidiaries, engages in the design, development, construction, marketing, and sale of single-family attached and detached homes. It is also involved in the entitlement and development of the underlying land; and provision of mortgage, title, and insurance services to its home buyers. The company offers homes under the Century Communities and Century Complete brands. It sells homes through its sales representatives, as well as through independent real estate brokers in 17 states in the United States. Century Communities, Inc. was founded in 2002 and is headquartered in Greenwood Village, Colorado.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Greenwood Village",
        "zipcode": "80111",
        "website": "http://www.centurycommunities.com",
        "market_cap": "Mid Cap"
    },
    "CCT.F": {
        "short_name": "CENTURY COMMUNIT.  DL-,01",
        "long_name": "Century Communities, Inc.",
        "summary": "Century Communities, Inc., together with its subsidiaries, engages in the design, development, construction, marketing, and sale of single-family attached and detached homes. It is also involved in the entitlement and development of the underlying land; and provision of mortgage, title, and insurance services to its home buyers. The company offers homes under the Century Communities and Century Complete brands. It sells homes through its sales representatives, as well as through independent real estate brokers in 17 states in the United States. Century Communities, Inc. was founded in 2002 and is headquartered in Greenwood Village, Colorado.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CO",
        "city": "Greenwood Village",
        "zipcode": "80111",
        "website": "http://www.centurycommunities.com",
        "market_cap": "Mid Cap"
    },
    "CGR.JO": {
        "short_name": "Calgro M3 Hldgs Ltd",
        "long_name": "Calgro M3 Holdings Limited",
        "summary": "Calgro M3 Holdings Limited, together with its subsidiary, engages in the development of integrated residential properties in South Africa. The company operates through three segments: Residential Property Development, Memorial Parks, and Residential Rental Investments. It also develops and manages memorial parks, as well as provides burial rights and maintenance services. The company also invests in real estate properties. Calgro M3 Holdings Limited was incorporated in 1995 and is headquartered in Bryanston, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Bryanston",
        "zipcode": "2196",
        "website": "http://www.calgrom3.com",
        "market_cap": null
    },
    "CHEWA-R.BK": {
        "short_name": "CHEWATHAI PUBLIC COMPANY LIMITE",
        "long_name": "Chewathai Public Company Limited",
        "summary": "Chewathai Public Company Limited develops, rents, and sells residential projects in Thailand. It operates through two segments, Real Estate Business and Rental Business. The company develops and sells land, houses, townhomes, and residence condominium projects. It also owns, develops, and rents small and medium sized ready-built factories. The company was incorporated in 2008 and is headquartered in Bangkok, Thailand. Chewathai Public Company Limited is a subsidiary of Chartchewa Co., Ltd.",
        "currency": "THB",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10120",
        "website": "http://www.chewathai.com",
        "market_cap": "Nano Cap"
    },
    "CHEWA.BK": {
        "short_name": "CHEWATHAI PUBLIC COMPANY LIMITE",
        "long_name": "Chewathai Public Company Limited",
        "summary": "Chewathai Public Company Limited develops, rents, and sells residential projects in Thailand. It operates through two segments, Real Estate Business and Rental Business. The company develops and sells land, houses, townhomes, and residence condominium projects. It also owns, develops, and rents small and medium sized ready-built factories. The company was incorporated in 2008 and is headquartered in Bangkok, Thailand. Chewathai Public Company Limited is a subsidiary of Chartchewa Co., Ltd.",
        "currency": "THB",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10120",
        "website": "http://www.chewathai.com",
        "market_cap": "Nano Cap"
    },
    "CORALFINAC.NS": {
        "short_name": "CORAL INDIA FIN",
        "long_name": "Coral India Finance and Housing Limited",
        "summary": "Coral India Finance and Housing Limited engages in the finance and construction businesses in India. The company operates through two segments, Construction and Investments. It develops commercial complexes and residential developments. The company was incorporated in 1995 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.coralhousing.in",
        "market_cap": "Nano Cap"
    },
    "CRN.L": {
        "short_name": "CAIRN HOMES PLC ORD EUR0.001 (C",
        "long_name": "Cairn Homes plc",
        "summary": "Cairn Homes plc operates as a homebuilder in Ireland. The company develops and sells residential properties. It is also involved in the rental of properties. The company was incorporated in 2014 and is based in Dublin, Ireland.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.cairnhomes.com",
        "market_cap": null
    },
    "CRST.L": {
        "short_name": "CREST NICHOLSON HOLDINGS PLC OR",
        "long_name": "Crest Nicholson Holdings plc",
        "summary": "Crest Nicholson Holdings plc builds homes in the United Kingdom. It develops and sells apartments, houses, and regeneration schemes, as well as commercial properties. The company serves first-time buyers, families, and investors. Crest Nicholson Holdings plc was founded in 1963 and is headquartered in Chertsey, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Chertsey",
        "zipcode": "KT16 9GN",
        "website": "http://www.crestnicholson.com",
        "market_cap": null
    },
    "CSP.L": {
        "short_name": "COUNTRYSIDE PROPERTIES PLC ORD ",
        "long_name": "Countryside Properties PLC",
        "summary": "Countryside Properties PLC operates as a home builder and urban regeneration partner in the United Kingdom. It operates through two segments, Partnerships and Housebuilding. The Partnerships segment specializes in the urban regeneration of public sector land that delivers private, affordable, and private rented sector homes in partnership with local authorities and housing associations. This segment also develops brownfield land in the Midlands, the North West of England, and Yorkshire. The Housebuilding segment delivers homes to local owner occupiers; and develops primarily private and affordable homes located in outer London and the home counties. The company also offers estate management services. It has a total land bank of 42,000 plots. The company was formerly known as Hackplimco (No. 121) plc and changed its name to Countryside Properties PLC in January 2016. Countryside Properties PLC was founded in 1958 and is headquartered in Brentwood, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Brentwood",
        "zipcode": "CM13 3AT",
        "website": "http://www.countrysideproperties.com",
        "market_cap": null
    },
    "CSPLF": {
        "short_name": "COUNTRYSIDE PROPERTIES PLC",
        "long_name": "Countryside Properties PLC",
        "summary": "Countryside Properties PLC operates as a home builder and urban regeneration partner in the United Kingdom. It operates through two segments, Partnerships and Housebuilding. The Partnerships segment specializes in the urban regeneration of public sector land that delivers private, affordable, and private rented sector homes in partnership with local authorities and housing associations. This segment also develops brownfield land in the Midlands, the North West of England, and Yorkshire. The Housebuilding segment delivers homes to local owner occupiers; and develops primarily private and affordable homes located in outer London and the home counties. The company also offers estate management services. It has a total land bank of 42,000 plots. The company was formerly known as Hackplimco (No. 121) plc and changed its name to Countryside Properties PLC in January 2016. Countryside Properties PLC was founded in 1958 and is headquartered in Brentwood, the United Kingdom.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Brentwood",
        "zipcode": "CM13 3AT",
        "website": "http://www.countrysideproperties.com",
        "market_cap": "Mid Cap"
    },
    "CVCO": {
        "short_name": "Cavco Industries, Inc.",
        "long_name": "Cavco Industries, Inc.",
        "summary": "Cavco Industries, Inc. designs, produces, and retails manufactured homes primarily in the United States. It operates in two segments, Factory-Built Housing and Financial Services. The company markets its manufactured homes under the Cavco, Fleetwood, Palm Harbor, Fairmont, Friendship, Chariot Eagle, and Destiny brands. It also builds park model RVs; vacation cabins; and systems-built commercial structures, including apartment buildings, condominiums, hotels, workforce housing, schools, and housing for the United States military troops. In addition, the company produces various modular homes, such as single and multi-module ranch, split-level, and Cape Cod style homes, as well as two and three story homes and multi-family units primarily under the Nationwide Homes brand. Further, it provides conforming mortgages, non-conforming mortgages, and home-only loans to purchasers of various brands of factory-built homes sold by company-owned retail sales centers, as well as various independent distributors, builders, communities, and developers. Additionally, the company offers property and casualty insurance to owners of manufactured homes. As of March 28, 2020, it operated 39 retail centers in Oregon, Arizona, New Mexico, Texas, Oklahoma, and Florida, Texas. The company also distributes its homes through a network of independent distribution points in 42 states and Canada; and through planned community operators and residential developers. Cavco Industries, Inc. was founded in 1965 and is headquartered in Phoenix, Arizona.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Phoenix",
        "zipcode": "85012",
        "website": "http://www.cavco.com",
        "market_cap": "Mid Cap"
    },
    "CYRBY": {
        "short_name": "CYRELA BRAZIL REALTY SA EMPREEN",
        "long_name": "Cyrela Brazil Realty S.A. Empreendimentos e Participações",
        "summary": "Cyrela Brazil Realty S.A. Empreendimentos e ParticipaÃ§Ãµes develops, constructs, sells, and services residential and commercial properties in Brazil. The company also engages in the leasing, management, and construction of properties; and the provision of consultancy services related to real estate. It offers properties under the Cyrela, Living, Vivaz, and Cyrela Urbanismo brand names. The company was founded in 1962 and is headquartered in SÃ£o Paulo, Brazil.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Brazil",
        "state": "SP",
        "city": "SÃ£o Paulo",
        "zipcode": "04552-000",
        "website": "http://www.cyrela.com.br",
        "market_cap": "Small Cap"
    },
    "CYRE3.SA": {
        "short_name": "CYRELA REALTON      NM",
        "long_name": "Cyrela Brazil Realty S.A. Empreendimentos e Participações",
        "summary": "Cyrela Brazil Realty S.A. Empreendimentos e ParticipaÃ§Ãµes develops, constructs, sells, and services residential and commercial properties in Brazil. The company also engages in the leasing, management, and construction of properties; and the provision of consultancy services related to real estate. It offers properties under the Cyrela, Living, Vivaz, and Cyrela Urbanismo brand names. The company was founded in 1962 and is headquartered in SÃ£o Paulo, Brazil.",
        "currency": "BRL",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "state": "SP",
        "city": "SÃ£o Paulo",
        "zipcode": "04552-000",
        "website": "http://www.cyrela.com.br",
        "market_cap": "Small Cap"
    },
    "D1HI34.SA": {
        "short_name": "DR HORTON INDRN",
        "long_name": "D.R. Horton, Inc.",
        "summary": "D.R. Horton, Inc. operates as a homebuilding company in East, Midwest, Southeast, South Central, Southwest, and West regions in the United States. It engages in the acquisition and development of land; and construction and sale of homes in 29 states and 88 markets under the names of D.R. Horton, America's Builder, Express Homes, Emerald Homes, and Freedom Homes. The company constructs and sells single-family detached homes; and attached homes, such as town homes, duplexes, and triplexes. It also provides mortgage financing services; and title insurance policies, and examination and closing services, as well as engages in the residential lot development business. In addition, the company constructs and owns multi-family rental properties; owns residential real estate, including ranch land and improvements; and owns and operates oil and gas assets. The company primarily serves homebuyers. D.R. Horton, Inc. was founded in 1978 and is based in Arlington, Texas.",
        "currency": "BRL",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "TX",
        "city": "Arlington",
        "zipcode": "76011",
        "website": "http://www.drhorton.com",
        "market_cap": "Large Cap"
    },
    "DFH": {
        "short_name": "Dream Finders Homes, Inc.",
        "long_name": "Dream Finders Homes, Inc.",
        "summary": "Dream Finders Homes, Inc. operates as a holding company for Dream Finders Holdings LLC that engages in homebuilding business in the United States. The company designs, builds, and sells single family attached and detached homes in Jacksonville, Orlando, Denver, the Washington D.C. metropolitan area, and Austin, as well as in Charlotte and Raleigh. It also operates as a licensed home mortgage broker that underwrites, originates, and sells mortgages to Prime Lending; and provides insurance agency services, including closing, escrow, and title insurance. The company sells its homes through its sales representatives and independent real estate brokers. Dream Finders Homes, Inc. was founded in 2008 and is headquartered in Jacksonville, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Jacksonville",
        "zipcode": "32256",
        "website": "http://www.dreamfindershomes.com",
        "market_cap": "Mid Cap"
    },
    "DHI.MX": {
        "short_name": "DR HORTON INC",
        "long_name": "D.R. Horton, Inc.",
        "summary": "D.R. Horton, Inc. operates as a homebuilding company in East, Midwest, Southeast, South Central, Southwest, and West regions in the United States. It engages in the acquisition and development of land; and construction and sale of homes in 29 states and 88 markets under the names of D.R. Horton, America's Builder, Express Homes, Emerald Homes, and Freedom Homes. The company constructs and sells single-family detached homes; and attached homes, such as town homes, duplexes, and triplexes. It also provides mortgage financing services; and title insurance policies, and examination and closing services, as well as engages in the residential lot development business. In addition, the company constructs and owns multi-family rental properties; owns residential real estate, including ranch land and improvements; and owns and operates oil and gas assets. The company primarily serves homebuyers. D.R. Horton, Inc. was founded in 1978 and is based in Arlington, Texas.",
        "currency": "MXN",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "TX",
        "city": "Arlington",
        "zipcode": "76011",
        "website": "http://www.drhorton.com",
        "market_cap": "Large Cap"
    },
    "DHI": {
        "short_name": "D.R. Horton, Inc.",
        "long_name": "D.R. Horton, Inc.",
        "summary": "D.R. Horton, Inc. operates as a homebuilding company in East, Midwest, Southeast, South Central, Southwest, and West regions in the United States. It engages in the acquisition and development of land; and construction and sale of homes in 29 states and 88 markets under the names of D.R. Horton, America's Builder, Express Homes, Emerald Homes, and Freedom Homes. The company constructs and sells single-family detached homes; and attached homes, such as town homes, duplexes, and triplexes. It also provides mortgage financing services; and title insurance policies, and examination and closing services, as well as engages in the residential lot development business. In addition, the company constructs and owns multi-family rental properties; owns residential real estate, including ranch land and improvements; and owns and operates oil and gas assets. The company primarily serves homebuyers. D.R. Horton, Inc. was founded in 1978 and is based in Arlington, Texas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Arlington",
        "zipcode": "76011",
        "website": "http://www.drhorton.com",
        "market_cap": "Large Cap"
    },
    "DREM": {
        "short_name": "DREAM HOMES & DEVELOPMENT CORPO",
        "long_name": "Dream Homes & Development Corporation",
        "summary": "Dream Homes & Development Corporation engages in the residential construction business in the United States. It elevates/renovates, demolishes, and constructs new homes and single and multi-family homes. The company also offers engineering and structural design, infrastructure installation, soil studies, architectural and design/build, construction management, helical and timber pile installation, masonry foundations and concrete work, management of home elevation and moving projects, and finish requirements for interior construction, as well as turnkey solutions. The company was formerly known as The Virtual Learning Company, Inc. and changed its name to Dream Homes & Development Corporation in March 2017. Dream Homes & Development Corporation was founded in 2009 and is headquartered in Forked River, New Jersey.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Forked River",
        "zipcode": "08731",
        "website": "http://www.dreamhomesltd.com",
        "market_cap": "Nano Cap"
    },
    "EGBB": {
        "short_name": "EARTH GEN-BIOFUEL INC",
        "long_name": "Earth Gen-Biofuel, Inc.",
        "summary": "Earth Gen-Biofuel, Inc., an agricultural company, cultivates non-food agricultural products in Southeast Asia. The company cultivates and sells castor beans for use in manufacturing processes, renewable energy, and transportation fuel. It has approximately 700 acres of land under cultivation in Northern Laos. Earth Gen-Biofuel, Inc. was founded in 2010 and is based in City of Industry, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "City of Industry",
        "zipcode": "91748",
        "website": "http://www.egbb.world",
        "market_cap": "Nano Cap"
    },
    "GFASY": {
        "short_name": "GAFISA SA UNSP ADR EACH REP 2 O",
        "long_name": "Gafisa S.A.",
        "summary": "Gafisa S.A. operates as a homebuilder under the Gafisa brand in Brazil. The company develops and sells residential units, such as luxury buildings with swimming pools, gyms, visitor parking, and other amenities for middle and upper-income customers; and entry-level buildings and house units. It also develops land subdivisions for sale; and provides construction, technical, and real estate management services to third parties. The company was incorporated in 1996 and is headquartered in SÃ£o Paulo, Brazil.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Brazil",
        "state": "SP",
        "city": "SÃ£o Paulo",
        "zipcode": "04543-900",
        "website": "http://www.gafisa.com.br",
        "market_cap": "Micro Cap"
    },
    "GFSA3.SA": {
        "short_name": "GAFISA      ON      NM",
        "long_name": "Gafisa S.A.",
        "summary": "Gafisa S.A. operates as a homebuilder under the Gafisa brand in Brazil. The company develops and sells residential units, such as luxury buildings with swimming pools, gyms, visitor parking, and other amenities for middle and upper-income customers; and entry-level buildings and house units. It also develops land subdivisions for sale; and provides construction, technical, and real estate management services to third parties. The company was incorporated in 1996 and is headquartered in SÃ£o Paulo, Brazil.",
        "currency": "BRL",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "state": "SP",
        "city": "SÃ£o Paulo",
        "zipcode": "04543-900",
        "website": "http://www.gafisa.com.br",
        "market_cap": "Micro Cap"
    },
    "GHUS-B.ST": {
        "short_name": "Gtenehus Group AB ser. B",
        "long_name": "Götenehus Group AB (publ)",
        "summary": "GÃ¶tenehus Group AB (publ) develops and constructs housing projects in Sweden. It constructs and markets individual, group built, and single-family houses. The company is based in GÃ¶tene, Sweden. GÃ¶tenehus Group AB (publ) is a subsidiary of Erik Hemberg Fastighets AB.",
        "currency": "SEK",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "state": null,
        "city": "GÃ¶tene",
        "zipcode": "533 21",
        "website": "http://www.gotenehus.com",
        "market_cap": "Micro Cap"
    },
    "GJ3A.SG": {
        "short_name": "Gafisa S.A. Reg. Shares (Sp.ADR",
        "long_name": "Gafisa S.A.",
        "summary": "Gafisa S.A. operates as a homebuilder under the Gafisa brand in Brazil. The company develops and sells residential units, such as luxury buildings with swimming pools, gyms, visitor parking, and other amenities for middle and upper-income customers; and entry-level buildings and house units. It also develops land subdivisions for sale; and provides construction, technical, and real estate management services to third parties. The company was incorporated in 1996 and is headquartered in SÃ£o Paulo, Brazil.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Brazil",
        "state": "SP",
        "city": "SÃ£o Paulo",
        "zipcode": "04543-900",
        "website": "http://www.gafisa.com.br",
        "market_cap": "Small Cap"
    },
    "GLV.L": {
        "short_name": "GLENVEAGH PROPERTIES PLC ORD EU",
        "long_name": "Glenveagh Properties PLC",
        "summary": "Glenveagh Properties PLC, a homebuilder, builds and sells houses and apartments for the private buyers and local authorities in the Greater Dublin Area, Ireland. The company operates through Glenveagh Homes and Glenveagh Living segments. It also designs, develops, and delivers residential solutions to institutional investors, social and affordable landlords, government entities, and strategic landowners; and provides property rental services. The company was founded in 2003 and is based in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.glenveagh.ie",
        "market_cap": "Small Cap"
    },
    "GRBK": {
        "short_name": "Green Brick Partners, Inc.",
        "long_name": "Green Brick Partners, Inc.",
        "summary": "Green Brick Partners, Inc. operates as a homebuilding and land development company in the United States. It operates in three segments: Builder operations Central, Builder operations Southeast, and Land development. The company is involved in the land acquisition and development, entitlements, design, construction, title and mortgage services, marketing, and sale of townhomes, patio homes, single family homes, and luxury semi-custom homes in residential neighborhoods and master planned communities; development and sale of lots; and land and construction financing business. It owns or controls approximately 14,500 home sites in Dallas-Forth Worth, Atlanta metropolitan areas, and the Treasure Coast, Florida market. The company sells its homes through sales representatives and independent real estate brokers. Green Brick Partners, Inc. was incorporated in 2006 and is based in Plano, Texas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Plano",
        "zipcode": "75093",
        "website": "http://greenbrickpartners.com",
        "market_cap": "Small Cap"
    },
    "GVR.IR": {
        "short_name": "GLENVEAGH PROP.PLC",
        "long_name": "Glenveagh Properties PLC",
        "summary": "Glenveagh Properties PLC, a homebuilder, builds and sells houses and apartments for the private buyers and local authorities in the Greater Dublin Area, Ireland. The company operates through Glenveagh Homes and Glenveagh Living segments. It also designs, develops, and delivers residential solutions to institutional investors, social and affordable landlords, government entities, and strategic landowners; and provides property rental services. The company was founded in 2003 and is based in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "ISE",
        "market": "ie_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.glenveagh.ie",
        "market_cap": "Small Cap"
    },
    "GVR.MU": {
        "short_name": "GLENVEAGH PROP.  EO -,001",
        "long_name": "Glenveagh Properties PLC",
        "summary": "Glenveagh Properties PLC, a homebuilder, builds and sells houses and apartments for the private buyers and local authorities in the Greater Dublin Area, Ireland. The company operates through Glenveagh Homes and Glenveagh Living segments. It also designs, develops, and delivers residential solutions to institutional investors, social and affordable landlords, government entities, and strategic landowners; and provides property rental services. The company was founded in 2003 and is based in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.glenveagh.ie",
        "market_cap": "Small Cap"
    },
    "H5E.DE": {
        "short_name": "HELMA EIGENHEIMBAU AG",
        "long_name": "HELMA Eigenheimbau Aktiengesellschaft",
        "summary": "HELMA Eigenheimbau Aktiengesellschaft provides a range of building services in Germany. The company operates through Building Services Business, Property Development Business, and Other segments. The Building Services Business segment engages in the development, planning, sale, and construction management of turnkey detached and semi-detached houses. The Property Development Business segment is involved in the development, planning, and sale of holiday homes and apartments. This segment also builds detached, semi-detached, and terraced houses; and constructs multi-storey residential buildings. The Other segment is involved in the broking business for building-related financing and insurance. HELMA Eigenheimbau Aktiengesellschaft was founded in 1980 and is based in Lehrte, Germany.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "GER",
        "market": "de_market",
        "country": "Germany",
        "state": null,
        "city": "Lehrte",
        "zipcode": "31275",
        "website": "http://www.helma.de",
        "market_cap": "Micro Cap"
    },
    "H5E.F": {
        "short_name": "HELMA EIGENHEIMBAU AG",
        "long_name": "HELMA Eigenheimbau Aktiengesellschaft",
        "summary": "HELMA Eigenheimbau Aktiengesellschaft provides a range of building services in Germany. The company operates through Building Services Business, Property Development Business, and Other segments. The Building Services Business segment engages in the development, planning, sale, and construction management of turnkey detached and semi-detached houses. The Property Development Business segment is involved in the development, planning, and sale of holiday homes and apartments. This segment also builds detached, semi-detached, and terraced houses; and constructs multi-storey residential buildings. The Other segment is involved in the broking business for building-related financing and insurance. HELMA Eigenheimbau Aktiengesellschaft was founded in 1980 and is based in Lehrte, Germany.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Germany",
        "state": null,
        "city": "Lehrte",
        "zipcode": "31275",
        "website": "http://www.helma.de",
        "market_cap": "Micro Cap"
    },
    "HCE.F": {
        "short_name": "HUSCOMPAGNIET A/S  DK 5",
        "long_name": "HusCompagniet A/S",
        "summary": "HusCompagniet A/S develops single-family detached houses in Denmark. The company designs, sells, and delivers customizable detached houses to consumers primarily built on-site on third-party customer-owned land; and semi-detached houses to consumers and professional investors. It also produces prefabricated wood-framed detached houses under the VÃ¥rgÃ¥rdaHus brand in Sweden. The company was incorporated in 2015 and is based in Horsens, Denmark.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Denmark",
        "state": null,
        "city": "Horsens",
        "zipcode": "8700",
        "website": "http://www.huscompagniet.dk",
        "market_cap": "Small Cap"
    },
    "HEXA.PA": {
        "short_name": "HEXAOM",
        "long_name": "Hexaom S.A.",
        "summary": "Hexaom S.A. engages in the home building and renovation, and home ownership businesses in France. It also provides home renovation, fitting, and improving services, as well as financing brokerage services. The company was founded in 1919 and is headquartered in AlenÃ§on, France.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "AlenÃ§on",
        "zipcode": "61001",
        "website": "http://www.hexaom.fr",
        "market_cap": "Small Cap"
    },
    "HO2.F": {
        "short_name": "D.R.HORTON INC.  DL-,01",
        "long_name": "D.R. Horton, Inc.",
        "summary": "D.R. Horton, Inc. operates as a homebuilding company in East, Midwest, Southeast, South Central, Southwest, and West regions in the United States. It engages in the acquisition and development of land; and construction and sale of homes in 29 states and 88 markets under the names of D.R. Horton, America's Builder, Express Homes, Emerald Homes, and Freedom Homes. The company constructs and sells single-family detached homes; and attached homes, such as town homes, duplexes, and triplexes. It also provides mortgage financing services; and title insurance policies, and examination and closing services, as well as engages in the residential lot development business. In addition, the company constructs and owns multi-family rental properties; owns residential real estate, including ranch land and improvements; and owns and operates oil and gas assets. The company primarily serves homebuyers. D.R. Horton, Inc. was founded in 1978 and is based in Arlington, Texas.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Arlington",
        "zipcode": "76011",
        "website": "http://www.drhorton.com",
        "market_cap": "Large Cap"
    },
    "HO3A.F": {
        "short_name": "HOVNANIAN ENTER. A DL-,01",
        "long_name": "Hovnanian Enterprises, Inc.",
        "summary": "Hovnanian Enterprises, Inc. engages in the design, construction, marketing, and sale of residential homes in the United States. It offers single-family detached homes, attached townhomes and condominiums, urban infill, and active lifestyle homes with amenities, such as club houses, swimming pools, tennis courts, tot lots, and open areas. The company markets and builds homes for first-time buyers, first-time and second-time move-up buyers, luxury buyers, active lifestyle buyers, and empty nesters. It also provides mortgage loans and title insurance services. The company was founded in 1959 and is headquartered in Matawan, New Jersey.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NJ",
        "city": "Matawan",
        "zipcode": "07747",
        "website": "http://www.khov.com",
        "market_cap": "Small Cap"
    },
    "HOME.MC": {
        "short_name": "NEINOR HOMES, S.A.",
        "long_name": "Neinor Homes, S.A.",
        "summary": "Neinor Homes, S.A., together with its subsidiaries, develops, promotes, rental, and manages real estate properties in Spain. The company operates through Legacy, Development, Assets Management-Servicing, and Rental segments. Its land portfolio consists of 160 lots with a total of 9.700 buildable units in Madrid, Catalonia, the Basque Country, Valencia, and Andalusia. Neinor Homes, S.A. was founded in 1988 and is headquartered in Bilbao, Spain.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "MCE",
        "market": "es_market",
        "country": "Spain",
        "state": null,
        "city": "Bilbao",
        "zipcode": null,
        "website": "http://www.neinorhomes.com",
        "market_cap": "Small Cap"
    },
    "HOMEX.MX": {
        "short_name": "DESARROLLADORA HOMEX SAB DE CV",
        "long_name": "Desarrolladora Homex, S.A.B. de C.V.",
        "summary": "Desarrolladora Homex, S.A.B. de C.V., develops homes in Mexico. The company was founded in 1989 and is headquartered in CuliacÃ¡n, Mexico.",
        "currency": "MXN",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Mexico",
        "state": "SI",
        "city": "CuliacÃ¡n",
        "zipcode": "80020",
        "website": "http://www.homex.com.mx",
        "market_cap": "Nano Cap"
    },
    "HONBS.HE": {
        "short_name": "Honkarakenne Oyj B",
        "long_name": "Honkarakenne Oyj",
        "summary": "Honkarakenne Oyj designs, manufactures, and sells log and solid wood building packages in Finland. The company offers contemporary log homes, log cabins and holiday lodges, custom log homes, traditional log homes, and saunas, as well as commercial developments, such as hotels, restaurants, and holiday villages. The company sells its houses under the Honka brand name. It also exports its products. The company was founded in 1958 and is headquartered in Karstula, Finland.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "state": null,
        "city": "Karstula",
        "zipcode": "43500",
        "website": "http://honka.com",
        "market_cap": "Micro Cap"
    },
    "HOV": {
        "short_name": "Hovnanian Enterprises, Inc.",
        "long_name": "Hovnanian Enterprises, Inc.",
        "summary": "Hovnanian Enterprises, Inc. engages in the design, construction, marketing, and sale of residential homes in the United States. It offers single-family detached homes, attached townhomes and condominiums, urban infill, and active lifestyle homes with amenities, such as club houses, swimming pools, tennis courts, tot lots, and open areas. The company markets and builds homes for first-time buyers, first-time and second-time move-up buyers, luxury buyers, active lifestyle buyers, and empty nesters. It also provides mortgage loans and title insurance services. The company was founded in 1959 and is headquartered in Matawan, New Jersey.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Matawan",
        "zipcode": "07747",
        "website": "http://www.khov.com",
        "market_cap": "Small Cap"
    },
    "HS6.F": {
        "short_name": "HASEKO CORP.",
        "long_name": "HASEKO Corporation",
        "summary": "HASEKO Corporation plans, designs, constructs, sells, renovates, and rents condominiums in Japan and internationally. The company operates through Construction-Related Business, Service-Related Business, and Overseas-Related Business segments. It is also involved in the real estate development, including for-sale housing and real estate, and condominium and apartment management operation and administration business; real estate brokerage, such as selling and buying, exchanging, leasing, and agency of real estate; purchase and resale comprising condominiums and other properties; and provision of real estate solutions that include asset management and project proposals, as well as consultation for use of land and real estate investment management and admiration of real estate. In addition, the company is involved in the for-sale condominium management business, which comprises monitoring, management and cleaning, maintenance, clerical, and life support; and rental condominium management and operation. Further, it provides large-scale repair, earthquake-resistant structure and facility renovation, environmental friendliness and energy saving renovation, value enhancement renovation, and remolding works, as well as condominium rehabilitation and building replacement services. Additionally, the company manages facilities for the elderly; and offers home nursing care, and senior living planning and consultation. It also provides interior enhancement services; and sells and leases construction materials. The company was founded in 1937 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8507",
        "website": "http://www.haseko.co.jp",
        "market_cap": "Mid Cap"
    },
    "HUSCO.CO": {
        "short_name": "HusCompagniet A/S",
        "long_name": "HusCompagniet A/S",
        "summary": "HusCompagniet A/S develops single-family detached houses in Denmark. The company designs, sells, and delivers customizable detached houses to consumers primarily built on-site on third-party customer-owned land; and semi-detached houses to consumers and professional investors. It also produces prefabricated wood-framed detached houses under the VÃ¥rgÃ¥rdaHus brand in Sweden. The company was incorporated in 2015 and is based in Horsens, Denmark.",
        "currency": "DKK",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "CPH",
        "market": "dk_market",
        "country": "Denmark",
        "state": null,
        "city": "Horsens",
        "zipcode": "8700",
        "website": "http://www.huscompagniet.dk",
        "market_cap": "Small Cap"
    },
    "IIO.SG": {
        "short_name": "IIDA Group Holdings Co. Ltd. Re",
        "long_name": "Iida Group Holdings Co., Ltd.",
        "summary": "Iida Group Holdings Co., Ltd. constructs and sells detached houses, and detached house condominiums in Japan. The company was founded in 1967 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.ighd.co.jp",
        "market_cap": "Mid Cap"
    },
    "JAVER.MX": {
        "short_name": "SERVICIOS CORPORATIVOS JAVER SA",
        "long_name": "Servicios Corporativos Javer, S.A.B. de C.V.",
        "summary": "Servicios Corporativos Javer, S.A.B. de C.V., together with its subsidiaries, operates as a housing developer in Mexico. The company engages in the construction and sale of social, middle income, and residential housings. It operates in the states of Nuevo Leon, Jalisco, QuerÃ©taro, Aguascalientes, Tamaulipas, and Quintana Roo, as well as in State of Mexico. The company was founded in 1973 and is headquartered in Monterrey, Mexico.",
        "currency": "MXN",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Mexico",
        "state": "NL",
        "city": "Monterrey",
        "zipcode": "64000",
        "website": "http://www.javer.com.mx",
        "market_cap": "Micro Cap"
    },
    "JM.ST": {
        "short_name": "JM AB",
        "long_name": "JM AB (publ)",
        "summary": "JM AB (publ) develops and sells housing and residential areas in the Nordic region. The company operates in five segments: JM Residential Stockholm, JM Residential Sweden, JM International, JM Property Development, and JM Construction. It is involved in the acquisition of development properties; planning, pre-construction, production, management, and sale of residential units; development of rental housing, residential care facilities, and commercial properties; and contract works primarily in the Greater Stockholm area. The company was founded in 1945 and is headquartered in Solna, Sweden.",
        "currency": "SEK",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "state": null,
        "city": "Solna",
        "zipcode": "169 82",
        "website": "http://www.jm.se",
        "market_cap": "Mid Cap"
    },
    "JMM.F": {
        "short_name": "JM AB",
        "long_name": "JM AB (publ)",
        "summary": "JM AB (publ) develops and sells housing and residential areas in the Nordic region. The company operates in five segments: JM Residential Stockholm, JM Residential Sweden, JM International, JM Property Development, and JM Construction. It is involved in the acquisition of development properties; planning, pre-construction, production, management, and sale of residential units; development of rental housing, residential care facilities, and commercial properties; and contract works primarily in the Greater Stockholm area. The company was founded in 1945 and is headquartered in Solna, Sweden.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Sweden",
        "state": null,
        "city": "Solna",
        "zipcode": "169 82",
        "website": "http://www.jm.se",
        "market_cap": "Mid Cap"
    },
    "KALD.IC": {
        "short_name": null,
        "long_name": "Kaldalón hf.",
        "summary": "KaldalÃ³n hf. operates as a real estate development company in Iceland. It engages in the construction of residential real estate projects. The company is based in ReykjavÃ­k, Iceland.",
        "currency": "ISK",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "ICE",
        "market": "ic_market",
        "country": "Iceland",
        "state": null,
        "city": "ReykjavÃ­k",
        "zipcode": "105",
        "website": "http://kaldalon.is"
    },
    "KBAG.JK": {
        "short_name": "Karya Bersama Anugerah Tbk.",
        "long_name": "PT Karya Bersama Anugerah Tbk",
        "summary": "PT Karya Bersama Anugerah Tbk engages in the real estate development business. It constructs Rusunami dwellings, landed houses, and shop-houses. The company was founded in 2014 and is headquartered in Balikpapan, Indonesia. PT Karya Bersama Anugerah Tbk is a subsidiary of PT Visi Kota Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Balikpapan",
        "zipcode": "76114",
        "website": "http://www.kbag.co.id",
        "market_cap": "Nano Cap"
    },
    "KBH.F": {
        "short_name": "KB HOME  DL 1",
        "long_name": "KB Home",
        "summary": "KB Home operates as a homebuilding company in the United States. It operates through four segments: West Coast, Southwest, Central, and Southeast. It builds and sells various homes, including attached and detached single-family residential homes, townhomes, and condominiums primarily for first-time, first move-up, second move-up, and active adult homebuyers. The company also offers financial services, such as insurance products and title services. It has operations in Arizona, California, Colorado, Florida, Nevada, North Carolina, Texas, and Washington. The company was formerly known as Kaufman and Broad Home Corporation and changed its name to KB Home in January 2001. KB Home was founded in 1957 and is headquartered in Los Angeles, California.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Angeles",
        "zipcode": "90024",
        "website": "http://www.kbhome.com",
        "market_cap": "Mid Cap"
    },
    "KBH.MX": {
        "short_name": "KB HOME",
        "long_name": "KB Home",
        "summary": "KB Home operates as a homebuilding company in the United States. It operates through four segments: West Coast, Southwest, Central, and Southeast. It builds and sells various homes, including attached and detached single-family residential homes, townhomes, and condominiums primarily for first-time, first move-up, second move-up, and active adult homebuyers. The company also offers financial services, such as insurance products and title services. It has operations in Arizona, California, Colorado, Florida, Nevada, North Carolina, Texas, and Washington. The company was formerly known as Kaufman and Broad Home Corporation and changed its name to KB Home in January 2001. KB Home was founded in 1957 and is headquartered in Los Angeles, California.",
        "currency": "MXN",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Angeles",
        "zipcode": "90024",
        "website": "http://www.kbhome.com",
        "market_cap": "Mid Cap"
    },
    "KBH": {
        "short_name": "KB Home",
        "long_name": "KB Home",
        "summary": "KB Home operates as a homebuilding company in the United States. It operates through four segments: West Coast, Southwest, Central, and Southeast. It builds and sells various homes, including attached and detached single-family residential homes, townhomes, and condominiums primarily for first-time, first move-up, second move-up, and active adult homebuyers. The company also offers financial services, such as insurance products and title services. It has operations in Arizona, California, Colorado, Florida, Nevada, North Carolina, Texas, and Washington. The company was formerly known as Kaufman and Broad Home Corporation and changed its name to KB Home in January 2001. KB Home was founded in 1957 and is headquartered in Los Angeles, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Angeles",
        "zipcode": "90024",
        "website": "http://www.kbhome.com",
        "market_cap": "Mid Cap"
    },
    "KOF.PA": {
        "short_name": "KAUFMAN ET BROAD",
        "long_name": "Kaufman & Broad S.A.",
        "summary": "Kaufman & Broad S.A. operates as a property developer and builder in France. It develops and builds single-family homes and apartments, as well as offices, hotels, retail spaces, business premises, and logistics warehouses. The company was founded in 1968 and is based in Neuilly-sur-Seine, France.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "Neuilly-sur-Seine",
        "zipcode": "92207",
        "website": "http://www.kaufmanbroad.fr",
        "market_cap": "Small Cap"
    },
    "KWG.BK": {
        "short_name": "KING WAI GROUP (THAILAND) PUBLI",
        "long_name": "King Wai Group (Thailand) Public Company Limited",
        "summary": "King Wai Group (Thailand) Public Company Limited, together with its subsidiaries, engages in the property development business in Thailand. It operates through three segments: Real Estate Business, Rental and Service Business, and Non-Life Insurance Business. The company develops residential housing and condominium projects; and provides non-life insurance products, property management and agency services, advertising and marketing services, and rental and other services for its office space. It is also involved in the construction and trading activities. The company was formerly known as Keppel Thai Properties Public Company Limited and changed its name to King Wai Group (Thailand) Public Company Limited in June 2016. King Wai Group (Thailand) Public Company Limited was founded in 1981 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10500",
        "website": "http://www.kwgthai.com",
        "market_cap": "Micro Cap"
    },
    "L1EN34.SA": {
        "short_name": "LENNAR CORP DRN",
        "long_name": "Lennar Corporation",
        "summary": "Lennar Corporation, together with its subsidiaries, operates as a homebuilder primarily under the Lennar brand in the United States. It operates through Homebuilding East, Homebuilding Central, Homebuilding Texas, Homebuilding West, Financial Services, Multifamily, and Lennar Other segments. The company's homebuilding operations include the construction and sale of single-family attached and detached homes, as well as the purchase, development, and sale of residential land. It primarily sells single-family attached and detached homes in communities targeted to first-time, move-up, active adult, and luxury homebuyers. The company also offers residential mortgage financing, title insurance, and closing services for home buyers and others. In addition, it involves in the fund investment activity; and originates and sells into securitizations commercial mortgage loans. Further, the company develops, constructs, and manages multifamily rental properties. Lennar Corporation was founded in 1954 and is based in Miami, Florida.",
        "currency": "BRL",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "FL",
        "city": "Miami",
        "zipcode": "33172",
        "website": "http://www.lennar.com",
        "market_cap": "Large Cap"
    },
    "LEGH": {
        "short_name": "Legacy Housing Corporation",
        "long_name": "Legacy Housing Corporation",
        "summary": "Legacy Housing Corporation builds, sells, and finances manufactured homes and tiny houses primarily in the southern United States. The company manufactures and provides for the transport of mobile homes; and offers wholesale financing to dealers and mobile home parks, as well as a range of homes, including 1 to 5 bedrooms with 1 to 3 1/2 bathrooms. It also provides floor plan or wholesale financing for independent retailers; consumer financing for its products; and financing to manufactured housing community owners that buy its products for use in their rental housing communities. The company markets its homes under the Legacy brand through a network of 100 independent and 13 company-owned retail locations, as well as direct sales to owners of manufactured home communities in 15 states in the United States. Legacy Housing Corporation was founded in 2005 and is headquartered in Bedford, Texas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Bedford",
        "zipcode": "76022",
        "website": "http://www.legacyhousingcorp.com",
        "market_cap": "Small Cap"
    },
    "LEN-B": {
        "short_name": "Lennar Corporation",
        "long_name": "Lennar Corporation",
        "summary": "Lennar Corporation, together with its subsidiaries, operates as a homebuilder primarily under the Lennar brand in the United States. It operates through Homebuilding East, Homebuilding Central, Homebuilding Texas, Homebuilding West, Financial Services, Multifamily, and Lennar Other segments. The company's homebuilding operations include the construction and sale of single-family attached and detached homes, as well as the purchase, development, and sale of residential land. It primarily sells single-family attached and detached homes in communities targeted to first-time, move-up, active adult, and luxury homebuyers. The company also offers residential mortgage financing, title insurance, and closing services for home buyers and others. In addition, it involves in the fund investment activity; and originates and sells into securitizations commercial mortgage loans. Further, the company develops, constructs, and manages multifamily rental properties. Lennar Corporation was founded in 1954 and is based in Miami, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Miami",
        "zipcode": "33172",
        "website": "http://www.lennar.com",
        "market_cap": "Large Cap"
    },
    "LEN.MX": {
        "short_name": "LENNAR CORP",
        "long_name": "Lennar Corporation",
        "summary": "Lennar Corporation, together with its subsidiaries, operates as a homebuilder primarily under the Lennar brand in the United States. It operates through Homebuilding East, Homebuilding Central, Homebuilding Texas, Homebuilding West, Financial Services, Multifamily, and Lennar Other segments. The company's homebuilding operations include the construction and sale of single-family attached and detached homes, as well as the purchase, development, and sale of residential land. It primarily sells single-family attached and detached homes in communities targeted to first-time, move-up, active adult, and luxury homebuyers. The company also offers residential mortgage financing, title insurance, and closing services for home buyers and others. In addition, it involves in the fund investment activity; and originates and sells into securitizations commercial mortgage loans. Further, the company develops, constructs, and manages multifamily rental properties. Lennar Corporation was founded in 1954 and is based in Miami, Florida.",
        "currency": "MXN",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "FL",
        "city": "Miami",
        "zipcode": "33172",
        "website": "http://www.lennar.com",
        "market_cap": "Large Cap"
    },
    "LEN": {
        "short_name": "Lennar Corporation",
        "long_name": "Lennar Corporation",
        "summary": "Lennar Corporation, together with its subsidiaries, operates as a homebuilder primarily under the Lennar brand in the United States. It operates through Homebuilding East, Homebuilding Central, Homebuilding Texas, Homebuilding West, Financial Services, Multifamily, and Lennar Other segments. The company's homebuilding operations include the construction and sale of single-family attached and detached homes, as well as the purchase, development, and sale of residential land. It primarily sells single-family attached and detached homes in communities targeted to first-time, move-up, active adult, and luxury homebuyers. The company also offers residential mortgage financing, title insurance, and closing services for home buyers and others. In addition, it involves in the fund investment activity; and originates and sells into securitizations commercial mortgage loans. Further, the company develops, constructs, and manages multifamily rental properties. Lennar Corporation was founded in 1954 and is based in Miami, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Miami",
        "zipcode": "33172",
        "website": "http://www.lennar.com",
        "market_cap": "Large Cap"
    },
    "LG1.F": {
        "short_name": "LGI HOMES INC.  DL-,01",
        "long_name": "LGI Homes, Inc.",
        "summary": "LGI Homes, Inc. designs, constructs, and sells homes in the United States. It offers entry-level homes, such as detached and attached homes, and move-up homes under the LGI Homes brand name; and luxury series homes under the Terrata Homes brand name. As of December 31, 2020, it owned 113 communities. The company serves in Texas, Arizona, Florida, Georgia, New Mexico, Colorado, North Carolina, South Carolina, Washington, Tennessee, Minnesota, Oklahoma, Alabama, California, Oregon, Nevada, West Virginia, Virginia, and Pennsylvania. LGI Homes, Inc. was founded in 2003 and is headquartered in The Woodlands, Texas.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "The Woodlands",
        "zipcode": "77380",
        "website": "http://www.lgihomes.com",
        "market_cap": "Mid Cap"
    },
    "LGIH": {
        "short_name": "LGI Homes, Inc.",
        "long_name": "LGI Homes, Inc.",
        "summary": "LGI Homes, Inc. designs, constructs, and sells homes in the United States. It offers entry-level homes, such as detached and attached homes, and move-up homes under the LGI Homes brand name; and luxury series homes under the Terrata Homes brand name. As of December 31, 2020, it owned 113 communities. The company serves in Texas, Arizona, Florida, Georgia, New Mexico, Colorado, North Carolina, South Carolina, Washington, Tennessee, Minnesota, Oklahoma, Alabama, California, Oregon, Nevada, West Virginia, Virginia, and Pennsylvania. LGI Homes, Inc. was founded in 2003 and is headquartered in The Woodlands, Texas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "The Woodlands",
        "zipcode": "77380",
        "website": "http://www.lgihomes.com",
        "market_cap": "Mid Cap"
    },
    "LNN.F": {
        "short_name": "LENNAR CORP.A  DL-,10",
        "long_name": "Lennar Corporation",
        "summary": "Lennar Corporation, together with its subsidiaries, operates as a homebuilder primarily under the Lennar brand in the United States. It operates through Homebuilding East, Homebuilding Central, Homebuilding Texas, Homebuilding West, Financial Services, Multifamily, and Lennar Other segments. The company's homebuilding operations include the construction and sale of single-family attached and detached homes, as well as the purchase, development, and sale of residential land. It primarily sells single-family attached and detached homes in communities targeted to first-time, move-up, active adult, and luxury homebuyers. The company also offers residential mortgage financing, title insurance, and closing services for home buyers and others. In addition, it involves in the fund investment activity; and originates and sells into securitizations commercial mortgage loans. Further, the company develops, constructs, and manages multifamily rental properties. Lennar Corporation was founded in 1954 and is based in Miami, Florida.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "FL",
        "city": "Miami",
        "zipcode": "33172",
        "website": "http://www.lennar.com",
        "market_cap": "Large Cap"
    },
    "LNN0.F": {
        "short_name": "LENNAR CORP. B  DL-,10",
        "long_name": "Lennar Corporation",
        "summary": "Lennar Corporation, together with its subsidiaries, operates as a homebuilder primarily under the Lennar brand in the United States. It operates through Homebuilding East, Homebuilding Central, Homebuilding Texas, Homebuilding West, Financial Services, Multifamily, and Lennar Other segments. The company's homebuilding operations include the construction and sale of single-family attached and detached homes, as well as the purchase, development, and sale of residential land. It primarily sells single-family attached and detached homes in communities targeted to first-time, move-up, active adult, and luxury homebuyers. The company also offers residential mortgage financing, title insurance, and closing services for home buyers and others. In addition, it involves in the fund investment activity; and originates and sells into securitizations commercial mortgage loans. Further, the company develops, constructs, and manages multifamily rental properties. Lennar Corporation was founded in 1954 and is based in Miami, Florida.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "FL",
        "city": "Miami",
        "zipcode": "33172",
        "website": "http://www.lennar.com",
        "market_cap": "Large Cap"
    },
    "MDC": {
        "short_name": "M.D.C. Holdings, Inc.",
        "long_name": "M.D.C. Holdings, Inc.",
        "summary": "M.D.C. Holdings, Inc., through its subsidiaries, engages in the homebuilding and financial service businesses. Its homebuilding operations include purchasing finished lots or developing lots for the construction and sale primarily of single-family detached homes to first-time and first-time move-up homebuyers under the Richmond American Homes name. The company conducts its homebuilding operations in Arizona, California, Nevada, Washington, Oregon, Colorado, Utah, Virginia, Maryland, and Florida. Its financial services operations comprise originating mortgage loans primarily for homebuyers; providing insurance coverage primarily to its homebuilding subsidiaries and subcontractors for homes sold by its homebuilding subsidiaries, and for work performed in completed subdivisions; acting as a re-insurer on the claims; selling third-party personal property and casualty insurance products to homebuyers; and offering title agency services to homebuilding subsidiaries and customers in Colorado, Florida, Maryland, Nevada, and Virginia. M.D.C. Holdings, Inc. was founded in 1972 and is headquartered in Denver, Colorado.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Denver",
        "zipcode": "80237",
        "website": "http://www.mdcholdings.com",
        "market_cap": "Mid Cap"
    },
    "MDH.F": {
        "short_name": "M.D.C. HLDGS  DL -,01",
        "long_name": "M.D.C. Holdings, Inc.",
        "summary": "M.D.C. Holdings, Inc., through its subsidiaries, engages in the homebuilding and financial service businesses. Its homebuilding operations include purchasing finished lots or developing lots for the construction and sale primarily of single-family detached homes to first-time and first-time move-up homebuyers under the Richmond American Homes name. The company conducts its homebuilding operations in Arizona, California, Nevada, Washington, Oregon, Colorado, Utah, Virginia, Maryland, and Florida. Its financial services operations comprise originating mortgage loans primarily for homebuyers; providing insurance coverage primarily to its homebuilding subsidiaries and subcontractors for homes sold by its homebuilding subsidiaries, and for work performed in completed subdivisions; acting as a re-insurer on the claims; selling third-party personal property and casualty insurance products to homebuyers; and offering title agency services to homebuilding subsidiaries and customers in Colorado, Florida, Maryland, Nevada, and Virginia. M.D.C. Holdings, Inc. was founded in 1972 and is headquartered in Denver, Colorado.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CO",
        "city": "Denver",
        "zipcode": "80237",
        "website": "http://www.mdcholdings.com",
        "market_cap": "Mid Cap"
    },
    "MEY.F": {
        "short_name": "MERITAGE HOMES  DL-,01",
        "long_name": "Meritage Homes Corporation",
        "summary": "Meritage Homes Corporation designs and builds single-family homes in the United States. The company operates through two segments, Homebuilding and Financial Services. It acquires and develops land; and constructs, markets, and sells homes for first-time and first move-up buyers. The company also offers title insurance and closing/settlement services to its homebuyers. It builds and sells homes in Texas, Arizona, California, Colorado, Florida, North Carolina, South Carolina, Georgia, and Tennessee under the Meritage Homes brand name. Meritage Homes Corporation was founded in 1985 and is based in Scottsdale, Arizona.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "AZ",
        "city": "Scottsdale",
        "zipcode": "85260",
        "website": "http://www.meritagehomes.com",
        "market_cap": "Mid Cap"
    },
    "MHO": {
        "short_name": "M/I Homes, Inc.",
        "long_name": "M/I Homes, Inc.",
        "summary": "M/I Homes, Inc., together with its subsidiaries, operates as a builder of single-family homes in Ohio, Indiana, Illinois, Michigan, Minnesota, North Carolina, Florida, and Texas, the United States. The company operates through Northern Homebuilding, Southern Homebuilding, and Financial Services segments. It designs, constructs, markets, and sells single-family homes and attached townhomes to first-time, millennial, move-up, empty-nester, and luxury buyers under the M/I Homes brand name. The company also purchases undeveloped land to develop into developed lots for the construction of single-family homes, as well as for sale to others. In addition, it originates and sells mortgages; and serves as a title insurance agent by providing title insurance policies, examination, and closing services to purchasers of its homes. The company was formerly known as M/I Schottenstein Homes, Inc. and changed its name to M/I Homes, Inc. in January 2004. M/I Homes, Inc. was founded in 1976 and is based in Columbus, Ohio.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Columbus",
        "zipcode": "43219-6011",
        "website": "http://www.mihomes.com",
        "market_cap": "Mid Cap"
    },
    "MLMAI.PA": {
        "short_name": "MAISONS D''AUJOURD",
        "long_name": "Maisons D'aujourd'hui",
        "summary": "Maisons D'aujourd'hui engages in the construction and sale of single-family homes and low-energy houses in France. It primarily operates in Paris, Ile de France, Nord-Pas-de-Calais, Picardie, and Champagne Ardennes. The company has strategic alliances with CrÃ©dit Immobilier de France, CrÃ©dit Foncier, Groupe Modap, Simpa, PRB, Cyclo Vac, CheminÃ©es Poujoulat, Atlantis, Wienerberger, Point.P, La Plateforme du Batiment, Terreal, Aldes, EDF Bleu Ciel, Verspieren, Aviva, and HCC. Les Maisons d'Aujourd'hui is headquartered in Paris, France.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "Paris",
        "zipcode": "75008",
        "website": "http://www.maisonsdaujourdhui.fr",
        "market_cap": null
    },
    "MLNAT.PA": {
        "short_name": "NATURE ET LOGIS",
        "long_name": "Nature et Logis SA",
        "summary": "Nature et Logis SA operates as a builder of ecological houses. The company is based in Saint-Pavace, France.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "Saint-Pavace",
        "zipcode": "72190",
        "website": "http://www.natureetlogis.fr",
        "market_cap": "Nano Cap"
    },
    "MRVE3.SA": {
        "short_name": "MRV         ON      NM",
        "long_name": "MRV Engenharia e Participações S.A.",
        "summary": "MRV Engenharia e ParticipaÃ§Ãµes S.A., together with its subsidiaries, operates as a homebuilder in Brazil. The company operates in three segments: Real Estate Development, Urban Land Subdivisions, and Rental of Residential Real Estate. It develops, constructs, and sells company owned and third-party real estate properties; and provision of technical engineering services. The company is also involved in the development and sale of residential and commercial urban land subdivisions; and rents residential properties near urban centers. MRV Engenharia e ParticipaÃ§Ãµes S.A. was founded in 1979 and is headquartered in Belo Horizonte, Brazil.",
        "currency": "BRL",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "state": "MG",
        "city": "Belo Horizonte",
        "zipcode": "30455-610",
        "website": "http://www.mrv.com.br",
        "market_cap": "Small Cap"
    },
    "MS6N.F": {
        "short_name": "METROVACESA S.A.  EO 7,2",
        "long_name": "Metrovacesa S.A.",
        "summary": "Metrovacesa S.A. operates as a real estate development company in Spain. It develops and sells residential properties, which include one-family, multi-family, and semi-detached and detached houses; and commercial properties, as well as sells land. The company was formerly known as Metrovacesa Suelo y PromociÃ³n, S.A. and changed its name to Metrovacesa, S.A. in November 2017. Metrovacesa S.A. was founded in 1918 and is headquartered in Madrid, Spain.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Spain",
        "state": null,
        "city": "Madrid",
        "zipcode": "28050",
        "website": "http://www.metrovacesa.com",
        "market_cap": "Small Cap"
    },
    "MTH": {
        "short_name": "Meritage Homes Corporation",
        "long_name": "Meritage Homes Corporation",
        "summary": "Meritage Homes Corporation designs and builds single-family homes in the United States. The company operates through two segments, Homebuilding and Financial Services. It acquires and develops land; and constructs, markets, and sells homes for first-time and first move-up buyers. The company also offers title insurance and closing/settlement services to its homebuyers. It builds and sells homes in Texas, Arizona, California, Colorado, Florida, North Carolina, South Carolina, Georgia, and Tennessee under the Meritage Homes brand name. Meritage Homes Corporation was founded in 1985 and is based in Scottsdale, Arizona.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Scottsdale",
        "zipcode": "85260",
        "website": "http://www.meritagehomes.com",
        "market_cap": "Mid Cap"
    },
    "MVC.MC": {
        "short_name": "METROVACESA, S.A.",
        "long_name": "Metrovacesa S.A.",
        "summary": "Metrovacesa S.A. operates as a real estate development company in Spain. It develops and sells residential properties, which include one-family, multi-family, and semi-detached and detached houses; and commercial properties, as well as sells land. The company was formerly known as Metrovacesa Suelo y PromociÃ³n, S.A. and changed its name to Metrovacesa, S.A. in November 2017. Metrovacesa S.A. was founded in 1918 and is headquartered in Madrid, Spain.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "MCE",
        "market": "es_market",
        "country": "Spain",
        "state": null,
        "city": "Madrid",
        "zipcode": "28050",
        "website": "http://www.metrovacesa.com",
        "market_cap": "Small Cap"
    },
    "N1VR34.SA": {
        "short_name": "NVR INC     DRN",
        "long_name": "NVR, Inc.",
        "summary": "NVR, Inc. operates as a homebuilder in the United States. The company operates in two segments, Homebuilding and Mortgage Banking. It primarily constructs and sells single-family detached homes, townhomes, and condominium buildings under the Ryan Homes, NVHomes, and Heartland Homes names. The company markets its Ryan Homes products to first-time and first-time move-up buyers, and NVHomes and Heartland Homes products to move-up and luxury buyers. It also provides various mortgage-related services to its homebuilding customers, as well as brokers title insurance and performs title searches in connection with mortgage loan closings. The company primarily serves in Maryland, Virginia, West Virginia, Delaware, New Jersey, Eastern Pennsylvania, New York, Ohio, Western Pennsylvania, Indiana, Illinois, North Carolina, South Carolina, Florida, Tennessee, and Washington, D.C. The company was founded in 1980 and is headquartered in Reston, Virginia.",
        "currency": "BRL",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "VA",
        "city": "Reston",
        "zipcode": "20190",
        "website": "http://www.nvrinc.com",
        "market_cap": "Large Cap"
    },
    "NH6.F": {
        "short_name": "NEW HOME CO. INC. DL -,01",
        "long_name": "The New Home Company Inc.",
        "summary": "The New Home Company Inc. designs, constructs, and sells single-family detached and attached homes. The company operates through three segments: Arizona Homebuilding, California Homebuilding, and Fee Building. It builds and sells homes in metropolitan areas of California and Arizona, including Southern California, the San Francisco Bay area, metro Sacramento, and the greater Phoenix area; and Denver, Colorado. The company also offers general contracting, construction management and coordination, and escrow coordination services, as well as sales and marketing services to build homes for third-party property owners. The New Home Company Inc. was founded in 2009 and is headquartered in Irvine, California.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Irvine",
        "zipcode": "92618",
        "website": "http://www.nwhm.com",
        "market_cap": "Micro Cap"
    },
    "NOBH": {
        "short_name": "NOBILITY HOMES INC",
        "long_name": "Nobility Homes, Inc.",
        "summary": "Nobility Homes, Inc. designs, manufactures, and sells various manufactured and modular homes in Florida. It markets its homes under the Kingswood, Richwood, Tropic Isle, Regency Manor, and Tropic Manor trade names. The company sells its manufactured homes through a network of its own retail sales centers; and on a wholesale basis to independent manufactured home retail dealers and manufactured home communities. In addition, it offers retail insurance services, which involve placing various types of insurance, such as property and casualty, automobile, and extended home warranty coverage with insurance underwriters on behalf of its customers in connection with their purchase and financing of manufactured homes, as well as operates as a licensed mortgage loan originator. As of October 31, 2020, the company operated 10 retail sales centers in Ocala, Chiefland, Auburndale, Inverness, Hudson, Tavares, Yulee, Panama City, and Punta Gorda. Nobility Homes, Inc. was founded in 1967 and is headquartered in Ocala, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Ocala",
        "zipcode": "34474",
        "website": "http://www.nobilityhomes.com",
        "market_cap": "Micro Cap"
    },
    "NVE.F": {
        "short_name": "NVR INC.  DL-,01",
        "long_name": "NVR, Inc.",
        "summary": "NVR, Inc. operates as a homebuilder in the United States. The company operates in two segments, Homebuilding and Mortgage Banking. It primarily constructs and sells single-family detached homes, townhomes, and condominium buildings under the Ryan Homes, NVHomes, and Heartland Homes names. The company markets its Ryan Homes products to first-time and first-time move-up buyers, and NVHomes and Heartland Homes products to move-up and luxury buyers. It also provides various mortgage-related services to its homebuilding customers, as well as brokers title insurance and performs title searches in connection with mortgage loan closings. The company primarily serves in Maryland, Virginia, West Virginia, Delaware, New Jersey, Eastern Pennsylvania, New York, Ohio, Western Pennsylvania, Indiana, Illinois, North Carolina, South Carolina, Florida, Tennessee, and Washington, D.C. The company was founded in 1980 and is headquartered in Reston, Virginia.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "VA",
        "city": "Reston",
        "zipcode": "20190",
        "website": "http://www.nvrinc.com",
        "market_cap": "Large Cap"
    },
    "NVR": {
        "short_name": "NVR, Inc.",
        "long_name": "NVR, Inc.",
        "summary": "NVR, Inc. operates as a homebuilder in the United States. The company operates in two segments, Homebuilding and Mortgage Banking. It primarily constructs and sells single-family detached homes, townhomes, and condominium buildings under the Ryan Homes, NVHomes, and Heartland Homes names. The company markets its Ryan Homes products to first-time and first-time move-up buyers, and NVHomes and Heartland Homes products to move-up and luxury buyers. It also provides various mortgage-related services to its homebuilding customers, as well as brokers title insurance and performs title searches in connection with mortgage loan closings. The company primarily serves in Maryland, Virginia, West Virginia, Delaware, New Jersey, Eastern Pennsylvania, New York, Ohio, Western Pennsylvania, Indiana, Illinois, North Carolina, South Carolina, Florida, Tennessee, and Washington, D.C. The company was founded in 1980 and is headquartered in Reston, Virginia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Reston",
        "zipcode": "20190",
        "website": "http://www.nvrinc.com",
        "market_cap": "Large Cap"
    },
    "NWHM": {
        "short_name": "New Home Company Inc. (The)",
        "long_name": "The New Home Company Inc.",
        "summary": "The New Home Company Inc. designs, constructs, and sells single-family detached and attached homes. The company operates through three segments: Arizona Homebuilding, California Homebuilding, and Fee Building. It builds and sells homes in metropolitan areas of California and Arizona, including Southern California, the San Francisco Bay area, metro Sacramento, and the greater Phoenix area; and Denver, Colorado. The company also offers general contracting, construction management and coordination, and escrow coordination services, as well as sales and marketing services to build homes for third-party property owners. The New Home Company Inc. was founded in 2009 and is headquartered in Irvine, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Irvine",
        "zipcode": "92618",
        "website": "http://www.nwhm.com",
        "market_cap": "Micro Cap"
    },
    "OHP.F": {
        "short_name": "PERSIMMON PLC  LS-,10",
        "long_name": "Persimmon Plc",
        "summary": "Persimmon Plc, together with its subsidiaries, operates as a house builder in the United Kingdom. The company offers family housing under the Persimmon Homes brand name; executive housing under the Charles Church brand; and social housing under the Westbury Partnerships brand name. It also provides broadband services. The company was founded in 1972 and is headquartered in York, the United Kingdom.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "York",
        "zipcode": "YO19 4FE",
        "website": "http://www.persimmonhomes.com",
        "market_cap": "Large Cap"
    },
    "OP-PREF.ST": {
        "short_name": "Oscar Properties Holding AB PRE",
        "long_name": "Oscar Properties Holding AB (publ)",
        "summary": "Oscar Properties Holding AB (publ) acquires, develops, and markets real estate properties in Stockholm. The company develops homes through new build developments, as well as through the conversion of former industrial, office, school, factory, post office, and other buildings. It also provides property management services. Oscar Properties Holding AB (publ) was founded in 2004 and is based in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "state": null,
        "city": "Stockholm",
        "zipcode": "102 43",
        "website": "http://oscarproperties.com",
        "market_cap": "Micro Cap"
    },
    "OP-PREFB.ST": {
        "short_name": "Oscar Properties Holding AB PRE",
        "long_name": "Oscar Properties Holding AB (publ)",
        "summary": "Oscar Properties Holding AB (publ) acquires, develops, and markets real estate properties in Stockholm. The company develops homes through new build developments, as well as through the conversion of former industrial, office, school, factory, post office, and other buildings. It also provides property management services. Oscar Properties Holding AB (publ) was founded in 2004 and is based in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "state": null,
        "city": "Stockholm",
        "zipcode": "102 43",
        "website": "http://oscarproperties.com",
        "market_cap": "Nano Cap"
    },
    "OP.ST": {
        "short_name": "Oscar Properties Holding AB",
        "long_name": "Oscar Properties Holding AB (publ)",
        "summary": "Oscar Properties Holding AB (publ) acquires, develops, and markets real estate properties in Stockholm. The company develops homes through new build developments, as well as through the conversion of former industrial, office, school, factory, post office, and other buildings. It also provides property management services. Oscar Properties Holding AB (publ) was founded in 2004 and is based in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "state": null,
        "city": "Stockholm",
        "zipcode": "102 43",
        "website": "http://oscarproperties.com",
        "market_cap": "Micro Cap"
    },
    "P1HM34.SA": {
        "short_name": "PULTEGROUP IDRN",
        "long_name": "PulteGroup, Inc.",
        "summary": "PulteGroup, Inc., through its subsidiaries, primarily engages in the homebuilding business in the United States. The company acquires and develops land primarily for residential purposes; and constructs housing on such land. It offers various home designs, including single-family detached, townhouses, condominiums, and duplexes under the Centex, Pulte Homes, Del Webb, DiVosta Homes, American West, and John Wieland Homes and Neighborhoods brand names. As of December 31, 2020, the company controlled 180,352 lots, of which 91,363 were owned and 88,989 were under land option agreements. It also arranges financing through the origination of mortgage loans primarily for homebuyers; sells the servicing rights for the originated loans; and provides title insurance policies, and examination and closing services to homebuyers. The company was formerly known as Pulte Homes, Inc. and changed its name to PulteGroup, Inc. in March 2010. PulteGroup, Inc. was founded in 1950 and is headquartered in Atlanta, Georgia.",
        "currency": "BRL",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30326",
        "website": "http://www.pultegroup.com",
        "market_cap": "Large Cap"
    },
    "P9R.F": {
        "short_name": "PRIMAG AG",
        "long_name": "Primag AG",
        "summary": "Primag AG operates as a residential real estate development company in Germany. The company engages in the identification, acquisition, planning, development, and sale of various residential properties to long-term oriented self-users or investors. It develops luxury apartments and town house villas, as well as renovates old buildings primarily in Dusseldorf. The company was founded in 1998 and is based in DÃ¼sseldorf, Germany.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Germany",
        "state": null,
        "city": "Dusseldorf",
        "zipcode": "40547",
        "website": "http://www.primag.de",
        "market_cap": "Nano Cap"
    },
    "PEAN.SW": {
        "short_name": "Peach Property N",
        "long_name": "Peach Property Group AG",
        "summary": "Peach Property Group AG engages in investment and development of residential real estate properties in Germany and Switzerland. It is involved in the property acquisition, location evaluation, asset management, and sale or lease of properties. The company's property portfolio comprises 23, 200 apartments in Germany and the greater Zurich region. Peach Property Group AG is headquartered in ZÃ¼rich, Switzerland.",
        "currency": "CHF",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Zurich",
        "zipcode": "8032",
        "website": "http://www.peachproperty.com",
        "market_cap": "Small Cap"
    },
    "PHM.MX": {
        "short_name": "PULTE GROUP INC",
        "long_name": "PulteGroup, Inc.",
        "summary": "PulteGroup, Inc., through its subsidiaries, primarily engages in the homebuilding business in the United States. The company acquires and develops land primarily for residential purposes; and constructs housing on such land. It offers various home designs, including single-family detached, townhouses, condominiums, and duplexes under the Centex, Pulte Homes, Del Webb, DiVosta Homes, American West, and John Wieland Homes and Neighborhoods brand names. As of December 31, 2020, the company controlled 180,352 lots, of which 91,363 were owned and 88,989 were under land option agreements. It also arranges financing through the origination of mortgage loans primarily for homebuyers; sells the servicing rights for the originated loans; and provides title insurance policies, and examination and closing services to homebuyers. The company was formerly known as Pulte Homes, Inc. and changed its name to PulteGroup, Inc. in March 2010. PulteGroup, Inc. was founded in 1950 and is headquartered in Atlanta, Georgia.",
        "currency": "MXN",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30326",
        "website": "http://www.pultegroup.com",
        "market_cap": "Large Cap"
    },
    "PHM": {
        "short_name": "PulteGroup, Inc.",
        "long_name": "PulteGroup, Inc.",
        "summary": "PulteGroup, Inc., through its subsidiaries, primarily engages in the homebuilding business in the United States. The company acquires and develops land primarily for residential purposes; and constructs housing on such land. It offers various home designs, including single-family detached, townhouses, condominiums, and duplexes under the Centex, Pulte Homes, Del Webb, DiVosta Homes, American West, and John Wieland Homes and Neighborhoods brand names. As of December 31, 2020, the company controlled 180,352 lots, of which 91,363 were owned and 88,989 were under land option agreements. It also arranges financing through the origination of mortgage loans primarily for homebuyers; sells the servicing rights for the originated loans; and provides title insurance policies, and examination and closing services to homebuyers. The company was formerly known as Pulte Homes, Inc. and changed its name to PulteGroup, Inc. in March 2010. PulteGroup, Inc. was founded in 1950 and is headquartered in Atlanta, Georgia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30326",
        "website": "http://www.pultegroup.com",
        "market_cap": "Large Cap"
    },
    "PSMMF": {
        "short_name": "PERSIMMON",
        "long_name": "Persimmon Plc",
        "summary": "Persimmon Plc, together with its subsidiaries, operates as a house builder in the United Kingdom. The company offers family housing under the Persimmon Homes brand name; executive housing under the Charles Church brand; and social housing under the Westbury Partnerships brand name. It also provides broadband services. The company was founded in 1972 and is headquartered in York, the United Kingdom.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "York",
        "zipcode": "YO19 4FE",
        "website": "http://www.persimmonhomes.com",
        "market_cap": "Large Cap"
    },
    "PSMMY": {
        "short_name": "PERSIMMON",
        "long_name": "Persimmon Plc",
        "summary": "Persimmon Plc, together with its subsidiaries, operates as a house builder in the United Kingdom. The company offers apartments and family homes under the Persimmon Homes brand name; executive housing under the Charles Church brand; and social housing under the Westbury Partnerships brand name. It also provides broadband services. The company was founded in 1972 and is headquartered in York, the United Kingdom.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "York",
        "zipcode": "YO19 4FE",
        "website": "http://www.persimmonhomes.com",
        "market_cap": "Large Cap"
    },
    "PSN.L": {
        "short_name": "PERSIMMON PLC ORD 10P",
        "long_name": "Persimmon Plc",
        "summary": "Persimmon Plc, together with its subsidiaries, operates as a house builder in the United Kingdom. The company offers family housing under the Persimmon Homes brand name; executive housing under the Charles Church brand; and social housing under the Westbury Partnerships brand name. It also provides broadband services. The company was founded in 1972 and is headquartered in York, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "York",
        "zipcode": "YO19 4FE",
        "website": "http://www.persimmonhomes.com",
        "market_cap": null
    },
    "PU7.F": {
        "short_name": "PULTE GROUP INC.  DL -,01",
        "long_name": "PulteGroup, Inc.",
        "summary": "PulteGroup, Inc., through its subsidiaries, primarily engages in the homebuilding business in the United States. The company acquires and develops land primarily for residential purposes; and constructs housing on such land. It offers various home designs, including single-family detached, townhouses, condominiums, and duplexes under the Centex, Pulte Homes, Del Webb, DiVosta Homes, American West, and John Wieland Homes and Neighborhoods brand names. As of December 31, 2020, the company controlled 180,352 lots, of which 91,363 were owned and 88,989 were under land option agreements. It also arranges financing through the origination of mortgage loans primarily for homebuyers; sells the servicing rights for the originated loans; and provides title insurance policies, and examination and closing services to homebuyers. The company was formerly known as Pulte Homes, Inc. and changed its name to PulteGroup, Inc. in March 2010. PulteGroup, Inc. was founded in 1950 and is headquartered in Atlanta, Georgia.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30326",
        "website": "http://www.pultegroup.com",
        "market_cap": "Large Cap"
    },
    "RDW.L": {
        "short_name": "REDROW PLC ORD 10.5P",
        "long_name": "Redrow plc",
        "summary": "Redrow plc focuses on housebuilding activities in the United Kingdom. The company acquires land; and develops and sells residential housing properties. Redrow plc was founded in 1974 and is based in Flintshire, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Flintshire",
        "zipcode": "CH5 3RX",
        "website": "http://www.redrowplc.co.uk",
        "market_cap": null
    },
    "RDWWF": {
        "short_name": "REDROW PLC",
        "long_name": "Redrow plc",
        "summary": "Redrow plc focuses on housebuilding activities in the United Kingdom. The company acquires land; and develops and sells residential housing properties. Redrow plc was founded in 1974 and is based in Flintshire, the United Kingdom.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Flintshire",
        "zipcode": "CH5 3RX",
        "website": "http://www.redrowplc.co.uk",
        "market_cap": "Mid Cap"
    },
    "RNVT": {
        "short_name": "RENOVATE NEIGHBORHOODS INC",
        "long_name": "Renovate Neighborhoods, Inc.",
        "summary": "Renovate Neighborhoods, Inc. does not have significant operations. Previously, it was engaged in the Internet and mobile entertainment business. The company was formerly known as VoxPop Worldwide, Inc. and changed its name to Renovate Neighborhoods, Inc. in December 2010. Renovate Neighborhoods, Inc. was founded in 1995 and is based in Sunrise, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Sunrise",
        "zipcode": "33351",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "ROTS.TA": {
        "short_name": "ROTSHTEIN REALEST",
        "long_name": "Rotshtein Realestate Ltd",
        "summary": "Rotshtein Realestate Ltd develops and constructs residential projects in Israel. It also undertakes engineering works. The company was formerly known as D. Rothstein Company and changed its name to Rotshtein Realestate Ltd in February 2013. Rotshtein Realestate Ltd is based in Petah Tikva, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Petah Tikva",
        "zipcode": null,
        "website": "http://www.rotshtein.co.il",
        "market_cap": null
    },
    "RSID3.SA": {
        "short_name": "ROSSI RESID ON      NM",
        "long_name": "Rossi Residencial S.A.",
        "summary": "Rossi Residencial S.A., together with its subsidiaries, engages in the construction, development, and sale of residential and commercial properties in Brazil. The company is involved in the land subdivision activities; and provision of civil engineering services. Rossi Residencial S.A. was founded in 1980 and is headquartered in SÃ£o Paulo, Brazil.",
        "currency": "BRL",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "state": "SP",
        "city": "SÃ£o Paulo",
        "zipcode": "04717-004",
        "website": "http://www.rossiresidencial.com.br",
        "market_cap": "Nano Cap"
    },
    "RTSN.TA": {
        "short_name": "ROTEM SHANI ENTREP",
        "long_name": "Rotem Shani Entrepreneurship and Investment Ltd.",
        "summary": "Rotem Shani Entrepreneurship and Investment Ltd. engages in the real estate business in Israel. It is involved in the residential and/or commercial construction projects. The company was formerly known as Delta Eshbol Entrepreneurship Ltd. and changed its name to Rotem Shani Entrepreneurship and Investment Ltd. in May 1996. Rotem Shani Entrepreneurship and Investment Ltd. was incorporated in 1996 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "4690500",
        "website": null,
        "market_cap": null
    },
    "SIC": {
        "short_name": "Select Interior Concepts, Inc.",
        "long_name": "Select Interior Concepts, Inc.",
        "summary": "Select Interior Concepts, Inc., together with its subsidiaries, installs and distributes interior building products for residential interior design services markets in the United States. The company operates through two segments, Residential Design Services and Architectural Surfaces Group. The Residential Design Services segment provides an integrated, outsourced solution for the design, consultation, sourcing, distribution, and installation needs of homebuyer customers. It works with homebuyers in the selection of an array of interior products and finishes, including flooring, cabinets, countertops, wall tile, and related interior items, primarily for newly constructed homes; and coordinates the ordering, fulfillment, and installation of interior products. The Architectural Surfaces Group segment imports and distributes natural and engineered stone slabs, such as marble, granite, porcelain, and quartz for kitchen and bathroom countertops; and ceramic and porcelain tiles for flooring, backsplash, and wall tile applications, as well as tile. It markets its products through a network of 21 distribution centers and showrooms to new residential and commercial construction markets, and repair and remodel market. The company was founded in 2014 and is headquartered in Atlanta, Georgia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30339",
        "website": "http://www.selectinteriorconcepts.com",
        "market_cap": "Micro Cap"
    },
    "SIO.AX": {
        "short_name": "SIMONDS FPO",
        "long_name": "Simonds Group Limited",
        "summary": "Simonds Group Limited, together with its subsidiaries, provides homebuilder and registered training services in Australia. It operates through Residential Construction, Registered Training, and Development segments. The company designs and constructs residential dwellings; develops and sells residential land; contracts for residential home construction, speculative home building, and the building of display home inventory; and provides registered training courses, payroll and asset services, and intellectual property services. It operates display homes across the Australian eastern seaboard and South Australia. The company was formerly known as Simonds Homes Holdings Pty Ltd and changed its name to Simonds Group Limited in September 2014. Simonds Group Limited was founded in 1949 and is based in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3004",
        "website": "http://www.simondsgroup.com.au",
        "market_cap": "Micro Cap"
    },
    "SKHSF": {
        "short_name": "SEKISUI HOUSE",
        "long_name": "Sekisui House, Ltd.",
        "summary": "Sekisui House, Ltd. designs, constructs, and contracts built-to-order detached houses in Japan and internationally. It also engages in the design, construction, and contracting of built-to-order properties for lease, medical and nursing care facilities, commercial facilities, and hotels; design, construction, and contracting of construction of buildings and civil engineering works; remodeling and renovation of houses, etc.; sub-lease, management, operation, and brokerage of real estate; sale of houses and residential land; design, construction, and sale of condominiums; and development of office and commercial buildings, as well as management and operation of owned properties. The company was founded in 1960 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "531-0076",
        "website": "http://www.sekisuihouse.co.jp",
        "market_cap": "Large Cap"
    },
    "SKHSY": {
        "short_name": "SEKISUI HOUSE",
        "long_name": "Sekisui House, Ltd.",
        "summary": "Sekisui House, Ltd. designs, constructs, and contracts built-to-order detached houses in Japan and internationally. It also engages in the design, construction, and contracting of built-to-order properties for lease, medical and nursing care facilities, commercial facilities, and hotels; design, construction, and contracting of construction of buildings and civil engineering works; remodeling and renovation of houses, etc.; sub-lease, management, operation, and brokerage of real estate; sale of houses and residential land; design, construction, and sale of condominiums; and development of office and commercial buildings, as well as management and operation of owned properties. The company was founded in 1960 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "531-0076",
        "website": "http://www.sekisuihouse.co.jp",
        "market_cap": "Large Cap"
    },
    "SKSUF": {
        "short_name": "SEKISUI CHEMICAL CO",
        "long_name": "Sekisui Chemical Co., Ltd.",
        "summary": "Sekisui Chemical Co., Ltd. engages in housing, urban infrastructure and environmental products (UIEP), and high performance plastics (HPP) businesses. The Housing segment engages in the manufacturing, construction, sale, refurbishing, and other operations related to unit housing, real estate, and residential service business. The UIEP segment manufactures, constructs, and sells PVC pipes and joints, polyethylene pipes and joints, pipe and drain renewal materials and construction methods, reinforced plastic pipe, construction materials, and FFU. The HPP segment engages in the manufacture and sale of interlayer films for laminated glass, polyolefin foam, tape, LCD fine particles and photosensitive materials, functional resin for infrastructure, diagnostic drugs, and other products. It operates in Japan, the United States, Europe, Asia, and internationally. The company was formerly known as Sekisui Sangyo Co., Ltd. and changed its name to Sekisui Chemical Co., Ltd. in 1948. Sekisui Chemical Co., Ltd. was founded in 1947 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-8565",
        "website": "http://www.sekisui.co.jp",
        "market_cap": "Mid Cap"
    },
    "SKY": {
        "short_name": "Skyline Champion Corporation",
        "long_name": "Skyline Champion Corporation",
        "summary": "Skyline Champion Corporation operates as a factory-built housing company in North America. The company offers manufactured and modular homes, as well as park-models and modular buildings for the multi-family, hospitality, and senior and workforce housing sectors. It builds homes under the brand names of Skyline Homes, Champion Home Builders, Genesis Homes, Athens Park Models, Dutch Housing, Excel Homes, Homes of Merit, New Era, Redman Homes, Shore Park, Silvercrest, Titan Homes in the United States, and Moduline and SRI Homes in western Canada. The company also operates a factory-direct retail business, Titan Factory Direct, with 21 retail locations in the southern United States. In addition, it provides transportation services to the manufactured housing and other industries. The company was founded in 2010 and is headquartered in Troy, Michigan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MI",
        "city": "Troy",
        "zipcode": "48084",
        "website": "http://www.skylinechampion.com",
        "market_cap": "Mid Cap"
    },
    "SOCOVESA.SN": {
        "short_name": "SOCOVESA SA",
        "long_name": "Socovesa S.A.",
        "summary": "Socovesa S.A. engages in the real estate development, and engineering and construction business in Chile. The company's construction projects include houses, buildings, bridges, roads, trams, irrigation works, tunnels, ports, airports, and land projects; and offers real estate consultancy services. It offers its services under the Socovesa, Almagro, and Pilares brands. The company was founded in 1965 and is based in Providencia, Chile.",
        "currency": "CLP",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "Chile",
        "state": null,
        "city": "Providencia",
        "zipcode": null,
        "website": "http://www.empresassocovesa.cl",
        "market_cap": "Micro Cap"
    },
    "SPH1.F": {
        "short_name": "SEKISUI HOUSE",
        "long_name": "Sekisui House, Ltd.",
        "summary": "Sekisui House, Ltd. designs, constructs, and contracts built-to-order detached houses in Japan and internationally. It also engages in the design, construction, and contracting of built-to-order properties for lease, medical and nursing care facilities, commercial facilities, and hotels; design, construction, and contracting of construction of buildings and civil engineering works; remodeling and renovation of houses, etc.; sub-lease, management, operation, and brokerage of real estate; sale of houses and residential land; design, construction, and sale of condominiums; and development of office and commercial buildings, as well as management and operation of owned properties. The company was founded in 1960 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "531-0076",
        "website": "http://www.sekisuihouse.co.jp",
        "market_cap": "Large Cap"
    },
    "SPR.L": {
        "short_name": "SPRINGFIELD PROPERTIES PLC ORD ",
        "long_name": "Springfield Properties Plc",
        "summary": "Springfield Properties Plc, together with its subsidiary, engages in the house building business in the United Kingdom. The company operates through two markets, Private Housing and Affordable. It is also involved in hiring plants and machineries, property development, buys and sells real estate and residential property, and management services. The company was founded in 1956 and is based in Elgin, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Elgin",
        "zipcode": "IV30 6GR",
        "website": "http://www.springfield.co.uk",
        "market_cap": null
    },
    "STHI": {
        "short_name": "SPROUT TINY HOMES DE INC",
        "long_name": "Sprout Tiny Homes, Inc.",
        "summary": "Sprout Tiny Homes, Inc. designs, develops, and manufactures tiny homes. It manufactures tiny homes on wheels and homes on foundations. The company was formerly known as RG America, Inc. and changed its name to Sprout Tiny Homes, Inc. in April 2015. Sprout Tiny Homes, Inc. was founded in 1998 and is headquartered in Pueblo, Colorado.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Pueblo",
        "zipcode": "81006",
        "website": "http://www.sprouttinyhomes.com",
        "market_cap": "Nano Cap"
    },
    "STUDBO.ST": {
        "short_name": "STUDENTBOSTADER I SVERIGE AB",
        "long_name": "Studentbostäder i Norden AB (publ)",
        "summary": "StudentbostÃ¤der i Sverige AB develops, owns, and manages student housing properties in long term partnerships with municipalities, counties, and universities. It offers housing in eleven university cities in Sweden. The company is based in Uppsala, Sweden.",
        "currency": "SEK",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "state": null,
        "city": "Uppsala",
        "zipcode": "753 19",
        "website": "http://sbsstudent.se",
        "market_cap": "Micro Cap"
    },
    "SUI.F": {
        "short_name": "SEKISUI CHEM.",
        "long_name": "Sekisui Chemical Co., Ltd.",
        "summary": "Sekisui Chemical Co., Ltd. engages in housing, urban infrastructure and environmental products (UIEP), and high performance plastics (HPP) businesses. The Housing segment engages in the manufacturing, construction, sale, refurbishing, and other operations related to unit housing, real estate, and residential service business. The UIEP segment manufactures, constructs, and sells PVC pipes and joints, polyethylene pipes and joints, pipe and drain renewal materials and construction methods, reinforced plastic pipe, construction materials, and FFU. The HPP segment engages in the manufacture and sale of interlayer films for laminated glass, polyolefin foam, tape, LCD fine particles and photosensitive materials, functional resin for infrastructure, diagnostic drugs, and other products. It operates in Japan, the United States, Europe, Asia, and internationally. The company was formerly known as Sekisui Sangyo Co., Ltd. and changed its name to Sekisui Chemical Co., Ltd. in 1948. Sekisui Chemical Co., Ltd. was founded in 1947 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-8565",
        "website": "http://www.sekisui.co.jp",
        "market_cap": "Mid Cap"
    },
    "T86.F": {
        "short_name": "TRI POINTE HOMES  DL-,01",
        "long_name": "Tri Pointe Homes, Inc.",
        "summary": "Tri Pointe Homes, Inc. engages in the design, construction, and sale of single-family attached and detached homes in the United States. The company operates through a portfolio of six brands, including Maracay in Arizona; Pardee Homes in California and Nevada; Quadrant Homes in Washington; Trendmaker Homes in Texas; TRI Pointe Homes in California, Colorado, and the Carolinas; and Winchester Homes in Maryland, Virginia, and the District of Columbia. As of December 31, 2020, its operations consisted of 112 active selling communities and 35,641 owned or controlled lots. The company sells its homes through own sales representatives and independent real estate brokers. It also provides financial services, such as mortgage financing, title and escrow, and property and casualty insurance agency services. The company was formerly known as TRI Pointe Group, Inc. and changed its name to Tri Pointe Homes, Inc. in January 2021. Tri Pointe Homes, Inc. was founded in 2009 and is headquartered in Irvine, California.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NV",
        "city": "Incline Village",
        "zipcode": "89451",
        "website": "http://www.tripointehomes.com",
        "market_cap": "Mid Cap"
    },
    "THM.F": {
        "short_name": "TAYLOR MORRISON HOME",
        "long_name": "Taylor Morrison Home Corporation",
        "summary": "Taylor Morrison Home Corporation, together with its subsidiaries, operates as a public homebuilder in the United States. The company designs, builds, and sells single and multi-family detached and attached homes; and develops lifestyle and master-planned communities. It also develops and constructs multi-use properties consisting of commercial space, retail, and multi-family properties; offers title insurance and closing settlement services, as well as financial services. In addition, the company operates under the Taylor Morrison, William Lyon Signature, and Darling Homes brand names in Arizona, California, Colorado, Florida, Georgia, Nevada, North and South Carolina, Oregon, Texas, and Washington. Taylor Morrison Home Corporation was founded in 1936 and is headquartered in Scottsdale, Arizona.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "AZ",
        "city": "Scottsdale",
        "zipcode": "85251",
        "website": "http://www.taylormorrison.com",
        "market_cap": "Mid Cap"
    },
    "TLK.F": {
        "short_name": "TOLL BROTHERS  DL -,01",
        "long_name": "Toll Brothers, Inc.",
        "summary": "Toll Brothers, Inc., together with its subsidiaries, designs, builds, markets, sells, and arranges finance for a range of detached and attached homes in luxury residential communities in the United States. The company operates in two segments, Traditional Home Building and Urban Infill. It also designs, builds, markets, and sells homes in urban infill markets through Toll Brothers City Living. In addition, the company develops, owns, and operates golf courses and country clubs; develops and sells land; and develops, operates, and rents apartments, as well as provides homeowners with home automation and technology options. Further, it owns and operates architectural, engineering, mortgage, title, landscaping, lumber distribution, house component assembly, and manufacturing operations. The company serves move-up, empty-nester, active-adult, and second-home buyers. Toll Brothers, Inc. was founded in 1967 and is headquartered in Horsham, Pennsylvania.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "PA",
        "city": "Fort Washington",
        "zipcode": "19034",
        "website": "http://www.tollbrothers.com",
        "market_cap": "Mid Cap"
    },
    "TMHC": {
        "short_name": "Taylor Morrison Home Corporatio",
        "long_name": "Taylor Morrison Home Corporation",
        "summary": "Taylor Morrison Home Corporation, together with its subsidiaries, operates as a public homebuilder in the United States. The company designs, builds, and sells single and multi-family detached and attached homes; and develops lifestyle and master-planned communities. It also develops and constructs multi-use properties consisting of commercial space, retail, and multi-family properties; offers title insurance and closing settlement services, as well as financial services. In addition, the company operates under the Taylor Morrison, William Lyon Signature, and Darling Homes brand names in Arizona, California, Colorado, Florida, Georgia, Nevada, North and South Carolina, Oregon, Texas, and Washington. Taylor Morrison Home Corporation was founded in 1936 and is headquartered in Scottsdale, Arizona.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Scottsdale",
        "zipcode": "85251",
        "website": "http://www.taylormorrison.com",
        "market_cap": "Mid Cap"
    },
    "TOL": {
        "short_name": "Toll Brothers, Inc.",
        "long_name": "Toll Brothers, Inc.",
        "summary": "Toll Brothers, Inc., together with its subsidiaries, designs, builds, markets, sells, and arranges finance for a range of detached and attached homes in luxury residential communities in the United States. The company operates in two segments, Traditional Home Building and Urban Infill. It also designs, builds, markets, and sells homes in urban infill markets through Toll Brothers City Living. In addition, the company develops, owns, and operates golf courses and country clubs; develops and sells land; and develops, operates, and rents apartments, as well as provides homeowners with home automation and technology options. Further, it owns and operates architectural, engineering, mortgage, title, landscaping, lumber distribution, house component assembly, and manufacturing operations. The company serves move-up, empty-nester, active-adult, and second-home buyers. Toll Brothers, Inc. was founded in 1967 and is headquartered in Horsham, Pennsylvania.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Fort Washington",
        "zipcode": "19034",
        "website": "http://www.tollbrothers.com",
        "market_cap": "Mid Cap"
    },
    "TPH": {
        "short_name": "Tri Pointe Homes, Inc.",
        "long_name": "Tri Pointe Homes, Inc.",
        "summary": "Tri Pointe Homes, Inc. engages in the design, construction, and sale of single-family attached and detached homes in the United States. The company operates through a portfolio of six brands, including Maracay in Arizona; Pardee Homes in California and Nevada; Quadrant Homes in Washington; Trendmaker Homes in Texas; TRI Pointe Homes in California, Colorado, and the Carolinas; and Winchester Homes in Maryland, Virginia, and the District of Columbia. As of December 31, 2020, its operations consisted of 112 active selling communities and 35,641 owned or controlled lots. The company sells its homes through own sales representatives and independent real estate brokers. It also provides financial services, such as mortgage financing, title and escrow, and property and casualty insurance agency services. The company was formerly known as TRI Pointe Group, Inc. and changed its name to Tri Pointe Homes, Inc. in January 2021. Tri Pointe Homes, Inc. was founded in 2009 and is headquartered in Irvine, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Incline Village",
        "zipcode": "89451",
        "website": "http://www.tripointehomes.com",
        "market_cap": "Mid Cap"
    },
    "TRU.DE": {
        "short_name": "TRAUMHAUS AG  INH O.N.",
        "long_name": "Traumhaus AG",
        "summary": "Traumhaus AG engages in the real estate activities. It serves young and small families. The company is based in Wiesbaden, Germany.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "GER",
        "market": "de_market",
        "country": "Germany",
        "state": null,
        "city": "Wiesbaden",
        "zipcode": "65205",
        "website": "http://www.traumhaus-familie.de",
        "market_cap": "Micro Cap"
    },
    "TRU.F": {
        "short_name": "TRAUMHAUS AG  INH O.N.",
        "long_name": "Traumhaus AG",
        "summary": "Traumhaus AG engages in the real estate activities. It serves young and small families. The company is based in Wiesbaden, Germany.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Germany",
        "state": null,
        "city": "Wiesbaden",
        "zipcode": "65205",
        "website": "http://www.traumhaus-familie.de",
        "market_cap": "Micro Cap"
    },
    "TW.L": {
        "short_name": "TAYLOR WIMPEY PLC ORD 1P",
        "long_name": "Taylor Wimpey plc",
        "summary": "Taylor Wimpey plc operates a residential developer in the United Kingdom and Spain. The company builds and delivers various homes and communities, including apartments to six-bedroom houses. Taylor Wimpey plc was founded in 1880 and is headquartered in High Wycombe, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "High Wycombe",
        "zipcode": "HP12 3NR",
        "website": "http://www.taylorwimpey.co.uk",
        "market_cap": null
    },
    "TWD.AX": {
        "short_name": "TAMAWOOD FPO",
        "long_name": "Tamawood Limited",
        "summary": "Tamawood Limited, together with its subsidiaries, provides contract home construction, home design, project management, and other associated services in Australia. It is also involved in franchising and licensing operations, as well as generates and trades in renewable energy certificates associated with solar products. Tamawood Limited was founded in 1989 and is based in Rocklea, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Rocklea",
        "zipcode": "4106",
        "website": "http://www.tamawood.com.au",
        "market_cap": "Micro Cap"
    },
    "TWODF": {
        "short_name": "TAYLOR WIMPEY",
        "long_name": "Taylor Wimpey plc",
        "summary": "Taylor Wimpey plc operates a residential developer in the United Kingdom and Spain. The company builds and delivers various homes and communities, including apartments to six-bedroom houses. Taylor Wimpey plc was founded in 1880 and is headquartered in High Wycombe, the United Kingdom.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "High Wycombe",
        "zipcode": "HP12 3NR",
        "website": "http://www.taylorwimpey.co.uk",
        "market_cap": "Mid Cap"
    },
    "TWODY": {
        "short_name": "TAYLOR WIMPEY",
        "long_name": "Taylor Wimpey plc",
        "summary": "Taylor Wimpey plc operates a residential developer in the United Kingdom and Spain. The company builds and delivers various homes and communities, including apartments to six-bedroom houses. Taylor Wimpey plc was founded in 1880 and is headquartered in High Wycombe, the United Kingdom.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "High Wycombe",
        "zipcode": "HP12 3NR",
        "website": "http://www.taylorwimpey.co.uk",
        "market_cap": "Mid Cap"
    },
    "TWW.F": {
        "short_name": "TAYLOR WIMPEY PLC LS -,01",
        "long_name": "Taylor Wimpey plc",
        "summary": "Taylor Wimpey plc operates a residential developer in the United Kingdom and Spain. The company builds and delivers various homes and communities, including apartments to six-bedroom houses. Taylor Wimpey plc was founded in 1880 and is headquartered in High Wycombe, the United Kingdom.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "High Wycombe",
        "zipcode": "HP12 3NR",
        "website": "http://www.taylorwimpey.co.uk",
        "market_cap": "Mid Cap"
    },
    "URBI.MX": {
        "short_name": "URBI DESARROLLOS URBANOS SAB DE",
        "long_name": "Urbi, Desarrollos Urbanos, S.A.B. de C.V.",
        "summary": "Urbi, Desarrollos Urbanos, S.A.B. de C.V. engages in the housing development business in Mexico. It develops housing properties aimed at lower income population. The company was founded in 1981 and is based in Mexicali, Mexico.",
        "currency": "MXN",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Mexico",
        "state": "BJ",
        "city": "Mexicali",
        "zipcode": "21100",
        "website": "http://www.urbi.com",
        "market_cap": "Nano Cap"
    },
    "VTY.L": {
        "short_name": "VISTRY GROUP PLC ORD 50P",
        "long_name": "Vistry Group PLC",
        "summary": "Vistry Group PLC, together with its subsidiaries, operates as a builder of homes in the United Kingdom. The company offers two-bed to four and five-bed family homes. It owns a land bank of 40,218 plots. The company was formerly known as Bovis Homes Group PLC and changed its name to Vistry Group PLC in January 2020. Vistry Group PLC was founded in 1885 and is headquartered in West Malling, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "West Malling",
        "zipcode": "ME19 4UY",
        "website": "http://www.vistrygroup.co.uk",
        "market_cap": null
    },
    "WJG.L": {
        "short_name": "WATKIN JONES PLC ORD 1P",
        "long_name": "Watkin Jones Plc",
        "summary": "Watkin Jones Plc engages in the development and the management of properties for residential occupation in the United Kingdom. The company operates through Student Accommodation, Build to Rent, Residential, and Accommodation Management segments. It is involved in the development of purpose-built student accommodation, build to rent accommodation, and traditional residential property; and management of student accommodation and build to rent property. The company was formerly known as Watkin Jones Limited and changed its name to Watkin Jones Plc in March 2016. Watkin Jones Plc was founded in 1791 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W1B 4DE",
        "website": "http://www.watkinjonesplc.com",
        "market_cap": null
    }
}