{
  "1EP.F": {
    "city": "Todi",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Semiconductor Equipment & Materials",
    "long_name": "ELES Semiconductor Equipment S.p.A.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "ELES SEMICO.EQUIPM. S.P.A",
    "state": "PG",
    "summary": "ELES Semiconductor Equipment S.p.A. designs, manufactures, and sells test equipment, fixtures, solutions, and services for the semiconductor industry in Italy. It serves customers in automotive, defence, aerospace, industrial, IoT, and communication, as well as electronic control unit, electronic module, and system markets. The company was founded in 1988 and is headquartered in Todi, Italy.",
    "website": "http://www.eles.com",
    "zipcode": "06059"
  },
  "1S3.F": {
    "city": "Empoli",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "SeSa S.p.A.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "SESA S.P.A.",
    "state": "FI",
    "summary": "SeSa S.p.A., through its subsidiaries, distributes value-added information technology (IT) products and solutions in Italy. Its Software and System Integration sector offers software and IT products and services; ICT products and solutions, as well as system integration services; IT infrastructure and IoT solutions; artificial intelligence and machine learning solutions; digital and business application services; and HR management solutions, as well as operates solutions on the Microsoft Dynamics platform. It also provides cloud services; digital security services; digital manufacturing, processing, and transformation solutions; management, maintenance, technical assistance, and repair services for computers and IT products; and strategic outsourcing services, as well as operates in the cloud computing and systems assistance sectors. In addition, this sector develops and markets ERP software and applications; offers solutions and integrated services on the SAP Business One platform; develops 3cad products for the furniture industry; produces and markets software products, as well as provides IT services for the retail sector; offers project management services; and provides product lifecycle management solutions for manufacturing sector. The company's Business Services sector supplies business process outsourcing, digital transformation, and fleet management and operations services; and physical and logical security services for banks and operators in the retail sector. Its Value Added Distribution sector engages in the value added distribution of technological, enterprise software and datacenter solutions; management of networking solutions; providing design services for IT solutions; marketing Hitachi data systems solutions; and distribution of the Adobe brand. The company's Corporate sector offers logistics services; and marketing and promotion services for the ICT channel. SeSa S.p.A. is headquartered in Empoli, Italy. SeSa S.p.A. is a subsidiary of ITH S.p.A.",
    "website": "http://www.sesa.it",
    "zipcode": "50053"
  },
  "2I6.F": {
    "city": "Sant'agata Feltria",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Consumer Electronics",
    "long_name": "Indel B S.p.A.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "INDEL B S.P.A.",
    "state": "RN",
    "summary": "Indel B S.p.A. produces and sells mobile refrigerators worldwide. The company offers fridges and parking air coolers for cars, off road vehicles, motor homes/caravans, commercial vehicles, mini buses, luxury coaches, and ambulances; and hotel minibars, electronic safes, lock systems, hairdryers, LED lighting products, and LED televisions. It also provides wine cellars for the manufacturers of home appliances; small refrigerators under the FrigoLatte brand for use in milk preservation refrigerators for coffee machine manufacturers; refrigerators for use in the after-market and cruise applications; and built-in fridges for OEMs, as well as equipment for cabin cruiser yacht, including built in and portable fridges, water heaters, cooling units, ice makers, and freezers under the Indel Webasto Marine name. The company was founded in 1967 and is based in Sant'Agata Feltria, Italy. Indel B S.p.A. is a subsidiary of Amp.Fin S.R.L.",
    "website": "http://www.indelb.com",
    "zipcode": "47866"
  },
  "37B.F": {
    "city": "Bagno a Ripoli",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Consumer Electronics",
    "long_name": "B&C Speakers S.p.A.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "B+C SPEAKERS S.P.A.",
    "state": "FI",
    "summary": "B&C Speakers S.p.A. manufactures and sells electro-acoustic transducer. It offers high frequency drivers and horns, coaxial components, and cone drivers, as well as LF and HF drivers, tweeters, and line arrays. The company provides its products under the B&C brand name, as well as supplies OEM components to professional audio brands in the market. It has operations in Italy and internationally. The company was formerly known as BBC Speakers SpA and changed its name to B&C Speakers S.p.A. in 1993. B&C Speakers S.p.A. was founded in 1945 and is headquartered in Bagno a Ripoli, Italy. B&C Speakers S.p.A. is a subsidiary of Research & Development International S.r.L.",
    "website": "http://www.bcspeakers.com",
    "zipcode": "50012"
  },
  "3K2.F": {
    "city": "Modena",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Expert.ai S.p.A.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "EXPERT.AI S.P.A.",
    "state": "MO",
    "summary": "Expert System S.p.A. develops and sells cognitive computing software products based on artificial intelligence (AI) algorithms to read and understand written language in Italy and internationally. The company offers Cogito cognitive technology for cognitive computing; Cogito Discover for text analytics, and extraction and categorization software; Cogito Intelligence Platform, an information intelligence software for real-time analysis of unstructured data streams; Cogito Answers, a customer support automation software that allows human like interaction between customers and internal staff; and Cogito for Claims that automate insurance claims management with natural language understanding. It also provides Cogito for Underwriting to enhance the insurance underwriting process and streamlines the risk assessment; Cogito Studio, a fully integrated development environment for building and deploying a custom AI-based text model that leverages the cognitive abilities of the Cogito platform; and Clinical Research Navigator that supports biomedical researchers with a single platform for revealing insights to drive their research and support discovery of therapies for infectious diseases, such as COVID-19 and other health crises. In addition, the company offers Medical Intelligence Platform that provides information analysts with a solution to acquire, analyze, search, and explore data points related to biological risks; and Cogito for Life Sciences to mimic the human like comprehension of scientific content, such as publications, patents, clinical trials, or medical reports. The company serves the banking and insurance, public administration, life science and pharma, oil and gas, media and publishing, and telco and utilities industries, as well as defense, and intelligence and law enforcement industries. Expert System S.p.A. was founded in 1989 and is headquartered in Modena, Italy.",
    "website": "http://www.expertsystem.com",
    "zipcode": "41123"
  },
  "4PX.F": {
    "city": "Brugherio",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Infrastructure",
    "long_name": "Reevo S.P.A.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "REEVO S.P.A.  O.N.",
    "state": "MI",
    "summary": "Reevo S.P.A. provides cloud, cyber security, and hybrid cloud services to protect and store the corporate assets in its digital safe in Italy. The company is headquartered in Brugherio, Italy.",
    "website": "http://www.reevo.it",
    "zipcode": "20861"
  },
  "68H.F": {
    "city": "Rome",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Infrastructure",
    "long_name": "Cy4gate S.p.A.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "CY4GATE S.P.A.",
    "state": "RM",
    "summary": "Cy4gate S.P.A. develops cyber electronic warfare and intelligence solutions for government and corporate organizations. The company offers A-QUBE, an advanced intelligence analytics platform to collect, analyze, and transform heterogeneus data flows into strategic intelligence outcome; and Real Time Analytics, a cyber security monitoring and incident response solution for corporates and companies, as well as operates CY4GATE Academy that provides recruiting, educational, and training programs to address needs in cyber intelligence, cyber security engineering, cybersecurity incident response and recovery, and cybersecurity assessment. It also provides cyber electronic warfare and intelligence solutions for government bodies and armed forces, such as D-SINT, an advanced intelligence analytics platform to collect, analyze, and transform heterogeneous data flows into strategic intelligence outcome; TACTICAL RTA to support the cyber team focusing on real-time threats; Homeland Security Solutions to deliver surveillance and control capabilities; and DIGILAB to perform digital activities for platform and system analysis, vulnerability management, and attack pattern engineering. In addition, the company develops platforms for network intelligence to support law enforcement agencies and security agencies in conducting operations; and provides clients with support in the design and development of cyber electromagnetic attack systems and simulation models. Cy4gate S.P.A. is based in Rome, Italy.",
    "website": "http://www.cy4gate.com/en",
    "zipcode": "00131"
  },
  "7T4.F": {
    "city": "Rome",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Tinexta S.p.A.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "TINEXTA S.P.A.",
    "state": "RM",
    "summary": "Tinexta S.p.A. provides digital trust, credit information and management, and innovation and marketing services to large companies, banks, insurance and financial companies, SMEs, associations, and professionals in Italy and internationally. The company offers IT solutions for digital identity and the dematerialization of processes according to the applicable legislation, such as certified electronic mail, electronic storage, digital signature, digital certification, e-invoicing, electronic archiving, and e-enterprise solutions; various solutions for secure and simplified transmission of legal and financial documents; web services for accessing public administration database; additional services for the management of professional associations and billing, and IT protocol; and designs and develops IT services and solutions for SMEs, trade associations, professional firms, agencies, and financial intermediaries. The company also offers cyber security solutions; services to support decision-making processes; credit information and management services; and software solutions to comply with tax obligations, employment legislations, and other regulations, as well as electronic filing of documents and management of civil proceedings. In addition, it provides real estate information and appraisal services; and consulting services for grants, loans and tax relief, and industrial innovation, as well as temporary export management consultancy services for SMEs. The company was formerly known as Tecnoinvestimenti S.p.A. and changed its name to Tinexta S.p.A. in November 2018. The company was founded in 2009 and is headquartered in Rome, Italy. Tinexta S.p.A. is a subsidiary of Tecno Holding S.p.A.",
    "website": "http://www.tinexta.com",
    "zipcode": "00187"
  },
  "8EP.F": {
    "city": "Milan",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Relatech S.p.A.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "RELATECH S.P.A.",
    "state": "MI",
    "summary": "Relatech S.p.A., a digital enabler solution knowledge company, provides various digital solutions. It offers solutions, including projects and services in digital customer experience, big data, artificial intelligence, Internet of Things, blockchain and cyber security, and hybrid cloud field through its digital platform RePlatform. The company operates RePlatform, a cloud based customizable platform for the digital transformation process of business. It serves pharma and healthcare, retail and fashion, food and agrifood, telco, energy and utilities, banking and insurance, and industrial and logistics industries. The company was founded in 2001 and is headquartered in Milan, Italy.",
    "website": "http://www.relatech.com",
    "zipcode": "20099"
  },
  "AIW.MI": {
    "city": "Rome",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "Almawave S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "ALMAWAVE",
    "state": "RM",
    "summary": "Almawave S.r.l. develops customer relations management solutions. It offers Iride Suite that integrates semantics, statistics, automatic speech recognition, and adaptive interface into one single platform; and generates information on management processes across various communication channels, such as customer journey, perception of products and services, occurrence of critical issues and risks, knowledge, and skill management. The company also provides social analysis solutions. It serves top management, sales and marketing, customer operations, information technology, public relations, and organization markets. The company was founded in 2008 and is based in Rome, Italy with additional offices in San Francisco, California; Milano, Firenze, and Trento, Italy; and Sao Paulo and Belo Horizonte, Brazil. Almawave S.r.l. operates as a subsidiary of Almaviva - The Italian Innovation Company S.p.A.",
    "website": "http://www.almawave.it",
    "zipcode": "00137"
  },
  "BE.MI": {
    "city": "Monteveglio",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Electronics & Computer Distribution",
    "long_name": "Beghelli S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "BEGHELLI",
    "state": "BO",
    "summary": "Beghelli S.p.A. manufactures and sells various energy saving lighting products, electronic systems for domestic and industrial safety, and components for the photovoltaic power production in Italy and other European countries. It offers emergency luminaires, exit signs, LED modules with inverters, inverters, ceiling suspended systems, downlights, indoor and outdoor louvres, industrial and street lightings, projectors, floodlights, row systems, reglettes, and portable lights, as well as anti black-out and LED lamps; and building automation emergency, recessed and ceiling, and wall and ceiling products. The company also provides drinking water treatment, portable lights, batteries, and S.O.S. products. In addition, it offers helpline, after-sale, and case study services. The company was founded in 1982 and is based in Monteveglio, Italy.",
    "website": "http://www.beghelli.com",
    "zipcode": "40053"
  },
  "BEC.MI": {
    "city": "Bagno a Ripoli",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Consumer Electronics",
    "long_name": "B&C Speakers S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "B&C SPEAKERS",
    "state": "FI",
    "summary": "B&C Speakers S.p.A. manufactures and sells electro-acoustic transducer. It offers high frequency drivers and horns, coaxial components, and cone drivers, as well as LF and HF drivers, tweeters, and line arrays. The company provides its products under the B&C brand name, as well as supplies OEM components to professional audio brands in the market. It has operations in Italy and internationally. The company was formerly known as BBC Speakers SpA and changed its name to B&C Speakers S.p.A. in 1993. B&C Speakers S.p.A. was founded in 1945 and is headquartered in Bagno a Ripoli, Italy. B&C Speakers S.p.A. is a subsidiary of Research & Development International S.r.L.",
    "website": "http://www.bcspeakers.com",
    "zipcode": "50012"
  },
  "BEST.MI": {
    "city": "Rome",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "Be Shaping The Future S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "BE",
    "state": "RM",
    "summary": "Be Shaping The Future S.p.A. provides business consulting, information technology, and professional services in Italy, Germany, Austria, Switzerland, the United Kingdom, Spain, Poland, Ukraine, and Romania. It operates through Business Consulting and ICT Solutions segments. The Business Consulting segment offers business consulting services in the areas of payment systems, planning and control methods, regulatory compliance, information gathering, and corporate governance systems for financial processes and asset management. This segment provides management consulting services for financial institutions; financial services consulting services in the banking and financial sectors; consulting and development services in the areas of accounting, bank reporting, and compliance; and advisory services for operators in the payments industry. The ICT Solutions segment offers ICT consulting and system integration services for proprietary products/platforms. This segment also develops digital, web, and mobile solutions; and web-based and multimedia software solutions. The company was formerly known as Be Think, Solve, Execute S.p.A. and changed its name to Be Shaping The Future S.p.A. in May 2020. The company was founded in 1987 and is headquartered in Rome, Italy.",
    "website": "http://www.be-tse.it",
    "zipcode": "00144"
  },
  "CELL.MI": {
    "city": "Reggio Emilia",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Consumer Electronics",
    "long_name": "Cellularline S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "CELLULARLINE",
    "state": "RE",
    "summary": "Cellularline S.p.A. manufactures and sells accessories for smartphones and tablets in Italy and internationally. It offers protection and style products, such as smartphone cases, tablet cases, smartphone screen protection glasses, tablet screen protection glasses, and airpods cases; charging and utility products, including car battery chargers, battery chargers, main and portable battery chargers, cables, wireless chargers, in-car holders, adaptors, and useful accessories. The company also provides voice and sport accessories, such as wired and Bluetooth headsets, earphones, sports cases, Bluetooth speakers; and smart watches. Cellularline S.p.A. was founded in 1990 and is based in Reggio Emilia, Italy.",
    "website": "http://www.cellularline.com",
    "zipcode": "42122"
  },
  "CIRC.MI": {
    "city": "Milan",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "Circle S.p.A.",
    "market": "it_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "CIRCLE",
    "state": "MI",
    "summary": "Circle S.p.A. provides process and management consulting services, technological solutions, and digital marketing solutions for transport and logistics sector. It offers Milos, a modular software for the optimization of transport of containers, trailers, vehicles, and various types of goods along the supply chain; Sinfomar, a port community system; and Connecting EU that assists public actors and private companies in developing new businesses through specific instruments of project anticipation and EU branding. The company also provides digital multichannel marketing services. Circle S.p.A. was founded in 2012 and is based in Milan, Italy.",
    "website": "http://www.circletouch.eu",
    "zipcode": "20124"
  },
  "CRL.MI": {
    "city": "Brugine",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Electronic Components",
    "long_name": "Carel Industries S.p.A.",
    "market": "it_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "CAREL INDUSTRIES",
    "state": "PD",
    "summary": "Carel Industries S.p.A., together with its subsidiaries, designs, manufactures, markets, and distributes control and humidification solutions for the commercial, industrial, and residential air-conditioning and refrigeration (HVAC/R) markets in Europe, the Middle East, Africa, North America, South America, and the Asia Pacific. It offers programmable controls, room and unit terminals, HVAC and refrigeration parametric controls, isothermal and adiabatic humidifiers, water treatment systems, remote management and monitoring systems, connectivity products, sensors and protection devices, electronic expansion valves and drivers, speed controllers and inverters, electrical panels and power solutions, and obsolete products, as well as temperature, humidity, and pressure control solutions. The company also provides energy management, light management, and waterloop system solutions, as well as solutions for cabinets, cold rooms, and condensing units. Carel Industries S.p.A. was founded in 1973 and is headquartered in Brugine, Italy.",
    "website": "http://www.carel.com",
    "zipcode": "35020"
  },
  "CY4.MI": {
    "city": "Rome",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Software - Infrastructure",
    "long_name": "Cy4gate S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "CY4GATE",
    "state": "RM",
    "summary": "Cy4gate S.P.A. develops cyber electronic warfare and intelligence solutions for government and corporate organizations. The company offers A-QUBE, an advanced intelligence analytics platform to collect, analyze, and transform heterogeneus data flows into strategic intelligence outcome; and Real Time Analytics, a cyber security monitoring and incident response solution for corporates and companies, as well as operates CY4GATE Academy that provides recruiting, educational, and training programs to address needs in cyber intelligence, cyber security engineering, cybersecurity incident response and recovery, and cybersecurity assessment. It also provides cyber electronic warfare and intelligence solutions for government bodies and armed forces, such as D-SINT, an advanced intelligence analytics platform to collect, analyze, and transform heterogeneous data flows into strategic intelligence outcome; TACTICAL RTA to support the cyber team focusing on real-time threats; Homeland Security Solutions to deliver surveillance and control capabilities; and DIGILAB to perform digital activities for platform and system analysis, vulnerability management, and attack pattern engineering. In addition, the company develops platforms for network intelligence to support law enforcement agencies and security agencies in conducting operations; and provides clients with support in the design and development of cyber electromagnetic attack systems and simulation models. Cy4gate S.P.A. is based in Rome, Italy.",
    "website": "http://www.cy4gate.com/en",
    "zipcode": "00131"
  },
  "CYB.MI": {
    "city": "Reggio Emilia",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Software - Infrastructure",
    "long_name": "Cyberoo S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "CYBEROO",
    "state": "RE",
    "summary": "Cyberoo S.p.A. provides cyber security, smart monitoring, and managed services. The company offers Cyber Security Suite, a platform that provides a range of services to protect companies from various types of cyber attacks; and managed services, including datacenter, cloud, and device management services. It also provides Titaan, a system behavior analyzer that collects and correlates the logs of services, applications, virtual servers, server infrastructure, and network assets in a user-friendly dashboard. The company is headquartered in Reggio Emilia, Italy.",
    "website": "http://cyberoo.com",
    "zipcode": "42124"
  },
  "DAF.F": {
    "city": "Rome",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Be Shaping The Future S.p.A.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "BE SHAPING THE FUTURE SPA",
    "state": "RM",
    "summary": "Be Shaping The Future S.p.A. provides business consulting, information technology, and professional services in Italy, Germany, Austria, Switzerland, the United Kingdom, Spain, Poland, Ukraine, and Romania. It operates through Business Consulting and ICT Solutions segments. The Business Consulting segment offers business consulting services in the areas of payment systems, planning and control methods, regulatory compliance, information gathering, and corporate governance systems for financial processes and asset management. This segment provides management consulting services for financial institutions; financial services consulting services in the banking and financial sectors; consulting and development services in the areas of accounting, bank reporting, and compliance; and advisory services for operators in the payments industry. The ICT Solutions segment offers ICT consulting and system integration services for proprietary products/platforms. This segment also develops digital, web, and mobile solutions; and web-based and multimedia software solutions. The company was formerly known as Be Think, Solve, Execute S.p.A. and changed its name to Be Shaping The Future S.p.A. in May 2020. The company was founded in 1987 and is headquartered in Rome, Italy.",
    "website": "http://www.be-tse.it",
    "zipcode": "00144"
  },
  "DAL.MI": {
    "city": "Bologna",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Computer Hardware",
    "long_name": "Datalogic S.p.A.",
    "market": "it_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "DATALOGIC",
    "state": "BO",
    "summary": "Datalogic S.p.A. manufactures and sells automatic data capture and process automation products in Europe, the Middle East, India, Africa, North America, Latin America, and the Asia Pacific. It operates through Datalogic, Solution Net Systems, and Informatics segments. The company offers fixed retail scanners, including single plane scanners, presentation scanners, multi-plane imaging scanner/scales, and loss prevention solutions; general duty and industrial handheld scanners; mobile computers, such as pocket-sized to full-alpha-keyboard hand-held devices, industrial PDAs, pistol-grip terminals, vehicle mounted computers, and middleware software solutions; and laser marking products for the manufacture of automotive, electronics, medical devices, and high precision metals. It also provides photoelectric, inductive proximity, ultrasonic, and optical encoder sensors, as well as sensor accessories; safety light curtains for machine safeguarding and access control; smart cameras, vision processors, vision sensors, cameras, and software and tools; and laser bar code and image-based ID scanners, connectivity products, dimensioners, and linear cameras. In addition, the company offers UHF RFID devices; and various OEM products consisting of embedded and bolt-on bar code scanning solutions to the suppliers of self-checkout systems, kiosks, price verifiers, vending machines, and others. It serves retail, manufacturing, transportation and logistics, and healthcare sectors. The company was founded in 1972 and is headquartered in Bologna, Italy. Datalogic S.p.A. is a subsidiary of Hydra S.p.A.",
    "website": "http://www.datalogic.com",
    "zipcode": "40012"
  },
  "DGV.MI": {
    "city": "Milan",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "Digital Value S.p.A.",
    "market": "it_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "DIGITAL VALUE",
    "state": "MI",
    "summary": "Digital Value S.p.A. provides technology and service solutions to the telecommunications, utilities, energy, defense, transportation, and finance sectors in Italy. It offers services in the areas of data center and hybrid cloud, networking and intelligence networks, infrastructural enterprise software, ICT security and cybersecurity, and digital transformation. The company is headquartered in Milan, Italy.",
    "website": "http://www.digitalvalue.it",
    "zipcode": "20124"
  },
  "DHH.MI": {
    "city": "Milan",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Software - Infrastructure",
    "long_name": "Dominion Hosting Holding S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "DHH",
    "state": "MI",
    "summary": "Dominion Hosting Holding S.p.A. provides web hosting and software services for small and medium-sized enterprises in Europe. The company also offers cloud computing, such as solutions as-a-services (SaaS), IaaS, and PaaS services; cloud hosting; domain name registration, website builders, data management certificates, and business mail products; shared and dedicated hosting; virtual private server hosting; domain name transfer; and housing and colocation solutions. In addition, it offers productivity tools, which include website creation software; SSL certificates; mail services for email management; cloud appliance, a tool for infrastructure safety; cloud data protection; cloud monitor, a tool for monitoring websites, servers, networks, and applications; cloud backup for backup of computer, desktop, workstation, server, and virtual machine; cloud object storage to store and archive files and media; cloud streaming platform to support the main definition streaming format; and control panel to manage all the functionalities of domain and all customers account. The company was founded in 2015 and is headquartered in Milan, Italy.",
    "website": "http://dhh.international",
    "zipcode": "20153"
  },
  "DOX.MI": {
    "city": "Modena",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Software - Infrastructure",
    "long_name": "Doxee S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "DOXEE",
    "state": "MO",
    "summary": "Doxee S.p.A. develops cloud technologies in Italy, the United States, and the Czech Republic. It offers Doxee Document Experience (dX), a customer communications management product for managing business processes related to data transformation and document production, distribution, and archiving; Doxee Paperless Experience (pX) for dematerialization of processes, such as electronic invoicing and legally compliant digital storage; and Doxee Pvideo and Doxee Pweb for digital customer experience. The company serves utilities, telecommunications and media, banking, insurance, travel, and leisure industries, as well as governments. Doxee S.p.A. is headquartered in Modena, Italy.",
    "website": "http://www.doxee.com",
    "zipcode": "41123"
  },
  "DT8A.F": {
    "city": "Bologna",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Computer Hardware",
    "long_name": "Datalogic S.p.A.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "DATALOGIC  EO -,52",
    "state": "BO",
    "summary": "Datalogic S.p.A. manufactures and sells automatic data capture and process automation products in Europe, the Middle East, India, Africa, North America, Latin America, and the Asia Pacific. It operates through Datalogic, Solution Net Systems, and Informatics segments. The company offers fixed retail scanners, including single plane scanners, presentation scanners, multi-plane imaging scanner/scales, and loss prevention solutions; general duty and industrial handheld scanners; mobile computers, such as pocket-sized to full-alpha-keyboard hand-held devices, industrial PDAs, pistol-grip terminals, vehicle mounted computers, and middleware software solutions; and laser marking products for the manufacture of automotive, electronics, medical devices, and high precision metals. It also provides photoelectric, inductive proximity, ultrasonic, and optical encoder sensors, as well as sensor accessories; safety light curtains for machine safeguarding and access control; smart cameras, vision processors, vision sensors, cameras, and software and tools; and laser bar code and image-based ID scanners, connectivity products, dimensioners, and linear cameras. In addition, the company offers UHF RFID devices; and various OEM products consisting of embedded and bolt-on bar code scanning solutions to the suppliers of self-checkout systems, kiosks, price verifiers, vending machines, and others. It serves retail, manufacturing, transportation and logistics, and healthcare sectors. The company was founded in 1972 and is headquartered in Bologna, Italy. Datalogic S.p.A. is a subsidiary of Hydra S.p.A.",
    "website": "http://www.datalogic.com",
    "zipcode": "40012"
  },
  "E2Y.F": {
    "city": "Cittaducale",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Semiconductors",
    "long_name": "EEMS Italia SpA",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "EEMS ITALIA S.P.A. EO-,50",
    "state": "RI",
    "summary": "EEMS Italia SpA operates in the semiconductor and photovoltaic sectors. It offers assembling and testing services for semiconductor and DRAM memories; and engineering, development, and installation services for turnkey photovoltaic systems. The company is based in Cittaducale, Italy.",
    "website": "http://www.eems.it",
    "zipcode": "02015"
  },
  "E5T.F": {
    "city": "Amaro",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Computer Hardware",
    "long_name": "Eurotech S.p.A.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "EUROTECH S.P.A.",
    "state": "UD",
    "summary": "Eurotech S.p.A. engages in the research and development, production, and marketing of miniaturized computers and high-performance computers featuring high computing capacity in Italy and internationally. The company offers embedded boards and modules, such as COM Express CPU-modules, small form factor boards, single board computers, VME boards, compact peripheral component interconnect boards, PC/104 boards, and development kits. It also provides embedded and edge computers, HMIs and displays, and expansion modules; mobile access routers, data loggers and storage systems, and networking modules; and high performance embedded computing systems, switches, and boards for data access and management. In addition, the company offers intelligent sensors, such as people counters and environmental monitoring systems; multi-service IoT edge gateways, IoT edge framework, and IoT integration platform; wearable devices and handheld computers, as well as G-Station, a supercomputer solution. Further, it provides IoT consulting and solutions and product design and manufacturing services. The company serves industrial and automation, transportation and mobility, energy and utilities, defense and aerospace, and medical and healthcare markets. Eurotech S.p.A. was founded in 1992 and is headquartered in Amaro, Italy.",
    "website": "http://www.eurotech.com",
    "zipcode": "33020"
  },
  "EEMS.MI": {
    "city": "Cittaducale",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Semiconductors",
    "long_name": "EEMS Italia SpA",
    "market": "it_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "EEMS",
    "state": "RI",
    "summary": "EEMS Italia SpA operates in the semiconductor and photovoltaic sectors. It offers assembling and testing services for semiconductor and DRAM memories; and engineering, development, and installation services for turnkey photovoltaic systems. The company is based in Cittaducale, Italy.",
    "website": "http://www.eems.it",
    "zipcode": "02015"
  },
  "ELES.MI": {
    "city": "Todi",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Semiconductor Equipment & Materials",
    "long_name": "ELES Semiconductor Equipment S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "ELES",
    "state": "PG",
    "summary": "ELES Semiconductor Equipment S.p.A. designs, manufactures, and sells test equipment, fixtures, solutions, and services for the semiconductor industry in Italy. It serves customers in automotive, defence, aerospace, industrial, IoT, and communication, as well as electronic control unit, electronic module, and system markets. The company was founded in 1988 and is headquartered in Todi, Italy.",
    "website": "http://www.eles.com",
    "zipcode": "06059"
  },
  "ENT.MI": {
    "city": "Frosinone",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Solar",
    "long_name": "Enertronica Santerno S.p.A.",
    "market": "it_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "ENERTRONICA SANTERNO",
    "state": "FR",
    "summary": "Enertronica Santerno S.p.A. operates in the field of renewable energy in Italy and internationally. It provides engineering, procurement, and construction services for building photovoltaic power plants for electricity production. The company also engages in the design and realization of anchoring systems of photovoltaic modules comprising mounting systems for pitched and flat roofs, facades, cantilevered roofs, and greenhouses; and mono-axial and biaxial solar tracking systems. In addition, it offers services to enhance the energy efficiency of plants/systems, installations, and/or places; and operates as a reseller and distributor of electricity. Enertronica Santerno S.p.A. is headquartered in Frosinone, Italy.",
    "website": "http://www.enertronica.it",
    "zipcode": "03100"
  },
  "EP4A.F": {
    "city": "Vimercate",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronics & Computer Distribution",
    "long_name": "Esprinet S.p.A.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "ESPRINET S.P.A.  EO -,15",
    "state": "MI",
    "summary": "Esprinet S.p.A., together with its subsidiaries, engages in the wholesale distribution of information technology (IT) and consumer electronics primarily in Italy, Spain, Portugal, and rest of Europe. The company distributes business to business IT products, such as hardware, software, and value-added services; consumer electronics; traditional IT products, including desktop PCs, notebooks, printers, copiers, servers, standard software, etc.; consumables comprising cartridges, tapes, toners, and magnetic supports; tablets, mobile devices, and accessories; networking products consisting of modems, routers, and switches; and digital and entertainment products, such as TVS, photo cameras, video cameras, videogames, and MP3/MP4 readers. It also engages in the design, production, and distribution of mobile devices accessories. The company markets its smartphones accessories under the Celly brand name and IT accessories and outdoor technology under the Nilox brand. It serves IT resellers, including value-added resellers, system integrators/corporate resellers, dealers, independent and/or affiliated stores, general and/or specialist retailers, and sub-distributors. Esprinet S.p.A. is headquartered in Vimercate, Italy.",
    "website": "http://www.esprinet.com",
    "zipcode": "20871"
  },
  "ETH.MI": {
    "city": "Amaro",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Computer Hardware",
    "long_name": "Eurotech S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "EUROTECH",
    "state": "UD",
    "summary": "Eurotech S.p.A. engages in the research and development, production, and marketing of miniaturized computers and high-performance computers featuring high computing capacity in Italy and internationally. The company offers embedded boards and modules, such as COM Express CPU-modules, small form factor boards, single board computers, VME boards, compact peripheral component interconnect boards, PC/104 boards, and development kits. It also provides embedded and edge computers, HMIs and displays, and expansion modules; mobile access routers, data loggers and storage systems, and networking modules; and high performance embedded computing systems, switches, and boards for data access and management. In addition, the company offers intelligent sensors, such as people counters and environmental monitoring systems; multi-service IoT edge gateways, IoT edge framework, and IoT integration platform; wearable devices and handheld computers, as well as G-Station, a supercomputer solution. Further, it provides IoT consulting and solutions and product design and manufacturing services. The company serves industrial and automation, transportation and mobility, energy and utilities, defense and aerospace, and medical and healthcare markets. Eurotech S.p.A. was founded in 1992 and is headquartered in Amaro, Italy.",
    "website": "http://www.eurotech.com",
    "zipcode": "33020"
  },
  "EXSY.MI": {
    "city": "Modena",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Software - Application",
    "long_name": "Expert System S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "EXPERT SYSTEM",
    "state": "MO",
    "summary": "Expert System S.p.A. develops and sells cognitive computing software products based on artificial intelligence (AI) algorithms to read and understand written language in Italy and internationally. The company offers Cogito cognitive technology for cognitive computing; Cogito Discover for text analytics, and extraction and categorization software; Cogito Intelligence Platform, an information intelligence software for real-time analysis of unstructured data streams; Cogito Answers, a customer support automation software that allows human like interaction between customers and internal staff; and Cogito for Claims that automate insurance claims management with natural language understanding. It also provides Cogito for Underwriting to enhance the insurance underwriting process and streamlines the risk assessment; Cogito Studio, a fully integrated development environment for building and deploying a custom AI-based text model that leverages the cognitive abilities of the Cogito platform; and Clinical Research Navigator that supports biomedical researchers with a single platform for revealing insights to drive their research and support discovery of therapies for infectious diseases, such as COVID-19 and other health crises. In addition, the company offers Medical Intelligence Platform that provides information analysts with a solution to acquire, analyze, search, and explore data points related to biological risks; and Cogito for Life Sciences to mimic the human like comprehension of scientific content, such as publications, patents, clinical trials, or medical reports. The company serves the banking and insurance, public administration, life science and pharma, oil and gas, media and publishing, and telco and utilities industries, as well as defense, and intelligence and law enforcement industries. Expert System S.p.A. was founded in 1989 and is headquartered in Modena, Italy.",
    "website": "http://www.expertsystem.com",
    "zipcode": "41123"
  },
  "FOS.MI": {
    "city": "Genoa",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "Fos S.p.A.",
    "market": "it_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "FOS",
    "state": "GE",
    "summary": "Fos S.p.A. provides technological consultancy services in Italy. The company engages in design and implementation of software solutions for health/medical and transport and shipping industries, banks and insurance companies, central and local public administrations; environment development; design software development; and software configuration management. It is also involved in design and implementation network operations centers and access solutions to business applications; design, installation, and management of local network and datacenter architectures, and corporate VPNs and application portals; design and management of geographic networks and dynamic routing protocols; provision of cyber security solutions comprising design and operational management of security architectures; definition and implementation of IS policies for sensitive data protection; and configuration of the security policies, as well as provision of cloud computing services, and solutions for Big Data/mail/database optimization projects; network, security, server, storage, back-up consolidation; and disaster recovery and business continuity solutions. In addition, the company offers integrated repair and testing of electronic equipment for telecommunications, gaming, railway, and medical sectors; and development, prototyping, testing, and engineering solutions for different application fields, such as industry 4.0, health, energy, agriculture, and environment. Further, it provides specialized services for industrial automation, including supervision and monitoring systems, control rooms, building management systems, consumption monitoring, and remote meter reading; intervention management, teams and personnel management, predictive maintenance, and spare parts warehouse management; and 3D services comprising technical modeling, visual modeling, animation, prototyping, virtual and augmented reality, and simulation and analysis. The company was founded in 1999 and is based in Genoa, Italy.",
    "website": "http://www.gruppofos.it/index.php/it",
    "zipcode": "16126"
  },
  "GE.MI": {
    "city": "Provaglio D'iseo",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Electronic Components",
    "long_name": "Gefran S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "GEFRAN",
    "state": "BS",
    "summary": "Gefran S.p.A., together with its subsidiaries, designs and produces automation components and industrial process control systems Italy, Europe, the United States, Asia, and internationally. It operates through three segments: Sensors, Automation Components, and Motion Control. The company offers magnetostrictive, potentiometer, rotary, inclinometer, and linear by wire position sensors; industrial and melt-high temperature pressure sensors; strain and force sensors; and thermocouple and resistance thermometer temperature sensors. It also provides controllers and programmers, and indicators and alarm units; power controllers, solid state relays with/without heatsinks, and fieldbuses; automation platforms; inverters for industrial applications and elevators, DC drives, Regen and AC/DC power suppliers, and special configurations; and servodrives and motors. Its products are used in plastic, mobile hydraulic, heat treatment, lift, metal, hoist and crane, water, food, heating process, and painting, as well as heating, ventilation, and air conditioning applications. The company is headquartered in Provaglio d'Iseo, Italy. Gefran S.p.A. operates as a subsidiary of Fingegran Srl.",
    "website": "http://www.gefran.com",
    "zipcode": "25050"
  },
  "GF7.F": {
    "city": "Provaglio D'iseo",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronic Components",
    "long_name": "Gefran S.p.A.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "GEFRAN SPA  EO 1",
    "state": "BS",
    "summary": "Gefran S.p.A., together with its subsidiaries, designs and produces automation components and industrial process control systems Italy, Europe, the United States, Asia, and internationally. It operates through three segments: Sensors, Automation Components, and Motion Control. The company offers magnetostrictive, potentiometer, rotary, inclinometer, and linear by wire position sensors; industrial and melt-high temperature pressure sensors; strain and force sensors; and thermocouple and resistance thermometer temperature sensors. It also provides controllers and programmers, and indicators and alarm units; power controllers, solid state relays with/without heatsinks, and fieldbuses; automation platforms; inverters for industrial applications and elevators, DC drives, Regen and AC/DC power suppliers, and special configurations; and servodrives and motors. Its products are used in plastic, mobile hydraulic, heat treatment, lift, metal, hoist and crane, water, food, heating process, and painting, as well as heating, ventilation, and air conditioning applications. The company is headquartered in Provaglio d'Iseo, Italy. Gefran S.p.A. operates as a subsidiary of Fingegran Srl.",
    "website": "http://www.gefran.com",
    "zipcode": "25050"
  },
  "INDB.MI": {
    "city": "Sant'agata Feltria",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Consumer Electronics",
    "long_name": "Indel B S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "INDEL B",
    "state": "RN",
    "summary": "Indel B S.p.A. produces and sells mobile refrigerators worldwide. The company offers fridges and parking air coolers for cars, off road vehicles, motor homes/caravans, commercial vehicles, mini buses, luxury coaches, and ambulances; and hotel minibars, electronic safes, lock systems, hairdryers, LED lighting products, and LED televisions. It also provides wine cellars for the manufacturers of home appliances; small refrigerators under the FrigoLatte brand for use in milk preservation refrigerators for coffee machine manufacturers; refrigerators for use in the after-market and cruise applications; and built-in fridges for OEMs, as well as equipment for cabin cruiser yacht, including built in and portable fridges, water heaters, cooling units, ice makers, and freezers under the Indel Webasto Marine name. The company was founded in 1967 and is based in Sant'Agata Feltria, Italy. Indel B S.p.A. is a subsidiary of Amp.Fin S.R.L.",
    "website": "http://www.indelb.com",
    "zipcode": "47866"
  },
  "ITW.MI": {
    "city": "Ravenna",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "Itway S.p.A.",
    "market": "it_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "IT WAY",
    "state": "RA",
    "summary": "Itway S.p.A. engages in the cybersecurity, data science, and safety business. The company offers consultancy, planning, and system integration services in the field of cyber security, such as GDPR and Internet of Things, as well as work safety in the environment, health, and safety sectors. It also provides data science and data management services and solutions for the scientific and cultural heritage markets, as well as big data services; and managed security services and network monitoring services. In addition, the company distributes software and hardware products; involved in the certification of the software technologies; and offers pre- and post-sales technical assistance services. It offers a combination of services that cover the range of activities connected to the management of information systems and security of large- and medium-sized firms. The company was founded in 1996 and is headquartered in Ravenna, Italy.",
    "website": "http://www.itway.com",
    "zipcode": "48124"
  },
  "IW3.F": {
    "city": "Ravenna",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Itway S.p.A.",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "ITWAY SPA",
    "state": "RA",
    "summary": "Itway S.p.A. engages in the cybersecurity, data science, and safety business. The company offers consultancy, planning, and system integration services in the field of cyber security, such as GDPR and Internet of Things, as well as work safety in the environment, health, and safety sectors. It also provides data science and data management services and solutions for the scientific and cultural heritage markets, as well as big data services; and managed security services and network monitoring services. In addition, the company distributes software and hardware products; involved in the certification of the software technologies; and offers pre- and post-sales technical assistance services. It offers a combination of services that cover the range of activities connected to the management of information systems and security of large- and medium-sized firms. The company was founded in 1996 and is headquartered in Ravenna, Italy.",
    "website": "http://www.itway.com",
    "zipcode": "48124"
  },
  "IW7.F": {
    "city": "Molfetta",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Exprivia S.p.A.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "EXPRIVIA SPA  EO 0,52",
    "state": "BA",
    "summary": "Exprivia S.p.A. provides digital transformation solutions in Italy and internationally. The company offers big data and analytics, cloud, Internet of things, IT security, mobile, SAP, and business process outsourcing solutions. It also designs and manages services and infrastructure for call centers, contact centers, and helpdesks; and develops ground stations for the reception and processing of satellite data. In addition, the company organizes and manages Master in Management and Industrial Development program, as well as specialized seminars and training courses for companies and public administration; offers professional and project development services in the SAP environment, IT infrastructure, and WEB portal development; and provides healthcare solutions and information systems. It serves the banking, finance, and insurance; telecom and media; energy and utilities; aerospace and defense; manufacturing and distribution; healthcare; and public sector industries. The company is headquartered in Molfetta, Italy.",
    "website": "http://www.exprivia.it",
    "zipcode": "70056"
  },
  "MAIL.MI": {
    "city": "Milan",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Software - Application",
    "long_name": "MailUp S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "MAILUP",
    "state": "MI",
    "summary": "Mailup S.p.A., together with its subsidiaries, engages in the cloud marketing technology business in Italy, other European countries, the Americas, and Asia. It operates through E-mail Marketing, Mobile Marketing/Messaging, and Marketing Automation Segments. The company is involved in the development and sale of technologies for the mass sending of e-mails and mobile messaging through the SMS channel for marketing and transaction purposes. It also provides e-mail and newsletter editing tools; marketing technology solutions; and professional consulting services. In addition, the company offers MailUp, a platform that offers data presentation tools, including statistics for engagement that presents statistical data to help users enhance the effectiveness of their campaigns through e-mail and then to take corrective actions to enhance the performance of future campaigns, as well as the multi-list dashboard feature, which is a summary tool to have an immediate overview of the progress of campaigns. Further, it provides BEE, a drag-and-drop editor for e-mails and landing pages; Acumbamail, a Spanish e-mail marketing platform, which allows the creation, sending, and management of multi-channel marketing campaign; and Datatrics platform, which allows the marketing teams to build experiences based on data managed by artificial intelligence. Mailup S.p.A. was founded in 2002 and is headquartered in Milan, Italy.",
    "website": "http://www.mailupgroup.com",
    "zipcode": "20124"
  },
  "MAPS.MI": {
    "city": "Parma",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Software - Application",
    "long_name": "Maps S.p.A.",
    "market": "it_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "MAPS",
    "state": "PR",
    "summary": "Maps S.p.A., a software solution provider, designs and develops technological solutions to support decision-making processes in public and private businesses and organizations. It offers Webdistilled, a semantic analysis system for marketing and communications agencies; Clinika, a semantics-based processing tool for clinical data; GZoom that supports governance in public bodies and complex organizations; and Greennebula, a cloud system for online management of environmental permits. The company is headquartered in Parma, Italy.",
    "website": "http://mapsgroup.it",
    "zipcode": "43122"
  },
  "MFT.MI": {
    "city": "Milan",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Computer Hardware",
    "long_name": "Matica Fintec S.p.A.",
    "market": "it_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "MATICA FINTEC",
    "state": "MI",
    "summary": "Matica Fintec S.p.A. develops, manufactures, and markets security document issuance systems in Italy. The company also offers data processing systems, office machines, and plastic card processing systems. In addition, it exports its products to approximately 100 countries worldwide. The company is headquartered in Milan, Italy.",
    "website": "http://www.maticafintec.com",
    "zipcode": "20121"
  },
  "N0X0.F": {
    "city": "Milan",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Infrastructure",
    "long_name": "Nexi S.p.A.",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "NEXI SPA  (UNSP.ADR)/1",
    "state": "MI",
    "summary": "Nexi S.p.A. provides electronic money and payment services to banks, financial and insurance institutions, merchants, businesses, and public administration in Italy. The company offers acquiring services; configuration, activation, and maintenance of POS terminals; fraud prevention; and dispute management services, as well as customer support services. It also provides a range of issuing services, such as issue, supply, and management of private and corporate payment cards; installation and management of ATM's; clearing services; and digital banking services for the management of current accounts and payments. In addition, the company offers software applications for invoice management and storage, prepaid card reloading, bill payments, and postal payments. The company was founded in 1939 and is based in Milan, Italy. Nexi S.p.A. is a subsidiary of Mercury UK Holdco Limited.",
    "website": "http://www.nexi.it",
    "zipcode": "20149"
  },
  "N0XA.F": {
    "city": "Milan",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Infrastructure",
    "long_name": "Nexi S.p.A.",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "NEXI S.P.A.",
    "state": "MI",
    "summary": "Nexi S.p.A. provides electronic money and payment services to banks, financial and insurance institutions, merchants, businesses, and public administration in Italy. The company offers acquiring services; configuration, activation, and maintenance of POS terminals; fraud prevention; and dispute management services, as well as customer support services. It also provides a range of issuing services, such as issue, supply, and management of private and corporate payment cards; installation and management of ATM's; clearing services; and digital banking services for the management of current accounts and payments. In addition, the company offers software applications for invoice management and storage, prepaid card reloading, bill payments, and postal payments. The company was founded in 1939 and is based in Milan, Italy. Nexi S.p.A. is a subsidiary of Mercury UK Holdco Limited.",
    "website": "http://www.nexi.it",
    "zipcode": "20149"
  },
  "NEXI.MI": {
    "city": "Milan",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Software - Infrastructure",
    "long_name": "Nexi S.p.A.",
    "market": "it_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "NEXI",
    "state": "MI",
    "summary": "Nexi S.p.A. provides electronic money and payment services to banks, financial and insurance institutions, merchants, businesses, and public administration in Italy. The company offers acquiring services; configuration, activation, and maintenance of POS terminals; fraud prevention; and dispute management services, as well as customer support services. It also provides a range of issuing services, such as issue, supply, and management of private and corporate payment cards; installation and management of ATM's; clearing services; and digital banking services for the management of current accounts and payments. In addition, the company offers software applications for invoice management and storage, prepaid card reloading, bill payments, and postal payments. The company was founded in 1939 and is based in Milan, Italy. Nexi S.p.A. is a subsidiary of Mercury UK Holdco Limited.",
    "website": "http://www.nexi.it",
    "zipcode": "20149"
  },
  "NEXI.VI": {
    "city": "Milan",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "VIE",
    "industry": "Software - Infrastructure",
    "long_name": "Nexi S.p.A.",
    "market": "at_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "NEXI SPA",
    "state": "MI",
    "summary": "Nexi S.p.A. provides electronic money and payment services to banks, financial and insurance institutions, merchants, businesses, and public administration in Italy. The company offers acquiring services; configuration, activation, and maintenance of POS terminals; fraud prevention; and dispute management services, as well as customer support services. It also provides a range of issuing services, such as issue, supply, and management of private and corporate payment cards; installation and management of ATM's; clearing services; and digital banking services for the management of current accounts and payments. In addition, the company offers software applications for invoice management and storage, prepaid card reloading, bill payments, and postal payments. The company was founded in 1939 and is based in Milan, Italy. Nexi S.p.A. is a subsidiary of Mercury UK Holdco Limited.",
    "website": "http://www.nexi.it",
    "zipcode": "20149"
  },
  "NEXPF": {
    "city": "Milan",
    "country": "Italy",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Software - Infrastructure",
    "long_name": "Nexi S.p.A.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "NEXI SPA",
    "state": "MI",
    "summary": "Nexi S.p.A. provides electronic money and payment services to banks, financial and insurance institutions, merchants, businesses, and public administration in Italy. The company offers acquiring services; configuration, activation, and maintenance of POS terminals; fraud prevention; and dispute management services, as well as customer support services. It also provides a range of issuing services, such as issue, supply, and management of private and corporate payment cards; installation and management of ATM's; clearing services; and digital banking services for the management of current accounts and payments. In addition, the company offers software applications for invoice management and storage, prepaid card reloading, bill payments, and postal payments. The company was founded in 1939 and is based in Milan, Italy. Nexi S.p.A. is a subsidiary of Mercury UK Holdco Limited.",
    "website": "http://www.nexi.it",
    "zipcode": "20149"
  },
  "NEXXY": {
    "city": "Milan",
    "country": "Italy",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Software - Infrastructure",
    "long_name": "Nexi S.p.A.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "NEXI SPA UNSPON ADS EACH REP 1 ",
    "state": "MI",
    "summary": "Nexi S.p.A. provides electronic money and payment services to banks, financial and insurance institutions, merchants, businesses, and public administration in Italy. The company offers acquiring services; configuration, activation, and maintenance of POS terminals; fraud prevention; and dispute management services, as well as customer support services. It also provides a range of issuing services, such as issue, supply, and management of private and corporate payment cards; installation and management of ATM's; clearing services; and digital banking services for the management of current accounts and payments. In addition, the company offers software applications for invoice management and storage, prepaid card reloading, bill payments, and postal payments. The company was founded in 1939 and is based in Milan, Italy. Nexi S.p.A. is a subsidiary of Mercury UK Holdco Limited.",
    "website": "http://www.nexi.it",
    "zipcode": "20149"
  },
  "NSP.MI": {
    "city": "Milan",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Software - Application",
    "long_name": "Neosperience S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "NEOSPERIENCE",
    "state": "MI",
    "summary": "Neosperience S.p.A. develops cloud based software platform. Its platform enables users to understand, engage, and grow customers. The company is based in Milan, Italy.",
    "website": "http://www.neosperience.com",
    "zipcode": "20129"
  },
  "PITE.MI": {
    "city": "Milan",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Software - Application",
    "long_name": "PITECO S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "PITECO",
    "state": "MI",
    "summary": "PITECO S.p.A. engages in the design, development, and implementation of solutions for treasury, finance, and financial planning management worldwide. The company offers PITECO EVO, a platform designed to manage cash management, payment factory, financial planning, global liquidity management, and supply chain finance; PITECO CBC, a corporate banking communication platform that manages automation of the authorization workflows; and PITECO FRM that supports corporate financial risk management processes in compliance with the international accounting codes and observing financial risk exposures. It also provides MATCH.IT, a solution to analyze and match complex data; and PITECO AT.PRO, an information system for the back and middle office management of securities portfolio. In addition, the company offers consultancy and assistance services, including consultancy tailored to client needs, customer care, software customizing, customizable product releases, and application management. It serves various customers in automation and paper, automotive, chemical and pharmaceutical, healthcare, construction and tile, consumer goods, fashion, finance and insurance, food, logistics and travelling, mechanics and steel, media, retail, services, telecom, utilities, and oil and gas industries. The company was founded in 1980 and is headquartered in Milan, Italy. PITECO S.p.A. is a subsidiary of DEDAGROUP spa.",
    "website": "http://www.pitecolab.it",
    "zipcode": "20122"
  },
  "PRT.MI": {
    "city": "Vimercate",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Electronics & Computer Distribution",
    "long_name": "Esprinet S.p.A.",
    "market": "it_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "ESPRINET",
    "state": "MI",
    "summary": "Esprinet S.p.A., together with its subsidiaries, engages in the wholesale distribution of information technology (IT) and consumer electronics primarily in Italy, Spain, Portugal, and rest of Europe. The company distributes business to business IT products, such as hardware, software, and value-added services; consumer electronics; traditional IT products, including desktop PCs, notebooks, printers, copiers, servers, standard software, etc.; consumables comprising cartridges, tapes, toners, and magnetic supports; tablets, mobile devices, and accessories; networking products consisting of modems, routers, and switches; and digital and entertainment products, such as TVS, photo cameras, video cameras, videogames, and MP3/MP4 readers. It also engages in the design, production, and distribution of mobile devices accessories. The company markets its smartphones accessories under the Celly brand name and IT accessories and outdoor technology under the Nilox brand. It serves IT resellers, including value-added resellers, system integrators/corporate resellers, dealers, independent and/or affiliated stores, general and/or specialist retailers, and sub-distributors. Esprinet S.p.A. is headquartered in Vimercate, Italy.",
    "website": "http://www.esprinet.com",
    "zipcode": "20871"
  },
  "PWS.MI": {
    "city": "Scandicci",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Consumer Electronics",
    "long_name": "Powersoft S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "POWERSOFT",
    "state": "FI",
    "summary": "Powersoft S.p.A. engages in the research and development, manufacture, and sale of pro-audio amplifiers. It offers 8-channel, 4-channel, 2-channel, and touring amplifiers; Deva, a networked multimedia system; and various OEM solutions. The company also provides accessories, including processing, KDSP, KAESOP, and programming boards, as well as plug-in output transformers, step-up cards, adapters, Deva mounting kits, and heatsinks. Its products have applications in hospitality industry, including theme parks, resorts and hotels, and bars and restaurants; retail industry comprising malls and shopping centers, and shops; houses of worship; and corporate buildings, as well as venues, such as stadiums, arts venues and theatres, convention centers, museums, and clubs. The company was founded in 1995 and is headquartered in Scandicci, Italy.",
    "website": "http://www.powersoft-audio.com",
    "zipcode": "50018"
  },
  "REEVO.MI": {
    "city": "Brugherio",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Software - Infrastructure",
    "long_name": "Reevo S.P.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "REEVO",
    "state": "MI",
    "summary": "Reevo S.P.A. provides cloud, cyber security, and hybrid cloud services to protect and store the corporate assets in its digital safe in Italy. The company is headquartered in Brugherio, Italy.",
    "website": "http://www.reevo.it",
    "zipcode": "20861"
  },
  "REJA.F": {
    "city": "Turin",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Reply S.p.A.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "REPLY S.P.A.  EO 0,13",
    "state": "TO",
    "summary": "Reply S.p.A. provides consulting, system integration, application management, and business process outsourcing services in Italy and internationally. The company implements solutions based on communication channels and digital media. It offers Brick Reply, a manufacturing operations management platform for the management and control of a factory; China Beats, a cloud-based market intelligence and social listening solution; Discovery Reply, an enterprise digital asset management platform; HI Connect, solution for the Internet of Things sphere that enables objects to connect in the network for communication; Logistics Execution Architecture Reply, a digital platform for agile and connected supply chains; and Pulse Reply, a solution that combines data science and marketing intelligence activities in an agile dashboard. The company also provides Sonar Reply, a solution for trend research; TamTamy, a platform for creating digital workplaces, enterprise social networks, and digital communities; Click Reply, a supply chain execution platform; Definio Reply, a technological platform for the collection, analysis, control, processing, and distribution of financial data; Ticuro Reply, a cloud-based platform solution for the connection of medical devices, as well as wearable and environmental sensors; and X-RAIS Reply, a reply artificial intelligence solution to support radiological diagnosis processes. In addition, it offers business process outsourcing services in the areas of finance and administration, human resources, and pharmaceutical; and CFO services. It serves automotive, energy and utilities, financial services, logistics and manufacturing, public sector and healthcare, retail and consumer products, and telco and media industries. Reply has an agreement with Amazon Web Services. The company was founded in 1995 and is headquartered in Turin, Italy.",
    "website": "http://www.reply.com/en/",
    "zipcode": "10143"
  },
  "RETI.MI": {
    "city": "Busto Arsizio",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "Reti S.p.A.",
    "market": "it_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "RETI",
    "state": "VA",
    "summary": "Reti S.p.A. provides IT consulting services. The company offers application solutions for the management of business processes, sharing of information, and facilitation of collaborative processes; and develops IT platforms and infrastructures for the networking and digitization needs of its customers, as well as management and assistance services on infrastructures and applications. It is also involved in the implementation of business strategies. The company operates in the areas of project management and business analysis, ERP, cloud, IOT, business and artificial intelligence, and cyber security. Reti S.p.A. was founded in 1994 and is based in Busto Arsizio, Italy.",
    "website": "http://www.reti.it",
    "zipcode": "21052"
  },
  "REY.MI": {
    "city": "Turin",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "Reply S.p.A.",
    "market": "it_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "REPLY",
    "state": "TO",
    "summary": "Reply S.p.A. provides consulting, system integration, application management, and business process outsourcing services in Italy and internationally. The company implements solutions based on communication channels and digital media. It offers Brick Reply, a manufacturing operations management platform for the management and control of a factory; China Beats, a cloud-based market intelligence and social listening solution; Discovery Reply, an enterprise digital asset management platform; HI Connect, solution for the Internet of Things sphere that enables objects to connect in the network for communication; Logistics Execution Architecture Reply, a digital platform for agile and connected supply chains; and Pulse Reply, a solution that combines data science and marketing intelligence activities in an agile dashboard. The company also provides Sonar Reply, a solution for trend research; TamTamy, a platform for creating digital workplaces, enterprise social networks, and digital communities; Click Reply, a supply chain execution platform; Definio Reply, a technological platform for the collection, analysis, control, processing, and distribution of financial data; Ticuro Reply, a cloud-based platform solution for the connection of medical devices, as well as wearable and environmental sensors; and X-RAIS Reply, a reply artificial intelligence solution to support radiological diagnosis processes. In addition, it offers business process outsourcing services in the areas of finance and administration, human resources, and pharmaceutical; and CFO services. It serves automotive, energy and utilities, financial services, logistics and manufacturing, public sector and healthcare, retail and consumer products, and telco and media industries. Reply has an agreement with Amazon Web Services. The company was founded in 1995 and is headquartered in Turin, Italy.",
    "website": "http://www.reply.com/en/",
    "zipcode": "10143"
  },
  "RLT.MI": {
    "city": "Milan",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Software - Application",
    "long_name": "Relatech S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "RELATECH",
    "state": "MI",
    "summary": "Relatech S.p.A., a digital enabler solution knowledge company, provides various digital solutions. It offers solutions, including projects and services in digital customer experience, big data, artificial intelligence, Internet of Things, blockchain and cyber security, and hybrid cloud field through its digital platform RePlatform. The company operates RePlatform, a cloud based customizable platform for the digital transformation process of business. It serves pharma and healthcare, retail and fashion, food and agrifood, telco, energy and utilities, banking and insurance, and industrial and logistics industries. The company was founded in 2001 and is headquartered in Milan, Italy.",
    "website": "http://www.relatech.com",
    "zipcode": "20099"
  },
  "RPYTF": {
    "city": "Turin",
    "country": "Italy",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Information Technology Services",
    "long_name": "Reply S.p.A.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "REPLY SPA",
    "state": "TO",
    "summary": "Reply S.p.A. provides consulting, system integration, application management, and business process outsourcing services in Italy and internationally. The company implements solutions based on communication channels and digital media. It offers Brick Reply, a manufacturing operations management platform for the management and control of a factory; China Beats, a cloud-based market intelligence and social listening solution; Discovery Reply, an enterprise digital asset management platform; HI Connect, solution for the Internet of Things sphere that enables objects to connect in the network for communication; Logistics Execution Architecture Reply, a digital platform for agile and connected supply chains; and Pulse Reply, a solution that combines data science and marketing intelligence activities in an agile dashboard. The company also provides Sonar Reply, a solution for trend research; TamTamy, a platform for creating digital workplaces, enterprise social networks, and digital communities; Click Reply, a supply chain execution platform; Definio Reply, a technological platform for the collection, analysis, control, processing, and distribution of financial data; Ticuro Reply, a cloud-based platform solution for the connection of medical devices, as well as wearable and environmental sensors; and X-RAIS Reply, a reply artificial intelligence solution to support radiological diagnosis processes. In addition, it offers business process outsourcing services in the areas of finance and administration, human resources, and pharmaceutical; and CFO services. It serves automotive, energy and utilities, financial services, logistics and manufacturing, public sector and healthcare, retail and consumer products, and telco and media industries. Reply has an agreement with Amazon Web Services. The company was founded in 1995 and is headquartered in Turin, Italy.",
    "website": "http://www.reply.com/en/",
    "zipcode": "10143"
  },
  "SES.MI": {
    "city": "Empoli",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "SeSa S.p.A.",
    "market": "it_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "SESA",
    "state": "FI",
    "summary": "SeSa S.p.A., through its subsidiaries, distributes value-added information technology (IT) products and solutions in Italy. Its Software and System Integration sector offers software and IT products and services; ICT products and solutions, as well as system integration services; IT infrastructure and IoT solutions; artificial intelligence and machine learning solutions; digital and business application services; and HR management solutions, as well as operates solutions on the Microsoft Dynamics platform. It also provides cloud services; digital security services; digital manufacturing, processing, and transformation solutions; management, maintenance, technical assistance, and repair services for computers and IT products; and strategic outsourcing services, as well as operates in the cloud computing and systems assistance sectors. In addition, this sector develops and markets ERP software and applications; offers solutions and integrated services on the SAP Business One platform; develops 3cad products for the furniture industry; produces and markets software products, as well as provides IT services for the retail sector; offers project management services; and provides product lifecycle management solutions for manufacturing sector. The company's Business Services sector supplies business process outsourcing, digital transformation, and fleet management and operations services; and physical and logical security services for banks and operators in the retail sector. Its Value Added Distribution sector engages in the value added distribution of technological, enterprise software and datacenter solutions; management of networking solutions; providing design services for IT solutions; marketing Hitachi data systems solutions; and distribution of the Adobe brand. The company's Corporate sector offers logistics services; and marketing and promotion services for the ICT channel. SeSa S.p.A. is headquartered in Empoli, Italy. SeSa S.p.A. is a subsidiary of ITH S.p.A.",
    "website": "http://www.sesa.it",
    "zipcode": "50053"
  },
  "SG.MI": {
    "city": "Lainate",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Electronic Components",
    "long_name": "SAES Getters S.p.A.",
    "market": "it_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "SAES GETTERS",
    "state": "MI",
    "summary": "SAES Getters S.p.A., together with its subsidiaries, develops, manufactures, and markets components and systems for industrial and scientific applications in Italy and internationally. It operates through three segments: Industrial, Medical, and Packaging. The company offers getters and dispensers for a range of industrial applications, such as electronic vacuum devices, microelectronic and micromechanical systems, image diagnostic systems, thermal insulation, and lamps and vacuum systems; shape memory alloy components and devices for home automation, white goods industry, consumer electronics, automotive sector, and luxury goods; and polymeric composites for organic and hybrid electronic applications, and photonics and implantable medical devices. It also provides cathodes and materials for thermal dissipation in electronic tubes and lasers; pumps based on non-evaporable getter (NEG) materials for use in industrial and scientific fields; and vacuum thermal insulation solutions, which include NEG products for cryogenic, solar collectors, and thermos applications. In addition, the company offers Nitinol shape memory alloys (SMA) for use in biomedical sector; and SMA actuator devices for the industrial sector, such as domotics, white goods industry, consumer electronics, automotive, and luxury sector. Further, it provides plastic films for the food packaging sector; and materials and components for functional chemical systems applications. The company also serves flexible packaging, lighting, renewable energy, scientific equipment and research facilities, and security and defense markets. SAES Getters S.p.A. was founded in 1940 and is headquartered in Lainate, Italy.",
    "website": "http://www.saesgetters.com",
    "zipcode": "20020"
  },
  "SGR.MI": {
    "city": "Lainate",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Electronic Components",
    "long_name": "SAES Getters S.p.A.",
    "market": "it_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "SAES GETTERS RISP NC",
    "state": "MI",
    "summary": "SAES Getters S.p.A., together with its subsidiaries, develops, manufactures, and markets components and systems for industrial and scientific applications in Italy and internationally. It operates through three segments: Industrial, Medical, and Packaging. The company offers getters and dispensers for a range of industrial applications, such as electronic vacuum devices, microelectronic and micromechanical systems, image diagnostic systems, thermal insulation, and lamps and vacuum systems; shape memory alloy components and devices for home automation, white goods industry, consumer electronics, automotive sector, and luxury goods; and polymeric composites for organic and hybrid electronic applications, and photonics and implantable medical devices. It also provides cathodes and materials for thermal dissipation in electronic tubes and lasers; pumps based on non-evaporable getter (NEG) materials for use in industrial and scientific fields; and vacuum thermal insulation solutions, which include NEG products for cryogenic, solar collectors, and thermos applications. In addition, the company offers Nitinol shape memory alloys (SMA) for use in biomedical sector; and SMA actuator devices for the industrial sector, such as domotics, white goods industry, consumer electronics, automotive, and luxury sector. Further, it provides plastic films for the food packaging sector; and materials and components for functional chemical systems applications. The company also serves flexible packaging, lighting, renewable energy, scientific equipment and research facilities, and security and defense markets. SAES Getters S.p.A. was founded in 1940 and is headquartered in Lainate, Italy.",
    "website": "http://www.saesgetters.com",
    "zipcode": "20020"
  },
  "SOU.MI": {
    "city": "Rome",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "Sourcesense S.p.A.",
    "market": "it_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "SOURCESENSE",
    "state": "RM",
    "summary": "Sourcesense S.p.A. develops and sells Open Source cloud based software solutions in Italy. The company offers solutions for business transformation. It serves clients in industrial and service, telco and utility, publishing and media, banking and insurance, fashion and gaming, and public administration sectors. The company was founded in 2001 and is based in Rome, Italy.",
    "website": "http://www.sourcesense.com",
    "zipcode": "00144"
  },
  "TAQ.F": {
    "city": "Rome",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Infrastructure",
    "long_name": "TAS Tecnologia Avanzata dei Sistemi S.p.A.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "TAS TECNOLOGIA AVAN.",
    "state": "RM",
    "summary": "TAS Tecnologia Avanzata dei Sistemi S.p.A. provides software solutions for electronic money, payments, capital markets, and extended enterprise systems in Italy and other European countries. The company offers CARD 3.0 IE, a cloud-ready modular solution that manages various aspects of the card- and digital payments lifecycle; Mastercard Network Gateway Services; TAS Network Gateway, a platform for financial messaging that connects customers to domestic or international interbank network; TAS PAG provides cloud-based access to the consolidated Eurosystem central platform; and TAS Network Gateway for SCORE that helps to make payments and receive cash management information. It also provides TAS CBT FINPlatform, a solution that simplifies FIN connectivity through a direct interface for SWIFTNet FIN protocol; TAS Service Bureau, a straight-through processing solution; TAS Open Banking framework; TAS TPP Enabler, a solution designed for TPPs; and Aquarius, a liquidity management system providing an integrated view for cash, collateral, and liquid assets in central bank money and commercial bank money. In addition, the company offers MANTICA Adaptive Intelligence helps users of various levels of expertise to produce advanced analytics insights, creating operational engines on data with real time response; and hosting, cloud, data protection, managed, and engineering services. It primarily serves commercial and central banks, and financial services centers. The company was founded in 1982 and is headquartered in Rome, Italy. TAS Tecnologia Avanzata dei Sistemi S.p.A. is a subsidiary of TASNCH Holding s.r.l.",
    "website": "http://www.tasgroup.it",
    "zipcode": "00147"
  },
  "TAS.MI": {
    "city": "Rome",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Software - Infrastructure",
    "long_name": "TAS Tecnologia Avanzata dei Sistemi S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "TAS",
    "state": "RM",
    "summary": "TAS Tecnologia Avanzata dei Sistemi S.p.A. provides software solutions for electronic money, payments, capital markets, and extended enterprise systems in Italy and other European countries. The company offers CARD 3.0 IE, a cloud-ready modular solution that manages various aspects of the card- and digital payments lifecycle; Mastercard Network Gateway Services; TAS Network Gateway, a platform for financial messaging that connects customers to domestic or international interbank network; TAS PAG provides cloud-based access to the consolidated Eurosystem central platform; and TAS Network Gateway for SCORE that helps to make payments and receive cash management information. It also provides TAS CBT FINPlatform, a solution that simplifies FIN connectivity through a direct interface for SWIFTNet FIN protocol; TAS Service Bureau, a straight-through processing solution; TAS Open Banking framework; TAS TPP Enabler, a solution designed for TPPs; and Aquarius, a liquidity management system providing an integrated view for cash, collateral, and liquid assets in central bank money and commercial bank money. In addition, the company offers MANTICA Adaptive Intelligence helps users of various levels of expertise to produce advanced analytics insights, creating operational engines on data with real time response; and hosting, cloud, data protection, managed, and engineering services. It primarily serves commercial and central banks, and financial services centers. The company was founded in 1982 and is headquartered in Rome, Italy. TAS Tecnologia Avanzata dei Sistemi S.p.A. is a subsidiary of TASNCH Holding s.r.l.",
    "website": "http://www.tasgroup.it",
    "zipcode": "00147"
  },
  "TNXT.MI": {
    "city": "Rome",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "Tinexta S.p.A.",
    "market": "it_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "TINEXTA",
    "state": "RM",
    "summary": "Tinexta S.p.A. provides digital trust, credit information and management, and innovation and marketing services to large companies, banks, insurance and financial companies, SMEs, associations, and professionals in Italy and internationally. The company offers IT solutions for digital identity and the dematerialization of processes according to the applicable legislation, such as certified electronic mail, electronic storage, digital signature, digital certification, e-invoicing, electronic archiving, and e-enterprise solutions; various solutions for secure and simplified transmission of legal and financial documents; web services for accessing public administration database; additional services for the management of professional associations and billing, and IT protocol; and designs and develops IT services and solutions for SMEs, trade associations, professional firms, agencies, and financial intermediaries. The company also offers cyber security solutions; services to support decision-making processes; credit information and management services; and software solutions to comply with tax obligations, employment legislations, and other regulations, as well as electronic filing of documents and management of civil proceedings. In addition, it provides real estate information and appraisal services; and consulting services for grants, loans and tax relief, and industrial innovation, as well as temporary export management consultancy services for SMEs. The company was formerly known as Tecnoinvestimenti S.p.A. and changed its name to Tinexta S.p.A. in November 2018. The company was founded in 2009 and is headquartered in Rome, Italy. Tinexta S.p.A. is a subsidiary of Tecno Holding S.p.A.",
    "website": "http://www.tinexta.com",
    "zipcode": "00187"
  },
  "TXE.F": {
    "city": "Milan",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "TXT e-solutions S.p.A.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "TXT E-SOLUTIONS  EO-,50",
    "state": "MI",
    "summary": "TXT e-solutions S.p.A., together with its subsidiaries, provides software solutions in Italy and internationally. The company operates through two divisions, Aerospace, Aviation & Automotive, and Fintech. It provides on-board software, flight simulators, training systems, flight support systems, and advanced manufacturing solutions, as well as specialized engineering services to aerospace companies and airline operators. The company also offers on-board software and systems for the automotive and transport sectors. It also offers solutions and services for the banking and finance industry; solutions for credit collection and non-performing loans management; risk management and AML solutions; treasury; payments solutions; and consulting services. The company was formerly known as TXT Ingegneria Informatica S.p.A. and changed its name to TXT e-solutions S.p.A. in March 2000. TXT e-solutions S.p.A. was founded in 1989 and is headquartered in Milan, Italy.",
    "website": "http://www.txtgroup.com",
    "zipcode": "20126"
  },
  "TXT.MI": {
    "city": "Milan",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Software - Application",
    "long_name": "TXT e-solutions S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "TXT E-SOLUTIONS",
    "state": "MI",
    "summary": "TXT e-solutions S.p.A., together with its subsidiaries, provides software solutions in Italy and internationally. The company operates through two divisions, Aerospace, Aviation & Automotive, and Fintech. It provides on-board software, flight simulators, training systems, flight support systems, and advanced manufacturing solutions, as well as specialized engineering services to aerospace companies and airline operators. The company also offers on-board software and systems for the automotive and transport sectors. It also offers solutions and services for the banking and finance industry; solutions for credit collection and non-performing loans management; risk management and AML solutions; treasury; payments solutions; and consulting services. The company was formerly known as TXT Ingegneria Informatica S.p.A. and changed its name to TXT e-solutions S.p.A. in March 2000. TXT e-solutions S.p.A. was founded in 1989 and is headquartered in Milan, Italy.",
    "website": "http://www.txtgroup.com",
    "zipcode": "20126"
  },
  "VNT.MI": {
    "city": "Rome",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "Vantea SMART S.p.A.",
    "market": "it_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "VANTEA SMART",
    "state": "RM",
    "summary": "Vantea SMART S.p.A., an Information Technology company, engages in the provision of cybersecurity solutions and services. It develops software products and digital e-commerce platforms. The company's cybersecurity related solutions cover services for countermeasures and on assets, monitoring and automatic response services, and governance services; and security operations, on-site specialist support, security consulting, and support services on security solutions. It also provides solutions in the ERP sector; distribution sector comprising food and beverage; and concierge sector. The company was founded in 1993 and is based in Rome, Italy.",
    "website": "http://www.vantea.com",
    "zipcode": "00131"
  },
  "WIIT.MI": {
    "city": "Milan",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Software - Infrastructure",
    "long_name": "Wiit S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "WIIT",
    "state": "MI",
    "summary": "Wiit S.p.A. provides cloud services for various businesses in Italy and internationally. It offers hybrid, hosted private, and public cloud services; cloud services for critical applications; business continuity and disaster recovery services; cyber security services; technology migration programs; digital business transformation services; and services desk and desktop management solutions, as well as infrastructure configuration, management, and control services. The company was founded in 2001 and is headquartered in Milan, Italy. Wiit S.p.A. is a subsidiary of Wiit Fin S.r.l.",
    "website": "http://www.wiitgroup.com",
    "zipcode": "20121"
  },
  "XPR.MI": {
    "city": "Molfetta",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "Exprivia S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "EXPRIVIA",
    "state": "BA",
    "summary": "Exprivia S.p.A. provides digital transformation solutions in Italy and internationally. The company offers big data and analytics, cloud, Internet of things, IT security, mobile, SAP, and business process outsourcing solutions. It also designs and manages services and infrastructure for call centers, contact centers, and helpdesks; and develops ground stations for the reception and processing of satellite data. In addition, the company organizes and manages Master in Management and Industrial Development program, as well as specialized seminars and training courses for companies and public administration; offers professional and project development services in the SAP environment, IT infrastructure, and WEB portal development; and provides healthcare solutions and information systems. It serves the banking, finance, and insurance; telecom and media; energy and utilities; aerospace and defense; manufacturing and distribution; healthcare; and public sector industries. The company is headquartered in Molfetta, Italy.",
    "website": "http://www.exprivia.it",
    "zipcode": "70056"
  },
  "YSFT.MI": {
    "city": "Milan",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Software - Application",
    "long_name": "Softec S.p.A.",
    "market": "it_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "SOFTEC",
    "state": "MI",
    "summary": "Softec S.p.A., a digital platform company, provides customer experience designer services in Italy and internationally. Its cloud-based platform enables the collection, aggregation, inspection, and correlation of data about physical and nonphysical spaces to provide useful information to enhance users' experiences. The company offers experience design, data driven marketing, platform, and digital transformation services. It serves the banking, insurance, tourism, leisure, healthcare, retail, GDO, manufacturing, and food and beverage industries. The company was founded in 1998 and is headquartered in Milan, Italy. Softec S.p.A. is a subsidiary of Fullsix S.p.A.",
    "website": "http://www.softecspa.com",
    "zipcode": "20158"
  }
}
