{"1S3.F": {"short_name": "SESA S.P.A.", "long_name": "SeSa S.p.A.", "summary": "SeSa S.p.A., through its subsidiaries, distributes value-added information technology (IT) products and solutions in Italy. Its Software and System Integration sector offers software and IT products and services; ICT products and solutions, as well as system integration services; IT infrastructure and IoT solutions; artificial intelligence and machine learning solutions; digital and business application services; and HR management solutions, as well as operates solutions on the Microsoft Dynamics platform. It also provides cloud services; digital security services; digital manufacturing, processing, and transformation solutions; management, maintenance, technical assistance, and repair services for computers and IT products; and strategic outsourcing services, as well as operates in the cloud computing and systems assistance sectors. In addition, this sector develops and markets ERP software and applications; offers solutions and integrated services on the SAP Business One platform; develops 3cad products for the furniture industry; produces and markets software products, as well as provides IT services for the retail sector; offers project management services; and provides product lifecycle management solutions for manufacturing sector. The company's Business Services sector supplies business process outsourcing, digital transformation, and fleet management and operations services; and physical and logical security services for banks and operators in the retail sector. Its Value Added Distribution sector engages in the value added distribution of technological, enterprise software and datacenter solutions; management of networking solutions; providing design services for IT solutions; marketing Hitachi data systems solutions; and distribution of the Adobe brand. The company's Corporate sector offers logistics services; and marketing and promotion services for the ICT channel. SeSa S.p.A. is headquartered in Empoli, Italy. SeSa S.p.A. is a subsidiary of ITH S.p.A.", "currency": "EUR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "FRA", "market": "dr_market", "country": "Italy", "city": "Empoli"}, "5TE.F": {"short_name": "TECHEDGE S.P.A.  EO 1", "long_name": "Techedge S.p.A.", "summary": "Techedge S.p.A. provides business solutions and services worldwide. The company offers SAP S/4HANA, customer relationship management, data intelligence, cloud expedition, industry 4.0, corporate and business functions, and artificial intelligence solutions to automotive, consumer goods, energy and utility, fashion, financial services, life sciences, and manufacturing industries. It also provides tailor made solutions, including Workspace Manager and COVID-19 Tracker, a plug and play cloud solution to improve employees safety in COVID-19 times; Intelligent Venue, a solution to manage venue services such as, parking lot, bathroom, and waiting lines; Supplier Collaboration Portal, a collaboration platform to support the interactions with service providers; Mobile Payment, a payment solution; and Sharing Services, a consumer application for sharing of digital services among users. In addition, the company's tailor made solutions include Store Receipts Data Analysis, a platform that extracts, transforms, and loads stores data to BigQuery for data aggregation and data analysis; Photoshooting Management, a cross-platform desktop and mobile application to manage photoshoots; Intelligent Yard Management, a solution to manage entrances and exits, deliveries, and receptions at the factory; Contract Analysis with Text Mining, a service to analyze mortgage or credit card contracts; and Top Management Dashboard, a mobile app designed for top management, as well as solutions for home delivery data discovery, stock visibility, annual purchased value optimization, and event management. Further, it offers digital advisory services, including business process optimization and factory optimization. The company was founded in 2004 and is based in Milan, Italy.", "currency": "EUR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "FRA", "market": "dr_market", "country": "Italy", "city": "Milan"}, "5TE.MU": {"short_name": "TECHEDGE S.P.A.  EO 1", "long_name": "Techedge S.p.A.", "summary": "Techedge S.p.A. provides business solutions and services worldwide. The company offers SAP S/4HANA, customer relationship management, data intelligence, cloud expedition, industry 4.0, corporate and business functions, and artificial intelligence solutions to automotive, consumer goods, energy and utility, fashion, financial services, life sciences, and manufacturing industries. It also provides tailor made solutions, including Workspace Manager and COVID-19 Tracker, a plug and play cloud solution to improve employees safety in COVID-19 times; Intelligent Venue, a solution to manage venue services such as, parking lot, bathroom, and waiting lines; Supplier Collaboration Portal, a collaboration platform to support the interactions with service providers; Mobile Payment, a payment solution; and Sharing Services, a consumer application for sharing of digital services among users. In addition, the company's tailor made solutions include Store Receipts Data Analysis, a platform that extracts, transforms, and loads stores data to BigQuery for data aggregation and data analysis; Photoshooting Management, a cross-platform desktop and mobile application to manage photoshoots; Intelligent Yard Management, a solution to manage entrances and exits, deliveries, and receptions at the factory; Contract Analysis with Text Mining, a service to analyze mortgage or credit card contracts; and Top Management Dashboard, a mobile app designed for top management, as well as solutions for home delivery data discovery, stock visibility, annual purchased value optimization, and event management. Further, it offers digital advisory services, including business process optimization and factory optimization. The company was founded in 2004 and is based in Milan, Italy.", "currency": "EUR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "MUN", "market": "dr_market", "country": "Italy", "city": "Milan"}, "7T4.F": {"short_name": "TINEXTA S.P.A.", "long_name": "Tinexta S.p.A.", "summary": "Tinexta S.p.A. engages in the digital trust, credit information and management, and innovation and marketing services businesses. The company offers IT solutions for digital identity and the dematerialization of processes in line with applicable regulations. It provides products and services, such as certified electronic mail, digital preservation, electronic storage, digital signature, electronic invoicing, and cloud, telematic trust, and enterprise content management solutions for the secure and simplified transmission of legal and financial documents for companies, entities, associations, and institutions; Web services for accessing public administration database; and additional services for the management of professional associations and billing, and IT protocol services, as well as designs and develops IT services and solutions for SMEs, trade associations, professional firms, agencies, and financial intermediaries. The company also offers IT services to support decision-making processes for the granting, assessment, and credit recovery, as well as credit management and business information services for banks and SMEs. In addition, it provides real estate services, including appraisals and valuations; and advisory services for innovation, dematerialization tools for production processes, and commercial expansion and consulting services for SMEs. The company was formerly known as Tecnoinvestimenti S.p.A. and changed its name to Tinexta S.p.A. in November 2018. The company was founded in 2009 and is headquartered in Rome, Italy. Tinexta S.p.A. is a subsidiary of Tecno Holding S.p.A.", "currency": "EUR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "FRA", "market": "dr_market", "country": "Italy", "city": "Rome"}, "BEST.MI": {"short_name": "BE", "long_name": "Be Shaping The Future S.p.A.", "summary": "Be Shaping The Future S.p.A. provides business consulting, information technology, and professional services in Italy, Germany, Austria, Switzerland, the United Kingdom, Spain, Poland, Ukraine, and Romania. It operates through Business Consulting and ICT Solutions segments. The Business Consulting segment offers business consulting services in the areas of payment systems, planning and control methods, regulatory compliance, information gathering, and corporate governance systems for financial processes and asset management. This segment provides management consulting services for financial institutions; financial services consulting services in the banking and financial sectors; consulting and development services in the areas of accounting, bank reporting, and compliance; and advisory services for operators in the payments industry. The ICT Solutions segment offers ICT consulting and system integration services for proprietary products/platforms. This segment also develops digital, web, and mobile solutions; and web-based and multimedia software solutions. The company was formerly known as Be Think, Solve, Execute S.p.A. and changed its name to Be Shaping The Future S.p.A. in May 2020. The company was founded in 1987 and is headquartered in Rome, Italy.", "currency": "EUR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "MIL", "market": "it_market", "country": "Italy", "city": "Rome"}, "DAF.F": {"short_name": "BE SHAPING THE FUTURE SPA", "long_name": "Be Shaping The Future S.p.A.", "summary": "Be Shaping The Future S.p.A. provides business consulting, information technology, and professional services in Italy, Germany, Austria, Switzerland, the United Kingdom, Spain, Poland, Ukraine, and Romania. It operates through Business Consulting and ICT Solutions segments. The Business Consulting segment offers business consulting services in the areas of payment systems, planning and control methods, regulatory compliance, information gathering, and corporate governance systems for financial processes and asset management. This segment provides management consulting services for financial institutions; financial services consulting services in the banking and financial sectors; consulting and development services in the areas of accounting, bank reporting, and compliance; and advisory services for operators in the payments industry. The ICT Solutions segment offers ICT consulting and system integration services for proprietary products/platforms. This segment also develops digital, web, and mobile solutions; and web-based and multimedia software solutions. The company was formerly known as Be Think, Solve, Execute S.p.A. and changed its name to Be Shaping The Future S.p.A. in May 2020. The company was founded in 1987 and is headquartered in Rome, Italy.", "currency": "EUR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "FRA", "market": "dr_market", "country": "Italy", "city": "Rome"}, "DGV.MI": {"short_name": "DIGITAL VALUE", "long_name": "Digital Value S.p.A.", "summary": "Digital Value S.p.A. provides technology and service solutions to the telecommunications, utilities, energy, defense, transportation, and finance sectors in Italy. It offers services in the areas of data center and hybrid cloud, networking and intelligence networks, infrastructural enterprise software, ICT security and cybersecurity, and digital transformation. The company is headquartered in Milan, Italy.", "currency": "EUR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "MIL", "market": "it_market", "country": "Italy", "city": "Milan"}, "EAXR": {"short_name": "EALIXIR INC", "long_name": "Ealixir, Inc.", "summary": "Ealixir, Inc. operates in the digital industry in Italy and internationally. The company enables its clients to control and edit information posted or available on the internet. It provides various services to individuals and businesses, including Ealixir Removal, which protects the reputation of clients on the worldwide web utilizing its technological platform; Ealixir Story that assists clients in writing customized information for uploading onto the web; NewsDelete, which filters harmful financial information and misinformation from social engines; and WebID that prepares detailed reports for individuals, brands, and companies understanding the health status of a digital entity. The company was founded in 2018 and is based in Milan, Italy.", "currency": "USD", "sector": "Technology", "industry": "Information Technology Services", "exchange": "PNK", "market": "us_market", "country": "Italy", "city": "Milan"}, "EDGE.MI": {"short_name": "TECHEDGE", "long_name": "Techedge S.p.A.", "summary": "Techedge S.p.A. provides business solutions and services worldwide. The company offers SAP S/4HANA, customer relationship management, data intelligence, cloud expedition, industry 4.0, corporate and business functions, and artificial intelligence solutions to automotive, consumer goods, energy and utility, fashion, financial services, life sciences, and manufacturing industries. It also provides tailor made solutions, including Workspace Manager and COVID-19 Tracker, a plug and play cloud solution to improve employees safety in COVID-19 times; Intelligent Venue, a solution to manage venue services such as, parking lot, bathroom, and waiting lines; Supplier Collaboration Portal, a collaboration platform to support the interactions with service providers; Mobile Payment, a payment solution; and Sharing Services, a consumer application for sharing of digital services among users. In addition, the company's tailor made solutions include Store Receipts Data Analysis, a platform that extracts, transforms, and loads stores data to BigQuery for data aggregation and data analysis; Photoshooting Management, a cross-platform desktop and mobile application to manage photoshoots; Intelligent Yard Management, a solution to manage entrances and exits, deliveries, and receptions at the factory; Contract Analysis with Text Mining, a service to analyze mortgage or credit card contracts; and Top Management Dashboard, a mobile app designed for top management, as well as solutions for home delivery data discovery, stock visibility, annual purchased value optimization, and event management. Further, it offers digital advisory services, including business process optimization and factory optimization. The company was founded in 2004 and is based in Milan, Italy.", "currency": "EUR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "MIL", "market": "it_market", "country": "Italy", "city": "Milan"}, "ITW.MI": {"short_name": "IT WAY", "long_name": "Itway S.p.A.", "summary": "Itway S.p.A. engages in the cybersecurity, data science, and safety business. The company offers consultancy, planning, and system integration services in the field of cyber security, such as GDPR and Internet of Things, as well as work safety in the environment, health, and safety sectors. It also provides data science and data management services and solutions for the scientific and cultural heritage markets, as well as big data services; and managed security services and network monitoring services. In addition, the company distributes software and hardware products; involved in the certification of the software technologies; and offers pre- and post-sales technical assistance services. It offers a combination of services that cover the range of activities connected to the management of information systems and security of large- and medium-sized firms. The company was founded in 1996 and is headquartered in Ravenna, Italy.", "currency": "EUR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "MIL", "market": "it_market", "country": "Italy", "city": "Ravenna"}, "IW3.F": {"short_name": "ITWAY SPA", "long_name": "Itway S.p.A.", "summary": "Itway S.p.A. engages in the cybersecurity, data science, and safety business. The company offers consultancy, planning, and system integration services in the field of cyber security, such as GDPR and Internet of Things, as well as work safety in the environment, health, and safety sectors. It also provides data science and data management services and solutions for the scientific and cultural heritage markets, as well as big data services; and managed security services and network monitoring services. In addition, the company distributes software and hardware products; involved in the certification of the software technologies; and offers pre- and post-sales technical assistance services. It offers a combination of services that cover the range of activities connected to the management of information systems and security of large- and medium-sized firms. The company was founded in 1996 and is headquartered in Ravenna, Italy.", "currency": "EUR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "FRA", "market": "dr_market", "country": "Italy", "city": "Ravenna"}, "IW7.F": {"short_name": "EXPRIVIA SPA  EO 0,52", "long_name": "Exprivia S.p.A.", "summary": "Exprivia S.p.A. provides digital transformation solutions in Italy and internationally. The company offers big data and analytics, cloud, Internet of things, IT security, mobile, SAP, and business process outsourcing solutions. It also designs and manages services and infrastructure for call centers, contact centers, and helpdesks; and develops ground stations for the reception and processing of satellite data. In addition, the company organizes and manages Master in Management and Industrial Development program, as well as specialized seminars and training courses for companies and public administration; offers professional and project development services in the SAP environment, IT infrastructure, and WEB portal development; and provides healthcare solutions and information systems. It serves the banking, finance, and insurance; telecom and media; energy and utilities; aerospace and defense; manufacturing and distribution; healthcare; and public sector industries. The company is headquartered in Molfetta, Italy.", "currency": "EUR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "FRA", "market": "dr_market", "country": "Italy", "city": "Molfetta"}, "REJA.F": {"short_name": "REPLY S.P.A.  EO 0,13", "long_name": "Reply S.p.A.", "summary": "Reply S.p.A. provides consulting, system integration, application management, and business process outsourcing services in Italy and internationally. The company implements solutions based on communication channels and digital media. It offers Brick Reply, a manufacturing operations management platform for the management and control of a factory; China Beats, a cloud-based market intelligence and social listening solution; Discovery Reply, an enterprise digital asset management platform; HI Connect, solution for the Internet of Things sphere that enables objects to connect in the network for communication; Logistics Execution Architecture Reply, a digital platform for agile and connected supply chains; and Pulse Reply, a solution that combines data science and marketing intelligence activities in an agile dashboard. The company also provides Sonar Reply, a solution for trend research; TamTamy, a platform for creating digital workplaces, enterprise social networks, and digital communities; Click Reply, a supply chain execution platform; Definio Reply, a technological platform for the collection, analysis, control, processing, and distribution of financial data; Ticuro Reply, a cloud-based platform solution for the connection of medical devices, as well as wearable and environmental sensors; and X-RAIS Reply, a reply artificial intelligence solution to support radiological diagnosis processes. In addition, it offers business process outsourcing services in the areas of finance and administration, human resources, and pharmaceutical; and CFO services. It serves automotive, energy and utilities, financial services, logistics and manufacturing, public sector and healthcare, retail and consumer products, and telco and media industries. Reply has an agreement with Amazon Web Services. The company was founded in 1995 and is headquartered in Turin, Italy.", "currency": "EUR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "FRA", "market": "dr_market", "country": "Italy", "city": "Turin"}, "REY.MI": {"short_name": "REPLY", "long_name": "Reply S.p.A.", "summary": "Reply S.p.A. provides consulting, system integration, application management, and business process outsourcing services in Italy and internationally. The company implements solutions based on communication channels and digital media. It offers Brick Reply, a manufacturing operations management platform for the management and control of a factory; China Beats, a cloud-based market intelligence and social listening solution; Discovery Reply, an enterprise digital asset management platform; HI Connect, solution for the Internet of Things sphere that enables objects to connect in the network for communication; Logistics Execution Architecture Reply, a digital platform for agile and connected supply chains; and Pulse Reply, a solution that combines data science and marketing intelligence activities in an agile dashboard. The company also provides Sonar Reply, a solution for trend research; TamTamy, a platform for creating digital workplaces, enterprise social networks, and digital communities; Click Reply, a supply chain execution platform; Definio Reply, a technological platform for the collection, analysis, control, processing, and distribution of financial data; Ticuro Reply, a cloud-based platform solution for the connection of medical devices, as well as wearable and environmental sensors; and X-RAIS Reply, a reply artificial intelligence solution to support radiological diagnosis processes. In addition, it offers business process outsourcing services in the areas of finance and administration, human resources, and pharmaceutical; and CFO services. It serves automotive, energy and utilities, financial services, logistics and manufacturing, public sector and healthcare, retail and consumer products, and telco and media industries. Reply has an agreement with Amazon Web Services. The company was founded in 1995 and is headquartered in Turin, Italy.", "currency": "EUR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "MIL", "market": "it_market", "country": "Italy", "city": "Turin"}, "SES.MI": {"short_name": "SESA", "long_name": "SeSa S.p.A.", "summary": "SeSa S.p.A., through its subsidiaries, distributes value-added information technology (IT) products and solutions in Italy. Its Software and System Integration sector offers software and IT products and services; ICT products and solutions, as well as system integration services; IT infrastructure and IoT solutions; artificial intelligence and machine learning solutions; digital and business application services; and HR management solutions, as well as operates solutions on the Microsoft Dynamics platform. It also provides cloud services; digital security services; digital manufacturing, processing, and transformation solutions; management, maintenance, technical assistance, and repair services for computers and IT products; and strategic outsourcing services, as well as operates in the cloud computing and systems assistance sectors. In addition, this sector develops and markets ERP software and applications; offers solutions and integrated services on the SAP Business One platform; develops 3cad products for the furniture industry; produces and markets software products, as well as provides IT services for the retail sector; offers project management services; and provides product lifecycle management solutions for manufacturing sector. The company's Business Services sector supplies business process outsourcing, digital transformation, and fleet management and operations services; and physical and logical security services for banks and operators in the retail sector. Its Value Added Distribution sector engages in the value added distribution of technological, enterprise software and datacenter solutions; management of networking solutions; providing design services for IT solutions; marketing Hitachi data systems solutions; and distribution of the Adobe brand. The company's Corporate sector offers logistics services; and marketing and promotion services for the ICT channel. SeSa S.p.A. is headquartered in Empoli, Italy. SeSa S.p.A. is a subsidiary of ITH S.p.A.", "currency": "EUR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "MIL", "market": "it_market", "country": "Italy", "city": "Empoli"}, "TNXT.MI": {"short_name": "TINEXTA", "long_name": "Tinexta S.p.A.", "summary": "Tinexta S.p.A. engages in the digital trust, credit information and management, and innovation and marketing services businesses. The company offers IT solutions for digital identity and the dematerialization of processes in line with applicable regulations. It provides products and services, such as certified electronic mail, digital preservation, electronic storage, digital signature, electronic invoicing, and cloud, telematic trust, and enterprise content management solutions for the secure and simplified transmission of legal and financial documents for companies, entities, associations, and institutions; Web services for accessing public administration database; and additional services for the management of professional associations and billing, and IT protocol services, as well as designs and develops IT services and solutions for SMEs, trade associations, professional firms, agencies, and financial intermediaries. The company also offers IT services to support decision-making processes for the granting, assessment, and credit recovery, as well as credit management and business information services for banks and SMEs. In addition, it provides real estate services, including appraisals and valuations; and advisory services for innovation, dematerialization tools for production processes, and commercial expansion and consulting services for SMEs. The company was formerly known as Tecnoinvestimenti S.p.A. and changed its name to Tinexta S.p.A. in November 2018. The company was founded in 2009 and is headquartered in Rome, Italy. Tinexta S.p.A. is a subsidiary of Tecno Holding S.p.A.", "currency": "EUR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "MIL", "market": "it_market", "country": "Italy", "city": "Rome"}, "XPR.MI": {"short_name": "EXPRIVIA", "long_name": "Exprivia S.p.A.", "summary": "Exprivia S.p.A. provides digital transformation solutions in Italy and internationally. The company offers big data and analytics, cloud, Internet of things, IT security, mobile, SAP, and business process outsourcing solutions. It also designs and manages services and infrastructure for call centers, contact centers, and helpdesks; and develops ground stations for the reception and processing of satellite data. In addition, the company organizes and manages Master in Management and Industrial Development program, as well as specialized seminars and training courses for companies and public administration; offers professional and project development services in the SAP environment, IT infrastructure, and WEB portal development; and provides healthcare solutions and information systems. It serves the banking, finance, and insurance; telecom and media; energy and utilities; aerospace and defense; manufacturing and distribution; healthcare; and public sector industries. The company is headquartered in Molfetta, Italy.", "currency": "EUR", "sector": "Technology", "industry": "Information Technology Services", "exchange": "MIL", "market": "it_market", "country": "Italy", "city": "Molfetta"}}