{
    "1626.TW": {
        "short_name": "AIRMATE CAYMAN INTL CO",
        "long_name": "Airmate (Cayman) International Co Limited",
        "summary": "Airmate (Cayman) International Co Limited researches, develops, manufactures, and sells household appliances in China, Japan, South Korea, and internationally. The company offers electric fans and heaters, air purifiers, humidifiers, dehumidifiers, and fresh air systems. It also provides precision molds treatment services. The company also offers its products through online store. Airmate (Cayman) International Co Limited was founded in 1973 and is based in George Town, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": null,
        "website": "http://www.airmate-china.com",
        "market_cap": "Small Cap"
    },
    "2239.TW": {
        "short_name": "CAYMAN ENGLEY INDUSTRIAL CO. LT",
        "long_name": "Cayman Engley Industrial Co., Ltd.",
        "summary": "Cayman Engley Industrial Co., Ltd. produces and sells automobile parts in China and internationally. The company offers stamping and welding parts, including body in white parts, cockpit carriers, and stamping bumpers; and roll parts, such as rolling bumpers and door sills. It also provides long fiberglass hot-pressing and injection products comprising under body shields, front ends, spare wheel pans, door modules, battery trays, wheel arch liners, heat shields, interior trim parts, and lamp brackets; and mold manufacturing products consisting of prototype and sop tools. In addition, the company engages in the development and manufacture of soft robot software; and provision of related technical consulting services. Cayman Engley Industrial Co., Ltd. was founded in 1991 and is headquartered in Grand Cayman, Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.engley.com",
        "market_cap": "Small Cap"
    },
    "2248.TWO": {
        "short_name": "eLAND",
        "long_name": "Shining Victory Motor Electronic Co., Ltd.",
        "summary": "Shining Victory Motor Electronic Co., Ltd. engages in the production and sale of automotive components. It offers optoelectronic products, automotive electronics, and automotive metal and plastic decorative parts, including car door illuminating welcome pedals, car interior light bar ambient lights, shifting atmosphere lights, sun visors, luggage racks, bright strips, etc. The company is based in George Town, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-1208",
        "website": "http://www.top-elan.com/",
        "market_cap": "Small Cap"
    },
    "2928.TWO": {
        "short_name": "REDHORSE GROUP CO LTD",
        "long_name": "Redhorse Group Co.Ltd.",
        "summary": "Redhorse Group Co.Ltd. engages in the gift sales, and education and entertainment business operations in Japan and internationally . It operates through three segments: Souvenir Sales, E-commerce Sales, and Other. The company provides support to direct trading between suppliers and restaurants under the OWL brand name; souvenirs; disaster prevention consulting services that offer storage batteries during a disaster; and green drinks, supplement to deal with the sleeping environment, as well as operates game/esports facility, and guesthouses and hostels. In addition, it is involved in the communication, e-commerce, real estate, hometown tax, and regional industry support and revitalization businesses. Redhorse Group Co.Ltd. was founded in 1964 and is headquartered in Grand Cayman, Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "1002",
        "website": "http://www.redhorse-group.com",
        "market_cap": "Small Cap"
    },
    "2936.TW": {
        "short_name": "COASTER INTERNATIONAL CO LTD",
        "long_name": "Coaster International Co., Ltd.",
        "summary": "Coaster International Co., Ltd. engages in the wholesale of furniture in the United States and internationally. It provides bedroom, living room, dining room, accents group, recreation, and home office furniture; and furniture for youth. The company was founded in 2013 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-9005",
        "website": "http://www.coasterinternational.com",
        "market_cap": "Small Cap"
    },
    "4581.TW": {
        "short_name": "WORLD KNOWN MFG (CAYMAN) LTD",
        "long_name": "World Known MFG (Cayman) Limited",
        "summary": "World Known MFG (Cayman) Limited produces and sells commercial vehicle parts in the United States, the United Kingdom, Sweden, Denmark, and Japan. The company offers exhaust manifolds, disc brakes, gearbox and pump housing products, and knuckles; and diesel engine and air disc brake components. It serves customers in commercial vehicle, green energy, construction machinery, agricultural machinery, and other industrial equipment industries. The company was founded in 2015 and is based in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.wkgroup.com",
        "market_cap": "Small Cap"
    },
    "4804.TWO": {
        "short_name": "DA LUE INTERNATIONAL HOLDING CO",
        "long_name": "Da Lue International Holding Company Limited",
        "summary": "Da Lue International Holding Company Limited, an investment holding company, provides various wedding services in China. The company offers wedding planning, witnesses ceremony, and wedding dress rental services, as well as wedding photography and video, and other wedding-related services; and wedding banquet, and conference and exhibition services It is also involved in the rental and sale of clothing and flowers, operation of hotels, and real estate business. In addition, the company offers catering and catering management services; and technology development, technical consulting, and other services in the field of network technology. The company's brand portfolio includes Victoria Wedding Club, Coloration LISA Wedding Photography, Taiwan North Suoluo Wedding Photography, Jennifer Wedding Photography, Princess Wedding Photography, Pujue Hotel, and Vienna Hotel. Da Lue International Holding Company Limited was founded in 2011 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.dalue.com.tw",
        "market_cap": "Small Cap"
    },
    "5906.TW": {
        "short_name": "TAINAN ENTERPRISE(CAYMAN)CO LTD",
        "long_name": "Tainan Enterprise (Cayman) Co., Limited",
        "summary": "Tainan Enterprise (Cayman) Co., Limited designs, develops, produces, and sells clothing products in China. It offers urban fashion and casual men's and women's wear, sportswear, dresses, and accessories. The company markets and sells its products under the TONY JEANS, TONY UOMO, TJL, VOV, G-cut, Emely, and Emely Sweetie brand names. It also operates as sales representative of FILA brand apparel and accessories. The company was founded in 1999 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1205",
        "website": "http://www.tainancayman.com",
        "market_cap": "Small Cap"
    },
    "6616.TWO": {
        "short_name": "TECHCENTIAL INTERNATIONAL LTD",
        "long_name": "Techcential International Ltd",
        "summary": "Techcential International Ltd, an investment holding company, designs, manufactures, and sells American wooden bedroom furniture products. It offers 5-piece bedroom furniture, including bed frames, night stand, dresser, chest, and mirror. The company also engages in the production and manufacturing of wood pellets; processing and manufacturing of rubber wood raw materials; and wholesale of wooden restaurant furniture and children's bed furniture. It has operations in the United States, Malaysia, Canada, and internationally. Techcential International Ltd was founded in 2001 and is based in Grand Cayman, Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "1002",
        "website": "http://www.techcential-international.com",
        "market_cap": "Small Cap"
    },
    "8404.TW": {
        "short_name": "PAIHO SHIH HOLDING CORPORATION",
        "long_name": "Paiho Shih Holdings Corporation",
        "summary": "Paiho Shih Holdings Corporation, through its subsidiaries, manufactures and sells touch fastener, webbing, elastic, jacquard engineered mesh, and related peripheral materials in China and internationally. Its touch fastener products are used in shoes, garments, raincoats, caps, sporting goods, belts, and other applications; webbing products that include woven strips and shoelaces are used in accessories for decoration of shoe uppers, eyelets and laces, leathers, rear straps for sport bags, caps, and other applications; elastic products are used in pant straps, jacket lower hems, cuffs, shoe upper clothes, and other applications; and jacquard engineered mesh products are used in shoes, garments, sporting goods, child carts, baby goods, household textiles, and other applications. The company also engages in the commercial property management; selling and leasing of real estate properties; planning and consultation activities; and designing and decoration activities. In addition, it offers consumer electronic accessories; and masks and non-woven products. The company was founded in 2001 and is headquartered in Grand Cayman, the Cayman Islands. Paiho Shih Holdings Corporation is a subsidiary of Paiho Int'l Limited.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KYI-1208",
        "website": "http://www.paiho.cn",
        "market_cap": "Small Cap"
    },
    "8411.TW": {
        "short_name": "KINGCAN HOLDINGS LIMITED",
        "long_name": "Kingcan Holdings Limited",
        "summary": "Kingcan Holdings Limited researches and develops, produces, and sells metal packaging and food cans, and related raw materials in China. It manufactures, imports, and exports tinplate cans, such as beverage, vegetables, and food cans; aluminum cans; and can lids for beverage and food cans, etc. The company also engages in international trading activities. Further, it provides professional one stop food and beverage canned filling OEM. The company also exports its products to the United States, Canada, Southeast Asia, India, the Middle East, and Yemen. The company was founded in 1998 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1 - 1205",
        "website": "http://tw.kingcan.net",
        "market_cap": "Small Cap"
    },
    "8423.TWO": {
        "short_name": "POLYGREEN RESOURCES CO LTD",
        "long_name": "Polygreen Resources Co., Ltd.",
        "summary": "Polygreen Resources Co., Ltd., an investment holding company, engages in resource recycling and environmental protection business in Malaysia. The company manufactures and sells Tyrec, a tyrec reclaimed rubber for use in tires, conveyor belts, inner tubes, ring pads, rubber matting, shoe soles, vibration pads, dock fenders, and other rubber products; Burec, a butyl reclaimed rubber for use in butyl inner tubes, tire inner liners, butyl adhesives, and other butyl rubber-related products; and Narec, a natural inner tube reclaimed rubber for use in rubber matting, shoe soles, and other rubber products. Its products also comprise T-Mesh, a crumb rubber for use in various applications in rubber products as compounding substitute, such as tire, ring pads, and rubber matting; and rubber granules that are recycled from the tire and industrial rubber waste that is used in the underlayment for running tracks, children's playgrounds, gym, and rubber tiles. The company also exports its products to Japan, Europe, Taiwan, Vietnam, the Philippines, Indonesia, Thailand, Pakistan, China, the Middle East, Australia, Singapore, and internationally. It serves manufacturers in the tire and conveyor-belt industries. The company was founded in 1988 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.pgr.com.tw",
        "market_cap": "Small Cap"
    },
    "8427.TW": {
        "short_name": "KEYSHEEN (CAYMAN) HOLDINGS CO L",
        "long_name": "Keysheen (Cayman) Holdings Co., Limited",
        "summary": "Keysheen (Cayman) Holdings Co., Limited, an investment company, produces and sells outdoor leisure furniture-related products in the Cayman Islands, North America, Europe, Oceania, Africa, and Asia. It operates through Department of Outdoor Furniture and Department of Rattan Tables and Chairs segments. The Department of Outdoor Furniture segment engages in the production of various outdoor steel furniture and home textiles. The Department of Rattan Tables and Chairs segment produces outdoor metal and artificial plastic rattan tables and chairs, and equipment. The company was founded in 1972 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1106",
        "website": "http://www.keysheen.com",
        "market_cap": "Small Cap"
    },
    "8429.TW": {
        "short_name": "JINLI GROUP HOLDINGS LTD",
        "long_name": "Jinli Group Holdings Limited",
        "summary": "Jinli Group Holdings Limited designs, manufactures, and sells casual and sports shoes in China. It also designs and sells casual wear, including denim and accessories. The company sells its products through agents and footwear traders. Jinli Group Holdings Limited was founded in 2010 is based in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1104",
        "website": "http://www.jinli.net.cn",
        "market_cap": "Small Cap"
    },
    "8467.TW": {
        "short_name": "BONNY WORLDWIDE LTD",
        "long_name": "Bonny Worldwide Limited",
        "summary": "Bonny Worldwide Limited, together with its subsidiaries, manufactures and sells OEM and ODM carbon fiber rackets and related sporting goods under the BONNY brand name. The company offers hockey sticks, tennis rackets, and badminton rackets. It also provides helmets for the goalkeepers, squash rackets, shuttlecocks, tennis balls, athletic shoes, sportswear, and travel bags, as well as other accessories. In addition, it operates and manages a sports center. The company has operations in North America, China, Taiwan, and internationally. Bonny Worldwide Limited was founded in 1982 and is based in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1104",
        "website": "http://www.bonnyworldwide.com",
        "market_cap": "Small Cap"
    },
    "8488.TW": {
        "short_name": "JIYUAN PACKAGING HOLDINGS LTD",
        "long_name": "Jiyuan Packaging Holdings Limited",
        "summary": "Jiyuan Packaging Holdings Limited, an investment holding company, produces and sells three-piece tin and two-piece aluminum cans in China. The company's tinplate can products are used in the packaging of soft drinks, such as eight-treasure porridge and other granular drinks, protein drinks, coffee and fruit juice, and food cans; and aluminum cans for the packaging of carbonated beverages, beers, herbal teas, and other packages. It also provides tin cans, paper bowls, bottles, and plastic color-printing process services. The company was founded in 2014 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1003",
        "website": "http://www.jypkg.com",
        "market_cap": "Small Cap"
    },
    "9802.TW": {
        "short_name": "FULGENT SUN INTERNATIONAL CO LT",
        "long_name": "Fulgent Sun International (Holding) Co., Ltd.",
        "summary": "Fulgent Sun International (Holding) Co., Ltd., together with its subsidiaries, engages in the production and sale of sports and leisure outdoor footwear in Taiwan. Its products are used in mountain climbing, snow walking, medical correction, jogging, hiking, and other casual activities. The company is also involved in distribution agent, and import and export trade; processing and sale of clothing products; lease of land businesses. It exports its products in Asia, Europe, Africa, Australia, and the Americas. Fulgent Sun International (Holding) Co., Ltd. was founded in 1995 and is headquartered in Grand Cayman, Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1104",
        "website": "http://www.fulgentsun.com",
        "market_cap": "Small Cap"
    }
}