{
    "8404.TW": {
        "short_name": "PAIHO SHIH HOLDING CORPORATION",
        "long_name": "Paiho Shih Holdings Corporation",
        "summary": "Paiho Shih Holdings Corporation, through its subsidiaries, manufactures and sells touch fastener, webbing, elastic, jacquard engineered mesh, and related peripheral materials in China and internationally. Its touch fastener products are used in shoes, garments, raincoats, caps, sporting goods, belts, and other applications; webbing products that include woven strips and shoelaces are used in accessories for decoration of shoe uppers, eyelets and laces, leathers, rear straps for sport bags, caps, and other applications; elastic products are used in pant straps, jacket lower hems, cuffs, shoe upper clothes, and other applications; and jacquard engineered mesh products are used in shoes, garments, sporting goods, child carts, baby goods, household textiles, and other applications. The company also engages in the commercial property management; selling and leasing of real estate properties; planning and consultation activities; and designing and decoration activities. In addition, it offers consumer electronic accessories; and masks and non-woven products. The company was founded in 2001 and is headquartered in Grand Cayman, the Cayman Islands. Paiho Shih Holdings Corporation is a subsidiary of Paiho Int'l Limited.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KYI-1208",
        "website": "http://www.paiho.cn",
        "full_time_employees": null
    },
    "9802.TW": {
        "short_name": "FULGENT SUN INTERNATIONAL CO LT",
        "long_name": "Fulgent Sun International (Holding) Co., Ltd.",
        "summary": "Fulgent Sun International (Holding) Co., Ltd., together with its subsidiaries, engages in the production and sale of sports and leisure outdoor footwear in Taiwan. Its products are used in mountain climbing, snow walking, medical correction, jogging, hiking, and other casual activities. The company is also involved in distribution agent, and import and export trade; processing and sale of clothing products; lease of land businesses. It exports its products in Asia, Europe, Africa, Australia, and the Americas. Fulgent Sun International (Holding) Co., Ltd. was founded in 1995 and is headquartered in Grand Cayman, Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1104",
        "website": "http://www.fulgentsun.com",
        "full_time_employees": null
    }
}