{
  "8411.TW": {
    "city": "Grand Cayman",
    "country": "Cayman Islands",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Packaging & Containers",
    "long_name": "Kingcan Holdings Limited",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "KINGCAN HOLDINGS LIMITED",
    "state": null,
    "summary": "Kingcan Holdings Limited researches and develops, produces, and sells metal packaging and food cans, and related raw materials in China. It manufactures, imports, and exports tinplate cans, such as beverage, vegetables, and food cans; aluminum cans; and can lids for beverage and food cans, etc. The company also engages in international trading activities. Further, it provides professional one stop food and beverage canned filling OEM. The company also exports its products to the United States, Canada, Southeast Asia, India, the Middle East, and Yemen. The company was founded in 1998 and is headquartered in Grand Cayman, the Cayman Islands.",
    "website": "http://tw.kingcan.net",
    "zipcode": "KY1 - 1205"
  },
  "8488.TW": {
    "city": "Grand Cayman",
    "country": "Cayman Islands",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Packaging & Containers",
    "long_name": "Jiyuan Packaging Holdings Limited",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "JIYUAN PACKAGING HOLDINGS LTD",
    "state": null,
    "summary": "Jiyuan Packaging Holdings Limited, an investment holding company, produces and sells three-piece tin and two-piece aluminum cans in China. The company's tinplate can products are used in the packaging of soft drinks, such as eight-treasure porridge and other granular drinks, protein drinks, coffee and fruit juice, and food cans; and aluminum cans for the packaging of carbonated beverages, beers, herbal teas, and other packages. It also provides tin cans, paper bowls, bottles, and plastic color-printing process services. The company was founded in 2014 and is headquartered in Grand Cayman, the Cayman Islands.",
    "website": "http://www.jypkg.com",
    "zipcode": "KY1-1003"
  }
}
