{
    "000096.SZ": {
        "short_name": "SHENZHEN GUANGJU E",
        "long_name": "Shenzhen Guangju Energy Co., Ltd.",
        "summary": "Shenzhen Guangju Energy Co., Ltd., together with its subsidiaries, engages in the production, storage, warehousing, transportation, trading, and distribution of petroleum products and liquefied petroleum gas. The company stores, transports, and trades in chemicals; wholesales and retails refined and fuel oil; and invests in securities. It is also involved in the development, management, and leasing of real estate properties; production and supply of power and heat; construction of power plant stations; and provision of technical consulting services. The company was founded in 1989 and is based in Shenzhen, China. Shenzhen Guangju Energy Co., Ltd. is a subsidiary of Shenzhen Shennan Petroleum Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.gj000096.com",
        "market_cap": 5406720000
    },
    "000159.SZ": {
        "short_name": "XINJIANG INTL IND",
        "long_name": "Xinjiang International Industry Co.,Ltd",
        "summary": "Xinjiang International Industry Co.,Ltd engages in oil and petrochemical, energy trade, real estate, financial investment, and other businesses in China and internationally. The company is involved in the refining, warehousing, transportation, wholesale, and retail of oil; import and export of coke, and fuel and heavy oil; and development and sale of real estate properties. It also produces biodiesel. Xinjiang International Industry Co.,Ltd was founded in 1999 and is based in Urumqi, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Urumqi",
        "zipcode": null,
        "website": "http://www.xjgjsy.com",
        "market_cap": 3134072832
    },
    "000407.SZ": {
        "short_name": "SHANDONG SHENGLI",
        "long_name": "Shandong Shengli Co., Ltd.",
        "summary": "Shandong Shengli Co., Ltd. engages in the agro-chemical, plastic pipe, natural gas and oil products, and other industrial investment businesses in China. The company engages in the investment, construction, operation, and management of natural gas pipelines and natural gas urban pipeline networks; and transmission and distribution of liquefied natural gas (LNG) and compressed natural gas (CNG). It also researches and develops, produces, and sells herbicides, fungicides, and pesticides; and provides polyethylene pipes for use in urban gas transmission and distribution, water supply and drainage, environmental protection, chemical industry, etc. The company operates approximately 60 CNG filling stations, 20 LNG filling stations, 3 CNG mother stations, and an LNG liquefaction plant. Shandong Shengli Co., Ltd. was founded in 1994 and is based in Jinan, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinan",
        "zipcode": null,
        "website": "http://www.vicome.com",
        "market_cap": 3881174784
    },
    "000552.SZ": {
        "short_name": "GANSU JINGYUAN",
        "long_name": "Gansu Jingyuan Coal Industry & Electricity Power Co., Ltd",
        "summary": "Gansu Jingyuan Coal Industry & Electricity Power Co., Ltd. engages in the coal mining business in China. It is also involved in the thermal power and heat supply, gas power generation, and other businesses. The company is based in Baiyin, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Baiyin",
        "zipcode": null,
        "website": "http://www.jymdgs.com",
        "market_cap": 7020998144
    },
    "000554.SZ": {
        "short_name": "SINOPEC SD TAI PET",
        "long_name": "SINOPEC Shandong Taishan Pectroleum Co.,Ltd.",
        "summary": "SINOPEC Shandong Taishan Pectroleum Co.,Ltd. purchases and sells petroleum oil products in China. The company's principal products include gasoline, diesel oil, lubricating oil, and other petrochemicals. It is also involved in the supply of natural gas. The company is based in Taian, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taian",
        "zipcode": "271000",
        "website": null,
        "market_cap": 2370309376
    },
    "000723.SZ": {
        "short_name": "SHANXI MEIJIN ENER",
        "long_name": "Shanxi Meijin Energy Co., Ltd.",
        "summary": "Shanxi Meijin Energy Co., Ltd. manufactures and sells coking coal. It provides coal products, coal slurry, coal gangue, chemical products, ammonium sulfate, and coke oven gas. The company was founded in 1992 and is based in Taiyuan, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taiyuan",
        "zipcode": "030002",
        "website": "http://www.mjenergy.cn",
        "market_cap": 31415517184
    },
    "000780.SZ": {
        "short_name": "I/MONGOLIA PINGZHU",
        "long_name": "Inner Mongolia PingZhuang Energy Resources Co.,Ltd",
        "summary": "Inner Mongolia PingZhuang Energy Resources Co.,Ltd engages in the production, washing, processing, and sale of coal in China. The company is based in Chifeng, China. Inner Mongolia PingZhuang Energy Resources Co.,Ltd is a subsidiary of Inner Mongolia Pingzhuang Coal Group Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chifeng",
        "zipcode": "024076",
        "website": "http://pzny.chnenergy.com.cn",
        "market_cap": 4544109056
    },
    "000933.SZ": {
        "short_name": "HENAN SHENHUO COAL",
        "long_name": "Henan Shenhuo Coal & Power Co.,Ltd",
        "summary": "Henan Shenhuo Coal & Power Co.,Ltd produces, processes, washes, and sells aluminum and coal products in China. It offers electrolytic aluminum, aluminum alloy, aluminum profile, and extended products; processes waste aluminum and carbon products; and sells mining equipment and mineral products. The company also engages in the trading, energy development, transport, investment and asset management, power generation and supply, import and export, management, equity investment, and sales consulting businesses. In addition, it operates department stores. The company was founded in 1998 is based in Yongcheng, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yongcheng",
        "zipcode": "476600",
        "website": "http://www.shenhuo.com",
        "market_cap": 24791521280
    },
    "000937.SZ": {
        "short_name": "JIZHONG ENERGY RES",
        "long_name": "Jizhong Energy Resources Co., Ltd.",
        "summary": "Jizhong Energy Resources Co., Ltd. engages in the coal business in China. The company was founded in 1999 and is based in Xingtai, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xingtai",
        "zipcode": null,
        "website": "http://www.jznyjt.com",
        "market_cap": 14699568128
    },
    "000968.SZ": {
        "short_name": "SHANXI BLUE FLAME",
        "long_name": "Shanxi Blue Flame Holding Company Limited",
        "summary": "Shanxi Blue Flame Holding Company Limited engages in the exploration, development, and utilization of coal mine gas. The company produces and sells coalbed gas, which is a kind of hydrocarbon gas that is deposited in coal seam and coal strata. Its products are used in household, industrial, and vehicle fuel, as well as chemical raw materials and other fields. The company was formerly known as Taiyuan Coal Gasification Company, Limited and changed its name to Shanxi Blue Flame Holding Company Limited in May 2017. Shanxi Blue Flame Holding Company Limited was founded in 1998 and is based in Taiyuan, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taiyuan",
        "zipcode": null,
        "website": "http://www.tymqh.com",
        "market_cap": 6530644992
    },
    "000983.SZ": {
        "short_name": "SHANXI COKING CO.E",
        "long_name": "Shanxi Coking Coal Energy Group Co. ,Ltd.",
        "summary": "Shanxi Coking Coal Energy Group Co. ,Ltd. produces and sells coal products in the People's Republic of China. It offers coking coal, fat coal, gas coal, lean coal, meager lean coal, etc.; and fined coal for metallurgy industry, pulverized coal, steam coal, screen mixed coal, and coke products, as well as operates coal fueled-power plants. The company was formerly known as Shanxi Xishan Coal and Electricity Power Co.,Ltd. and changed its name to Shanxi Coking Coal Energy Group Co. ,Ltd. in December 2020. The company was founded in 1956 and is headquartered in Taiyuan, the People's Republic of China. Shanxi Coking Coal Energy Group Co. ,Ltd. is a subsidiary of Shanxi Coking Co., Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taiyuan",
        "zipcode": "030053",
        "website": "http://www.xsmd.com.cn",
        "market_cap": 32608618496
    },
    "002128.SZ": {
        "short_name": "HUOLINHE OPENCUT C",
        "long_name": "Huolinhe Opencut Coal Industry Corporation Limited of Inner Mongolia",
        "summary": "Huolinhe Opencut Coal Industry Corporation Limited of Inner Mongolia, together with its subsidiaries, mines, produces, processes, and sells coal products in China. The company is based in Holingol, China. Huolinhe Opencut Coal Industry Corporation Limited of Inner Mongolia is a subsidiary of SPIC Mengdong Energy Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Holingol",
        "zipcode": "029200",
        "website": null,
        "market_cap": 21483153408
    },
    "002207.SZ": {
        "short_name": "XINJIANG ZHUNDONG",
        "long_name": "Xinjiang Zhundong Petroleum Technology Co., Ltd.",
        "summary": "Xinjiang Zhundong Petroleum Technology Co., Ltd. provides oilfield dynamic monitoring and oil recovery technology solutions for oil and gas exploration companies in China and internationally. The company offers petroleum technology, oil field management, construction and installation, and transportation services. Its services include oilfield dynamic monitoring well testing; production testing; downhole operations, including clearing and preventing wax, profile control, water plugging, acidification, fracturing, coiled tubing operations, application of oilfield nitrogen technology, and workover; power electrical installation engineering; storage tank machinery cleaning; and transportation services. It also manufactures and sells oilfield chemical additives, such as polyacrylamide, clay anti-swelling agent, wax, crosslinking agents, flooding additives, and organic salts aggravating agent products, as well as produces oil products, including oil additives, chemical additives, drilling additives, and cementing additives. Xinjiang Zhundong Petroleum Technology Co., Ltd. was incorporated in 2001 and is based in Changji, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changji",
        "zipcode": "831511",
        "website": "http://www.zygf.com.cn",
        "market_cap": 1585432832
    },
    "002259.SZ": {
        "short_name": "SICHUAN SHENGDA FO",
        "long_name": "Sichuan Shengda Forestry Industry Co., Ltd",
        "summary": "Sichuan Shengda Forestry Industry Co., Ltd engages in the exploration, development, and production of liquefied natural gas (LNG) in China. It is also involved in the pipeline transmission and distribution of gas; operation of gas stations; and LNG logistics transportation services. The company was founded in 1995 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610016",
        "website": "http://www.shengdawood.com",
        "market_cap": 2700857344
    },
    "002267.SZ": {
        "short_name": "SHAANXI PROVINCIAL",
        "long_name": "Shaanxi Provincial Natural Gas Co.Ltd",
        "summary": "Shaanxi Provincial Natural Gas Co.Ltd, a natural gas company, engages in the planning, construction, operation, management, and distribution of natural gas in Shaanxi Province, China. It operates Jingbian to Xi'an, Xianyang to Baoji, Xi'an to Weinan, Baoji to Hanzhong, Hanzhong to Ankang, etc. pipelines with a total mileage of approximately 3,300 kilometers. The company was founded in 1995 and is based in Xi'an, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": "710016",
        "website": "http://www.shaanxigas.com",
        "market_cap": 7973613568
    },
    "002353.SZ": {
        "short_name": "YANTAI JEREH OILFI",
        "long_name": "Yantai Jereh Oilfield Services Group Co., Ltd.",
        "summary": "Yantai Jereh Oilfield Services Group Co., Ltd. provides integrated solutions for the oil and gas, power, and environmental management sectors worldwide. It offers various equipment, such as drilling and workover equipment, cementing fleets, fracturing spreads, coiled tubing units, nitrogen pumping units, heating equipment, plunger pumps and spares, simulation training systems, flowline products, well control equipment, and wellhead equipment; and gas compressors. It also provides integrated oilfield and management services, drilling and completion services, workover and stimulation services, and oil production services; and oilfield surface, gas field surface, pipeline, and liquefied natural gas (LNG) engineering services, as well as oil and gas storage, oil refinery and petrochemical, and LNG/CNG fueling services. In addition, the company provides consulting services, such as investment opportunity study, design, preliminary feasibility-study and feasibility-study report, general-planning design, evaluation of post-production, and others; engineering services consisting of conceptual design, process design package, FEED and basic design, and detail design services; procurement services; construction management services; and modular fabrication services. Further, it offers ecological remediation, solid waste treatment, wastewater treatment, and equipment manufacturing services; and engages in fossil and new energy, and combined energy generation activities. The company was formerly known as Yantai Jereh Equipment Group Co., Ltd. and changed its name to Yantai Jereh Oilfield Services Group Co., Ltd. in November 2007. Yantai Jereh Oilfield Services Group Co., Ltd. was founded in 1999 and is based in Yantai, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yantai",
        "zipcode": "264003",
        "website": "http://www.jereh.com",
        "market_cap": 38687723520
    },
    "002490.SZ": {
        "short_name": "SHANDONG MOLONG PE",
        "long_name": "Shandong Molong Petroleum Machinery Company Limited",
        "summary": "Shandong Molong Petroleum Machinery Company Limited engages in the research and development, production, and sale of products for the energy equipment industry in the People's Republic of China. The company operates through Pipe Products, Three Kinds of Pumping Units, Petroleum Machinery Parts, Tube Blank, and Others segments. It offers pipes for petroleum and gas extraction, fluid and structural pipes, petroleum pumping machines, petroleum pumps, petroleum pumping rods, cylinder liners for drilling rigs, valve parts, and casting and forging solutions . The company's products also include API and non API casing products, line pipe products, precision steel pipes, hydraulic prop tubes, fluid pipes, cylinder tubes, and boiler tubes; sucker rods; valve body, cylinder liners, gate valves, and billet products. Its products are used in petroleum, natural gas, coalbed methane, shale gas and other energy drilling, machinery processing, urban pipe network, etc. In addition, the company engages in the research of new materials for energy equipment; production and sale of metal casting and forging; sea water desalination activities; waste heat and gas power generation activities; and manufacture and sale of special oil metal materials. It also exports its energy equipment. Shandong Molong Petroleum Machinery Company Limited was founded in 2001 and is based in Shouguang City, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shouguang",
        "zipcode": "262700",
        "website": "http://www.molonggroup.com",
        "market_cap": 3995327744
    },
    "002492.SZ": {
        "short_name": "ZHUHAI WINBASE INT",
        "long_name": "Zhuhai Winbase International Chemical Tank Terminal Co., Ltd.",
        "summary": "Zhuhai Winbase International Chemical Tank Terminal Co., Ltd. engages in bulk liquid petrochemicals and finished oil products business in China. It is involved in the loading and discharging, storage, and transferring activities. The company was founded in 2000 and is based in Zhuhai, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhuhai",
        "zipcode": null,
        "website": "http://www.winbase-tank.com",
        "market_cap": 2247750144
    },
    "002629.SZ": {
        "short_name": "ZHEJIANG RENZHI CO",
        "long_name": "Zhejiang Renzhi Co., Ltd.",
        "summary": "Zhejiang Renzhi Co., Ltd. provides professional services in the oil and gas drilling and engineering fields primarily in China. It is involved in the development, production, and sale of oilfield chemicals; and development, production, sale, and import and export trade of new materials. The company also offers drilling fluid technical services; oilfield special equipment inspection and repair services; and anti-corrosion engineering services. The company was formerly known as Sichuan Renzhi Oilfield Technology Services Co., Ltd. and changed its name to Zhejiang Renzhi Co., Ltd. in October 2016. Zhejiang Renzhi Co., Ltd. was founded in 1998 and is based in Wenzhou, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wenzhou",
        "zipcode": null,
        "website": "http://www.chinarenzhi.com",
        "market_cap": 1050467392
    },
    "002778.SZ": {
        "short_name": "JIANGSU GAOKE PETR",
        "long_name": "Jiangsu Gaoke Petrochemical Co., Ltd",
        "summary": "Jiangsu Gaoke Petrochemical Co., Ltd researches, develops, produces, and sells lubricants and greases in China and internationally. The company offers gasoline engine, diesel engine, construction machinery, industrial, transformer, vehicle gear, motorcycle, antifreeze, and auxiliary oils, as well as other lubricant products. Jiangsu Gaoke Petrochemical Co., Ltd is based in Yixing, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yixing",
        "zipcode": "214244",
        "website": "http://www.jsgaoke.com",
        "market_cap": 1568327296
    },
    "002828.SZ": {
        "short_name": "XINJIANG BEIKEN EN",
        "long_name": "XinJiang Beiken Energy Engineering Co,.Ltd",
        "summary": "Xinjiang Beiken Energy Engineering Co., Ltd. provides oil, gas, and coal bed methane extraction; and related engineering and technical services in China and internationally. The company offers drilling and cementing engineering, and directional well technical services, as well as mud, downhole, and oil production technical services; and oil and gas field exploration and development technology research and consulting services. It is also involved in the research, development, manufacture, and sale of drilling, cementing, and oil production additives used in oilfields; manufacture of logging while drilling tools and PDC drill bit; testing and maintenance/repair of well control equipment; and lease and repair of drilling and other tools. In addition, the company imports/exports petroleum machinery and electromechanical products; invests in the oil sector; and provides after-sale and professional technical consultancy services. The company was formerly known as XinJiang Beiken Energy Engineering Stock Co., Ltd. and changed its name to Xinjiang Beiken Energy Engineering Co., Ltd. in November 2017. Xinjiang Beiken Energy Engineering Co., Ltd. was founded in 1995 and is headquartered in Karamay, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Karamay",
        "zipcode": "834009",
        "website": "http://www.beiken.com",
        "market_cap": 1712417792
    },
    "002911.SZ": {
        "short_name": "FORAN ENERGY GROUP",
        "long_name": "Foran Energy Group Co.,Ltd.",
        "summary": "Foran Energy Group Co.,Ltd. transports and sells natural gas in China. The company designs and constructs gas pipeline projects; and offers gas engineering services. It holds franchised gas pipeline rights in 4 districts. The company was formerly known as Foshan Gas Group Co.,Ltd. and changed its name to Foran Energy Group Co.,Ltd. in March 2020. Foran Energy Group Co.,Ltd. was founded in 1992 and is headquartered in Foshan, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Foshan",
        "zipcode": "528000",
        "website": "http://www.fsgas.com",
        "market_cap": 8468992000
    },
    "0196.HK": {
        "short_name": "HONGHUA GROUP",
        "long_name": "Honghua Group Limited",
        "summary": "Honghua Group Limited, an investment holding company, engages in the research, design, manufacture, setting, and sale of land rigs, related parts, and components. It operates through Land Drilling Rigs; Parts and Components and Others; Drilling Engineering Services; and Fracturing segments. The company designs and manufactures mast and substructures, as well as hoisting, rotating, high and low pressure mud, and auxiliary system parts for rigs; manufactures and assembles rig electrical equipment, including VFD systems, SCR systems, MCC systems, drilling motors, well site circuitry and lighting systems, etc.; and manufactures mud tanks, solids control equipment, drill floor tools, mud manifolds and personnel camps, etc. It also offers various oil and gas engineering services, including well drilling, directional drilling, and seismic services for CNOOC, SHELL, MOGE, PTTEP, NOBEL, etc. In addition, the company provides direct financing lease, operating leasing, sale and leaseback, sublease, and trust and joint lease financing services. Further, it manufactures panels of drilling rigs; trades in drilling rigs and related parts; designs and manufactures offshore drilling modules; and provides technical support, and drilling and fracturing engineering services, as well as after-sales service covering rig installation, commissioning, and solution. The company operates in the People's Republic of China, the Americas, the Middle East, Europe, and Africa, as well as Central, South, and South East Asia. Honghua Group Limited was founded in 1997 and is headquartered in Chengdu, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610036",
        "website": "http://www.hh-gltd.com",
        "market_cap": 1446120064
    },
    "0338.HK": {
        "short_name": "SHANGHAI PECHEM",
        "long_name": "Sinopec Shanghai Petrochemical Company Limited",
        "summary": "Sinopec Shanghai Petrochemical Company Limited, together with its subsidiaries, manufactures and sells petrochemical products in the People's Republic of China. It operates through five segments: Synthetic Fibers, Resins and Plastics, Intermediate Petrochemicals, Petroleum Products, and Trading of Petrochemical Products. The Synthetic Fibers segment produces polyesters, acrylic fibers, and carbon fibers that are primarily used in the textile and apparel industries. The Resins and Plastics segment produces polyester chips that are used to produce polyester fibers, coating, and containers; polyethylene resins and plastics, which are used to produce insulated cables and mulching films, as well as molded products, such as housewares and toys; and polypropylene resins that are used for films and sheets, as well as molded products, such as housewares, toys, consumer electronics, and automobile parts; and PVA granules. The Intermediate Petrochemicals segment produces p-xylene, benzene, and ethylene oxide, which are used as raw materials in the production of other petrochemicals, resins, plastics, and synthetic fibers. The Petroleum Products segment operates crude oil refinery facilities used to produce refined gasoline, fuel, diesel oil, heavy oil, and liquefied petroleum gas. The Trading of Petrochemical Products segment is involved in the import and export of petrochemical products. The company was founded in 1972 and is based in Shanghai, the People's Republic of China. Sinopec Shanghai Petrochemical Company Limited is a subsidiary of China Petroleum & Chemical Corporation.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200540",
        "website": "http://www.spc.com.cn",
        "market_cap": 41206157312
    },
    "0568.HK": {
        "short_name": "SHANDONG MOLONG",
        "long_name": "Shandong Molong Petroleum Machinery Company Limited",
        "summary": "Shandong Molong Petroleum Machinery Company Limited engages in the research and development, production, and sale of products for the energy equipment industry in the People's Republic of China. The company operates through Pipe Products, Three Kinds of Pumping Units, Petroleum Machinery Parts, Tube Blank, and Others segments. It offers pipes for petroleum and gas extraction, fluid and structural pipes, petroleum pumping machines, petroleum pumps, petroleum pumping rods, cylinder liners for drilling rigs, valve parts, and casting and forging solutions . The company's products also include API and non API casing products, line pipe products, precision steel pipes, hydraulic prop tubes, fluid pipes, cylinder tubes, and boiler tubes; sucker rods; valve body, cylinder liners, gate valves, and billet products. Its products are used in petroleum, natural gas, coalbed methane, shale gas and other energy drilling, machinery processing, urban pipe network, etc. In addition, the company engages in the research of new materials for energy equipment; production and sale of metal casting and forging; sea water desalination activities; waste heat and gas power generation activities; and manufacture and sale of special oil metal materials. It also exports its energy equipment. Shandong Molong Petroleum Machinery Company Limited was founded in 2001 and is based in Shouguang City, China.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shouguang",
        "zipcode": "262700",
        "website": "http://www.molonggroup.com",
        "market_cap": 6314667008
    },
    "0857.HK": {
        "short_name": "PETROCHINA",
        "long_name": "PetroChina Company Limited",
        "summary": "PetroChina Company Limited, together with its subsidiaries, engages in a range of petroleum related products, services, and activities in Mainland China and internationally. It operates through Exploration and Production, Refining and Chemicals, Marketing, and Natural Gas and Pipeline segments. The Exploration and Production segment engages in the exploration, development, production, and marketing of crude oil and natural gas. The Refining and Chemicals segment refines crude oil and petroleum products; and produces and markets primary petrochemical products, derivative petrochemical products, and other chemical products. The Marketing segment is involved in marketing of refined products and trading business. The Natural Gas and Pipeline segment engages in the transmission of natural gas, crude oil, and refined products; and sale of natural gas. As of December 31, 2020, the company had a total length of 31,151 km, including 22,555 km of natural gas pipelines, 7,190 km of crude oil pipelines, and 1,406 km of refined product pipelines. The company is also involved in the exploration, development, and production of oil sands and coalbed methane; trading of crude oil and petrochemical products; storage, chemical engineering, storage facilities, service station, and transportation facilities and related businesses; and production and sales of basic and derivative chemical, and other chemical products. The company was founded in 1999 and is headquartered in Beijing, the People's Republic of China. PetroChina Company Limited is a subsidiary of China National Petroleum Corporation.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100007",
        "website": "http://www.petrochina.com.cn",
        "market_cap": 1045048000512
    },
    "1033.HK": {
        "short_name": "SINOPEC SSC",
        "long_name": "Sinopec Oilfield Service Corporation",
        "summary": "Sinopec Oilfield Service Corporation provides petroleum engineering and technical services in the People's Republic of China, the Middle East, and internationally. It operates through five segments: Geophysics, Drilling Engineering, Logging and Mud Logging, Special Down-Hole Operations, and Engineering Construction. The Geophysics segment offers terrestrial and marine geophysical exploration, development, and technical services. The Drilling Engineering segment provides land and ocean drilling design, construction, and technical services, as well as drilling instrumentation. The Logging and Mud Logging segment offers land and ocean project contracting and technical services for collection, monitoring, transmission, processing and interpretation, and evaluation of wellbore oil and gas, geology, and engineering information. The Special Down-Hole Operations segment provides oil engineering technical and construction services, including oil testing, well repair, and lateral drilling, as well as fracturing, acidizing, and oil assignments. The Engineering Construction segment offers various services, such as feasibility studies; design, procurement, and construction for projects of onshore and offshore oil and gas fields; long-distance pipeline projects, oil and gas transporting process projects, storage and transportation projects, petrochemical supporting projects, and LNG projects; building construction, water resources and hydropower, ports and waterways, electricity transmission and distribution projects; manufacturing of pressure vessels; and coal chemical engineering, geothermal utilization, energy saving, and municipal roads and bridges. The company was formerly known as Sinopec Yizheng Chemical Fibre Company Limited and changed its name to Sinopec Oilfield Service Corporation in March 2015. The company is headquartered in Beijing, the People's Republic of China. Sinopec Oilfield Service Corporation is a subsidiary of China Petrochemical Corporation.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100728",
        "website": "http://ssc.sinopec.com",
        "market_cap": 38575321088
    },
    "1080.HK": {
        "short_name": "SHENGLI PIPE",
        "long_name": "Shengli Oil & Gas Pipe Holdings Limited",
        "summary": "Shengli Oil & Gas Pipe Holdings Limited, an investment holding company, designs, processes, manufactures, and sells welded pipes for oil and gas pipeline, and other construction and manufacturing applications in Mainland China and Hong Kong. The company operates through two segments, Pipes Business and Trading Business. It produces submerged-arc helical and longitudinal welded pipes that are primarily used to transport crude oil, refined petroleum products, natural gas, and other related products, as well as used for the oil and infrastructure industry. The company also engages in the provision of anti-corrosion services for oil and gas pipelines, and other construction and manufacturing applications; trading of environmental energy equipment, fuel oil and chemical products, and commodities; and provision of new energy technical development services. In addition, it offers anti-corrosion technical and rental services; and trades in rolled coils. Shengli Oil & Gas Pipe Holdings Limited was founded in 1972 and is headquartered in Zibo, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Zibo",
        "zipcode": "255082",
        "website": "http://www.slogp.com",
        "market_cap": 302200864
    },
    "1088.HK": {
        "short_name": "CHINA SHENHUA",
        "long_name": "China Shenhua Energy Company Limited",
        "summary": "China Shenhua Energy Company Limited and its subsidiaries engage in the production and sales of coal and power; railway, port, and shipping transportation; and coal-to-olefins businesses in the People's Republic of China and internationally. The company's Coal segment produces coal from surface and underground mines; and sells coal to power plants, metallurgical and coal chemical producers, and provincial/regional electric grid companies. As of December 31, 2020, this segment had the recoverable coal reserves of 14.42 billion tones. Its Power segment generates and sells electric power to power grid companies. This segment generates electric power through coal, thermal, wind, water, and gas. The company's Railway segment provides railway transportation services. Its Port segment offers loading, transportation, and storage services. The company's Shipping segment provides shipment transportation services. Its Coal Chemical segment produces and sells methanol; and polyethylene and polypropylene, as well as other by-products. The company was incorporated in 2004 and is based in Beijing, China. China Shenhua Energy Company Limited is a subsidiary of China Energy Investment Corporation Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100011",
        "website": "http://www.csec.com",
        "market_cap": 481012973568
    },
    "1171.HK": {
        "short_name": "YANZHOU COAL",
        "long_name": "Yanzhou Coal Mining Company Limited",
        "summary": "Yanzhou Coal Mining Company Limited primarily engages in the mining, preparation, and sale of coal in China and internationally. It offers thermal, PCI, and coking coal for electric power, metallurgy and chemical industry, etc.; produces and sells coal chemicals, including methanol, liquid wax, stable light hydrocarbon, acetic acid, ethyl acetate, etc., as well as electricity and related heat supply services; and explores for potash mineral. The company also manufactures, installs, repairs, and sells coal mining and excavating equipment, cable, and electrical equipment. In addition, it provides railway, river, and lakes transportation services; and sells construction materials. Further, the company is involved in the wholesale of coal and non-ferrous metals; house and financial leasing; logistics storage and leasing; development of charcoal products; LTCC technology development and equipment rental operations; manufacturing and sale of cable and rubber products; and production and processing of steel engineering components. Additionally, it provides underground mines management; mining materials testing; equity investment fund and corporate asset management, investment advisory and management, foreign investment fund, import and export, and international trading; solar and wind power, and production management; educational software development and event planning; and coal mining technology development, transfer, and consultation services. The company is also involved in the processing, production, and sale of FischerTropsch synthesis catalyst, composite pipe, and plastic profile products; provision of real estate development and operation, property management, garden greening engineering, and sewage treatment and rental housing agency services; and issuing subordinated capital notes. The company was founded in 1973 and is based in Zoucheng, the People's Republic of China. Yanzhou Coal Mining Company Limited is a subsidiary of Yankuang Group Corporation Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Zoucheng",
        "zipcode": "273500",
        "website": "http://www.yanzhoucoal.com.cn",
        "market_cap": 72838111232
    },
    "1393.HK": {
        "short_name": "HIDILI INDUSTRY",
        "long_name": "Hidili Industry International Development Limited",
        "summary": "Hidili Industry International Development Limited, an investment holding company, engages in the coal mining, and manufacture and sale of raw coal and clean coal in the People's Republic of China. It also provides clean coal washing services. The company was incorporated in 2006 and is headquartered in Panzhihua, the People's Republic of China. Hidili Industry International Development Limited is a subsidiary of Sanlian Investment Holding Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Panzhihua",
        "zipcode": "617000",
        "website": "http://www.hidili.com.cn",
        "market_cap": 450032000
    },
    "1623.HK": {
        "short_name": "HILONG",
        "long_name": "Hilong Holding Limited",
        "summary": "Hilong Holding Limited, an investment holding company, provides oil field equipment and services worldwide. The company operates through Oilfield Equipment Manufacturing and Services, Line Pipe Technology and Services, Oilfield Services, and Offshore Engineering Service segments. The Oilfield Equipment Manufacturing and Service segment produces and sells oilfield equipment; and offers oil country tubular goods (OCTG) coating services. The Line Pipe Technology and Services segment provides services related to oil and gas pipeline; and produces coating materials for anticorrosive and anti-friction purposes. The Oilfield Services segment offers well drilling services; integrated comprehensive services; and OCTG trading and related services to oil and gas producers. The Offshore Engineering Services segment provides offshore engineering and design services. The company is also involved in the manufacture, trading, and distribution of oil and gas equipment; the manufacture and distribution of hardbanding materials and special steel; the research and development on the technology of manufacturing oil and gas equipment, as well as coating services; the research, inspection, and repairment of oil and gas equipment; and the provision of offshore oilfield services. Hilong Holding Limited was founded in 2002 and is headquartered in Shanghai, the People's Republic of China. Hilong Holding Limited is a subsidiary of Hilong Group Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200949",
        "website": "http://www.hilonggroup.com",
        "market_cap": 466521024
    },
    "1921.HK": {
        "short_name": "DALIPAL HLDG",
        "long_name": "Dalipal Holdings Limited",
        "summary": "Dalipal Holdings Limited, together with its subsidiaries, develops, manufactures, and sells oil country tubular goods, other oil pipes, and pipe billets in the People's Republic of China and internationally. The company was founded in 1998 and is headquartered in Cangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Cangzhou",
        "zipcode": null,
        "website": "http://www.dalipal.com",
        "market_cap": 2775000064
    },
    "2728.HK": {
        "short_name": "JINTAI ENERGY H",
        "long_name": "Jintai Energy Holdings Limited",
        "summary": "Jintai Energy Holdings Limited, an investment holding company, engages in energy trading business primarily in the People's Republic of China. Its energy trading activities primarily comprise trading of fuel oil, kerosene, and chemical products. The company is also involved in the manufacture and trading of speakers; asset management businesses; and operation of an oil trade center. In addition, it provides oil and gas development engineering construction, and technical services, including geochemical exploration, drilled wells, test logging, downhole special operation, engineering building design, and construction services, as well as related oil and gas development technology research and development, and services. The company was formerly known as Yuhua Energy Holdings Limited and changed its name to Jintai Energy Holdings Limited in February 2020. Jintai Energy Holdings Limited was founded in 1990 and is headquartered in Dongying, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Dongying",
        "zipcode": null,
        "website": "http://www.jintaienergy.com",
        "market_cap": 659342976
    },
    "2883.HK": {
        "short_name": "CHINA OILFIELD",
        "long_name": "China Oilfield Services Limited",
        "summary": "China Oilfield Services Limited, together with its subsidiaries, provides integrated offshore oilfield services in Mainland China and internationally. The company operates through four segments: Drilling Services, Well Services, Marine Support Services, and Geophysical Acquisition and Surveying Services. The Drilling Services segment provides jack-up drilling rig, semi-submersible drilling rig, module rig, and land drilling rig services. As of December 31, 2020, it operated and managed 57 drilling rigs, which include 43 jack-up drilling rigs and 14 semi-submersible drilling rigs; and 5 module rigs. The Well Services segment offers onshore and offshore well services, including logging, drilling and completion fluids, directional drilling, cementing, well completion and workover, stimulation, etc. The Marine Support Services segment owns and operates offshore vessels that provide services for offshore oil and gas exploration, development, construction, and production. This segment also offers anchor handling for various water level, towing of drilling rigs/engineering barges, oil lifting, offshore transportation, standby, firefighting, rescue, oil spill assisting, and other marine support services. It operates and manages approximately 140 vessels, including AHTS vessels, platform supply vessels, and oilfield standby vessels. The Geophysical Acquisition and Surveying Services segment provides offshore seismic acquisition, offshore geo-surveying, seismic data processing and interpretation, and fundamental construction services. This segment owns 5 towing streamer seismic vessels, 1 professional source vessel, 2 ocean bottle cable teams, 5 integrated marine surveying vessels, and 2 support vessels. China Oilfield Services Limited also issues bonds. The company is based in Sanhe, China. China Oilfield Services Limited is a subsidiary of China National Offshore Oil Corporation.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Sanhe",
        "zipcode": "065201",
        "website": "http://www.cosl.com.cn",
        "market_cap": 61074366464
    },
    "300084.SZ": {
        "short_name": "HAIMO TECHNOLOGIES",
        "long_name": "Haimo Technologies Group Corp.",
        "summary": "Haimo Technologies Group Corp. manufactures and sells oilfield equipment and instruments for oilfield service companies in China, the Middle East, North Africa, Central, South and Southeast Asia, and North and South America. It offers multiphase flow meters (MPFM), wet gas meters, bulk multiphase meters, high performance and low production testers, shale oil/gas meters, and mobile well testing and production measurement services. The company also provides fluid end assemblies for fracking; accessories, including joints, valves, and valve seating products; ball injectors; and high pressure fluid components and manifolds. In addition, it offers environmental protection equipment and services, such as wastewater treatment and reuse, solid waste disposal, and contaminated soil remediation from industries of oil and gas production and refinery, municipal, mining and chemical processing, etc. Further, the company provides integrated production optimization services, as well as value added services, including data validation and cleansing, well testing verification and optimization, intelligent allocation, water injection optimization, real-time well monitoring and alarm systems, and production analysis and enhancement consultation services. Additionally, it is involved in the oil and gas exploration, development, and production activities. The company was formerly known as Lanzhou Haimo Technologies Co., Ltd. and changed its name to Haimo Technologies Group Corp. in November 2016. Haimo Technologies Group Corp. was founded in 1994 and is based in Lanzhou, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Lanzhou",
        "zipcode": "730010",
        "website": "http://www.haimotech.com",
        "market_cap": 1681427456
    },
    "300157.SZ": {
        "short_name": "LANDOCEAN GROUP LI",
        "long_name": "LandOcean Energy Services Co.,Ltd.",
        "summary": "LandOcean Energy Services Co.,Ltd. research, develops, commercializes, and sells petroleum exploration and development software, oil and gas equipment, downhole equipment, and instrument technology in China and internationally. It engages in the geological and geophysical, engineering technology, high-end equipment manufacturing, and cloud computing big data businesses. The company also provides business development and technical services. It serves oil and gas industry. LandOcean Energy Services Co.,Ltd. is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100094",
        "website": "http://www.ldocean.com.cn",
        "market_cap": 3482232576
    },
    "300164.SZ": {
        "short_name": "TONG PETROTECH COR",
        "long_name": "Tong Petrotech Corp.",
        "summary": "Tong Petrotech Corp., together with its subsidiaries, researches, develops, manufactures, sells, and services perforation technology services to oilfield customers. The company offers horizontal perforation completion technology, fracturing completion perforation technology, vertical well fracturing perforation completion technology, horizontal well perforation fracturing technology, and old well plugging removal technology services. It also provides directional drilling and drilling technology services; and fracturing design, horizontal well staged fracturing, fast drilling bridge plug technology, and evaluation services, as well as oil recovery and oil block development services. In addition, the company produces and sells approximately 100,000 meters of various types of guns; and exports 100,000 composite perforating and pumping guns to the United States. It operates in the People's Republic of China, the United States, Indonesia, Kazakhstan, and internationally. The company was formerly known as Tong Oil Tools Co., Ltd. and changed its name to Tong Petrotech Corp. in June 2019. Tong Petrotech Corp. was founded in 1995 and is headquartered in Xi'an, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": "710075",
        "website": "http://www.tongoiltools.com",
        "market_cap": 2064390528
    },
    "300191.SZ": {
        "short_name": "SINO GEOPHYSICAL C",
        "long_name": "Sino Geophysical Co., Ltd",
        "summary": "Sino Geophysical Co., Ltd. provides integrated oil and gas exploration and development technology services in China and internationally. It offers technical services, such as acquisition and processing integration, and unconventional oil and gas, and geothermal services, as well as earthquake, geological, and engineering integration services. The company also engages in oil and gas investment; and asset management activities. Sino Geophysical Co., Ltd. was incorporated in 2003 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100107",
        "website": "http://www.sinogeo.com",
        "market_cap": 6899200000
    },
    "300471.SZ": {
        "short_name": "HOUPU CLEAN ENERGY",
        "long_name": "Houpu Clean Energy Co., Ltd.",
        "summary": "Houpu Clean Energy Co., Ltd. provides clean energy equipment solutions in China. The company also offers refueling solutions in clean energy applications; platform operation and supervision services based on Internet, cloud computing, and big data analysis; CRM and PLM system based site operation and maintenance services; and energy chemical engineering consulting, survey, engineering, construction, installation, and project management services. It provides compressed natural gas (CNG) filling station station-level management systems, intelligent gun detachment detection devices, electric control cabinets, CNG program control panels, CNG verification devices, CNG universal intelligent gas dispensers, verification devices of liquefied natural gas (LNG) dispensers, L-CNG trunk-type skid-mounted filling equipment, L-CNG/CNG filling stations, LNG filling stations, LNG fully skid-mounted filling devices, unattended skid-mounted filling devices, LNG filling machines, and LNG station control systems for vehicles. The company also offers LNG fuel-powered ship supply systems, mobile LNG filling stations, gas supply systems, and barges LNG filling stations for marine applications; LNG tanker gas supply skids, LNG gas supply skids, LNG dewar flask gas supply skids, LNG split gas supply skids, and LNG fixed civil stations for civil applications; and hydrogen station control systems and dispensers, and hydrogenation skid-mounted equipment; and components. The company was formerly known as Chengdu Huaqi Houpu Holding Co.,Ltd. and changed its name to Houpu Clean Energy Co., Ltd. in August 2019. Houpu Clean Energy Co., Ltd. was founded in 2005 and is based in Chengdu, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "611730",
        "website": "http://www.hqhop.com",
        "market_cap": 4526175232
    },
    "300839.SZ": {
        "short_name": "NINGBO BOHUI CHEMI",
        "long_name": "Ningbo Bohui Chemical Technology Co.,Ltd",
        "summary": "Ningbo Bohui Chemical Technology Co.,Ltd produces and sells aromatics, fuel oil, hydrocarbons, and other products in China. It offers rubber chemicals, plastic additives, asphalt additives, lubricant additives, and light fuel oil products. The company provides its products for use in rubber, plastic, asphalt, and lubrication oil processing, and other fields. It was formerly known as Ningbo Bohui Petrochemical Co., Ltd. and changed its name to Ningbo Bohui Chemical Technology Co.,Ltd in March 2014. The company was founded in 2005 and is based in Ningbo, China. Ningbo Bohui Chemical Technology Co.,Ltd operates as a subsidiary of Ningbo Wenkui Holding Group Co.,Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315207",
        "website": "http://www.bhpcc.com",
        "market_cap": 2275520000
    },
    "3303.HK": {
        "short_name": "JUTAL OIL SER",
        "long_name": "Jutal Offshore Oil Services Limited",
        "summary": "Jutal Offshore Oil Services Limited, an investment holding company, engages in the fabrication of facilities, and provision of integrated services for oil and gas industries, new energy, and refining and chemical industries. The company offers offshore engineering and modular construction services, including construction of large-scale modules, such as onshore LNG modules, modular plants, upper modules of offshore platforms, and FPSO/FLNG modules; petrochemical and shipbuilding services comprising projects in oil and gas process modules, petrochemical equipment and undersea business, and EPC contracting services; and technical support services for shipbuilding industry, as well as ship repair and construction services. It also provides oil and gas treatment technical services, which include treatment technology and solutions in natural gas purification and treatment, oil production water treatment, and sludge purification; and new energy equipment construction services, such as services for the development and utilization of new energy, as well as undertakes construction of crane products. It operates in the People's Republic of China, the United States, Switzerland, Norway, Singapore, Japan, France, the United Kingdom, the Netherlands, and internationally. Jutal Offshore Oil Services Limited was founded in 1995 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518068",
        "website": "http://www.jutal.com",
        "market_cap": 2531790592
    },
    "3337.HK": {
        "short_name": "ANTON OILFIELD",
        "long_name": "Anton Oilfield Services Group",
        "summary": "Anton Oilfield Services Group, an investment holding company, provides oil and gas field development technical services for oil companies in the People's Republic of China and internationally. It operates through three segments: Drilling Technology, Well Completion, and Oil Production Services. The company offers geology technology services, such as oil and gas field design and development, geological engineering, and geological research and technical support; oilfield management and oil and gas development general contract services, including production capacity construction, oil and gas field management general contract, oil/gas field cooperative development, digital oilfield management, reservoir technology support, oilfield operation and maintenance, and supervision; and drilling technology services comprising integrated drilling, rig, directional drilling, drilling fluid and completion fluid, oilfield environmental protection, and cementing. It also provides completion technology services, such as stimulation and integrated completion, completion technique and tool, sand control, fracturing and pumping, coiled tubing operation, stimulation chemical, and logging; workover and well testing, and oil production technology services; and inspection technology, including oilfield nondestructive detection and evaluation, special equipment testing, gas leaking inspection, pipeline inspection, metrology inspection, and environmental inspection, as well as tubing and casing inspection, repairing, and anti-corrosion technology services. In addition, the company offers asset leasing services, such as drilling tool, drilling equipment, oilfield production equipment, and oilfield production facility leasing services. Further, it manufactures rod casings; and provides construction services. The company was founded in 1999 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://www.antonoil.com",
        "market_cap": 1572123648
    },
    "3899.HK": {
        "short_name": "CIMC ENRIC",
        "long_name": "CIMC Enric Holdings Limited",
        "summary": "CIMC Enric Holdings Limited designs, develops, manufactures, engineers, and maintains transportation, storage, and processing equipment for the energy, chemicals, environmental, and liquid food industries worldwide. Its Clean Energy segment manufactures and operates equipment for the storage, transportation, processing, and distribution of liquefied natural gas, compressed natural gas, and liquefied petroleum gas; and offers engineering, procurement, and construction (EPC) services for the clean energy industry, as well as intelligent IOT platforms under the Anjiehui brand. It offers its products under the Enric, Sanctum, Hongtu, CIMC Tank, Cryobest, YPDI, CIMC SOE, CIMC Hydrogen Energy, and Hashenleng brands. Its Chemical and Environmental segment offers tank containers for the storage and transportation of liquefied or gasified chemicals under the CIMC Tank and Tankmiles brands; maintenance and value-added services for tank containers; and special equipment for environmental protection, as well as environmental protection, pollution treatment, and resource recycling services. Its Liquid Food segment engineers, manufactures, and sells stainless steel tanks for storage and processing liquid food; and provides EPC services for brewery and other liquid food industries under the Ziemann Holvrieka, DME, NSI, McMillan, and Briggs brands. The company also manufactures compressors and accessories, and pressure vessels; offers business solutions for gas equipment; researches and develops technology for natural gas equipment; cryogenic storage and transportation equipment design, manufacture, and technical services; collects, processes, and sells renewable resources; offers terminal and depot, and nonmetallic scrap processing services; and repairs and maintains pressure vessels. The company was incorporated in 2004 and is headquartered in Shenzhen, the People's Republic of China. The company is a subsidiary of China International Marine Containers (Hong Kong) Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518067",
        "website": "http://www.enricgroup.com",
        "market_cap": 15363962880
    },
    "3948.HK": {
        "short_name": "YITAI COAL",
        "long_name": "Inner Mongolia Yitai Coal Co., Ltd.",
        "summary": "Inner Mongolia Yitai Coal Co., Ltd. engages in the mining, production, transportation, and sale of coal products in the Inner Mongolia autonomous region of the People's Republic of China. It operates through three segments: Coal, Coal-Related Chemical, and Transportation. The company also provides road and railway transportation services to coal companies; coal-related chemical products and oil products; and disaster management, supply chain management, industrial development and consultation, business management consultation, and business information consultation services. In addition, it is involved in the coal mining; international trade; goods storage and loading; coal technology development; consultation; infrastructure municipal administration; research and development; oil and coal testing; fund investment and investment management; and chemical production and sale activities. The company was founded in 1997 and is headquartered in Ordos, the People's Republic of China. Inner Mongolia Yitai Coal Co.,Ltd. is a subsidiary of Inner Mongolia Yitai Group Co., Ltd.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Ordos",
        "zipcode": "017000",
        "website": "http://www.yitaicoal.com",
        "market_cap": 4094027520
    },
    "3H3.F": {
        "short_name": "HIDILI INDUSTRY INTL DEV.",
        "long_name": "Hidili Industry International Development Limited",
        "summary": "Hidili Industry International Development Limited, an investment holding company, engages in the coal mining, and manufacture and sale of raw coal and clean coal in the People's Republic of China. It also provides clean coal washing services. The company was incorporated in 2006 and is headquartered in Panzhihua, the People's Republic of China. Hidili Industry International Development Limited is a subsidiary of Sanlian Investment Holding Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Panzhihua",
        "zipcode": "617000",
        "website": "http://www.hidili.com.cn",
        "market_cap": 48062824
    },
    "41S.F": {
        "short_name": "SINOSTAR PEC HLDGS LTD",
        "long_name": "Sinostar PEC Holdings Limited",
        "summary": "Sinostar PEC Holdings Limited, an investment holding company, produces and supplies petrochemical products in the People's Republic of China. It operates in two segments, Gas Separation, and Transport and Logistic Services. The company offers liquefied petroleum gas (LPG), which is used as a source of fuel by households and industrial manufacturers; propylene, an organic compound to produce chemical intermediates, such as polypropylene and vinyl; purified isobutylene, methyl tert-butyl ether, and hydrogen; and polypropylene, a thermoplastic polymer under the Hengchang brand that is used to produce plastic products for various industrial applications. It also provides logistics and transportation services for LPG and petroleum related products. Sinostar PEC Holdings Limited sells its products to manufacturers of petrochemical and plastic products, as well as LPG distributors. The company was incorporated in 2006 and is based in Singapore. Sinostar PEC Holdings Limited is a subsidiary of Intelligent People Holdings Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Dongming",
        "zipcode": "274500",
        "website": "http://www.sinostar-pec.com",
        "market_cap": 141727712
    },
    "4HB.F": {
        "short_name": "HONGHUA GROUP LTD  HD-,10",
        "long_name": "Honghua Group Limited",
        "summary": "Honghua Group Limited, an investment holding company, engages in the research, design, manufacture, setting, and sale of land rigs, related parts, and components. It operates through Land Drilling Rigs; Parts and Components and Others; Drilling Engineering Services; and Fracturing segments. The company designs and manufactures mast and substructures, as well as hoisting, rotating, high and low pressure mud, and auxiliary system parts for rigs; manufactures and assembles rig electrical equipment, including VFD systems, SCR systems, MCC systems, drilling motors, well site circuitry and lighting systems, etc.; and manufactures mud tanks, solids control equipment, drill floor tools, mud manifolds and personnel camps, etc. It also offers various oil and gas engineering services, including well drilling, directional drilling, and seismic services for CNOOC, SHELL, MOGE, PTTEP, NOBEL, etc. In addition, the company provides direct financing lease, operating leasing, sale and leaseback, sublease, and trust and joint lease financing services. Further, it manufactures panels of drilling rigs; trades in drilling rigs and related parts; designs and manufactures offshore drilling modules; and provides technical support, and drilling and fracturing engineering services, as well as after-sales service covering rig installation, commissioning, and solution. The company operates in the People's Republic of China, the Americas, the Middle East, Europe, and Africa, as well as Central, South, and South East Asia. Honghua Group Limited was founded in 1997 and is headquartered in Chengdu, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610036",
        "website": "http://www.hh-gltd.com",
        "market_cap": 156438960
    },
    "5AO.F": {
        "short_name": "ANTON OILFIELD SERVICES",
        "long_name": "Anton Oilfield Services Group",
        "summary": "Anton Oilfield Services Group, an investment holding company, provides oil and gas field development technical services for oil companies in the People's Republic of China and internationally. It operates through three segments: Drilling Technology, Well Completion, and Oil Production Services. The company offers geology technology services, such as oil and gas field design and development, geological engineering, and geological research and technical support; oilfield management and oil and gas development general contract services, including production capacity construction, oil and gas field management general contract, oil/gas field cooperative development, digital oilfield management, reservoir technology support, oilfield operation and maintenance, and supervision; and drilling technology services comprising integrated drilling, rig, directional drilling, drilling fluid and completion fluid, oilfield environmental protection, and cementing. It also provides completion technology services, such as stimulation and integrated completion, completion technique and tool, sand control, fracturing and pumping, coiled tubing operation, stimulation chemical, and logging; workover and well testing, and oil production technology services; and inspection technology, including oilfield nondestructive detection and evaluation, special equipment testing, gas leaking inspection, pipeline inspection, metrology inspection, and environmental inspection, as well as tubing and casing inspection, repairing, and anti-corrosion technology services. In addition, the company offers asset leasing services, such as drilling tool, drilling equipment, oilfield production equipment, and oilfield production facility leasing services. Further, it manufactures rod casings; and provides construction services. The company was founded in 1999 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://www.antonoil.com",
        "market_cap": 173276880
    },
    "5PD.SI": {
        "short_name": "$ Hengyang Petro",
        "long_name": "Hengyang Petrochemical Logistics Limited",
        "summary": "Hengyang Petrochemical Logistics Limited, an investment holding company, provides logistics service for the petrochemical industry in the People's Republic of China. It offers storage and land transportation services for bulk liquid petrochemicals, gases, and oils, such as methanol, acetic acid, phenol, acetone, styrene, ethylene glycol, polyether polyol, propane, butane, gasoline, diesel, and fuel oil and base oil. The company also provides whole-tank leasing, and spot leasing services, as well as manages port terminal. Hengyang Petrochemical Logistics Limited was founded in 2002 and is based in Jiangyin, the People's Republic of China.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "state": null,
        "city": "Jiangyin",
        "zipcode": "214446",
        "website": "http://www.hyplc.com",
        "market_cap": 31740072
    },
    "600121.SS": {
        "short_name": "ZHENGZHOU COAL INDUSTRY & ELECT",
        "long_name": "Zhengzhou Coal Industry & Electric Power Co., Ltd.",
        "summary": "Zhengzhou Coal Industry & Electric Power Co., Ltd. produces and sells coal in China. The company offers lean coal and anthracite for use as industrial power coal. It is also involved in material marketing and supply, power generation, power transmission and transformation, railway transport, and other businesses. The company is based in Zhengzhou, China. Zhengzhou Coal Industry & Electric Power Co., Ltd. operates as a subsidiary of Zhengzhou Coal Industry(Group)Co.,Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhengzhou",
        "zipcode": "450007",
        "website": "http://www.zzce.com.cn",
        "market_cap": 7164250624
    },
    "600123.SS": {
        "short_name": "SHANXI LANHUA SCI-TECH VENTURE",
        "long_name": "Shanxi Lanhua Sci-Tech Venture Co.,Ltd",
        "summary": "Shanxi Lanhua Sci-Tech Venture Co.,Ltd engages in the production and sale of coal. It also offers chemical products comprising urea, fertilizer products, caprolactam products, dimethyl ether, and methanol. Shanxi Lanhua Sci-Tech Venture Co.,Ltd was founded in 1998 and is based in Jincheng, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jincheng",
        "zipcode": "048000",
        "website": "http://www.chinalanhua.com",
        "market_cap": 10510080000
    },
    "600157.SS": {
        "short_name": "WINTIME ENERGY CO LTD",
        "long_name": "Wintime Energy Co.,Ltd.",
        "summary": "Wintime Energy Co.,Ltd., an integrated energy company, engages in the power, coal, and petrochemical businesses in China. It mines and produces coking coal; generates power; and provides petrochemical products. The company has an electric power installed capacity of 12.41 million kilowatts. It is also involved in the blending and processing of fuel oil; storage and trading of petrochemical products; development of terminals; and operation and management business. The company was formerly known as Thai An Lurun Corporation and changed its name to Wintime Energy Co.,Ltd. in October 2010. Wintime Energy Co.,Ltd. was founded in 1992 and is headquartered in Taiyuan, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taiyuan",
        "zipcode": "030006",
        "website": "http://www.wtecl.com",
        "market_cap": 36215013376
    },
    "600188.SS": {
        "short_name": "YANZHOU COAL MINING COMPANY LIM",
        "long_name": "Yanzhou Coal Mining Company Limited",
        "summary": "Yanzhou Coal Mining Company Limited primarily engages in the mining, preparation, and sale of coal in China and internationally. It offers thermal, PCI, and coking coal for electric power, metallurgy and chemical industry, etc.; produces and sells coal chemicals, including methanol, liquid wax, stable light hydrocarbon, acetic acid, ethyl acetate, etc., as well as electricity and related heat supply services; and explores for potash mineral. The company also manufactures, installs, repairs, and sells coal mining and excavating equipment, cable, and electrical equipment. In addition, it provides railway, river, and lakes transportation services; and sells construction materials. Further, the company is involved in the wholesale of coal and non-ferrous metals; house and financial leasing; logistics storage and leasing; development of charcoal products; LTCC technology development and equipment rental operations; manufacturing and sale of cable and rubber products; and production and processing of steel engineering components. Additionally, it provides underground mines management; mining materials testing; equity investment fund and corporate asset management, investment advisory and management, foreign investment fund, import and export, and international trading; solar and wind power, and production management; educational software development and event planning; and coal mining technology development, transfer, and consultation services. The company is also involved in the processing, production, and sale of FischerTropsch synthesis catalyst, composite pipe, and plastic profile products; provision of real estate development and operation, property management, garden greening engineering, and sewage treatment and rental housing agency services; and issuing subordinated capital notes. The company was founded in 1973 and is based in Zoucheng, the People's Republic of China. Yanzhou Coal Mining Company Limited is a subsidiary of Yankuang Group Corporation Limited.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zoucheng",
        "zipcode": "273500",
        "website": "http://www.yanzhoucoal.com.cn",
        "market_cap": 60937420800
    },
    "600256.SS": {
        "short_name": "GUANGHUI ENERGY CO LTD",
        "long_name": "Guanghui Energy Co., Ltd.",
        "summary": "Guanghui Energy Co., Ltd. operates in the energy development business in China. Its principal products include coal, LNG, alcohol ether, coal tar, and petroleum. The company focuses on natural gas liquefaction, coal mining, coal chemical conversion, and oil and gas exploration and development activities, as well as energy logistics services. It also trades in crude oil. The company was formerly known as Xinjiang Guanghui Industrial Co., Ltd. and changed its name to Guanghui Energy Co., Ltd. in June 2012. Guanghui Energy Co., Ltd. was founded in 1994 and is based in Urumqi, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Urumqi",
        "zipcode": "830002",
        "website": "http://www.xjguanghui.com",
        "market_cap": 24989911040
    },
    "600348.SS": {
        "short_name": "SHAN XI HUA YANG GROUP NEW ENER",
        "long_name": "Shan Xi Huayang Group New Energy Co.,Ltd.",
        "summary": "Shan Xi Huayang Group New Energy Co.,Ltd. operates in the coal mining industry. The company is involved in the production, washing and processing, and sale of coal; production and sale of electricity; production and sale of thermal energy; road general cargo transportation; equipment leasing; and construction machinery accessories businesses. Its coal products are used in electricity, fertilizer, metallurgy, machinery, building materials, and other industries. The company was formerly known as Yangquan Coal Industry (Group) Co., Ltd. and changed its name to Shan Xi Huayang Group New Energy Co.,Ltd. in January 2021. Shan Xi Huayang Group New Energy Co.,Ltd. was founded in 1999 and is based in Yangquan, China. Shan Xi Huayang Group New Energy Co.,Ltd. is a subsidiary of Shanxi State-Owned Capital Investment and Operation Co., Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yangquan",
        "zipcode": null,
        "website": "http://www.yqmy.ymjt.com.cn",
        "market_cap": 16714748928
    },
    "600381.SS": {
        "short_name": "QINGHAI SPRING MEDICINAL RESOUR",
        "long_name": "Qinghai Spring Medicinal Resources Technology Co., Ltd.",
        "summary": "Qinghai Spring Medicinal Resources Technology Co., Ltd. explores and develops natural medicinal resources on the Qinghai-Tibet Plateau. It provides polar and Herborist grass 5X cordyceps sinensis series of products, and cordyceps sinensis pure powder tablets. The company was founded in 2003 and is based in Xining, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xining",
        "zipcode": "810007",
        "website": "http://www.verygrass.com",
        "market_cap": 4643652608
    },
    "600395.SS": {
        "short_name": "GUIZHOU PANJIANG REFINED COAL",
        "long_name": "Guizhou Panjiang Refined Coal Co.,Ltd.",
        "summary": "Guizhou Panjiang Refined Coal Co.,Ltd. engages in mining, processing, and selling of coal in China and internationally. The company offers coking coal, injection coal, etc. for use in the iron and steel chemical industry; and thermal coal for power supply, cement, and other industries. It also engages in the manufacture and repair of mechanical and electrical products; production and sale of electricity through coal; equipment rental and repair activities; installation, recovery, and maintenance of mining and excavation equipment; and inspection and experiment of industrial equipment. In addition, the company is involved in the leasing and sale of real estate; property management; heat supplies; hotel operation and management activities; and construction and maintenance of underground anti-well engineering projects and power supply lines. Further, it undertakes forest leisure health and vacation projects, woodland edible fungus planting projects, ecological breeding projects, etc.; and provides real estate intermediary, contract repair, technical and skill training, training financial handling and financing advisory, credit verification and related consulting, and insurance agency services, as well as support products for mine shafts. The company is based in Liupanshui, China. Guizhou Panjiang Refined Coal Co.,Ltd. is a subsidiary of GuiZhou PanJiang Investment Holdings (Group) Co., Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Liupanshui",
        "zipcode": "553536",
        "website": "http://www.pjgf.cn",
        "market_cap": 12644581376
    },
    "600403.SS": {
        "short_name": "HENAN DAYOU ENERGY CO LTD",
        "long_name": "Henan Dayou Energy Co., Ltd",
        "summary": "Henan Dayou Energy Co., Ltd. engages in raw coal mining activities in China. The company is involved in mining, washing, processing, and wholesale of coal. It offers long flame, coking, lean, and cleaned coal for use in various industries, including chemical, power generation, building material, and other industries, as well as in industrial boilers and coking coal. The company was formerly known as Nanjing Xinwang Telecom Tech Co.,Ltd and changed its name to Henan Dayou Energy Co., Ltd. in 2010. Henan Dayou Energy Co., Ltd. was founded in 1998 and is based in Yima, China. Henan Dayou Energy Co., Ltd. is a subsidiary of Yima Coal Industry Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yima",
        "zipcode": "472300",
        "website": "http://hndayou.com.cn",
        "market_cap": 8535192064
    },
    "600508.SS": {
        "short_name": "SHANGHAI DATUN ENERGY RESOURCES",
        "long_name": "Shanghai Datun Energy Resources Co., Ltd.",
        "summary": "Shanghai Datun Energy Resources Co., Ltd. engages in the production and sale of coal primarily in China. The company offers coking coal, gas coal, gas fat coal, clean coal, washed and mixed medium block, mixed coal, and power clean coal. It also produces electricity; and provides aluminum ingots, aluminum rods, aluminum sheets, aluminum profiles, and anode carbon, as well as operates railway line for coal and passenger transportation. The company was founded in 1999 and is based in Shanghai, China. Shanghai Datun Energy Resources Co., Ltd. is a subsidiary of China Coal Energy Company Limited.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.sdtny.com",
        "market_cap": 7234407424
    },
    "600617.SS": {
        "short_name": "SHANXI GUOXIN ENERGY CORPORATIO",
        "long_name": "Shanxi Guoxin Energy Corporation Limited",
        "summary": "Shanxi Guoxin Energy Corporation Limited engages in the energy management business. The company's products primarily include natural gas, coal bed methane, and coal gas. It also provides energy sector related consulting services. The company was formerly known as Shanghai Lianhua Synthetic Fiber Co., Ltd. and changed its name to Shanxi Guoxin Energy Corporation Limited in July 2014. The company was incorporated in 1992 and is based in Taiyuan, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taiyuan",
        "zipcode": null,
        "website": "http://www.600617.com.cn",
        "market_cap": 5453432320
    },
    "600688.SS": {
        "short_name": "SINOPEC SHANGHAI PETROCHEMICAL ",
        "long_name": "Sinopec Shanghai Petrochemical Company Limited",
        "summary": "Sinopec Shanghai Petrochemical Company Limited, together with its subsidiaries, manufactures and sells petrochemical products in the People's Republic of China. It operates through five segments: Synthetic Fibers, Resins and Plastics, Intermediate Petrochemicals, Petroleum Products, and Trading of Petrochemical Products. The Synthetic Fibers segment produces polyesters, acrylic fibers, and carbon fibers that are primarily used in the textile and apparel industries. The Resins and Plastics segment produces polyester chips that are used to produce polyester fibers, coating, and containers; polyethylene resins and plastics, which are used to produce insulated cables and mulching films, as well as molded products, such as housewares and toys; and polypropylene resins that are used for films and sheets, as well as molded products, such as housewares, toys, consumer electronics, and automobile parts; and PVA granules. The Intermediate Petrochemicals segment produces p-xylene, benzene, and ethylene oxide, which are used as raw materials in the production of other petrochemicals, resins, plastics, and synthetic fibers. The Petroleum Products segment operates crude oil refinery facilities used to produce refined gasoline, fuel, diesel oil, heavy oil, and liquefied petroleum gas. The Trading of Petrochemical Products segment is involved in the import and export of petrochemical products. The company was founded in 1972 and is based in Shanghai, the People's Republic of China. Sinopec Shanghai Petrochemical Company Limited is a subsidiary of China Petroleum & Chemical Corporation.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200540",
        "website": "http://www.spc.com.cn",
        "market_cap": 34204387328
    },
    "600968.SS": {
        "short_name": "CNOOC ENERGY TECHNOLOGY & SERVI",
        "long_name": "CNOOC Energy Technology & Services Limited",
        "summary": "CNOOC Energy Technology & Services Limited operates in the oil and gas industry in China. The company operates through four segments: Energy Technology Services; FPSO Production Technology Services; Energy Logistics Services; Safety, Environmental Protection and Energy Conservation. It offers energy technology services, such as engineering and technical, equipment operation and maintenance, pipeline technical, and data information services; FPSO production technology services; energy logistics services, including logistics, sales, and catering services; and oil spill emergency, safety and environmental protection technology, industrial water treatment, training services, coatings and industrial protection, catalyst, LNG cold energy utilization, and energy conservation and environmental monitoring services. The company is based in Beijing, China. CNOOC Energy Technology & Services Limited is a subsidiary of China National Offshore Oil Corporation.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100027",
        "website": "http://cenertech.cnooc.com.cn",
        "market_cap": 27649071104
    },
    "600971.SS": {
        "short_name": "ANHUI HENGYUAN COAL INDUSTRY&EL",
        "long_name": "Anhui Hengyuan Coal-Electricity Group Co., Ltd.",
        "summary": "Anhui Hengyuan Coal-Electricity Group Co., Ltd. engages in mining, processing, washing, and sale of coal in China. It offers lean coal, 1/3 coking coal, gas fat coal, anthracite coal, and coking coal, which are used in electric power, metallurgy, petrochemical, building materials, coking, blast furnace injection, civil use, etc. The company is based in Huaibei City, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Huaibei City",
        "zipcode": "234000",
        "website": "http://www.ahhymd.com.cn",
        "market_cap": 8267999744
    },
    "601001.SS": {
        "short_name": "JINNENG HOLDING SHANXI COAL IND",
        "long_name": "Jinneng Holding Shanxi Coal Industry Co.,ltd.",
        "summary": "Jinneng Holding Shanxi Coal Industry Co.,ltd., together with its subsidiaries, engages in the mining, washing, processing, production, and sale of coal products in China. The company also exports its products. It serves various industries, including electric power, metallurgical, etc. The company was founded in 2001 and is based in Datong, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Datong",
        "zipcode": "037003",
        "website": "http://www.dtcoalmine.com",
        "market_cap": 14075816960
    },
    "601088.SS": {
        "short_name": "CHINA SHENHUA ENERGY COMPANY LT",
        "long_name": "China Shenhua Energy Company Limited",
        "summary": "China Shenhua Energy Company Limited and its subsidiaries engage in the production and sales of coal and power; railway, port, and shipping transportation; and coal-to-olefins businesses in the People's Republic of China and internationally. The company's Coal segment produces coal from surface and underground mines; and sells coal to power plants, metallurgical and coal chemical producers, and provincial/regional electric grid companies. As of December 31, 2020, this segment had the recoverable coal reserves of 14.42 billion tones. Its Power segment generates and sells electric power to power grid companies. This segment generates electric power through coal, thermal, wind, water, and gas. The company's Railway segment provides railway transportation services. Its Port segment offers loading, transportation, and storage services. The company's Shipping segment provides shipment transportation services. Its Coal Chemical segment produces and sells methanol; and polyethylene and polypropylene, as well as other by-products. The company was incorporated in 2004 and is based in Beijing, China. China Shenhua Energy Company Limited is a subsidiary of China Energy Investment Corporation Limited.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100011",
        "website": "http://www.csec.com",
        "market_cap": 385428291584
    },
    "601101.SS": {
        "short_name": "BEIJING HAOHUA ENERGY RESOURCE ",
        "long_name": "Beijing Haohua Energy Resource Co., Ltd.",
        "summary": "Beijing Haohua Energy Resource Co., Ltd. engages in the mining, washing, processing, export, and sale of coal in China. It offers anthracite and thermal coal. The company provides anthracite coal for use in metallurgy, electric power, chemical industry, etc. Beijing Haohua Energy Resource Co., Ltd. was founded in 2002 and is based in Beijing, China. Beijing Haohua Energy Resource Co., Ltd. is a subsidiary of Beijing Energy Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "102300",
        "website": "http://www.bjhhny.com",
        "market_cap": 6816000000
    },
    "601225.SS": {
        "short_name": "SHAANXI COAL INDUSTRY",
        "long_name": "Shaanxi Coal Industry Company Limited",
        "summary": "Shaanxi Coal Industry Company Limited, together with its subsidiaries, mines, produces, washes, processes, and sells coal in China and internationally. It primarily explores for power, chemical, and metallurgical coal. The company has coal reserves of 16.433 billion tons; and recoverable reserves of 10.269 billion tons. Its coal properties are primarily located in Northern Shaanxi and Huanghua. It markets its products under the Huangling, Huangling No.1, Yuhua, and Hongliulin brand names. The company was founded in 2008 and is based in Xi'an, China. Shaanxi Coal Industry Company Limited is a subsidiary of Shaanxi Coal and Chemical Industry Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": "710077",
        "website": "http://www.shxcoal.com",
        "market_cap": 126800003072
    },
    "601666.SS": {
        "short_name": "PINGDINGSHAN TIANAN COAL MINING",
        "long_name": "Pingdingshan Tianan Coal. Mining Co., Ltd.",
        "summary": "Pingdingshan Tianan Coal. Mining Co., Ltd. engages in the mining, washing, processing, and sale of coal in China. It offers coking, fat, thermal, and smelted refined coal. The company was incorporated in 1998 and is based in Pingdingshan, China. Pingdingshan Tianan Coal. Mining Co., Ltd. is a subsidiary of China Pingmei Shenma Energy Chemical Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Pingdingshan",
        "zipcode": null,
        "website": "http://www.pmta.com.cn",
        "market_cap": 17356744704
    },
    "601699.SS": {
        "short_name": "SHANXI LU'AN ENV.ENERGY DEV.CO.",
        "long_name": "Shanxi Lu'an Environmental Energy Development Co., Ltd.",
        "summary": "Shanxi Lu'an Environmental Energy Development Co., Ltd. engages in raw coal mining, coal washing, and coal coke smelting for power generation, power, coking, and steel industries. It develops and utilizes clean coal technology; develops coalbed methane; and offers thermal coal, blended coal, clean coal, injection coal, and mixed coal. The company has production mines in Wuyang Coal Mine, Zhangcun Coal Mine, Wangzhuang Coal Mine, and Changcun Coal Mine. The company was founded in 2001 and is based in Changzhi, China. Shanxi Lu'an Environmental Energy Development Co., Ltd. is a subsidiary of Shanxi Lu'an Mining Industry (Group) Company Limited.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changzhi",
        "zipcode": "046204",
        "website": "http://www.luanhn.com",
        "market_cap": 37931077632
    },
    "601798.SS": {
        "short_name": "LANPEC TECHNOLOGIES CO LTD.",
        "long_name": "Lanpec Technologies Limited",
        "summary": "Lanpec Technologies Limited manufactures and sells petroleum and petrochemical equipment in China and internationally. The company offers oil drilling machinery, including oil drilling machinery DC drive, DC drive cluster, and 1500-7000 meters series drilling rigs; and mud pumps and mud pump single pumps, mud pump wearing parts and petroleum cylinder roller chains, pumping units/rods/pump products, drill products, and screws drilling and other downhole tools. It also provides refining and chemical equipment, which include shell-and-shell heat exchangers, tube heat exchangers, heat exchanger separators, liquefied natural gas open-frame gasifiers, surface evaporation air coolers, hydrogenation heat exchangers, heat extraction furnaces, plate air cooling, plate evaporators, liquid hydrocarbon spherical storage tanks, cryogenic spherical tanks, egg-shaped sludge digestion tanks, and thermal power unit plate type air-condensing steam devices; synthesis towers, nitrogen storage tanks, and hydrocracking high-pressure heat exchangers; and liquefied petroleum gas cryogenic spherical tanks and liquid hydrocarbon spherical tanks. In addition, the company offers offshore oil equipment comprising oil and gas separation equipment, oil and gas water treatment systems, oily sewage treatment systems, and water injection systems; and engineering software design, as well as technical services. Further, it provides light and food machinery and equipment, such as plate heat exchangers, plate type sterilization units, plate and tube evaporators, and plate condensers. Lanpec Technologies Limited was founded in 1960 and is based in Lanzhou, China. As on March 13, 2020, Lanpec Technologies Limited operates as subsidiary of China Energy Engineering Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Lanzhou",
        "zipcode": "730070",
        "website": "http://www.lanpec.com",
        "market_cap": 2180347136
    },
    "601857.SS": {
        "short_name": "PETROCHINA CO",
        "long_name": "PetroChina Company Limited",
        "summary": "PetroChina Company Limited, together with its subsidiaries, engages in a range of petroleum related products, services, and activities in Mainland China and internationally. It operates through Exploration and Production, Refining and Chemicals, Marketing, and Natural Gas and Pipeline segments. The Exploration and Production segment engages in the exploration, development, production, and marketing of crude oil and natural gas. The Refining and Chemicals segment refines crude oil and petroleum products; and produces and markets primary petrochemical products, derivative petrochemical products, and other chemical products. The Marketing segment is involved in marketing of refined products and trading business. The Natural Gas and Pipeline segment engages in the transmission of natural gas, crude oil, and refined products; and sale of natural gas. As of December 31, 2020, the company had a total length of 31,151 km, including 22,555 km of natural gas pipelines, 7,190 km of crude oil pipelines, and 1,406 km of refined product pipelines. The company is also involved in the exploration, development, and production of oil sands and coalbed methane; trading of crude oil and petrochemical products; storage, chemical engineering, storage facilities, service station, and transportation facilities and related businesses; and production and sales of basic and derivative chemical, and other chemical products. The company was founded in 1999 and is headquartered in Beijing, the People's Republic of China. PetroChina Company Limited is a subsidiary of China National Petroleum Corporation.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100007",
        "website": "http://www.petrochina.com.cn",
        "market_cap": 901170790400
    },
    "603003.SS": {
        "short_name": "SHANGHAI LONYER FUELS CO LTD",
        "long_name": "Shanghai Lonyer Fuels Co., Ltd.",
        "summary": "Shanghai Lonyer Fuels Co., Ltd. trades in oil products in China. The company has an oil storage base with a total capacity of approximately 70,000 cubic meters, as well as five refined oil transportation vessels and refueling vessels for oil trading, maritime transportation, and water refueling. The company also engages in the non-ferrous metals trading business; and provision of cloud data infrastructure services. The company was founded in 1997 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200122",
        "website": "http://www.lyrysh.com",
        "market_cap": 2921736448
    },
    "603318.SS": {
        "short_name": "SHUIFA ENERGAS GAS CO LTD",
        "long_name": "Dalian Energas Gas-System Co., Ltd.",
        "summary": "Dalian Energas Gas-System Co., Ltd. designs, manufactures, sells, and services fuel gas transmission-distribution systems and related products in China and internationally. Its primary products include fuel gas distribution systems, fuel gas application systems, spare parts, etc. The company's application system products comprise auxiliary equipment for gas turbines, material supply directly pipes for gas turbines, and seal pipes of steam turbines. It also provides gas distribution systems comprising boosting stations, reducing stations, long-distance pipeline distribution systems, offshore platform distribution systems, and city gate stations; gas application systems consisting of final and fuel, water washing, and lubricating oil skids, as well as MSD and seal piping systems; and distributed energy solutions, such as combined cooling heating and power systems. In addition, the company offers fuel gas pressure regulating boxes and regulators, and LNG gas filling stations. Further, it provides manufacturing, packing, transportation, erection, commissioning, start-up, and after sale services. The company was founded in 2002 and is based in Dalian, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dalian",
        "zipcode": "116600",
        "website": "http://www.energas.cn",
        "market_cap": 2502432768
    },
    "603619.SS": {
        "short_name": "ZHONGMAN PETROLEUM AND NATURAL ",
        "long_name": "Zhongman Petroleum and Natural Gas Group Corp., Ltd.",
        "summary": "Zhongman Petroleum and Natural Gas Group Corp., Ltd., an oil and gas company, engages in the drilling engineering contractor and petroleum equipment manufacture businesses. The company offers drilling and drilling completion package, oil and gas exploration and development, geological exploration project, international trade, drilling engineering and technology, and vehicle natural gas installation and technical services. It is also involved in the provision of services for the sets of drilling rigs, rig parts, and special vehicles, including pre-delivery training, delivery post-training and technical, station-based spare parts support, drilling team formation, training, technical consultation services, etc.; and intimate services, such as assembly commissioning, technical guidance, user training, use security, maintenance, repair, and other services, as well as manufactures oil rig and equipment. The company operates sales and service networks in various oil fields in China, the Middle East, and Central Asia. Zhongman Petroleum and Natural Gas Group Corp., Ltd. is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.zpec.com",
        "market_cap": 4159999744
    },
    "603727.SS": {
        "short_name": "BOMESC OFFSHORE ENGINEERING CO ",
        "long_name": "BOMESC Offshore Engineering Company Limited",
        "summary": "BOMESC Offshore Engineering Company Limited provides engineering, procurement, and construction (EPC) services for offshore oil and gas industries. The company provides design and construction EPC services for electronic modules, life modules, chemical injection modules, sledges, ocean engineering modules, and modules used in LNG mining, refinery, and chemical plants. It offers design, construction, onshore installation, and shipment and offshore installation for living-quarter, electrical, CEM, process, and the public modules; fire pump rooms; and water tanks and diesel tanks, which are used in the facilities construction of the upper artificial island. The company operates in China, the Middle East, North and South America, Africa, Singapore, Europe, Australia, and internationally. BOMESC Offshore Engineering Company Limited was founded in 1996 and is headquartered in Tianjin, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300457",
        "website": "http://www.bomesc.com",
        "market_cap": 4262330880
    },
    "603800.SS": {
        "short_name": "SUZHOU DOUSON DRILLING AND PROD",
        "long_name": "Suzhou Douson Drilling & Production Equipment Co., Ltd.",
        "summary": "Suzhou Douson Drilling&Production Equipment Co., Ltd. manufactures and sells drilling and production equipment to the oil, gas, and chemical industries in China, the United States, Canada, Spain, the United Kingdom, Australia, the Middle East, and Russia. It offers CW type wellhead equipment, oil and gas production and testing devices, various valves and actuators, manifolds, BOP products, subsea valves and connectors, well control equipment, and driver spindles. The company was founded in 2001 and is headquartered in Suzhou, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": null,
        "website": "http://www.douson.cn",
        "market_cap": 1899040000
    },
    "603906.SS": {
        "short_name": "JIANGSU LOPAL TECH CO LTD",
        "long_name": "JIANGSU LOPAL TECH.CO.,Ltd.",
        "summary": "Jiangsu Lopal Tech.Co.,Ltd., an independent oil company, provides automotive and industrial lubricants, and automotive chemicals in China. The company's primary products include motor gasoline engine oil, diesel oil, car care products, vehicles, gear oil, hydraulic oil, antifreeze, brake fluid, grease, motorcycle oil, engineering machinery lubricants, etc. It operates under the Lung Poon, Kan Lan Su, and 3ECARE brands. The company was formerly known as Jiangsu Lung Poon Petrochemical Co., Ltd. Jiangsu Lopal Tech.Co.,Ltd. was founded in 2003 and is headquartered in Nanjing, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "210038",
        "website": "http://www.lopal.com.cn",
        "market_cap": 11115650048
    },
    "8479.HK": {
        "short_name": "JTF INTL",
        "long_name": "JTF International Holdings Limited",
        "summary": "JTF International Holdings Limited, an investment holding company, engages in the blending and selling fuel oil in the People's Republic of China. It also sells refined oil and other petrochemical products. The company was incorporated in 2014 and is headquartered in Guangzhou, China. JTF International Holdings Limited is a subsidiary of Thrive Shine Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.jtfoil.com",
        "market_cap": 558000000
    },
    "8HL.F": {
        "short_name": "HILONG HOLDING LTD HD-,10",
        "long_name": "Hilong Holding Limited",
        "summary": "Hilong Holding Limited, an investment holding company, provides oil field equipment and services worldwide. The company operates through Oilfield Equipment Manufacturing and Services, Line Pipe Technology and Services, Oilfield Services, and Offshore Engineering Service segments. The Oilfield Equipment Manufacturing and Service segment produces and sells oilfield equipment; and offers oil country tubular goods (OCTG) coating services. The Line Pipe Technology and Services segment provides services related to oil and gas pipeline; and produces coating materials for anticorrosive and anti-friction purposes. The Oilfield Services segment offers well drilling services; integrated comprehensive services; and OCTG trading and related services to oil and gas producers. The Offshore Engineering Services segment provides offshore engineering and design services. The company is also involved in the manufacture, trading, and distribution of oil and gas equipment; the manufacture and distribution of hardbanding materials and special steel; the research and development on the technology of manufacturing oil and gas equipment, as well as coating services; the research, inspection, and repairment of oil and gas equipment; and the provision of offshore oilfield services. Hilong Holding Limited was founded in 2002 and is headquartered in Shanghai, the People's Republic of China. Hilong Holding Limited is a subsidiary of Hilong Group Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200949",
        "website": "http://www.hilonggroup.com",
        "market_cap": 50528312
    },
    "900913.SS": {
        "short_name": "SHANXI GUOXIN ENERGY CORPORATIO",
        "long_name": "Shanxi Guoxin Energy Corporation Limited",
        "summary": "Shanxi Guoxin Energy Corporation Limited engages in the energy management business. The company's products primarily include natural gas, coal bed methane, and coal gas. It also provides energy sector related consulting services. The company was formerly known as Shanghai Lianhua Synthetic Fiber Co., Ltd. and changed its name to Shanxi Guoxin Energy Corporation Limited in July 2014. The company was incorporated in 1992 and is based in Taiyuan, China.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taiyuan",
        "zipcode": null,
        "website": "http://www.600617.com.cn",
        "market_cap": 5628387328
    },
    "900948.SS": {
        "short_name": "INNER MONGOLIA YITAI COAL",
        "long_name": "Inner Mongolia Yitai Coal Co., Ltd.",
        "summary": "Inner Mongolia Yitai Coal Co., Ltd. engages in the mining, production, transportation, and sale of coal products in the Inner Mongolia autonomous region of the People's Republic of China. It operates through three segments: Coal, Coal-Related Chemical, and Transportation. The company also provides road and railway transportation services to coal companies; coal-related chemical products and oil products; and disaster management, supply chain management, industrial development and consultation, business management consultation, and business information consultation services. In addition, it is involved in the coal mining; international trade; goods storage and loading; coal technology development; consultation; infrastructure municipal administration; research and development; oil and coal testing; fund investment and investment management; and chemical production and sale activities. The company was founded in 1997 and is headquartered in Ordos, the People's Republic of China. Inner Mongolia Yitai Coal Co.,Ltd. is a subsidiary of Inner Mongolia Yitai Group Co., Ltd.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ordos",
        "zipcode": "017000",
        "website": "http://www.yitaicoal.com",
        "market_cap": 3306950400
    },
    "AMCF": {
        "short_name": "ANDATEE CHINA MARINE FUEL SVCS ",
        "long_name": "Andatee China Marine Fuel Services Corporation",
        "summary": "Andatee China Marine Fuel Services Corporation, through its subsidiaries, engages in the production, storage, distribution, and trading of blended marine fuel oil for cargo and fishing vessels in the People's Republic of China. The company also produces customer specific products using its proprietary blending technology. It sells its products through distributors, as well as to retail customers in Liaoning, Shandong, Jiangsu, Shanghai, Guangdong, and Zhejiang Provinces. The company is based in Dalian, the People's Republic of China.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Dalian",
        "zipcode": null,
        "website": "http://www.andatee.com",
        "market_cap": 1728281
    },
    "C9Q.SI": {
        "short_name": "Sinostar Pec",
        "long_name": "Sinostar PEC Holdings Limited",
        "summary": "Sinostar PEC Holdings Limited, an investment holding company, produces and supplies petrochemical products in the People's Republic of China. It operates in two segments, Gas Separation, and Transport and Logistic Services. The company offers liquefied petroleum gas (LPG), which is used as a source of fuel by households and industrial manufacturers; propylene, an organic compound to produce chemical intermediates, such as polypropylene and vinyl; purified isobutylene, methyl tert-butyl ether, and hydrogen; and polypropylene, a thermoplastic polymer under the Hengchang brand that is used to produce plastic products for various industrial applications. It also provides logistics and transportation services for LPG and petroleum related products. Sinostar PEC Holdings Limited sells its products to manufacturers of petrochemical and plastic products, as well as LPG distributors. The company was incorporated in 2006 and is based in Singapore. Sinostar PEC Holdings Limited is a subsidiary of Intelligent People Holdings Limited.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "state": null,
        "city": "Dongming",
        "zipcode": "274500",
        "website": "http://www.sinostar-pec.com",
        "market_cap": 262400000
    },
    "CCOZF": {
        "short_name": "CHINA COAL ENERGY COMPANY",
        "long_name": "China Coal Energy Company Limited",
        "summary": "China Coal Energy Company Limited primarily mines for, processes, produces, and sells coal in the People's Republic of China and internationally. It operates through Coal, Coal-Chemical, Mining Machinery, Finance, and Others segments. The company offers thermal and coking coal. It also produces and sells polyolefin, methanol, urea, and other coal chemical products, as well as coke; researches, designs, develops, manufactures, and sells coal mining machinery and equipment; and provides after-sales services. In addition, the company is involved in aluminum, electricity generation, and other manufacturing businesses. Further, it provides equipment trading agency, tendering, investment management, finance, and waste disposal services. The company was founded in 2006 and is based in Beijing, the People's Republic of China. China Coal Energy Company Limited is a subsidiary of China National Coal Group Corporation.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100120",
        "website": "http://www.chinacoalenergy.com",
        "market_cap": 15044795392
    },
    "CCOZY": {
        "short_name": "CHINA COAL ENERGY COMPANY",
        "long_name": "China Coal Energy Company Limited",
        "summary": "China Coal Energy Company Limited primarily mines for, processes, produces, and sells coal in the People's Republic of China and internationally. It operates through Coal, Coal-Chemical, Mining Machinery, Finance, and Others segments. The company offers thermal and coking coal. It also produces and sells polyolefin, methanol, urea, and other coal chemical products, as well as coke; researches, designs, develops, manufactures, and sells coal mining machinery and equipment; and provides after-sales services. In addition, the company is involved in aluminum, electricity generation, and other manufacturing businesses. Further, it provides equipment trading agency, tendering, investment management, finance, and waste disposal services. The company was founded in 2006 and is based in Beijing, the People's Republic of China. China Coal Energy Company Limited is a subsidiary of China National Coal Group Corporation.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100120",
        "website": "http://www.chinacoalenergy.com",
        "market_cap": 14534543360
    },
    "CHOLF": {
        "short_name": "CHINA OILFIELD SERVICES",
        "long_name": "China Oilfield Services Limited",
        "summary": "China Oilfield Services Limited, together with its subsidiaries, provides integrated offshore oilfield services in Mainland China and internationally. The company operates through four segments: Drilling Services, Well Services, Marine Support Services, and Geophysical Acquisition and Surveying Services. The Drilling Services segment provides jack-up drilling rig, semi-submersible drilling rig, module rig, and land drilling rig services. As of December 31, 2020, it operated and managed 57 drilling rigs, which include 43 jack-up drilling rigs and 14 semi-submersible drilling rigs; and 5 module rigs. The Well Services segment offers onshore and offshore well services, including logging, drilling and completion fluids, directional drilling, cementing, well completion and workover, stimulation, etc. The Marine Support Services segment owns and operates offshore vessels that provide services for offshore oil and gas exploration, development, construction, and production. This segment also offers anchor handling for various water level, towing of drilling rigs/engineering barges, oil lifting, offshore transportation, standby, firefighting, rescue, oil spill assisting, and other marine support services. It operates and manages approximately 140 vessels, including AHTS vessels, platform supply vessels, and oilfield standby vessels. The Geophysical Acquisition and Surveying Services segment provides offshore seismic acquisition, offshore geo-surveying, seismic data processing and interpretation, and fundamental construction services. This segment owns 5 towing streamer seismic vessels, 1 professional source vessel, 2 ocean bottle cable teams, 5 integrated marine surveying vessels, and 2 support vessels. China Oilfield Services Limited also issues bonds. The company is based in Sanhe, China. China Oilfield Services Limited is a subsidiary of China National Offshore Oil Corporation.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Sanhe",
        "zipcode": "065201",
        "website": "http://www.cosl.com.cn",
        "market_cap": 8434257408
    },
    "CHU.F": {
        "short_name": "CHINA PETRO.+ CHEM. H YC1",
        "long_name": "China Petroleum & Chemical Corporation",
        "summary": "China Petroleum & Chemical Corporation, an energy and chemical company, engages in oil and gas, and chemical operations in the People's Republic of China. It operates through five segments: Exploration and Production, Refining, Marketing and Distribution, Chemicals, and Corporate and Others. The company explores for and develops oil fields; produces crude oil and natural gas; processes and purifies crude oil; and manufactures and sells petroleum products. It also owns and operates oil depots and service stations; and distributes and sells refined petroleum products, including gasoline and diesel through wholesale and retail sales networks. In addition, the company manufactures and sells petrochemical and derivative petrochemical products; and other chemical products, such as basic organic chemicals, synthetic resins, synthetic fiber monomers and polymers, synthetic fibers, synthetic rubber, and chemical fertilizers. Further, it is involved in the pipeline transportation and sale of petroleum and natural gas; production, sale, storage, and transportation of refinery, petrochemical, and coal chemical products; import and export of petroleum products, natural gas, petrochemical and chemical products, and other commodities and technologies; research, development, and application of technologies and information; production and sale of catalyst products, lubricant base oil, polyester chips and fibers, plastics, and intermediate petrochemical products; research, development, production, and sale of ethylene and downstream byproducts; provision of geophysical and drilling services, as well as well testing and measurement services; manufacturing production equipment; and coal chemical industry investment management activities. The company was founded in 2000 and is headquartered in Beijing, the People's Republic of China. China Petroleum & Chemical Corporation is a subsidiary of China Petrochemical Corporation.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100728",
        "website": "http://www.sinopec.com",
        "market_cap": 62774771712
    },
    "CHUA.F": {
        "short_name": "CHINA PETRO.+CHEM.ADR/100",
        "long_name": "China Petroleum & Chemical Corporation",
        "summary": "China Petroleum & Chemical Corporation, an energy and chemical company, engages in oil and gas, and chemical operations in the People's Republic of China. It operates through five segments: Exploration and Production, Refining, Marketing and Distribution, Chemicals, and Corporate and Others. The company explores for and develops oil fields; produces crude oil and natural gas; processes and purifies crude oil; and manufactures and sells petroleum products. It also owns and operates oil depots and service stations; and distributes and sells refined petroleum products, including gasoline and diesel through wholesale and retail sales networks. In addition, the company manufactures and sells petrochemical and derivative petrochemical products; and other chemical products, such as basic organic chemicals, synthetic resins, synthetic fiber monomers and polymers, synthetic fibers, synthetic rubber, and chemical fertilizers. Further, it is involved in the pipeline transportation and sale of petroleum and natural gas; production, sale, storage, and transportation of refinery, petrochemical, and coal chemical products; import and export of petroleum products, natural gas, petrochemical and chemical products, and other commodities and technologies; research, development, and application of technologies and information; production and sale of catalyst products, lubricant base oil, polyester chips and fibers, plastics, and intermediate petrochemical products; research, development, production, and sale of ethylene and downstream byproducts; provision of geophysical and drilling services, as well as well testing and measurement services; manufacturing production equipment; and coal chemical industry investment management activities. The company was founded in 2000 and is headquartered in Beijing, the People's Republic of China. China Petroleum & Chemical Corporation is a subsidiary of China Petrochemical Corporation.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100728",
        "website": "http://www.sinopec.com",
        "market_cap": 65569132544
    },
    "CO9.F": {
        "short_name": "CHINA OILFIELD SVCS H YC1",
        "long_name": "China Oilfield Services Limited",
        "summary": "China Oilfield Services Limited, together with its subsidiaries, provides integrated offshore oilfield services in Mainland China and internationally. The company operates through four segments: Drilling Services, Well Services, Marine Support Services, and Geophysical Acquisition and Surveying Services. The Drilling Services segment provides jack-up drilling rig, semi-submersible drilling rig, module rig, and land drilling rig services. As of December 31, 2020, it operated and managed 57 drilling rigs, which include 43 jack-up drilling rigs and 14 semi-submersible drilling rigs; and 5 module rigs. The Well Services segment offers onshore and offshore well services, including logging, drilling and completion fluids, directional drilling, cementing, well completion and workover, stimulation, etc. The Marine Support Services segment owns and operates offshore vessels that provide services for offshore oil and gas exploration, development, construction, and production. This segment also offers anchor handling for various water level, towing of drilling rigs/engineering barges, oil lifting, offshore transportation, standby, firefighting, rescue, oil spill assisting, and other marine support services. It operates and manages approximately 140 vessels, including AHTS vessels, platform supply vessels, and oilfield standby vessels. The Geophysical Acquisition and Surveying Services segment provides offshore seismic acquisition, offshore geo-surveying, seismic data processing and interpretation, and fundamental construction services. This segment owns 5 towing streamer seismic vessels, 1 professional source vessel, 2 ocean bottle cable teams, 5 integrated marine surveying vessels, and 2 support vessels. China Oilfield Services Limited also issues bonds. The company is based in Sanhe, China. China Oilfield Services Limited is a subsidiary of China National Offshore Oil Corporation.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Sanhe",
        "zipcode": "065201",
        "website": "http://www.cosl.com.cn",
        "market_cap": 6452532224
    },
    "CSUAY": {
        "short_name": "CHINA SHENHUA ENERGY COMPANY LT",
        "long_name": "China Shenhua Energy Company Limited",
        "summary": "China Shenhua Energy Company Limited and its subsidiaries engage in the production and sales of coal and power; railway, port, and shipping transportation; and coal-to-olefins businesses in the People's Republic of China and internationally. The company's Coal segment produces coal from surface and underground mines; and sells coal to power plants, metallurgical and coal chemical producers, and provincial/regional electric grid companies. As of December 31, 2020, this segment had the recoverable coal reserves of 14.42 billion tones. Its Power segment generates and sells electric power to power grid companies. This segment generates electric power through coal, thermal, wind, water, and gas. The company's Railway segment provides railway transportation services. Its Port segment offers loading, transportation, and storage services. The company's Shipping segment provides shipment transportation services. Its Coal Chemical segment produces and sells methanol; and polyethylene and polypropylene, as well as other by-products. The company was incorporated in 2004 and is based in Beijing, China. China Shenhua Energy Company Limited is a subsidiary of China Energy Investment Corporation Limited.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100011",
        "website": "http://www.csec.com",
        "market_cap": 58096963584
    },
    "CUAEF": {
        "short_name": "CHINA SHENHUA ENERGY COMPANY LT",
        "long_name": "China Shenhua Energy Company Limited",
        "summary": "China Shenhua Energy Company Limited and its subsidiaries engage in the production and sales of coal and power; railway, port, and shipping transportation; and coal-to-olefins businesses in the People's Republic of China and internationally. The company's Coal segment produces coal from surface and underground mines; and sells coal to power plants, metallurgical and coal chemical producers, and provincial/regional electric grid companies. As of December 31, 2020, this segment had the recoverable coal reserves of 14.42 billion tones. Its Power segment generates and sells electric power to power grid companies. This segment generates electric power through coal, thermal, wind, water, and gas. The company's Railway segment provides railway transportation services. Its Port segment offers loading, transportation, and storage services. The company's Shipping segment provides shipment transportation services. Its Coal Chemical segment produces and sells methanol; and polyethylene and polypropylene, as well as other by-products. The company was incorporated in 2004 and is based in Beijing, China. China Shenhua Energy Company Limited is a subsidiary of China Energy Investment Corporation Limited.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100011",
        "website": "http://www.csec.com",
        "market_cap": 60833792000
    },
    "CVV.F": {
        "short_name": "CHINA COAL ENERGY H  YC 1",
        "long_name": "China Coal Energy Company Limited",
        "summary": "China Coal Energy Company Limited primarily mines for, processes, produces, and sells coal in the People's Republic of China and internationally. It operates through Coal, Coal-Chemical, Mining Machinery, Finance, and Others segments. The company offers thermal and coking coal. It also produces and sells polyolefin, methanol, urea, and other coal chemical products, as well as coke; researches, designs, develops, manufactures, and sells coal mining machinery and equipment; and provides after-sales services. In addition, the company is involved in aluminum, electricity generation, and other manufacturing businesses. Further, it provides equipment trading agency, tendering, investment management, finance, and waste disposal services. The company was founded in 2006 and is based in Beijing, the People's Republic of China. China Coal Energy Company Limited is a subsidiary of China National Coal Group Corporation.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100120",
        "website": "http://www.chinacoalenergy.com",
        "market_cap": 11463950336
    },
    "E8F.F": {
        "short_name": "CIMC ENRIC HLDG.INC.HK-01",
        "long_name": "CIMC Enric Holdings Limited",
        "summary": "CIMC Enric Holdings Limited designs, develops, manufactures, engineers, and maintains transportation, storage, and processing equipment for the energy, chemicals, environmental, and liquid food industries worldwide. Its Clean Energy segment manufactures and operates equipment for the storage, transportation, processing, and distribution of liquefied natural gas, compressed natural gas, and liquefied petroleum gas; and offers engineering, procurement, and construction (EPC) services for the clean energy industry, as well as intelligent IOT platforms under the Anjiehui brand. It offers its products under the Enric, Sanctum, Hongtu, CIMC Tank, Cryobest, YPDI, CIMC SOE, CIMC Hydrogen Energy, and Hashenleng brands. Its Chemical and Environmental segment offers tank containers for the storage and transportation of liquefied or gasified chemicals under the CIMC Tank and Tankmiles brands; maintenance and value-added services for tank containers; and special equipment for environmental protection, as well as environmental protection, pollution treatment, and resource recycling services. Its Liquid Food segment engineers, manufactures, and sells stainless steel tanks for storage and processing liquid food; and provides EPC services for brewery and other liquid food industries under the Ziemann Holvrieka, DME, NSI, McMillan, and Briggs brands. The company also manufactures compressors and accessories, and pressure vessels; offers business solutions for gas equipment; researches and develops technology for natural gas equipment; cryogenic storage and transportation equipment design, manufacture, and technical services; collects, processes, and sells renewable resources; offers terminal and depot, and nonmetallic scrap processing services; and repairs and maintains pressure vessels. The company was incorporated in 2004 and is headquartered in Shenzhen, the People's Republic of China. The company is a subsidiary of China International Marine Containers (Hong Kong) Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518067",
        "website": "http://www.enricgroup.com",
        "market_cap": 1629808000
    },
    "GSG.F": {
        "short_name": "SHENGLI O.+G.H.REGS HD-10",
        "long_name": "Shengli Oil & Gas Pipe Holdings Limited",
        "summary": "Shengli Oil & Gas Pipe Holdings Limited, an investment holding company, designs, processes, manufactures, and sells welded pipes for oil and gas pipeline, and other construction and manufacturing applications in Mainland China and Hong Kong. The company operates through two segments, Pipes Business and Trading Business. It produces submerged-arc helical and longitudinal welded pipes that are primarily used to transport crude oil, refined petroleum products, natural gas, and other related products, as well as used for the oil and infrastructure industry. The company also engages in the provision of anti-corrosion services for oil and gas pipelines, and other construction and manufacturing applications; trading of environmental energy equipment, fuel oil and chemical products, and commodities; and provision of new energy technical development services. In addition, it offers anti-corrosion technical and rental services; and trades in rolled coils. Shengli Oil & Gas Pipe Holdings Limited was founded in 1972 and is headquartered in Zibo, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Zibo",
        "zipcode": "255082",
        "website": "http://www.slogp.com",
        "market_cap": 74404656
    },
    "HRC1.F": {
        "short_name": "RECON TECHNOLOGY  DL -,01",
        "long_name": "Recon Technology, Ltd.",
        "summary": "Recon Technology, Ltd. provides hardware, software, and on-site services to companies in the petroleum mining and extraction industry in the People's Republic of China. The company offers equipment, tools, and other hardware related to oilfield production and management, and transportation; and develops and sells industrial automation control and information solutions. It also provides equipment for oil and gas production and transportation, including heating furnaces and burner, as well as enhancing techniques comprising packers of fracturing; production packers; sand prevention in oil and water wells; water locating and plugging techniques; fissure shaper; fracture acidizing technique; and electronic broken-down service to resolve block-up and freezing problems. In addition, the company offers automation systems and services, including pumping unit controller that monitors the pumping units and collects data; RTU to monitor natural gas wells and collect gas well pressure data; wireless dynamometers and wireless pressure gauges; electric multi-way valves for oilfield metering station flow control; and natural gas flow computer systems. Further, it provides Recon SCADA oilfield monitor and data acquisition system for supervision and data collection; EPC service of pipeline SCADA system for pipeline monitoring and data acquisition; EPC service of oil and gas wells SCADA system for monitoring and data acquisition of oil wells and natural gas wells; EPC service of oilfield video surveillance and control system to control the oil and gas wellhead and measurement station areas; and technique service for digital oilfield transformation. Additionally, the company offers oilfield waste water treatment solutions and related chemicals; and oily sludge disposal solutions. Recon Technology, Ltd. was incorporated in 2007 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100012",
        "website": "http://www.recon.cn",
        "market_cap": 225320656
    },
    "I8O.F": {
        "short_name": "JUTAL OFF.OIL SRVCS HD-01",
        "long_name": "Jutal Offshore Oil Services Limited",
        "summary": "Jutal Offshore Oil Services Limited, an investment holding company, engages in the fabrication of facilities, and provision of integrated services for oil and gas industries, new energy, and refining and chemical industries. The company offers offshore engineering and modular construction services, including construction of large-scale modules, such as onshore LNG modules, modular plants, upper modules of offshore platforms, and FPSO/FLNG modules; petrochemical and shipbuilding services comprising projects in oil and gas process modules, petrochemical equipment and undersea business, and EPC contracting services; and technical support services for shipbuilding industry, as well as ship repair and construction services. It also provides oil and gas treatment technical services, which include treatment technology and solutions in natural gas purification and treatment, oil production water treatment, and sludge purification; and new energy equipment construction services, such as services for the development and utilization of new energy, as well as undertakes construction of crane products. It operates in the People's Republic of China, the United States, Switzerland, Norway, Singapore, Japan, France, the United Kingdom, the Netherlands, and internationally. Jutal Offshore Oil Services Limited was founded in 1995 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518068",
        "website": "http://www.jutal.com",
        "market_cap": 264098592
    },
    "IKF.F": {
        "short_name": "CHINA SHENHUA EN. H  YC 1",
        "long_name": "China Shenhua Energy Company Limited",
        "summary": "China Shenhua Energy Company Limited and its subsidiaries engage in the production and sales of coal and power; railway, port, and shipping transportation; and coal-to-olefins businesses in the People's Republic of China and internationally. The company's Coal segment produces coal from surface and underground mines; and sells coal to power plants, metallurgical and coal chemical producers, and provincial/regional electric grid companies. As of December 31, 2020, this segment had the recoverable coal reserves of 14.42 billion tones. Its Power segment generates and sells electric power to power grid companies. This segment generates electric power through coal, thermal, wind, water, and gas. The company's Railway segment provides railway transportation services. Its Port segment offers loading, transportation, and storage services. The company's Shipping segment provides shipment transportation services. Its Coal Chemical segment produces and sells methanol; and polyethylene and polypropylene, as well as other by-products. The company was incorporated in 2004 and is based in Beijing, China. China Shenhua Energy Company Limited is a subsidiary of China Energy Investment Corporation Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100011",
        "website": "http://www.csec.com",
        "market_cap": 48948727808
    },
    "IKFC.F": {
        "short_name": "CHINA SHENHUA EN.A  ADR/4",
        "long_name": "China Shenhua Energy Company Limited",
        "summary": "China Shenhua Energy Company Limited and its subsidiaries engage in the production and sales of coal and power; railway, port, and shipping transportation; and coal-to-olefins businesses in the People's Republic of China and internationally. The company's Coal segment produces coal from surface and underground mines; and sells coal to power plants, metallurgical and coal chemical producers, and provincial/regional electric grid companies. As of December 31, 2020, this segment had the recoverable coal reserves of 14.42 billion tones. Its Power segment generates and sells electric power to power grid companies. This segment generates electric power through coal, thermal, wind, water, and gas. The company's Railway segment provides railway transportation services. Its Port segment offers loading, transportation, and storage services. The company's Shipping segment provides shipment transportation services. Its Coal Chemical segment produces and sells methanol; and polyethylene and polypropylene, as well as other by-products. The company was incorporated in 2004 and is based in Beijing, China. China Shenhua Energy Company Limited is a subsidiary of China Energy Investment Corporation Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100011",
        "website": "http://www.csec.com",
        "market_cap": 50032865280
    },
    "K3OD.SI": {
        "short_name": "u PTR ADR US$",
        "long_name": "PetroChina Company Limited",
        "summary": "PetroChina Company Limited, together with its subsidiaries, engages in a range of petroleum related products, services, and activities in Mainland China and internationally. It operates through Exploration and Production, Refining and Chemicals, Marketing, and Natural Gas and Pipeline segments. The Exploration and Production segment engages in the exploration, development, production, and marketing of crude oil and natural gas. The Refining and Chemicals segment refines crude oil and petroleum products; and produces and markets primary petrochemical products, derivative petrochemical products, and other chemical products. The Marketing segment is involved in marketing of refined products and trading business. The Natural Gas and Pipeline segment engages in the transmission of natural gas, crude oil, and refined products; and sale of natural gas. As of December 31, 2020, the company had a total length of 31,151 km, including 22,555 km of natural gas pipelines, 7,190 km of crude oil pipelines, and 1,406 km of refined product pipelines. The company is also involved in the exploration, development, and production of oil sands and coalbed methane; trading of crude oil and petrochemical products; storage, chemical engineering, storage facilities, service station, and transportation facilities and related businesses; and production and sales of basic and derivative chemical, and other chemical products. The company was founded in 1999 and is headquartered in Beijing, the People's Republic of China. PetroChina Company Limited is a subsidiary of China National Petroleum Corporation.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100007",
        "website": "http://www.petrochina.com.cn",
        "market_cap": 133576663040
    },
    "KEH.F": {
        "short_name": "CHINESE.PEOP.HLDGS HD-,07",
        "long_name": "Chinese People Holdings Company Limited",
        "summary": "Chinese People Holdings Company Limited, an investment holding company, sells and distributes gas fuel in the People's Republic of China. The company operates through Provision of Piped Gas; Sale and Distribution of Cylinder Gas; and FMCG and Food Ingredients segments. It is involved in the sale of piped gas and construction of gas pipeline networks under gas connection contracts; sale and distribution of gas using tank containers to end-user households, and industrial and commercial customers; and retail and wholesale of merchandise, including rice, meat, and fresh food, as well as FMCG and barreled drinking water through supermarkets and convenience stores. The company was formerly known as Chinese People Gas Holdings Company Limited and changed its name to Chinese People Holdings Company Limited in 2007. Chinese People Holdings Company Limited is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100176",
        "website": "http://www.681hk.com",
        "market_cap": 51526648
    },
    "LNDT": {
        "short_name": "LIANDI CLEAN TECHNOLOGY INC",
        "long_name": "LianDi Clean Technology, Inc.",
        "summary": "LianDi Clean Technology, Inc., through its subsidiaries, distributes petroleum and petrochemical valves, equipment, and related services in the People's Republic of China. The company distributes unheading units for the delayed coking process; and offers systems integration, and related technical and engineering services to petroleum and petrochemical companies and other energy companies. It also develops and markets optimization software for data collection, performance analysis, and process optimization in the polymerization reaction of ethylene production. In addition, the company is involved in development, manufacture, and sale of organic and inorganic chemical products, and high polymer fine chemical products; provision of chemical professional services and oil tank sludge cleaning services; and recycle and sale of discarded or used packing products. LianDi Clean Technology, Inc. was founded in 2004 and is based in Beijing, the People's Republic of China. As of June 29, 2015, LianDi Clean Technology, Inc. operates as a subsidiary of Smart Specialists Limited.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100089",
        "website": "http://www.china-liandi.com",
        "market_cap": 2154677
    },
    "PC6.F": {
        "short_name": "PETROCHINA CO. LTD H YC 1",
        "long_name": "PetroChina Company Limited",
        "summary": "PetroChina Company Limited, together with its subsidiaries, engages in a range of petroleum related products, services, and activities in Mainland China and internationally. It operates through Exploration and Production, Refining and Chemicals, Marketing, and Natural Gas and Pipeline segments. The Exploration and Production segment engages in the exploration, development, production, and marketing of crude oil and natural gas. The Refining and Chemicals segment refines crude oil and petroleum products; and produces and markets primary petrochemical products, derivative petrochemical products, and other chemical products. The Marketing segment is involved in marketing of refined products and trading business. The Natural Gas and Pipeline segment engages in the transmission of natural gas, crude oil, and refined products; and sale of natural gas. As of December 31, 2020, the company had a total length of 31,151 km, including 22,555 km of natural gas pipelines, 7,190 km of crude oil pipelines, and 1,406 km of refined product pipelines. The company is also involved in the exploration, development, and production of oil sands and coalbed methane; trading of crude oil and petrochemical products; storage, chemical engineering, storage facilities, service station, and transportation facilities and related businesses; and production and sales of basic and derivative chemical, and other chemical products. The company was founded in 1999 and is headquartered in Beijing, the People's Republic of China. PetroChina Company Limited is a subsidiary of China National Petroleum Corporation.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100007",
        "website": "http://www.petrochina.com.cn",
        "market_cap": 114031411200
    },
    "PC6A.F": {
        "short_name": "PETROCHINA YC1 ADR/100",
        "long_name": "PetroChina Company Limited",
        "summary": "PetroChina Company Limited, together with its subsidiaries, engages in a range of petroleum related products, services, and activities in Mainland China and internationally. It operates through Exploration and Production, Refining and Chemicals, Marketing, and Natural Gas and Pipeline segments. The Exploration and Production segment engages in the exploration, development, production, and marketing of crude oil and natural gas. The Refining and Chemicals segment refines crude oil and petroleum products; and produces and markets primary petrochemical products, derivative petrochemical products, and other chemical products. The Marketing segment is involved in marketing of refined products and trading business. The Natural Gas and Pipeline segment engages in the transmission of natural gas, crude oil, and refined products; and sale of natural gas. As of December 31, 2020, the company had a total length of 31,151 km, including 22,555 km of natural gas pipelines, 7,190 km of crude oil pipelines, and 1,406 km of refined product pipelines. The company is also involved in the exploration, development, and production of oil sands and coalbed methane; trading of crude oil and petrochemical products; storage, chemical engineering, storage facilities, service station, and transportation facilities and related businesses; and production and sales of basic and derivative chemical, and other chemical products. The company was founded in 1999 and is headquartered in Beijing, the People's Republic of China. PetroChina Company Limited is a subsidiary of China National Petroleum Corporation.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100007",
        "website": "http://www.petrochina.com.cn",
        "market_cap": 108099035136
    },
    "PCCYF": {
        "short_name": "PETROCHINA CO",
        "long_name": "PetroChina Company Limited",
        "summary": "PetroChina Company Limited, together with its subsidiaries, engages in a range of petroleum related products, services, and activities in Mainland China and internationally. It operates through Exploration and Production, Refining and Chemicals, Marketing, and Natural Gas and Pipeline segments. The Exploration and Production segment engages in the exploration, development, production, and marketing of crude oil and natural gas. The Refining and Chemicals segment refines crude oil and petroleum products; and produces and markets primary petrochemical products, derivative petrochemical products, and other chemical products. The Marketing segment is involved in marketing of refined products and trading business. The Natural Gas and Pipeline segment engages in the transmission of natural gas, crude oil, and refined products; and sale of natural gas. As of December 31, 2020, the company had a total length of 31,151 km, including 22,555 km of natural gas pipelines, 7,190 km of crude oil pipelines, and 1,406 km of refined product pipelines. The company is also involved in the exploration, development, and production of oil sands and coalbed methane; trading of crude oil and petrochemical products; storage, chemical engineering, storage facilities, service station, and transportation facilities and related businesses; and production and sales of basic and derivative chemical, and other chemical products. The company was founded in 1999 and is headquartered in Beijing, the People's Republic of China. PetroChina Company Limited is a subsidiary of China National Petroleum Corporation.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100007",
        "website": "http://www.petrochina.com.cn",
        "market_cap": 127143641088
    },
    "PTR.BA": {
        "short_name": "PETROCHINA CO",
        "long_name": "PetroChina Company Limited",
        "summary": "PetroChina Company Limited, together with its subsidiaries, engages in a range of petroleum related products, services, and activities in Mainland China and internationally. It operates through Exploration and Production, Refining and Chemicals, Marketing, and Natural Gas and Pipeline segments. The Exploration and Production segment engages in the exploration, development, production, and marketing of crude oil and natural gas. The Refining and Chemicals segment refines crude oil and petroleum products; and produces and markets primary petrochemical products, derivative petrochemical products, and other chemical products. The Marketing segment is involved in marketing of refined products and trading business. The Natural Gas and Pipeline segment engages in the transmission of natural gas, crude oil, and refined products; and sale of natural gas. As of December 31, 2020, the company had a total length of 31,151 km, including 22,555 km of natural gas pipelines, 7,190 km of crude oil pipelines, and 1,406 km of refined product pipelines. The company is also involved in the exploration, development, and production of oil sands and coalbed methane; trading of crude oil and petrochemical products; storage, chemical engineering, storage facilities, service station, and transportation facilities and related businesses; and production and sales of basic and derivative chemical, and other chemical products. The company was founded in 1999 and is headquartered in Beijing, the People's Republic of China. PetroChina Company Limited is a subsidiary of China National Petroleum Corporation.",
        "currency": "ARS",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100007",
        "website": "http://www.petrochina.com.cn",
        "market_cap": 13370459684864
    },
    "PTR": {
        "short_name": "PetroChina Company Limited",
        "long_name": "PetroChina Company Limited",
        "summary": "PetroChina Company Limited, together with its subsidiaries, engages in a range of petroleum related products, services, and activities in Mainland China and internationally. It operates through Exploration and Production, Refining and Chemicals, Marketing, and Natural Gas and Pipeline segments. The Exploration and Production segment engages in the exploration, development, production, and marketing of crude oil and natural gas. The Refining and Chemicals segment refines crude oil and petroleum products; and produces and markets primary petrochemical products, derivative petrochemical products, and other chemical products. The Marketing segment is involved in marketing of refined products and trading business. The Natural Gas and Pipeline segment engages in the transmission of natural gas, crude oil, and refined products; and sale of natural gas. As of December 31, 2020, the company had a total length of 31,151 km, including 22,555 km of natural gas pipelines, 7,190 km of crude oil pipelines, and 1,406 km of refined product pipelines. The company is also involved in the exploration, development, and production of oil sands and coalbed methane; trading of crude oil and petrochemical products; storage, chemical engineering, storage facilities, service station, and transportation facilities and related businesses; and production and sales of basic and derivative chemical, and other chemical products. The company was founded in 1999 and is headquartered in Beijing, the People's Republic of China. PetroChina Company Limited is a subsidiary of China National Petroleum Corporation.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100007",
        "website": "http://www.petrochina.com.cn",
        "market_cap": 123236982784
    },
    "PTRN.MX": {
        "short_name": "PETROCHINA CO",
        "long_name": "PetroChina Company Limited",
        "summary": "PetroChina Company Limited, together with its subsidiaries, engages in a range of petroleum related products, services, and activities in Mainland China and internationally. It operates through Exploration and Production, Refining and Chemicals, Marketing, and Natural Gas and Pipeline segments. The Exploration and Production segment engages in the exploration, development, production, and marketing of crude oil and natural gas. The Refining and Chemicals segment refines crude oil and petroleum products; and produces and markets primary petrochemical products, derivative petrochemical products, and other chemical products. The Marketing segment is involved in marketing of refined products and trading business. The Natural Gas and Pipeline segment engages in the transmission of natural gas, crude oil, and refined products; and sale of natural gas. As of December 31, 2020, the company had a total length of 31,151 km, including 22,555 km of natural gas pipelines, 7,190 km of crude oil pipelines, and 1,406 km of refined product pipelines. The company is also involved in the exploration, development, and production of oil sands and coalbed methane; trading of crude oil and petrochemical products; storage, chemical engineering, storage facilities, service station, and transportation facilities and related businesses; and production and sales of basic and derivative chemical, and other chemical products. The company was founded in 1999 and is headquartered in Beijing, the People's Republic of China. PetroChina Company Limited is a subsidiary of China National Petroleum Corporation.",
        "currency": "MXN",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100007",
        "website": "http://www.petrochina.com.cn",
        "market_cap": 2712491524096
    },
    "PXI.F": {
        "short_name": "SHANDONG MOLONG PETR. H",
        "long_name": "Shandong Molong Petroleum Machinery Company Limited",
        "summary": "Shandong Molong Petroleum Machinery Company Limited engages in the research and development, production, and sale of products for the energy equipment industry in the People's Republic of China. The company operates through Pipe Products, Three Kinds of Pumping Units, Petroleum Machinery Parts, Tube Blank, and Others segments. It offers pipes for petroleum and gas extraction, fluid and structural pipes, petroleum pumping machines, petroleum pumps, petroleum pumping rods, cylinder liners for drilling rigs, valve parts, and casting and forging solutions . The company's products also include API and non API casing products, line pipe products, precision steel pipes, hydraulic prop tubes, fluid pipes, cylinder tubes, and boiler tubes; sucker rods; valve body, cylinder liners, gate valves, and billet products. Its products are used in petroleum, natural gas, coalbed methane, shale gas and other energy drilling, machinery processing, urban pipe network, etc. In addition, the company engages in the research of new materials for energy equipment; production and sale of metal casting and forging; sea water desalination activities; waste heat and gas power generation activities; and manufacture and sale of special oil metal materials. It also exports its energy equipment. Shandong Molong Petroleum Machinery Company Limited was founded in 2001 and is based in Shouguang City, China.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shouguang",
        "zipcode": "262700",
        "website": "http://www.molonggroup.com",
        "market_cap": 662010624
    },
    "RCON": {
        "short_name": "Recon Technology, Ltd.",
        "long_name": "Recon Technology, Ltd.",
        "summary": "Recon Technology, Ltd. provides hardware, software, and on-site services to companies in the petroleum mining and extraction industry in the People's Republic of China. The company offers equipment, tools, and other hardware related to oilfield production and management, and transportation; and develops and sells industrial automation control and information solutions. It also provides equipment for oil and gas production and transportation, including heating furnaces and burner, as well as enhancing techniques comprising packers of fracturing; production packers; sand prevention in oil and water wells; water locating and plugging techniques; fissure shaper; fracture acidizing technique; and electronic broken-down service to resolve block-up and freezing problems. In addition, the company offers automation systems and services, including pumping unit controller that monitors the pumping units and collects data; RTU to monitor natural gas wells and collect gas well pressure data; wireless dynamometers and wireless pressure gauges; electric multi-way valves for oilfield metering station flow control; and natural gas flow computer systems. Further, it provides Recon SCADA oilfield monitor and data acquisition system for supervision and data collection; EPC service of pipeline SCADA system for pipeline monitoring and data acquisition; EPC service of oil and gas wells SCADA system for monitoring and data acquisition of oil wells and natural gas wells; EPC service of oilfield video surveillance and control system to control the oil and gas wellhead and measurement station areas; and technique service for digital oilfield transformation. Additionally, the company offers oilfield waste water treatment solutions and related chemicals; and oily sludge disposal solutions. Recon Technology, Ltd. was incorporated in 2007 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100012",
        "website": "http://www.recon.cn",
        "market_cap": 146662880
    },
    "S8SA.F": {
        "short_name": "JINTAI EN.HLDGS HD,-00125",
        "long_name": "Jintai Energy Holdings Limited",
        "summary": "Jintai Energy Holdings Limited, an investment holding company, engages in energy trading business primarily in the People's Republic of China. Its energy trading activities primarily comprise trading of fuel oil, kerosene, and chemical products. The company is also involved in the manufacture and trading of speakers; asset management businesses; and operation of an oil trade center. In addition, it provides oil and gas development engineering construction, and technical services, including geochemical exploration, drilled wells, test logging, downhole special operation, engineering building design, and construction services, as well as related oil and gas development technology research and development, and services. The company was formerly known as Yuhua Energy Holdings Limited and changed its name to Jintai Energy Holdings Limited in February 2020. Jintai Energy Holdings Limited was founded in 1990 and is headquartered in Dongying, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Dongying",
        "zipcode": null,
        "website": "http://www.jintaienergy.com",
        "market_cap": 59473800
    },
    "SEI.F": {
        "short_name": "SPT ENERGY GR.INC.DL-0001",
        "long_name": "SPT Energy Group Inc.",
        "summary": "SPT Energy Group Inc., an investment holding company, provides integrated oilfield services and manufactures oilfield services related products in the People's Republic of China, Kazakhstan, Turkmenistan, the Middle East, Canada, Indonesia, and internationally. It operates through three segments: Drilling, Well Completion, and Reservoir. The company offers drilling services, including drilling rig, workover rig, complex well workover and fishing, rotary geological steering, vertical and horizontal drilling technologies, side tracking and underbalanced drilling technologies, fine managed pressure drilling technology, cementing, and drilling fluid services. It also provides well completion services, such as well completion tools and project design services, as well as stimulation and fracturing services. In addition, the company offers geology research and oil reservoir research, dynamic monitoring, oil testing and recovery, and oil extraction process services, as well as coiled tubing and repair service of surface production devices. Further, it is also involved in manufacturing and trading activities; and promotion of technology and application services. SPT Energy Group Inc. was founded in 1993 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100012",
        "website": "http://www.sptenergygroup.com",
        "market_cap": 56446104
    },
    "SGJH.F": {
        "short_name": "SINOPEC SHANGHAI H  YC 1",
        "long_name": "Sinopec Shanghai Petrochemical Company Limited",
        "summary": "Sinopec Shanghai Petrochemical Company Limited, together with its subsidiaries, manufactures and sells petrochemical products in the People's Republic of China. It operates through five segments: Synthetic Fibers, Resins and Plastics, Intermediate Petrochemicals, Petroleum Products, and Trading of Petrochemical Products. The Synthetic Fibers segment produces polyesters, acrylic fibers, and carbon fibers that are primarily used in the textile and apparel industries. The Resins and Plastics segment produces polyester chips that are used to produce polyester fibers, coating, and containers; polyethylene resins and plastics, which are used to produce insulated cables and mulching films, as well as molded products, such as housewares and toys; and polypropylene resins that are used for films and sheets, as well as molded products, such as housewares, toys, consumer electronics, and automobile parts; and PVA granules. The Intermediate Petrochemicals segment produces p-xylene, benzene, and ethylene oxide, which are used as raw materials in the production of other petrochemicals, resins, plastics, and synthetic fibers. The Petroleum Products segment operates crude oil refinery facilities used to produce refined gasoline, fuel, diesel oil, heavy oil, and liquefied petroleum gas. The Trading of Petrochemical Products segment is involved in the import and export of petrochemical products. The company was founded in 1972 and is based in Shanghai, the People's Republic of China. Sinopec Shanghai Petrochemical Company Limited is a subsidiary of China Petroleum & Chemical Corporation.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200540",
        "website": "http://www.spc.com.cn",
        "market_cap": 4340117504
    },
    "SHANF": {
        "short_name": "SHANDONG MOLONG PETROLEUM MACHI",
        "long_name": "Shandong Molong Petroleum Machinery Company Limited",
        "summary": "Shandong Molong Petroleum Machinery Company Limited engages in the research and development, production, and sale of products for the energy equipment industry in the People's Republic of China. The company operates through Pipe Products, Three Kinds of Pumping Units, Petroleum Machinery Parts, Tube Blank, and Others segments. It offers pipes for petroleum and gas extraction, fluid and structural pipes, petroleum pumping machines, petroleum pumps, petroleum pumping rods, cylinder liners for drilling rigs, valve parts, and casting and forging solutions . The company's products also include API and non API casing products, line pipe products, precision steel pipes, hydraulic prop tubes, fluid pipes, cylinder tubes, and boiler tubes; sucker rods; valve body, cylinder liners, gate valves, and billet products. Its products are used in petroleum, natural gas, coalbed methane, shale gas and other energy drilling, machinery processing, urban pipe network, etc. In addition, the company engages in the research of new materials for energy equipment; production and sale of metal casting and forging; sea water desalination activities; waste heat and gas power generation activities; and manufacture and sale of special oil metal materials. It also exports its energy equipment. Shandong Molong Petroleum Machinery Company Limited was founded in 2001 and is based in Shouguang City, China.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shouguang",
        "zipcode": "262700",
        "website": "http://www.molonggroup.com",
        "market_cap": 803077888
    },
    "SHI.F": {
        "short_name": "SINOPEC SHAN H YC1ADR/100",
        "long_name": "Sinopec Shanghai Petrochemical Company Limited",
        "summary": "Sinopec Shanghai Petrochemical Company Limited, together with its subsidiaries, manufactures and sells petrochemical products in the People's Republic of China. It operates through five segments: Synthetic Fibers, Resins and Plastics, Intermediate Petrochemicals, Petroleum Products, and Trading of Petrochemical Products. The Synthetic Fibers segment produces polyesters, acrylic fibers, and carbon fibers that are primarily used in the textile and apparel industries. The Resins and Plastics segment produces polyester chips that are used to produce polyester fibers, coating, and containers; polyethylene resins and plastics, which are used to produce insulated cables and mulching films, as well as molded products, such as housewares and toys; and polypropylene resins that are used for films and sheets, as well as molded products, such as housewares, toys, consumer electronics, and automobile parts; and PVA granules. The Intermediate Petrochemicals segment produces p-xylene, benzene, and ethylene oxide, which are used as raw materials in the production of other petrochemicals, resins, plastics, and synthetic fibers. The Petroleum Products segment operates crude oil refinery facilities used to produce refined gasoline, fuel, diesel oil, heavy oil, and liquefied petroleum gas. The Trading of Petrochemical Products segment is involved in the import and export of petrochemical products. The company was founded in 1972 and is based in Shanghai, the People's Republic of China. Sinopec Shanghai Petrochemical Company Limited is a subsidiary of China Petroleum & Chemical Corporation.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200540",
        "website": "http://www.spc.com.cn",
        "market_cap": 4203522048
    },
    "SHI": {
        "short_name": "SINOPEC Shangai Petrochemical C",
        "long_name": "Sinopec Shanghai Petrochemical Company Limited",
        "summary": "Sinopec Shanghai Petrochemical Company Limited, together with its subsidiaries, manufactures and sells petrochemical products in the People's Republic of China. It operates through five segments: Synthetic Fibres, Resins and Plastics, Intermediate Petrochemical Products, Petroleum Products, and Trading of Petrochemical Products. The Synthetic Fibres segment produces polyesters, acrylic fibers, and carbon fibers that are primarily used in the textile and apparel industries. The Resins and Plastics segment produces polyester chips that are used to produce polyester fibers, coating, and containers; polyethylene resins and plastics, which are used to produce insulated cables and mulching films, as well as molded products, such as housewares and toys; and polypropylene resins that are used for films and sheets, as well as molded products, such as housewares, toys, consumer electronics, and automobile parts; and PVA granules. The Intermediate Petrochemical Products segment produces p-xylene, benzene, and ethylene oxide, which are used as raw materials in the production of other petrochemicals, resins, plastics, and synthetic fibers. The Petroleum Products segment operates crude oil distillation facilities that produce vacuum and atmospheric gas oils used as feedstock; and residual oil and low octane gasoline fuels, as well as produces various fuels, such as diesel oil, jet fuel, heavy oil, and liquefied petroleum gas for transportation, industry, and household heating applications. The Trading of Petrochemical Products segment is involved in the import and export of petrochemical products. The company was founded in 1972 and is based in Shanghai, the People's Republic of China. Sinopec Shanghai Petrochemical Company Limited is a subsidiary of China Petroleum & Chemical Corporation.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200540",
        "website": "http://www.spc.com.cn",
        "market_cap": 5096456704
    },
    "SNP.BA": {
        "short_name": "CHINA PETROLEUM &",
        "long_name": "China Petroleum & Chemical Corporation",
        "summary": "China Petroleum & Chemical Corporation, an energy and chemical company, engages in oil and gas, and chemical operations in the People's Republic of China. It operates through five segments: Exploration and Production, Refining, Marketing and Distribution, Chemicals, and Corporate and Others. The company explores for and develops oil fields; produces crude oil and natural gas; processes and purifies crude oil; and manufactures and sells petroleum products. It also owns and operates oil depots and service stations; and distributes and sells refined petroleum products, including gasoline and diesel through wholesale and retail sales networks. In addition, the company manufactures and sells petrochemical and derivative petrochemical products; and other chemical products, such as basic organic chemicals, synthetic resins, synthetic fiber monomers and polymers, synthetic fibers, synthetic rubber, and chemical fertilizers. Further, it is involved in the pipeline transportation and sale of petroleum and natural gas; production, sale, storage, and transportation of refinery, petrochemical, and coal chemical products; import and export of petroleum products, natural gas, petrochemical and chemical products, and other commodities and technologies; research, development, and application of technologies and information; production and sale of catalyst products, lubricant base oil, polyester chips and fibers, plastics, and intermediate petrochemical products; research, development, production, and sale of ethylene and downstream byproducts; provision of geophysical and drilling services, as well as well testing and measurement services; manufacturing production equipment; and coal chemical industry investment management activities. The company was founded in 2000 and is headquartered in Beijing, the People's Republic of China. China Petroleum & Chemical Corporation is a subsidiary of China Petrochemical Corporation.",
        "currency": "ARS",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100728",
        "website": "http://www.sinopec.com",
        "market_cap": 62711937368064
    },
    "SNP": {
        "short_name": "China Petroleum & Chemical Corp",
        "long_name": "China Petroleum & Chemical Corporation",
        "summary": "China Petroleum & Chemical Corporation, an energy and chemical company, engages in oil and gas, and chemical operations in the People's Republic of China. It operates through five segments: Exploration and Production, Refining, Marketing and Distribution, Chemicals, and Corporate and Others. The company explores for and develops oil fields; produces crude oil and natural gas; processes and purifies crude oil; and manufactures and sells petroleum products. It also owns and operates oil depots and service stations; and distributes and sells refined petroleum products, including gasoline and diesel through wholesale and retail sales networks. In addition, the company manufactures and sells petrochemical and derivative petrochemical products; and other chemical products, such as basic organic chemicals, synthetic resins, synthetic fiber monomers and polymers, synthetic fibers, synthetic rubber, and chemical fertilizers. Further, it is involved in the pipeline transportation and sale of petroleum and natural gas; production, sale, storage, and transportation of refinery, petrochemical, and coal chemical products; import and export of petroleum products, natural gas, petrochemical and chemical products, and other commodities and technologies; research, development, and application of technologies and information; production and sale of catalyst products, lubricant base oil, polyester chips and fibers, plastics, and intermediate petrochemical products; research, development, production, and sale of ethylene and downstream byproducts; provision of geophysical and drilling services, as well as well testing and measurement services; manufacturing production equipment; and coal chemical industry investment management activities. The company was founded in 2000 and is headquartered in Beijing, the People's Republic of China. China Petroleum & Chemical Corporation is a subsidiary of China Petrochemical Corporation.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100728",
        "website": "http://www.sinopec.com",
        "market_cap": 78695071744
    },
    "SNPMF": {
        "short_name": "CHINA PETROLEUM & CHEMICAL CORP",
        "long_name": "China Petroleum & Chemical Corporation",
        "summary": "China Petroleum & Chemical Corporation, an energy and chemical company, engages in oil and gas, and chemical operations in the People's Republic of China. It operates through five segments: Exploration and Production, Refining, Marketing and Distribution, Chemicals, and Corporate and Others. The company explores for and develops oil fields; produces crude oil and natural gas; processes and purifies crude oil; and manufactures and sells petroleum products. It also owns and operates oil depots and service stations; and distributes and sells refined petroleum products, including gasoline and diesel through wholesale and retail sales networks. In addition, the company manufactures and sells petrochemical and derivative petrochemical products; and other chemical products, such as basic organic chemicals, synthetic resins, synthetic fiber monomers and polymers, synthetic fibers, synthetic rubber, and chemical fertilizers. Further, it is involved in the pipeline transportation and sale of petroleum and natural gas; production, sale, storage, and transportation of refinery, petrochemical, and coal chemical products; import and export of petroleum products, natural gas, petrochemical and chemical products, and other commodities and technologies; research, development, and application of technologies and information; production and sale of catalyst products, lubricant base oil, polyester chips and fibers, plastics, and intermediate petrochemical products; research, development, production, and sale of ethylene and downstream byproducts; provision of geophysical and drilling services, as well as well testing and measurement services; manufacturing production equipment; and coal chemical industry investment management activities. The company was founded in 2000 and is headquartered in Beijing, the People's Republic of China. China Petroleum & Chemical Corporation is a subsidiary of China Petrochemical Corporation.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100728",
        "website": "http://www.sinopec.com",
        "market_cap": 77652369408
    },
    "SNPN.MX": {
        "short_name": "CHINA PETROLEUM & CHEMICAL CORP",
        "long_name": "China Petroleum & Chemical Corporation",
        "summary": "China Petroleum & Chemical Corporation, an energy and chemical company, engages in oil and gas, and chemical operations in the People's Republic of China. It operates through five segments: Exploration and Production, Refining, Marketing and Distribution, Chemicals, and Corporate and Others. The company explores for and develops oil fields; produces crude oil and natural gas; processes and purifies crude oil; and manufactures and sells petroleum products. It also owns and operates oil depots and service stations; and distributes and sells refined petroleum products, including gasoline and diesel through wholesale and retail sales networks. In addition, the company manufactures and sells petrochemical and derivative petrochemical products; and other chemical products, such as basic organic chemicals, synthetic resins, synthetic fiber monomers and polymers, synthetic fibers, synthetic rubber, and chemical fertilizers. Further, it is involved in the pipeline transportation and sale of petroleum and natural gas; production, sale, storage, and transportation of refinery, petrochemical, and coal chemical products; import and export of petroleum products, natural gas, petrochemical and chemical products, and other commodities and technologies; research, development, and application of technologies and information; production and sale of catalyst products, lubricant base oil, polyester chips and fibers, plastics, and intermediate petrochemical products; research, development, production, and sale of ethylene and downstream byproducts; provision of geophysical and drilling services, as well as well testing and measurement services; manufacturing production equipment; and coal chemical industry investment management activities. The company was founded in 2000 and is headquartered in Beijing, the People's Republic of China. China Petroleum & Chemical Corporation is a subsidiary of China Petrochemical Corporation.",
        "currency": "MXN",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100728",
        "website": "http://www.sinopec.com",
        "market_cap": 1632981876736
    },
    "WWY1.SG": {
        "short_name": "E-Commodities Holdings Ltd. Reg",
        "long_name": "E-Commodities Holdings Limited",
        "summary": "E-Commodities Holdings Limited, together with its subsidiaries, processes and trades in coal and other products. It operates in two segments, Processing and Trading of Coal and Other Products, and Logistics Services. The company also provides supply chain trading and logistics, as well as raw materials processing and washing services. In addition, it operates Yee Link, a platform specializing in intelligent logistic of bulk commodities; E-Coking Coal platform for coking coal supply chain; and E-Petrochem platform. E-Commodities Holdings Limited serves steel mills in the People's Republic of China, Turkey, India, Poland, Brazil, Mongolia, South Korea, the United States, Indonesia, Japan, and internationally. The company was formerly known as Winsway Enterprises Holdings Limited and changed its name to E-Commodities Holdings Limited in August 2016. E-Commodities Holdings Limited was founded in 2007 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "STU",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100020",
        "website": "http://www.e-comm.com/tc/home.aspx",
        "market_cap": 129306752
    },
    "YIZH.F": {
        "short_name": "SINOPEC OILF. SERV. YC 1",
        "long_name": "Sinopec Oilfield Service Corporation",
        "summary": "Sinopec Oilfield Service Corporation provides petroleum engineering and technical services in the People's Republic of China, the Middle East, and internationally. It operates through five segments: Geophysics, Drilling Engineering, Logging and Mud Logging, Special Down-Hole Operations, and Engineering Construction. The Geophysics segment offers terrestrial and marine geophysical exploration, development, and technical services. The Drilling Engineering segment provides land and ocean drilling design, construction, and technical services, as well as drilling instrumentation. The Logging and Mud Logging segment offers land and ocean project contracting and technical services for collection, monitoring, transmission, processing and interpretation, and evaluation of wellbore oil and gas, geology, and engineering information. The Special Down-Hole Operations segment provides oil engineering technical and construction services, including oil testing, well repair, and lateral drilling, as well as fracturing, acidizing, and oil assignments. The Engineering Construction segment offers various services, such as feasibility studies; design, procurement, and construction for projects of onshore and offshore oil and gas fields; long-distance pipeline projects, oil and gas transporting process projects, storage and transportation projects, petrochemical supporting projects, and LNG projects; building construction, water resources and hydropower, ports and waterways, electricity transmission and distribution projects; manufacturing of pressure vessels; and coal chemical engineering, geothermal utilization, energy saving, and municipal roads and bridges. The company was formerly known as Sinopec Yizheng Chemical Fibre Company Limited and changed its name to Sinopec Oilfield Service Corporation in March 2015. The company is headquartered in Beijing, the People's Republic of China. Sinopec Oilfield Service Corporation is a subsidiary of China Petrochemical Corporation.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100728",
        "website": "http://ssc.sinopec.com",
        "market_cap": 4174005760
    },
    "YT8.F": {
        "short_name": "INNER MONG.YITAI  H YC 1",
        "long_name": "Inner Mongolia Yitai Coal Co., Ltd.",
        "summary": "Inner Mongolia Yitai Coal Co., Ltd. engages in the mining, production, transportation, and sale of coal products in the Inner Mongolia autonomous region of the People's Republic of China. It operates through three segments: Coal, Coal-Related Chemical, and Transportation. The company also provides road and railway transportation services to coal companies; coal-related chemical products and oil products; and disaster management, supply chain management, industrial development and consultation, business management consultation, and business information consultation services. In addition, it is involved in the coal mining; international trade; goods storage and loading; coal technology development; consultation; infrastructure municipal administration; research and development; oil and coal testing; fund investment and investment management; and chemical production and sale activities. The company was founded in 1997 and is headquartered in Ordos, the People's Republic of China. Inner Mongolia Yitai Coal Co.,Ltd. is a subsidiary of Inner Mongolia Yitai Group Co., Ltd.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Ordos",
        "zipcode": "017000",
        "website": "http://www.yitaicoal.com",
        "market_cap": 413528288
    },
    "YZC.F": {
        "short_name": "YANZHOU COAL MNG H ADR/10",
        "long_name": "Yanzhou Coal Mining Company Limited",
        "summary": "Yanzhou Coal Mining Company Limited primarily engages in the mining, preparation, and sale of coal in China and internationally. It offers thermal, PCI, and coking coal for electric power, metallurgy and chemical industry, etc.; produces and sells coal chemicals, including methanol, liquid wax, stable light hydrocarbon, acetic acid, ethyl acetate, etc., as well as electricity and related heat supply services; and explores for potash mineral. The company also manufactures, installs, repairs, and sells coal mining and excavating equipment, cable, and electrical equipment. In addition, it provides railway, river, and lakes transportation services; and sells construction materials. Further, the company is involved in the wholesale of coal and non-ferrous metals; house and financial leasing; logistics storage and leasing; development of charcoal products; LTCC technology development and equipment rental operations; manufacturing and sale of cable and rubber products; and production and processing of steel engineering components. Additionally, it provides underground mines management; mining materials testing; equity investment fund and corporate asset management, investment advisory and management, foreign investment fund, import and export, and international trading; solar and wind power, and production management; educational software development and event planning; and coal mining technology development, transfer, and consultation services. The company is also involved in the processing, production, and sale of FischerTropsch synthesis catalyst, composite pipe, and plastic profile products; provision of real estate development and operation, property management, garden greening engineering, and sewage treatment and rental housing agency services; and issuing subordinated capital notes. The company was founded in 1973 and is based in Zoucheng, the People's Republic of China. Yanzhou Coal Mining Company Limited is a subsidiary of Yankuang Group Corporation Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Zoucheng",
        "zipcode": "273500",
        "website": "http://www.yanzhoucoal.com.cn",
        "market_cap": 8098316288
    },
    "YZCA.F": {
        "short_name": "YANZHOU COAL MNG  H YC 1",
        "long_name": "Yanzhou Coal Mining Company Limited",
        "summary": "Yanzhou Coal Mining Company Limited primarily engages in the mining, preparation, and sale of coal in China and internationally. It offers thermal, PCI, and coking coal for electric power, metallurgy and chemical industry, etc.; produces and sells coal chemicals, including methanol, liquid wax, stable light hydrocarbon, acetic acid, ethyl acetate, etc., as well as electricity and related heat supply services; and explores for potash mineral. The company also manufactures, installs, repairs, and sells coal mining and excavating equipment, cable, and electrical equipment. In addition, it provides railway, river, and lakes transportation services; and sells construction materials. Further, the company is involved in the wholesale of coal and non-ferrous metals; house and financial leasing; logistics storage and leasing; development of charcoal products; LTCC technology development and equipment rental operations; manufacturing and sale of cable and rubber products; and production and processing of steel engineering components. Additionally, it provides underground mines management; mining materials testing; equity investment fund and corporate asset management, investment advisory and management, foreign investment fund, import and export, and international trading; solar and wind power, and production management; educational software development and event planning; and coal mining technology development, transfer, and consultation services. The company is also involved in the processing, production, and sale of FischerTropsch synthesis catalyst, composite pipe, and plastic profile products; provision of real estate development and operation, property management, garden greening engineering, and sewage treatment and rental housing agency services; and issuing subordinated capital notes. The company was founded in 1973 and is based in Zoucheng, the People's Republic of China. Yanzhou Coal Mining Company Limited is a subsidiary of Yankuang Group Corporation Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Zoucheng",
        "zipcode": "273500",
        "website": "http://www.yanzhoucoal.com.cn",
        "market_cap": 7794141184
    },
    "YZCAY": {
        "short_name": "YANZHOU COAL MINING COMPANY LIM",
        "long_name": "Yanzhou Coal Mining Company Limited",
        "summary": "Yanzhou Coal Mining Company Limited primarily engages in the mining, preparation, and sale of coal in China and internationally. It offers thermal, PCI, and coking coal for electric power, metallurgy and chemical industry, etc.; produces and sells coal chemicals, including methanol, liquid wax, stable light hydrocarbon, acetic acid, ethyl acetate, etc., as well as electricity and related heat supply services; and explores for potash mineral. The company also manufactures, installs, repairs, and sells coal mining and excavating equipment, cable, and electrical equipment. In addition, it provides railway, river, and lakes transportation services; and sells construction materials. Further, the company is involved in the wholesale of coal and non-ferrous metals; house and financial leasing; logistics storage and leasing; development of charcoal products; LTCC technology development and equipment rental operations; manufacturing and sale of cable and rubber products; and production and processing of steel engineering components. Additionally, it provides underground mines management; mining materials testing; equity investment fund and corporate asset management, investment advisory and management, foreign investment fund, import and export, and international trading; solar and wind power, and production management; educational software development and event planning; and coal mining technology development, transfer, and consultation services. The company is also involved in the processing, production, and sale of FischerTropsch synthesis catalyst, composite pipe, and plastic profile products; provision of real estate development and operation, property management, garden greening engineering, and sewage treatment and rental housing agency services; and issuing subordinated capital notes. The company was founded in 1973 and is based in Zoucheng, the People's Republic of China. Yanzhou Coal Mining Company Limited is a subsidiary of Yankuang Group Corporation Limited.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Zoucheng",
        "zipcode": "273500",
        "website": "http://www.yanzhoucoal.com.cn",
        "market_cap": 8757743616
    },
    "YZCHF": {
        "short_name": "YANZHOU COAL MINING COMPANY LIM",
        "long_name": "Yanzhou Coal Mining Company Limited",
        "summary": "Yanzhou Coal Mining Company Limited primarily engages in the mining, preparation, and sale of coal in China and internationally. It offers thermal, PCI, and coking coal for electric power, metallurgy and chemical industry, etc.; produces and sells coal chemicals, including methanol, liquid wax, stable light hydrocarbon, acetic acid, ethyl acetate, etc., as well as electricity and related heat supply services; and explores for potash mineral. The company also manufactures, installs, repairs, and sells coal mining and excavating equipment, cable, and electrical equipment. In addition, it provides railway, river, and lakes transportation services; and sells construction materials. Further, the company is involved in the wholesale of coal and non-ferrous metals; house and financial leasing; logistics storage and leasing; development of charcoal products; LTCC technology development and equipment rental operations; manufacturing and sale of cable and rubber products; and production and processing of steel engineering components. Additionally, it provides underground mines management; mining materials testing; equity investment fund and corporate asset management, investment advisory and management, foreign investment fund, import and export, and international trading; solar and wind power, and production management; educational software development and event planning; and coal mining technology development, transfer, and consultation services. The company is also involved in the processing, production, and sale of FischerTropsch synthesis catalyst, composite pipe, and plastic profile products; provision of real estate development and operation, property management, garden greening engineering, and sewage treatment and rental housing agency services; and issuing subordinated capital notes. The company was founded in 1973 and is based in Zoucheng, the People's Republic of China. Yanzhou Coal Mining Company Limited is a subsidiary of Yankuang Group Corporation Limited.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Zoucheng",
        "zipcode": "273500",
        "website": "http://www.yanzhoucoal.com.cn",
        "market_cap": 8464944640
    }
}