{
  "ORDS.QA": {
    "city": "Doha",
    "country": "Qatar",
    "currency": "QAR",
    "exchange": "DOH",
    "industry": "Telecom Services",
    "long_name": "Ooredoo Q.P.S.C.",
    "market": "qa_market",
    "sector": "Communication Services",
    "short_name": "Ooredoo QPSC",
    "state": null,
    "summary": "Ooredoo Q.P.S.C., together with its subsidiaries, provides telecommunications services and related products to small companies, start-ups, and enterprises. The company operates through six segments: Ooredoo Qatar, Asiacell, Indosat Ooredoo, Ooredoo Oman, Ooredoo Algeria, and Ooredoo Myanmar. It offers cellular, wireless, mobile and fixed telecommunication, multimedia, data communication, broadband, internet leased lines, intra city and inter city leased lines, MPLS IPVPN, and internet services. The company also provides machine to machine, cloud, and mobile applications.  It offers its services primarily in Qatar, Iraq, Kuwait, Indonesia, Oman, and other parts of the Middle East, and North African region. Ooredoo Q.P.S.C. was formerly known as Qatar Telecom (Qtel) Q.S.C. and changed its name to Ooredoo Q.P.S.C. in June 2013. The company was founded in 1987 and is headquartered in Doha, Qatar. Ooredoo Q.P.S.C. is a subsidiary of Qatar Holding L.L.C.",
    "website": "http://www.ooredoo.com",
    "zipcode": null
  },
  "QCFS.QA": {
    "city": "Doha",
    "country": "Qatar",
    "currency": "QAR",
    "exchange": "DOH",
    "industry": "Entertainment",
    "long_name": "Qatar Cinema and Film Distribution Company - Q.S.C",
    "market": "qa_market",
    "sector": "Communication Services",
    "short_name": "Qatar Cinema and Film Distribut",
    "state": null,
    "summary": "Qatar Cinema and Film Distribution Company - Q.S.C engages in the distribution of cinema films and videos in Qatar. It also trades in television films and programs, and tools for the operation of cinema and projectors. In addition, the company offers commercial advertisement services; and operates movie theater and cafeteria for cinema. Further, it invests in shares, bonds, and funds, real estate. Qatar Cinema and Film Distribution Company - Q.S.C was incorporated in 1970 and is based in Doha, Qatar.",
    "website": "http://www.qatarcinemas.com",
    "zipcode": null
  },
  "VFQS.QA": {
    "city": "Doha",
    "country": "Qatar",
    "currency": "QAR",
    "exchange": "DOH",
    "industry": "Telecom Services",
    "long_name": "Vodafone Qatar P.Q.S.C.",
    "market": "qa_market",
    "sector": "Communication Services",
    "short_name": "Vodafone Qatar PQSC",
    "state": null,
    "summary": "Vodafone Qatar P.Q.S.C. provides cellular mobile telecommunication and fixed line services in Qatar. It offers prepaid and postpaid services; access charges, airtime usage, messaging, interconnect fees, voice and data roaming, connection fees; and sells mobile related equipment and accessories. The company also provides mobile Internet and broadband services; Internet of things solutions, which enable businesses to develop new service-based customer propositions and revenue streams, as well as address compliance and sustainability requirements; and dedicated APNs for corporate organizations. In addition, it offers fixed line solutions, such as corporate Internet; DDoS mitigation services, which help to defend organizations against cyber-attacks; Ethernet VPN, a multi-site data service for corporate and government organizations; leased lines that provide reliable and secure transmission links between business sites; Vodafone Corporate Voice, a fixed-mobile convergence and unified communication service; and Vodafone IP-VPN, a private and MPLS based WAN service, as well as support services. The company was incorporated in 2008 and is headquartered in Doha, Qatar. Vodafone Qatar P.Q.S.C. is a subsidiary of Vodafone & Qatar Foundation LLC.",
    "website": "http://www.vodafone.qa",
    "zipcode": null
  }
}
