{"002960.KS": {"short_name": "HankookShellOil", "long_name": "Hankook Shell Oil Co.,Ltd.", "summary": "Hankook Shell Oil Co., Ltd. engages in the manufacture, blending, distribution, and marketing of lubricating oils and greases, and other petroleum products and associated products in South Korea. It also provides technical services and other services to its products. The company was formerly known as Keuk Dong Shell Oil Refinery Co., Ltd. The company was founded in 1960 and is based in Busan, South Korea. Hankook Shell Oil Co., Ltd. operates as a subsidiary of Royal Dutch Shell plc.", "currency": "KRW", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Busan"}, "003240.KS": {"short_name": "TaekwangInd", "long_name": "Taekwang Industrial Co., Ltd.", "summary": "Taekwang Industrial Co., Ltd. engages in the synthetic fiber, textile, petrochemical, and advanced material businesses in South Korea and internationally. It offers synthetic fibers comprising acrylic fibers, nylon filaments, spandex, and low-melting-point fibers, as well as ring, open-end, acrylic, and acrylic blended spun yarns. The company also provides petrochemical products, including purified terephthalic acids, propylene, acrylonitrile, sodium cyanide, acetonitrile, ammonium sulphate, and hydrogen peroxide. In addition, it offers tricot and polyester fabrics; and advanced materials, such as carbon and aramid fibers. The company was founded in 1950 and is headquartered in Seoul, South Korea.", "currency": "KRW", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}, "003650.KS": {"short_name": "MichangOil", "long_name": "Michang Oil Ind .Co.,Ltd.", "summary": "Michang Oil Ind. Co., Ltd. engages in the petrochemical business in South Korea. It offers automotive lubricants, including motor, gasoline engine, diesel engine, gear, and automatic transmission oils, as well as other application oils; and transformer oils. The company also provides industrial lubricants, such as hydraulic, gear, turbine, and heat transfer oils; and rubber process oils, such as paraffin, naphthene, and aroma. In addition, it offers technical grade white oils; and white mineral oil consisting of food, cosmetic, and pharma grades. The company was founded in 1962 and is headquartered in Busan, South Korea.", "currency": "KRW", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Busan"}, "010950.KS": {"short_name": "S-Oil", "long_name": "S-Oil Corporation", "summary": "S-OIL Corporation operates as an oil refining company in South Korea. The company offers gasoline, diesel, kerosene, jet fuel, LPG, fuel oil, and asphalt; benzene, toluene, xylene, para-xylene, propylene, methyl tert butly ether, propylene oxide, and polypropylene; and lubricant products. It also operates facilities that produce lube base oil and petro-chemical products; crude oil refining facilities of 669,000 barrels a day; and a bunker-C cracking center that produces petroleum products. The company has a strategic partnership with Gulf Oil Lubricants India Limited to manufacture and market a range of lubricants under the S-Oil Seven brand for the Indian market. S-OIL Corporation also exports its oil products to Southeast Asia, the United States, China, Japan, Australia, Europe, and internationally. The company was founded in 1976 and is headquartered in Seoul, South Korea. S-OIL Corporation is a subsidiary of Aramco Overseas Co., B.V.", "currency": "KRW", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}, "010955.KS": {"short_name": "S-Oil(1P)", "long_name": "S-Oil Corporation", "summary": "S-OIL Corporation operates as an oil refining company in South Korea. The company offers gasoline, diesel, kerosene, jet fuel, LPG, fuel oil, and asphalt; benzene, toluene, xylene, para-xylene, propylene, methyl tert butly ether, propylene oxide, and polypropylene; and lubricant products. It also operates facilities that produce lube base oil and petro-chemical products; crude oil refining facilities of 669,000 barrels a day; and a bunker-C cracking center that produces petroleum products. The company has a strategic partnership with Gulf Oil Lubricants India Limited to manufacture and market a range of lubricants under the S-Oil Seven brand for the Indian market. S-OIL Corporation also exports its oil products to Southeast Asia, the United States, China, Japan, Australia, Europe, and internationally. The company was founded in 1976 and is headquartered in Seoul, South Korea. S-OIL Corporation is a subsidiary of Aramco Overseas Co., B.V.", "currency": "KRW", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}, "128820.KS": {"short_name": "DAESUNGIND", "long_name": "Daesung Industrial Co., Ltd.", "summary": "Daesung Industrial Co., Ltd. engages in the retail sale and distribution of energy in South Korea. The company is involved in operating 40 petroleum stations and 15 LP gas filling stations; supplying various vehicle and industrial fuels, energy to heat houses, etc.; and heat absorption generating and oil field development activities. It also offers hydraulic and pneumatic pressure tools and appliances, geared motors, industrial robots, and industrial bearings; and computer systems, and network construction and consulting. In addition, the company constructs apartment houses; and distributes food products, such as olive oil, honey, organic green tea and rice, coffee, baby food, sweet potato, etc. under the Nature's Food brand name. Daesung Industrial Co., Ltd. was founded in 1968 and is headquartered in Seoul, South Korea.", "currency": "KRW", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}}