{
    "CHAA-UN": {
        "short_name": "Catcha Investment Corp.",
        "long_name": "Catcha Investment Corp",
        "summary": "Catcha Investment Corp is a blank check company. The company was incorporated in 2020 and is based in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "592005",
        "website": null,
        "full_time_employees": null
    },
    "CHAA": {
        "short_name": "Catcha Investment Corp.",
        "long_name": "Catcha Investment Corp",
        "summary": "Catcha Investment Corp is a blank check company. The company was incorporated in 2020 and is based in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "592005",
        "website": null,
        "full_time_employees": null
    },
    "CIIT": {
        "short_name": "TIANCI INTERNATIONAL INC",
        "long_name": "Tianci International, Inc.",
        "summary": "Tianci International, Inc. does not have significant operations. The company intends to identify and merge with an operating company. Previously, it was engaged in the development of computer games. The company is based in Subang Jaya, Malaysia.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Subang Jaya",
        "zipcode": "47640",
        "website": null,
        "full_time_employees": null
    },
    "CIMDF": {
        "short_name": "CIMB GROUP HOLDINGS BERHAD",
        "long_name": "CIMB Group Holdings Berhad",
        "summary": "CIMB Group Holdings Berhad provides various banking products and services in Malaysia and internationally. The company's Consumer Banking segment offers conventional and Islamic financial products and services, such as residential and non-residential property, and secured personal loans; unsecured personal and motor vehicle financing; credit cards and deposits; and wealth management, bancassurance, remittance and foreign exchange, and internet banking services to individual customers. Its Commercial Banking segment provides banking credit facilities, trade financing, cash management, and general deposit products, as well as an online business banking platform to small and medium-scale enterprises, and mid-sized corporations. The company's Wholesale Banking segment offers client coverage marketing and delivering solutions; financial advisory services on issuance of equity and equity-linked products, debt restructuring, initial public and offerings, and general corporate advisory; conventional and Islamic funding solutions covering trade, working capital line, capital expenditure, leveraging, merger and acquisition, leveraged, and project financing products; and holistic funding solutions comprising derivative, structured, and debt capital market products, as well as custody and corporate loans to corporate and financial institutional clients. This segment also engages in the treasury activities and services; transaction banking and broking services; wealth management solutions, as well as investment, securities financing, and trust services. Its CIMB Digital Assets & Group Funding segment operates partnerships and explores equity joint ventures; and engages in the capital, balance sheet, and fixed income investment and management, as well as funding and incubation of corporate ventures and projects. It operates through 668 retail banking branches in 15 countries. The company was founded in 1924 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "50470",
        "website": "http://www.cimb.com",
        "full_time_employees": 34183
    },
    "EAIN": {
        "short_name": "PLURAL IND HLDG GROUP CO LTD",
        "long_name": "Plural Industry Holding Group Co. Limited",
        "summary": "Enabling Asia, Inc., a development stage company, focuses on developing and operating Internet domain names in the budget travel and related categories. The company was formerly known as Budget Center Inc. and changed its name to Budget Center Inc. in November 2017. Budget Center Inc. is based in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "50480",
        "website": "http://www.enablingasia.com",
        "full_time_employees": null
    },
    "INBT": {
        "short_name": "INBIT CORP",
        "long_name": "Inbit Corp.",
        "summary": "Inbit Corp. does not have significant operations. Previously, the company was engaged in the provision of computer programming services. Inbit Corp. was founded in 2014 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "52000",
        "website": "http://inbit-corp.com",
        "full_time_employees": null
    },
    "MLYBY": {
        "short_name": "MALAYAN BANKING BERHAD",
        "long_name": "Malayan Banking Berhad",
        "summary": "Malayan Banking Berhad provides commercial banking and related financial products and services for individuals, small and medium enterprises, retail and corporate customers, and financial institutions primarily in Malaysia, Singapore, and Indonesia. The company operates through three segments: Group Community Financial Services, Group Global Banking, and Group Insurance and Takaful. It offers savings and fixed deposits, and current and money market accounts; and housing and personal loans, project financing, overdrafts, and trade financing, as well as remittance service. The company also offers credit cards; bancassurance products; hire purchase, unit trust, cash management, custodian, and trustee services; and treasury activities and services, including foreign exchange, money market, derivatives, and trading of capital market. In addition, it provides investment banking and securities broking services; corporate advisory, bond and equity issuance, syndicated acquisition advisory, debt restructuring advisory, and share and futures dealings; and asset and fund management services, including a range of conventional and Islamic investment solutions. Further, the company underwrites general and life insurance businesses, offshore investment life insurance business, and general and family takaful products; and offers offshore banking, property leasing and trading, nominee, property investment, IT shared and development, financial and investment advisory, money lending, private equity investments, research, and leasing and factoring services. The company operates a network of approximately 2,626 retail branches and 51 investment banking branches in 18 countries internationally. Malayan Banking Berhad was incorporated in 1960 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "50050",
        "website": "http://www.maybank.com",
        "full_time_employees": 42000
    },
    "MLYNF": {
        "short_name": "MALAYAN BANKING BERHAD",
        "long_name": "Malayan Banking Berhad",
        "summary": "Malayan Banking Berhad provides commercial banking and related financial products and services for individuals, small and medium enterprises, retail and corporate customers, and financial institutions primarily in Malaysia, Singapore, and Indonesia. The company operates through three segments: Group Community Financial Services, Group Global Banking, and Group Insurance and Takaful. It offers savings and fixed deposits, and current and money market accounts; and housing and personal loans, project financing, overdrafts, and trade financing, as well as remittance service. The company also offers credit cards; bancassurance products; hire purchase, unit trust, cash management, custodian, and trustee services; and treasury activities and services, including foreign exchange, money market, derivatives, and trading of capital market. In addition, it provides investment banking and securities broking services; corporate advisory, bond and equity issuance, syndicated acquisition advisory, debt restructuring advisory, and share and futures dealings; and asset and fund management services, including a range of conventional and Islamic investment solutions. Further, the company underwrites general and life insurance businesses, offshore investment life insurance business, and general and family takaful products; and offers offshore banking, property leasing and trading, nominee, property investment, IT shared and development, financial and investment advisory, money lending, private equity investments, research, and leasing and factoring services. The company operates a network of approximately 2,626 retail branches and 51 investment banking branches in 18 countries internationally. Malayan Banking Berhad was incorporated in 1960 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "50050",
        "website": "http://www.maybank.com",
        "full_time_employees": 42000
    },
    "MSNI": {
        "short_name": "MON SPACE NET INC",
        "long_name": "Mon Space Net Inc.",
        "summary": "Mon Space Net Inc. plans to build an online marketplace to sell products and services to its members using a business to business to consumer model in Malaysia. The company intends to launch Mon Space Mall, an online platform that allows third-party merchants, as well as individual users to sell their general merchandise products and services directly to other users. Mon Space Net Inc. was incorporated in 2015 and is based in Petaling Jaya, Malaysia.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Petaling Jaya",
        "zipcode": "46200",
        "website": "http://www.msnetinc.com",
        "full_time_employees": null
    },
    "PBLOF": {
        "short_name": "PUBLIC BANK BERHAD",
        "long_name": "Public Bank Berhad",
        "summary": "Public Bank Berhad engages in the consumer banking, retail commercial lending, and private unit trust businesses. The company's deposit products include savings, current, fixed deposit, foreign currency, and gold investment accounts; and safe deposit box services. Its loan portfolio comprises home, SWIFT, working capital, SME, and other loans; overdrafts; project and vehicle financing; PB retail negotiable instruments of deposit; and credit guarantee corporation guarantee schemes and BNM funds. The company also provides Islamic banking, share broking, trustee services, nominee services, unit trust funds sales and management, bancassurance, and general insurance products and services. In addition, it offers mobile, internet, and self-service banking services; credit and debit card, and remittance services; and investment products and services, such as structured product investment and share trading/margin financing. Further, the company provides insurance products, including single premium investment-linked, family and savings, micro protection, and credit life insurance products. Additionally, it offers cash management services, such as account management, collection, and payment services. The company operates through a network of 264 branches and 2,089 self-service terminals in Malaysia, as well as 79 branches in Hong Kong, 5 in China, 31 in Cambodia, 26 in Vietnam, 4 in Laos, and 3 in Sri Lanka. It serves retail consumers, and small and medium enterprises. Public Bank Berhad was founded in 1966 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "50450",
        "website": "http://www.pbebank.com",
        "full_time_employees": 19414
    },
    "PRCX": {
        "short_name": "PHOENIX RISING COS",
        "long_name": "Phoenix Rising Companies",
        "summary": "Phoenix Rising Companies trades in oil, gas, and lubricant products in the People's Republic of China. The company also provides nutrition consultancy services and training, as well as sells health, nutrition, and supplement products through an online store. Phoenix Rising Companies was founded in 2012 and is based in Puchong, Malaysia.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Puchong",
        "zipcode": "47100",
        "website": "http://www.phoenix-cos.com",
        "full_time_employees": 20
    },
    "VCBC.L": {
        "short_name": "VERTU CAPITAL LIMITED ORD GBP0.",
        "long_name": "Vertu Capital Limited",
        "summary": "Vertu Capital Limited does not have significant operations. It intends to acquire a target company or business in the financial services sector, including fund management businesses, niche investment banks, trustee and custodian services businesses, and financial planning businesses. The company was incorporated in 2014 and is headquartered in Subang Jaya, Malaysia.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Malaysia",
        "state": null,
        "city": "Subang Jaya",
        "zipcode": "47500",
        "website": "http://www.vertucapital.co.uk",
        "full_time_employees": null
    },
    "XITO": {
        "short_name": "XENOUS HLDGS INC",
        "long_name": "Xenous Holdings, Inc.",
        "summary": "Xenous Holdings, Inc. does not have significant operations. It seeks and investigates assets, properties, or businesses to acquire. The company was formerly known as M101 Corp. and changed its name to Xenous Holdings, Inc. in November 2019. Xenous Holdings, Inc. was incorporated in 1980 and is based in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "50450",
        "website": null,
        "full_time_employees": null
    }
}