{
    "CIMDF": {
        "short_name": "CIMB GROUP HOLDINGS BERHAD",
        "long_name": "CIMB Group Holdings Berhad",
        "summary": "CIMB Group Holdings Berhad provides various banking products and services in Malaysia and internationally. The company's Consumer Banking segment offers products, such as deposits; loans; personal financing; credit cards; wealth management and investments; bancassurance; remittance and foreign exchange; and online, mobile, self-service, and phone banking services to individuals. Its Commercial Banking segment provides credit facilities, cash management, treasury, and structured products to small and medium-scale enterprises (SMEs), and mid corporates. The company's Wholesale Banking segment offers capital markets fund raising, corporate advisory, mergers and acquisitions, cash management, trade and capital expenditure financing, structured trade, value-chain, project, and leverage financing services; structured investment and risk management services; and fixed income, currency and commodities, and equity derivatives to retail and high net-worth individuals, SMEs, corporates, and financial institutions. Its GVP & Funding segment operates a partnerships infrastructure that focuses on creating new revenue streams through financial product co-creation and distribution models with digital platform companies, as well as ventures practice through equity co-ownerships. The company also provides Islamic banking and transaction banking services, as well as stock broking services. It operates through a retail banking network of approximately 702 branches in 15 countries. CIMB Group Holdings Berhad was founded in 1924 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks—Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "city": "Kuala Lumpur"
    },
    "MLYBY": {
        "short_name": "MALAYAN BANKING BERHAD",
        "long_name": "Malayan Banking Berhad",
        "summary": "Malayan Banking Berhad provides commercial banking and related financial services for individuals, small and medium enterprises, retail and corporate customers, and financial institutions primarily in Malaysia, Singapore, and Indonesia. The company operates through three segments: Group Community Financial Services, Group Global Banking, and Group Insurance and Takaful. It offers savings and fixed deposits, and current and money market accounts; and housing and personal loans, project financing, overdrafts, and trade financing, as well as remittance service. The company also offers credit cards; bancassurance products; hire purchase, unit trust, cash management, custodian, and trustee services; and treasury activities and services, including foreign exchange, money market, derivatives, and trading of capital market. In addition, it provides investment banking and securities broking services; corporate advisory, bond and equity issuance, syndicated acquisition advisory, debt restructuring advisory, and share and futures dealings; and asset and fund management services, including a range of conventional and Islamic investment solutions. Further, the company underwrites general and life insurance businesses, offshore investment life insurance business, and general and family takaful products. Additionally, it offers offshore banking, property leasing and trading, nominee, property investment, IT shared and development, financial and investment advisory, money lending, private equity investments, financial education, research, and leasing and factoring services. The company operates a network of approximately 2,400 branches and offices in 20 countries internationally. Malayan Banking Berhad was founded in 1960 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks—Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "city": "Kuala Lumpur"
    },
    "MLYNF": {
        "short_name": "MALAYAN BANKING BERHAD",
        "long_name": "Malayan Banking Berhad",
        "summary": "Malayan Banking Berhad provides commercial banking and related financial services for individuals, small and medium enterprises, retail and corporate customers, and financial institutions primarily in Malaysia, Singapore, and Indonesia. The company operates through three segments: Group Community Financial Services, Group Global Banking, and Group Insurance and Takaful. It offers savings and fixed deposits, and current and money market accounts; and housing and personal loans, project financing, overdrafts, and trade financing, as well as remittance service. The company also offers credit cards; bancassurance products; hire purchase, unit trust, cash management, custodian, and trustee services; and treasury activities and services, including foreign exchange, money market, derivatives, and trading of capital market. In addition, it provides investment banking and securities broking services; corporate advisory, bond and equity issuance, syndicated acquisition advisory, debt restructuring advisory, and share and futures dealings; and asset and fund management services, including a range of conventional and Islamic investment solutions. Further, the company underwrites general and life insurance businesses, offshore investment life insurance business, and general and family takaful products. Additionally, it offers offshore banking, property leasing and trading, nominee, property investment, IT shared and development, financial and investment advisory, money lending, private equity investments, financial education, research, and leasing and factoring services. The company operates a network of approximately 2,400 branches and offices in 20 countries internationally. Malayan Banking Berhad was founded in 1960 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks—Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "city": "Kuala Lumpur"
    }
}