{
    "2170.SR": {
        "short_name": "Alujain Holding  Corp.",
        "long_name": "Alujain Holding Corporation",
        "summary": "Alujain Holding Corporation manufactures and sells home care products in Saudi Arabia. It operates in two segments, Investments and Manufacturing Home-Care Products. The company offers home care products, such as spray starches and air fresheners; insecticides; and agricultural pesticides. It also manufactures petrochemical products. The company was formerly known as Alujain Corporation and changed its name to Alujain Holding Corporation in February 2020. Alujain Holding Corporation was founded in 1991 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "12333",
        "website": "http://www.alujain.sa",
        "market_cap": "Small Cap"
    },
    "2222.SR": {
        "short_name": "Saudi Arabian Oil Co.",
        "long_name": "Saudi Arabian Oil Company",
        "summary": "Saudi Arabian Oil Company operates as an integrated oil and gas company in the Kingdom of Saudi Arabia and internationally. The company operates through two segments, Upstream and Downstream. The Upstream segment explores, develops, produces, and sells crude oil, condensate, natural gas, and natural gas liquids (NGLs). As of December 31, 2019, its reserves included 258.6 billion barrels of oil equivalent, including 201.9 billion barrels of crude oil and condensate; 25.7 billion barrels of NGLs; and 190.6 trillion standard cubic feet of natural gas, as well as 510 reservoirs within 138 fields distributed throughout the Kingdom and its territorial waters. The Downstream segment produces various chemicals, including ethylene, ethylene glycol, ethylene oxide, methanol, methyl tertiary butyl ether, polyethylene and engineering plastics and their derivatives, and other products; and base oils, as well as in the refining and retail operations. It also supplies oil products; and trades in refined petroleum and liquid chemical products, and polymers. The company also develops, manufactures, and markets high-performance rubber; and provides crude oil storage, financial, and marine management and transportation services. Saudi Arabian Oil Company was founded in 1933 and is headquartered in Dhahran, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Dhahran",
        "zipcode": "31311",
        "website": "http://www.aramco.com",
        "market_cap": "Mega Cap"
    },
    "2380.SR": {
        "short_name": "Rabigh Refining and Petrochemic",
        "long_name": "Rabigh Refining and Petrochemical Company",
        "summary": "Rabigh Refining and Petrochemical Company engages in the development, construction, and operation of an integrated refining and petrochemical complex in the Middle East, the Asia Pacific, and internationally. The company operates through Refined Products and Petrochemicals segments. It offers polymers, such as linear low density polyethylene, high density polyethylene, homopolymer polypropylene, and impact copolymer polypropylene; and monomers, including propylene oxide and mono ethylene glycol. The company also provides refined products comprising liquefied petroleum gas, naphtha, gasoline, gas oil, fuel oil, and kerosene. Its products are used in various end products, such as plastics, detergents, lubricants, resins, coolants, anti-freeze, paint, carpets, rope, clothing, shampoo, auto interiors, epoxy glue, insulation, film, fibers, household appliances, packaging, candles, pipes, and other applications. The company was founded in 2005 and is based in Rabigh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Rabigh",
        "zipcode": "21911",
        "website": "http://www.petrorabigh.com",
        "market_cap": "Mid Cap"
    }
}