{
    "1236.TW": {
        "short_name": "HUNYA FOODS CO",
        "long_name": "Hunya Foods Co., Ltd.",
        "summary": "Hunya Foods Co., Ltd. manufactures, processes, and trades in food products in Taiwan. The company offers candies, biscuits, chocolates, moon cakes, pastries, bread, pastries, and other food products; and operates gift shops. It also provides its products online. The company was founded in 1976 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23145",
        "website": "http://www.hunya.com.tw",
        "full_time_employees": null
    },
    "2733.TWO": {
        "short_name": "Vigor Kobo",
        "long_name": "Vigor Kobo Co., LTD.",
        "summary": "Vigor Kobo Co.,Ltd. develops, produces, and sells Chinese cakes and pastries in Taiwan and internationally. It offers pineapple, red-in-green mini, chestnut mini, black stick mini, milk sun, cheese honey, and taro mini cakes, as well as beef jerky. The company provides its products through its stores. Vigor Kobo Co.,Ltd. was founded in 1992 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "10364",
        "website": "http://www.taiwan-vigor.com.tw",
        "full_time_employees": 152
    },
    "4207.TWO": {
        "short_name": "TAIWAN FRUCTOSE CO",
        "long_name": "Taiwan Fructose Co., Ltd.",
        "summary": "Taiwan Fructose Co., Ltd. manufactures and sells syrup products in Taiwan. The company's products comprise fructose, maltose, isomalto-oligo saccharides, and maltodextrin syrups, as well as non-dairy creamers, vegetable oil powder, dextrose, and sorbitol. Its products are used in a range of applications, including beverages, dairy products, iced products, desserts, bakery food, soy sauces, health foods, candy, jams and jellies, sachima, bean fillings, chewing gums, candied fruits, biscuits, coffee, milk tea, instant drinks, toothpaste, cleaning and makeup products, and interface activators. The company was founded in 1984 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "338",
        "website": "http://www.fructose.com.tw",
        "full_time_employees": null
    }
}