{
    "3313.TWO": {
        "short_name": "FEEI CHERNG ENTERPRISE CO",
        "long_name": "Feei Cherng Enterprise Co., Ltd.",
        "summary": "Feei Cherng Enterprise Co., Ltd. manufactures and markets active/passive electronic components in Taiwan and Internationally. The company's products include MOSFETs, LAN transformers, and polymer caps, as well as diodes, NTC thermistors, MLCC, and crystals. It also distributes. The company offers its products for use in N/B, M/B, smart phones, mobiles, and GPS system applications. Feei Cherng Enterprise Co., Ltd. was founded in 1993 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "241",
        "website": "http://www.fce.com.tw",
        "market_cap": "Small Cap"
    },
    "4712.TWO": {
        "short_name": "NAN TSAN INDUSTRY",
        "long_name": "Nan Tsan Co., Ltd",
        "summary": "Nan Tsan Co., Ltd, a technology company, develops intelligent robots and artificial intelligence in Taiwan. It is also involved in the production of pigments. The company focuses on the development of 5G and IoT smart home solutions. Nan Tsan Co., Ltd was founded in 1974 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": null,
        "website": "http://www.nantsan.com.tw",
        "market_cap": "Small Cap"
    },
    "8465.TWO": {
        "short_name": "Tekho",
        "long_name": "Tekho Marine Biotech Co., Ltd",
        "summary": "Tekho Marine Biotech Co., Ltd researches and develops aquatic and aquarium products in Taiwan and internationally. It offers blood fish, larva fish, and adult fish, as well as giant, leopard coral, tiger, and orange-spotted grouper. The company also develops hardware-software products; and imports peripheral products of aquarium fish. In addition, it publishes aquarium books. Tekho Marine Biotech Co., Ltd was founded in 1965 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "708",
        "website": "http://www.tekho.com.tw",
        "market_cap": "Small Cap"
    }
}