{
    "38P.F": {
        "short_name": "PIHLAJALINNA OY",
        "long_name": "Pihlajalinna Oyj",
        "summary": "Pihlajalinna Oyj provides social and healthcare services for private persons, businesses, insurance companies, municipalities, and hospital districts in Finland. It offers emergency and on-call, occupational healthcare, dental care, social and healthcare outsourcing, health care outsourcing, responsible doctor, remote consultation, imaging, and staffing services, as well as housing services for the elderly; and primary and specialized care services, which include orthopedics and surgery, internal medicine, neurology, cardiology, geriatrics, gynecology, psychiatry, radiology, and general medicine specialties. The company also operates fitness and reception centers; and books appointment with general practitioners and specialists. Pihlajalinna Oyj was founded in 2001 and is headquartered in Tampere, Finland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Finland",
        "city": "Tampere"
    },
    "4TS.F": {
        "short_name": "TERVEYSTALO OYJ",
        "long_name": "Terveystalo Oyj",
        "summary": "Terveystalo Oyj provides occupational healthcare services in Finland. The company offers general practice and specialist medical care, diagnostic, outpatient surgery, dental, and other adjacent services; and laboratory, imaging, wellbeing, day surgery, healthcare outsourcing, healthcare staffing, and primary and specialty care services. It also provides a suite of digital healthcare services; and insurance and clinical research services. The company serves private individuals, companies and communities, insurance companies, and public sector customers. It operates through approximately 300 clinics, including 17 clinic-hospitals, 40 dental clinics, and 170 physiotherapy clinics, as well as 47 clinics with imaging services. Terveystalo Oyj was founded in 2001 and is based in Helsinki, Finland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Finland",
        "city": "Helsinki"
    },
    "4YL.F": {
        "short_name": "NANOFORM FINLAND OYJ",
        "long_name": "Nanoform Finland Oyj",
        "summary": "Nanoform Finland Oy provides nanotechnology and drug particle engineering services for the pharmaceutical and biotechnology industries in Finland and internationally. The company provides nanoparticle production services using its proprietary controlled expansion of supercritical solutions technology that enables clients in the creation of active pharmaceutical ingredients nanoparticles directly from solution. Its technology and services help in increasing the bioavailability of drug molecules and developing new drugs. The company was founded in 2015 and is headquartered in Helsinki, Finland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Finland",
        "city": "Helsinki"
    },
    "5NXA.F": {
        "short_name": "NEXSTIM OYJ",
        "long_name": "Nexstim Plc",
        "summary": "Nexstim Plc, a neuromodulation company, engages in the development and marketing of non-invasive brain stimulation technologies in Finland, rest of Europe, North America, and internationally. The company's proprietary SmartFocus technology with 3D navigation is the navigated transcranial magnetic stimulation (TMS) approach that is used for therapeutic and diagnostic applications. It offers NBT system, a navigated brain therapy system for the treatment of major depression order or chronic neuropathic pain; and NBS system, a navigated brain stimulation system for pre-surgical mapping of the speech and motor cortices of the brain. The company primarily sells its NBS systems to universities and teaching hospitals. Nexstim Plc was founded in 2000 and is headquartered in Helsinki, Finland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Finland",
        "city": "Helsinki"
    },
    "BIOBV.HE": {
        "short_name": "Biohit Oyj B",
        "long_name": "Biohit Oyj",
        "summary": "Biohit Oyj, a biotechnology company, produces diagnostic tests and analysis systems for use in research institutions and healthcare industries worldwide. Its diagnostic tests product range includes the GastroPanel test for diagnosing diseases of the stomach and associated risks; Biohit Active B12, a test for measuring the levels of active vitamin B12; Biohit Total, an indicator of vitamin D status; Biohit Calprotectin, a test for measuring human calprotectin; Helicobacter Pylori Quick Test and Helicobacter Pylori UFT300 Quick Test, a test methods to detect H. pylori infection from a biopsy sample during gastroscopy; ColonView Quick Test, a test for detection of fecal occult blood; Lactose Intolerance Quick Test; Celiac Disease Quick Test; and The GA-map Dysbiosis test, a gut microbiota DNA analysis tool. The company also provides monoclonal antibodies for use in cellular pathology, neurobiology, oncology, and human gastric biomarkers research. In addition, it provides acetaldehyde binding products, such as Acetium capsules that are intended for persons with a low-acid or anacidic stomach; and Acetium lozenges, which removes acetaldehyde in smoker's saliva. Additionally, it provides microplate readers and strip washers, quick test readers, and ThunderBolt, an automated immunoassay analyzer; and products that bind carcinogenic acetaldehyde into harmless compounds, monoclonal antibodies, and service laboratory services. The company was founded in 1988 and is headquartered in Helsinki, Finland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "city": "Helsinki"
    },
    "BONEH.HE": {
        "short_name": "BBS-Bioactive Bone Substitutes",
        "long_name": "BBS-Bioactive Bone Substitutes Oyj",
        "summary": "BBS-Bioactive Bone Substitutes Oyj, a biomedical technology company, develops, designs, manufactures, and sells bioactive medical devices and implants for orthopedic surgery in Finland. It offers ARTEBON, an orthobiological product based on tricalcium phosphate and natural spectrum of bone proteins. The company was founded in 2003 and is headquartered in Oulu, Finland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "city": "Oulu"
    },
    "BONES.ST": {
        "short_name": "BBS-Bioactive Bone Substitutes",
        "long_name": "BBS-Bioactive Bone Substitutes Oyj",
        "summary": "BBS-Bioactive Bone Substitutes Oyj, a biomedical technology company, develops, designs, manufactures, and sells bioactive medical devices and implants for orthopedic surgery in Finland. It offers ARTEBON, an orthobiological product based on tricalcium phosphate and natural spectrum of bone proteins. The company was founded in 2003 and is headquartered in Oulu, Finland.",
        "currency": "SEK",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "STO",
        "market": "se_market",
        "country": "Finland",
        "city": "Oulu"
    },
    "FARN.L": {
        "short_name": "FARON PHARMACEUTICALS OY ORD NP",
        "long_name": "Faron Pharmaceuticals Oy",
        "summary": "Faron Pharmaceuticals Oy operates as a clinical stage drug discovery and development company in Finland. It has a pipeline of drug development projects focusing on acute trauma, cancer growth and spread, and inflammatory diseases. The company's lead product candidates are Traumakine, a recombinant human IFN beta-1a, which is in Phase III clinical trial for the treatment of acute respiratory distress syndrome (ARDS); and Clevegen, an immunotherapy candidate, designed to prevent tumor growth and metastasis that targets the tumor immune suppressor molecule; and D-ARDS, a diagnostic tool to estimate ARDS severity and to follow ARDS outcome. Faron Pharmaceuticals Oy has a collaboration with MediCity unit of Turku University Medical School. The company was founded in 2003 and is headquartered in Turku, Finland.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Finland",
        "city": "Turku"
    },
    "FARON.HE": {
        "short_name": "Faron Pharmaceuticals Oy",
        "long_name": "Faron Pharmaceuticals Oy",
        "summary": "Faron Pharmaceuticals Oy operates as a clinical stage drug discovery and development company in Finland. It has a pipeline of drug development projects focusing on acute trauma, cancer growth and spread, and inflammatory diseases. The company's lead product candidates are Traumakine, a recombinant human IFN beta-1a, which is in Phase III clinical trial for the treatment of acute respiratory distress syndrome (ARDS); and Clevegen, an immunotherapy candidate, designed to prevent tumor growth and metastasis that targets the tumor immune suppressor molecule; and D-ARDS, a diagnostic tool to estimate ARDS severity and to follow ARDS outcome. Faron Pharmaceuticals Oy has a collaboration with MediCity unit of Turku University Medical School. The company was founded in 2003 and is headquartered in Turku, Finland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "city": "Turku"
    },
    "FPHAF": {
        "short_name": "FARON PHARMACEUTICALS OY",
        "long_name": "Faron Pharmaceuticals Oy",
        "summary": "Faron Pharmaceuticals Oy operates as a clinical stage drug discovery and development company in Finland. It has a pipeline of drug development projects focusing on acute trauma, cancer growth and spread, and inflammatory diseases. The company's lead product candidates are Traumakine, a recombinant human IFN beta-1a, which is in Phase III clinical trial for the treatment of acute respiratory distress syndrome (ARDS); and Clevegen, an immunotherapy candidate, designed to prevent tumor growth and metastasis that targets the tumor immune suppressor molecule; and D-ARDS, a diagnostic tool to estimate ARDS severity and to follow ARDS outcome. Faron Pharmaceuticals Oy has a collaboration with MediCity unit of Turku University Medical School. The company was founded in 2003 and is headquartered in Turku, Finland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Finland",
        "city": "Turku"
    },
    "HRNTS.ST": {
        "short_name": "Herantis Pharma Oyj",
        "long_name": "Herantis Pharma Oyj",
        "summary": "Herantis Pharma Oyj, a drug development company, focuses on developing regenerative medicine. Its products in pipeline includes CDNF, which is in Phase I-II clinical trial for the treatment of Parkinson's disease, as well as in preclinical stage for the treatment of amyotrophic lateral sclerosis; and Lymfactin, which is in Phase II clinical trial for the treatment of breast cancer associated lymphedema. The company was founded in 2008 and is based in Espoo, Finland.",
        "currency": "SEK",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "STO",
        "market": "se_market",
        "country": "Finland",
        "city": "Espoo"
    },
    "HRTIS.HE": {
        "short_name": "Herantis Pharma Oyj",
        "long_name": "Herantis Pharma Oyj",
        "summary": "Herantis Pharma Oyj, a drug development company, focuses on developing regenerative medicine. Its products in pipeline includes CDNF, which is in Phase I-II clinical trial for the treatment of Parkinson's disease, as well as in preclinical stage for the treatment of amyotrophic lateral sclerosis; and Lymfactin, which is in Phase II clinical trial for the treatment of breast cancer associated lymphedema. The company was founded in 2008 and is based in Espoo, Finland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "city": "Espoo"
    },
    "NANOFS.ST": {
        "short_name": "Nanoform Finland Oyj",
        "long_name": "Nanoform Finland Oyj",
        "summary": "Nanoform Finland Oy provides nanotechnology and drug particle engineering services for the pharmaceutical and biotechnology industries in Finland and internationally. The company provides nanoparticle production services using its proprietary controlled expansion of supercritical solutions technology that enables clients in the creation of active pharmaceutical ingredients nanoparticles directly from solution. Its technology and services help in increasing the bioavailability of drug molecules and developing new drugs. The company was founded in 2015 and is headquartered in Helsinki, Finland.",
        "currency": "SEK",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "STO",
        "market": "se_market",
        "country": "Finland",
        "city": "Helsinki"
    },
    "NXTMH.HE": {
        "short_name": "Nexstim Oyj",
        "long_name": "Nexstim Plc",
        "summary": "Nexstim Plc, a neuromodulation company, engages in the development and marketing of non-invasive brain stimulation technologies in Finland, rest of Europe, North America, and internationally. The company's proprietary SmartFocus technology with 3D navigation is the navigated transcranial magnetic stimulation (TMS) approach that is used for therapeutic and diagnostic applications. It offers NBT system, a navigated brain therapy system for the treatment of major depression order or chronic neuropathic pain; and NBS system, a navigated brain stimulation system for pre-surgical mapping of the speech and motor cortices of the brain. The company primarily sells its NBS systems to universities and teaching hospitals. Nexstim Plc was founded in 2000 and is headquartered in Helsinki, Finland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "city": "Helsinki"
    },
    "NXTMS.ST": {
        "short_name": "Nexstim Oyj",
        "long_name": "Nexstim Plc",
        "summary": "Nexstim Plc, a neuromodulation company, engages in the development and marketing of non-invasive brain stimulation technologies in Finland, rest of Europe, North America, and internationally. The company's proprietary SmartFocus technology with 3D navigation is the navigated transcranial magnetic stimulation (TMS) approach that is used for therapeutic and diagnostic applications. It offers NBT system, a navigated brain therapy system for the treatment of major depression order or chronic neuropathic pain; and NBS system, a navigated brain stimulation system for pre-surgical mapping of the speech and motor cortices of the brain. The company primarily sells its NBS systems to universities and teaching hospitals. Nexstim Plc was founded in 2000 and is headquartered in Helsinki, Finland.",
        "currency": "SEK",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "STO",
        "market": "se_market",
        "country": "Finland",
        "city": "Helsinki"
    },
    "O5O.F": {
        "short_name": "ORIOLA OYJ B",
        "long_name": "Oriola Oyj",
        "summary": "Oriola Oyj provides healthcare and wellbeing products. It offers various range of OTC and traded good, vitamins, dietary supplements, pharmaceutical cosmetics, skincare products, tests, sports drinks, and wound care products. The company also provides logistics, sales and marketing, digital, and expert services for pharmaceutical companies, pharmacies, hospital pharmacies, veterinaries, and veterinary clinics, as well as other health and wellbeing industry operators, and the grocery trade. In addition, it offers pharmaceutical and dose dispensing services for public and private sector customers in Sweden, as well as dose dispensing services for pharmacies in Finland; and serves hospitals, health centers, and other healthcare operators. As of December 31, 2019, it operated 324 pharmacies in Sweden. Oriola Oyj also operates online pharmacies. The company was formerly known as Oriola-KD Oyj and changed its name to Oriola Oyj in April 2017. Oriola Oyj is headquartered in Espoo, Finland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Finland",
        "city": "Espoo"
    },
    "OFK.F": {
        "short_name": "ORION CORP. B",
        "long_name": "Orion Oyj",
        "summary": "Orion Oyj develops, manufactures, and markets human and veterinary pharmaceuticals and active pharmaceutical ingredients (APIs) in Finland, Scandinavia, other European countries, North America, and internationally. It provides prescription drugs and self-care products, including Nubeqa for the treatment of prostate cancer; dexdor and Precedex for intensive care sedative; Stalevo and Comtess/Comtan for Parkinson's disease; Simdax for acute decompensated heart failure; and Fareston for breast cancer, as well as Salmeterol/fluticasone Easyhaler, Budesonide/formoterol Easyhaler, Formoterol Easyhaler, Budesonide Easyhaler, Beclomet Easyhaler, and Buventol Easyhaler for the treatment of asthma and chronic obstructive pulmonary disease. The company also offers veterinary drugs; and APIs for generic and proprietary drugs, as well as provides contract manufacturing services. In addition, it markets and sells veterinary drugs manufactured by other international companies. The company has a collaboration with Nanoform to apply Nanoform's CESS technology to new chemical entities. It serves various healthcare service providers and professionals, such as specialist and general practitioners, veterinarians, pharmacies, hospitals, healthcare centers, clinics, and laboratories. Orion Oyj has partnership with Propeller Health to connect the Easyhaler(R) line of inhalers for asthma and COPD to Propeller's digital medicine platform. Orion Oyj is headquartered in Espoo, Finland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Finland",
        "city": "Espoo"
    },
    "OKDAV.HE": {
        "short_name": "Oriola Corporation A",
        "long_name": "Oriola Oyj",
        "summary": "Oriola Oyj provides healthcare and wellbeing products. It offers various range of OTC and traded good, vitamins, dietary supplements, pharmaceutical cosmetics, skincare products, tests, sports drinks, and wound care products. The company also provides logistics, sales and marketing, digital, and expert services for pharmaceutical companies, pharmacies, hospital pharmacies, veterinaries, and veterinary clinics, as well as other health and wellbeing industry operators, and the grocery trade. In addition, it offers pharmaceutical and dose dispensing services for public and private sector customers in Sweden, as well as dose dispensing services for pharmacies in Finland; and serves hospitals, health centers, and other healthcare operators. As of December 31, 2019, it operated 324 pharmacies in Sweden. Oriola Oyj also operates online pharmacies. The company was formerly known as Oriola-KD Oyj and changed its name to Oriola Oyj in April 2017. Oriola Oyj is headquartered in Espoo, Finland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "city": "Espoo"
    },
    "OKDBV.HE": {
        "short_name": "Oriola Corporation B",
        "long_name": "Oriola Oyj",
        "summary": "Oriola Oyj provides healthcare and wellbeing products. It offers various range of OTC and traded good, vitamins, dietary supplements, pharmaceutical cosmetics, skincare products, tests, sports drinks, and wound care products. The company also provides logistics, sales and marketing, digital, and expert services for pharmaceutical companies, pharmacies, hospital pharmacies, veterinaries, and veterinary clinics, as well as other health and wellbeing industry operators, and the grocery trade. In addition, it offers pharmaceutical and dose dispensing services for public and private sector customers in Sweden, as well as dose dispensing services for pharmacies in Finland; and serves hospitals, health centers, and other healthcare operators. As of December 31, 2019, it operated 324 pharmacies in Sweden. Oriola Oyj also operates online pharmacies. The company was formerly known as Oriola-KD Oyj and changed its name to Oriola Oyj in April 2017. Oriola Oyj is headquartered in Espoo, Finland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "city": "Espoo"
    },
    "OPTOMED.HE": {
        "short_name": "Optomed Plc",
        "long_name": "Optomed Oyj",
        "summary": "Optomed Oyj, a medical technology company, provides handheld fundus cameras and eye-screening devices in Finland and internationally. The company operates through Devices and Software segments. It offers handheld fundus camera products, which are used in ophthalmology, pediatric care, endocrinology, neurology, and primary care. Its product portfolio consists of Optomed Smartscope Pro, Optomed Aurora, and Optomed Aava, as well as OEM cameras, including Pictor Plus, Visuscout 100, Fundus Module 300, and Bosch Eye Cam. The company also provides Optomed Screen, a workflow management software for public clinics or private companies for diagnostics and follow-up in the diabetic retinopathy screening process; Optomed Link, a telemedicine solution that gives patients access to medical consultation; Optomed Avenue, a gateway to artificial intelligence services; and Optomed, a process management software for cancer screening, as well as IT consulting services. Its customers include health care organizations, original equipment manufacturers (OEMs), and hospitals. The company was founded in 2004 and is headquartered in Oulu, Finland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "city": "Oulu"
    },
    "ORINF": {
        "short_name": "ORION CORPORATION",
        "long_name": "Orion Oyj",
        "summary": "Orion Oyj develops, manufactures, and markets human and veterinary pharmaceuticals and active pharmaceutical ingredients (APIs) in Finland, Scandinavia, other European countries, North America, and internationally. It provides prescription drugs and self-care products, including Nubeqa for the treatment of prostate cancer; dexdor and Precedex for intensive care sedative; Stalevo and Comtess/Comtan for Parkinson's disease; Simdax for acute decompensated heart failure; and Fareston for breast cancer, as well as Salmeterol/fluticasone Easyhaler, Budesonide/formoterol Easyhaler, Formoterol Easyhaler, Budesonide Easyhaler, Beclomet Easyhaler, and Buventol Easyhaler for the treatment of asthma and chronic obstructive pulmonary disease. The company also offers veterinary drugs; and APIs for generic and proprietary drugs, as well as provides contract manufacturing services. In addition, it markets and sells veterinary drugs manufactured by other international companies. The company has a collaboration with Nanoform to apply Nanoform's CESS technology to new chemical entities. It serves various healthcare service providers and professionals, such as specialist and general practitioners, veterinarians, pharmacies, hospitals, healthcare centers, clinics, and laboratories. Orion Oyj has partnership with Propeller Health to connect the Easyhaler(R) line of inhalers for asthma and COPD to Propeller's digital medicine platform. Orion Oyj is headquartered in Espoo, Finland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Finland",
        "city": "Espoo"
    },
    "ORINY": {
        "short_name": "ORION CORPORATION",
        "long_name": "Orion Oyj",
        "summary": "Orion Oyj develops, manufactures, and markets human and veterinary pharmaceuticals and active pharmaceutical ingredients (APIs) in Finland, Scandinavia, other European countries, North America, and internationally. It provides prescription drugs and self-care products, including Nubeqa for the treatment of prostate cancer; dexdor and Precedex for intensive care sedative; Stalevo and Comtess/Comtan for Parkinson's disease; Simdax for acute decompensated heart failure; and Fareston for breast cancer, as well as Salmeterol/fluticasone Easyhaler, Budesonide/formoterol Easyhaler, Formoterol Easyhaler, Budesonide Easyhaler, Beclomet Easyhaler, and Buventol Easyhaler for the treatment of asthma and chronic obstructive pulmonary disease. The company also offers veterinary drugs; and APIs for generic and proprietary drugs, as well as provides contract manufacturing services. In addition, it markets and sells veterinary drugs manufactured by other international companies. The company has a collaboration with Nanoform to apply Nanoform's CESS technology to new chemical entities. It serves various healthcare service providers and professionals, such as specialist and general practitioners, veterinarians, pharmacies, hospitals, healthcare centers, clinics, and laboratories. Orion Oyj has partnership with Propeller Health to connect the Easyhaler(R) line of inhalers for asthma and COPD to Propeller's digital medicine platform. Orion Oyj is headquartered in Espoo, Finland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Finland",
        "city": "Espoo"
    },
    "ORNAV.HE": {
        "short_name": "Orion Corporation A",
        "long_name": "Orion Oyj",
        "summary": "Orion Oyj develops, manufactures, and markets human and veterinary pharmaceuticals and active pharmaceutical ingredients (APIs) in Finland, Scandinavia, other European countries, North America, and internationally. It provides prescription drugs and self-care products, including Nubeqa for the treatment of prostate cancer; dexdor and Precedex for intensive care sedative; Stalevo and Comtess/Comtan for Parkinson's disease; Simdax for acute decompensated heart failure; and Fareston for breast cancer, as well as Salmeterol/fluticasone Easyhaler, Budesonide/formoterol Easyhaler, Formoterol Easyhaler, Budesonide Easyhaler, Beclomet Easyhaler, and Buventol Easyhaler for the treatment of asthma and chronic obstructive pulmonary disease. The company also offers veterinary drugs; and APIs for generic and proprietary drugs, as well as provides contract manufacturing services. In addition, it markets and sells veterinary drugs manufactured by other international companies. The company has a collaboration with Nanoform to apply Nanoform's CESS technology to new chemical entities. It serves various healthcare service providers and professionals, such as specialist and general practitioners, veterinarians, pharmacies, hospitals, healthcare centers, clinics, and laboratories. Orion Oyj has partnership with Propeller Health to connect the Easyhaler(R) line of inhalers for asthma and COPD to Propeller's digital medicine platform. Orion Oyj is headquartered in Espoo, Finland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "city": "Espoo"
    },
    "ORNBV.HE": {
        "short_name": "Orion Corporation B",
        "long_name": "Orion Oyj",
        "summary": "Orion Oyj develops, manufactures, and markets human and veterinary pharmaceuticals and active pharmaceutical ingredients (APIs) in Finland, Scandinavia, other European countries, North America, and internationally. It provides prescription drugs and self-care products, including Nubeqa for the treatment of prostate cancer; dexdor and Precedex for intensive care sedative; Stalevo and Comtess/Comtan for Parkinson's disease; Simdax for acute decompensated heart failure; and Fareston for breast cancer, as well as Salmeterol/fluticasone Easyhaler, Budesonide/formoterol Easyhaler, Formoterol Easyhaler, Budesonide Easyhaler, Beclomet Easyhaler, and Buventol Easyhaler for the treatment of asthma and chronic obstructive pulmonary disease. The company also offers veterinary drugs; and APIs for generic and proprietary drugs, as well as provides contract manufacturing services. In addition, it markets and sells veterinary drugs manufactured by other international companies. The company has a collaboration with Nanoform to apply Nanoform's CESS technology to new chemical entities. It serves various healthcare service providers and professionals, such as specialist and general practitioners, veterinarians, pharmacies, hospitals, healthcare centers, clinics, and laboratories. Orion Oyj has partnership with Propeller Health to connect the Easyhaler(R) line of inhalers for asthma and COPD to Propeller's digital medicine platform. Orion Oyj is headquartered in Espoo, Finland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "city": "Espoo"
    },
    "PIHLIS.HE": {
        "short_name": "Pihlajalinna Oyj",
        "long_name": "Pihlajalinna Oyj",
        "summary": "Pihlajalinna Oyj provides social and healthcare services for private persons, businesses, insurance companies, municipalities, and hospital districts in Finland. It offers emergency and on-call, occupational healthcare, dental care, social and healthcare outsourcing, health care outsourcing, responsible doctor, remote consultation, imaging, and staffing services, as well as housing services for the elderly; and primary and specialized care services, which include orthopedics and surgery, internal medicine, neurology, cardiology, geriatrics, gynecology, psychiatry, radiology, and general medicine specialties. The company also operates fitness and reception centers; and books appointment with general practitioners and specialists. Pihlajalinna Oyj was founded in 2001 and is headquartered in Tampere, Finland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "city": "Tampere"
    },
    "TTALF": {
        "short_name": "TERVEYSTALO OYJ",
        "long_name": "Terveystalo Oyj",
        "summary": "Terveystalo Oyj provides occupational healthcare services in Finland. The company offers general practice and specialist medical care, diagnostic, outpatient surgery, dental, and other adjacent services; and laboratory, imaging, wellbeing, day surgery, healthcare outsourcing, healthcare staffing, and primary and specialty care services. It also provides a suite of digital healthcare services; and insurance and clinical research services. The company serves private individuals, companies and communities, insurance companies, and public sector customers. It operates through approximately 300 clinics, including 17 clinic-hospitals, 40 dental clinics, and 170 physiotherapy clinics, as well as 47 clinics with imaging services. Terveystalo Oyj was founded in 2001 and is based in Helsinki, Finland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Finland",
        "city": "Helsinki"
    },
    "TTALO.HE": {
        "short_name": "Terveystalo Plc",
        "long_name": "Terveystalo Oyj",
        "summary": "Terveystalo Oyj provides occupational healthcare services in Finland. The company offers general practice and specialist medical care, diagnostic, outpatient surgery, dental, and other adjacent services; and laboratory, imaging, wellbeing, day surgery, healthcare outsourcing, healthcare staffing, and primary and specialty care services. It also provides a suite of digital healthcare services; and insurance and clinical research services. The company serves private individuals, companies and communities, insurance companies, and public sector customers. It operates through approximately 300 clinics, including 17 clinic-hospitals, 40 dental clinics, and 170 physiotherapy clinics, as well as 47 clinics with imaging services. Terveystalo Oyj was founded in 2001 and is based in Helsinki, Finland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "city": "Helsinki"
    }
}