{
    "5CR0.F": {
        "short_name": "SIXTY SIX CAPITAL INC.",
        "long_name": "Sixty Six Capital Inc.",
        "summary": "Sixty Six Capital Inc. provides co-location and cloud computing services. The company engages in the high-performance computing, storage, and information processing activities. It also invests in various technology sectors, such as crypto tokens and crypto finance. The company was formerly known as Hydro66 Holdings Corp. and changed its name to Sixty Six Capital Inc. in April 2021. Sixty Six Capital Inc. is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W1T 1DS",
        "website": "http://www.sixtysixcapital.com",
        "market_cap": "Small Cap"
    },
    "AFN.L": {
        "short_name": "ADVFN PLC ORD 0.2P",
        "long_name": "ADVFN Plc",
        "summary": "ADVFN plc, together with subsidiaries, develops and provides financial information primarily through the Internet and research services in the United Kingdom, the United States, and internationally. It also develops and explores ancillary Internet sites; and operates an Internet dating Website, and financial information Website, as well as provides office services, and brokerage and software development services. ADVFN plc was incorporated in 1989 and is based in Ongar, the United Kingdom.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Ongar",
        "zipcode": "CM5 0GA",
        "website": "http://www.advfn.com",
        "market_cap": "Small Cap"
    },
    "AFX.L": {
        "short_name": "ALPHA FX GROUP PLC ORD 0.2P",
        "long_name": "Alpha FX Group plc",
        "summary": "Alpha FX Group plc provides foreign exchange risk management and alternative banking solutions in the United Kingdom and internationally. The company offers forward currency contracts, option contracts, foreign exchange spot transactions, and payments collections and currency accounts services. It serves corporates and institutions that are exposed to currency market volatility. The company was formerly known as Alpha Capital Limited. Alpha FX Group PLC was founded in 2009 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W2 1DG",
        "website": "http://www.alphafx.co.uk",
        "market_cap": "Small Cap"
    },
    "AGFX.L": {
        "short_name": "ARGENTEX GROUP PLC ORD 001",
        "long_name": "Argentex Group Plc",
        "summary": "Argentex Group PLC provides foreign exchange services for businesses worldwide. Its product offering includes spot, forward, and options FX capabilities provided primarily through voice broking channels. The company serves corporate, institutional, and private clients. Argentex Group PLC was founded in 2011 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W1F 7TU",
        "website": "http://www.argentex.com",
        "market_cap": "Small Cap"
    },
    "AJB.L": {
        "short_name": "AJ BELL PLC ORD GBP0.000125",
        "long_name": "AJ Bell plc",
        "summary": "AJ Bell plc, through its subsidiaries, operates investment platforms in the United Kingdom. The company offers AJ Bell Investcentre, which provides a suite of products, services, investment solutions, and online tools for regulated financial advisers and wealth managers to help them manage retail customers' portfolio; and AJ Bell Youinvest that includes the provision of proprietary investment content and investment solutions through in-house funds, ready-made portfolios, and selected funds for execution-only retail customers. AJ Bell plc also provides adviser-led and D2C pension administration services to customers with bespoke SIPP and SSAS accounts; and dealing, settlement, and custody services to institutional investment businesses, as well as publishes shares magazine and other proprietary investment content. The company was founded in 1995 and is headquartered in Manchester, the United Kingdom.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Manchester",
        "zipcode": "M5 3EE",
        "website": "http://www.ajbell.co.uk",
        "market_cap": "Small Cap"
    },
    "ARB.L": {
        "short_name": "ARGO BLOCKCHAIN PLC ORD 0.1P",
        "long_name": "Argo Blockchain plc",
        "summary": "Argo Blockchain plc, together with its subsidiary, Argo Blockchain Canada Holdings Inc., engages in the crypto asset mining services worldwide. The company was formerly known as GoSun Blockchain Limited and changed its name to Argo Blockchain plc in December 2017. The company was founded in 2017 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "SW1Y 6LX",
        "website": "http://www.argoblockchain.com",
        "market_cap": "Small Cap"
    },
    "ARBKF": {
        "short_name": "ARGO BLOCKCHAIN PLC",
        "long_name": "Argo Blockchain plc",
        "summary": "Argo Blockchain plc, together with its subsidiary, Argo Blockchain Canada Holdings Inc., engages in the crypto asset mining services worldwide. The company was formerly known as GoSun Blockchain Limited and changed its name to Argo Blockchain plc in December 2017. The company was founded in 2017 and is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "SW1Y 6LX",
        "website": "http://www.argoblockchain.com",
        "market_cap": "Small Cap"
    },
    "ARDN.L": {
        "short_name": "ARDEN PARTNERS PLC ORD 10P",
        "long_name": "Arden Partners plc",
        "summary": "Arden Partners plc operates as a multi-service stockbroker for small and mid-cap companies in the United Kingdom. It provides various financial services consisting of corporate advisory, such as nominated adviser and sponsor services, strategic corporate finance advice and strategic reviews, and capital restructurings, as well as services related to takeover codes and new issues; corporate broking and investor relations; equity sales and trading; equity research; and wealth management services. Arden Partners plc was founded in 2002 and is based in Birmingham, the United Kingdom.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Birmingham",
        "zipcode": "B15 1NP",
        "website": "http://www.arden-partners.com",
        "market_cap": "Small Cap"
    },
    "AVFCF": {
        "short_name": "ADVFN",
        "long_name": "ADVFN Plc",
        "summary": "ADVFN plc, together with subsidiaries, develops and provides financial information primarily through the Internet and research services in the United Kingdom, the United States, and internationally. It also develops and explores ancillary Internet sites; and operates an Internet dating Website, and financial information Website, as well as provides office services, and brokerage and software development services. ADVFN plc was incorporated in 1989 and is based in Ongar, the United Kingdom.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Ongar",
        "zipcode": "CM5 0GA",
        "website": "http://www.advfn.com",
        "market_cap": "Small Cap"
    },
    "BYA1.SG": {
        "short_name": "QUANTUM BLOCKCHAIN TECHNOLOGIES",
        "long_name": "Quantum Blockchain Technologies Plc",
        "summary": "Clear Leisure plc, formerly known as Brainspark plc, is a private equity and venture capital firm specializing in investments in mid venture, early stage, turnaround, medium-sized companies, and considers pre-IPO opportunities as well. It seeks to invest in leisure, real estate, interactive media, financial services, renewable & alternative energy sector and technology related investments specially interactive media, blockchain and artificial intelligence sectors. It also prefers to invest in the entertainment sector with specific focus on theme park sector. The firm does not have any geographical restrictions. However, it seeks to invest in companies based in Europe, China, Middle East, United Kingdom, Italy and India. The focus of management is to pursue the monetisation of all of the Company's existing assets, through selected realisations, court-led recoveries of misappropriated assets and substantial debt-recovery processes. The firm seeks to invest between $0.1 million and $15 million in the portfolio companies. The firm's investments range from acquiring minority positions with strategic influence through to larger controlling positions. It seeks board seat in its investee companies. The firm seeks to invest in first rounds together with other institutional investors and also makes balance sheet investments. It exits its investments through initial public offering or trade sale. Clear Leisure plc was founded in 1999 and is based in London, United Kingdom with an additional office in Milano, Italy.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "WC1N 3ES",
        "website": "http://www.clearleisure.co.uk",
        "market_cap": "Small Cap"
    },
    "CBG.L": {
        "short_name": "CLOSE BROTHERS GROUP PLC ORD 25",
        "long_name": "Close Brothers Group plc",
        "summary": "Close Brothers Group plc, a merchant banking company, provides financial services to small businesses and individuals in the United Kingdom. It operates through five segments: Commercial, Retail, Property, Asset Management, and Securities. The company offers various deposit products, including fixed term deposits and notice accounts. It also provides asset finance, asset-based lending, commercial vehicle hire, short-term bridging finance, insurance premium finance, invoice discounting and factoring, and property finance products. In addition, the company offers funding services for general aviation aircraft, and various leisure and commercial vessels; sale and rent back services for the brewing sector; broker finance services to agriculture, construction, manufacturing, and transport industries; leasing services for construction, manufacturing, IT equipment, and specialist assets; and loan, hire purchase, leasing, and refinancing services to the professional service sector, including dental, medical, pharmacy, and veterinary sectors. Further, it provides financial education, investment management, and financial planning and advice services; self-directed services that help investors to manage their portfolio online; and services for financial advisers. Additionally, the company offers liquidity and flexible execution services to retail stockbrokers, wealth managers, and institutional investors; market making, sales, research, and corporate broking services; and dealing, custody, and settlement services to the institutional, wealth management, and brokerage clients. Close Brothers Group plc was founded in 1878 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC2A 4FT",
        "website": "http://www.closebrothers.com",
        "market_cap": "Mid Cap"
    },
    "CBGPY": {
        "short_name": "CLOSE BROS GROUP",
        "long_name": "Close Brothers Group plc",
        "summary": "Close Brothers Group plc, a merchant banking company, provides financial services to small businesses and individuals in the United Kingdom. It operates through five segments: Commercial, Retail, Property, Asset Management, and Securities. The company offers various deposit products, including fixed term deposits and notice accounts. It also provides asset finance, asset-based lending, commercial vehicle hire, short-term bridging finance, insurance premium finance, invoice discounting and factoring, and property finance products. In addition, the company offers funding services for general aviation aircraft, and various leisure and commercial vessels; sale and rent back services for the brewing sector; broker finance services to agriculture, construction, manufacturing, and transport industries; leasing services for construction, manufacturing, IT equipment, and specialist assets; and loan, hire purchase, leasing, and refinancing services to the professional service sector, including dental, medical, pharmacy, and veterinary sectors. Further, it provides financial education, investment management, and financial planning and advice services; self-directed services that help investors to manage their portfolio online; and services for financial advisers. Additionally, the company offers liquidity and flexible execution services to retail stockbrokers, wealth managers, and institutional investors; market making, sales, research, and corporate broking services; and dealing, custody, and settlement services to the institutional, wealth management, and brokerage clients. Close Brothers Group plc was founded in 1878 and is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC2A 4FT",
        "website": "http://www.closebrothers.com",
        "market_cap": "Mid Cap"
    },
    "CMCX.L": {
        "short_name": "CMC MARKETS PLC ORD 25P",
        "long_name": "CMC Markets plc",
        "summary": "CMC Markets plc, together with its subsidiaries, provides online retail financial services to retail, professional, stockbroking, and institutional clients in Australia, the United Kingdom, and internationally. The company provides its clients with the ability to trade contracts for difference and financial spread betting on a range of underlying shares, indices, foreign currencies, commodities, and treasuries through its trading platform. It also offers Australian clients the opportunity to trade Australian and selected international instruments, including shares, options, managed funds, warrants, and exchange traded funds. In addition, the company provides its clients a range of education opportunities through weekly and monthly webinars and seminars, as well as Trader Development programme, which provides a range of in-platform, on-demand education, and tailored market commentary. CMC Markets plc was founded in 1989 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC3A 7BX",
        "website": "http://www.cmcmarkets.com",
        "market_cap": "Small Cap"
    },
    "CNKS.L": {
        "short_name": "CENKOS SECURITIES PLC ORD 1P",
        "long_name": "Cenkos Securities plc",
        "summary": "Cenkos Securities plc, together with its subsidiaries, provides corporate finance, nomad and broking, and research and execution services to small and mid-cap growth companies and investment funds in the United Kingdom. The company offers technical advice on various forms of corporate transactions, including IPOs, fundraisings, mergers and acquisitions, disposals, restructurings, and tender offers. It also provides transactional advice, strategic advice, and regulatory guidance services, as well as assistance with investor relations and research; and execution services comprising liquidity and facilitate institutional business, as well as making markets in small and large cap equities and investment funds. The company was incorporated in 2004 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC2R 7AS",
        "website": "http://www.cenkos.com",
        "market_cap": "Small Cap"
    },
    "CS3.F": {
        "short_name": "CLOSE BROTH. GRP  LS-,25",
        "long_name": "Close Brothers Group plc",
        "summary": "Close Brothers Group plc, a merchant banking company, provides financial services to small businesses and individuals in the United Kingdom. It operates through five segments: Commercial, Retail, Property, Asset Management, and Securities. The company offers various deposit products, including fixed term deposits and notice accounts. It also provides asset finance, asset-based lending, commercial vehicle hire, short-term bridging finance, insurance premium finance, invoice discounting and factoring, and property finance products. In addition, the company offers funding services for general aviation aircraft, and various leisure and commercial vessels; sale and rent back services for the brewing sector; broker finance services to agriculture, construction, manufacturing, and transport industries; leasing services for construction, manufacturing, IT equipment, and specialist assets; and loan, hire purchase, leasing, and refinancing services to the professional service sector, including dental, medical, pharmacy, and veterinary sectors. Further, it provides financial education, investment management, and financial planning and advice services; self-directed services that help investors to manage their portfolio online; and services for financial advisers. Additionally, the company offers liquidity and flexible execution services to retail stockbrokers, wealth managers, and institutional investors; market making, sales, research, and corporate broking services; and dealing, custody, and settlement services to the institutional, wealth management, and brokerage clients. Close Brothers Group plc was founded in 1878 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC2A 4FT",
        "website": "http://www.closebrothers.com",
        "market_cap": "Mid Cap"
    },
    "FCAP.L": {
        "short_name": "FINNCAP GROUP PLC ORD 1P",
        "long_name": "finnCap Group plc",
        "summary": "finnCap Group plc provides various financial services to various growth companies in the United Kingdom. It offers corporate financing, equity capital markets and corporate broking, mergers and acquisitions, IPO, financial advisory, research, dual-track, sales trading and market making, private fundraising, sell-side advisory, buy-side advisory, and debt advisory services, as well as engages in the equity sale, and institutional stockbroking activities. The company was founded in 2007 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC1A 7BL",
        "website": "http://www.finncap.com",
        "market_cap": "Small Cap"
    },
    "FKE.L": {
        "short_name": "FISKE PLC ORD 25P",
        "long_name": "Fiske plc",
        "summary": "Fiske plc, together with its subsidiaries, provides financial intermediation services primarily in the United Kingdom. The company offers discretionary portfolio management, investment advisory, execution, and stockbroking services; and other services, such as client deposit accounts, individual savings accounts, self-invested personal pensions and small self-administered schemes, nominee services, and safe custody services to private clients. It also provides advisory and dealing services to institutional clients. The company serves private investors, trustees, charities, and pension funds. Fiske plc was founded in 1973 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC2M 5QS",
        "website": "http://www.fiskeplc.com",
        "market_cap": "Small Cap"
    },
    "FRP.L": {
        "short_name": "FRP ADVISORY GROUP PLC ORD 0.1P",
        "long_name": "FRP Advisory Group plc",
        "summary": "FRP Advisory Group plc, through its subsidiaries, provides business advisory services to companies, lenders, investors, individuals, and other stakeholders. The company's services include restructuring and insolvency advisory, including corporate financial advisory, formal insolvency appointments, informal restructuring advisory, personal insolvency, and general advice to various stakeholders; corporate finance advisory services comprising mergers and acquisitions (M&A), strategic advisory and valuations, financial due diligence, capital raising, special situations M&A, and partial exits; and debt advisory services consisting of raising and refinancing debt, debt amendments and extensions, restructuring debt, asset based lending, and corporate and leveraged debt advisory. Its services also include forensic services, such as forensic investigations, compliance and risk advisory, dispute services, and forensic technology; and pensions advisory services comprising pension scheme transaction advisory, pension scheme restructuring advisory, covenant advisory, and corporate governance. The company was founded in 2010 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC4N 6EU",
        "website": "http://www.frpadvisory.com",
        "market_cap": "Small Cap"
    },
    "HYHDF": {
        "short_name": "SIXTY SIX CAP INC",
        "long_name": "Sixty Six Capital Inc.",
        "summary": "Sixty Six Capital Inc. provides co-location and cloud computing services. The company engages in the high-performance computing, storage, and information processing activities. It also invests in various technology sectors, such as crypto tokens and crypto finance. The company was formerly known as Hydro66 Holdings Corp. and changed its name to Sixty Six Capital Inc. in April 2021. Sixty Six Capital Inc. is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W1T 1DS",
        "website": "http://www.sixtysixcapital.com",
        "market_cap": "Small Cap"
    },
    "I5G.F": {
        "short_name": "IG GROUP HLDGS PLC",
        "long_name": "IG Group Holdings plc",
        "summary": "IG Group Holdings plc operates as a multi-platform trading company worldwide. It offers CFDs (contracts for difference), are derivative contracts that enable clients to take advantage of changes in an asset's price; and spread betting that allow clients to take advantage of changes in an asset's price without owning the asset itself, and to use the same range of risk-mitigation measures. The company also offers clients access to a range of risk-mitigation measures, including stops and limits and a limited risk account; and stock trading service, ISAs, and SIPPs. In addition, it provides a range of portfolios, which include commodities, equities, and fixed-income assets designed to match the degree of caution or aggression desired by the client; and exchange traded derivatives, as well as offers foreign exchange, market risk management, data distribution, nominee, finance, software development, publication, domains registry, foreign exchange trading, and translation services. The company was founded in 1974 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC4R 2YA",
        "website": "http://www.iggroup.com",
        "market_cap": "Mid Cap"
    },
    "IGG.L": {
        "short_name": "IG GROUP HOLDINGS PLC ORD 0.005",
        "long_name": "IG Group Holdings plc",
        "summary": "IG Group Holdings plc operates as a multi-platform trading company worldwide. It offers CFDs (contracts for difference), are derivative contracts that enable clients to take advantage of changes in an asset's price; and spread betting that allow clients to take advantage of changes in an asset's price without owning the asset itself, and to use the same range of risk-mitigation measures. The company also offers clients access to a range of risk-mitigation measures, including stops and limits and a limited risk account; and stock trading service, ISAs, and SIPPs. In addition, it provides a range of portfolios, which include commodities, equities, and fixed-income assets designed to match the degree of caution or aggression desired by the client; and exchange traded derivatives, as well as offers foreign exchange, market risk management, data distribution, nominee, finance, software development, publication, domains registry, foreign exchange trading, and translation services. The company was founded in 1974 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC4R 2YA",
        "website": "http://www.iggroup.com",
        "market_cap": "Mid Cap"
    },
    "IGGHY": {
        "short_name": "IG GROUP HLDGS",
        "long_name": "IG Group Holdings plc",
        "summary": "IG Group Holdings plc operates as a multi-platform trading company worldwide. It offers CFDs (contracts for difference), are derivative contracts that enable clients to take advantage of changes in an asset's price; and spread betting that allow clients to take advantage of changes in an asset's price without owning the asset itself, and to use the same range of risk-mitigation measures. The company also offers clients access to a range of risk-mitigation measures, including stops and limits and a limited risk account; and stock trading service, ISAs, and SIPPs. In addition, it provides a range of portfolios, which include commodities, equities, and fixed-income assets designed to match the degree of caution or aggression desired by the client; and exchange traded derivatives, as well as offers foreign exchange, market risk management, data distribution, nominee, finance, software development, publication, domains registry, foreign exchange trading, and translation services. The company was founded in 1974 and is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC4R 2YA",
        "website": "http://www.iggroup.com",
        "market_cap": "Mid Cap"
    },
    "INPP.JO": {
        "short_name": "Investec plc Pref",
        "long_name": "Investec plc",
        "summary": "Investec plc, a specialist bank and wealth manager, provides various financial products and services in the United Kingdom, South Africa, the United States, Canada, rest of Europe, Asia, and internationally. The company offers wealth and investment services, such as investments and savings, financial planning, and pensions to private clients, professional advisors, charities, and trusts. It also provides specialist banking products and services comprising private banking services, including lending, private capital, transactional banking, savings, and foreign exchange; corporate and investment banking services, such as lending, advisory, and treasury and risk management solutions, as well as institutional research, sales, and trading; and principal investments, property investment, and fund management solutions to high net worth and high income private, corporate, private equity, government, and institutional clients. In addition, it offers nominee, leasing, debt issuance, property, financing, shipping, investment management, property fund and corporate trustee, corporate secretary, insurance, merchant banking and stock broking, trust and company administration, aircraft leasing, retail credit, venture capital, and share trust services, as well as operates lending platform. The company was founded in 1974 and is headquartered in London, the United Kingdom. Investec plc operates as a subsidiary of Investec Group.",
        "currency": "ZAc",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "JNB",
        "market": "za_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC2V 7QP",
        "website": "http://www.investec.com",
        "market_cap": "Large Cap"
    },
    "INVR.L": {
        "short_name": "INVESTEC PLC NON-RED NON-CUM NO",
        "long_name": "Investec plc",
        "summary": "Investec plc, a specialist bank and wealth manager, provides various financial products and services in the United Kingdom, South Africa, the United States, Canada, rest of Europe, Asia, and internationally. The company offers wealth and investment services, such as investments and savings, financial planning, and pensions to private clients, professional advisors, charities, and trusts. It also provides specialist banking products and services comprising private banking services, including lending, private capital, transactional banking, savings, and foreign exchange; corporate and investment banking services, such as lending, advisory, and treasury and risk management solutions, as well as institutional research, sales, and trading; and principal investments, property investment, and fund management solutions to high net worth and high income private, corporate, private equity, government, and institutional clients. In addition, it offers nominee, leasing, debt issuance, property, financing, shipping, investment management, property fund and corporate trustee, corporate secretary, insurance, merchant banking and stock broking, trust and company administration, aircraft leasing, retail credit, venture capital, and share trust services, as well as operates lending platform. The company was founded in 1974 and is headquartered in London, the United Kingdom. Investec plc operates as a subsidiary of Investec Group.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC2V 7QP",
        "website": "http://www.investec.com",
        "market_cap": "Mid Cap"
    },
    "JIM.L": {
        "short_name": "JARVIS SECURITIES PLC ORD 0.25P",
        "long_name": "Jarvis Securities plc",
        "summary": "Jarvis Securities plc, through its subsidiary, Jarvis Investment Management Limited, provides a range of stock broking services to retail and institutional clients in the United Kingdom. The company offers retail execution-only stockbroking services; ISA and SIPP investment wrappers; savings schemes; and financial administration, settlement, and custody services to other stockbrokers and investment firms, as well as to individuals. It also provides outsourced investment administration and Model B clearing and settlement services. The company was founded in 1984 and is headquartered in Royal Tunbridge Wells, the United Kingdom.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Royal Tunbridge Wells",
        "zipcode": "TN4 8BS",
        "website": "http://www.jarvissecurities.co.uk",
        "market_cap": "Small Cap"
    },
    "K3C.L": {
        "short_name": "K3 CAPITAL GROUP PLC ORD 1P",
        "long_name": "K3 Capital Group PLC",
        "summary": "K3 Capital Group PLC acts as a business sales specialist in the United Kingdom and internationally. The company provides business sale services that identify and match the sellers of SME businesses to trade, individual, and institutional buyers under the KBS Corporate brand; delivers deals to mid-market private equity and trade buyers under the KBS Corporate Finance brand; and offers business transfer services under the Knightsbridge brand. It also offers insolvency and restructuring, forensic accounting, corporate finance, pension, and financial advisory services under the Quantuma brand; and tax credit specialist services under the RandD brand. The company was founded in 1998 and is headquartered in Bolton, the United Kingdom.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Bolton",
        "zipcode": "BL3 2NT",
        "website": "http://www.k3capitalgroupplc.com",
        "market_cap": "Small Cap"
    },
    "MAC.L": {
        "short_name": "MARECHALE CAPITAL PLC ORD 0.8P",
        "long_name": "Marechale Capital Plc",
        "summary": "Marechale Capital Plc, a corporate finance company, providing strategic, merger and acquisitions, and advisory services in the United Kingdom and Europe. It also offers capital raising, such as equity financing, mezzanine, and debt financing services. The company also provides advisory services, including strategic review, growth capital, and refinancing and exit advice. In addition, it offers financing solutions to early stage and growth capital companies. The company serves primarily to hospitality and renewable companies. The company was formerly known as St Helen's Capital Plc. Marechale Capital Plc was founded in 1998 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC2M 1JH",
        "website": "http://marechalecapital.com",
        "market_cap": "Small Cap"
    },
    "MLALE.PA": {
        "short_name": "ALEPH FINANCE",
        "long_name": "Aleph Finance Group Plc",
        "summary": "Aleph Finance Group PLC, a holding company, provides investment management and advisory services to high net worth individuals, families, and companies worldwide. It offers wealth management services, such as managed accounts, advisory mandates, portfolio allocation, and risk analysis; and fund management products, including UCITS funds, alternative funds, marketing and placement, and risk management services; The company also provides capital market services, which include corporate finance, listing and placements, investors relations, club deals, and crowdfunding; and financial services comprise compliance oversight, securitization vehicles, and certificates and fund set up products, as well as a regulatory umbrella. Aleph Finance Group PLC was incorporated in 2008 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W1S 4PW",
        "website": "http://www.alephgroup.io",
        "market_cap": null
    },
    "NUM.L": {
        "short_name": "NUMIS CORPORATION PLC ORD 5P",
        "long_name": "Numis Corporation Plc",
        "summary": "Numis Corporation Plc, through its subsidiaries, provides a range of investment banking and corporate advisory services in the United Kingdom and the United States. The company offers research services with investment perspective; stockbroking services to the United Kingdom, European, the United States, and International investment funds; and research, sales, trading, and corporate broking/finance services focusing on quoted equity, private equity, infrastructure, property, debt, and other alternative assets for a range of institutional investors, family offices, and private client wealth managers. It also provides corporate finance services comprising advice and transaction execution in relation to mergers and acquisitions, IPOs, secondary equity issuance, convertible securities, and bonds for corporate and private equity clients; corporate broking services; suite of services enabling companies to gain access to an international investor base; market intelligence and advice; and arrangement of sector conferences and events, as well as capital markets days and bespoke reverse roadshows for investors. In addition, the company offers private client fund management services in the areas of advice, investor targeting and corporate access, perception audits, retail and intermediary offers, primary and secondary market transactions, sales, trading and origination, retail bonds, and investment companies; The Numis Smaller Companies Index; and asset management services. Numis Corporation Plc was founded in 1989 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC4M 7LT",
        "website": "http://www.numis.com",
        "market_cap": "Small Cap"
    },
    "SIX.CN": {
        "short_name": "SixtySixCapit",
        "long_name": "Sixty Six Capital Inc.",
        "summary": "Sixty Six Capital Inc. provides co-location and cloud computing services. The company engages in the high-performance computing, storage, and information processing activities. It also invests in various technology sectors, such as crypto tokens and crypto finance. The company was formerly known as Hydro66 Holdings Corp. and changed its name to Sixty Six Capital Inc. in April 2021. Sixty Six Capital Inc. is headquartered in London, the United Kingdom.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W1T 1DS",
        "website": "http://www.sixtysixcapital.com",
        "market_cap": "Small Cap"
    },
    "T8Q.F": {
        "short_name": "CMC MARKETS PLC  LS -,25",
        "long_name": "CMC Markets plc",
        "summary": "CMC Markets plc, together with its subsidiaries, provides online retail financial services to retail, professional, stockbroking, and institutional clients in Australia, the United Kingdom, and internationally. The company provides its clients with the ability to trade contracts for difference and financial spread betting on a range of underlying shares, indices, foreign currencies, commodities, and treasuries through its trading platform. It also offers Australian clients the opportunity to trade Australian and selected international instruments, including shares, options, managed funds, warrants, and exchange traded funds. In addition, the company provides its clients a range of education opportunities through weekly and monthly webinars and seminars, as well as Trader Development programme, which provides a range of in-platform, on-demand education, and tailored market commentary. CMC Markets plc was founded in 1989 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC3A 7BX",
        "website": "http://www.cmcmarkets.com",
        "market_cap": "Small Cap"
    },
    "TAVI.L": {
        "short_name": "TAVISTOCK INVESTMENTS PLC ORD 1",
        "long_name": "Tavistock Investments Plc",
        "summary": "Tavistock Investments Plc provides investment management and advisory support services to a network of financial advisers in the United Kingdom. The company offers compliance, regulatory, administration, and accounting services to independent financial advisers and financial advice firms; independent financial advice, financial planning, tax saving, and investment management services to higher net worth private clients; and corporate advisory services to businesses. It also provides institutional portfolio management services; and flexible retirement guarantee to principals, as well as retirement and pension, wills and estate planning, and finance raising and wealth management services. Tavistock Investments Plc is headquartered in Bracknell, the United Kingdom.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Bracknell",
        "zipcode": "RG12 7BW",
        "website": "http://tavistockinvestments.com",
        "market_cap": "Small Cap"
    },
    "WHI.L": {
        "short_name": "W.H. IRELAND GROUP PLC ORD 5P",
        "long_name": "WH Ireland Group plc",
        "summary": "WH Ireland Group plc, a financial services company, provides wealth management, wealth planning, and corporate and institutional broking services primarily in the United Kingdom and the Isle of Man. It operates through two segments, Wealth Management, and Corporate and Institutional Broking. The Wealth Management segment provides bespoke wealth management solutions and independent financial advisory services to retail clients. This segment also provides savings and investments, retirement and pensions, and estate planning, as well as discretionary and advisory services to individuals, corporates, trusts, funds, and institutional clients. The Corporate Broking segment offers corporate finance, advisory, broking, research, market making, and fund raising services to small and mid-cap corporate clients. This segment also acts as nominated adviser to clients listed on the Alternative Investment Market and engages in the institutional sales and research business, which carries out stockbroking activities on behalf of companies, as well as conducting research into markets of interest to its clients. WH Ireland Group plc also serves corporate clients across technology, consumer, support services, healthcare, natural resources and industrials sectors. The company was founded in 1872 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC4R 0DR",
        "website": "http://www.whirelandplc.com",
        "market_cap": "Small Cap"
    }
}