{"012630.KS": {"short_name": "HDC HOLDINGS", "long_name": "HDC HOLDINGS CO.,Ltd", "summary": "HDC HOLDINGS CO.,Ltd engages in real estate development and construction activities in South Korea. Its portfolio includes high-rise buildings, roads, bridges, highways, ports, plants, small and medium-sized houses, commercial districts and parking lot sites, hotels, resorts, and shopping malls, as well as operates a duty-free shop. The company also offers facility management services, such as building management, cleaning, parking/security, and general affairs/clerical support; real estate asset management service, including operation, leasing, building management, and management consulting services; real estate big data services; and interior, remodeling, and landscaping services, as well as operates special care facility for the elderly people. Further, it is involved in the petrochemical business; production of precast concrete; manufacture of pianos; and operation of the professional football club. HDC HOLDINGS CO.,Ltd was founded in 1976 and is headquartered in Seoul, South Korea.", "currency": "KRW", "sector": "Financial Services", "industry": "Asset Management", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}, "030610.KS": {"short_name": "KYOBOSECURITIES", "long_name": "Kyobo Securities Co ., Ltd", "summary": "Kyobo Securities Co ., Ltd, a securities company, provides various financial services in South Korea. It provides project-related financial services, such as project financing, asset-backed financing, merger and acquisition, investment, and advisory services; corporate financial services; rights offering, issuance of mezzanine bonds that includes CB and RCPS, and initial public offering services; and various solutions for acquiring funds for companies. The company also offers financial solutions for funding of real estate development, local entities development, SOC development, green energy development, and other businesses; and brokerage services for online and offline futures products, including indices, foreign currencies, energy, interest rates, LME, and agriculture, as well as fixed income brokerage services for individuals, institutions, foundations, and corporates. In addition, it is involved in issuing, brokering, and managing of derivatives linked bond and securities, and structured securities; and trades in stocks and bonds. Further, the company acts as an intermediary for various finance products, such as stocks, futures, and options, as well as the institutional customers; and sells financial products. Additionally, it offers customer asset and risk management services. The company was formerly known as Daehan Securities Co., Ltd. and changed its name to Kyobo Securities Co ., Ltd in April 1994. The company was founded in 1949 and is headquartered in Seoul, South Korea. Kyobo Securities Co ., Ltd is a subsidiary of Kyobo Life Insurance Co., Ltd.", "currency": "KRW", "sector": "Financial Services", "industry": "Asset Management", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}, "033660.KS": {"short_name": "WOORI FINANCIAL CAPITAL CO LTD", "long_name": "AJU Capital Co., Ltd.", "summary": "AJU Capital Co., Ltd. engages in installment financing business in South Korea. It offers auto finance for new, used, lease, and rent cars; and credit and mortgage loans. The company was formerly known as Daewoo Capital Corporation and changed its name to AJU Capital Co., Ltd. in September 2009. AJU Capital Co., Ltd. was founded in 1994 and is headquartered in Daejeon, South Korea. As of December 10, 2020, AJU Capital Co., Ltd. operates as a subsidiary of Woori Financial Group Inc.", "currency": "KRW", "sector": "Financial Services", "industry": "Asset Management", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Daejeon"}}