{
    "006220.KS": {
        "short_name": "Jeju BK",
        "long_name": "Jeju Bank",
        "summary": "Jeju Bank Co., Ltd., a regional commercial bank, provides retail banking products and services in South Korea. It also provides credit card services. As of December 31, 2019, it operated through 38 branches. The company was founded in 1969 and is headquartered in Jeju-si, South Korea. Jeju Bank Co., Ltd. is a subsidiary of Shinhan Financial Group Co., Ltd.",
        "currency": "KRW",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Jeju-si",
        "zipcode": null,
        "website": "http://www.e-jejubank.com",
        "market_cap": "Micro Cap"
    },
    "010050.KS": {
        "short_name": "WIB",
        "long_name": "Woori Investment Bank Co., Ltd.",
        "summary": "Woori Investment Bank Co., Ltd. provides various financial products and services to corporate and individual customers in South Korea. The company offers investment and commercial banking products and services, including deposits, loans, foreign exchange, letters of credit, lease finance, and securities dealing, as well as investment banking services. It also provides short term and long-term loans, guarantee, and financing services; project and international finance; and M&A advisory services. In addition, the company offers financial products comprising CMA, issuance of bill, commercial papers, corporate bonds, beneficiary certificates, and repurchase agreements. It operates four branches located in Seoul, Gangnam, Gwangju, Mokpo, and Daejeon. The company was formerly known as Kumho Investment Bank and changed its name to Woori Investment Bank Co., Ltd. in October 2013. The company was founded in 1974 and is based in Seoul, South Korea. Woori Investment Bank Co., Ltd. is a subsidiary of Woori Financial Group Inc.",
        "currency": "KRW",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "04631",
        "website": "http://www.wooriib.com",
        "market_cap": "Small Cap"
    },
    "055550.KS": {
        "short_name": "ShinhanGroup",
        "long_name": "Shinhan Financial Group Co., Ltd.",
        "summary": "Shinhan Financial Group Co., Ltd. provides financial products and services in South Korea and internationally. The company operates through five segments: Commercial Banking Services, Credit Card Services, Securities Brokerage Services, Life Insurance Services, and Others. It offers retail banking services, including demand, savings, and fixed deposit-taking; checking accounts; mortgage and home equity, and retail lending; electronic banking and automatic teller machines (ATM); and bill paying, payroll and check-cashing, currency exchange, and wire fund transfer services. The company also provides corporate banking services, such as investment banking, real estate financing, overseas real estate and development project financing, infrastructure and structured financing, equity/venture investments, mergers and acquisitions consulting; securitization and derivatives services comprising securities and derivative products, and foreign exchange trading; and working capital loans and facilities loans. In addition, it is involved in treasury and investment activities in international capital markets consisting of foreign currency-denominated securities trading, foreign exchange trading and services, trade-related financial services, international factoring services, and foreign banking operations. Further, the company offers trust account management, securities brokerage, and asset management services, as well as leasing and equipment financing, savings banking, loan collection and credit reporting, collective investment administration, private equity investment, and financial system development services. As of December 31, 2020, it operated a network of 859 service centers; 5,472 ATMs; 12 cash dispensers; and 37 digital kiosks. Shinhan Financial Group Co., Ltd. was founded in 1982 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "04513",
        "website": "http://www.shinhangroup.com",
        "market_cap": "Large Cap"
    },
    "086790.KS": {
        "short_name": "HANAFINANCIALGR",
        "long_name": "Hana Financial Group Inc.",
        "summary": "Hana Financial Group Inc., through its subsidiaries, provides financial services in South Korea. The company engages in the commercial banking, trust banking, foreign exchange, and merchant banking; investment trading, brokerage, advisory, investment, and security investment trust services; and leasing, installment financing, and corporate and consumer loan businesses. It also provides real estate investment trust, life insurance, asset management and investment advisory, investment management, and loan services; property and liability insurance, reinsurance, and insurance payments; trust services for securities companies; and accounting and trust services for banks, pension funds, and other companies, as well as investments to venture firms and start-up companies. In addition, it develops and maintains software for the financial service industry. Hana Financial Group Inc. was founded in 1971 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "04538",
        "website": "http://www.hanafn.com",
        "market_cap": "Large Cap"
    },
    "138930.KS": {
        "short_name": "BNK Financial Group",
        "long_name": "BNK Financial Group Inc.",
        "summary": "BNK Financial Group Inc., together with its subsidiaries, provides various financial products and services. It accepts various deposit products; and provides foreign exchange, inquiry, trust, transfer, and card services, as well as loans. The company also provides personal credit facility, leasing/installment finance, business loan factoring, bill discounted, and auto loans; and currency/commodity futures and securities services. In addition, it operates as a venture asset management company; offers IT services, as well as debt collection and credit information services; and engages in the rental of cars, offices, and machinery. Further, the company provides specialized credit finance, investment brokerage and trading, savings bank, financial advisory and collective investment, credit investigation and collection agency, and start-up investment company advisory services, as well as develops and supplies system software. BNK Financial Group Inc. serves customers through a network of branches and representative offices in Korea and internationally. The company was formerly known as BS Financial Group Inc. and changed its name to BNK Financial Group Inc. in April 2015. BNK Financial Group Inc. was founded in 1967 and is headquartered in Busan, South Korea.",
        "currency": "KRW",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Busan",
        "zipcode": null,
        "website": "http://www.bnkfg.com",
        "market_cap": "Mid Cap"
    },
    "139130.KS": {
        "short_name": "DGB Financial Group",
        "long_name": "DGB Financial Group Co., Ltd.",
        "summary": "DGB Financial Group Co., Ltd. provides various banking products and services primarily in South Korea. The company offers deposit products; insurance policy loans; installment and automobile finance, corporate loans, personal loans, and new technology business finance, as well as leasing services; foreign exchange services; financial products comprising investment funds and bancassurance; and asset management and online banking services. It also provides investment trading, investment brokerage, discretionary investment, and investment advisory services; coverage, endowment, pension, and variable insurance products; electronic payment settlement agency services, as well as issues and manages electronic payment services; and claim collection, credit check, lease inspection, and civil complaint services. In addition, the company offers information system development, operation, maintenance, and integration services; IT consulting and related education services; and e-commerce and Internet related services, as well as sells, rents, and maintains information equipment and software. As of December 31, 2018, it operated through a network of 336 branches. DGB Financial Group Co., Ltd. was founded in 1967 and is based in Daegu, South Korea.",
        "currency": "KRW",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Daegu",
        "zipcode": null,
        "website": "http://www.dgbfg.co.kr",
        "market_cap": "Small Cap"
    },
    "316140.KS": {
        "short_name": "WooriFinancialGroup",
        "long_name": "Woori Financial Group Inc.",
        "summary": "Woori Financial Group Inc. engages in the banking, credit card, and investment banking businesses. It offers loans and deposits, and relevant services; credit card, cash services, card loans, and related services; and securities operation, sale of financial instruments, project financing, and other related activities. The company is also involved in the real estate, system software development and maintenance, financing, credit information, securities investment and others, asset securitization, and other service and credit financing businesses. It serves individual, business, and institutional customers. The company was founded in 1899 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.woorifg.com",
        "market_cap": "Mid Cap"
    },
    "KB": {
        "short_name": "KB Financial Group Inc",
        "long_name": "KB Financial Group Inc.",
        "summary": "KB Financial Group Inc. provides a range of banking and related financial services to consumers and corporations in South Korea and internationally. It operates through Corporate Banking, Retail Banking, Other Banking Services, Securities Business, Non-life Insurance Business, Credit Card Business, and Life Insurance Business segments. The company offers loans, deposit, and other related financial products and services to large, small, and medium-sized enterprises, as well as small and home office, and individuals and households; and engages in trading in securities and derivatives, funding, and other supporting activities. It also provides investment banking services, including financing and financial advisory services for mergers and acquisitions, real estate development projects, and social overhead capital projects, as well as securities underwriting and structured finance; brokerage and other supporting services; injuries, illnesses, long-term care, disabilities, accidents, property losses or other events, automobile, general property and casualty, and life insurance products; and credit sale, cash service, card loan, and other related services. In addition, the company offers foreign exchange transaction; financial investment; credit card and installment financing; financial leasing; real estate trust management; capital investment; collection of receivables or credit investigation; software advisory, development, and supply; investment advisory and securities dealing; claim; management; asset-backed securitization; investment trust; real estate trust management; general advisory; and trust account management services. KB Financial Group Inc. was incorporated in 2008 and is headquartered in Seoul, South Korea.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "07331",
        "website": "http://www.kbfg.com",
        "market_cap": "Large Cap"
    },
    "KBIA.F": {
        "short_name": "KB FINANCIAL ADR SW 5000",
        "long_name": "KB Financial Group Inc.",
        "summary": "KB Financial Group Inc. provides a range of banking and related financial services to consumers and corporations in South Korea and internationally. It operates through Corporate Banking, Retail Banking, Other Banking Services, Securities Business, Non-life Insurance Business, Credit Card Business, and Life Insurance Business segments. The company offers loans, deposit, and other related financial products and services to large, small, and medium-sized enterprises, as well as small and home office, and individuals and households; and engages in trading in securities and derivatives, funding, and other supporting activities. It also provides investment banking services, including financing and financial advisory services for mergers and acquisitions, real estate development projects, and social overhead capital projects, as well as securities underwriting and structured finance; brokerage and other supporting services; injuries, illnesses, long-term care, disabilities, accidents, property losses or other events, automobile, general property and casualty, and life insurance products; and credit sale, cash service, card loan, and other related services. In addition, the company offers foreign exchange transaction; financial investment; credit card and installment financing; financial leasing; real estate trust management; capital investment; collection of receivables or credit investigation; software advisory, development, and supply; investment advisory and securities dealing; claim; management; asset-backed securitization; investment trust; real estate trust management; general advisory; and trust account management services. KB Financial Group Inc. was incorporated in 2008 and is headquartered in Seoul, South Korea.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "07331",
        "website": "http://www.kbfg.com",
        "market_cap": "Large Cap"
    },
    "KSF1.F": {
        "short_name": "SHINHAN FINL ADR/1 SW5000",
        "long_name": "Shinhan Financial Group Co., Ltd.",
        "summary": "Shinhan Financial Group Co., Ltd. provides financial products and services in South Korea and internationally. The company operates through five segments: Commercial Banking Services, Credit Card Services, Securities Brokerage Services, Life Insurance Services, and Others. It offers retail banking services, including demand, savings, and fixed deposit-taking; checking accounts; mortgage and home equity, and retail lending; electronic banking and automatic teller machines (ATM); and bill paying, payroll and check-cashing, currency exchange, and wire fund transfer services. The company also provides corporate banking services, such as investment banking, real estate financing, overseas real estate and development project financing, infrastructure and structured financing, equity/venture investments, mergers and acquisitions consulting; securitization and derivatives services comprising securities and derivative products, and foreign exchange trading; and working capital loans and facilities loans. In addition, it is involved in treasury and investment activities in international capital markets consisting of foreign currency-denominated securities trading, foreign exchange trading and services, trade-related financial services, international factoring services, and foreign banking operations. Further, the company offers trust account management, securities brokerage, and asset management services, as well as leasing and equipment financing, savings banking, loan collection and credit reporting, collective investment administration, private equity investment, and financial system development services. As of December 31, 2020, it operated a network of 859 service centers; 5,472 ATMs; 12 cash dispensers; and 37 digital kiosks. Shinhan Financial Group Co., Ltd. was founded in 1982 and is headquartered in Seoul, South Korea.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "04513",
        "website": "http://www.shinhangroup.com",
        "market_cap": "Large Cap"
    },
    "SHG": {
        "short_name": "Shinhan Financial Group Co Ltd",
        "long_name": "Shinhan Financial Group Co., Ltd.",
        "summary": "Shinhan Financial Group Co., Ltd. provides financial products and services in South Korea and internationally. The company operates through five segments: Banking, Credit Card, Securities, Life Insurance, and Others. It offers retail banking services, including demand, savings, and fixed deposit-taking; checking accounts; mortgage and home equity, and retail lending; electronic banking and automatic teller machines (ATM); and bill paying, payroll and check-cashing, currency exchange, and wire fund transfer services. The company also provides corporate banking services, such as investment banking, real estate financing, overseas real estate and development project financing, infrastructure and structured financing, equity/venture investments, mergers and acquisitions consulting; securitization and derivatives services comprising securities and derivative products, and foreign exchange trading; and working capital loans and facilities loans. In addition, it is involved in treasury and investment activities in international capital markets consisting of foreign currency-denominated securities trading, foreign exchange trading and services, trade-related financial services, international factoring services, and foreign banking operations. Further, the company offers trust account management, securities brokerage, and asset management services, as well as leasing and equipment financing, savings banking, loan collection and credit reporting, collective investment administration, private equity investment, and financial system development services. As of December 31, 2020, it operated a network of 859 service centers; 5,472 ATMs; 12 cash dispensers; and 37 digital kiosks. Shinhan Financial Group Co., Ltd. was founded in 1982 and is headquartered in Seoul, South Korea.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "04513",
        "website": "http://www.shinhangroup.com",
        "market_cap": "Large Cap"
    },
    "WF": {
        "short_name": "Woori Financial Group Inc.",
        "long_name": "Woori Financial Group Inc.",
        "summary": "Woori Financial Group Inc., together with its subsidiaries, operates as a commercial bank that provides a range of financial services to individual, business, and institutional customers in South Korea. It operates through Banking, Credit Card, Investment Banking, and Others segments. The company offers savings, demand, installment, time deposits, and certificates of deposits; and working capital, facilities, general purpose household, mortgage, and home equity loans. It also offers debit and credit cards, cash services, card loans, and related services; lease and trade financing; and securities operation, sale of financial instruments, project financing, and other related activities. In addition, the company provides credit purchase, cash advance, foreign exchange services and dealing, import and export-related services, offshore lending, syndicated loans and foreign currency securities investment, investment trust products, bancassurance, and private equity funds. Further, it is involved in the real estate, system software development and maintenance, financing, credit information, securities investment and trading, derivatives trading, asset securitization, and other service and credit financing businesses. The company also offers automated telephone banking system, Internet, and mobile banking services. As of December 31, 2020, it served customers through a network of 821 branches and 4,531 ATMs. The company was founded in 1899 and is headquartered in Seoul, South Korea.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "04632",
        "website": "http://www.woorifg.com",
        "market_cap": "Mid Cap"
    }
}