{
  "42T.SI": {
    "city": "M.P. Misgav",
    "country": "Israel",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Asset Management",
    "long_name": "The Trendlines Group Ltd.",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "$ Trendlines",
    "state": null,
    "summary": "The Trendlines Group Ltd. is an innovation commercialization company and a private equity and venture capital firm specializing in incubation, seed, start-up, early venture and late venture investments. The firm seeks to invest in food, clean technology, agritechnology, lifesciences with a focus on medical devices, biotechnology, and pharmaceuticals, security, medical, and information technology companies. It considers investments in Israel and Singapore. The firm offers business incubation, partner and channel development, market strategies, business plans, research and development and commercialization activities, business development, finance and funding strategies, administrative services and marketing communications services to entrepreneurs. The firm seeks to invest a minimum of $0.06 million in its portfolio companies. The firm prefers to exit its investments through merger and acquisition transactions, listing on public stock exchanges, or other dispositions of holdings. It leverages its own capital with government funding to mitigate risk in creating and developing new businesses. It is involved in all aspects of its portfolio companies from technology development to business building. The Trendlines Group Ltd. was founded in 1993 and is based in M.P. Misgav, Israel with additional offices in Tel Aviv, Israel; Beijing, China; and Singapore, Singapore.",
    "website": "http://www.trendlines.com",
    "zipcode": "2017400"
  },
  "ANLT.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Asset Management",
    "long_name": "Analyst I.M.S. Investment Management Services Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "ANALYST INV MGT SV",
    "state": null,
    "summary": "Analyst I.M.S. Investment Management Services Ltd is a publicly owned investment manager. The firm provided its services to private clients, private and public corporations and institutional clients. Through its subsidiaries, the firm provides portfolio management, financial services consulting, trust funds with different specializations, fund management, underwriting services, and management and consulting services for its clients. Analyst I.M.S. Investment Management Services Ltd was founded in 1985 and is based in Tel Aviv, Israel.",
    "website": "http://www.analyst.co.il",
    "zipcode": "6688312"
  },
  "ASPF.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Asset Management",
    "long_name": "Altshuler Shaham Provident Funds and Pension Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "ALTSHULER SHAHM",
    "state": null,
    "summary": "Altshuler Shaham Provident Funds and Pension Ltd is a publicly owned investment manager. It invests in markets across the globe. The firm's investment strategies focus on long-term vision and maximizing asset potential over time. Altshuler Shaham Provident Funds and Pension Ltd was founded in 1990 and is based in Tel Aviv, Israel.",
    "website": "http://www.as-invest.co.il",
    "zipcode": "6971026"
  },
  "ATRY.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Capital Markets",
    "long_name": "Atreyu Capital Markets Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "ATREYU CAPITAL",
    "state": null,
    "summary": "Atreyu Capital Markets Ltd provides securities trading, investment banking, research, brokerage, and investment management services in Israel and internationally. The company's investment banking services include management, underwriting, consolidation, and consulting in securities offerings; public offerings, such as equity, convertible securities, and bonds; private offerings; and block distribution. It also operates brokerage desk that specializes in transactions in equity, domestic government and corporate bonds, structured products, and Eurobonds. In addition, the company provides securities trading services and financial instruments for local and international institutional investors; and micro and macro research services, including analysis of activities in various sectors of the economy and the operations of various companies that are traded on the Tel Aviv Stock Exchange. Atreyu Capital Markets Ltd serves various insurance companies; provident, pension, and mutual funds; and foreign investment houses that are active in Israel. The company was formerly known as Leader Capital Markets Ltd. and changed its name to Atreyu Capital Markets Ltd in January 2017. Atreyu Capital Markets Ltd was founded in 2001 and is based in Tel Aviv, Israel.",
    "website": "http://www.leadercm.co.il",
    "zipcode": "64739"
  },
  "AYAL.TA": {
    "city": "Ramat Gan",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Insurance - Diversified",
    "long_name": "Ayalon Holdings Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "AYALON HOLDINGS",
    "state": null,
    "summary": "Ayalon Holdings Ltd, through its subsidiaries, provides various insurance products in Israel. It offers health insurance products, including nursing, medical expenses, surgeries and transplants, dental, personal accident, travel, and medical insurance for foreign workers insurance; liability, property, vehicle, and professional liability insurance. The company also provides savings, pension, and provident fund products. The company serves its customers through a network of agents and agencies. Ayalon Holdings Ltd was founded in 1976 and is based in Ramat Gan, Israel.",
    "website": "http://www.ayalon-ins.co.il",
    "zipcode": "52008"
  },
  "BITCF": {
    "city": "Holon",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Capital Markets",
    "long_name": "First Bitcoin Capital Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "FIRST BITCOIN CAP CORP",
    "state": null,
    "summary": "First Bitcoin Capital Corp. engages in the business of digital cryptocurrency and blockchain development. The company owns and operates various digital assets, including First Bitcoin Incubator, which helps entrepreneurs with the fundraising, partnerships, networking, advice, and vetting needs to expand their businesses; 420WiFi that connects dispensaries to their clients in real time; CoinQX, a cryptocurrency exchange that offers traders the option of creating a digital wallet to begin trading; BitMiner, which manages bitcoin and other crypto-currency mining operations; ALT Coin Market Cap, an currency exchange; Bit Cann Pay that provides check cashing ATM's services to cannabis dispensaries; iCoinNews, an online news platform that gathers real time news about bitcoin and blockchain technology; and Kiosks, an automated check-cashing kiosks through BITCF locations in Northern California. It has agreements with third parties to develop blockchains to track petroleum and agricultural supply chain management. The company was formerly known as Grand Pacaraima Gold Corp. and changed its name to First Bitcoin Capital Corp. in February 2014. First Bitcoin Capital Corp. was founded in 1989 and is based in Holon, Israel.",
    "website": "http://firstbitcoin.io",
    "zipcode": "58492"
  },
  "BKHYY": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Banks - Regional",
    "long_name": "Bank Hapoalim B.M.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "BANK HAPOALIM B.M.",
    "state": null,
    "summary": "Bank Hapoalim B.M., together with its subsidiaries, provides various banking and financial products and services in Israel and internationally. The company offers account-management services, credits for various purposes, deposits, and savings plans, and capital-market activity; securities, and currencies and derivatives trading services; securities custody services; research, consulting, and advisory services; pension advisory and retirement planning services; and housing loans. It also provides credit for routine operations and investment financing, guarantees, letters of credit, foreign trade, and transactions in financial and derivative instruments, as well as investment services in various channels, such as foreign currency, shekels, securities, etc. In addition, the company offers financing for infrastructure project, foreign trade and international trade financing, and project financing services; foreign trade transactions and transactions in financial derivatives; and credit cards services. Further, it provides clearing of payment, asset management, investment portfolio management, investment banking, underwriting, and issuance management services. The company serves households, private-banking customers, foreign residents, small businesses, financial-asset managers, middle-market business clients, and large corporations through 189 branches, 619 external and 134 internal automatic teller machines, 138 external and 233 internal check-deposit machines, 32 information stations, 324 self-service stations, and 116 night safes. Bank Hapoalim B.M. was founded in 1921 and is based in Tel Aviv, Israel.",
    "website": "http://www.bankhapoalim.com",
    "zipcode": null
  },
  "BLMIF": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Banks - Regional",
    "long_name": "Bank Leumi le- Israel B.M.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "BANK LEUMI LE-ISRAEL BM",
    "state": null,
    "summary": "Bank Leumi le-Israel B.M., together with its subsidiaries, provides banking and financial services in Israel, the United States, the United Kingdom, Romania, and internationally. It operates through Households, Private Banking, Small and Micro Businesses, Mid-Sized Businesses, Corporate, Institutional Entities, and Financial Management segments. It provides housing loans, collateral loans, and loans to purchasing groups, including mortgage planning, accompanying the customer through the mortgage process, and recycling existing loans; and working capital, acquisitions, and term loans, as well as credit lines; financial support to Israeli high-tech companies; credit cards; and online banking services, as well as wealth and cash management services. The company also offers international trade financing, loan syndications and participations, foreign currency time deposits, and dealing room services. In addition, it provides provident funds, mutual funds, study funds, pension funds, and insurance products; invests in tradable securities, market-making activity involving securities and derivatives, repurchase and lending transactions involving securities, short selling of securities, and securities' underwriting services; engages in asset and liability management activities; and provides trust and custody services for banks. Further, the company engages in the activities, such as advisory services, sale and management of loan portfolios, and development of financial products. Additionally, it provides banking services to private customers and small businesses, largest and multinational corporations, and middle-market companies, as well as financial services to institutional customers and foreign banks. The company operates approximately 222 retail banking, 25 commercial banking, and 7 private banking branches. Bank Leumi le- Israel B.M. was founded in 1902 and is headquartered in Tel Aviv, Israel.",
    "website": "http://www.leumi.co.il",
    "zipcode": "65546"
  },
  "BLND.TA": {
    "city": "Ramat Gan",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Credit Services",
    "long_name": "Blender Financial Technologies Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "BLENDER FINANCE TE",
    "state": null,
    "summary": "Blender Financial Technologies Ltd. engages in the financial technology business in Israel and internationally. Blender Financial Technologies Ltd. was formerly known as V-Financial Technologies Ltd. and changed its name to Blender Financial Technologies Ltd. The company was incorporated in 2013 and is based in Ramat Gan, Israel.",
    "website": null,
    "zipcode": "5252007"
  },
  "CLIS.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Insurance - Diversified",
    "long_name": "Clal Insurance Enterprises Holdings Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "CLAL INSURANCE ENT",
    "state": null,
    "summary": "Clal Insurance Enterprises Holdings Ltd. provides insurance and financial services in Israel. It operates through three segments: Long-Term Savings, Non-Life insurance, and Health Insurance. The Long-Term Savings segment offers life insurance products, and pension and provident funds. The Non-Life Insurance segment provides property, fire, motor vehicle, and liability insurance for individual and business customers; third party, employers, product, professional, and directors and officers liability insurance products; and credit and foreign trade risk, apartment, and contract works insurance. The Health Insurance segment offers illness and hospitalization, travel, accidental death, accidental disability, and long term care insurance products to collectives and individual policyholders. Clal Insurance Enterprises Holdings Ltd. was founded in 1987 and is based in Tel Aviv, Israel.",
    "website": "http://www.clalbit.co.il",
    "zipcode": "6136902"
  },
  "CPTP.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Asset Management",
    "long_name": "Capital Point Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "CAPITAL POINT LTD",
    "state": null,
    "summary": "Capital Point Ltd. is a venture capital firm specializing in incubation financing and investments in early stage companies. It primarily seeks to invest in high-tech ventures primarily on medical devices, bio-technology, & environmental technologies. The firm typically seeks to invest in Israel. Capital Point Ltd. was founded in 2000 and is based in Tel Aviv, Israel.",
    "website": null,
    "zipcode": "6701101"
  },
  "DIFI.TA": {
    "city": "Petah Tikva",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Credit Services",
    "long_name": "Direct Finance of Direct Group (2006) Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "DIRECT FINANCE OF",
    "state": null,
    "summary": "Direct Finance of Direct Group (2006) Ltd. provides finance products in Israel. It offers personal loans, including car loans. The company is based in Petah Tikva, Israel.",
    "website": "http://www.5555.co.il",
    "zipcode": "4951132"
  },
  "DSCT.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Banks - Regional",
    "long_name": "Israel Discount Bank Limited",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "ISRAEL DISCOUNT BK",
    "state": null,
    "summary": "Israel Discount Bank Limited, together with its subsidiaries, provides various banking and financial services in Israel, Europe, and North America. The company operates through Retail Banking, Middle Market Banking, Corporate Banking, Financial Activity, Discount Capital, Discount Bancorp, Israel Credit Cards Company, and Other segments. Its personal banking services include checking accounts, deposits and savings, loans and credit facilities, mortgages, credit cards, capital market products, consulting services, family banking programs, and tax exemption services. The company also provides accounts, credit, funds, credit cards, and loans for small businesses; commercial business products for factories, workshops, service providers, and merchants; corporate, residential and commercial construction, infrastructure, and rental property financing; personal consulting services for corporations and executives in various fields of investment, inliquidity, and asset management; brokerage and trading services; customized services for diamond traders; and capital market consulting, including foreign trade, documentary collection and credit, foreign guarantee, export financing, online foreign trade, anti money laundering, and mutual fund services. In addition, it offers tools for capital market transactions; provides Israeli private banking, foreign currency, commercial payment, securities custody and execution, capital market advisory, international banking, portfolio management, and online and digital banking services; manages securities investment portfolios for private customers, corporations, not-for-profit organizations, and institutional bodies; and initiates and assists public offerings and private placements, as well as provides underwriting and distribution services. The company provides its products and services through approximately 177 branches. Israel Discount Bank Limited was incorporated in 1935 and is based in Tel Aviv, Israel.",
    "website": "http://www.discountbank.co.il",
    "zipcode": "6513601"
  },
  "ELDAV.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Asset Management",
    "long_name": "Eldav Investments Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "ELDAV INVESTMENTS",
    "state": null,
    "summary": "Eldav Investments Ltd. is a private equity firm specializing in buyout, mature, and acquisition of mid to large sized companies. It seeks to invest in industrial, service, finance and commercial companies. The firm invests internationally. It prefers to take majority stake in companies. Eldav Investments Ltd. was founded in 2007 and is based in Tel-Aviv, Israel.",
    "website": "http://www.eldav.co.il",
    "zipcode": "65202"
  },
  "EMDV.TA": {
    "city": "Ramat Gan",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Asset Management",
    "long_name": "Emilia Development (O.F.G) Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "EMILIA DEV (O.F.G)",
    "state": null,
    "summary": "Emilia Development (O.F.G) Ltd. manages a portfolio of investments in the industrial services, distribution, and logistics sectors. The company produces and distributes chemical and raw materials to a range of industries; and markets and distributes liquid flow solutions for industrial piping, housing and construction, valves, fire protection, infrastructure, control and automation, pumps, plumbing, and sanitation products. It also provides logistics solutions, including warehousing and transportation; and produces various consumer personal care and cosmetic products private labels of international chain stores and brands. The company was founded in 1945 and is based in Ramat Gan, Israel.",
    "website": "http://emilia.co.il",
    "zipcode": "526814"
  },
  "EXPO.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Banks - Regional",
    "long_name": "Export Investment Co. Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "EXPORT INVESTMENT",
    "state": null,
    "summary": "Export Investment Co. Ltd. operates as the holding company for Bank of Jerusalem that provides various commercial banking products and services in Israel. The company accepts various deposits, such as long-term or short-term deposits, savings plans, and checking accounts. Its loan products include loans, personal loans, foreign currency loans, and mortgages. The company also offers capital market services comprising trading, investment advisory, individual retirement account, and forex. It operates 18 branches. The company was incorporated in 1963 and is based in Tel Aviv, Israel.",
    "website": "http://www.bankjerusalem.co.il",
    "zipcode": null
  },
  "EZTD": {
    "city": "Tel-Aviv",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Capital Markets",
    "long_name": "EZTD Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "EZTD INC",
    "state": null,
    "summary": "EZTD Inc. engages in the online trading of binary options. The company operates an online trading platform for retail customers to trade a range of binary options in approximately 30 countries. The company was formerly known as EZTrader, Inc. and changed its name to EZTD Inc. in January 2015. EZTD Inc. was founded in 2001 and is based in Tel-Aviv, Israel.",
    "website": null,
    "zipcode": "6810298"
  },
  "FEAT-L.TA": {
    "city": null,
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Asset Management",
    "long_name": "Feat Fund Investments Limited Partnership",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "FEAT FUND INVESTME",
    "state": null,
    "summary": "Feat Fund Investments-Limited Partnership invests in hi-tech companies. The company is based in Israel.",
    "website": null,
    "zipcode": null
  },
  "FIBI.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Banks - Regional",
    "long_name": "First International Bank of Israel Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "FIRST INTER BK ISR",
    "state": null,
    "summary": "First International Bank of Israel Ltd. provides various financial and banking services to individuals, households, and businesses in Israel and Western Europe. It offers deposits and savings products, and structured deposits; mortgage services; credit cards; and private banking, mobile and online banking, investment advisory, securities trading, and foreign exchange services. The company also provides solutions for importers, exporters, and international transactions; financing of capital market operations; foreign currency investment management services; services in the areas of current account management, credit, investment advice, savings, pension advice, mortgages, and others; and financial derivatives, trading rooms, and various investment products. It operates approximately 160 branches. The company was incorporated in 1972 and is headquartered in Tel Aviv-Yafo, Israel.",
    "website": "http://online.fibi.co.il/wps/portal/FibiMenu/HomeEN",
    "zipcode": "6688310"
  },
  "FIBIH.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Banks - Regional",
    "long_name": "F.I.B.I. Holdings Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "F.I.B.I. HLDGS",
    "state": null,
    "summary": "F.I.B.I. Holdings Ltd operates as the holding company for The First International Bank of Israel Ltd. that provides various banking products and services in Israel and internationally. The company operates through three divisions: Corporate, Banking, and Customer Asset. It offers savings products, structured deposits, and long and short term deposits; mortgages and construction loans; housing loans; securities trading; investment advisory; foreign exchange and trading systems; working capital, equipment acquisition and other fixed assets financing, financing investments for the development and expansion of business; and financing for the acquisition of synergistic activities for the business, etc. The company also provides financial and banking guidance, and support for largest companies and corporations; business mentoring; consultancy services for investments and transactions; foreign currencies; credit cards; and solutions for capital markets and derivatives. In addition, it engages in the activity of borrowing complex credit areas, such as communication, diamonds, construction projects, and others; money market operations; and the management of market and liquidity risk management. It serves private banking customers, households, small businesses, and commercial customers; and private customers, business customers, institutional customers, and capital market professionals. As of December 31, 2019, the company operated 151 branches. F.I.B.I. Holdings Ltd was founded in 1972 and is based in Tel Aviv, Israel.",
    "website": "http://www.fibi.co.il",
    "zipcode": "6688310"
  },
  "GNRS.TA": {
    "city": "Herzliya",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Asset Management",
    "long_name": "Generation Capital Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "GENERATION CAPITAL",
    "state": null,
    "summary": "Generation Capital Ltd was founded in 2018 and is headquartered in Herzliya, Israel.",
    "website": null,
    "zipcode": "4672530"
  },
  "HARL.TA": {
    "city": "Ramat Gan",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Insurance - Diversified",
    "long_name": "Harel Insurance Investments & Financial Services Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "HAREL INS INVS",
    "state": null,
    "summary": "Harel Insurance Investments & Financial Services Ltd. provides insurance and financial services in Israel and internationally. It operates through five segments: Life Assurance and Long-Term Savings, Health Insurance, Non-life insurance, Insurance Companies Overseas, and Capital Market and Financial Services. The company offers various classes of life insurance products, which provide coverage for risks, such as death, disability, work disability, and critical illness; and long-term saving products, as well as manages pension and provident funds. It also provides health insurance that provides coverage for illness and hospitalization, and personal accident; travel insurance, insurance for foreign workers, and insurance for tourists; and dental insurance for conservative, periodontal, orthodontic, oral rehabilitation treatments, etc. In addition, it offers motor property insurance; mortgage insurance; credit insurance; professional liability insurance for tax advisors, portfolio managers, attorneys, engineers, architects, and accountants; insurance for clinical trials; directors and officers liability insurance; liability insurance for defective products; cyber insurance; and third-party liability insurance and employers' liability insurance. Further, it provides fire and theft, home, business premises, goods in transit, electronic equipment, and mechanical failure insurance, as well as insurance for building work and various projects by contractors. Additionally, the company manages mutual funds and exchange traded notes with a range of local and foreign stocks and bond indexes, as well as investment portfolios for private customers, corporations, and institutional customers; offers investment services, index-linked and deposit certificates on various currencies, and consulting services in foreign currency; and trades in securities. It also invests in real estate assets. The company was founded in 1933 and is based in Ramat Gan, Israel.",
    "website": "http://www.harel-group.co.il",
    "zipcode": null
  },
  "IACB": {
    "city": "Herzliya",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Shell Companies",
    "long_name": "ION Acquisition Corp 2 Ltd.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "ION Acquisition Corp 2 Ltd.",
    "state": null,
    "summary": "ION Acquisition Corp 2 Ltd. does not have significant operations. It intends to effect a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses or entities. The company was incorporated in 2020 and is based in Herzliya, Israel.",
    "website": "http://www.ion-am.com/spac2",
    "zipcode": "4676672"
  },
  "IACB-UN": {
    "city": "Herzliya",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Shell Companies",
    "long_name": "ION Acquisition Corp 2 Ltd.",
    "market": "us_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "ION Acquisition Corp 2 Ltd.",
    "state": null,
    "summary": "ION Acquisition Corp 2 Ltd. does not have significant operations. It intends to effect a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses or entities. The company was incorporated in 2020 and is based in Herzliya, Israel.",
    "website": "http://www.ion-am.com/spac2",
    "zipcode": "4676672"
  },
  "IACC": {
    "city": "Herzliya",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Shell Companies",
    "long_name": "ION Acquisition Corp 3 Ltd.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "ION Acquisition Corp 3 Ltd.",
    "state": null,
    "summary": "ION Acquisition Corp 3 Ltd. intends to effect a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses. The company was incorporated in 2021 and is based in Herzliya, Israel.",
    "website": null,
    "zipcode": "4676672"
  },
  "IBI.TA": {
    "city": "Tel-Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Financial Conglomerates",
    "long_name": "I.B.I Investment House Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "IBI INV HOUSE",
    "state": null,
    "summary": "I.B.I Investment House Ltd. is a publicly owned holding investment firm with approximately NIS 11 billion ($2.63 billion) in assets under management. The firm provides its services to individuals and institutional clients. Through its subsidiaries, it provides securities trading and brokerage, financial consultancy, and investment management services. The firm manages investment portfolios, mutual fund, underwriting services, provident funds, and investments. It was formerly known as Gachelet Investment Co. I.B.I Investment House Ltd. was founded in 1971 and is based in Tel Aviv, Israel.",
    "website": "http://www.ibi.co.il",
    "zipcode": null
  },
  "IDIN.TA": {
    "city": "Petah Tikva",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Insurance - Diversified",
    "long_name": "I.D.I. Insurance Company Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "I.D.I. INSURANCE",
    "state": null,
    "summary": "I.D.I. Insurance Company Ltd. provides insurance products and services to individuals and corporate customers in Israel. It offers life, health, personal accidents, business, car, home, travel, mortgage, and motorcycle insurance, as well as professional liability insurance for lawyers; and direct financing and savings plans. The company was founded in 2006 and is headquartered in Petah Tikva, Israel.",
    "website": "http://www.555.co.il",
    "zipcode": "4951132"
  },
  "INBR.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Capital Markets",
    "long_name": "Inbar Group Finance Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "INBAR GROUP FIN",
    "state": null,
    "summary": "Inbar Group Finance Ltd provides proprietary trading and distribution consulting services in Israel and internationally. The company trades in share indices; and invests in securities, including shares, corporate and government bonds, and other financial assets, as well as provides consulting and distribution services. It is also involved in the initiation and execution of private loans from various institutional entities and investment funds to a range of public and private companies in various fields. The company was formerly known as Itay Financial A.A Investments Ltd and changed its name to Inbar Group Finance Ltd in February 2018. Inbar Group Finance Ltd was founded in 1980 and is based in Tel Aviv, Israel.",
    "website": "http://www.inbar-group.com",
    "zipcode": "67137"
  },
  "ISCD.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Credit Services",
    "long_name": "Isracard Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "ISRACARD LTD",
    "state": null,
    "summary": "Isracard Ltd. operates as a credit card company in Israel. Its products include Anyway App, Anypay, Topcash, Touch-Pay, Garmin Pay, and Isracard application. The company offers loans and credit plans, as well as issues debit cards. It also provides discounting and clearing services for the debit card brands, such as Isracard, MasterCard, American Express, and Visa. The company was founded in 1975 and is based in Tel Aviv, Israel. Isracard Ltd.(TASE:ISCD) operates independently of Bank Hapoalim B.M. as of March 9, 2020.",
    "website": "http://digital.isracard.co.il",
    "zipcode": null
  },
  "ISDAY": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Banks - Regional",
    "long_name": "Israel Discount Bank Limited",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "ISRAEL DISCOUNT BANK",
    "state": null,
    "summary": "Israel Discount Bank Limited, together with its subsidiaries, provides various banking and financial services in Israel, Europe, and North America. The company operates through Retail Banking, Middle Market Banking, Corporate Banking, Financial Activity, Discount Capital, Discount Bancorp, Israel Credit Cards Company, and Other segments. Its personal banking services include checking accounts, deposits and savings, loans and credit facilities, mortgages, credit cards, capital market products, consulting services, family banking programs, and tax exemption services. The company also provides accounts, credit, funds, credit cards, and loans for small businesses; commercial business products for factories, workshops, service providers, and merchants; corporate, residential and commercial construction, infrastructure, and rental property financing; personal consulting services for corporations and executives in various fields of investment, inliquidity, and asset management; brokerage and trading services; customized services for diamond traders; and capital market consulting, including foreign trade, documentary collection and credit, foreign guarantee, export financing, online foreign trade, anti money laundering, and mutual fund services. In addition, it offers tools for capital market transactions; provides Israeli private banking, foreign currency, commercial payment, securities custody and execution, capital market advisory, international banking, portfolio management, and online and digital banking services; manages securities investment portfolios for private customers, corporations, not-for-profit organizations, and institutional bodies; and initiates and assists public offerings and private placements, as well as provides underwriting and distribution services. The company provides its products and services through approximately 177 branches. Israel Discount Bank Limited was incorporated in 1935 and is based in Tel Aviv, Israel.",
    "website": "http://www.discountbank.co.il",
    "zipcode": "6513601"
  },
  "JBNK.TA": {
    "city": "Jerusalem",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Banks - Regional",
    "long_name": "Bank of Jerusalem Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "BANK OF JERUSALEM",
    "state": null,
    "summary": "Bank of Jerusalem Ltd. provides commercial banking services in Israel. It offers deposit products, such as saving and checking accounts; structured, shekel, and foreign currency deposit products; loans that include personal loans, such as new and used car loans, and loans secured by deposits; and mortgage loans comprising foreign currency loans. The company also provides independent trading and investment advisory services, as well as interactive brokerage services. It operates through 18 branches. The company was formerly known as Bank of Jerusalem for Development and Mortgages Ltd. and changed its name to Bank of Jerusalem Ltd. in 1996. Bank of Jerusalem Ltd. was founded in 1963 and is headquartered in Jerusalem, Israel. Bank of Jerusalem Ltd. operates as a subsidiary of Export Investment Co. Ltd.",
    "website": "http://www.bankjerusalem.co.il",
    "zipcode": "92149"
  },
  "LUMI.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Banks - Regional",
    "long_name": "Bank Leumi le- Israel B.M.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "BK LEUMI LE ISRAEL",
    "state": null,
    "summary": "Bank Leumi le-Israel B.M., together with its subsidiaries, provides banking and financial services in Israel, the United States, the United Kingdom, Romania, and internationally. It operates through Households, Private Banking, Small and Micro Businesses, Mid-Sized Businesses, Corporate, Institutional Entities, and Financial Management segments. It provides housing loans, collateral loans, and loans to purchasing groups, including mortgage planning, accompanying the customer through the mortgage process, and recycling existing loans; and working capital, acquisitions, and term loans, as well as credit lines; financial support to Israeli high-tech companies; credit cards; and online banking services, as well as wealth and cash management services. The company also offers international trade financing, loan syndications and participations, foreign currency time deposits, and dealing room services. In addition, it provides provident funds, mutual funds, study funds, pension funds, and insurance products; invests in tradable securities, market-making activity involving securities and derivatives, repurchase and lending transactions involving securities, short selling of securities, and securities' underwriting services; engages in asset and liability management activities; and provides trust and custody services for banks. Further, the company engages in the activities, such as advisory services, sale and management of loan portfolios, and development of financial products. Additionally, it provides banking services to private customers and small businesses, largest and multinational corporations, and middle-market companies, as well as financial services to institutional customers and foreign banks. The company operates approximately 222 retail banking, 25 commercial banking, and 7 private banking branches. Bank Leumi le- Israel B.M. was founded in 1902 and is headquartered in Tel Aviv, Israel.",
    "website": "http://www.leumi.co.il",
    "zipcode": "65546"
  },
  "MCMN.TA": {
    "city": "Bnei Brak",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Credit Services",
    "long_name": "Michman Besd Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "MICHMAN BASAD LTD",
    "state": null,
    "summary": "MICHMAN BESD LTD engages in the provision of finance against the receipt of deferred credits written by third parties in favor of the company. It services credits with collaterals, including the encumbrance of real estate assets, vehicles, guarantees, tools, engineering equipment, etc. The company was incorporated in 2015 and is based in Bnei Brak, Israel.",
    "website": null,
    "zipcode": "5126237"
  },
  "MGDL.TA": {
    "city": "Petah Tikva",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Insurance - Life",
    "long_name": "Migdal Insurance and Financial Holdings Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "MIGDAL INS & FINAN",
    "state": null,
    "summary": "Migdal Insurance and Financial Holdings Ltd., together with its subsidiaries, provides insurance, pension, and financial services for private and corporate customers in Israel. The company deals and manages pension plans, life and health insurance products, pensions, and financial business plans; and provides personal accident and mortgage insurance solutions, and savings, as well as insurance agency services. It also markets investments; operates nostro accounts; and manages financial assets, including mutual funds and portfolios, as well as engages in the investment banking and distribution activities. The company was founded in 1934 and is based in Petah Tikva, Israel. Migdal Insurance and Financial Holdings Ltd. is a subsidiary of Eliahu 1959 Ltd.",
    "website": "http://www.migdal.co.il",
    "zipcode": null
  },
  "MISH.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Asset Management",
    "long_name": "Mivtach Shamir Holdings Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "MIVTACH SHAMIR HDS",
    "state": null,
    "summary": "Mivtach Shamir Holdings Ltd is a venture capital and private equity firm specializing in investments in companies that have encountered difficulties, with the aim of leading them to turnaround. It seeks to make investments in technology and communications; real-estate; and industrial companies. The firm is engaged in the rental of real estate and investment in companies in various fields. It also seeks to invest in India and Europe. Mivtach Shamir Holdings Ltd was founded in 1958 and is based in Tel Aviv, Israel.",
    "website": null,
    "zipcode": "6971039"
  },
  "MLRN.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Credit Services",
    "long_name": "M.L.R.N Projects and Trade Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "M.L.R.N PROJECTS",
    "state": null,
    "summary": "M.L.R.N Projects and Trade Ltd. provides credit to small and medium-sized businesses in Israel. It offers services for businesses, including business loans, check discounting, leasing to finance the purchase of equipment and tools, and financing for the purchase of real estate. The company was founded in 2008 and is based in Tel Aviv, Israel.",
    "website": "http://mlrn.co.il",
    "zipcode": null
  },
  "MMHD.TA": {
    "city": "Ramat Gan",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Insurance - Diversified",
    "long_name": "Menora Mivtachim Holdings Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "MENORA MIVTACHIM",
    "state": null,
    "summary": "Menora Mivtachim Holdings Ltd operates in insurance and finance sectors in Israel. The company offers life and health, and general insurance products, as well as automobile insurance products, such as compulsory automobile or property car insurance products; and pension and provident funds. It also engages in the mutual funds and portfolio management, securities underwriting, and real estate investment activities. The company was formerly known as General Liability Office Ltd. and changed its name to Menora Mivtachim Holdings Ltd in 2006. Menora Mivtachim Holdings Ltd was founded in 1935 and is based in Tel Aviv, Israel.",
    "website": "http://www.menoramivt.co.il",
    "zipcode": "5251102"
  },
  "MNIF.TA": {
    "city": "Ramat Gan",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Credit Services",
    "long_name": "Menif Financial Services, Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "MENIF FINANCIAL",
    "state": null,
    "summary": "Menif Financial Services, Ltd. provides mezzanine financing for equity to promoters and contractors in the construction sector in Israel and internationally. The company was founded in 1999 and is based in Ramat Gan, Israel.",
    "website": "http://menif.co.il",
    "zipcode": "52511"
  },
  "MRIN.TA": {
    "city": "Ramat Gan",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Asset Management",
    "long_name": "Y.D. More Investments Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "Y.D. MORE INVST",
    "state": null,
    "summary": "Y.D. More Investments Ltd engages in the investment management business in Israel. It manages investment portfolios, mutual funds, provident funds, study funds, alternative investments, and foreign securities. The company was founded in 2006 and is based in Ramat Gan, Israel.",
    "website": "http://www.moreinvest.co.il",
    "zipcode": "52573"
  },
  "MTDS.TA": {
    "city": "Bnei Brak",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Asset Management",
    "long_name": "Meitav DASH Investments Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "MEITAV DASH INV",
    "state": null,
    "summary": "Meitav DS Investments Ltd is a publicly owned investment manager. The firm provides its services to private, business and institutional clients. It engages in the fund management activities in Israel. The firm manages investment portfolios, mutual funds, and provident funds, as well as pension, education, and other purpose funds. It also manages separate client-focused portfolios. Meitav DS Investments Ltd was formerly known as DS Apex Holdings Ltd. and changed its name in July 2013. Meitav DS Investments Ltd is based in Tel Aviv, Israel.",
    "website": null,
    "zipcode": "5112302"
  },
  "MTLK": {
    "city": "Bnei Brak",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Shell Companies",
    "long_name": "Metalink Ltd.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "METALINK",
    "state": null,
    "summary": "Metalink Ltd. does not have significant operations. The company intends to consider strategic alternatives, such as a possible business combination; other strategic transaction with a domestic or foreign, and private or public operating entity; a going private transaction; and voluntary liquidation. Previously, it marketed and sold DSL chipsets used by the manufacturers of telecommunications equipment. Metalink Ltd. was incorporated in 1992 and is based in Bnei Brak, Israel.",
    "website": null,
    "zipcode": null
  },
  "MYDS.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Asset Management",
    "long_name": "Mydas Real Estate Investments Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "MYDAS REAL ESTATE",
    "state": null,
    "summary": "Mydas Real Estate Investmens Ltd, formerly known as Mydas Investment Fund Ltd., owns and operates retirement homes and hotels. Mydas Investment Fund Ltd. was formerly known as Spancrete (1990) Ltd. Mydas Real Estate Investmens Ltd is based in Soreq Valley, Israel.",
    "website": null,
    "zipcode": null
  },
  "MZTF.TA": {
    "city": "Ramat Gan",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Banks - Regional",
    "long_name": "Mizrahi Tefahot Bank Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "MIZRAHI TEFAHOT BK",
    "state": null,
    "summary": "Mizrahi Tefahot Bank Ltd., together with its subsidiaries, provides a range of international, commercial, domestic, and personal banking services to individuals and businesses in Israel, Switzerland, and internationally. It operates through six segments: Household, Small Business, Private Banking, Commercial Banking, Business Banking, and Financial Management. The company offers checking, savings, and deposits accounts; and provides loans, such as instant, home renovation, car, all-purpose, student, and business, as well as mortgages, credit cards, and guarantees. It also provides foreign trade services, including import, export, and documentary credit; transactions in foreign currency, which include trading in derivative instruments, factoring services, and investments in deposits and securities; financing of real estate and construction projects; mergers and acquisitions services; and private and online banking services. In addition, the company offers capital market services, including consultancy for capital market activities, distribution of mutual funds, management of securities portfolios for clients, pension advisory service, trust services, provision of registration services; and operates provident funds and insurance incidental to mortgages, as well as engages in credit operations and participates in syndication deals. As of December 31, 2020, it operated through a network of 232 branches and business centers in Israel; and 3 bank affiliates. The company was formerly known as United Mizrahi Bank Limited and changed its name to Mizrahi Tefahot Bank Ltd. in November 2005. Mizrahi Tefahot Bank Ltd. was incorporated in 1923 and is headquartered in Ramat Gan, Israel.",
    "website": "http://www.mizrahi-tefahot.co.il",
    "zipcode": "5252007"
  },
  "NAWI.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Credit Services",
    "long_name": "Nawi Brothers Group Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "NAWI BROTHERS GROU",
    "state": null,
    "summary": "Nawi Brothers Group Ltd provides finance and non-bank credit services in Israel. The company's services include real estate initiative financing and completion of equity, import/suppliers financing, credit insurance for companies and businesses, financing for companies and businesses, equipment financing, financing against commercial checks, and bridging loans. Its customers cover corporations, companies, partnerships, licensed dealers, and businessmen in various industries. The company was formerly known as Golden Equity Holdings Ltd. and changed its name to Nawi Brothers Group Ltd in January 2011. Nawi Brothers Group Ltd was incorporated in 1984 and is based in Tel Aviv, Israel.",
    "website": "http://www.nawibros.com",
    "zipcode": null
  },
  "OPAL.TA": {
    "city": "Ashdod",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Capital Markets",
    "long_name": "Opal Balance Investments Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "OPAL BALANCE INV",
    "state": null,
    "summary": "Opal Balance Investments Ltd provides various financing solutions in Israel. The company offers financing solutions, such as commercial checks discounts, financing and guarantee against credit checks, completion of entrepreneurs equity, forex services, and money transfer services to importers and exporters. It also provides digital messenger services and terminals. The company was founded in 2006 and is based in Ashdod, Israel.",
    "website": "http://www.opalbalance.co.il",
    "zipcode": null
  },
  "P55.F": {
    "city": "Haifa",
    "country": "Israel",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Capital Markets",
    "long_name": "Plus500 Ltd.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "PLUS500 LTD.  LS -,01",
    "state": null,
    "summary": "Plus500 Ltd. develops and operates an online and mobile trading platform for individual customers to trade contracts for difference (CFDs). The company's online trading and mobile platform allows its customers to trade CFDs on approximately 2,500 underlying financial instruments, including equities, indices, commodities, options, exchange-traded funds, cryptocurrencies, shares, and foreign exchange in approximately 50 countries in 32 languages. Its trading platform is accessible from various operating systems, such as Windows, iOS, Android, and Surface, as well as web browsers. The company was formerly known as Investsoft Ltd. and changed its name to Plus500 Ltd. in June 2012. Plus500 Ltd. was incorporated in 2008 and is headquartered in Haifa, Israel.",
    "website": "http://www.plus500.com",
    "zipcode": "31905"
  },
  "PEN.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Credit Services",
    "long_name": "Peninsula Group Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "PENINSULA GROUP",
    "state": null,
    "summary": "Peninsula Group Ltd provides credit to small and medium-sized businesses in Israel. It serves customers in various fields, including industry, manufacturing, commerce, import, distribution, construction, infrastructure, retail, and services. The company was founded in 2004 and is based in Tel Aviv, Israel.",
    "website": "http://www.peninsula.co.il",
    "zipcode": null
  },
  "PHOE.TA": {
    "city": "Givatayim",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Insurance - Diversified",
    "long_name": "The Phoenix Holdings Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "PHOENIX HLDGS LTD",
    "state": null,
    "summary": "The Phoenix Holdings Ltd provides various insurance products in Israel. The company offers life, death, disability and work disability, health, nursing, critical illness, LTC, personal accident, long-term care, medical expense, surgeries and transplant, dental, car, travel, flight cancellation, mortgage, home, marine and air, business, professional liability, directors' and officers' liability, and pet insurance products. It also provides financial services comprising investment management service for mutual funds and ETNs, brokerage service, underwriting service, market-making service, and other services; and offers pension, education, and provident funds, as well as other savings products. The company was formerly known as The Israel Phoenix Assurance Company Limited. The Phoenix Holdings Ltd was founded in 1949 and is based in Givatayim, Israel.",
    "website": "http://www.fnx.co.il",
    "zipcode": null
  },
  "PIU.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Capital Markets",
    "long_name": "Poalim I.B.I.-Managing & Underwriting Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "POALIM I.B.I",
    "state": null,
    "summary": "Poalim IBI - Management and Underwriting Ltd. operates as an investment banking company. The company underwrites and manages public offerings on the TASE; manages and implements debt offerings through private placement of corporate bonds with institutional investors; and manages and implements private placements for equity and convertible bonds with institutional and other investors. It also offers investment banking services, including M&A transactions, reorganization, locating strategic investors, and financing acquisitions and investments. The company is based in Tel Aviv, Israel.",
    "website": "http://www.eldav.co.il/poalim_ibi.htm",
    "zipcode": "6525101"
  },
  "PLUS.L": {
    "city": "Haifa",
    "country": "Israel",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Capital Markets",
    "long_name": "Plus500 Ltd.",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "PLUS500 LTD ORD ILS0.01 (DI)",
    "state": null,
    "summary": "Plus500 Ltd. develops and operates an online and mobile trading platform for individual customers to trade contracts for difference (CFDs). The company's online trading and mobile platform allows its customers to trade CFDs on approximately 2,500 underlying financial instruments, including equities, indices, commodities, options, exchange-traded funds, cryptocurrencies, shares, and foreign exchange in approximately 50 countries in 32 languages. Its trading platform is accessible from various operating systems, such as Windows, iOS, Android, and Surface, as well as web browsers. The company was formerly known as Investsoft Ltd. and changed its name to Plus500 Ltd. in June 2012. Plus500 Ltd. was incorporated in 2008 and is headquartered in Haifa, Israel.",
    "website": "http://www.plus500.com",
    "zipcode": "31905"
  },
  "POLI.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Banks - Regional",
    "long_name": "Bank Hapoalim B.M.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "BANK HAPOALIM B.M.",
    "state": null,
    "summary": "Bank Hapoalim B.M., together with its subsidiaries, provides various banking and financial products and services in Israel and internationally. The company offers account-management services, credits for various purposes, deposits, and savings plans, and capital-market activity; securities, and currencies and derivatives trading services; securities custody services; research, consulting, and advisory services; pension advisory and retirement planning services; and housing loans. It also provides credit for routine operations and investment financing, guarantees, letters of credit, foreign trade, and transactions in financial and derivative instruments, as well as investment services in various channels, such as foreign currency, shekels, securities, etc. In addition, the company offers financing for infrastructure project, foreign trade and international trade financing, and project financing services; foreign trade transactions and transactions in financial derivatives; and credit cards services. Further, it provides clearing of payment, asset management, investment portfolio management, investment banking, underwriting, and issuance management services. The company serves households, private-banking customers, foreign residents, small businesses, financial-asset managers, middle-market business clients, and large corporations through 189 branches, 619 external and 134 internal automatic teller machines, 138 external and 233 internal check-deposit machines, 32 information stations, 324 self-service stations, and 116 night safes. Bank Hapoalim B.M. was founded in 1921 and is based in Tel Aviv, Israel.",
    "website": "http://www.bankhapoalim.com",
    "zipcode": null
  },
  "SPRG.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Asset Management",
    "long_name": "Spring Ventures Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "SPRING VENTURES",
    "state": null,
    "summary": "Spring Ventures Ltd. Is a venture capital firm specializes in Seed stage, Series A stage and early stage investments. It typically invests in deep technology, SaaS with focus on business to business SaaS based models. It invests in private and public enterprises and companies primarily in the technology sector in Israel and internationally. The company develops technological tools, applications, and other properties in the internet and technology sectors, as well as invests in securities traded in Nasdaq Stock Exchange. It also provides management services in the electronic commerce sector. The company was formerly known as buy2 networks Ltd. and changed its name to Spring Ventures Ltd. in November 2016. Spring Ventures Ltd. was incorporated in 1999 and is based in Tel Aviv, Israel with an additional office in New York, New York.",
    "website": "http://www.springv.com",
    "zipcode": "6789139"
  },
  "SRAC.TA": {
    "city": "Ramla",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Financial Conglomerates",
    "long_name": "S.R. Accord Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "S.R ACCORD LTD",
    "state": null,
    "summary": "S.R. Accord Ltd. provides credit and non-bank financing services to small and medium-sized businesses in Israel. The company offers direct financing in the forms of loans; and financing against discounting checks and bills, as well as repayments against the provision of adequate collateral. The company was formerly known as Shrem Fudim Group Ltd. and changed its name to S.R. Accord Ltd. in December 2010. S.R. Accord Ltd. was founded in 1991 and is headquartered in Ramla, Israel.",
    "website": "http://www.sr-accord.com",
    "zipcode": "7243224"
  },
  "STEC.TA": {
    "city": "Tel Aviv-Yafo",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Asset Management",
    "long_name": "Shure-Tech Investments - Limited Partnership",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": null,
    "state": null,
    "summary": "Shure-Tech Investments - Limited Partnership engages in investment business. It focuses on investments in the fields of insurance and finance technologies. The company is based in Tel Aviv-Yafo, Israel.",
    "website": null,
    "zipcode": "6578405"
  },
  "TASE.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Financial Data & Stock Exchanges",
    "long_name": "The Tel-Aviv Stock Exchange Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "TEL AVIV STOCK EXC",
    "state": null,
    "summary": "The Tel-Aviv Stock Exchange Ltd. manages securities stock exchange and related activities in Israel. The company offers a range of securities and derivative instruments, including shares, corporate bonds, government bonds, treasury bills, ETFs, convertible securities, single stock options, options, and futures. It also operates Tel Aviv Continuous Trading, an automated system for continuous and simultaneous trading that allows the members to send purchase and sale orders continuously and in real time. In addition, the company engages in the clearing and settlement of securities and services; issuing of options and futures; and holding of securities for others. The Tel-Aviv Stock Exchange Ltd. was founded in 1935 and is headquartered in Tel Aviv, Israel.",
    "website": "http://www.tase.co.il",
    "zipcode": "6525216"
  },
  "TIKRF": {
    "city": "Hadera",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Shell Companies",
    "long_name": "Tikcro Technologies Ltd.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "TIKCRO TECHNOLOGIES LTD",
    "state": null,
    "summary": "Tikcro Technologies Ltd. focuses on development of biotechnology project in Israel. It offers anti-cytotoxic T-lymphocyte-associated protein 4 for cancer immune treatment. The company was formerly known as Tioga Technologies Ltd. and changed its name to Tikcro Technologies Ltd. in September 2003. Tikcro Technologies Ltd. was founded in 1999 and is headquartered in Hadera, Israel.",
    "website": "http://www.tikcro.com",
    "zipcode": "3842247"
  },
  "TNPV.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Asset Management",
    "long_name": "TechnoPlus Ventures Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "TECHNOPLUS VENTURE",
    "state": null,
    "summary": "TechnoPlus Ventures Ltd. is a venture capital and a private equity firm specializing in investments in middle market, mature, later stage companies, turnarounds, and mezzanine financing in small to medium growing companies. The firm primarily invests in technology companies with unique technological capabilities backed with patnet or Know How. It typically invests in companies based in Israel and the United States. The firms prefers to invest between $0.5 million and $2 million in companies with revenue between $5 million and $20 million and positive cash flow. It seeks to hold its investments for one year to three years and exits through an initial public offering or merger and acquisition. It invests using its personal capital. The firm also seeks to co-invest. TechnoPlus Ventures Ltd. was founded in 1997 and is based in Tel Aviv, Israel.",
    "website": "http://www.technoplusvc.com",
    "zipcode": "67023"
  },
  "TRNLY": {
    "city": "M.P. Misgav",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Asset Management",
    "long_name": "The Trendlines Group Ltd.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "THE TRENDLINES GROUP LTD.",
    "state": null,
    "summary": "The Trendlines Group Ltd. is an innovation commercialization company and a private equity and venture capital firm specializing in incubation, seed, start-up, early venture and late venture investments. The firm seeks to invest in food, clean technology, agritechnology, lifesciences with a focus on medical devices, biotechnology, and pharmaceuticals, security, medical, and information technology companies. It considers investments in Israel and Singapore. The firm offers business incubation, partner and channel development, market strategies, business plans, research and development and commercialization activities, business development, finance and funding strategies, administrative services and marketing communications services to entrepreneurs. The firm seeks to invest a minimum of $0.06 million in its portfolio companies. The firm prefers to exit its investments through merger and acquisition transactions, listing on public stock exchanges, or other dispositions of holdings. It leverages its own capital with government funding to mitigate risk in creating and developing new businesses. It is involved in all aspects of its portfolio companies from technology development to business building. The Trendlines Group Ltd. was founded in 1993 and is based in M.P. Misgav, Israel with additional offices in Tel Aviv, Israel; Beijing, China; and Singapore, Singapore.",
    "website": "http://www.trendlines.com",
    "zipcode": "2017400"
  },
  "TUZA.TA": {
    "city": "Haifa",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Asset Management",
    "long_name": "Teuza - A Fairchild Technology Venture Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "TEUZA",
    "state": null,
    "summary": "Teuza - A Fairchild Technology Venture Ltd. specializes in expansion capital and mezzanine investments. The fund prefers to invest in seed stage, start ups, early stage, mid venture, late venture, and middle market companies. It seeks to invest in semiconductors, software enterprise and information technology software, healthcare, electronics, medical equipment and devices, biotechnology, telecommunications, and communications. The fund prefers to invest in companies based in Israel, China, Canada, and United States of America. It seeks to invest $1 million to $2 million per investment. The fund prefers to invest in equity for a 25 percent to 49 percent stake in its portfolio companies; taking membership on the Board of Directors of its portfolio companies; and exits its investments through an IPO or an M&A transaction.",
    "website": "http://www.teuza.co.il",
    "zipcode": "31250"
  },
  "VALU.TA": {
    "city": "Herzliya",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Capital Markets",
    "long_name": "Value Capital One Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "VALUE CAPITAL ONE",
    "state": null,
    "summary": "Value Capital One Ltd provides check discounting services to small and medium-sized businesses in Israel. The company was formerly known as P.L.T. Financial Services Ltd and changed its name to Value Capital One Ltd in August 2020. Value Capital One Ltd was founded in 1960 and is based in Herzliya, Israel.",
    "website": "http://www.plt-finance.co.il/he/",
    "zipcode": null
  },
  "WESR.TA": {
    "city": "Kefar Sava",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Insurance - Property & Casualty",
    "long_name": "Wesure Global Tech Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "WESURE GLOBAL TECH",
    "state": null,
    "summary": "Wesure Global Tech Ltd operates as a digital insurance company. It offers third party car, structure and contents, building, mortgage, and comprehensive insurance products. The company was founded in 2016 and is based in Kefar Sava, Israel.",
    "website": null,
    "zipcode": "4427125"
  },
  "XENA.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Asset Management",
    "long_name": "Xenia Venture Capital Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "XENIA VENTURE",
    "state": null,
    "summary": "Xenia Venture Capital Ltd is a venture capital firm specializing in seed, startups, early stage, and incubation investments. The firm prefers to invest in the high and medium technology sector with a focus on information technology, software (including enterprise IT, gaming, Internet, and mobile etc.), bio-tech, life science, and medical devices. It typically invests in companies based in Israel. The firm typically invests between $0.5 million and $1 million in seed financing. It also seeks to provide follow-on financing, mentoring, business and strategic counseling, fund raising assistance and exit planning as well as peripheral services pertaining to logistics, finance & accounting, office services and more. Xenia Venture Capital Ltd was founded in mid-2003 and is based in Tel Aviv, Israel.",
    "website": "http://www.xenia.co.il",
    "zipcode": null
  },
  "ZUR.TA": {
    "city": "Petah Tikva",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Insurance - Property & Casualty",
    "long_name": "Zur Shamir Holdings Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "ZUR SHAMIR HOLD",
    "state": null,
    "summary": "Zur Shamir Holdings Ltd., through its subsidiaries, operates in the insurance, consumer credit, and real estate markets in Israel. The company was formerly known as Zur and changed to its name to Zur Shamir Holdings Ltd. in February 1997. Zur Shamir Holdings Ltd. was founded in 1957 and is based in Petah Tikva, Israel.",
    "website": "http://www.zur-shamir.com",
    "zipcode": "4951132"
  }
}
