{
    "BKHYY": {
        "short_name": "BANK HAPOALIM B.M.",
        "long_name": "Bank Hapoalim B.M.",
        "summary": "Bank Hapoalim B.M., together with its subsidiaries, provides various banking and financial products and services in Israel and internationally. The company offers account-management services, credits for various purposes, deposits, and savings plans, and capital-market activity; securities, and currencies and derivatives trading services; securities custody services; research, consulting, and advisory services; pension advisory and retirement planning services; and housing loans. It also provides credit for routine operations and investment financing, guarantees, letters of credit, foreign trade, and transactions in financial and derivative instruments, as well as investment services in various channels, such as foreign currency, shekels, securities, etc. In addition, the company offers financing for infrastructure project, foreign trade and international trade financing, and project financing services; foreign trade transactions and transactions in financial derivatives; and credit cards services. Further, it provides clearing of payment, asset management, investment portfolio management, investment banking, underwriting, and issuance management services. The company serves households, private-banking customers, foreign residents, small businesses, financial-asset managers, middle-market business clients, and large corporations through 189 branches, 619 external and 134 internal automatic teller machines, 138 external and 233 internal check-deposit machines, 32 information stations, 324 self-service stations, and 116 night safes. Bank Hapoalim B.M. was founded in 1921 and is based in Tel Aviv, Israel.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": null,
        "website": "http://www.bankhapoalim.com",
        "market_cap": 11441808384
    },
    "BLMIF": {
        "short_name": "BANK LEUMI LE-ISRAEL BM",
        "long_name": "Bank Leumi le- Israel B.M.",
        "summary": "Bank Leumi le-Israel B.M., together with its subsidiaries, provides banking and financial services in Israel, the United States, the United Kingdom, Romania, and internationally. It operates through Households, Private Banking, Small and Micro Businesses, Mid-Sized Businesses, Corporate, Institutional Entities, and Financial Management segments. It provides housing loans, collateral loans, and loans to purchasing groups, including mortgage planning, accompanying the customer through the mortgage process, and recycling existing loans; and working capital, acquisitions, and term loans, as well as credit lines; financial support to Israeli high-tech companies; credit cards; and online banking services, as well as wealth and cash management services. The company also offers international trade financing, loan syndications and participations, foreign currency time deposits, and dealing room services. In addition, it provides provident funds, mutual funds, study funds, pension funds, and insurance products; invests in tradable securities, market-making activity involving securities and derivatives, repurchase and lending transactions involving securities, short selling of securities, and securities' underwriting services; engages in asset and liability management activities; and provides trust and custody services for banks. Further, the company engages in the activities, such as advisory services, sale and management of loan portfolios, and development of financial products. Additionally, it provides banking services to private customers and small businesses, largest and multinational corporations, and middle-market companies, as well as financial services to institutional customers and foreign banks. The company operates approximately 222 retail banking, 25 commercial banking, and 7 private banking branches. Bank Leumi le- Israel B.M. was founded in 1902 and is headquartered in Tel Aviv, Israel.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "65546",
        "website": "http://www.leumi.co.il",
        "market_cap": 11077516288
    },
    "DSCT.TA": {
        "short_name": "ISRAEL DISCOUNT BK",
        "long_name": "Israel Discount Bank Limited",
        "summary": "Israel Discount Bank Limited, together with its subsidiaries, provides various banking and financial services in Israel, Europe, and North America. The company operates through Retail Banking, Middle Market Banking, Corporate Banking, Financial Activity, Discount Capital, Discount Bancorp, Israel Credit Cards Company, and Other segments. Its personal banking services include checking accounts, deposits and savings, loans and credit facilities, mortgages, credit cards, capital market products, consulting services, family banking programs, and tax exemption services. The company also provides accounts, credit, funds, credit cards, and loans for small businesses; commercial business products for factories, workshops, service providers, and merchants; corporate, residential and commercial construction, infrastructure, and rental property financing; personal consulting services for corporations and executives in various fields of investment, inliquidity, and asset management; brokerage and trading services; customized services for diamond traders; and capital market consulting, including foreign trade, documentary collection and credit, foreign guarantee, export financing, online foreign trade, anti money laundering, and mutual fund services. In addition, it offers tools for capital market transactions; provides Israeli private banking, foreign currency, commercial payment, securities custody and execution, capital market advisory, international banking, portfolio management, and online and digital banking services; manages securities investment portfolios for private customers, corporations, not-for-profit organizations, and institutional bodies; and initiates and assists public offerings and private placements, as well as provides underwriting and distribution services. The company provides its products and services through approximately 177 branches. Israel Discount Bank Limited was incorporated in 1935 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "6513601",
        "website": "http://www.discountbank.co.il",
        "market_cap": 15637045248
    },
    "EXPO.TA": {
        "short_name": "EXPORT INVESTMENT",
        "long_name": "Export Investment Co. Ltd.",
        "summary": "Export Investment Co. Ltd. operates as the holding company for Bank of Jerusalem that provides various commercial banking products and services in Israel. The company accepts various deposits, such as long-term or short-term deposits, savings plans, and checking accounts. Its loan products include loans, personal loans, foreign currency loans, and mortgages. The company also offers capital market services comprising trading, investment advisory, individual retirement account, and forex. It operates 18 branches. The company was incorporated in 1963 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": null,
        "website": "http://www.bankjerusalem.co.il",
        "market_cap": 312176800
    },
    "FIBI.TA": {
        "short_name": "FIRST INTER BK ISR",
        "long_name": "First International Bank of Israel Ltd",
        "summary": "First International Bank of Israel Ltd. provides various financial and banking services to individuals, households, and businesses in Israel and Western Europe. It offers deposits and savings products, and structured deposits; mortgage services; credit cards; and private banking, mobile and online banking, investment advisory, securities trading, and foreign exchange services. The company also provides solutions for importers, exporters, and international transactions; financing of capital market operations; foreign currency investment management services; services in the areas of current account management, credit, investment advice, savings, pension advice, mortgages, and others; and financial derivatives, trading rooms, and various investment products. It operates approximately 160 branches. The company was incorporated in 1972 and is headquartered in Tel Aviv-Yafo, Israel.",
        "currency": "ILA",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "6688310",
        "website": "http://online.fibi.co.il/wps/portal/FibiMenu/HomeEN",
        "market_cap": 10665078784
    },
    "FIBIH.TA": {
        "short_name": "F.I.B.I. HLDGS",
        "long_name": "F.I.B.I. Holdings Ltd",
        "summary": "F.I.B.I. Holdings Ltd operates as the holding company for The First International Bank of Israel Ltd. that provides various banking products and services in Israel and internationally. The company operates through three divisions: Corporate, Banking, and Customer Asset. It offers savings products, structured deposits, and long and short term deposits; mortgages and construction loans; housing loans; securities trading; investment advisory; foreign exchange and trading systems; working capital, equipment acquisition and other fixed assets financing, financing investments for the development and expansion of business; and financing for the acquisition of synergistic activities for the business, etc. The company also provides financial and banking guidance, and support for largest companies and corporations; business mentoring; consultancy services for investments and transactions; foreign currencies; credit cards; and solutions for capital markets and derivatives. In addition, it engages in the activity of borrowing complex credit areas, such as communication, diamonds, construction projects, and others; money market operations; and the management of market and liquidity risk management. It serves private banking customers, households, small businesses, and commercial customers; and private customers, business customers, institutional customers, and capital market professionals. As of December 31, 2019, the company operated 151 branches. F.I.B.I. Holdings Ltd was founded in 1972 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "6688310",
        "website": "http://www.fibi.co.il",
        "market_cap": 4243676160
    },
    "ISDAY": {
        "short_name": "ISRAEL DISCOUNT BANK",
        "long_name": "Israel Discount Bank Limited",
        "summary": "Israel Discount Bank Limited, together with its subsidiaries, provides various banking and financial services in Israel, Europe, and North America. The company operates through Retail Banking, Middle Market Banking, Corporate Banking, Financial Activity, Discount Capital, Discount Bancorp, Israel Credit Cards Company, and Other segments. Its personal banking services include checking accounts, deposits and savings, loans and credit facilities, mortgages, credit cards, capital market products, consulting services, family banking programs, and tax exemption services. The company also provides accounts, credit, funds, credit cards, and loans for small businesses; commercial business products for factories, workshops, service providers, and merchants; corporate, residential and commercial construction, infrastructure, and rental property financing; personal consulting services for corporations and executives in various fields of investment, inliquidity, and asset management; brokerage and trading services; customized services for diamond traders; and capital market consulting, including foreign trade, documentary collection and credit, foreign guarantee, export financing, online foreign trade, anti money laundering, and mutual fund services. In addition, it offers tools for capital market transactions; provides Israeli private banking, foreign currency, commercial payment, securities custody and execution, capital market advisory, international banking, portfolio management, and online and digital banking services; manages securities investment portfolios for private customers, corporations, not-for-profit organizations, and institutional bodies; and initiates and assists public offerings and private placements, as well as provides underwriting and distribution services. The company provides its products and services through approximately 177 branches. Israel Discount Bank Limited was incorporated in 1935 and is based in Tel Aviv, Israel.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "6513601",
        "website": "http://www.discountbank.co.il",
        "market_cap": 4785854464
    },
    "JBNK.TA": {
        "short_name": "BANK OF JERUSALEM",
        "long_name": "Bank of Jerusalem Ltd.",
        "summary": "Bank of Jerusalem Ltd. provides commercial banking services in Israel. It offers deposit products, such as saving and checking accounts; structured, shekel, and foreign currency deposit products; loans that include personal loans, such as new and used car loans, and loans secured by deposits; and mortgage loans comprising foreign currency loans. The company also provides independent trading and investment advisory services, as well as interactive brokerage services. It operates through 18 branches. The company was formerly known as Bank of Jerusalem for Development and Mortgages Ltd. and changed its name to Bank of Jerusalem Ltd. in 1996. Bank of Jerusalem Ltd. was founded in 1963 and is headquartered in Jerusalem, Israel. Bank of Jerusalem Ltd. operates as a subsidiary of Export Investment Co. Ltd.",
        "currency": "ILA",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Jerusalem",
        "zipcode": "92149",
        "website": "http://www.bankjerusalem.co.il",
        "market_cap": 764411840
    },
    "LUMI.TA": {
        "short_name": "BK LEUMI LE ISRAEL",
        "long_name": "Bank Leumi le- Israel B.M.",
        "summary": "Bank Leumi le-Israel B.M., together with its subsidiaries, provides banking and financial services in Israel, the United States, the United Kingdom, Romania, and internationally. It operates through Households, Private Banking, Small and Micro Businesses, Mid-Sized Businesses, Corporate, Institutional Entities, and Financial Management segments. It provides housing loans, collateral loans, and loans to purchasing groups, including mortgage planning, accompanying the customer through the mortgage process, and recycling existing loans; and working capital, acquisitions, and term loans, as well as credit lines; financial support to Israeli high-tech companies; credit cards; and online banking services, as well as wealth and cash management services. The company also offers international trade financing, loan syndications and participations, foreign currency time deposits, and dealing room services. In addition, it provides provident funds, mutual funds, study funds, pension funds, and insurance products; invests in tradable securities, market-making activity involving securities and derivatives, repurchase and lending transactions involving securities, short selling of securities, and securities' underwriting services; engages in asset and liability management activities; and provides trust and custody services for banks. Further, the company engages in the activities, such as advisory services, sale and management of loan portfolios, and development of financial products. Additionally, it provides banking services to private customers and small businesses, largest and multinational corporations, and middle-market companies, as well as financial services to institutional customers and foreign banks. The company operates approximately 222 retail banking, 25 commercial banking, and 7 private banking branches. Bank Leumi le- Israel B.M. was founded in 1902 and is headquartered in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "65546",
        "website": "http://www.leumi.co.il",
        "market_cap": 36758368256
    },
    "MZTF.TA": {
        "short_name": "MIZRAHI TEFAHOT BK",
        "long_name": "Mizrahi Tefahot Bank Ltd.",
        "summary": "Mizrahi Tefahot Bank Ltd., together with its subsidiaries, provides a range of international, commercial, domestic, and personal banking services to individuals and businesses in Israel, Switzerland, and internationally. It operates through six segments: Household, Small Business, Private Banking, Commercial Banking, Business Banking, and Financial Management. The company offers checking, savings, and deposits accounts; and provides loans, such as instant, home renovation, car, all-purpose, student, and business, as well as mortgages, credit cards, and guarantees. It also provides foreign trade services, including import, export, and documentary credit; transactions in foreign currency, which include trading in derivative instruments, factoring services, and investments in deposits and securities; financing of real estate and construction projects; mergers and acquisitions services; and private and online banking services. In addition, the company offers capital market services, including consultancy for capital market activities, distribution of mutual funds, management of securities portfolios for clients, pension advisory service, trust services, provision of registration services; and operates provident funds and insurance incidental to mortgages, as well as engages in credit operations and participates in syndication deals. As of December 31, 2020, it operated through a network of 232 branches and business centers in Israel; and 3 bank affiliates. The company was formerly known as United Mizrahi Bank Limited and changed its name to Mizrahi Tefahot Bank Ltd. in November 2005. Mizrahi Tefahot Bank Ltd. was incorporated in 1923 and is headquartered in Ramat Gan, Israel.",
        "currency": "ILA",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Ramat Gan",
        "zipcode": "5252007",
        "website": "http://www.mizrahi-tefahot.co.il",
        "market_cap": 26263166976
    },
    "POLI.TA": {
        "short_name": "BANK HAPOALIM B.M.",
        "long_name": "Bank Hapoalim B.M.",
        "summary": "Bank Hapoalim B.M., together with its subsidiaries, provides various banking and financial products and services in Israel and internationally. The company offers account-management services, credits for various purposes, deposits, and savings plans, and capital-market activity; securities, and currencies and derivatives trading services; securities custody services; research, consulting, and advisory services; pension advisory and retirement planning services; and housing loans. It also provides credit for routine operations and investment financing, guarantees, letters of credit, foreign trade, and transactions in financial and derivative instruments, as well as investment services in various channels, such as foreign currency, shekels, securities, etc. In addition, the company offers financing for infrastructure project, foreign trade and international trade financing, and project financing services; foreign trade transactions and transactions in financial derivatives; and credit cards services. Further, it provides clearing of payment, asset management, investment portfolio management, investment banking, underwriting, and issuance management services. The company serves households, private-banking customers, foreign residents, small businesses, financial-asset managers, middle-market business clients, and large corporations through 189 branches, 619 external and 134 internal automatic teller machines, 138 external and 233 internal check-deposit machines, 32 information stations, 324 self-service stations, and 116 night safes. Bank Hapoalim B.M. was founded in 1921 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": null,
        "website": "http://www.bankhapoalim.com",
        "market_cap": 35455315968
    }
}