{
  "ATRY.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Capital Markets",
    "long_name": "Atreyu Capital Markets Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "ATREYU CAPITAL",
    "state": null,
    "summary": "Atreyu Capital Markets Ltd provides securities trading, investment banking, research, brokerage, and investment management services in Israel and internationally. The company's investment banking services include management, underwriting, consolidation, and consulting in securities offerings; public offerings, such as equity, convertible securities, and bonds; private offerings; and block distribution. It also operates brokerage desk that specializes in transactions in equity, domestic government and corporate bonds, structured products, and Eurobonds. In addition, the company provides securities trading services and financial instruments for local and international institutional investors; and micro and macro research services, including analysis of activities in various sectors of the economy and the operations of various companies that are traded on the Tel Aviv Stock Exchange. Atreyu Capital Markets Ltd serves various insurance companies; provident, pension, and mutual funds; and foreign investment houses that are active in Israel. The company was formerly known as Leader Capital Markets Ltd. and changed its name to Atreyu Capital Markets Ltd in January 2017. Atreyu Capital Markets Ltd was founded in 2001 and is based in Tel Aviv, Israel.",
    "website": "http://www.leadercm.co.il",
    "zipcode": "64739"
  },
  "BITCF": {
    "city": "Holon",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Capital Markets",
    "long_name": "First Bitcoin Capital Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "FIRST BITCOIN CAP CORP",
    "state": null,
    "summary": "First Bitcoin Capital Corp. engages in the business of digital cryptocurrency and blockchain development. The company owns and operates various digital assets, including First Bitcoin Incubator, which helps entrepreneurs with the fundraising, partnerships, networking, advice, and vetting needs to expand their businesses; 420WiFi that connects dispensaries to their clients in real time; CoinQX, a cryptocurrency exchange that offers traders the option of creating a digital wallet to begin trading; BitMiner, which manages bitcoin and other crypto-currency mining operations; ALT Coin Market Cap, an currency exchange; Bit Cann Pay that provides check cashing ATM's services to cannabis dispensaries; iCoinNews, an online news platform that gathers real time news about bitcoin and blockchain technology; and Kiosks, an automated check-cashing kiosks through BITCF locations in Northern California. It has agreements with third parties to develop blockchains to track petroleum and agricultural supply chain management. The company was formerly known as Grand Pacaraima Gold Corp. and changed its name to First Bitcoin Capital Corp. in February 2014. First Bitcoin Capital Corp. was founded in 1989 and is based in Holon, Israel.",
    "website": "http://firstbitcoin.io",
    "zipcode": "58492"
  },
  "EZTD": {
    "city": "Tel-Aviv",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Capital Markets",
    "long_name": "EZTD Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "EZTD INC",
    "state": null,
    "summary": "EZTD Inc. engages in the online trading of binary options. The company operates an online trading platform for retail customers to trade a range of binary options in approximately 30 countries. The company was formerly known as EZTrader, Inc. and changed its name to EZTD Inc. in January 2015. EZTD Inc. was founded in 2001 and is based in Tel-Aviv, Israel.",
    "website": null,
    "zipcode": "6810298"
  },
  "INBR.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Capital Markets",
    "long_name": "Inbar Group Finance Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "INBAR GROUP FIN",
    "state": null,
    "summary": "Inbar Group Finance Ltd provides proprietary trading and distribution consulting services in Israel and internationally. The company trades in share indices; and invests in securities, including shares, corporate and government bonds, and other financial assets, as well as provides consulting and distribution services. It is also involved in the initiation and execution of private loans from various institutional entities and investment funds to a range of public and private companies in various fields. The company was formerly known as Itay Financial A.A Investments Ltd and changed its name to Inbar Group Finance Ltd in February 2018. Inbar Group Finance Ltd was founded in 1980 and is based in Tel Aviv, Israel.",
    "website": "http://www.inbar-group.com",
    "zipcode": "67137"
  },
  "OPAL.TA": {
    "city": "Ashdod",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Capital Markets",
    "long_name": "Opal Balance Investments Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "OPAL BALANCE INV",
    "state": null,
    "summary": "Opal Balance Investments Ltd provides various financing solutions in Israel. The company offers financing solutions, such as commercial checks discounts, financing and guarantee against credit checks, completion of entrepreneurs equity, forex services, and money transfer services to importers and exporters. It also provides digital messenger services and terminals. The company was founded in 2006 and is based in Ashdod, Israel.",
    "website": "http://www.opalbalance.co.il",
    "zipcode": null
  },
  "P55.F": {
    "city": "Haifa",
    "country": "Israel",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Capital Markets",
    "long_name": "Plus500 Ltd.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "PLUS500 LTD.  LS -,01",
    "state": null,
    "summary": "Plus500 Ltd. develops and operates an online and mobile trading platform for individual customers to trade contracts for difference (CFDs). The company's online trading and mobile platform allows its customers to trade CFDs on approximately 2,500 underlying financial instruments, including equities, indices, commodities, options, exchange-traded funds, cryptocurrencies, shares, and foreign exchange in approximately 50 countries in 32 languages. Its trading platform is accessible from various operating systems, such as Windows, iOS, Android, and Surface, as well as web browsers. The company was formerly known as Investsoft Ltd. and changed its name to Plus500 Ltd. in June 2012. Plus500 Ltd. was incorporated in 2008 and is headquartered in Haifa, Israel.",
    "website": "http://www.plus500.com",
    "zipcode": "31905"
  },
  "PIU.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Capital Markets",
    "long_name": "Poalim I.B.I.-Managing & Underwriting Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "POALIM I.B.I",
    "state": null,
    "summary": "Poalim IBI - Management and Underwriting Ltd. operates as an investment banking company. The company underwrites and manages public offerings on the TASE; manages and implements debt offerings through private placement of corporate bonds with institutional investors; and manages and implements private placements for equity and convertible bonds with institutional and other investors. It also offers investment banking services, including M&A transactions, reorganization, locating strategic investors, and financing acquisitions and investments. The company is based in Tel Aviv, Israel.",
    "website": "http://www.eldav.co.il/poalim_ibi.htm",
    "zipcode": "6525101"
  },
  "PLUS.L": {
    "city": "Haifa",
    "country": "Israel",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Capital Markets",
    "long_name": "Plus500 Ltd.",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "PLUS500 LTD ORD ILS0.01 (DI)",
    "state": null,
    "summary": "Plus500 Ltd. develops and operates an online and mobile trading platform for individual customers to trade contracts for difference (CFDs). The company's online trading and mobile platform allows its customers to trade CFDs on approximately 2,500 underlying financial instruments, including equities, indices, commodities, options, exchange-traded funds, cryptocurrencies, shares, and foreign exchange in approximately 50 countries in 32 languages. Its trading platform is accessible from various operating systems, such as Windows, iOS, Android, and Surface, as well as web browsers. The company was formerly known as Investsoft Ltd. and changed its name to Plus500 Ltd. in June 2012. Plus500 Ltd. was incorporated in 2008 and is headquartered in Haifa, Israel.",
    "website": "http://www.plus500.com",
    "zipcode": "31905"
  },
  "VALU.TA": {
    "city": "Herzliya",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Capital Markets",
    "long_name": "Value Capital One Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "VALUE CAPITAL ONE",
    "state": null,
    "summary": "Value Capital One Ltd provides check discounting services to small and medium-sized businesses in Israel. The company was formerly known as P.L.T. Financial Services Ltd and changed its name to Value Capital One Ltd in August 2020. Value Capital One Ltd was founded in 1960 and is based in Herzliya, Israel.",
    "website": "http://www.plt-finance.co.il/he/",
    "zipcode": null
  }
}
