{
  "AYAL.TA": {
    "city": "Ramat Gan",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Insurance - Diversified",
    "long_name": "Ayalon Holdings Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "AYALON HOLDINGS",
    "state": null,
    "summary": "Ayalon Holdings Ltd, through its subsidiaries, provides various insurance products in Israel. It offers health insurance products, including nursing, medical expenses, surgeries and transplants, dental, personal accident, travel, and medical insurance for foreign workers insurance; liability, property, vehicle, and professional liability insurance. The company also provides savings, pension, and provident fund products. The company serves its customers through a network of agents and agencies. Ayalon Holdings Ltd was founded in 1976 and is based in Ramat Gan, Israel.",
    "website": "http://www.ayalon-ins.co.il",
    "zipcode": "52008"
  },
  "CLIS.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Insurance - Diversified",
    "long_name": "Clal Insurance Enterprises Holdings Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "CLAL INSURANCE ENT",
    "state": null,
    "summary": "Clal Insurance Enterprises Holdings Ltd. provides insurance and financial services in Israel. It operates through three segments: Long-Term Savings, Non-Life insurance, and Health Insurance. The Long-Term Savings segment offers life insurance products, and pension and provident funds. The Non-Life Insurance segment provides property, fire, motor vehicle, and liability insurance for individual and business customers; third party, employers, product, professional, and directors and officers liability insurance products; and credit and foreign trade risk, apartment, and contract works insurance. The Health Insurance segment offers illness and hospitalization, travel, accidental death, accidental disability, and long term care insurance products to collectives and individual policyholders. Clal Insurance Enterprises Holdings Ltd. was founded in 1987 and is based in Tel Aviv, Israel.",
    "website": "http://www.clalbit.co.il",
    "zipcode": "6136902"
  },
  "HARL.TA": {
    "city": "Ramat Gan",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Insurance - Diversified",
    "long_name": "Harel Insurance Investments & Financial Services Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "HAREL INS INVS",
    "state": null,
    "summary": "Harel Insurance Investments & Financial Services Ltd. provides insurance and financial services in Israel and internationally. It operates through five segments: Life Assurance and Long-Term Savings, Health Insurance, Non-life insurance, Insurance Companies Overseas, and Capital Market and Financial Services. The company offers various classes of life insurance products, which provide coverage for risks, such as death, disability, work disability, and critical illness; and long-term saving products, as well as manages pension and provident funds. It also provides health insurance that provides coverage for illness and hospitalization, and personal accident; travel insurance, insurance for foreign workers, and insurance for tourists; and dental insurance for conservative, periodontal, orthodontic, oral rehabilitation treatments, etc. In addition, it offers motor property insurance; mortgage insurance; credit insurance; professional liability insurance for tax advisors, portfolio managers, attorneys, engineers, architects, and accountants; insurance for clinical trials; directors and officers liability insurance; liability insurance for defective products; cyber insurance; and third-party liability insurance and employers' liability insurance. Further, it provides fire and theft, home, business premises, goods in transit, electronic equipment, and mechanical failure insurance, as well as insurance for building work and various projects by contractors. Additionally, the company manages mutual funds and exchange traded notes with a range of local and foreign stocks and bond indexes, as well as investment portfolios for private customers, corporations, and institutional customers; offers investment services, index-linked and deposit certificates on various currencies, and consulting services in foreign currency; and trades in securities. It also invests in real estate assets. The company was founded in 1933 and is based in Ramat Gan, Israel.",
    "website": "http://www.harel-group.co.il",
    "zipcode": null
  },
  "IDIN.TA": {
    "city": "Petah Tikva",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Insurance - Diversified",
    "long_name": "I.D.I. Insurance Company Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "I.D.I. INSURANCE",
    "state": null,
    "summary": "I.D.I. Insurance Company Ltd. provides insurance products and services to individuals and corporate customers in Israel. It offers life, health, personal accidents, business, car, home, travel, mortgage, and motorcycle insurance, as well as professional liability insurance for lawyers; and direct financing and savings plans. The company was founded in 2006 and is headquartered in Petah Tikva, Israel.",
    "website": "http://www.555.co.il",
    "zipcode": "4951132"
  },
  "MMHD.TA": {
    "city": "Ramat Gan",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Insurance - Diversified",
    "long_name": "Menora Mivtachim Holdings Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "MENORA MIVTACHIM",
    "state": null,
    "summary": "Menora Mivtachim Holdings Ltd operates in insurance and finance sectors in Israel. The company offers life and health, and general insurance products, as well as automobile insurance products, such as compulsory automobile or property car insurance products; and pension and provident funds. It also engages in the mutual funds and portfolio management, securities underwriting, and real estate investment activities. The company was formerly known as General Liability Office Ltd. and changed its name to Menora Mivtachim Holdings Ltd in 2006. Menora Mivtachim Holdings Ltd was founded in 1935 and is based in Tel Aviv, Israel.",
    "website": "http://www.menoramivt.co.il",
    "zipcode": "5251102"
  },
  "PHOE.TA": {
    "city": "Givatayim",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Insurance - Diversified",
    "long_name": "The Phoenix Holdings Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "PHOENIX HLDGS LTD",
    "state": null,
    "summary": "The Phoenix Holdings Ltd provides various insurance products in Israel. The company offers life, death, disability and work disability, health, nursing, critical illness, LTC, personal accident, long-term care, medical expense, surgeries and transplant, dental, car, travel, flight cancellation, mortgage, home, marine and air, business, professional liability, directors' and officers' liability, and pet insurance products. It also provides financial services comprising investment management service for mutual funds and ETNs, brokerage service, underwriting service, market-making service, and other services; and offers pension, education, and provident funds, as well as other savings products. The company was formerly known as The Israel Phoenix Assurance Company Limited. The Phoenix Holdings Ltd was founded in 1949 and is based in Givatayim, Israel.",
    "website": "http://www.fnx.co.il",
    "zipcode": null
  }
}
