{
    "MLCON.MX": {
        "short_name": "MELCO RESORTS AND ENTERTAINMENT",
        "long_name": "Melco Resorts & Entertainment Limited",
        "summary": "Melco Resorts & Entertainment Limited develops, owns, and operates casino gaming and resort facilities in Asia and Europe. It owns and operates City of Dreams, an integrated casino resort that has approximately 516 gaming tables and 822 gaming machines; approximately 2,170 hotel rooms, and suites and villas; a wet stage performance theater with approximately 2,000 seats; approximately 25 restaurants and bars, and 165 retail outlets; and health and fitness clubs, three swimming pools, spa and salons, and banquet and meeting facilities. The company also operates Altira Macau, a casino hotel, which has approximately 97 gaming tables and 110 gaming machines; 230 hotel rooms; various dining and casual restaurants, and recreation and leisure facilities; and various non-gaming amenities comprising a spa, gymnasium, outdoor garden podium, and sky terrace lounge. In addition, it operates Studio City, a cinematically-themed integrated entertainment, retail, and gaming resort that comprises 293 gaming tables and 947 gaming machines in Cotai, Macau. Further, the company owns and operates eight Mocha Clubs with 1,478 gaming machines, as well as Grand Dragon casino in Taipa Island, Macau. Additionally, it operates and manages City of Dreams Manila, a casino, hotel, retail, and entertainment integrated resort in the Entertainment City complex in Manila. The company was formerly known as Melco Crown Entertainment Limited and changed its name to Melco Resorts & Entertainment Limited in April 2017. The company was incorporated in 2004 and is headquartered in Central, Hong Kong. Melco Resorts & Entertainment Limited is a subsidiary of Melco Leisure and Entertainment Group Limited.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Resorts & Casinos",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.melco-resorts.com",
        "market_cap": "Small Cap"
    }
}