{
    "1108.TW": {
        "short_name": "LUCKY CEMENT CO.",
        "long_name": "Lucky Cement Corporation",
        "summary": "Lucky Cement Corporation, together with its subsidiaries, manufactures and sells cement in the People's Republic of China. The company offers Portland cement, ready mix concrete, hot cement, low-alkali Portland cement, slag powder, limestone, specification stones, and gravels, as well as ashes. It also engages in construction business; and provides shipping agent and transportation services. In addition, the company is involved in the sale and lease of residential and commercial buildings, parking lots, and industrial areas; and investment, cement trading, and gravel mining businesses. Lucky Cement Corporation was founded in 1974 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.luckygrp.com.tw",
        "market_cap": 5524673536
    },
    "1301.TW": {
        "short_name": "FORMOSA PLASTIC",
        "long_name": "Formosa Plastics Corporation",
        "summary": "Formosa Plastics Corporation produces and sells intermediate raw materials for plastics in Taiwan, Mainland China, and internationally. Its plastic products include PVC resins, high density polyethylene resins, linear low density polyethylene resins, ethylene vinyl acetate copolymer resins, PE wax, polypropylene (PP), polyoxymethylene, and PP or PE-based masterbatches. The company also provides chemicals, such as liquid caustic soda, caustic soda solid, liquid chlorine, vinyl chloride monomers, ethylene dichloride, acrylonitrile, acetonitrile, methyl methacrylate, methacrylic acid, epichlorohydrin, methyl tertiary butyl ether, acrylic acid and esters, SAP chemicals, and n-butanol; and petrochemical products. In addition, it offers carbon fibers; electronic products comprising distributed control systems, WMS, real-time production management systems, SCS-2000, and laboratory information management systems; and other products, including processing aids, methyl methacrylate-butadiene-styrene, sodium hypochlorite, chlorinated solvents, hydrogen, lithium-ion battery electrolytes, lime, calcium carbonate, and hydrochloric acid. The company provides its products for use in various applications, such as household items, outdoor sports, mechanical engineering, building materials coatings, 3C appliances, civil farm animals, and other applications. Formosa Plastics Corporation was founded in 1954 and is headquartered in Kaohsiung City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "814",
        "website": "http://www.fpc.com.tw",
        "market_cap": 665219825664
    },
    "1303.TW": {
        "short_name": "NAN YA PLASTIC",
        "long_name": "Nan Ya Plastics Corporation",
        "summary": "Nan Ya Plastics Corporation manufactures and sells plastics products, plastic materials, petrochemicals, electronic materials, and polyester fiber products in Taiwan, China and Hong Kong, the United States, and internationally. It provides plastics products comprising PP synthetic papers, adhesives, optical films, outdoor and interior decoration materials, synthetic leather, TPU films, PU resins, fire rated doors, windows, plastic pallets, PVC cling films, PE stretch films, engineering and PVC compounds, unsaturated polyester, pipes and fittings, rigid sheets, A-PET sheets/rigid films, PVC sheets, PP sheets, and injection molding products, as well as decoration, window, and PET films. The company also offers electronic materials, including copper clad laminates, glass fabrics, liquid crystal display products, touch panels, copper foils, and PCB inks. In addition, it provides chemicals, such as phthalate plasticizers; phthalic anhydride; alcohols; glycols; curing agents; hydrogen peroxide; tetrahydrofuran; 1,4-butanediol; bisphenol-A; maleic anhydride; epoxidized soybean oil; stabilizer; liquefied gas; and epoxy resin. Further, the company provides fiber and textile products, such as draw textured yarns, spin drawn yarns, partially and fully oriented yarns, polyester staple fibers, PET resins, polyester films, polyester release films, and woven and knitting fabrics. Additionally, it offers machinery and switchgear products, including HV/LV switchgears, cast resin transformers, vacuum contactor switches, molds, rollers, and screws and barrels. The company was founded in 1958 and is headquartered in Kaohsiung City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "814",
        "website": "http://www.npc.com.tw",
        "market_cap": 640810287104
    },
    "1309.TW": {
        "short_name": "TAITA CHEMICAL",
        "long_name": "Taita Chemical Company, Limited",
        "summary": "Taita Chemical Company, Ltd. produces and sells styrenics in Taiwan. The company offers acrylonitrile-butadiene-styrene resin, a terpolymer plastic under the TAITALAC brand; general purpose and high impact polystyrene under the TAITAREX brand name for use in food containers, CD cases, stationary, toys, insulation boards, business machines, electric and electrical appliances, and consumer goods; and expandable polystyrene resins under the TAITACELL brand name. It also provides glass wool materials; and engages in cubic printing, a process for applying decorative pattern to 3-dimensional products in various applications, including auto parts, home electronic appliances, IT products, home decoration, sport goods, stationery and gifts, and others. The company exports its products worldwide. Taita Chemical Company, Ltd. was founded in 1960 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.ttc.com.tw",
        "market_cap": 14509337600
    },
    "1310.TW": {
        "short_name": "TAIWAN STYRENE MONOMER",
        "long_name": "Taiwan Styrene Monomer Corporation",
        "summary": "Taiwan Styrene Monomer Corporation, together with its subsidiaries, produces and sells styrene monomer, para-diethyl benzene, toluene, and ethyl benzene in Taiwan. The company's products are used in electrical appliances, machines, electronics, automobile, packaging, and other industries. It primarily serves the manufacturers of polystyrene, ABS resins, and synthetic rubber. The company also offers building cleaning and maintenance, sewage treatment, air conditioning equipment maintenance, civil and construction engineering, residential building, hotel, investment, and piping engineering services. In addition, it provides industrial plant development rental services; manufactures chemical and plastic raw materials; sells and distributes LCD monitors; manufactures electric components; and offers educational, information, software, and data storage consulting services. The company was founded in 1979 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "100",
        "website": "http://www.smct.com.tw",
        "market_cap": 10958063616
    },
    "1312A.TW": {
        "short_name": "GRAND PACIFIC PETROCHEMICAL",
        "long_name": "Grand Pacific Petrochemical Corporation",
        "summary": "Grand Pacific Petrochemical Corporation produces and sells petrochemical, synthetic resin & plastic, and other chemical products in Taiwan. Its product portfolio includes styrene monomer, an intermediate that is used primarily in the manufacturing of polystyrene (PS) resin, acrylonitrile-butadiene-styrene (ABS) resin, styrene butadiene rubber, and unsaturated polyester; and ABS resins, which are used in automobile interior parts, luggage, pipeline and valve materials, toys, and 3C products, as well as for plastic housing of IT products, such as PC monitors, modems, and scanners. The company's products also comprise PS resins that are used in the manufacturing of food containers, toys, plastic cards materials, and 3C products; and styrene acrylonitrile (SAN) resins used for the case of cassettes, battery, and disposable lighters, as well as blades for electric fans and air conditioner parts. In addition, it offers GPPC GRAMiD Polyamide 6,6, a highly-crystalline straight-chain polycondensation polymer used in electronic, instrumentation, machinery, automotive components, home appliances, oil pipe, precision engineering products, textile, etc., as well as in sporting goods, daily necessities, the production of medical equipment, etc. The company was formerly known as Delta Petrochemical Corporation and changed its name to Grand Pacific Petrochemical Corporation in 1984. Grand Pacific Petrochemical Corporation was founded in 1973 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "81567",
        "website": "http://www.gppc.com.tw",
        "market_cap": 26552801280
    },
    "1313.TW": {
        "short_name": "UPC TECHNOLOGY CO",
        "long_name": "UPC Technology Corporation",
        "summary": "UPC Technology Corporation, together with its subsidiaries, manufactures and sells petrochemical products in Taiwan, China, Southeast Asia, Japan, the Middle East, New Zealand, Australia, the United States, and Canada. It offers acids, phthalic and malic anhydride, plasticizers, unsaturated polyester resins, polyols, fatty esters, and other specialty chemicals for industrial applications. The company also engages in logistics, road transportation, warehouse storage, bulk chemical jetty operation, and tank farm activities. In addition, it is involved in investment and trading, and real estate management activities. The company was formerly known as Union Petrochemical Corp. and changed its name to UPC Technology Corporation in 2001. UPC Technology Corporation was founded in 1976 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "115",
        "website": "http://www.upc.com.tw",
        "market_cap": 34441125888
    },
    "1314.TW": {
        "short_name": "CHINA PETROCHEMICAL DEVELOPMENT",
        "long_name": "China Petrochemical Development Corporation",
        "summary": "China Petrochemical Development Corporation, together with its subsidiaries, produces and sells petrochemical intermediates and related engineering plastics, synthetic resins, chemical fiber, and other derivative products in Taiwan, rest of Asia, and internationally. It offers petroleum, alkali-chlorine, phosphoric acid, and derivative products; and storage, transportation, procurement, and sale of forging items, and related chemicals and chemicals materials. The company offers caprolactam for use as a raw material for making nylon 6 fibers and resins; acrylonitrile, a raw material for acrylic fibers and ABS plastics; nylon chips, including fiber nylon chips and engineering plastic grade nylon chips; ammonium sulfate, which is used as a ground or top fertilizer in agriculture; hydrogen cyanide, a transparent liquid for use as a raw material for manufacturing MMA; and refined sulfuric acid for various applications in the battery, electronic, telecommunication, and national defense related industries, as well as O-Phenylphenol, a raw material for downstream applications. Further, it is involved in the investment and development of real estate properties; petrochemical supporting facility construction; engineering and construction contracting business; biotechnology and pharmaceutical research, development, and marketing business; fertilizer storage, transport, purchase, and marketing business; trading of petrochemicals, electronic chemicals, industrial gases, and gas mixtures; and water treatment, plumbing, apparatus, and instrument installation work, refrigeration and air conditioning engineering, and tank car repair services, as well as provision of dicalcium phosphate and mechanical engineering services. Additionally, it commissions to build housing and commercial buildings, as well as plant rental business; manages land developments and playgrounds and other investment businesses. The company was incorporated in 1969 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "815",
        "website": "http://www.cpdc.com.tw",
        "market_cap": 40075169792
    },
    "1326.TW": {
        "short_name": "FORMOSA CHEMICAL & FIBRE CO",
        "long_name": "Formosa Chemicals & Fibre Corporation",
        "summary": "Formosa Chemicals & Fibre Corporation produces and sells petrochemical products, nylon fibers, and rayon staple fibers in Taiwan, China, and internationally. It offers various petrochemical products, including benzene, para-xylene, ortho-xylene, meta-xylene, styrene monomer, phenol, acetone, purified terephthalic acid, and purified isophthalic acid; and plastic products comprising polystyrene, acrylonitrile butadiene styrene (ABS) resin, polypropylene resin, polycarbonate (PC) resin, PC/ABS alloy, SAN resin, and ASA resin. The company also provides viscose rayon staple fiber, sodium sulphate, nylon 6 chip, filament of clothing and industry, and fireproof cloth products, as well as flame retardant, mosaic, compact, slub, recycle, modal, siro, multi-blended, and ring spun yarns. In addition, it is involved in the spinning, dyeing, printing, finishing, and manufacturing synthetic fibre, rug, and carpet; investment activities; cogeneration and power generation business; manufacturing and sale of cleaner and cosmetics; removal and disposal of waste; importing, exporting, and wholesale of food products; research and development, assembly, testing, and processing of various integrated circuits; providing employment services and temporary worker services; and import, trade, export processing, warehousing, design, and drawing of black, white, and colour graphs. Formosa Chemicals & Fibre Corporation was founded in 1965 and is headquartered in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "500",
        "website": "http://www.fcfc.com.tw",
        "market_cap": 506525122560
    },
    "1708.TW": {
        "short_name": "SESODA CORPN",
        "long_name": "Sesoda Corporation",
        "summary": "Sesoda Corporation manufactures and markets sulfate of potash (SOP) in Taiwan. The company offers standard, soluble, low chloride, granular, and industrial grade SOP products; and hydrochloric acid for use in acid washing in metallurgy and printed circuit boards, as well as manufacturing chloride chemicals and food processing. It also provides liquid calcium chloride for use in fluoride removal before waste water emission in the electronic and optoelectronic industries. In addition, the company trades in soda ash, sugar, sodium bicarbonate, sodium chloride, mixed calcium phosphate, solid calcium chloride, ammonium bicarbonate, and pearl luster pigment products. Further, it provides bulk shipping services through 6 vessels. Sesoda Corporation was founded in 1957 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.sesoda.com.tw",
        "market_cap": 6373531648
    },
    "1709.TW": {
        "short_name": "FORMOSAN UNION CHEMICAL",
        "long_name": "Formosan Union Chemical Corp.",
        "summary": "Formosan Union Chemical Corp. produces and sells chemical products in Taiwan. The company offers alkyl benzene, which is used as a raw material for detergents; nonyl phenol that is used as a basic raw material for surfactants, rubbers, plastic anti-oxidant agents, etc., as well as specialty chemicals; and hydrogenated hydrocarbon resin, which is used as a raw material for the production of ethylene-vinyl acetate polymer EVA and thermal plastic rubber TPR series hot melt adhesives. It also provides FuSyn-22, a synthetic alkylate that is used as a primary base oil or blend stock for various synthetic automotive and industrial applications. The company was founded in 1973 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.fucc.com.tw",
        "market_cap": 9898082304
    },
    "1711.TW": {
        "short_name": "EVERLIGHT CHEMICAL",
        "long_name": "Everlight Chemical Industrial Corporation",
        "summary": "Everlight Chemical Industrial Corporation produces and sells chemical products in Taiwan, rest of Asia, the Americas, Europe, and internationally. The company offers dyes for use in textile, leather, ink jet printing, digital textile printing, anodized aluminum, paper, and solar energy applications; specialty chemicals that are used in coatings, adhesives, plastics, polyurethanes, elastomers, and cosmetics; toners, cartridges, and carriers and developers for printers and ceramic ware; and electronic chemicals for use in yellow lithography, rinsing imaging, and substrate flattening process, as well as semiconductor and substrate surface cleaning, electroplating, surface coating, and electronic assembly applications. It also provides prostaglandin and other material medicines; and technical consulting services. Everlight Chemical Industrial Corporation was founded in 1972 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "106",
        "website": "http://www.ecic.com",
        "market_cap": 10626388992
    },
    "1712.TW": {
        "short_name": "SINON CORP",
        "long_name": "Sinon Corporation",
        "summary": "Sinon Corporation manufactures and sells crop protection and nutrient solutions in Taiwan and internationally. The company offers crop protection products, such as herbicides, insecticides, and fungicides; crop nutrition products, including fertilizers, plant hormones, seed treatments, synthetic fertilizers, organomineral fertilizers, organic fertilizers, organic seed treatments, inoculants, and natural plant hormones; and agrochemicals, seeds, and agricultural equipment, as well as provides technical field training and support, product application seminars, and financial services. It also provides products and services comprising bottle design, mold design and manufacturing, plastic vacuum molding, plastic injection molding, PET mold blowing, and plastic printing and labeling products and services, as well as formulation recipes for the beauty, healthcare, and household segments. In addition, the company engages in the phalaenopsis orchid nursery and distribution business. Further, it operates 41 supermarkets in Taiwan; and prepares and delivers meals to schools and companies. Additionally, the company manufactures and sells cement. The company was formerly known as Shinung Chemical Industry Co., Ltd. and changed its name to Sinon Corporation in 1979. Sinon Corporation was founded in 1955 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "43245",
        "website": "http://www.sinon.com.tw",
        "market_cap": 9334922240
    },
    "1714.TW": {
        "short_name": "HO TUNG CHEMICAL CORP",
        "long_name": "Ho Tung Chemical Corp.",
        "summary": "Ho Tung Chemical Corp. develops, manufactures, markets, exports, and sells various chemical products in Taiwan, China, Southeast Asia, and internationally. The company offers normal paraffin; linear alkyl benzene sulfonate produced as intermediate in the production of surfactants for use in detergent; anionic surfactants, including linear alkylbenzene sulphonic acid, alcohol ether sulfates or sodium laureth sulphate; and cationic surfactants, such as palmityl tri-methyl ammonium chloride, stearyl tri-methyl ammonium chloride, and alkyl dimethyl benzyl ammonium chloride. It also provides non-ionic surfactants comprising fatty alcohols, fatty alcohol ethoxylates, and coconut diethanol amide; cocamidopropyl betaine and dodecyl dimethyl betaine; and de-aromatic solvents used in paints and coatings, consumer products, printing inks, and agricultural chemical applications. In addition, the company engages in the trading of oil; warehousing of petrol, diesel, and chemicals; loading and unloading at wharves; wholesale and trading of chemicals and fuels; development, leasing, construction, and rental of residence and buildings; manufacture and sale of cement and cement raw materials, PMMA light guide plate, and various commodities; and development of new energy and surfactant. The company was founded in 1980 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "248",
        "website": "http://www.htgroup.com.tw",
        "market_cap": 11586498560
    },
    "1717.TW": {
        "short_name": "ETERNAL MATERIALS CO LTD",
        "long_name": "Eternal Materials Co., Ltd.",
        "summary": "Eternal Materials Co., Ltd. manufactures and sells resin, high performance, and electronic materials. The company offers resins materials, including polyester polyol, polyurethane, alkyd, solvent and water-based acrylic coating, amino, fluorocarbon, saturated and unsaturated polyester, other coatings, vinyl ester, and fire retardant resins, as well as acrylic resin for adhesives and overprinting; and optoelectronic materials, photovoltaic materials, epoxy system, structural adhesive, and polyester for polyurethane foam. It also provides UV monomers and oligomers, special coatings, silicone powders, additives, and 3D UV printing materials. In addition, the company offers printed circuit board materials, including dry film photoresists, dry film solder masks, UV inks, dry film photosensitive polyimides, paper phenolic copper clad laminates, and composite epoxy copper clad laminates; flat panel display and touch panel materials, such as dry film photoresists, liquid polyimide materials, prism films, and protective films; and vacuum laminators and toll coating services. Further, it provides biomedical materials, which includes biochemical and molecular diagnostics, recombinant proteins, and antibodies; liquid molding compound for WLP; solid capacitor materials; lithium battery materials; green process-less CTP plate photoresist; thermoplastic composites; and hydrophilic films. The company's products are used in energy, transportation, building and furniture, electronics, consumer products, packaging and printing, health care and medical, and metal machinery applications. It has operations in Taiwan, China, Japan, Vietnam, Thailand, the United States, India, Indonesia, Malaysia, Korea, and Italy. The company was formerly known as Eternal Chemical Co., Ltd. and changed its name to Eternal Materials Co., Ltd. in 2014. Eternal Materials Co., Ltd. was founded in 1964 and is headquartered in Kaohsiung City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "807",
        "website": "http://www.eternal-group.com",
        "market_cap": 50231341056
    },
    "1721.TW": {
        "short_name": "SUNKO INK CO",
        "long_name": "Sunko Ink Co., Ltd.",
        "summary": "Sunko Ink Co., Ltd. manufactures and sells flame retardants, elastomers, agrochemicals, electronic chemicals, polymer additives, polyurethane resins and top coating materials, and curing agents. The company was founded in 1974 and is headquartered in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung City",
        "zipcode": "412",
        "website": "http://www.sunko.com.tw",
        "market_cap": 1822603136
    },
    "1724.TW": {
        "short_name": "TNC INDUSTRIAL",
        "long_name": "T.N.C. Industrial Co., Ltd.",
        "summary": "T.N.C. Industrial Co., Ltd. manufactures and sells coating raw materials and electronic chemicals for industrial applications worldwide. It offers a range of coating chemicals, including nitrocellulose, pigment, resin, etc. The company's nitrocellulose is used in coating, lacquer, printing ink, and various decorative films, as well as for wooden furniture, athletic facilities, cosmetics, metal, and leather products; pigments are used to make color of the surfaces and materials; and resin and derivatives are used for the adhesion of coating. It also offers electronic chemicals, such as process chemicals and mixed acids for semiconductor; display; and diode, solar cell, and LED industries. T.N.C. Industrial Co., Ltd. was founded in 1954 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": null,
        "website": "http://www.tnc.com.tw",
        "market_cap": 2019461248
    },
    "1726.TW": {
        "short_name": "YUNG CHI PAINT & VARNISH MFG CO",
        "long_name": "Yung Chi Paint & Varnish Mfg.Co.,Ltd",
        "summary": "Yung Chi Paint & Varnish Mfg.Co.,Ltd manufactures and sells coatings and paints primarily in Taiwan. The company offers architecture coatings, including water and solvent-based cement mortar paints, water-based lastomeric coatings, dirt off exterior acrylic emulsion paints, water-based epoxy topcoats, solvent-based acrylic paints, exterior wall and clear coatings, wood coatings, waterproof paints, and other used architecture coatings. It also provides heavy duty coatings, such as ready-mixed, top-long, enamel, PU, epoxy, vinyl ester, chlorinated rubber, yung flon, polyurethane, and polysiloxane paints; and epoxy flooring coatings and anti-corrosive and zinc rich primers. In addition, the company offers marine paints that include supermarine products; anti-fouling, marine primers and paints, and rainbow paints; and fire-retardant coatings and spray-applied fire resistive materials. Further, it provides specialty coatings, which comprise galvanized steel emulsions, anti-midew, baking, and heat-resisting paints; varnishes, putty, traffic paints, black board paints, paint removers, hammer tone paints, paint oils, flash rust inhibitors, weldable anti-corrosive primers, gold paints, and flat paints. Additionally, the company offers coil coatings and maintenance paints; green water-based waterproof paints, green epoxy topcoats, and green water-based cement mortar paints; and water-based clear white-board paints, textured paints, and snow-flake decorative paints. It also provides paint pigments, synthetic resins, fire protection coatings, cement made products, and steel drums, as well as can, nuclear, and curtain wall coatings; and engages in the coating, anti-corrosive, lining coating, rust removal by water-jet, and wet sand blasting construction, as well as electrolytic protection activities. The company was founded in 1951 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "81264",
        "website": "http://www.rainbowpaint.com.tw",
        "market_cap": 12069000192
    },
    "1735.TW": {
        "short_name": "EVERMORE CHEMICAL INDUSRY CO",
        "long_name": "Evermore Chemical Industry Co., Ltd.",
        "summary": "Evermore Chemical Industry Co., Ltd. produces and sells synthetic leather polyurethane (PU) resins in China, Taiwan, and internationally. The company offers solvent based PU components, thermoplastic PU components, PU adhesives, aqueous based PU dispersion, polyurethane system polyester, poly isocyanates cross-linking agent hardners, polyester polyol components, and UV Monomer/Oligomer, etc. It serves various industries, such as footwear, synthetic leather, optical electronics, textiles, adhesives, coating, paints and ink, tube and hose, optical glass, etc. The company was founded in 1989 and is based in Nantou, Taiwan. Evermore Chemical Industry Co., Ltd. is a subsidiary of Aica Kogyo Company, Limited.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Nantou City",
        "zipcode": "54066",
        "website": "http://www.twemc.com",
        "market_cap": 1878433152
    },
    "1742.TWO": {
        "short_name": "TAIWAN WAX",
        "long_name": "Taiwan Wax Company,Ltd.",
        "summary": "Taiwan Wax Company,Ltd. manufactures and sells refined wax in Taiwan and internationally. The company offers refined paraffin wax, microcrystalline wax, and light/heavy foots oil wax. It also imports and sells aquatic products, such as king crab and salmon. The company was founded in 1987 and is based in Chiayi, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Chiayi",
        "zipcode": "62146",
        "website": "http://en.wax.com.tw",
        "market_cap": 1096470272
    },
    "1773.TW": {
        "short_name": "SHINY CHEMICAL INDUSTRIAL CO. L",
        "long_name": "Shiny Chemical Industrial Company Limited",
        "summary": "Shiny Chemical Industrial Company Limited manufactures and sells electronic and industrial solvents in Taiwan. The company's electronic solvents include menthyl acetates, ether alcohol esters, other solvents, and customized products; and industrial solvents comprise menthyl acetates, ether ester products, and other solvents. It also provides fumalin and urea glue; and leases storage tanks. The company was founded in 1979 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "82841",
        "website": "http://www.shinychem.com.tw",
        "market_cap": 22140000256
    },
    "1776.TW": {
        "short_name": "HEADWAY ADVANCED MATERIALS INC",
        "long_name": "Headway Advanced Materials Inc.",
        "summary": "Headway Advanced Materials Inc. manufactures and sells polyurethane resin and thermoplastic polyurethane pellet products in the Asia-Pacific region. The company provides products, such as solvent and water borne polyurethane, solvent free PU, polyisocynate hardner, polyol, thermoplastic polyurethane (TPU), and others. Its products are used in various applications, such as textile, leather, furniture, footwear, building materials, electronics, food packing, transportation, medical care, and other industries. Headway Advanced Materials, Inc. was founded in 1976 and is based in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "303",
        "website": "http://www.headway.com.tw",
        "market_cap": 1252194304
    },
    "1903.TW": {
        "short_name": "SHIHLIN PAPER CORP",
        "long_name": "Shihlin Paper Corporation",
        "summary": "Shihlin Paper Corporation produces and sells paper-related products. The company offers cards for use as playing and game cards; color cards for use in folders and art cards; black boards for use in speakers, frame boards, and album boards; and non-coated boards that are used in shoe boxes and environmental cartons. It also provides duplex boards with white back for use in tag cards and packaging containers; duplex boards with gray back for use in shoe and tissue paper boxes, liner boards, and packaging containers; and chip boards for gift-wrapped boxes and book binding. The company was founded in 1918 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "111",
        "website": "http://www.shihlin.com.tw",
        "market_cap": 14380156928
    },
    "1904.TW": {
        "short_name": "CHENG LOONG",
        "long_name": "Cheng Loong Corporation",
        "summary": "Cheng Loong Corporation manufactures and sells paper products in Taiwan, Mainland China, and Southeast Asia. The company offers industrial paper products, including linerboards, coated duplex boards, corrugating medium, white top liners, and core boards, etc.; and corrugated containers, such as corrugated sheet boards, corrugated containers, display containers, waterproof containers, and paper pallets, etc., as well as pre-print services. It also provides household paper products, such as toilet papers, facial tissues, kitchen papers, and paper towels under the Andante brand name, as well as diapers and hand wash mousse; fine and specialty papers; and bond papers, receipts, computer forms, paper voucher, paper invoice, medication bags, labels/tags and flexible packaging products, etc. In addition, the company offers green paper art products for children's educational toys, pet toys, and cultural and creative products, as well as builds residential and commercial premises for rent and sale. Further, it provides electronic components, optical instruments, glass products, and precision instruments; corrugated, display, and paper boxes; foams, anti-static bubble bags, plastic buffer packaging materials, and packaging decoration printing products; and water treatment, sewage treatment, and maintenance and technical repairment services. Cheng Loong Corporation was founded in 1954 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "220",
        "website": "http://www.clc.com.tw",
        "market_cap": 49318010880
    },
    "1906.TW": {
        "short_name": "BAOLONG INTERNATIONAL CO LTD",
        "long_name": "Baolong International Co., Ltd.",
        "summary": "Baolong International Co., Ltd. engages in the distribution of industrial paper products. It offers facial tissue and corrugated papers. The company was founded in 1965 and is based in Douliu, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Douliu",
        "zipcode": null,
        "website": "http://www.baolongintl.com",
        "market_cap": 3057750016
    },
    "1907.TW": {
        "short_name": "YFY INC",
        "long_name": "YFY Inc.",
        "summary": "YFY Inc. manufactures and sells papers in Taiwan, Mainland China, and internationally. The company offers pulp, premium, Kraft, corrugated, and fine papers; cardboards, paper and pulp products, cardboard and colored cases and boxes, and food containers; napkins, tissue papers, and detergent; and styrene butadiene latex. It provides corrugated boxes and paper pallets; and commercial photography, brand packaging design, certification testing, and printing management services. The company offers color, art, and security printing services; paper, chemical, machinery, business paper, and material trading services; RFID technology solutions; production technologies for PCBS; and smart cards and application systems, information security products, and consumer service solutions. It provides banking, securities, investment trust, customer service technology, rental companies, insurance, and venture investment services. The company offers pharmaceutical and stem cell products; investment, management, and consultancy services for biotechnology companies; researches and develops pharmaceutical products and clinical applications, and internationally licenses medical devices; rare cell diagnostics technology and genetic testing; and information software services. It develops mobile applications and ePaper; operates an online store, Yuen Foong Shop, and restaurants; organic food, chemical, and electronic products; agricultural resource recycling; graphic and brand design services; wholesales agriculture products and building materials; and factoring and seedling cultivation businesses. The company offers active carbons and fertilizers; refractory materials, cement, and concrete products; environmental protection equipment; designs and prints magazines, posters, books, and advertisements; operates cogeneration facility; and constructs water processing, environmental, sewage treatment, and incinerator facilities. YFY Inc. was founded in 1924 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "100",
        "website": "http://www.yfy.com",
        "market_cap": 75463819264
    },
    "2007.TW": {
        "short_name": "YIEH HSING ENTERPRISE CO",
        "long_name": "Yieh Hsing Enterprise Co., Ltd.",
        "summary": "Yieh Hsing Enterprise Co., Ltd. produces and sells steel products in Taiwan. It offers stainless, carbon, alloy, and free-cutting steel wire rods. Its products are used in manufacturing of nuts, screws, wires, automobile parts, machine parts, hardware, tools, etc. The company also exports its products to North America, South America, China, India, South Asia, Northeast Asia, Europe, and the Middle East. The company was founded in 1978 and is based in Kaohsiung, Taiwan. Yieh Hsing Enterprise Co., Ltd. operates as a subsidiary of Yieh Phui Enterprise Co., Ltd.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "82053",
        "website": "http://www.yheco.com.tw",
        "market_cap": 7588323840
    },
    "2008.TW": {
        "short_name": "KAO HSIUNG CHANG IRON & STEEL C",
        "long_name": "Kao Hsing Chang Iron & Steel Corp.",
        "summary": "Kao Hsing Chang Iron & Steel Corp. produces and sells steel pipes and plates and tin plates in Taiwan. It offers cold and hot rolled and coated steel coils. The company was founded in 1966 and is based in Kaohsiung City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "804",
        "website": "http://www.khc.com.tw",
        "market_cap": 3725804544
    },
    "2010.TW": {
        "short_name": "CHUN YUAN STEEL INDUSTRIAL CO",
        "long_name": "Chun Yuan Steel Industry Co., Ltd.",
        "summary": "Chun Yuan Steel Industry Co., Ltd. provides metal solutions primarily in Taiwan. It operates through seven divisions: Commercials Steel, Commercials Steel Regional, Electrical Steel, Special Steel, Special Steel Strip, Automated Storage System, and Construction. The company offers hot and cold rolled steel sheets and bar coils; enamel and coated steel sheets and bar coils; aluminum and alloy-aluminum sheets and coils; magnetic steel sheets comprising motor core EI sheets and magnetic steel coils; special steel materials, such as plate/bar/round/square/angled steel; cold rolled carbon bar steel coils; and copper products, including brass and phosphor bronze. It also provides steel base and reinforced plates; machinery products; steel structures; and H-beam steel and cellular H-beam steel products for welded structures. In addition, the company offers storage equipment, including logistics equipment, 3-D automated storage systems, and shelfs for heavy materials; castings, such as container angles; and stamping parts comprising autos and electric appliances parts. Further, it provides civil and construction engineering services for factory buildings, multi-storey buildings, and bridges. The company was founded in 1965 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.cysco.com.tw",
        "market_cap": 14313175040
    },
    "2014.TW": {
        "short_name": "CHUNG HUNG STEEL CO",
        "long_name": "Chung Hung Steel Corporation",
        "summary": "Chung Hung Steel Corporation manufactures and sells steel products in Taiwan, Asia, the United States, Europe, and internationally. The company offers hot-rolled steel coils, cold-rolled steel coils, hot-dipped galvanized steel coils, JIS steel pipes, ASTM steel pipes, API steel pipes, and PE coated steel pipes. Its products are used in steel pipes, sports equipment, bicycles, umbrellas, oil drums, electroplated pipes, home appliances and automobile parts, furniture, floor plates, piping and plumbing, mechanical structure, piling, construction equipment, pallet, garden tube, and display stand, as well as pipe products for pipeline transportation. The company was formerly known as Yieh Loong Enterprise Co., Ltd. and changed its name to Chung Hung Steel Corporation in July 2004. Chung Hung Steel Corporation was founded in 1983 and is headquartered in Kaohsiung, Taiwan. Chung Hung Steel Corporation is a subsidiary of China Steel Corporation.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "82544",
        "website": "http://www.chsteel.com.tw",
        "market_cap": 67613929472
    },
    "2015.TW": {
        "short_name": "FENG HSIN STEEL CO LTD",
        "long_name": "Feng Hsin Steel Co.,Ltd",
        "summary": "Feng Hsin Steel Co., Ltd. engages in the production and sale of steel products in Taiwan. It offers angle, channel, flat, round, square, and deformed bars, as well as rebars; billets; and bar in coils. The company was incorporated in 1969 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "421",
        "website": "http://www.fenghsin.com.tw",
        "market_cap": 42863841280
    },
    "2017.TW": {
        "short_name": "QUINTAIN STEEL CO LTD",
        "long_name": "Quintain Steel Co., LTD.",
        "summary": "Quintain Steel Co., LTD. produces and sells galvanized wires in Taiwan and internationally. The company offers hot rolled wire rod products; deformed bar in coil products; spheroidized annealed wire and hard drawn wire products; hot dip galvanized wire products; and ball thread/v-thread threaded rods, as well as drywall, tapping, and self drilling screw; and wood and deck screw. Its products are used primarily in the agriculture, construction, and processing industries, as well as in mesh-making and screw industries. The company was founded in 1973 and is based in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "702",
        "website": "http://www.quintain.com.tw",
        "market_cap": 7436217856
    },
    "2020.TW": {
        "short_name": "MAYER STEEL PIPE CORP",
        "long_name": "Mayer Steel Pipe Corporation",
        "summary": "Mayer Steel Pipe Corporation manufactures steel pipes and tubular products in Taiwan. It offers welded steel pipes for low pressure use; rigid steel conduits; carbon steel tubes for machine structural purposes; electric resistance welded carbon steel tubes for automobile structural purposes; and carbon steel square pipes for general structural purposes. The company also provides stainless steel pipes, such as boiler and heat exchanger tubes; stainless steel tubes for mechanical and structural purposes, and automobile exhaust; light gauge stainless steel pipes for ordinary piping; and general service tubes. In addition, it offers stainless steel plates and sheets; stainless steel surface processing and cutting services; and stainless steel paste protective films. Further, the company produces and markets various cast, polished, electroplated, and forged aluminum alloy automotive wheels in the United States, the European Union, Japan, and Southeast Asia. Its products are also used in air conditioning, fire protection, drainage, water supply, and electricity, as well as gas, structural, and hydraulic pipe applications. Mayer Steel Pipe Corporation was founded in 1959 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://www.mayer.com.tw",
        "market_cap": 7154211328
    },
    "2022.TW": {
        "short_name": "TYCOONS GROUP ENTERPRISE",
        "long_name": "Tycoons Group Enterprise Co.,Ltd.",
        "summary": "Tycoons Group Enterprise Co.,Ltd. produces and sells steel products worldwide. It offers billets; steel wire rods; steel bars; spheroidizing annealing wires; and drywall, roofing, wood, self-tapping, chipboard, Euro, collated, and window screws, as well as shear connectors. The company was founded in 1980 and is based in Kaohsiung City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "820",
        "website": "http://www.tycons.com.tw",
        "market_cap": 7316217856
    },
    "2023.TW": {
        "short_name": "YIEH PHUI ENTERPRISE CO",
        "long_name": "Yieh Phui Enterprise Co., Ltd.",
        "summary": "Yieh Phui Enterprise Co., Ltd., together with its subsidiaries, processes, manufactures, markets, imports and exports, and trades in steel products in Taiwan. It provides pickled steel coils, cold-rolled steel coils, galvanized steel coils, coated steel coils, and steel coil products; buildings, plants, and bridges steel structures; frame cranes; straddle carrier; container crane; steel pipes; aluminum-zinc plated steel coils; mechanical parts; stainless and carbon steel wires; alloy and free-cutting steel wires; steel and straight bars; and RFID products, walkie-talkies, and smart monitoring system for LED street lights, as well as OEM/ODM and piping engineering design services. The company also designs, manufactures, and installs EOT cranes, gantry cranes, and rail mounted gantry container cranes; offers black steel, pre-galvanized steel, EMT steel, square/rectangular steel, structural steel, rigid steel conduit, steel sprinkler, and oval steel pipes, as well as API casing and line pipes; develops, leases, and sells residential and commercial buildings, and department stores; manufactures and markets military specification printed circuit boards, and special high grade alloys; wholesales hardware, telecommunications equipment, and daily necessities; technical consultation for steel products; management services; manufactures metal; and mines for nickel, as well as operates hotels and radio. It exports its products to Mainland China, Southeast Asia, Europe, North America, Central and South America, Japan, the Middle East, Africa, and Australia. The company was formerly known as Kuo Chiao Enterprise Co., Ltd. and changed its name to Yieh Phui Enterprise Co., Ltd. in March 1986. Yieh Phui Enterprise Co., Ltd. was founded in 1978 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "82544",
        "website": "http://www.yiehphui.com.tw",
        "market_cap": 43294052352
    },
    "2024.TW": {
        "short_name": "CHIH LIEN INDUSTRIAL CO",
        "long_name": "Chih Lien Industrial Co., Ltd.",
        "summary": "Chih Lien Industrial Co., Ltd. produces and supplies steel wires and steel bars in Taiwan and internationally. It offers high and low carbon, free cutting, bearing, alloy, spring, and cold heading steel wires; and free cutting, carbon, tool, alloy, spring, and stainless steel bars. The company provides its products for use in industrial machinery, precision parts, bicycles, motorcycles, automobiles, tools, household products, electronics, OA machines, springs, furniture, construction, etc. Chih Lien Industrial Co., Ltd. was founded in 1973 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "32749",
        "website": "http://www.chihlien.com.tw",
        "market_cap": 1681874944
    },
    "2025.TW": {
        "short_name": "CHIEN SHING STAINLESS STEEL CO",
        "long_name": "Chien Shing Stainless Steel Co., Ltd.",
        "summary": "Chien Shing Stainless Steel Co., Ltd. engages in the stainless steel business in Taiwan and internationally. It manufactures and trades in stainless steel coils and materials; and engages in cutting and sliding stainless steel coils. The company was founded in 1978 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel & Iron",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": null,
        "website": "http://www.csssc.com.tw",
        "market_cap": 875593536
    },
    "2027.TW": {
        "short_name": "TA CHEN STAINLESS PIPE CORP",
        "long_name": "Ta Chen Stainless Pipe Co., Ltd.",
        "summary": "Ta Chen Stainless Pipe Co., Ltd. produces and sells stainless steel and aluminum products. It operates in Stainless Steel and Aluminum, and Screws and Nuts segments. It offers stainless steel pipes, rolls, pipe fittings, plates, bars, valves, and castings; and imports, exports, and sells screws and nuts, as well as curtains and cloth products. The company offers its products in the United States, China, Taiwan, and internationally. Ta Chen Stainless Pipe Co., Ltd. was founded in 1986 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "71752",
        "website": "http://www.tachen.com.tw",
        "market_cap": 69112864768
    },
    "2028.TW": {
        "short_name": "WEI CHIH STEEL INDUSTRIAL CO",
        "long_name": "Wei Chih Steel Industrial Co.,Ltd.",
        "summary": "Wei Chih Steel Industrial Co.,Ltd. manufactures and sells steel products in Taiwan. It primarily offers steel bars, deformed bars, steel blanks, round bars, and billets. The company was founded in 1971 is based in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "72046",
        "website": "http://www.weichih.com.tw",
        "market_cap": 11253452800
    },
    "2030.TW": {
        "short_name": "FROCH ENTERPRISE CO",
        "long_name": "Froch Enterprise Co., Ltd.",
        "summary": "Froch Enterprise Co., Ltd. manufactures, sells, and exports stainless steel welded tubes and pipes in Taiwan and internationally. It offers stainless steel pipes, large diameter stainless steel pipes, mechanical tubes, equal leg angle bars, square and rectangular tubes, sanitary tubes, inside polished pipes, coated pipes, sheets, plates, and coils, as well as flat bars; stainless steel tubes for boilers and heat-exchangers; and stainless steel light gauge tubes for general services. The company serves oil and gas, petrochemical, chemical, power utility, pulp and paper, food and beverage, automotive, furniture, construction, electronic, bio-tech, and other industries. Froch Enterprise Co., Ltd. was founded in 1970 and is headquartered in Douliu, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Douliu",
        "zipcode": "640",
        "website": "http://www.froch.com",
        "market_cap": 6480151040
    },
    "2031.TW": {
        "short_name": "HSIN KUANG STEEL CO",
        "long_name": "Hsin Kuang Steel Company Limited",
        "summary": "Hsin Kuang Steel Company Limited engages in the cutting, stamping, and sale of various steel products in Taiwan. Its products include steel coils and plates, round steel bar, stainless and alloy steel, and special steel. The company is also involved in the investment in various businesses, including manufacturing, securities investment, banking, and insurance, etc.; sale of metal products for architecture markets; manufacture and sale of metal products and energy related equipment; leasing and warehousing; and manufacturing and processing of metal structures, architectural components, and steel products. Hsin Kuang Steel Company Limited was founded in 1967 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "241",
        "website": "http://www.hksteel.com.tw",
        "market_cap": 19757094912
    },
    "2032.TW": {
        "short_name": "SINKANG INDUSTRIES CO",
        "long_name": "Sinkang Industries Co., Ltd.",
        "summary": "Sinkang Industries Co., Ltd. manufactures, processes, and sells stainless steel in Taiwan and internationally. The company primarily offers SUS 300 and 400 series stainless steel. Its products are principally used in the construction and decoration, kitchen and dining cutlery, and household electrical appliances, as well as in the petrochemical, food processing, transportation equipment, electrical machinery, office equipment, and other processing industries. Sinkang Industries Co., Ltd. was founded in 1971 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.sinkang.com.tw",
        "market_cap": 2590861824
    },
    "2034.TW": {
        "short_name": "YC INOX CO LTD",
        "long_name": "YC Inox Co.,Ltd",
        "summary": "YC Inox Co., Ltd. manufactures and sells stainless steel products in Taiwan. It offers stainless steel coils, sheets, plates, pipes, tubes, angles, flat bars, and U channel products. The company was formerly known as Yeun Chyang Industrial Co., Ltd. and changed its name to YC Inox Co., Ltd. in July 2012. YC Inox Co., Ltd. was founded in 1973 and is headquartered in Changhua City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua City",
        "zipcode": null,
        "website": "http://www.ycinox.com",
        "market_cap": 13288782848
    },
    "2038.TW": {
        "short_name": "HAI KWANG ENTERPRISE CORPORATIO",
        "long_name": "Hai Kwang Enterprise Corporation",
        "summary": "Hai Kwang Enterprise Corporation manufactures and sells steel and billets in Taiwan and internationally. The company was founded in 1988 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": null,
        "website": "http://www.haikwang.com.tw",
        "market_cap": 6525539840
    },
    "2064.TWO": {
        "short_name": "CAMELLIA METAL CO LTD",
        "long_name": "Camellia Metal Co., Ltd.",
        "summary": "Camellia Metal Co., Ltd. manufactures and sells steel bars and wires in Taiwan. It offers low-carbon, middle-carbon, high-carbon, free cutting, spring, alloy, and stainless steel bars and wires. The company's products are used in motor and mechanical axis, as well as axis of business machines; screwdrivers, hex wrenches, and sockets; torsion and balance bars, and automotive coil springs; and medical and aerospace technologies, household appliances, and high-precision and other materials. Its products are also used in cars, bridges, steel, and screws and other building materials; and electronics, telecommunications, and IT industries. The company was founded in 1971 and is based in Changhua County, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "50544",
        "website": "http://www.camelliametal.com.tw",
        "market_cap": 1114080000
    },
    "2069.TW": {
        "short_name": "YUEN CHANG STAINLESS STEEL CO L",
        "long_name": "Yuen Chang Stainless Steel Co., Ltd.",
        "summary": "Yuen Chang Stainless Steel Co., Ltd. processes, manufactures, and supplies stainless steel products in Taiwan and internationally. The company offers stainless steel coils, sheets, plates, and strips. Its products are used in information technology, medical instruments, computer and peripherals, auto parts, home appliances, etc. The company was founded in 1987 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": null,
        "website": "http://www.yuenchang.com.tw",
        "market_cap": 4303236096
    },
    "2103.TW": {
        "short_name": "TSRC CORPORATION",
        "long_name": "TSRC Corporation",
        "summary": "TSRC Corporation manufactures and markets synthetic rubber and elastomers, and applied materials in Taiwan and internationally. Its products include ESBR rubber for use in automotive tires, shoe soles, conveyor belts, military caterpillar and tow trucks tracks, sports equipment, and toys; SSBR rubber for use in energy-saving, high performance, and all-season tires; BR rubber that is used in the production of plastic modification for HIPS and high-speed radial tires; and NBR rubber for use in oil hoses, oil seals, rollers, industrial gaskets, belts, shoe soles, rubber plastic foam sheets, and conveyor belts. The company also provides styrene-butadiene-styrene, styrene-isoprene-styrene, and styrene-ethylene/butylene-styrene copolymers, as well as T-BLEND applied materials for use in plastic modification, compounding, adhesive, packaging, medical, elastic film, shoe material, foaming material, labels, hygiene, wire and cable, flexography, gasket material, and soft touch material applications. The company was formerly known as Taiwan Synthetic Rubber Corporation and changed its name to TSRC Corporation in August 1999. TSRC Corporation was founded in 1973 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "106",
        "website": "http://www.tsrc.com.tw",
        "market_cap": 28693422080
    },
    "2104.TW": {
        "short_name": "INTERNATIONAL CSRC INVESTMENT H",
        "long_name": "International CSRC Investment Holdings Co., Ltd.",
        "summary": "International CSRC Investment Holdings Co., Ltd. produces and sells carbon black for tire and other rubber products worldwide. Its products are also used in applications, such as pigments, plastics, chemical fiber products, conductive materials, etc. The company also engages in the biotechnology and pharmaceutical research and development activities. In addition, it produces and sells lithium batteries; and provides investment services, investment consultation services, carbon black transportation services, and technology services. The company was formerly known as China Synthetic Rubber Corporation and changed its name to International CSRC Investment Holdings Co., Ltd. in October 2018. International CSRC Investment Holdings Co., Ltd. was founded in 1973 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://www.csrcgroup.com",
        "market_cap": 24734973952
    },
    "2107.TW": {
        "short_name": "FORMOSAN RUBBER GROUP",
        "long_name": "Formosan Rubber Group Inc.",
        "summary": "Formosan Rubber Group Inc., together with its subsidiaries, produces and markets rubber, plastic, plastic foam, and PVC resin sheets; and relevant materials in Taiwan and the United States. The company offers rubber, silicone rubber, laminated, PU coating, green plastic, and PVC products. Its products are used in various applications, including functional garments and fabrics, healthcare, industrial and safety products, inflatable products, and optical electronic materials, as well as for use in shoes, and bags and luggage products. The company is also involved in the development of residential and commercial buildings for renting and selling; real estate investment and rental, as well as sale of premises; and warehouse, logistics, and rental and leasing businesses. Formosan Rubber Group Inc. was founded in 1952 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.frg.com.tw",
        "market_cap": 8523917824
    },
    "2108.TW": {
        "short_name": "NANTEX INDUSTRY",
        "long_name": "NANTEX Industry Co., Ltd.",
        "summary": "NANTEX Industry Co., Ltd. produces and sells synthetic rubber latex, acrylonitrile-butadiene rubber, carbon masterbatch compounds, and thermoplastic elastomer products worldwide. Its NANTEX synthetic rubber latex products are used in making examination, medical, household, and industrial gloves, as well as in art papers, coated white board, carpet backings, shoe insoles, adhesives, plastic modification agents, construction materials, saturation in non-woven fabrics, and artificial leathers. The company's acrylonitrile-butadiene rubber products are used in industrial and automotive goods, belts, fuel hoses, O-rings, gaskets, shoe soles, insulation equipment, sporting goods, and printing rollers products, as well as electronic parts. Its DYNAPRENE thermal plastic elastomer products are used in automotive parts, construction materials, food industries, sporting goods, industrial products, 3C industries, medical equipment, and plastic modification agents; and carbon masterbatch compounds for use in O-rings, gaskets, fuel hoses, foam products, cables, rollers, shoe soles, and automotive parts. The company was formerly known as President Fine Chemical Industry Co. Ltd. and changed its name to NANTEX Industry Co., Ltd. in October 1991. NANTEX Industry Co., Ltd. was founded in 1979 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "832",
        "website": "http://www.nantex.com.tw",
        "market_cap": 68692168704
    },
    "2221.TWO": {
        "short_name": "TACHIA YUNG HO MACHINE INDUSTRY",
        "long_name": "Tachia Yung Ho Machine Industry Co., Ltd.",
        "summary": "Tachia Yung Ho Machine Industry Co., Ltd. primarily manufactures and sells butt-welding pipe fittings and high purity components in Taiwan. The company offers stainless steel butt-welding pipe fittings, such as elbows, tees, reducers, caps, stub ends, etc.; and UHP components, including high purity pipes and pipe fittings, metal gasket face seal fittings, micro butt-welding fittings, LoK-DJ compression fittings, UHP CGA/DISS fittings, diaphragm and ball valves, valve manifold boxes, and special chemical storage tanks. Its butt-welding pipe fittings are used in the areas of petrochemical, ship building, foods, sugar making, paper production, chemical engineering, agricultural chemical, dyeing, synthetic fibers, liquid chemical, gas, industries piping, construction drainage pipe fitting, etc.; and UHP components have applications in the areas of semiconductor, LCD-TFT, solar energy, LED, food industry, chemical piping, gas, liquid, construction pipe fitting, etc. Tachia Yung Ho Machine Industry Co., Ltd. also exports its products to Japan, Korea, Singapore, Malaysia, France, Germany, Ireland, England, the United States, Australia, New Zealand, China, and the Gulf Region. The company was formerly known as Tachia Yung Ho Machine Industry Limited Company and changed its name to Tachia Yung Ho Machine Industry Co., Ltd. in 1977. Tachia Yung Ho Machine Industry Co., Ltd. was founded in 1943 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "437",
        "website": "http://www.yhmco.com.tw",
        "market_cap": 1036962496
    },
    "3149.TW": {
        "short_name": "G-TECH OPTOELECTRONICS CORP",
        "long_name": "G-TECH Optoelectronics Corporation",
        "summary": "G-TECH Optoelectronics Corporation engages in the optoelectronic glass processing business in Taiwan. The company offers 3D forming, low-E energy-saving, tempered paint, coated, and cover glass products, as well as easy clean and fog proof smart mirrors. It also provides surface processing services for architectural glass; and processing manufacturing services, such as tempering, shaping, laminating, and insulating. The company's products are used in consumer electronics and non-consumer electronics segments, such as architectures and automobiles. The company was formerly known as Positive Technology Glass Co., Ltd. and changed its name to G-TECH Optoelectronics Corporation in 2001. The company was founded in 1996 and is headquartered in Miaoli County, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Miaoli",
        "zipcode": "36647",
        "website": "http://www.gtoc.com.tw",
        "market_cap": 6542689792
    },
    "3388.TWO": {
        "short_name": "TOPCO TECHNOLOGIES CORP.",
        "long_name": "Topco Technologies Corp.",
        "summary": "Topco Technologies Corp. engages in the import and export of chemical material related commodities in Taiwan, Mainland China, and internationally. It offers silicone related products, including silicone fluid, defoaming and release agent, foam stabilizer, fiber treatment, paint additives, resin, coupling agent, oil, rubber, PSA, powder, and grease, as well as paper release agent, HTV, liquid injection molding system, RTV I, RTV II, sealant, MS-RTV, thermal pad and LED application material, and AF coating agent. The company also provides various adhesives, such as construction structural adhesives; EXELAST; surface treatment equipment; matsumoto microsphere; poreflon membrane; touch panel related materials; poly tetra fluoroethylene films; and other products. In addition, it offers environmental catalysts; micro-capsule foam materials; silicate and anti-static agents; cosmetic raw materials and finished products; gunze fluorine sleeves; UV curing glues; atmospheric plasma; VUV washing machines; and conductive polymers and thermal materials, as well as other trade products. The company was founded in 1981 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10690",
        "website": "http://www.topcocorp.com",
        "market_cap": 5591605248
    },
    "3430.TWO": {
        "short_name": "CHITEC",
        "long_name": "Chitec Technology Co., Ltd.",
        "summary": "Chitec Technology Co., Ltd. engages in the research and development of specialty chemicals for applications in electronics, medicine, automotive, construction, and other industries worldwide. It offers UV absorbers and light stabilizers under the Chiguard name; flame retardants under the Zuran name; antioxidants under the Revonox/Deox name; photoinitiators under the Chivacure/R-gen name; and anti-reversion agents, antiozoants, optical brighteners, and auxiliary thermal stabilizers under the Chitex name. The company was founded in 1998 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "106",
        "website": "http://www.chitec.com",
        "market_cap": 906670720
    },
    "3508.TWO": {
        "short_name": "WAYS TECHNICAL CORP",
        "long_name": "Ways Technical Corp., Ltd.",
        "summary": "Ways Technical Corp., Ltd. engages in the various processing services and professional material development. It offers plastic, metal, and assembly center injection equipment and other products; tooling equipment; surface treatment injection molding; SMT products; and organic photovoltaics products. The company was founded in 2001 and is based in Dayuan, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Yangmei",
        "zipcode": "326",
        "website": "http://www.waystech.net",
        "market_cap": 2173046528
    },
    "3678.TWO": {
        "short_name": "Ushine",
        "long_name": "Ushine Photonics Corporation",
        "summary": "Ushine Photonics Corporation produces and supplies indium tin oxide (ITO) film products. The company offers ITO-films for resistive touch panels and projective capacitive touch panels; low resistivity TCO-films; optical clear adhesives; and anti-static protective films, as well as converting services. Its products are used in touch panels, flexible displays, flexible solar cells, and other products. The company was founded in 2001 and is based in Zhubei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": "302",
        "website": "http://www.ushine.com.tw",
        "market_cap": 260470352
    },
    "3708.TW": {
        "short_name": "SWANCOR HOLDING CO LTD",
        "long_name": "Swancor Holding Co., LTD.",
        "summary": "Swancor Holding Co., LTD. produces and sells chemical products in Taiwan and internationally. The company offers vinyl ester and UP resins, including epoxy vinyl ester and unsaturated polyester resins, and epoxy adhesives; vinyl ester resins and epoxy systems for wind turbine blades; and epoxy composite resins, such as hand lay-up, filament winding, RTM/infusion, pultrusion, and solvent type epoxy resins, as well as carbon fiber and epoxy resins for prepreg. It also provides vinyl ester resins for marine applications; electrical insulating materials for use in large-scale casting application in the electronics and heavy electrical industries; and SMC/BMC resins and low profile additives. The company was founded in 1992 and is headquartered in Nantou City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Nantou City",
        "zipcode": "54066",
        "website": "http://www.swancor.com.tw",
        "market_cap": 10776832000
    },
    "4538.TWO": {
        "short_name": "WINSON MACHINERY CASTING CO LTD",
        "long_name": "WINSON Machinery Co., LTD.",
        "summary": "WINSON Machinery Co., LTD. manufactures and sells machine tool, wind power, ductile iron, and grey iron castings in Taiwan. Its products include beds for grinding M/C, heads for vertical milling M/C, beds for milling M/C, beams for vertical milling M/C, tables for double-column milling M/C, beds for slant lathe, beds for lathe M/C, beds for vertical lathe, and beds for CNC lathe, as well as beams, columns, tables, and beds. The company was founded in 1980 and is based in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "505",
        "website": "http://www.wsmc.com.tw",
        "market_cap": 996505984
    },
    "4558.TWO": {
        "short_name": "Alformer",
        "long_name": "ALFORMER Industrial Co., Ltd.",
        "summary": "ALFORMER Industrial Co., Ltd. produces and processes aluminum products in Taiwan. Its products include aluminum and industrial extrusions, aluminum electrolysis (anode treatment), aluminum doors and windows, airtight windows, aluminum curtain walls, solar panels, frames and brackets, building materials, greenhouse project, CNC milling, and forging, as well as solar energy engineering products. The company was founded in 1989 and is based in Changhua City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua City",
        "zipcode": "521",
        "website": "http://www.alformer.com.tw",
        "market_cap": 1587600000
    },
    "4706.TWO": {
        "short_name": "TAH KONG CHEMICAL IND CORP",
        "long_name": "Tah Kong Chemical Industrial Corporation",
        "summary": "Tah Kong Chemical Industrial Corporation manufactures, processes, and sells paints, pigments and intermediates in Taiwan, Southeast Asia, Japan, China, the United States, and Australia. The company offers PVC, PU, and polyolefin processed pigments. It also provides aqueous pigment dispersions and UV curable products; and organic pigments, which are used in ink, plastic, rubber, fiber, paint, stationery, etc. In addition, the company offers functional masterbatch that includes non-halogen flame retardant TPU compound, TPU anti-blocking and lubricant masterbatch, TPU fogging agent masterbatch, black electric conductive PE masterbatch, TPA weather resistant PE functional masterbatch, and anti-microbial PE masterbatch. Tah Kong Chemical Industrial Corporation was founded in 1966 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "115",
        "website": "http://www.tkc.com.tw",
        "market_cap": 1493666944
    },
    "4716.TWO": {
        "short_name": "DAILY POLYMER CORP",
        "long_name": "Daily Polymer Corp.",
        "summary": "Daily Polymer Corp. manufactures and sells synthetic resins in Taiwan. It offers polymer materials, including solvent and water based resins for paints, unsaturated polyester resins, and paint additives; and UV curing pressure sensitive adhesives. The company also provides photo-electronic materials, such as liquid crystals and alignment materials; and conductive polymers. It also exports its products to Southeast and Middle Asia, India, Japan, Africa, and Hong Kong. Daily Polymer Corp. was founded in 1970 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "814",
        "website": "http://www.daily-polymer.com",
        "market_cap": 1135492096
    },
    "4721.TWO": {
        "short_name": "MECHEMA CHEMICALS INTL CORPN",
        "long_name": "Mechema Chemicals International Corp.",
        "summary": "Mechema Chemicals International Corp. supplies oxidation catalysts worldwide. The company supplies magnetic material cobalt lithium secondary batteries and materials; and specialty chemicals. It also provides PTA oxidation catalyst, CTA pretreatment, PTA M.L. recovery, and electromagnetic industry services. The company was founded in 1930 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "32849",
        "website": "http://www.mechema.com",
        "market_cap": 4589143040
    },
    "4722.TW": {
        "short_name": "QUALIPOLY CHEMICAL CORP",
        "long_name": "Qualipoly Chemical Corporation",
        "summary": "Qualipoly Chemical Corporation manufactures and supplies polyurethane resins, wire enamels, and insulating varnish. The company offers UV curable materials used in various applications, such as wood coatings, plastics and metal coatings, adhesives and lacquers for CD/DVD, over print varnishes, optical films, and additives for electronic/optical parts; and unsaturated polyester resins for use in FRPs, color pastes and gelcoats, fire retardants, castings, synthetic marbles, buttons, decorative panels, coatings and putties, SMC/BMCs, and ISO-type FRPs. It also provides coating resins comprising alkyd resins used in various applications, which include tinting colors, ink, white ready mixed paints, air-drying paints, baking paints, 2K and NC matted primers, acid-curing, marine primer, wrinkle finishes, paints on wood, plastic and glass, etc.; acrylic resins for use in baking paints on metal, acid-curing amino-alkyd paints on wood applications, etc.; and amino resins used in various applications consisting of paints on concrete, pints for road marking, printing inks, and coil pints, as well as varnishes/paints on paper, wood, plastic, and metal. In addition, the company offers foundry resins that are used as cement and adhesive, casting resin, coating, and impregnant; insulating varnishes used in the manufacture of transformers, and coil and enamel-insulated wires for insulating system in the electronic devices; and polyurethane rigid foam resins used to manufacture wood-imitation materials, soft floor, and fillers. Further, it provides PVAC and acrylic emulsion resins to manufacture tapes of general purpose, pressure sensitive adhesive, glues, and others; and fiber glass. The company markets its products in approximately 40 countries under the Qualipoly and QualiCure brand names. Qualipoly Chemical Corporation was founded in 1978 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "82841",
        "website": "http://www.qualipoly.com",
        "market_cap": 3294545664
    },
    "4738.TWO": {
        "short_name": "TFC",
        "long_name": "Tatung Fine Chemicals Co.",
        "summary": "Tatung Fine Chemicals Co. develops, manufactures, and sells nano-products in Taiwan. The company offers aqueous concentrated pigment dispersions for ink-jet inks and photo-catalyst paints. It also provides lithium iron phosphate, a cathode material for high power lithium ion batteries, as well as vanish, ink, TiO, and acrylic CED products. The company was formerly known as Tatung Coatings Company and changed its name to Tatung Fine Chemicals Co. in 2003. Tatung Fine Chemicals Co. was founded in 1970 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "328",
        "website": "http://www.twtfc.com",
        "market_cap": 562571008
    },
    "4739.TW": {
        "short_name": "COREMAX CORPORATION",
        "long_name": "Coremax Corporation",
        "summary": "Coremax Corporation researches, develops, produces, manufactures, and sells metal-based specialty chemicals and electronic materials in Taiwan, China, and Thailand. It offers oxidation catalysts in liquid and crystalline forms; specialty chemicals for use in tires, pigments, paints, electronic, and traditional industries; battery materials that are used in the manufacturing of rechargeable lithium-ion batteries; and chemical and organic compound fertilizers. The company was formerly known as Coremax Taiwan Corporation and changed its name to Coremax Corporation in 2000. The company was founded in 1992 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "303035",
        "website": "http://www.coremaxcorp.com",
        "market_cap": 7555090432
    },
    "4741.TWO": {
        "short_name": "JETBEST CORPORATION",
        "long_name": "Jetbest Corporation",
        "summary": "Jetbest Corporation researches and develops, manufactures, and sells inkjet printing products in Taiwan. The company offers various inks, such as UV inks; and wide format inks, including eco solvent pigments, mild solvent pigments, water dyes and pigments, oil-based dyes and pigments. It also provides textile inks comprising dye sublimation and disperse inks, resin pigments, and reactive dyes; magic inks; desktop inks; nano and resin-free colorants; and bulk systems consisting of refilled cartridges. The company also distributes its products approximately in 80 countries. Jetbest Corporation was founded in 2004 and is based in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30093",
        "website": "http://www.jetbest.com",
        "market_cap": 825976256
    },
    "4754.TWO": {
        "short_name": "INTERNATIONAL CARBIDE TECHCO LT",
        "long_name": "INternational CArbide Technology Co., Ltd.",
        "summary": "INternational CArbide Technology Co., Ltd. manufactures and sells firestop products in Taiwan. The company offers firestop system, such as fire barrier caulks, fire barrier silicone sealants, moldable firestop and firestop putty products, intumescent strips, fire barrier foams, firestop bricks, firestop sheets, mortar, fireproof blankets, and coated firestop boards/coatings. It also provides elastomeric fire caulks, putty pads, fireproof paints for wood, intumescent coating, high intumescent lamination, firestop tapes, smoke and acoustic sealants, and spray products, as well as fireproof protections for cable/electrical systems. The company was founded in 1998 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33842",
        "website": "http://www.incatech.com.tw",
        "market_cap": 832794944
    },
    "4765.TWO": {
        "short_name": "PANCOLOUR",
        "long_name": "Pancolour Ink Co., Ltd.",
        "summary": "Pancolour Ink Co., Ltd. manufactures and sells UV curable inks, coatings, and adhesives in Taiwan. It offers UV curable printing inks for IC chips, optical discs, plastics, and paper products; UV curable adhesives for bonding needs of metal, glass, and other materials that are applied in handicraft and electronic industries; and UV curable coatings for use in plastic flexible tubes and paper spot varnish for screen print, etc. The company provides its products under the PANOVA, PANCURE, PANOLEN, and RADITHO names. Pancolour Ink Co., Ltd. was founded in 1997 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33383",
        "website": "http://www.pancolourink.com",
        "market_cap": 955956736
    },
    "4766.TW": {
        "short_name": "NAN PAO RESINS CHEMICAL CO LTD",
        "long_name": "Nan Pao Resins Chemical Co., Ltd.",
        "summary": "Nan Pao Resins Chemical Co., Ltd. manufactures, wholesales, and retails synthetic resins and plastics, adhesives, resin coatings, dyes, and pigments in Taiwan, Mainland China, and Southeast Asia. It offers footwear adhesives, including cleaners, primers, hardeners, and shoe adhesives. The company also provides adhesives and specialties, such as textile, woodworking and furniture, construction, graphic arts, tape and label, paper converting, rigid packaging, leather coating, specialty, flexible package, construction and decoration, nonwoven, pressure sensitive, and other adhesives, as well as product assemblies. In addition, it offers hot melt adhesives; building and construction, flooring and concrete, heavy duty anti rust, industrial, eco green, functional, and indoor and outdoor powder coatings, as well as coatings for special applications; and construction materials comprising grouts, waterproof products, sealants, deadeners, and bituminous products. The company was founded in 1963 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "723",
        "website": "http://www.adhesivegluemaker.com",
        "market_cap": 18447210496
    },
    "4767.TWO": {
        "short_name": "CHERNG TAY TECHNOLOGY CO LTD",
        "long_name": "Cherng Tay Technology Co., Ltd.",
        "summary": "Cherng Tay Technology Co., Ltd. manufactures and sells adhesives in Taiwan and internationally. The company offers hot melt adhesive products for packaging, bookbinding, assembly, and footwear applications; waterproofing materials, including waterproofing membranes and glues; and reactive hot melt adhesives. Cherng Tay Technology Co., Ltd. was founded in 1983 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "821",
        "website": "http://www.chetay.com.tw",
        "market_cap": 802653248
    },
    "4768.TWO": {
        "short_name": "INGENTEC",
        "long_name": "Ingentec Corporation",
        "summary": "Ingentec Corporation manufactures and supplies fine chemicals and high pressure gas containers to semiconductor front end, semiconductor package, and flat panel display processes. The company offers laser gas; silicon wafer related products, such as quartz crucibles, and polished and reclaim wafers; and specialty gas and wet chemical related products, including PSA argon gas recovery and purification systems, specialty gas, and texturing chemical. It also offers special materials and tools comprising chillers, LED metal clad substrates, mass flow meters and controllers, pigment, sputtering target materials, and thermal spray coatings powder; and solar cell related products, such as platelet calcined alumina, laser machine for PERC and boron dope, SiC powder, slurry recycle systems, solar quartz crucibles, and tungsten seed cables. The company was founded in 2010 and is headquartered in Zhunan, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhunan",
        "zipcode": "35059",
        "website": "http://www.ingenteccorp.com.tw",
        "market_cap": 3124968448
    },
    "4989.TW": {
        "short_name": "LCY TECHNOLOGY CORP",
        "long_name": "LCY Technology Corp.",
        "summary": "LCY Technology Corp. produces and sells copper foil products for the printed circuit board and copper clad laminate manufacturers in Taiwan and internationally. It offers 4oz, 3oz, 2oz, 1oz, 1/2oz, 1/3oz, and 9Âµm copper foils, as well as thin, very low profile, double treatment, and reverse treatment copper foils. The company was founded in 1997 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "105",
        "website": "http://www.lcyt.com.tw",
        "market_cap": 6735739904
    },
    "5234.TW": {
        "short_name": "DAXIN MATERIALS CORPORATION",
        "long_name": "Daxin Materials Corporation",
        "summary": "Daxin Materials Corporation provides display and green energy related fine chemicals in Taiwan. It offers semiconductor materials comprising laser release layers, temporary bonding adhesives, and photosensitive dielectrics; display materials, such as LCD, touch panel, and OLED materials; green materials consisting of battery materials; and anhydride monomers. The company was founded in 2006 and is headquartered in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "40763",
        "website": "http://www.daxinmat.com",
        "market_cap": 8956834816
    },
    "5340.TWO": {
        "short_name": "BAOTEK INDUSTRIAL MATERIALS LTD",
        "long_name": "Baotek Industrial Materials Ltd.",
        "summary": "Baotek Industrial Materials Ltd. manufactures and sells fiberglass fabrics in primarily Taiwan, China, and internationally. It offers aerospace fiberglass fabric, a reinforcement material for airplanes' internal structure; high temperature filter bag used in power and steel plants, incinerators, and cement factories; fiberglass sun shade that are use in buildings, interior designs, construction, and furniture; PTFE fabrics for use in PTFE coating areas; and electronic fiberglass fabrics. The company was founded in 1992 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "326",
        "website": "http://www.baotek.com.tw",
        "market_cap": 6899248128
    },
    "6151.TWO": {
        "short_name": "GINAR TECHNOLOGY",
        "long_name": "Ginar Technology Co.,Ltd.",
        "summary": "Ginar Technology Co., Ltd. produces and sells performance materials in the field of engineering thermoplastics in Asia, the Americas, Europe, and internationally. It offers MAPEX polyamide engineering plastics, such as impact modified, mineral reinforced, glass fiber reinforced, and flame retardant polyamide 6, polyamide 66, and high temperature nylon compounds for automotive, electrical/electronic, and other industries; and mineral fiber, glass fiber, and impact modifier or flame retardant APLAX polypropylene engineering plastics. The company also provides impact modification and glass fiber reinforcement or flammability KAPEX polycarbonate engineering plastics; KAPEX PC/ABS alloys for cars instrument panels and dashboards, notebook covers, and cell phones; and KAPEX green products that contain r-PET and/or r-PC, which are from post-consumer recycled products for notebook PC, desktop PC, LED TV, monitor, and OA products. In addition, it offers flame retardant high performance nylon composite engineering plastics. The company's products are used for automotive and consumer electronics applications. Ginar Technology Co., Ltd. was founded in 1982 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33759",
        "website": "http://www.ginar.com.tw",
        "market_cap": 2340133888
    },
    "6175.TWO": {
        "short_name": "LITON TECHNOLOGY CORP",
        "long_name": "Liton Technology Corp.",
        "summary": "Liton Technology Corp. manufactures and sells etched and formed aluminum foils in Taiwan, Mainland China, Europe, the Americas, Japan, Korea, India, and Southeast Asia. The company offers middle and high voltage formed aluminum foils; low voltage formed aluminum foils; and middle and high voltage etched aluminum foils. Its products are used in industries and products, such as aerospace, high-speed rail, MRT systems, solar and wind power, computers, mobile phones, automobiles, home appliances, and industrial products. The company was formerly known as Liton Electrics Corp. and changed its name to Liton Technology Corp. in April 1998. Liton Technology Corp. was founded in 1993 and is headquartered in Miaoli, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Miaoli",
        "zipcode": null,
        "website": "http://www.liton.com.tw",
        "market_cap": 5280417280
    },
    "6434.TWO": {
        "short_name": "TacBright",
        "long_name": "TacBright Optronics Corp.",
        "summary": "TacBright Optronics Corporation researches, develops, manufactures, and sells triacetate cellulose (TAC) films. It offers TAC films for protective film in liquid crystal displays (LCDs), as well as for sunglasses, photographic equipment filters, anti-glare goggles, car navigation, other polarizing microscopes, special medical glasses, and other purposes. The company serves LCD polarizer manufacturers in Taiwan, South Korea, Japan, and Mainland China. TacBright Optronics Corporation was founded in 2006 and is based in Miaoli, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Miaoli",
        "zipcode": null,
        "website": "http://www.tacbright.com",
        "market_cap": 3319390208
    },
    "6495.TWO": {
        "short_name": "Nanoplus",
        "long_name": "Nanoplus Ltd.",
        "summary": "Nanoplus Ltd. engages in the production, purification, grading, and development of nano diamond powder. The company is also involved in the research and development, and production of thermal materials for thermal dissipation. In addition, it offers environmental wastewater treatment. Further, the company provides laser processing technology solutions. The company was founded in 2011 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "114",
        "website": "http://www.nanoplustech.com",
        "market_cap": 2340988672
    },
    "6508.TWO": {
        "short_name": "HUIKWANG CORPORATION",
        "long_name": "Huikwang Corporation",
        "summary": "Huikwang Corporation manufactures and sells agrochemical in Taiwan and China. It offers insecticides, fungicides, herbicides, miticides, surfactants, and attractants for use in crop protection. The company was founded in 1965 and is based in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "72152",
        "website": "http://www.huikwang.com",
        "market_cap": 2546115584
    },
    "6509.TWO": {
        "short_name": "TAIWAN HOPAX CHEMS.MFG.CO",
        "long_name": "Taiwan Hopax Chems.Mfg.Co.,Ltd.",
        "summary": "Taiwan Hopax Chems.Mfg.Co.,Ltd. produces and sells diversified chemical products in the areas of specialty chemicals, fine chemicals, and repositionable self-adhesive products in Taiwan and internationally. The company offers papermaking chemicals, including dispersants, carbonless paper chemicals, paper coating chemicals, and wet end chemicals; water treatment chemicals, such as wastewater treating compounds, and chemicals for cooling water and boiler water; and combo packs, paper notes, cubes, line/assorted/pop-up notes, markers/index tabs/flags, clear notes, special and designing notes, and re-stick tape info boards/meeting pads. The company was founded in 1975 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "831",
        "website": "http://www.hopax.com.tw",
        "market_cap": 5412624896
    },
    "6582.TW": {
        "short_name": "SHIN FOONG SPECIALTY AND APPLIE",
        "long_name": "Shin Foong Specialty and Applied Materials Co., Ltd.",
        "summary": "Shin Foong Specialty and Applied Materials Co., Ltd. manufactures and sells synthetic SBR and NBR rubber latex products, and adhesives in Taiwan. Its products are used in various applications, such as paper coating, carpet backing, and paper and textile saturation; non-formaldehyde plywood adhesive, veneer fancy adhesive, middle density fiberboard adhesive, and wood lamination adhesive; emulsion resin for outdoor wall paint; and glove dipping. The company was formerly known as Shin Foong Chemical Industry Co., Ltd and changed its name to Shin Foong Specialty and Applied Materials Co., Ltd. in September 2016. Shin Foong Specialty and Applied Materials Co., Ltd. was founded in 1979 and is headquartered in Pingtung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Pingtung",
        "zipcode": "94048",
        "website": "http://www.shinfoong.com.tw",
        "market_cap": 30616774656
    },
    "6585.TWO": {
        "short_name": "DingZing",
        "long_name": "DingZing Advanced Materials Inc.",
        "summary": "DingZing Advanced Materials Inc. researches, develops, produces, and sells composite materials and technical films for various industries in Taiwan. Its products include Provecta series of advanced technical films that provide an alternative to rubber and traditional plastic; Advanta technical films for clothing applications; Orkesta series of composite materials with a layer of hot melt film designed to replace conventional materials, such as microfiber or genuine leather; Perfola air hoses and hydration tubes; Aldura transmission and conveyor belts; and DingZing DZ seals. The company's products are used in apparel, automotive, electronic, wearable, footwear, healthcare, optical, outdoor and sport goods, and furniture and bedding applications. DingZing Advanced Materials Inc. is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "81266",
        "website": "http://www.dingzing.com",
        "market_cap": 4259121408
    },
    "6655.TW": {
        "short_name": "KEDING ENTERPRISES CO LTD",
        "long_name": "Keding Enterprises Co., Ltd.",
        "summary": "Keding Enterprises Co., Ltd. produces and sells wood products worldwide. It offers prefinished furnishings, wood veneered panels, wood floorings, and interior wood doors. Keding Enterprises Co., Ltd. was founded in 2002 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "241",
        "website": "http://www.twkd.com",
        "market_cap": 5093706752
    },
    "6729.TWO": {
        "short_name": "Lumtec",
        "long_name": "Luminescence Technology Corp.",
        "summary": "Luminescence Technology Corp. manufactures and sells organic chemicals in North America, Europe, Asia, and Taiwan. Its product-range includes organic light emitting diode (OLED) material, OPV material, OTFT material, organic intermediates, boronic acid, and ITO patterned glass and components. The company offers patented materials, biomedical science, organic light emitting diode (OLED), thermally activated delayed fluorescence OLED, solution-processed OLED, organic photovoltaic, dye-sensitized solar cell, perovskite solar cells, organic thin-film transistor, flexible printed electronics, photonic and optical device, synthetic intermediates and reagents, and electrode/substrate and sealing. It offers organic optoelectronic materials in the markets of OLED, OPV, and OTFT have led luminescence technology. Luminescence Technology Corp. is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "22175",
        "website": "http://www.lumtec.com.tw",
        "market_cap": 465484064
    },
    "6731.TWO": {
        "short_name": "FST",
        "long_name": "Femco Steel Technology Co., Ltd.",
        "summary": "Femco Steel Technology Co., Ltd. designs, manufactures, markets, and distributes steel golf shafts to golf club original equipment manufacturers and distributors worldwide. The company offers steel shafts under the FST and KBS brand names. Femco Steel Technology Co., Ltd. is based in Chiayi, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Chiayi",
        "zipcode": null,
        "website": "http://www.femcosteel.com.tw",
        "market_cap": 1198425856
    },
    "6737.TWO": {
        "short_name": "SOLIDYEAR",
        "long_name": "Solid Year Co., Ltd.",
        "summary": "Solid Year Co., Ltd. engages in the production of various single-shot and double-shot plastic injection finished products. Its products include computer keyboard, USB network camera, USB network camera module, driving recorder, hunting machine, projector, gamepad, automotive electronics, in-car multimedia audio and video system, smart rear-view mirror, head-up display, iPhone Computer electronic peripheral products, such as Car Box, infant network surveillance camera, etc. The company was founded in 1975 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.solidyear.com",
        "market_cap": 5502177280
    },
    "8354.TWO": {
        "short_name": "KOAN HAO TECHNOLOGY CO LTD",
        "long_name": "Koan Hao Technology Co., Ltd.",
        "summary": "Koan Hao Technology Co., Ltd. manufactures and sells self-adhesive labels in Taiwan. It offers release papers, including PE coated Kraft, glassine, clay coated Kraft, and super calandered Kraft paper; film release liners, such as PET, PP, and HDPE release liners; and adhesive tapes, such as surface protective films, adhesive transfer tapes, and film and non-woven tissue double sided adhesive tapes. The company also provides PSA label materials comprising paper, film, tamper evident, and re-sealable labels; and thermal and UV release film tapes, and PE laminated non-woven products, as well as contract coatings. It serves decorative, electronics and optoelectronics, automobiles, logistics, food and beverage, and consumer commodity industries. The company was formerly known as Koan Hao Enterprise Co., Ltd. and changed its name to Koan Hao Technology Co., Ltd. in 2013. Koan Hao Technology Co., Ltd. was founded in 1992 and is headquartered in Nantou City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Nantou City",
        "zipcode": "54066",
        "website": "http://www.koanhao.com",
        "market_cap": 1229025792
    },
    "8424.TWO": {
        "short_name": "WELLPOOL CO LTD",
        "long_name": "Wellpool Co., Ltd.",
        "summary": "Wellpool Co., Ltd. manufactures and sells fireproof and environmental protection green building materials. It offers calcium silicate and fiber cement boards. The company was founded in 1981 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.wellpool.com.tw",
        "market_cap": 2083979008
    },
    "8431.TWO": {
        "short_name": "SUPERIOR PLATING TECHNOLOGY CO ",
        "long_name": "Superior Plating Technology Co., Ltd.",
        "summary": "Superior Plating Technology Co., Ltd. operates as a surface treatment company in Taiwan. The company engages in the research and development of metal and plastic surface treatment technology and manufacturing services. It also provides plating services for the semiconductor lead frames, terminals, strips, and LED stents. In addition, the company provides plating services for HDD products, medical equipment, auto parts, connectors, and OA products; and anodizing services to 3C products and industrial products. Superior Plating Technology Co., Ltd. was founded in 1999 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.superior-sz.com",
        "market_cap": 2699033600
    },
    "8435.TWO": {
        "short_name": "ZIMMITE TAIWAN LTD",
        "long_name": "Zimmite Taiwan Ltd.",
        "summary": "Zimmite Taiwan Ltd. engages in the industrial water treatment activities in Taiwan and China. It offers cooling water treatment agents, such as corrosion inhibitors, scale inhibitors, algaecides, biocides, rust removers, and cooling water all-in-one tablets; and boiler water treatment agents, including internal treatment additives, oxygen scavengers, neutralizing amines, and filming amines. The company also provides boiler fireside treatment additives comprising fuel oil additives and soot removers; and oil refinery and petrochemical process additives consisting of corrosion inhibitors, antifoulants, desalting agents, demulsifiersÂ\u0096emulsion breakers, antifoamers/defoamers, metal passivating agents, polymerization inhibitors, and antioxidants. In addition, it offers wastewater treatment agents, including polymer flocculants, dewatering aids, heavy metal chelators, deodorants, and COD degradation agents; slow release tablets, such as cooling water treatment tablets, drain pan slime preventive tablets, and chlorine donors; and RO and scrubber chemicals. Further, the company provides environmental protection testing and technical services; water treatment technology supports; and oil mud dispersants, as well as sells water treatment raw materials. It primarily serves oil refineries and petrochemicals production plants, steel mills, power generation plants, office buildings, textile manufacturing processes, plastic manufacturing plants and processors, electronic manufacturing sector, and public facilities. Zimmite Taiwan Ltd. was founded in 1977 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.zimmite.com",
        "market_cap": 1800560000
    },
    "8438.TWO": {
        "short_name": "AMIA",
        "long_name": "Amia Co.,Ltd",
        "summary": "Amia Co.,Ltd manufactures and sells copper sulfate in Taiwan. It also offers oxides and carbonates. The company also exports its products. Amia Co.,Ltd was founded in 1974 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "337",
        "website": "http://www.persee.com.tw",
        "market_cap": 2551446784
    },
    "8463.TW": {
        "short_name": "RUENTEX MATERIALS CO LTD",
        "long_name": "Ruentex Materials Co.,Ltd.",
        "summary": "Ruentex Materials Co.,Ltd. produces and sells cement in Taiwan. It offers Portland blast furnace cement, Portland cement, and hearthstone powder. The company also provides mortar material, surface powder, adhesive material, caulk, non-shrinking mortar, mud, and elastic cement, as well as offshore grouting and home improvements. The company was founded in 1992 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.rtm.com.tw",
        "market_cap": 5407499776
    },
    "8935.TWO": {
        "short_name": "PONTEX POLYBLEND CO",
        "long_name": "Pontex Polyblend Co.,Ltd",
        "summary": "Pontex Polyblend Co., Ltd. engages in footwear injection molding and engineering plastics compound materials businesses in Taiwan. It offers ABS, PC, nylon, PP, PBT, NPE, TPU, PLA, PBS, and r-PET plastic products for applications in the areas of 3C/electronic products, industrial equipment parts, auto/moto parts, household goods, sports/toy parts, and medical supplies. The company also provides sports equipment, such as baseball, football, soccer, and bicycle outsoles; and shoe components, including midsoles, shanks, and counters. In addition, it manufactures various women vamps injection products on an OEM basis for the CROCS' brand. Pontex Polyblend Co., Ltd. was founded in 1982 and is headquartered in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "42742",
        "website": "http://www.pontex.com",
        "market_cap": 1066394944
    },
    "8942.TWO": {
        "short_name": "XXENTRIA TECHNOLOGY MATERIALS C",
        "long_name": "Xxentria Technology Materials Co., Ltd.",
        "summary": "Xxentria Technology Materials Co., Ltd. manufactures and sells metal composite materials worldwide. The company develops products with metal and plastic components. It offers exterior facades cladding and interior furnishing for new buildings, as well as refurbishment; and lacquer coated solid aluminum panels, as well as anodized and PVD-coating materials for architectural applications. The company also provides solar receiver tubes and tube coatings; and reflective composites materials for solar thermal applications. In addition, it offers wall and door panels for truck and trailer bodies; galvanized steel composite panels; and high tensile aluminum composite panels for transportation applications. The company was founded in 1994 and is headquartered in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan",
        "zipcode": "711",
        "website": "http://www.xxentria-tech.com",
        "market_cap": 11835672576
    },
    "9927.TW": {
        "short_name": "THYE MING INDUSTRIAL CO",
        "long_name": "Thye Ming Industrial Co., Ltd.",
        "summary": "Thye Ming Industrial Co., Ltd. manufactures and sells lead alloys and lead oxide in Asia. It provides litharge, red lead, antimonial and calcium lead alloys, and lead ingots. The company's products are used in storage battery, PVC stabilizer, lead glass, ceramic glaze, pigment, crystal and optical glass, paint, terminal connector, type metal, casting metal, fishnet sinker, lead oxide, solder, lead brick, and lead plate applications. It also operates lead recycling smelters. The company was founded in 1994 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": null,
        "website": "http://www.tmicl.com.tw",
        "market_cap": 7111031808
    },
    "9957.TWO": {
        "short_name": "YUSCO",
        "long_name": "Yieh United Steel Corp.",
        "summary": "Yieh United Steel Corp. produces and sells stainless steel products in Taiwan and internationally. The company offers stainless steel billets, hot rolled black coils and plates, coils and sheets, cold rolled coils and sheets, and slabs for home and office uses, and industrial and transport applications, as well as for architecture, building, and construction applications. It also provides carbon steel products, including carbon steel slabs, billets, blacks, and plates for industrial applications. The company was founded in 1988 and is based in Kaohsiung City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung City",
        "zipcode": "82057",
        "website": "http://www.yusco.com.tw",
        "market_cap": 25313161216
    },
    "9962.TWO": {
        "short_name": "YEOU YIH STEEL CO LTD",
        "long_name": "Yeou Yih Steel Co., Ltd.",
        "summary": "Yeou Yih Steel Co., Ltd. manufactures and sells hot rolled stainless steel plates and flat bars primarily in Taiwan. The company was founded in 1996 and is based in Kaohsiung City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "82841",
        "website": "http://www.yeouyih.com.tw",
        "market_cap": 1001442048
    },
    "CNS.SG": {
        "short_name": "CHINA STEEL CORP. Reg. Shs (GDR",
        "long_name": "China Steel Corporation",
        "summary": "China Steel Corporation manufactures and sells steel products primarily in Taiwan, Vietnam, Malaysia, China, India, and internationally. The company offers steel plates for construction structures, shipbuilding, bridges, oil country tabular goods, steel structures, pressure vessels, storage tanks, truck chassis, general structural components, and boilers; and steel bars and wire rods for bolts and nuts general and machine structures, cold forging, hot forging, tire cords, umbrella ribs, chains, hand tools and welding electrodes. It also provides hot-rolled coils and sheets for Steel pipes and tubes, vehicle parts, containers, pressure vessels, jacks, cold-rolled and galvanized steels, light steel frame and formed processed products; and cold-rolled coils for automobile panels home appliances, drums, steel pipes and tubes, galvanized steels, and general hardware. In addition, the company offers color coils for roofing and walling, appliances, kitchenware, furniture, transportation vehicle materials, and interior decoration materials; electrical steel coils for manufacturing motors, transformers, stabilizers, relays, and cores of electric panels; electro-galvanized coils; and hot-dip galvanized coils. Further, it engages in the mechanical, communications, and electrical engineering activities; and ocean freight forwarding and bulk shipping transportation activities. Additionally, the company offers titanium-nickel, aluminum, and other non-ferrous metals, machinery and equipment, magnetic materials, specialty chemicals, ferric iron oxide, electronic ceramics; designs and sells IT hardware and software; and introduces and develops biology, as well as develops, sells, and rents land and commercial real estate properties. It also provides steel product agency and trading, guard security and system security, and management consultancy services; and generates solar power. The company was founded in 1971 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "81233",
        "website": "http://www.csc.com.tw",
        "market_cap": 17315561472
    }
}