{
  "1108.TW": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Building Materials",
    "long_name": "Lucky Cement Corporation",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "LUCKY CEMENT CO.",
    "state": null,
    "summary": "Lucky Cement Corporation, together with its subsidiaries, manufactures and sells cement in the People's Republic of China. The company offers Portland cement, ready mix concrete, hot cement, low-alkali Portland cement, slag powder, limestone, specification stones, and gravels, as well as ashes. It also engages in construction business; and provides shipping agent and transportation services. In addition, the company is involved in the sale and lease of residential and commercial buildings, parking lots, and industrial areas; and investment, cement trading, and gravel mining businesses. Lucky Cement Corporation was founded in 1974 and is headquartered in Taipei City, Taiwan.",
    "website": "http://www.luckygrp.com.tw",
    "zipcode": null
  },
  "8424.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Building Materials",
    "long_name": "Wellpool Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "WELLPOOL CO LTD",
    "state": null,
    "summary": "Wellpool Co., Ltd. manufactures and sells fireproof and environmental protection green building materials. It offers calcium silicate and fiber cement boards. The company was founded in 1981 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.wellpool.com.tw",
    "zipcode": null
  },
  "8463.TW": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Building Materials",
    "long_name": "Ruentex Materials Co.,Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "RUENTEX MATERIALS CO LTD",
    "state": null,
    "summary": "Ruentex Materials Co.,Ltd. produces and sells cement in Taiwan. It offers Portland blast furnace cement, Portland cement, and hearthstone powder. The company also provides mortar material, surface powder, adhesive material, caulk, non-shrinking mortar, mud, and elastic cement, as well as offshore grouting and home improvements. The company was founded in 1992 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.rtm.com.tw",
    "zipcode": null
  }
}
