{"1301.TW": {"short_name": "FORMOSA PLASTIC", "long_name": "Formosa Plastics Corporation", "summary": "Formosa Plastics Corporation produces and sells intermediate raw materials for plastics in Taiwan, Mainland China, and internationally. Its plastic products include PVC resins, high density polyethylene resins, linear low density polyethylene resins, ethylene vinyl acetate copolymer resins, PE wax, polypropylene (PP), polyoxymethylene, and PP or PE-based masterbatches. The company also provides chemicals, such as liquid caustic soda, caustic soda solid, liquid chlorine, vinyl chloride monomers, ethylene dichloride, acrylonitrile, acetonitrile, methyl methacrylate, methacrylic acid, epichlorohydrin, methyl tertiary butyl ether, acrylic acid and esters, SAP chemicals, and n-butanol; and petrochemical products. In addition, it offers carbon fibers; electronic products comprising distributed control systems, WMS, real-time production management systems, SCS-2000, and laboratory information management systems; and other products, including processing aids, methyl methacrylate-butadiene-styrene, sodium hypochlorite, chlorinated solvents, hydrogen, lithium-ion battery electrolytes, lime, calcium carbonate, and hydrochloric acid. The company provides its products for use in various applications, such as household items, outdoor sports, mechanical engineering, building materials coatings, 3C appliances, civil farm animals, and other applications. Formosa Plastics Corporation was founded in 1954 and is headquartered in Kaohsiung City, Taiwan.", "currency": "TWD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Kaohsiung"}, "1303.TW": {"short_name": "NAN YA PLASTIC", "long_name": "Nan Ya Plastics Corporation", "summary": "Nan Ya Plastics Corporation manufactures and sells plastics products, plastic materials, petrochemicals, electronic materials, and polyester fiber products in Taiwan, China and Hong Kong, the United States, and internationally. It provides plastics products comprising PP synthetic papers, adhesives, optical films, outdoor and interior decoration materials, synthetic leather, TPU films, PU resins, fire rated doors, windows, plastic pallets, PVC cling films, PE stretch films, engineering and PVC compounds, unsaturated polyester, pipes and fittings, rigid sheets, A-PET sheets/rigid films, PVC sheets, PP sheets, and injection molding products, as well as decoration, window, and PET films. The company also offers electronic materials, including copper clad laminates, glass fabrics, liquid crystal display products, touch panels, copper foils, and PCB inks. In addition, it provides chemicals, such as phthalate plasticizers; phthalic anhydride; alcohols; glycols; curing agents; hydrogen peroxide; tetrahydrofuran; 1,4-butanediol; bisphenol-A; maleic anhydride; epoxidized soybean oil; stabilizer; liquefied gas; and epoxy resin. Further, the company provides fiber and textile products, such as draw textured yarns, spin drawn yarns, partially and fully oriented yarns, polyester staple fibers, PET resins, polyester films, polyester release films, and woven and knitting fabrics. Additionally, it offers machinery and switchgear products, including HV/LV switchgears, cast resin transformers, vacuum contactor switches, molds, rollers, and screws and barrels. The company was founded in 1958 and is headquartered in Kaohsiung City, Taiwan.", "currency": "TWD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Kaohsiung"}, "1309.TW": {"short_name": "TAITA CHEMICAL", "long_name": "Taita Chemical Company, Ltd.", "summary": "Taita Chemical Company, Ltd. produces and sells styrenics in Taiwan. The company offers acrylonitrile-butadiene-styrene resin, a terpolymer plastic under the TAITALAC brand; general purpose and high impact polystyrene under the TAITAREX brand name for use in food containers, CD cases, stationary, toys, insulation boards, business machines, electric and electrical appliances, and consumer goods; and expandable polystyrene resins under the TAITACELL brand name. It also provides glass wool materials; and engages in cubic printing, a process for applying decorative pattern to 3-dimensional products in various applications, including auto parts, home electronic appliances, IT products, home decoration, sport goods, stationery and gifts, and others. The company exports its products worldwide. Taita Chemical Company, Ltd. was founded in 1960 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "1711.TW": {"short_name": "EVERLIGHT CHEMICAL", "long_name": "Everlight Chemical Industrial Corporation", "summary": "Everlight Chemical Industrial Corporation produces and sells chemical products in Taiwan, rest of Asia, the Americas, Europe, and internationally. The company offers dyes for use in textile, leather, ink jet printing, digital textile printing, anodized aluminum, paper, and solar energy applications; specialty chemicals that are used in coatings, adhesives, plastics, polyurethanes, elastomers, and cosmetics; toners, cartridges, and carriers and developers for printers and ceramic ware; and electronic chemicals for use in yellow lithography, rinsing imaging, and substrate flattening process, as well as semiconductor and substrate surface cleaning, electroplating, surface coating, and electronic assembly applications. It also provides prostaglandin and other material medicines; and technical consulting services. Everlight Chemical Industrial Corporation was founded in 1972 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "1717.TW": {"short_name": "ETERNAL MATERIALS CO LTD", "long_name": "Eternal Materials Co., Ltd.", "summary": "Eternal Materials Co., Ltd. manufactures and sells resin, high performance, and electronic materials. The company offers resins materials, including polyester polyol, polyurethane, alkyd, solvent and water-based acrylic coating, amino, fluorocarbon, saturated and unsaturated polyester, other coatings, vinyl ester, and fire retardant resins, as well as acrylic resin for adhesives and overprinting; and optoelectronic materials, photovoltaic materials, epoxy system, structural adhesive, and polyester for polyurethane foam. It also provides UV monomers and oligomers, special coatings, silicone powders, additives, and 3D UV printing materials. In addition, the company offers printed circuit board materials, including dry film photoresists, dry film solder masks, UV inks, dry film photosensitive polyimides, paper phenolic copper clad laminates, and composite epoxy copper clad laminates; flat panel display and touch panel materials, such as dry film photoresists, liquid polyimide materials, prism films, and protective films; and vacuum laminators and toll coating services. Further, it provides biomedical materials, which includes biochemical and molecular diagnostics, recombinant proteins, and antibodies; liquid molding compound for WLP; solid capacitor materials; lithium battery materials; green process-less CTP plate photoresist; thermoplastic composites; and hydrophilic films. The company's products are used in energy, transportation, building and furniture, electronics, consumer products, packaging and printing, health care and medical, and metal machinery applications. It has operations in Taiwan, China, Japan, Vietnam, Thailand, the United States, India, Indonesia, Malaysia, Korea, and Italy. The company was formerly known as Eternal Chemical Co., Ltd. and changed its name to Eternal Materials Co., Ltd. in 2014. Eternal Materials Co., Ltd. was founded in 1964 and is headquartered in Kaohsiung City, Taiwan.", "currency": "TWD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Kaohsiung"}, "1726.TW": {"short_name": "YUNG CHI PAINT & VARNISH MFG CO", "long_name": "Yung Chi Paint & Varnish Mfg.Co.,Ltd", "summary": "Yung Chi Paint & Varnish Mfg.Co.,Ltd manufactures and sells coatings and paints primarily in Taiwan. The company offers architecture coatings, including water and solvent-based cement mortar paints, water-based lastomeric coatings, dirt off exterior acrylic emulsion paints, water-based epoxy topcoats, solvent-based acrylic paints, exterior wall and clear coatings, wood coatings, waterproof paints, and other used architecture coatings. It also provides heavy duty coatings, such as ready-mixed, top-long, enamel, PU, epoxy, vinyl ester, chlorinated rubber, yung flon, polyurethane, and polysiloxane paints; and epoxy flooring coatings and anti-corrosive and zinc rich primers. In addition, the company offers marine paints that include supermarine products; anti-fouling, marine primers and paints, and rainbow paints; and fire-retardant coatings and spray-applied fire resistive materials. Further, it provides specialty coatings, which comprise galvanized steel emulsions, anti-midew, baking, and heat-resisting paints; varnishes, putty, traffic paints, black board paints, paint removers, hammer tone paints, paint oils, flash rust inhibitors, weldable anti-corrosive primers, gold paints, and flat paints. Additionally, the company offers coil coatings and maintenance paints; green water-based waterproof paints, green epoxy topcoats, and green water-based cement mortar paints; and water-based clear white-board paints, textured paints, and snow-flake decorative paints. It also provides paint pigments, synthetic resins, fire protection coatings, cement made products, and steel drums, as well as can, nuclear, and curtain wall coatings; and engages in the coating, anti-corrosive, lining coating, rust removal by water-jet, and wet sand blasting construction, as well as electrolytic protection activities. The company was founded in 1951 and is based in Kaohsiung, Taiwan.", "currency": "TWD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Kaohsiung"}, "2103.TW": {"short_name": "TSRC CORPORATION", "long_name": "TSRC Corporation", "summary": "TSRC Corporation manufactures and markets synthetic rubber and elastomers, and applied materials in Taiwan and internationally. Its products include ESBR rubber for use in automotive tires, shoe soles, conveyor belts, military caterpillar and tow trucks tracks, sports equipment, and toys; SSBR rubber for use in energy-saving, high performance, and all-season tires; BR rubber that is used in the production of plastic modification for HIPS and high-speed radial tires; and NBR rubber for use in oil hoses, oil seals, rollers, industrial gaskets, belts, shoe soles, rubber plastic foam sheets, and conveyor belts. The company also provides styrene-butadiene-styrene, styrene-isoprene-styrene, and styrene-ethylene/butylene-styrene copolymers, as well as T-BLEND applied materials for use in plastic modification, compounding, adhesive, packaging, medical, elastic film, shoe material, foaming material, labels, hygiene, wire and cable, flexography, gasket material, and soft touch material applications. The company was formerly known as Taiwan Synthetic Rubber Corporation and changed its name to TSRC Corporation in August 1999. TSRC Corporation was founded in 1973 and is headquartered in Kaohsiung, Taiwan.", "currency": "TWD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Kaohsiung"}, "2104.TW": {"short_name": "INTERNATIONAL CSRC INVESTMENT H", "long_name": "International CSRC Investment Holdings Co., Ltd.", "summary": "International CSRC Investment Holdings Co., Ltd. produces and sells carbon black for tire and other rubber products worldwide. Its products are also used in applications, such as pigments, plastics, chemical fiber products, conductive materials, etc. The company also engages in the biotechnology and pharmaceutical research and development activities. In addition, it produces and sells lithium batteries; and provides investment services, investment consultation services, carbon black transportation services, and technology services. The company was formerly known as China Synthetic Rubber Corporation and changed its name to International CSRC Investment Holdings Co., Ltd. in October 2018. International CSRC Investment Holdings Co., Ltd. was founded in 1973 and is based in Taipei City, Taiwan.", "currency": "TWD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "2108.TW": {"short_name": "NANTEX INDUSTRY", "long_name": "NANTEX Industry Co., Ltd.", "summary": "NANTEX Industry Co., Ltd. produces and sells synthetic rubber latex, acrylonitrile-butadiene rubber, carbon masterbatch compounds, and thermoplastic elastomer products worldwide. Its NANTEX synthetic rubber latex products are used in making examination, medical, household, and industrial gloves, as well as in art papers, coated white board, carpet backings, shoe insoles, adhesives, plastic modification agents, construction materials, saturation in non-woven fabrics, and artificial leathers. The company's acrylonitrile-butadiene rubber products are used in industrial and automotive goods, belts, fuel hoses, O-rings, gaskets, shoe soles, insulation equipment, sporting goods, and printing rollers products, as well as electronic parts. Its DYNAPRENE thermal plastic elastomer products are used in automotive parts, construction materials, food industries, sporting goods, industrial products, 3C industries, medical equipment, and plastic modification agents; and carbon masterbatch compounds for use in O-rings, gaskets, fuel hoses, foam products, cables, rollers, shoe soles, and automotive parts. The company was formerly known as President Fine Chemical Industry Co. Ltd. and changed its name to NANTEX Industry Co., Ltd. in October 1991. NANTEX Industry Co., Ltd. was founded in 1979 and is based in Kaohsiung, Taiwan.", "currency": "TWD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Kaohsiung"}, "3149.TW": {"short_name": "G-TECH OPTOELECTRONICS CORP", "long_name": "G-TECH Optoelectronics Corporation", "summary": "G-TECH Optoelectronics Corporation engages in the optoelectronic glass processing business in Mainland China, Taiwan, Hong Kong, Belize, the United States, and internationally. The company offers 3D forming, low-E energy-saving, tempered paint, coated, and cover glass products, as well as easy clean and fog proof smart mirrors. It also provides surface processing services for architectural glass; and processing manufacturing services, such as tempering, shaping, laminating, and insulating. The company's products are used in consumer electronics and non-consumer electronics segments, such as architectures and automobiles. The company was formerly known as Positive Technology Glass Co., Ltd. and changed its name to G-TECH Optoelectronics Corporation in 2001. The company was founded in 1996 and is headquartered in Miaoli County, Taiwan.", "currency": "TWD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Miaoli"}, "3708.TW": {"short_name": "SWANCOR HOLDING CO LTD", "long_name": "Swancor Holding Co., LTD.", "summary": "Swancor Holding Co., LTD. produces and sells chemical products in Taiwan and internationally. The company offers vinyl ester and UP resins, including epoxy vinyl ester and unsaturated polyester resins, and epoxy adhesives; vinyl ester resins and epoxy systems for wind turbine blades; and epoxy composite resins, such as hand lay-up, filament winding, RTM/infusion, pultrusion, and solvent type epoxy resins, as well as carbon fiber and epoxy resins for prepreg. It also provides vinyl ester resins for marine applications; electrical insulating materials for use in large-scale casting application in the electronics and heavy electrical industries; and SMC/BMC resins and low profile additives. The company was founded in 1992 and is headquartered in Nantou City, Taiwan.", "currency": "TWD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Nantou City"}, "4739.TW": {"short_name": "COREMAX CORPORATION", "long_name": "Coremax Corporation", "summary": "Coremax Corporation researches, develops, produces, manufactures, and sells metal-based specialty chemicals and electronic materials in Taiwan, China, and Thailand. It offers oxidation catalysts in liquid and crystalline forms; specialty chemicals for use in tires, pigments, paints, electronic, and traditional industries; battery materials that are used in the manufacturing of rechargeable lithium-ion batteries; and chemical and organic compound fertilizers, and ammonium sulfate. The company was formerly known as Coremax Taiwan Corporation and changed its name to Coremax Corporation in 2010. Coremax Corporation was founded in 1992 and is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu"}, "4766.TW": {"short_name": "NAN PAO RESINS CHEMICAL CO LTD", "long_name": "Nan Pao Resins Chemical Co., Ltd.", "summary": "Nan Pao Resins Chemical Co., Ltd. manufactures, wholesales, and retails synthetic resins and plastics, adhesives, resin coatings, dyes, and pigments in Taiwan, Mainland China, and Southeast Asia. It offers footwear adhesives, including cleaners, primers, hardeners, and shoe adhesives. The company also provides adhesives and specialties, such as textile, woodworking and furniture, construction, graphic arts, tape and label, paper converting, rigid packaging, leather coating, specialty, flexible package, construction and decoration, nonwoven, pressure sensitive, and other adhesives, as well as product assemblies. In addition, it offers hot melt adhesives; building and construction, flooring and concrete, heavy duty anti rust, industrial, eco green, functional, and indoor and outdoor powder coatings, as well as coatings for special applications; and construction materials comprising grouts, waterproof products, sealants, deadeners, and bituminous products. The company was founded in 1963 and is headquartered in Tainan City, Taiwan.", "currency": "TWD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Tainan City"}, "5234.TW": {"short_name": "DAXIN MATERIALS CORPORATION", "long_name": "Daxin Materials Corporation", "summary": "Daxin Materials Corporation provides display and green energy related fine chemicals in Taiwan. It offers display materials, such as LCD, touch panel, and OLED materials; green materials, including photovoltaic and battery materials; semiconductor materials comprising laser release layers, temporary bonding adhesives, and photosensitive dielectrics; and advanced materials consisting of anhydride monomers. The company was founded in 2006 and is headquartered in Taichung City, Taiwan.", "currency": "TWD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taichung City"}, "6582.TW": {"short_name": "SHIN FOONG SPECIALTY AND APPLIE", "long_name": "Shin Foong Specialty and Applied Materials Co., Ltd.", "summary": "Shin Foong Specialty and Applied Materials Co., Ltd. manufactures and sells synthetic SBR and NBR rubber latex products, and adhesives in Taiwan. Its products are used in various applications, such as paper coating, carpet backing, and paper and textile saturation; non-formaldehyde plywood adhesive, veneer fancy adhesive, middle density fiberboard adhesive, and wood lamination adhesive; emulsion resin for outdoor wall paint; and glove dipping. The company was formerly known as Shin Foong Chemical Industry Co., Ltd and changed its name to Shin Foong Specialty and Applied Materials Co., Ltd. in September 2016. Shin Foong Specialty and Applied Materials Co., Ltd. was founded in 1979 and is headquartered in Pingtung, Taiwan.", "currency": "TWD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Pingtung"}}