{
    "012600.KS": {
        "short_name": "CENTRAL INSIGHT",
        "long_name": "Central Insight.Co.,Ltd",
        "summary": "Central Insight.Co.,Ltd engages in the financial automation business. The company offers financial automation equipment, such as ATMs, cash dispensers, mini and small CDs, and utility payment kiosks; and multi-function automation equipment, including CD/ATM ticket dispensers and CD/ATM with inquiry function. It also provides other kiosk automation equipment comprising cash/coin exchangers, unmanned loan consulting systems, and international phone card and traveler's insurance applying machines; and various financial office machines consisting of automatic banknote sorters, check stampers/encoders, and automatic safe-deposit boxes. In addition, the company offers technical support services for MICR/OCR reader sorter systems, image process systems, and automated sorters, as well as third party sun microsystems. Further, the company provides operational and management services for the financial automation products; and after sales services for scanners and network equipment, etc. Additionally, it offers specialized services, assembling and toll processing, and RFID technology services related with environmental preservation issues. The company was formerly known as Chungho ComNet Co., Ltd. and changed its name to Central Insight.Co.,Ltd in September 2020. Central Insight.Co.,Ltd was founded in 1977 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.centralinsight.co.kr",
        "market_cap": "Nano Cap"
    },
    "029530.KS": {
        "short_name": "SINDOH",
        "long_name": "sindoh Co.,Ltd.",
        "summary": "sindoh Co.,Ltd. manufactures and sells office products in Korea and internationally. It offers digital color and mono multi-function printers; color and mono laser printers; fax machines; production printers; UV printers; and supplies, such as thermal paper products. The company was founded in 1960 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "133-705",
        "website": "http://www.sindoh.com",
        "market_cap": "Micro Cap"
    }
}