{
  "001210.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Kumho Electric, Inc.",
    "market": "kr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "KumhoElec",
    "state": null,
    "summary": "Kumho Electric, Inc. manufactures and sells lighting solutions in South Korea. The company offers general lighting products, such as fluorescent, electrodeless, incandescent, halogen, and CDM/HQI lamps; electronic ballasts; and electronic insect control systems. It also provides various LED lighting products; and back light units. The company was formerly known as Chungyup Manufacturing Co. and changed its name to Kumho Electric, Inc. in 1978. Kumho Electric, Inc. was founded in 1935 and is headquartered in Seoul, South Korea.",
    "website": "http://www.khe.co.kr",
    "zipcode": null
  },
  "001440.KS": {
    "city": "Anyang-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Taihan Electric Wire Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "TaihanElecWire",
    "state": null,
    "summary": "Taihan Electric Wire Co., Ltd. designs, manufactures, and installs electric and communication cable systems worldwide. The company provides power generation and distribution cables, including extra-high voltage cables, overhead transmission lines, electric power cables, insulated wires, nuclear cables, halogen-free flame retardant cables, fire protection cables, control cables, instrumentation/signal cables, high voltage direct current cables, and subsea cables. It also offers communication, data, coaxial, railway signaling, optical, and UL style cables, as well as accessories; base metal products, such as copper rods and magnet wires; and heating systems, trolley wires, and factory automation cables. The company was founded in 1955 and is headquartered in Anyang, South Korea.",
    "website": "http://www.taihan.com",
    "zipcode": null
  },
  "004490.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Sebang Global Battery Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "SGBC",
    "state": null,
    "summary": "Sebang Global Battery Co., Ltd. manufactures and sells lead acid batteries in South Korea. the company offers automotive batteries; industrial batteries; and batteries for use in golf cart and electric vehicles, and electric forklift batteries. It also exports its products to approximately 130 countries. The company was formerly known as Global Battery Co., Ltd. and changed its name to Sebang Global Battery Co., Ltd. in September 2005. Sebang Global Battery Co., Ltd. was founded in 1952 and is headquartered in Seoul, South Korea.",
    "website": "http://www.gbattery.com",
    "zipcode": null
  },
  "006340.KS": {
    "city": "Yesan-Eup",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Daewon Cable. Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "DaewonCbl",
    "state": null,
    "summary": "Daewon Cable Co., Ltd., together with its subsidiaries, manufactures and sells cables and wires in South Korea and internationally. The company's products include insulated cables, communication cables, aluminum cables, F.E.D. field products, alpha cables, UL certified device cables, and automobile cables, as well as power and control cables, and flame retardant cables. It also offers XLPE cable, a cross-linked polyethylene insulated cable; and conductors for automobile cables. In addition, the company engages in manufacturing of plastic injection molding; waste disposal and hot water production; and real estate leasing activities. Daewon Cable Co., Ltd. was founded in 1964 and is headquartered in Yesan-Eup, South Korea.",
    "website": "http://www.daewoncable.co.kr",
    "zipcode": null
  },
  "006345.KS": {
    "city": "Yesan-Eup",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Daewon Cable. Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "DaewonCbl(1P)",
    "state": null,
    "summary": "Daewon Cable Co., Ltd., together with its subsidiaries, manufactures and sells cables and wires in South Korea and internationally. The company's products include insulated cables, communication cables, aluminum cables, F.E.D. field products, alpha cables, UL certified device cables, and automobile cables, as well as power and control cables, and flame retardant cables. It also offers XLPE cable, a cross-linked polyethylene insulated cable; and conductors for automobile cables. In addition, the company engages in manufacturing of plastic injection molding; waste disposal and hot water production; and real estate leasing activities. Daewon Cable Co., Ltd. was founded in 1964 and is headquartered in Yesan-Eup, South Korea.",
    "website": "http://www.daewoncable.co.kr",
    "zipcode": null
  },
  "010770.KS": {
    "city": "Daegu",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Pyung Hwa Holdings Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "PHHC",
    "state": null,
    "summary": "Pyung Hwa Holdings Co., Ltd. operates in the rubber industry in South Korea. The company offers anti-vibration systems, such as power train mounts, suspension and chassis products, engine systems, engine + belt systems, and other products; hose systems, including fuel, braking/steering, air, and cooling systems; and defense industry products comprising caterpillars, pads, and road wheels. It also provides sealing systems that include engine, transmission, valve body, chassis, chassis shock absorber, and electronic industry products; and metallic materials that comprise drivetrain parts, steering units, brakes, home appliance parts, and electric/hydrogen vehicle parts, as well as designs and manufactures molds and automated machines for automotive parts products. The company was founded in 1950 and is based in Daegu, South Korea.",
    "website": "http://www.phhc.co.kr",
    "zipcode": null
  },
  "015860.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Electrical Equipment & Parts",
    "long_name": "ILJIN Holdings Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "ILJINHOLDINGS",
    "state": null,
    "summary": "ILJIN Holdings Co., Ltd. operates as a parts/material specialized company worldwide. The company offers high voltage electric cables, Cu wire and aluminum alloys, extra high voltage transformers and blockers, and electrical devices for power distribution. It also provides elecfoil used for secondary batteries; industrial diamonds for automobile, aircraft, energy, and semi-conductor industries, as well as the construction and machinery market; diamond wires; and sapphire ingots and wafers. In addition, the company offers touchscreen panels for smartphones and tablet pcs; and precisive steel tubes for automobiles, hydraulic cylinder tubes for heavy machinery, various shapes for L/M systems, and extra precisive stainless tubes for semi-conductors. Further, it provides composite fuel tanks, and LED lighting and display products; constructs various architectural designs and skyscrapers; and offers acoustic, diagnostic, research, and therapeutic ultrasound based medical systems. Additionally, the company broadcasts various cultural programs; and offers integrated IT solutions, such as system integration, system maintenance, IT infrastructure operation, and IT consulting. ILJIN Holdings Co., Ltd. was founded in 1968 and is headquartered in Seoul, South Korea.",
    "website": "http://www.iljin.co.kr",
    "zipcode": "121-040"
  },
  "017040.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Kwang Myung Electric Co.,Ltd",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "KWANG MYUNG ELEC",
    "state": null,
    "summary": "Kwang Myung Electric Co.,Ltd develops and manufactures power distribution machinery in South Korea. It offers high and low voltage switchgears; gas insulated switchgears; package switchgears; motor control centers; protection relays and control panels; panel boards; and bus ducts. The company also provides automatic control systems, such as power monitoring systems, machineries/air handling units, digital meters, digital electric power monitoring equipment, water handling devices, SCADA, and current sensors. In addition, it engages in generation and distribution of solar power. Kwang Myung Electric Co.,Ltd was founded in 1955 and is headquartered in Ansan-si, South Korea.",
    "website": "http://www.kmec.co.kr",
    "zipcode": "425-100"
  },
  "020150.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Electrical Equipment & Parts",
    "long_name": "ILJIN Materials Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "ILJIN MATERIALS",
    "state": null,
    "summary": "ILJIN Materials Co., Ltd. produces and sells elecfoils in Korea and internationally. Its elecfoils are used as core material for electronic products. The company offers I2B that creates the anode current collector of lithium secondary battery; and IHT, a high bending low illuminance elecfoil for FPCB; and UTC, a very thin elecfoil developed suitable for microcircuiting, high density, high integration, and high multilayering of PCBs. The company also provides I2K, an elecfoil used as a negative electrode collector for small lithium secondary batteries; VLP, a special elecfoil with low illuminance and high strength characteristics used for integrated circuit packaging substrates for semiconductor mounting; ICS, a general-purpose product used as the main material for printed circuit board and copper clad laminate; and I2S to expand the capacity of the secondary battery. In addition, it offers ISS a higher tensile item that is being considered for application of next-generation secondary batteries; HVLP elecfoil suitable for high-speed transmission; and TRT/HRT elecfoils used for base station antennas. The company was formerly known as Iljin Elecfoil Co., Ltd. and changed its name to ILJIN Materials Co., Ltd. in 2010. ILJIN Materials Co., Ltd. was founded in 1987 and is headquartered in Seoul, South Korea.",
    "website": "http://www.iljinm.co.kr",
    "zipcode": null
  },
  "033180.KS": {
    "city": "Yangju-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Electrical Equipment & Parts",
    "long_name": "KH Feelux Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "KH FEELUX",
    "state": null,
    "summary": "KH Feelux Co., Ltd. engages in the research, design, engineering, manufacturing, and sale of electronic ballast and lighting systems in Asia, Europe, and North America. It offers FLX, FLXible, AC, MonoRail, FLT track system, Luxfeel, and B2C collection products, as well as dimming systems for use in hotels, department stores, restaurants, offices, residences, schools, leisure clubs, stage sets, retail areas, etc. The company was formerly known as Feelux Co., Ltd and changed its name to KH Feelux Co., Ltd. in March 2021. KH Feelux Co., Ltd. was founded in 1975 and is headquartered in Yangju, South Korea.",
    "website": "http://www.feelux.com",
    "zipcode": null
  },
  "069730.KS": {
    "city": "Suncheon",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Electrical Equipment & Parts",
    "long_name": "DSR Wire Corp",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "DSRWIRE",
    "state": null,
    "summary": "DSR Wire Corp manufactures wire and wire rope in South Korea. It provides high carbon steel wire, music spring wire, hard drawn steel wire, and zinc coated steel wire, as well as PowerMax rope and OT wire. The company offers its products for mooring, lifting, fishing, oil and gas, mining, leisure, logging, crane, automotive, general use, electronics, construction, agriculture, and consumer goods sectors. The company was formerly known as Chunki Wire Rope Industry Ltd and changed its name to DSR Wire Corp in May 2000. DSR Wire Corp was founded in 1971 and is headquartered in Suncheon, South Korea.",
    "website": "http://www.dsr.com",
    "zipcode": null
  },
  "103590.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Iljin Electric Co.,Ltd",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "ILJIN ELECTRIC",
    "state": null,
    "summary": "Iljin Electric Co.,Ltd operates as a heavy electric machinery company worldwide. The company offers heavy electric systems, including high voltage substation facilities, power distribution equipment, fittings, and smart electricity devices; and power cables and systems, such as high voltage cable and accessories, insulated wire, medium and low voltage cable, and overhead transmission line. It also provides mechanical and electrical copper rods, and aluminum rods; and renewable energy solutions, including photovoltaic power plant EPC. The company was founded in 1968 and is headquartered in Seoul, South Korea. Iljin Electric Co.,Ltd is a subsidiary of ILJIN Holdings Co., Ltd.",
    "website": "http://www.iljinelectric.com",
    "zipcode": "121-716"
  },
  "336260.KS": {
    "city": "Iksan-si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Doosan Fuel Cell Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "Doosanfc",
    "state": null,
    "summary": "Doosan Fuel Cell Co., Ltd. develops and distributes power generation fuel cells in South Korea. The company primarily offers M400 fuel cell that produces approximately 440KW of power and heat. Its fuel cells are used in power plants, refrigerated warehouses, large buildings, and hot springs, as well as natural gas, LPG, and hydrogen projects. Doosan Fuel Cell Co. Ltd has a strategic collaboration and license agreement with Ceres Power Holdings plc. The company was founded in 2019 and is headquartered in Iksan-si, South Korea.",
    "website": "http://www.doosanfuelcell.com",
    "zipcode": "4563"
  },
  "33626K.KS": {
    "city": "Iksan-si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Doosan Fuel Cell Co., Ltd.",
    "market": "kr_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "Doosanfc(1P)",
    "state": null,
    "summary": "Doosan Fuel Cell Co., Ltd. develops and distributes power generation fuel cells in South Korea. The company primarily offers M400 fuel cell that produces approximately 440KW of power and heat. Its fuel cells are used in power plants, refrigerated warehouses, large buildings, and hot springs, as well as natural gas, LPG, and hydrogen projects. Doosan Fuel Cell Co. Ltd has a strategic collaboration and license agreement with Ceres Power Holdings plc. The company was founded in 2019 and is headquartered in Iksan-si, South Korea.",
    "website": "http://www.doosanfuelcell.com",
    "zipcode": "4563"
  }
}
