{"002810.KS": {"short_name": "SamyungTrdg", "long_name": "Samyung Trading Co., Ltd.", "summary": "Samyung Trading Co., Ltd. primarily supplies organic and inorganic chemical products worldwide. Its chemical products include paint, paint thinner, ink/glue, binder/photo gravure printing/synthetic leather, urethane and other synthetic resins/medical composition, minute chemical reagent/fiber, leather/plating/glass/metal detergent, and other solvents. The company also provides vision care products, such as ophthalmic lenses; automobile interior and exterior parts, including radiator grilles, moldings, emblems, and lettering works; and crystal oscillator bases for microcomputers, clocking devices, cordless telephone, and mobile communication devices. Samyung Trading Co., Ltd. was founded in 1959 and is headquartered in Seoul, South Korea.", "currency": "KRW", "sector": "Industrials", "industry": "Industrial Distribution", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}, "003010.KS": {"short_name": "HaeinCorp", "long_name": "Haein Corporation", "summary": "Haein Corporation supplies equipment for construction, energy, and power industries in Japan and internationally. It provides construction equipment, such as excavators, wheel type loader, track type tractor, paving equipment, and skid steer loaders for remicon, aggregate/mining, scrap/steel, and waste, as well as for construction and civil engineering, site construction, underground construction, forestry, landscaping, paving, etc. The company also offers engines and generators, including electric, diesel, gas, and marine engines, as well as generator-sets and propulsion systems for public ships; hydraulic crawler drill and drilling materials, which are used in drilling construction, open-pit mine, civil engineering construction, and quarry works; and bruch chippers, grinder, stump cutters, mower, trenchers, concrete cutters, pile driver, and horizontal directional drills used for resource recycling, improvement of water and drainage infrastructure, and biomass. In addition, it is involved in the supply of industrial and logistics equipment, such as stationary/mobile/portable crushers and screens, air classifiers, electric reach trucks and lift trucks, order pickers, diesel lift trucks, electric pallets and stackers, hand pallet trucks, and tow trucks and trailers; and automatic pallet and miniload warehouse, high rack stackers, pallet movers, storage system, navigation, and WMS for construction and civil engineering sites, and the industrial logistics fields. Further, Haein Corporation engages in the provision of parts and maintenance services; and sale and rental of new and used equipment, as well as provides off the road, agricultural, industrial, lawn and garden, and ATV tires. The company was formerly known as HAEIN Heavy Equipment Corporation and changed its name to Haein Corporation in May 1986. Haein Corporation was founded in 1960 and is headquartered in Seoul, South Korea.", "currency": "KRW", "sector": "Industrials", "industry": "Industrial Distribution", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}, "009810.KS": {"short_name": "NK MULSAN", "long_name": "NK Mulsan CO., LTD.", "summary": "NK Mulsan Co., Ltd. engages in the flexible intermediate bulk container (FIBC) business in South Korea. It offers round-rope type, square-rope type, round-belt type, and square-belt type FIBC bags; and mesh, baffle, antistatic, UN, sift proof, and formfit liner bags. The company also provides tube, flat, and tarpauline clothes; danline ropes; woven belts; PET and PP yarns; PE liners; and color M/B and calpet additives, as well as polysling products. It supplies bituminous coal to domestic power plants; and operates resort in Maldives. It also exports its products. NK Mulsan Co., Ltd. was founded in 1974 and is based in Seoul, South Korea.", "currency": "KRW", "sector": "Industrials", "industry": "Industrial Distribution", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}, "011760.KS": {"short_name": "HyundaiCorp", "long_name": "Hyundai Corporation", "summary": "Hyundai Corporation operates as an import and export trading company worldwide. The company sells long and flat products, steel pipes, semi products, nonferrous metals, and coated steel products; monomers, petroleum products, polymers, and inorganic fertilizers; and passenger vehicles, commercial vehicles, OEM parts, and spare parts. It also engages in supplying equipment, parts, and signal communication systems for speed trains, subway trains, diesel cars, locomotives, passenger cars, and light rails; high-angle guns, military vehicles, armored cars, and weapons; and supertankers, medium sized bulk carriers, container ships, and gas tankers, as well as in the shipbuilding financing, ship repairing and remodeling, and used ship sales. In addition, the company constructs environmental and marine, transporting and loading, and gas processing facilities, as well as power plants, oil refineries, petrochemical plants, and desalination plants; produces industrial facilities and supplies related equipment; and provides various turnkey services, as well as offers project financing and offtake services. Further, it supplies electric equipment comprising generators, transformers, and distribution boards; offers commodities, engineering, and turnkey services, as well as transportation, installation, and audit services; and provides trading and financing services. Additionally, the company supplies PV modules, inverters, and wind turbines; offers excavators, wheel loaders, forklifts, industrial vehicles, supplementary equipment, pumping cars, cranes, and trucks, as well as provides related financing services; and invests in and develops energy and resource properties, such as coal, oil, and gas. Hyundai Corporation was founded in 1976 and is headquartered in Seoul, South Korea.", "currency": "KRW", "sector": "Industrials", "industry": "Industrial Distribution", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}, "047050.KS": {"short_name": "POSCO INTERNATIONAL", "long_name": "Posco International Corporation", "summary": "Posco International Corporation engages in the trading, resource development, and infrastructure development and operation businesses worldwide. The company is involved in the export, import, triangular trade, and sale of steel products, such as steel raw materials, semi-finished and long steel, hot-rolled steel, steel plates, cold-rolled steel, and galvanized steel. It also engages in the exploration, development, production, and sale of natural gas and crude oil; LNG pipeline transportation, liquefaction plant, shipping and trading, and regasification terminal and bunkering activities; generation, transmission, and distribution of power as an independent power producer; and exploration, development, and production of bituminous coal, copper, and other minerals. In addition, the company is involved in the extraction of oil from fresh fruit bunches (FFBs) harvested at plantations and the production and sale of oilseed products manufactured from processed FFBs; supplies rice; and operation of a grain export terminal for selling soybeans, wheat, corn, etc. Further, it supplies petroleum products, synthetic and natural rubber, chemical fertilizers, and inorganic chemicals; polyesters and polymers, including synthetic fiber intermediates, synthetic resins, cotton yarn, and fabric synthetic filament yarn-fiber; and trades in automobile parts, such as engines, transmissions, steering, suspension and motor parts, tires, batteries, wheels, and commercial and passenger vehicles. Additionally, the company exports, imports, and trades in non-ferrous metals and steelmaking materials comprising copper, aluminum, zinc, lead, nickel, and tin; other non-ferrous metals, including copper, titanium, and aluminum; non-ferrous scrap metals; and ferroalloy. The company was formerly known as Posco Daewoo Corporation and changed its name to Posco International Corporation in March 2019. Posco International Corporation was founded in 1967 and is headquartered in Incheon, South Korea.", "currency": "KRW", "sector": "Industrials", "industry": "Industrial Distribution", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Incheon"}}