{
  "007120.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Security & Protection Services",
    "long_name": "MiraeING.Co.,Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "MiraeING",
    "state": null,
    "summary": "MiraeING.Co.,Ltd. develops and supplies defense security products in South Korea and internationally. It offers shooting command equipment for self-propelled howitzers, and various fire power equipment. The company also provides messaging services to banking, securities, and other financial institutions and corporate customers; and Trade Services Utility, a service that in-sources and processes the company's process in the open account transaction. In addition, it offers SafeWatch Filtering, an anti-money laundering system; Summit, an optimal derivative product solution; Internet banking system that supports services, such as customer management, asset management, and corporate support to the Internet banking market; and cloud computing services. The company was founded in 1971 and is headquartered in Seoul, South Korea.",
    "website": "http://www.miraeing.co.kr",
    "zipcode": null
  },
  "019490.KS": {
    "city": "Anseong",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Security & Protection Services",
    "long_name": "Hitron Systems Inc.",
    "market": "kr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "Hitron",
    "state": null,
    "summary": "Hitron Systems Inc. manufactures and sells security devices in Korea and internationally. The company offers network cameras, such as box/housing, indoor dome, bullet, PTZ, specialty, VP dome, and corrosion proof cameras; and network video recorders. It also provides analog cameras comprising AHD, TVI, box/housing, dome, bullet, PTZ, AF, and specialty cameras. In addition, the company offers digital video recorders; and storage, controller, housing, bracket, ETC, and encoder accessories, as well as software. Further, it provides integrated surveillance system solutions. The company was founded in 1986 and is headquartered in Anseong, South Korea.",
    "website": "http://www.hitron.co.kr",
    "zipcode": null
  }
}
