{
  "CGEO.L": {
    "city": "Tbilisi",
    "country": "Georgia",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Conglomerates",
    "long_name": "Georgia Capital PLC",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "GEORGIA CAPITAL PLC ORD 1P",
    "state": null,
    "summary": "Georgia Capital PLC is a private equity and venture capital firm specializing in early stage, organic growth and acquisitions. It consider greenfields through mature stage companies. The firm typically invests in automotive retail, education services, hotels, resorts & cruise lines, restaurants, beverages, healthcare, banks, property and casualty insurance, life and health insurance, advertising, diversified REITs, water utilities, and renewable electricity. It seeks to invest in Georgia. The firm seeks board position in public portfolio companies. It exits through IPO or trade sale in five to ten years. The firm raises capital through equity and debt market transactions. Georgia Capital PLC was founded in 2018 and is based in Tbilisi, Georgia with additional office in London, Greater London and Bristol, United Kingdom. Georgia Capital PLC operates independently of BGEO Group plc as of May 29, 2018.",
    "website": "http://www.georgiacapital.ge",
    "zipcode": "0179"
  },
  "GRGCF": {
    "city": "Tbilisi",
    "country": "Georgia",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Georgia Capital PLC",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "GEORGIA CAPITAL PLC",
    "state": null,
    "summary": "Georgia Capital PLC is a private equity and venture capital firm specializing in early stage, organic growth and acquisitions. It consider greenfields through mature stage companies. The firm typically invests in automotive retail, education services, hotels, resorts & cruise lines, restaurants, beverages, healthcare, banks, property and casualty insurance, life and health insurance, advertising, diversified REITs, water utilities, and renewable electricity. It seeks to invest in Georgia. The firm seeks board position in public portfolio companies. It exits through IPO or trade sale in five to ten years. The firm raises capital through equity and debt market transactions. Georgia Capital PLC was founded in 2018 and is based in Tbilisi, Georgia with additional office in London, Greater London and Bristol, United Kingdom. Georgia Capital PLC operates independently of BGEO Group plc as of May 29, 2018.",
    "website": "http://www.georgiacapital.ge",
    "zipcode": "0179"
  },
  "TBCG.L": {
    "city": "Tbilisi",
    "country": "Georgia",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Banks - Regional",
    "long_name": "TBC Bank Group PLC",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "TBC BANK GROUP PLC ORD GBP0.01",
    "state": null,
    "summary": "TBC Bank Group PLC, through its subsidiaries, provides banking, leasing, brokerage, and card processing services to corporate and individual customers in Georgia, Azerbaijan, and Uzbekistan. The company operates through Retail; Corporate; and Micro, Small and Medium Enterprises segments. It offers various current/settlement accounts, and term deposits; mortgage, consumer, retail, and corporate loans, as well as loans for micro, small, and medium enterprises; credit cards, credit lines, letters of credit, and guarantees; and money transfer and currency exchange services. The company also provides motor, life and personal accident, property, health, and other insurance products; investment, brokerage, and corporate finance solutions; and card processing, leasing, PR and marketing, real estate management, asset management, computer and software, e-commerce, and postal services. In addition, it offers internet and mobile banking services. The company operates through a network of 157 branches; 1,570 automated teller machines; 25,163 point of sale terminals; and 3,905 self-service terminals. TBC Bank Group PLC was founded in 1992 and is based in Tbilisi, Georgia.",
    "website": "http://www.tbcbankgroup.com",
    "zipcode": "0102"
  }
}
