{
    "FLFL.NS": {
        "short_name": "FUTURE LIFESTYLE F",
        "long_name": "Future Lifestyle Fashions Limited",
        "summary": "Future Lifestyle Fashions Limited operates as an integrated fashion company in India. It primarily operates a chain of retail format stores under the Central name; and fashion discount stores under the Brand Factory name. The company's stores offer men's formals, casuals, youth wear, women's western wear, women's ethnic, sportswear, denim wear, infant wear, accessories, footwear, luggage, and others; and cosmetics, fragrances, eyewear, watches, accessories, sportswear, toys, mobiles, electronics, home, and others. It offers its products under the Lee Cooper, Champion, aLL, Indigo Nation, RIG, Alice and Mae, Bare, Urban Yoga, Ancestry, Scullers, UMM, Clarks, Jealous 21, Lombard, Tresmode, Turtle, John Miller, Ceriz, Giovani, Converse, Urbana, Celio, Cover Story, Umbro, Mineral, Mother Earth, and Spunk brands. The company distributes its products through its own brand outlets and other multi-brand outlets, as well as through e-commerce sites. It operates 48 Central stores, 104 Brand Factory stores, and 196 exclusive brand outlets. The company was formerly known as Future Value Fashion Retail Limited and changed its name to Future Lifestyle Fashions Limited. Future Lifestyle Fashions Limited was incorporated in 2012 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400083",
        "website": "http://www.futurelifestyle.in",
        "market_cap": "Micro Cap"
    },
    "SUULD.NS": {
        "short_name": "Suumaya Lifestyle Limited",
        "long_name": "Suumaya Industries Limited",
        "summary": "Suumaya Industries Limited manufactures, retails, and distributes garments and fabrics. The company offers women wear garments, including designer kurtis, and formal and casual wear. It markets its products under the Ekka, Ira, and Tag9 brands. The company operates approximately 1,450 multi-brand outlets and 10 exclusive brand outlets in India and Dubai. It also distributes its products online. The company was formerly known as Suumaya Lifestyle Limited and changed its name to Suumaya Industries Limited in February 2021. Suumaya Industries Limited was founded in 1985 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400064",
        "website": "http://www.suumayalifestyle.com",
        "market_cap": "Micro Cap"
    },
    "TMRVL.NS": {
        "short_name": "THE MANDHANA RETAI",
        "long_name": "The Mandhana Retail Ventures Limited",
        "summary": "The Mandhana Retail Ventures Limited does not have significant operations. Previously, it was engaged in the designing, retailing, marketing, and distribution of men's and women's wear, and accessories under the Being Human brand name in India and internationally. The company was formerly known as Mandhana Retail Ventures Limited and changed its name to The Mandhana Retail Ventures Limited in September 2016. The Mandhana Retail Ventures Limited was founded in 2000 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400012",
        "website": "http://www.mrvlindia.com",
        "market_cap": "Nano Cap"
    },
    "TRENT.NS": {
        "short_name": "TRENT LTD",
        "long_name": "Trent Limited",
        "summary": "Trent Limited, together with its subsidiaries, operates a chain of retail stores primarily under the Westside brand in India. The company's Westside stores provide women's wear, men's wear, kids' wear, footwear, lingerie, cosmetics, perfumes, accessories, and home furniture products. It also operates hypermarket and supermarket stores under the Star Market brand, which offer food and groceries, staple foods, beverages, health and beauty products, apparels, vegetables, fruits, home furnishings, dairy, and non-vegetarian products. In addition, the company provides lifestyle products, including toys, music, frontlist books, stationery, gadgets, and sports merchandise under the Landmark brand. Further, it offers fashion apparels, footwear, accessories, and beauty products for women, men, and children under the Zudio brand; and ethnic apparels, beauty products, and accessories under the Utsa brand. As of March 31, 2020, the company operated 165 Westside stores; 10 Hypermarket and 39 Star Market stores; 80 standalone Zudio stores and 16 Star locations; 4 standalone Landmark stores; and 2 standalone Utsa stores. Trent Limited was incorporated in 1952 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.westside.com",
        "market_cap": "Mid Cap"
    },
    "V2RETAIL.NS": {
        "short_name": "V2 RETAIL LTD",
        "long_name": "V2 Retail Limited",
        "summary": "V2 Retail Limited engages in the retail trade of garments, textiles, and accessories in India. The company sells its products under the Godspeed, Herrlich, Glamora, ebellia, and Honey Brats brands. As of May 05, 2021, it operated 93 retail stores. The company was founded in 2001 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110037",
        "website": "http://www.v2retail.com",
        "market_cap": "Micro Cap"
    }
}