{"ATLASCYCLE.NS": {"short_name": "ATLAS CYCLES(HARYA", "long_name": "Atlas Cycles (Haryana) Limited", "summary": "Atlas Cycles (Haryana) Limited, together with its subsidiaries, manufactures and sells bicycles and its components, and steel tubes in India. The company also exports its products to approximately 50 countries. Atlas Cycles (Haryana) Limited was incorporated in 1950 and is based in Sonepat, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Leisure", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Sonepat"}, "TALWALKARS.NS": {"short_name": "TALWALKARS BETTER", "long_name": "Talwalkars Better Value Fitness Limited", "summary": "Talwalkars Better Value Fitness Limited operates a chain of health centers under the Talwalkars brand name in India. The company offers gym, spa, aerobics, and health counseling services. The company was founded in 1932 and is based in Mumbai, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Leisure", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "TALWGYM.NS": {"short_name": "TALWALKARS HEALTH", "long_name": "Talwalkars Healthclubs Limited", "summary": "Talwalkars Healthclubs Limited owns, operates, franchises, and manages gymnasia, fitness centers, and health clubs primarily in India and Sri Lanka. It operates 252 gyms across 84 cities in South Asia. The company was formerly known as Talwalkars Lifestyles Limited and changed its name to Talwalkars Healthclubs Limited in November 2018. Talwalkars Healthclubs Limited was founded in 1932 and is based in Mumbai, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Leisure", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "WONDERLA.NS": {"short_name": "WONDERLA HOLIDAYS", "long_name": "Wonderla Holidays Limited", "summary": "Wonderla Holidays Limited operates amusement parks and resorts in India. It operates through Amusement Parks and Resort, and Others segments. The company's amusement parks offer land, water, high thrill, and kid rides. It operates three amusement parks in Kochi, Bengaluru, and Hyderabad; and the Wonderla resort in Bengaluru under the brand name Wonderla. The company's resorts offer luxury room, banquet hall, conference room, dining restaurant, resto-o-bar, heated pool, and recreation area, as well as amusement park facilities. It also engages in the food takeaway and home delivery business. In addition, the company operates a plant nursery that offers a range of flowering plants, fruit plants, ornamental plants, indoor plants, pots, seeds, etc. under the Wonder Garden brand name in Kochi. As of August 14, 2020, it operated 2 Wonder Kitchen food takeaway outlets in Bengaluru, India. It also sells merchandise, cooked food, packed foods, etc. The company was incorporated in 2002 and is based in Bengaluru, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Leisure", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Bengaluru"}}