{"DPABHUSHAN.NS": {"short_name": "D. P. Abhushan Limited", "long_name": "D. P. Abhushan Limited", "summary": "D. P. Abhushan Limited engages in the retail of various jewelleries and ornaments in India. The company's portfolio of jewellery collections include bridal, Rajasthani, junagadhi, calcutti, polka, fine pearl, and other antique jewelry items, as well as guroor, paakeezah, sumukh, amaya, meraki, and riwaj collection. It offers jewellery products in gold, diamond, and platinum studded with precious and semi-precious stones, such as rings, earrings, armlet, pendants, gajrahs, nose rings, bracelets, chains, necklaces, and bangles. The company sells jewellery through four retail showrooms located in Ratlam, Indore, Bhopal, and Udaipur. In addition, it generates electricity through windmill. D. P. Abhushan Limited was founded in 1940 and is based in Mumbai, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Luxury Goods", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "GOENKA.NS": {"short_name": "GOENKA DIAMOND & J", "long_name": "Goenka Diamond and Jewels Limited", "summary": "Goenka Diamond and Jewels Limited engages in the cutting, polishing, and sale of diamonds. The company operates in two segments, Diamond and Jewellery. It is also involved in the manufacture and retail of diamond jewelry. The company supplies polished diamonds primarily to wholesalers, jewelry manufacturers, traders, and retailers in India, Hong Kong, the United States, and Russia. Goenka Diamond and Jewels Limited was incorporated in 1990 and is based in Mumbai, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Luxury Goods", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "KANANIIND.NS": {"short_name": "KANANI INDUSTRIES", "long_name": "Kanani Industries Limited", "summary": "Kanani Industries Limited engages in the manufacture and retail of diamond studded jewelry in India. The company offers its jewelry to wholesalers, jewelry manufacturers, traders, and retailers. It also exports its products. The company was formerly known as IMP Finance Limited and changed its name to Kanani Industries Limited in October 2007. Kanani Industries Limited was incorporated in 1983 and is based in Mumbai, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Luxury Goods", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "KDDL.NS": {"short_name": "KDDL LTD", "long_name": "KDDL Limited", "summary": "KDDL Limited, together with its subsidiaries, manufactures and markets watch dials and hands, progressive tools, precision engineering components, and sub-assemblies in India. It operates through four segments: Precision and Watch Components, Watch and Accessories, Marketing and Other Support Services, and Others. The company operates and manages retail stores for Swiss watches; trades in watches and accessories; manufactures and distributes packaging boxes; and offers IT-based business solutions. KDDL Limited also exports its products. The company was formerly known as Kamla Dials & Devices Ltd. KDDL Limited was incorporated in 1981 and is headquartered in Chandigarh, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Luxury Goods", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Chandigarh"}, "LYPSAGEMS.NS": {"short_name": "LYPSA GEMS & JEWEL", "long_name": "Lypsa Gems & Jewellery Limited", "summary": "Lypsa Gems & Jewellery Limited engages in the diamonds business primarily in India. It makes, polishes, trades, imports, and exports diamonds, gems, and other precious stones. The company exports its products to the United States, Belgium, Israel, the United Arab Emirates, and Hong Kong. It serves small and mid-level diamond manufacturers. The company was formerly known as Maloo Gems & Jewellery Limited and changed its name to Lypsa Gems & Jewellery Limited in August 2011. Lypsa Gems & Jewellery Limited was incorporated in 1995 and is based in Mumbai, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Luxury Goods", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "PCJEWELLER.NS": {"short_name": "PC JEWELLER LIMITE", "long_name": "PC Jeweller Limited", "summary": "PC Jeweller Limited manufactures, retails, and trades in gold jewelry, diamond studded jewelry, and silver items in India. The company sells its jewelry through its showrooms and Website, wearyourshine.com. As of March 31, 2020, it had 83 showrooms, including 11 franchisee showrooms. The company also exports its products. PC Jeweller Limited was founded in 2005 and is based in Delhi, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Luxury Goods", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Delhi"}, "RAJESHEXPO.NS": {"short_name": "RAJESH EXPORTS", "long_name": "Rajesh Exports Limited", "summary": "Rajesh Exports Limited, a gold refiner, manufactures, wholesales, and retails gold and diamond jewelry, and various gold products in India. It operates retail showrooms under the SHUBH Jewellers brand name. The company also exports its products. Rajesh Exports Limited was incorporated in 1989 and is headquartered in Bengaluru, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Luxury Goods", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Bengaluru"}, "TBZ.NS": {"short_name": "TRIBHOVANDAS BHIMJ", "long_name": "Tribhovandas Bhimji Zaveri Limited", "summary": "Tribhovandas Bhimji Zaveri Limited designs, manufactures, retails, and sells jewellery primarily in India. The company offers gold, diamond studded, precious and semi-precious stone studded, and plain and diamond studded platinum jewellery; jewellery with colored stones in gold and diamond; loose diamond solitaires; loose precious and semi-precious stones; and jadau jewellery. As of March 31, 2020, it operated thirty six owned stores and three franchise stores in twenty seven cities. The company was founded in 1864 and is based in Mumbai, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Luxury Goods", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "THANGAMAYL.NS": {"short_name": "THANGAMAYIL JEWELL", "long_name": "Thangamayil Jewellery Limited", "summary": "Thangamayil Jewellery Limited operates a chain of retail jewelry stores in India. The company offers gold, diamond, silver, and platinum jewelries, as well as silver articles, bars, and coins. It also manufactures jewelry and other accessories and products. As of March 31, 2020, the company operated 47 retail outlets in Tamil Nadu. It also provides its products through online. The company was founded in 1947 and is headquartered in Madurai, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Luxury Goods", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Madurai"}, "TITAN.NS": {"short_name": "TITAN COMPANY LTD", "long_name": "Titan Company Limited", "summary": "Titan Company Limited, together with its subsidiaries, manufactures and sells watches, jewelry, eyewear, and other accessories and products in India and internationally. It operates through four segments: Watches, Jewellery, Eyewear, and Others. The company offers watches under the Titan Edge, Titan Raga, Nebula, Octane, HTSE, Zoop, Sonata, Favre Leuba, SF, Xylys, World of Titan, and Helios brands. It also provides jewelry, including pendants, rings, bracelets, earrings, gold watches, and gold and diamond jewelry under the Mia, Caratlane, Tanishq, and Zoya brands; and bags, belts, sunglasses, helmets, wallets, and watches under the Fastrack brand, as well as Police, Anne Klein, and Kenneth Cole licensed brands. In addition, the company retails watches under the Helios brand; and optical products, such as a range of spectacles, sunglasses, and contact lenses under the Titan EyePlus brand, as well as Fastrack and Glares brands. Further, it provides a range of perfumes under the SKINN brand; and sarees under the Taneira brand, as well as engages in the precision component manufacturing and designing, and automation machines manufacturing activities for the aerospace and defense industries. The company offers its products through retail stores and dealers, as well as online. As of March 31, 2020, it operated approximately 1,700 stores with approximately 2.2 million square feet of retail space. The company was formerly known as Titan Industries Limited and changed its name to Titan Company Limited in August 2013. Titan Company Limited was founded in 1984 and is based in Bengaluru, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Luxury Goods", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Bengaluru"}, "VAIBHAVGBL.NS": {"short_name": "VAIBHAV GLOBAL LTD", "long_name": "Vaibhav Global Limited", "summary": "Vaibhav Global Limited, together with its subsidiaries, manufactures, retails, trades in, and exports fashion jewelry, accessories, lifestyle, and essential products. The company offers colored gems stones, precious and semi-precious stones, bracelets, bangles, earrings, studded jewelry, etc.; fashion accessories, such as scarves, handbags, etc.; and lifestyle products comprising home decor and kitchen products. It also provides hand sanitizers, towels, face masks, tissue rolls, shampoos, beauty products, home products, food, kitchenware, etc. The company sells its products through departmental stores; TV shopping channels; and through internet shopping websites and mobile apps, as well as is involved in the B2B wholesale distribution in the United States and the United Kingdom. Vaibhav Global Limited operates in United States, Canada, the United Kingdom, India, Hong Kong, rest of Europe, and internationally. The company was formerly known as Vaibhav Gems Limited and changed its name to Vaibhav Global Limited in 2013. Vaibhav Global Limited was founded in 1980 and is headquartered in Jaipur, India. Vaibhav Global Limited is a subsidiary of Brett Enterprises Private Limited.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Luxury Goods", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Jaipur"}}