{"AMDIND.NS": {"short_name": "AMD INDUSTRIES LTD", "long_name": "AMD Industries Limited", "summary": "AMD Industries Limited manufactures and sells a range of packing solutions in India and internationally. The company offers various types of crown caps, including PVC spun, molded, and dry blend crown caps; PET preforms, bottles, jars, and containers; and CSD closures for use in soft drink, beverage, water, beer, liquor, and pharmaceutical industries. It is also involved in the development of a commercial complex in Gurugram, Haryana. AMD Industries Limited was founded in 1958 and is headquartered in New Delhi, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "NSI", "market": "in_market", "country": "India", "city": "New Delhi"}, "BALKRISHNA.NS": {"short_name": "BALKRISHNA PAPER M", "long_name": "Balkrishna Paper Mills Limited", "summary": "Balkrishna Paper Mills Limited manufactures and sells paper and paper boards in India. It offers eco, chromo white back, eco-white, eco kraft back, and duplex coated boards. The company's coated duplex boards are primarily used for packaging by various industries, such as pharmaceuticals, toiletries, cosmetics, health care products, readymade garments, instant food products, match boxes, and incense sticks, as well as FMCG segments. It also exports its products. The company was formerly known as Nirvikara Paper Mills Limited and changed its name to Balkrishna Paper Mills Limited in August 2016. Balkrishna Paper Mills Limited was founded in 1975 and is based in Mumbai, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "BKMINDST.NS": {"short_name": "BKM INDUSTRIES LTD", "long_name": "BKM Industries Limited", "summary": "BKM Industries Limited manufactures and trades in packaging products. The company offers crown closures that are used as sealants for beer and soft drinks; shallow roll on pilfer proof (ROPP) closures for liquor and pharmaceutical sectors; deep drawn ROPP closures for bottles; plastic closures for carbonated soft drinks and mineral water sectors; printed and coated sheets for manufacturers of metal closures, as well as metal containers and cans; aluminum foil containers; metal containers for shoe polishes, cosmetics and tea; and corrugated sheets and boxes. It also provides shipbuilding and offshore engineering services; 3D laser scanning and 3D model development services; mechanical, electrical, plumbing, and structural engineering services for the architectural, engineering, and construction industry; and software development solutions, such as e-business solutions and enterprise applications, as well as custom software development services. In addition, the company offers onsite services to various industry houses and shipyards, including design engineers/draftsman deployment based on project requirements, project based design team deployment, supervision of construction and installation, and project management; and digitization services, such as data capture and conversion, online and offline data entry and processing, data editing, data mining, data management and indexing, and data modeling. Further, it is involved in the manufacture and sale of mosquito repellant coils; aluminum and steel galvanized sheets, coils, etc.; and machines, spare parts, etc., as well as in the agro-commodity businesses. BKM Industries Limited has operations in India, Burma, Bangladesh, Liberia, Malaysia, and Nigeria. The company was formerly known as Manaksia Industries Limited and changed its name to BKM Industries Limited in November 2017. BKM Industries Limited was incorporated in 2011 and is based in Kolkata, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Kolkata"}, "BORORENEW.NS": {"short_name": "BOROSIL RENEWABLES LTD", "long_name": "Borosil Renewables Limited", "summary": "Borosil Renewables Limited engages in the manufacture and sale of flat glass products in India and internationally. It provides clear patterned glass and low iron solar glass for various applications in photovoltaic panels, flat plate collectors, and green houses. The company was formerly known as Borosil Glass Works Limited and changed its name to Borosil Renewables Limited in February 2020. Borosil Renewables Limited was incorporated in 1962 and is based in Mumbai, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "EMMBI.NS": {"short_name": "EMMBI INDUSTRIES", "long_name": "Emmbi Industries Limited", "summary": "Emmbi Industries Limited engages in the manufacturing, trading, and selling of woven polymer based products in India. It operates through four segments: Specialty Packaging, Advance Composites, Water Conservation, and Agro Polymers. The company provides various specialty flexible intermediate bulk containers (FIBCs), such as standard, tunnel lift, single and two loops, and ventilated and net, as well as woven sacks, and garden waste and skip bags; box bags, including bale bags, automobile covers, and lumber covers; and woven fabrics, which include silt fence, sandwich fabrics, roofing underlayment, and tarpaulin. It also offers baffle, conductive liners, anti-corrosive, rodent repellent, and fire-retardant packaging bags, as well as de-watering, tamper evidence, and self-standing FIBCs; fall arrest systems; and carrier bags used for containing and transportation of asbestos. In addition, the company provides geo textile bags, canal and pond liner, flexi tank, and flood control bags. Further, it offers ground cover, weed mats, and mulch films used for weed control; crop covers to manage soil erosion, soil fertility, soil quality, water, weeds, pests, diseases, biodiversity, and wildlife in an agroecosystem. Additionally, the company provides industrial sling bags, a packaging solution for transport of heavy sacks; and protective furniture covers. It also exports its products. The company was formerly known as Emmbi Polyarns Limited and changed its name to Emmbi Industries Limited in July 2013. Emmbi Industries Limited was founded in 1994 and is headquartered in Mumbai, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "HINDNATGLS.NS": {"short_name": "HINDUSTHAN NAT GLA", "long_name": "Hindusthan National Glass & Industries Limited", "summary": "Hindusthan National Glass & Industries Limited manufactures and sells container glass bottles in India and internationally. It serves pharmaceuticals, liquor and beer, food, soft drinks, and cosmetics. The company was founded in 1946 and is based in Kolkata, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Kolkata"}, "HITECHCORP.NS": {"short_name": "HITECH CORPORATION", "long_name": "Hitech Corporation Limited", "summary": "Hitech Corporation Limited manufactures, sells, and exports rigid plastic containers in India and internationally. It serves various industries, including paints and coatings, home care, personal care, FMCG, food and beverages, health care, agrochemicals, and lubricants. The company was formerly known as Hitech Plast Limited and changed its name to Hitech Corporation Limited in May 2017. Hitech Corporation Limited was incorporated in 1991 and is headquartered in Mumbai, India. Hitech Corporation Limited is a subsidiary of Geetanjali Trading and Investments Private Limited.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "HUHTAMAKI.NS": {"short_name": "HUHTAMAKI INDIA LIMITED", "long_name": "Huhtamaki India Limited", "summary": "Huhtamaki India Limited engages in the manufacture and sale of consumer packaging and labelling materials in India and internationally. It provides shaped pouches, see-through packs, single-serve sachets, and twist wraps for food and confectionery packaging; pocket shot pouches, thermoforms, shrink sleeves, metallized paper labels, booklet labels, in-mould labels, and wet strength labels for beverages; and medical device packing, bulk bags, cold form laminates, hard-tempered blister foils, child-resistant packs, four ply extrusion laminates, and push tabs, as well as blister and strip packs replacement for healthcare sector. The company also offers retort pouches, high barrier laminates, and woven bags in aluminum foil and non-foil transparent structures for pet food market; printing cylinders; promotions and security solutions, such as point of-sale banners, tattoos, sticker in laminate, registered holograms, hidden text and images, and camouflage impressions; and flexible packaging solutions for personal and home care, agro, automotive, industrial, and other non-food markets. In addition, it exports its products. The company was formerly known as Huhtamaki PPL Limited and changed its name to Huhtamaki India Limited in November 2020. Huhtamaki India Limited was founded in 1935 and is headquartered in Thane, India. Huhtamaki India Limited is a subsidiary of Huhtavefa B.V.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Thane"}, "KANPRPLA.NS": {"short_name": "Kanpur Plastipack Limited", "long_name": "Kanpur Plastipack Limited", "summary": "Kanpur Plastipack Limited manufactures and exports flexible intermediate bulk containers (FIBC) worldwide. It also provides small polypropylene (PP)/HDPE woven sacks and bags, including laminated and unlaminated, printed and unprinted, box bags and bale wraps, pallet covers, food grain bags, fertilizer bags, and cement bags, as well as liner and gusseted bags, valve bags, and bale wraps. In addition, the company offers PP/HDPE woven fabrics, such as laminated, unlaminated, circular, and circular cut open fabrics; and various accessories for use in the manufacture of FIBCs and woven bags comprising webbings, PP filler cords, dust proof cords, tie strings, B-locks, and Velcro. Further, it provides ventilated interlocked, ventilated without interlocked, conductive, and food grade fabrics; and a range of PP multi filament yarns for use in various industries. The company was founded in 1971 and is based in Kanpur, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Kanpur"}, "MAXVIL.NS": {"short_name": "MAX VENTURES & IND", "long_name": "Max Ventures and Industries Limited", "summary": "Max Ventures and Industries Limited, through its subsidiaries, manufactures and sells packaging unmetallised and metallised biaxial oriented polypropylene films in India and internationally. It offers high barrier films, thermal lamination films, thermal lamination films, and leather finishing foils. The company's products are used for packaging, including processed foods, confectionery, non-food fast moving consumer goods, industrial goods, and lamination. It is also involved in the construction and development of residential and commercial properties; and investment activities. The company was formerly known as Capricorn Ventures Limited and changed its name to Max Ventures and Industries Limited in January 2016. Max Ventures and Industries Limited was incorporated in 2015 and is based in Noida, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Noida"}, "MOLDTKPAC.NS": {"short_name": "MOLD-TEK PACKAGING", "long_name": "Mold-Tek Packaging Limited", "summary": "Mold-Tek Packaging Limited manufactures and sells plastic packaging containers in India. It provides sanitizer containers, dispensing pumps, food containers, paint packaging products, lubricant packs, and bulk packaging products. The company was formerly known as Moldtek Plastics Limited and changed its name to Mold-Tek Packaging Limited in March 2010. The company was founded in 1986 and is based in Hyderabad, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Hyderabad"}, "NAHARPOLY.NS": {"short_name": "NAHAR POLY FILMS", "long_name": "Nahar Poly Films Limited", "summary": "Nahar Poly Films Limited manufactures and sells bi-axially oriented polypropylene films in India and internationally. It provides metalissed and unmetalissed sealable and non-sealable films that are used in flexible packaging. The company was formerly known as Nahar Investments and Holding Limited and changed its name to Nahar Poly Films Limited in June 2008. Nahar Poly Films Limited was incorporated in 1988 and is based in Ludhiana, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Ludhiana"}, "ORICONENT.NS": {"short_name": "ORICON ENTERPRISES", "long_name": "Oricon Enterprises Limited", "summary": "Oricon Enterprises Limited engages in real estate, marine logistics, packaging, and petrochemicals businesses in India and internationally. It is involved in marine logistics, including lighterage, stevedoring, and logistics for dry cargos, such as coal, petcoke, polypropylene polymer, cent, clinter, steel plates, salt, sugar, etc.; the manufacturing and marketing packaging products, such as metal and plastic closures; and manufacture and sale of petrochemicals, including mixed pentane and heptane for industrial applications. The company also develops a land parcel and school, and re-develops the Oricon House at Worli, Mumbai, as well as operates ports in Gujarat, Maharashtra, and Goa. In addition, it provides warehousing services; and operates as a clearing agent. The company was formerly known as Oriental Containers Ltd. Oricon Enterprises Limited was incorporated in 1968 and is based in Mumbai, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "RMCL.NS": {"short_name": "RADHA MADHAV CORP", "long_name": "Radha Madhav Corporation Limited", "summary": "Radha Madhav Corporation Limited manufactures and sells packaging products in India and internationally. The company offers MOPVC and MOPET shrink films, polyolefin shrink films, extrusion coated and printed laminates, lami tubes, specialty films, preformed pouches, biaxially-oriented polypropylene (BOPP) films, offset printed cartons and liner cartons, soap wrappers, BOPP tapes, PET-PP straps, air bubble sheets, paper tubes, metalized films, PVC twist wrap films and calendar sheets, and lamination films. It also provides PVDC coated and cold formed blisters, PVC rigid sheets, collapsible tubes, masking films, metallized films, PVDC coated laminates, vacuum bags, liner bags, preformed pouches, nylon based five layer films, and surface printed three layer barrier films. In addition, the company offers dual color five layer barrier films, PVC thermoformed sheets, poly poly laminates, hot foil stampings, coated films, thermoforamble PVC films, jumbo bags, PP and BOPP bags, edge guards, and stretch and thermal films. Further, it provides packaging design and development services and solutions; packaging testing services, including controlled environment transport simulation testing, FEA modeling, pilot pulp, paper making and corrugator line, NATA certified testing to AS Standards, creep and compression testing, forensics analysis, controlled environment testing, LCA analysis, and dangerous goods testing; technical packaging advisory services; packaging machinery systems comprising solutions for carton loading, case erecting, case packing, robotics, materials handling and automation, palletization, stretch wrapping identification and traceability, as well as turnkey project management services; and pre-press services, such as design and manufacture of flexographic printing plates. Radha Madhav Corporation Limited was founded in 1994 and is based in Daman, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Daman"}, "SHREERAMA.NS": {"short_name": "SHREE RAMA MULTI", "long_name": "Shree Rama Multi-Tech Limited", "summary": "Shree Rama Multi-Tech Limited manufactures and sells packaging products primarily in India. Its packaging products include multilayer tubes for packing dentifrices, cosmetics, pharmaceuticals, food, and other products; monolayer tubes; paper and plastic containers for hot or cold beverages, and dairy and other products; and multi-colored labels and stickers for breweries, chemicals, cosmetics, food and beverages, pharmaceuticals, and other industrial products. The company also offers multilayer films for packaging edible oils, processed foods, fish, tea, coffee, spices, motor oil and grease, water, and other solid and liquid items; and plastic laminate products, such as flexible packaging, miniature packs, and carry home packs, as well as high performance, special, tube, and flexible laminates. In addition, it provides injection molded articles, such as caps, lids, and containers for packaging ice-creams, frozen foods, dairy products, sweets, and gifts, as well as for general household purposes. The company also exports its products primarily to the United States, Nigeria, Bulgaria, the United Arab Emirates, and Sri Lanka. Shree Rama Multi-Tech Limited was founded in 1987 and is based in Kalol, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Kalol"}, "SUPREMEIND.NS": {"short_name": "SUPREME INDUSTRIES", "long_name": "The Supreme Industries Limited", "summary": "The Supreme Industries Limited manufactures and sells plastic products primarily in India. The company offers a range of molded plastic furniture products, including chairs, trolleys, center and dining tables, sofa, stools, etc.; material handling and storage products, such as small bins, super jumbo crates, and injection molded and roto molded pallets and garbage bins; vacuum formed crates, P.P. corrugated sheet boxes and crates, and recyclable packaging; and petrochemical products comprising general purpose, high impact, specialty, and modified polystyrene. It also provides XF films and products consisting of multilayered cross laminated, U.V. stabilized plastic films under the SILPAULIN brand for use in various agricultural, industrial, and covering applications; and co-extruded multi-layer barrier films. In addition, the company offers protective packaging products, such as thermoplastic PE foam sheets and profiles, cross-linked and blended PE foams, air bubble films and composites, and EPDM and other specialty rubber foams, as well as corrosion resistant, anti-static, UV resistant, and metal laminated foams and bubble films; expansion joint fillers and anti-seismic foams for commercial and residential buildings; and insulation products for various industries. Further, it provides plastic piping systems comprising uPVC pipes, injection molded PVC and handmade fittings, polypropylene random co-polymer pipe systems, HDPE pipe systems, CPVC pipes systems, and inspection chambers and manholes; industrial piping system, DWC PE pipe system, and fire sprinkler system; and toilets bath fittings, roto molded tanks and fittings, and solvents. Additionally, the company offers composite LPG cylinders and industrial components. It also exports its plastic products. The Supreme Industries Limited was founded in 1942 and is based in Mumbai, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "TCPLPACK.NS": {"short_name": "TCPL PACKAGING LTD", "long_name": "TCPL Packaging Limited", "summary": "TCPL Packaging Limited manufactures and sells packaging products in India. It offers folding cartons, printed blanks and outers, litho-lamination products, plastic cartons, blister packs, and shelf-ready packaging products, as well as printed cork-tipping papers, laminates, sleeves, and wrap-around labels. The company also exports its products. It serves the tobacco, FMCG, food and beverage, liquor, pharmaceuticals, and other industries. The company was formerly known as Twenty-First Century Printers Ltd. TCPL Packaging Limited was incorporated in 1987 and is headquartered in Mumbai, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "TIMETECHNO.NS": {"short_name": "TIME TECHNOPLAST", "long_name": "Time Technoplast Limited", "summary": "Time Technoplast Limited, together with its subsidiaries, manufactures and markets a range of technology based polymer products in India and internationally. It operates in two segments, Polymer and Composite. The company offers industrial packaging products, including drums and containers, such as narrow mouth polycans/drums, open top drums, XL-rings, medium packing products, and classic open top drums; conipails for inks, paints and distempers, chemicals, edible oils, greases, detergents, food and food products, and lubricating oils; and intermediate bulk containers, as well as value added services. It also provides lifestyle products comprising matting products; bins; and molded furniture, such as sofas, five position reclining chairs, monoblocs, executive and baby chairs, chairs with writing desk, tables, trolleys, and stools for use in homes, hotels, restaurants, hospitals, clubs, airlines, auditoriums and tent houses, and various other institutes; and automotive components, such as 3S rain flaps, deaeration tanks/radiator tanks, fuel tanks, and air ducts. In addition, the company offers material handling products consisting of plastic returnable transit packaging and material handling solutions, stackable containers, stack-nest containers, foldable small/large containers, plastic crates and pallets, and export pallets to retail, automotive, agriculture, processed food, apparel, pharmaceutical, FMCG, consumer durables, and logistics sectors. Further, it provides composite cylinders; and infrastructure products, including HDPE and DWC pipes, and energy storage devices, as well as techpaulin bags, raincoats, bike covers, and cross laminated films; and kavach face shield. Time Technoplast Limited was incorporated in 1989 and is headquartered in Mumbai, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "UFLEX.NS": {"short_name": "UFLEX LTD", "long_name": "Uflex Limited", "summary": "Uflex Limited manufactures and sells flexible packaging products and solutions worldwide. Its Packaging Films division offers biaxially oriented polyethylene terephthalate (BOPET) films; biaxially oriented polypropylene (BOPP) films; cast polypropylene (CPP) films; metallized BOPP, BOPET, and CPP films; special effects films; and AlOx coated films. The company's Packaging division provides flexible laminates, pre-formed pouches, flexo printed rolls and bags, laminated woven poly propylene bags, shower proof bags, electron beam and cast n cure packaging products, packing products for pharmaceuticals, flexi tubes, hygiene films, and modified atmosphere packaging products. Its Aseptic Liquid Packaging division offers packaging materials and filling machines. Its Chemical division offers adhesives, inks, coatings, and inks binders. The company's Engineering division provides packaging and converting machines, as well as specialty products. Its Cylinder division offers gravure cylinders, CTP flexo plates, and flexo printing sleeves. The company's Holography division provides hologram, holographic film, textile value addition products, stamping foils, paper metalized holography papers and board transfers, and labeling solutions. The company exports its products to the United States, Europe, the Asia Pacific, the Middle East, Africa, and other countries. Uflex Limited was founded in 1983 and is based in Noida, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Noida"}, "WORTH.NS": {"short_name": "Worth Peripherals Limited", "long_name": "Worth Peripherals Limited", "summary": "Worth Peripherals Limited manufactures and sells corrugated boxes in India. The company offers regular slotted containers; die cut corrugated boxes/trays; multi-color corrugated boxes; and Z sleeve and I/honeycomb partitions. It serves clients in fast-moving consumer goods sector and textile industry. The company was incorporated in 1996 and is based in Indore, India.", "currency": "INR", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Indore"}}