{
  "DELTACORP.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Resorts & Casinos",
    "long_name": "Delta Corp Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "DELTA CORP LTD",
    "state": null,
    "summary": "Delta Corp Limited engages in the gaming and entertainment, and hospitality businesses in India and internationally. The company owns and operates three offshore casinos, including Deltin Royale, Deltin JAQK, and Deltin Caravela in Goa; a casino in Nepal; and a live gaming casino in Sikkim, which offer various games, such as roulette, baccarat, blackjack, craps or dice, pontoon, 5-card draw poker, and 3-card poker, as well as slot machines. It also operates Adda52.com, an online poker site; and Adda52Rummy, an online rummy portal. In addition, the company owns The Deltin, a 176 room five star hotel in Daman; Deltin Suites, a 106 room all-suite hotel in north Goa; and a Villa in Goa. The company was incorporated in 1990 and is based in Mumbai, India.",
    "website": "http://www.deltacorp.in",
    "zipcode": "400034"
  },
  "GIRRESORTS.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Resorts & Casinos",
    "long_name": "GIR Natureview Resorts Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GIR NATUREVIEW RES",
    "state": null,
    "summary": "GIR Natureview Resorts Limited provides services related to hospitality, travel, and leisure sectors in India. The company plans and executes small to medium hospitality projects primarily for service apartments, small hotels, and resorts, as well as renovates and redesigns existing hotels, resorts, or service apartments. Its portfolios of services include concept development, design consultancy, and project development, as well as heating, ventilating, and air conditioning planning and plumbing, and electrical work. The company also plans and participates in various events/exhibitions/trade fairs; and undertakes contracts for maintenance of service apartments. GIR Natureview Resorts Limited was incorporated in 2009 and is based in Mumbai, India.",
    "website": "http://www.girresort.net",
    "zipcode": "400053"
  },
  "MHRIL.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Resorts & Casinos",
    "long_name": "Mahindra Holidays & Resorts India Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MAHINDRA HOLIDAYS",
    "state": null,
    "summary": "Mahindra Holidays & Resorts India Limited operates in the leisure and hospitality sector. It engages in the sale of vacation ownership and other related services. The company's flagship brand, Club Mahindra Holidays, offers members a week's holiday every year for a period of 25 years. It also provides Club Mahindra Fundays, a corporate product that allows enrolled organizations to offer holiday entitlements to its employees as a part of their reward and recognition programs, or as an employment perquisite. The company operates a network of resorts across various destinations, including hill stations, beaches, backwaters, wildlife sanctuaries, forts, and heritage destinations in India, as well as in international destinations, such as Bangkok, Kuala Lumpur, Singapore, Dubai, Colombo, and Orlando. As of March 31, 2020, it operated 3,732 units across its 70 resorts. The company was founded in 1996 and is based in Mumbai, India. Mahindra Holidays & Resorts India Limited is a subsidiary of Mahindra & Mahindra Limited.",
    "website": "http://www.clubmahindra.com",
    "zipcode": "400018"
  }
}
