{"MDS.F": {"short_name": "MEDIASET S.P.A.  EO 0,52", "long_name": "Mediaset S.p.A.", "summary": "Mediaset S.p.A. primarily operates in the television (TV) industry in Italy and Spain. The company engages in the content production and third-party acquisition; content distribution in linear and non-linear, and free-to-air and pay-per-view content distribution activities with a range of content centered on football, cinema, TV series, documentaries, and children's channels. It is also involved in the radio broadcasting activates; and other activities, including radio stations, movie production and distribution, teleshopping, publishing activities, licensing and merchandising, and foreign advertising concessions. The company is based in Milan, Italy.", "currency": "EUR", "sector": "Communication Services", "industry": "Broadcasting", "exchange": "FRA", "market": "dr_market", "country": "Italy", "city": "Milan"}, "RWAY.MI": {"short_name": "RAI WAY", "long_name": "Rai Way S.p.A.", "summary": "Rai Way S.p.A. owns and manages television and radio transmission and broadcasting networks in Italy. It offers terrestrial and satellite transmission of television and radio signals through the network infrastructure, as well as through a connecting network, which include radio links, satellite systems, and fiber optic. The company also provides tower rental services, which include hosting in sites of third party transmission and broadcasting equipment; services for the management and maintenance of the transmission equipment hosted; and other complementary and connected services. In addition, it offers network services that include heterogeneous services; provide electronic and telecommunications networks; digital broadcasting networks; transmission networks and management systems; DTT, multimedia communications, and value added services; project management; maintenance of transmission networks; and broadcasting services. It primarily serves national and local radio and television broadcasters; telecommunications operators; and public administration and corporate entities. The company was incorporated in 1999 and is based in Rome, Italy. Rai Way S.p.A. is a subsidiary of Rai Radiotelevisione italiana S.p.A.", "currency": "EUR", "sector": "Communication Services", "industry": "Broadcasting", "exchange": "MIL", "market": "it_market", "country": "Italy", "city": "Rome"}}