{
    "ECEA.F": {
        "short_name": "S.ENER.ELEC.SP.GDR REGS 1",
        "long_name": "Societatea Energetica Electrica S.A.",
        "summary": "Societatea Energetica Electrica S.A., together with its subsidiaries, engages in the distribution and supply of electricity in Romania. It operates through Electricity and Gas Supply, Electricity Distribution, and External Electricity Network Maintenance segments. The company provides electricity distribution services to electricity suppliers; and supplies electricity to consumers in North Transylvania, South Transylvania, and North Muntenia. It also offers construction, repair, maintenance, and other services for the energy sector. The company was formerly known as Societatea de Distributie si Furnizare a Energiei Electrice Electrica S.A. and changed its name to Societatea Energetica Electrica S.A. in April 2016. Societatea Energetica Electrica S.A. was founded in 1898 and is headquartered in Bucharest, Romania.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Electric",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Romania",
        "city": "Bucharest"
    },
    "FDLPF": {
        "short_name": "SC FONDUL PROPRIETATEA GDR EACH",
        "long_name": "Fondul Proprietatea SA",
        "summary": "Fondul Proprietatea SA is a publicly owned investment manager. The firm invests in the public equity markets of Romania. The firm primarily invests in Power, Oil and Gas sectors. Fondul Proprietatea SA was founded in 2005 and is based in Bucharest, Romania.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Romania",
        "city": "Bucharest"
    },
    "MVXM": {
        "short_name": "MOVEIX INC",
        "long_name": "Moveix Inc.",
        "summary": "Moveix Inc. intends to resell various types of electric transportation products through its Website platform worldwide. Its products would include electric bikes, scooters, Segway, and hover boards. The company was founded in 2016 and is based in Suceava, Romania. As of May 6, 2019, Moveix Inc. operates as a subsidiary of SeriesOne, Inc.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Romania",
        "city": "Suceava"
    },
    "RZ8G.F": {
        "short_name": "SO.NA.GA.N.R.GDR REGS LN1",
        "long_name": "SNGN Romgaz SA",
        "summary": "SNGN Romgaz SA engages in the exploration, development, and production of natural gas resources in Romania. It holds a 100% interest in 9 exploration-development-production blocks located in Romania. The company produces natural gas through 3240 wells and surface facilities; and electricity with an installed capacity of 800 megawatts. It is also engages in the trading of natural gas; transportation of general goods and persons; well recompletion operations, workover and special well operations, and production test works; and underground storage of natural gas. The company was founded in 1909 and is headquartered in Medias, Romania.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Romania",
        "city": "Medias"
    }
}