{
    "HAE1T.TL": {
        "short_name": "Harju Elekter",
        "long_name": "AS Harju Elekter",
        "summary": "AS Harju Elekter manufactures and sells electrical equipment in Estonia, Finland, Sweden, Lithuania, and internationally. It operates through three segments: Production, Real estate, Other Activities. The company offers medium and low voltage power distribution equipment, such as transformer substations. It also provides sheet metal enclosures and cabinets for control systems; and customer-specific services comprising series manufacturing and customized assembly, sheet metal processing, and sheet metal protective coating services. In addition, the company telecommunication products, such as rack cabinets, wall cabinets, power distribution units, fiber and copper panels, and accessories; and metal engineering, cutting, bending, painting, assembling, and quality control services. Further, it is involved in the wholesale of light fittings and electrical appliances; provision of management assistance and services; real estate development, maintenance, and rental activities; provision of services related to managing real estate and production capacities; intermediation of services; and intermediary sale of electrical equipment. Additionally, the company operates stores in Tallinn, Tartu, and Keila, which sell products for electrical installation work to retail customers, and small and medium sized electrical installation companies. AS Harju Elekter was founded in 1968 and is based in Keila, Estonia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "city": "Keila"
    },
    "HD8.F": {
        "short_name": "AS HARJU ELEKTER  EO 0,63",
        "long_name": "AS Harju Elekter",
        "summary": "AS Harju Elekter manufactures and sells electrical equipment in Estonia, Finland, Sweden, Lithuania, and internationally. It operates through three segments: Production, Real estate, Other Activities. The company offers medium and low voltage power distribution equipment, such as transformer substations. It also provides sheet metal enclosures and cabinets for control systems; and customer-specific services comprising series manufacturing and customized assembly, sheet metal processing, and sheet metal protective coating services. In addition, the company telecommunication products, such as rack cabinets, wall cabinets, power distribution units, fiber and copper panels, and accessories; and metal engineering, cutting, bending, painting, assembling, and quality control services. Further, it is involved in the wholesale of light fittings and electrical appliances; provision of management assistance and services; real estate development, maintenance, and rental activities; provision of services related to managing real estate and production capacities; intermediation of services; and intermediary sale of electrical equipment. Additionally, the company operates stores in Tallinn, Tartu, and Keila, which sell products for electrical installation work to retail customers, and small and medium sized electrical installation companies. AS Harju Elekter was founded in 1968 and is based in Keila, Estonia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Estonia",
        "city": "Keila"
    },
    "MKS.F": {
        "short_name": "MERKO EHITUS (ASUT.) O.N.",
        "long_name": "AS Merko Ehitus",
        "summary": "AS Merko Ehitus, through its subsidiaries, engages in the construction and real estate development activities in the Republic of Estonia, Latvia, Lithuania, Norway, and Finland. The company operates through Construction Service and Real Estate Development segments. It constructs various buildings, including commercial and office buildings, retail and entertainment centers, hotels, and spas, as well as public buildings, dwellings, and specific industrial buildings. The company also designs and constructs various infrastructure facilities, such as port, waste handling, and road infrastructure, including bridges, tunnels, overpasses, and roads; environment protection facilities; drinking water and waste water treatment facilities; water and sewerage mains; and other engineering and technical sites. In addition, it provides electrical construction services comprising medium and high voltage substation, and cable line engineering configuration and construction; road maintenance and repair services; and machinery repair services. Further, the company undertakes supervision of excavation works and condition of roads; and concrete works that include buildings and infrastructure constructed of prefabricated or concrete panels. Additionally, it develops apartment projects, long-term real estate investments, and real estate projects for business purposes; and maintains and leases real estate properties. AS Merko Ehitus was founded in 1990 and is based in Tallinn, the Republic of Estonia. AS Merko Ehitus is a subsidiary of AS Riverito.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Estonia",
        "city": "Tallinn"
    },
    "MRK1T.TL": {
        "short_name": "Merko Ehitus",
        "long_name": "AS Merko Ehitus",
        "summary": "AS Merko Ehitus, through its subsidiaries, engages in the construction and real estate development activities in the Republic of Estonia, Latvia, Lithuania, Norway, and Finland. The company operates through Construction Service and Real Estate Development segments. It constructs various buildings, including commercial and office buildings, retail and entertainment centers, hotels, and spas, as well as public buildings, dwellings, and specific industrial buildings. The company also designs and constructs various infrastructure facilities, such as port, waste handling, and road infrastructure, including bridges, tunnels, overpasses, and roads; environment protection facilities; drinking water and waste water treatment facilities; water and sewerage mains; and other engineering and technical sites. In addition, it provides electrical construction services comprising medium and high voltage substation, and cable line engineering configuration and construction; road maintenance and repair services; and machinery repair services. Further, the company undertakes supervision of excavation works and condition of roads; and concrete works that include buildings and infrastructure constructed of prefabricated or concrete panels. Additionally, it develops apartment projects, long-term real estate investments, and real estate projects for business purposes; and maintains and leases real estate properties. AS Merko Ehitus was founded in 1990 and is based in Tallinn, the Republic of Estonia. AS Merko Ehitus is a subsidiary of AS Riverito.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "city": "Tallinn"
    },
    "NCN1T.TL": {
        "short_name": "Nordecon",
        "long_name": "Nordecon AS",
        "summary": "Nordecon AS operates as a construction company in Estonia, Sweden, Finland, and Ukraine. It is involved in the general contracting and project management of buildings and infrastructure construction. The company engages in building office and industrial buildings, warehouses, non-residential buildings, and apartment buildings, as well as various storage facilities and tanks for agricultural purposes; and the design and preparation of concrete works, including complete loadbearing structure and basement solutions, concrete floors, frameworks, roofs, and ceilings. It also provides general contracting and project management services in the field of civil engineering works, including road construction and maintenance, engineering and environmental construction, rental of building equipment, and production of road construction materials, as well as rents, sells, and maintains road construction and earthworks machines. In addition, the company engages in designing and building concrete works, including bridges, overpasses, viaducts, tunnels, basements, and reinforced concrete frameworks for buildings, as well as railway base structures and erections; and building ports, berths, breakwaters, and bank protections, as well as in the construction of utility, water, and other civil engineering projects. Further, it is involved in traffic management operations; geodetic surveys; and coordination and development of the work of the construction material quarries. The company was formerly known as Nordecon International AS and changed its name to Nordecon AS in January 2011. Nordecon AS was founded in 1989 and is based in Tallinn, Estonia. Nordecon AS is a subsidiary of AS Nordic Contractors.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "city": "Tallinn"
    },
    "T5N.F": {
        "short_name": "AS TALLINK GRUPP  O.N.",
        "long_name": "AS Tallink Grupp",
        "summary": "AS Tallink Grupp, together with its subsidiaries, provides marine passenger and cargo transportation services in the Baltic Sea. The company operates through Estonia - Finland Routes, Estonia - Sweden Routes, Latvia - Sweden Route, Finland - Sweden Routes, and Other segments. It offers mini-cruise and passenger transportation, and ro-ro cargo services, as well as travel packages. The company provides its services on various routes under the Tallink and Silja Line brands. AS Tallink Grupp operates a fleet of 14 vessels that include cruise ferries, high-speed ro-pax ferries, and ro-ro cargo vessels. The company also operates three hotels in Tallinn and one hotel in Riga. In addition, the company sells beauty products; and offers stevedoring, vehicles leasing, catering, warehouse, technical ship management and crewing, and process agent services, as well as provides entertainment on ships. AS Tallink Grupp was founded in 1989 and is based in Tallinn, the Republic of Estonia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Estonia",
        "city": "Tallinn"
    },
    "TAL1T.TL": {
        "short_name": "Tallink Grupp",
        "long_name": "AS Tallink Grupp",
        "summary": "AS Tallink Grupp, together with its subsidiaries, provides marine passenger and cargo transportation services in the Baltic Sea. The company operates through Estonia - Finland Routes, Estonia - Sweden Routes, Latvia - Sweden Route, Finland - Sweden Routes, and Other segments. It offers mini-cruise and passenger transportation, and ro-ro cargo services, as well as travel packages. The company provides its services on various routes under the Tallink and Silja Line brands. AS Tallink Grupp operates a fleet of 14 vessels that include cruise ferries, high-speed ro-pax ferries, and ro-ro cargo vessels. The company also operates three hotels in Tallinn and one hotel in Riga. In addition, the company sells beauty products; and offers stevedoring, vehicles leasing, catering, warehouse, technical ship management and crewing, and process agent services, as well as provides entertainment on ships. AS Tallink Grupp was founded in 1989 and is based in Tallinn, the Republic of Estonia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "city": "Tallinn"
    },
    "TSM1T.TL": {
        "short_name": "Tallinna Sadam",
        "long_name": "AS Tallinna Sadam",
        "summary": "AS Tallinna Sadam provides port services as a landlord type of port in the Republic of Estonia. It operates through Passenger Harbours, Cargo Harbours, Ferry, and Other segments. The company owns, administers, and develops berths, port basins, and the surrounding areas; ensures safe navigation in port waters; and organizes vessel traffic in port basins, as well as leases land to cargo operators. It owns and operates the Old City Harbor, a passenger harbor and the Old City Marina for recreational vessels located in the center of Tallinn; the cargo harbor in Muuga; the cargo harbor in Paldiski; and the harbor in Saaremaa for receiving cruise ships, pleasure crafts, and cargo vessels. The company also offers icebreaking and other offshore support services; and sells electricity and network services, as well as provides ferry services between Estonia's mainland and biggest islands. AS Tallinna Sadam was incorporated in 1996 and is headquartered in Tallinn, the Republic of Estonia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "city": "Tallinn"
    }
}