{
    "46NA.SG": {
        "short_name": "Novorossi.Morskoy Torg. Port Re",
        "long_name": "Public Joint Stock Company Novorossiysk Commercial Sea Port",
        "summary": "Public Joint Stock Company Novorossiysk Commercial Sea Port, together with its subsidiaries, provides stevedoring, port, and sea vessel services in Russia. The company's stevedoring services include loading and unloading of oil, oil products, grains, mineral fertilizers, chemicals, containers, timber, timber products, metal products, sugar, and other cargo, as well as fuel bunkering; and other port services comprises freight forwarding, storage, custom documentation, repacking, and ship repair. It also engages in the rental and resale of energy and utilities; provides fleet services, including tugging, towing, and other related services; and operates container and passenger terminals. In addition, the company provides emergency services, such as transferring vessels to shelter zones during emergencies, cleaning and containment services for oil or other liquid spills in and around the port, and hazardous material response and waste management services, as well as mooring and bunkering services. It serves ship owners or marine agents, freight owners or freight owners/agents, freighters, and other customers. The company was founded in 1845 and is based in Novorossiysk, Russia. Public Joint Stock Company Novorossiysk Commercial Sea Port is a subsidiary of Public Joint Stock Company Transneft.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Russia",
        "state": null,
        "city": "Novorossiysk",
        "zipcode": "353900",
        "website": "http://www.nmtp.info",
        "market_cap": 1396566016
    },
    "AETG.F": {
        "short_name": "AEROFLOT GDR 144A /5 RL1",
        "long_name": "Public Joint Stock Company Aeroflot - Russian Airlines",
        "summary": "Public Joint Stock Company Aeroflot - Russian Airlines, together with its subsidiaries, provides passenger and cargo air transportation services in Russia and internationally. It also offers other aviation services from Moscow Sheremetyevo Airport. In addition, the company provides airline catering, finance, education, and technical maintenance services, as well as operates a hotel. As of December 31, 2019, it operated a fleet of 359 aircraft. The company was founded in 1923 and is headquartered in Moscow, Russia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Airlines",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "119019",
        "website": "http://www.aeroflot.ru",
        "market_cap": 1838671488
    },
    "AFLT.ME": {
        "short_name": "AEROFLOT PJSC",
        "long_name": "Public Joint Stock Company Aeroflot - Russian Airlines",
        "summary": "Public Joint Stock Company Aeroflot - Russian Airlines, together with its subsidiaries, provides passenger and cargo air transportation services in Russia and internationally. It also offers other aviation services from Moscow Sheremetyevo Airport. In addition, the company provides airline catering, finance, education, and technical maintenance services, as well as operates a hotel. As of December 31, 2019, it operated a fleet of 359 aircraft. The company was founded in 1923 and is headquartered in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Airlines",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "119019",
        "website": "http://www.aeroflot.ru",
        "market_cap": 175439904768
    },
    "CHEP.ME": {
        "short_name": "CHELYABINSK PIPE",
        "long_name": "Public Joint Stock Company \"Chelyabinsk Pipe-Rolling Plant\"",
        "summary": "Public Joint Stock Company Chelyabinsk Pipe Plant produces and sells welded and seamless steel pipe products for fuel and energy industries in Russia. The company operates through four segments: Steel Pipe Production, Oilfield Services, Trunk Pipeline Systems, and Scrap Procurement. It offers casings, tubing, boiler tubes, cold-finished and hot-finished pipes and tubes, small-diameter welded pipes, and stainless steel pipes; pipeline transport; and high pressure pumps. The company pipeline fittings, which include tee, elbow, reducer, cap, split tees, cold and hot induction bends, and 3D bends products. In addition, it offers ball, bellows-type globe, check, globe, and swing check valves; electrical submersible motors; gas separators and dispersers; surface pumping system; and perforated liner products. It serves oil and gas industry, housing, utilities infrastructure, and industrial applications. It exports its products to the European Union, the Commonwealth of Independent States, North America, the Middle East, and North Africa. The company was founded in 1942 and is based in Chelyabinsk, Russia. As of March 16, 2021, Public Joint Stock Company \"Chelyabinsk Pipe-Rolling Plant\" operates as a subsidiary of PAO TMK.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Chelyabinsk",
        "zipcode": "454129",
        "website": "http://www.chelpipe.ru",
        "market_cap": 96141393920
    },
    "CHKZ.ME": {
        "short_name": "CHELYABINSK FORGE&",
        "long_name": "Chelyabinsk Forge-and-Press Plant, Public Joint Stock Company",
        "summary": "Chelyabinsk Forge-and-Press Plant, Public Joint Stock Company operates as a forging company in Russia and internationally. The company offers hot-die forgings and machined parts, cold sheet-metal stampings, flanges, wheels and rims, and special purpose vehicles, as well as finished pipeline fittings. It serves automotive and agriculture industries. The company was founded in 1942 and is based in Chelyabinsk, Russia.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Chelyabinsk",
        "zipcode": "454012",
        "website": "http://www.chkpz.ru",
        "market_cap": 3517265664
    },
    "EELT.ME": {
        "short_name": "EUROPEAN ELTECH",
        "long_name": "European Eltech Public Joint Stock Company",
        "summary": "European Eltech Public Joint Stock Company operates in the electrical engineering market. The company provides energy supply, electricity supply, electric lighting, and low-current systems. It also provides engineering, commissioning, and maintenance services, as well as equipment for the construction of turnkey power supply systems; and engineering services for public buildings, industrial facilities, and transport and industrial infrastructure facilities. In addition, the company delivers materials and equipment for electric power supply systems; designs power supply engineering and electric components for public facilities, electric lighting systems, lightning protection and surge voltage protection systems, cable support systems, and other engineering systems; engages in the electrical installation and commissioning works; and provides electric laboratory and facility commissioning services. Further, it offers energy conservation and audit services for the manufacturing industry, warehouse complexes, shopping and business centers, etc. The company serves electric power, oil and gas, steel and mining, engineering, telecommunications and data processing centers, chemical, and food sectors. It distributes electrical equipment in Belarus, Kazakhstan, Turkmenistan, Kyrgyzstan, Uzbekistan, and Russia. European Eltech Public Joint Stock Company was founded in 2004 and is based in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "129344",
        "website": "http://www.euroetpao.ru",
        "market_cap": 6414314496
    },
    "FESH.ME": {
        "short_name": "FAR-EASTERN SHIPPI",
        "long_name": "Far-Eastern Shipping Company PLC.",
        "summary": "Far-Eastern Shipping Company PLC. provides logistics services in Russia and internationally. It operates through five segments: Shipping, Linear and Logistics, Railway Services, Ports, and Bunkering. The company offers container transportation; logistics services, such as multimodal transportation, land transportation, customs clearance, less-than-container load shipping, and storage and IT system integration services; Ro-Ro transportation; project logistics services; rail transportation; sea freight shipping; ship agency services; and container tracing services. Its shipping services include ship ownership, management, and chartering out services; and port and terminal services comprise cargo handling, stevedoring, container storage and rental, and related port services and facilities. Far-Eastern Shipping Company PLC. was founded in 1880 and is headquartered in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "115035",
        "website": "http://www.fesco.ru",
        "market_cap": 45272174592
    },
    "FLOT.ME": {
        "short_name": "PAO SOVCOMFLOT",
        "long_name": "PAO Sovcomflot",
        "summary": "PAO Sovcomflot, a shipping company, provides maritime transportation services for hydrocarbons in Russia. It operates in five segments: Offshore Services, Gas Transportation, Crude Oil Transportation, Oil Products Transportation, and Other. The company is involved in the transportation of crude oil, petroleum products and bulk cargoes, and liquefied natural gas and liquefied petroleum gas; supply and servicing of offshore platforms; management of terminals; shuttle shipment of oil; and offshore seismic exploration activities. As of October 28, 2020, it operated through a fleet of 146 vessels with a total deadweight of approximately 12.6 million tons. The company was formerly known as OAO Sovcomflot and changed its name to PAO Sovcomflot in December 2014. PAO Sovcomflot was founded in 1988 and is headquartered in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "125047",
        "website": "http://www.scf-group.ru",
        "market_cap": null
    },
    "G23A.F": {
        "short_name": "GLOBALTRANS INV.GDR REG S",
        "long_name": "Globaltrans Investment Plc",
        "summary": "Globaltrans Investment Plc, together with its subsidiaries, provides freight rail transportation, railcar leasing, and ancillary services in Russia, Estonia, and Ukraine. It transports metallurgical cargoes, oil products and oil, coal, and construction materials; and leases and maintains rolling stock. As of December 31, 2020, the company operated a fleet of 71,688 units, including t 67,762 owned units and 3,926 leased units. It serves various Blue-chip, metals and mining, oil and gas, and other industrial sectors. The company was incorporated in 2004 and is based in Moscow, Russia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": null,
        "website": "http://www.globaltrans.com",
        "market_cap": 1079699968
    },
    "GLTR.ME": {
        "short_name": "GLOBALTRANS INVEST",
        "long_name": "Globaltrans Investment Plc",
        "summary": "Globaltrans Investment Plc, together with its subsidiaries, provides freight rail transportation, railcar leasing, and ancillary services in Russia, Estonia, and Ukraine. It transports metallurgical cargoes, oil products and oil, coal, and construction materials; and leases and maintains rolling stock. As of December 31, 2020, the company operated a fleet of 71,688 units, including t 67,762 owned units and 3,926 leased units. It serves various Blue-chip, metals and mining, oil and gas, and other industrial sectors. The company was incorporated in 2004 and is based in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": null,
        "website": "http://www.globaltrans.com",
        "market_cap": null
    },
    "GTRK.ME": {
        "short_name": "GLOBALTRUCK MGMT",
        "long_name": "Public Joint Stock Company Globaltruck Management",
        "summary": "Public Joint Stock Company Globaltruck Management provides full truck load trucking services in Russia and internationally. It offers standard transportation services using full truck load long-haul trucks; and temperature-controlled transportation services. As of June 30, 2017, the company operated a fleet of 1,090 trucks, as well as 1,170 trailers, including 768 tents and 402 refrigerator trailers. It serves retail, fast-moving consumer goods, manufacturing, bulk, e-commerce, and parcel industry sectors. The company was founded in 2016 and is based in Moscow, Russia. Public Joint Stock Company Globaltruck Management is a subsidiary of GT Globaltruck Limited.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "105082",
        "website": "http://www.gt-m.ru",
        "market_cap": 3403088640
    },
    "H0H1.F": {
        "short_name": "HMS HYDR.MA.+SYS GDR REGS",
        "long_name": "HMS Hydraulic Machines & Systems Group plc",
        "summary": "HMS Hydraulic Machines & Systems Group plc, together with its subsidiaries, manufactures and repairs various pumps and pumping units, compressors, and modular equipment for oil and gas companies in Russia and internationally. It operates through four segments: Industrial Pumps, Oil and Gas Equipment and Projects, Compressors, and Construction. The company designs, manufactures, and supplies pumping equipment used in oil extraction process, oil and products transportation and processing, thermal and nuclear power generation, water supply, utilities and environment, chemical processing, steel and mining, pulp and paper, food, etc. It also offers compressor equipment used in various industries, such as a range of process gases, compressor systems and stations, and refrigerating machines and units. In addition, the company develops, produces, and delivers customized skid mounted modular equipment including water injection stations for oil formation and formation pressure maintenance; oil and gas pumping and processing stations; automated group measuring plants; chemical dosing units, and measuring and vessel equipment; and oilfield equipment used in oil exploration intensification and efficiency, current and work over repairs, isolation works, and fracturing, as well as provides complex maintenance and overhaul services for related equipment. Further, it offers engineering and construction services for oil, gas, and gas condensate fields development, as well as for production and infrastructural facilities erection in the oil and gas, and water industries. The company was founded in 1993 and is headquartered in Moscow, Russia. HMS Hydraulic Machines & Systems Group plc is a subsidiary of H.M.S Technologies Ltd.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "125047",
        "website": "http://www.grouphms.com",
        "market_cap": 95913976
    },
    "HHR": {
        "short_name": "HeadHunter Group PLC",
        "long_name": "HeadHunter Group PLC",
        "summary": "HeadHunter Group PLC, together with its subsidiaries, operates an online recruitment platform in Russia, Kazakhstan, Belarus, and internationally. The company offers employers and recruiters paid access to its curriculum vitae database and job postings platform; and job seekers and employers with a range of value-added services. It provides its services for businesses that are looking for job seekers to fill vacancies inside their organizations. The company was formerly known as Zemenik Trading Limited and changed its name to HeadHunter Group PLC in March 2018. HeadHunter Group PLC was founded in 2000 and is headquartered in Moscow, Russia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "129085",
        "website": "http://hh.ru",
        "market_cap": 2186746880
    },
    "HHRU.ME": {
        "short_name": "HEADHUNTER GROUP P",
        "long_name": "HeadHunter Group PLC",
        "summary": "HeadHunter Group PLC, together with its subsidiaries, operates an online recruitment platform in Russia, Kazakhstan, Belarus, and internationally. The company offers employers and recruiters paid access to its curriculum vitae database and job postings platform; and job seekers and employers with a range of value-added services. It provides its services for businesses that are looking for job seekers to fill vacancies inside their organizations. The company was formerly known as Zemenik Trading Limited and changed its name to HeadHunter Group PLC in March 2018. HeadHunter Group PLC was founded in 2000 and is headquartered in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "129085",
        "website": "http://hh.ru",
        "market_cap": null
    },
    "IRKT.ME": {
        "short_name": "IRKUT CORPORATION",
        "long_name": "Irkut Corporation",
        "summary": "Irkut Corporation researches, designs, tests, manufactures, sells, and markets military and civil aircraft for Russian and foreign governments. It also offers after-sales support services. The company was founded in 1932 and is headquartered in Moscow, Russia. Irkut Corporation is a subsidiary of Public Joint Stock Company United Aircraft Corporation.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "125315",
        "website": "http://www.irkut.com",
        "market_cap": 57607278592
    },
    "KMAZ.ME": {
        "short_name": "KAMAZ PTC",
        "long_name": "KAMAZ Publicly Traded Company",
        "summary": "KAMAZ Publicly Traded Company manufactures, markets, and sells trucks and spare parts. It offers buses; dump, high sided, and loader crane trucks; trailers; mixer trucks; engines; and chassis. The company is also involved in the manufacturing and sale of specialized machinery and spare parts; car components; water supply and electric power transmission activities; leasing of non-residential premises, trucks, and buses; provision of hotel and recreation resort services; provision of non-state pension fund and compulsory pension insurance; truck distribution and maintenance; and other activities. It offers its products through a distribution and service network in Russia, the Commonwealth of Independent States, and internationally. The company also exports its products. KAMAZ Publicly Traded Company was founded in 1969 and is based in Naberezhnye Chelny, Russia.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Naberezhnye Chelny",
        "zipcode": "423827",
        "website": "http://www.kamaz.ru",
        "market_cap": 53466587136
    },
    "KMEZ.ME": {
        "short_name": "KOVROV MECHANICAL",
        "long_name": "Kovrov Mechanical Plant, Public Joint-Stock Company",
        "summary": "Public Joint Stock Company Kovrov Mechanical Plant develops and manufactures gas centrifuges for the nuclear industry in Russia. The company's gas centrifuges are used for the separation of uranium isotopes. It also produces and sells permanent magnets and magnet systems; manufactures various tools; and leases non-residential office premises and production areas, as well as engaged in water supply services. The company was founded in 1950 and is based in Kovrov, Russia. Public Joint Stock Company Kovrov Mechanical Plant operates as a subsidiary of JSC TVEL.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Kovrov",
        "zipcode": null,
        "website": "http://www.kvmz.ru",
        "market_cap": 4754690048
    },
    "KRKOP.ME": {
        "short_name": "KRASNY KOTELSHCHIK",
        "long_name": "Public Joint Stock Company The Taganrog Boiler-Making Works Krasny Kotelshchik",
        "summary": "Public Joint Stock Company The Taganrog Boiler-Making Works Krasny Kotelshchik engages in the design, manufacture, and integrated supply of equipment for thermal power industry. It manufactures and sells boilers comprising fired steam, waste-heat, biomass, and oil and gas industrial boilers, as well as boilers for burning municipal solid waste and biomass. The company also provides heat-exchange and auxiliary equipment; boilers components and equipment for boilers; heat recovery steam generators; heating surfaces; and connection parts and components of the pipelines. In addition, it offers various types of filters, including clarifying, sorption carbon, regenerative, and trapping; and exchangers, such as mixed bed ion, parallel flow ion, and counter flow ion, as well as hydraulic agitators and pressure tanks for the storage of concentrated agents. The company provides its products under TKZ brand name. Public Joint Stock Company The Taganrog Boiler-Making Works Krasny Kotelshchik was founded in 1896 and is based in Taganrog, Russia. The company is a subsidiary of PJSC EnergoMashinostroitelny Alliance.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Taganrog",
        "zipcode": null,
        "website": "http://www.tkz.su",
        "market_cap": 7092866048
    },
    "MSTT.ME": {
        "short_name": "MOSTOTREST PJSC",
        "long_name": "Public Joint Stock Company Mostotrest",
        "summary": "Public Joint Stock Company Mostotrest operates as a transport infrastructure construction company in of Russia. It operates through Construction and Services segments. The company is involved in the engineering, construction, and overhaul of highways and bridges, railways and railway bridges, airfields and airports, and ports and waterways. It also constructs and overhauls other infrastructure projects, including construction projects of subway lines, tunnels, and monorails; and non-infrastructure works comprising the construction of foundations for business centers, residential houses, and shopping malls, as well as undertakes shore protection and other ancillary works. In addition, the company provides road maintenance, heavy maintenance, equipment and systems maintenance, toll collection, and traffic safety inspectors services. It primarily serves federal state agencies of the Russian ministry of transport, state corporations, regional and municipal authorities, and private customers. The company was founded in 1930 and is based in Moscow, Russia. Public Joint Stock Company Mostotrest is a subsidiary of JSC TFK-Finance.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "121087",
        "website": "http://www.mostotrest.ru",
        "market_cap": 27445409792
    },
    "NAUK.ME": {
        "short_name": "NPO NAUKA",
        "long_name": "Public joint stock company NPO Nauka",
        "summary": "Public joint stock company NPO Nauka manufactures and sells aerospace equipment in Russia and internationally. It offers products, such as dehumidifiers, dampers, valves, pneumatic controls, ground control boards, pressure regulators, heat exchangers, turbo refrigerators, air controlling units, filters, and air ejectors, as well as electronic control and monitoring units, signaling devices, and regulators. The company also provides services, such as design support, architectural supervision, testing center services, test and control laboratory, and implementation of unclaimed components. Public joint stock company NPO Nauka was founded in 1893 and is based in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "125040",
        "website": "http://www.npo-nauka.ru",
        "market_cap": 2259843072
    },
    "NKHP.ME": {
        "short_name": "NOVOROSSIYSK GRAIN",
        "long_name": "Public Joint Stock Company Novorossyisk Grain Plant",
        "summary": "Public Joint Stock Company Novorossyisk Grain Plant owns and operates grain terminals in Russia. The company provides grain cargo transshipment, warehouse, and berthing services. It also engages in the processing of wheat flour. The company was founded in 1882 and is based in Novorossiysk, Russia. Public Joint Stock Company Novorossyisk Grain Plant is a subsidiary of United Grain Company JSC.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Novorossiysk",
        "zipcode": "353909",
        "website": "http://www.novoroskhp.ru",
        "market_cap": 24470114304
    },
    "NMTP.ME": {
        "short_name": "NOVOROSSIYSK COMME",
        "long_name": "Public Joint Stock Company Novorossiysk Commercial Sea Port",
        "summary": "Public Joint Stock Company Novorossiysk Commercial Sea Port, together with its subsidiaries, provides stevedoring, port, and sea vessel services in Russia. The company's stevedoring services include loading and unloading of oil, oil products, grains, mineral fertilizers, chemicals, containers, timber, timber products, metal products, sugar, and other cargo, as well as fuel bunkering; and other port services comprises freight forwarding, storage, custom documentation, repacking, and ship repair. It also engages in the rental and resale of energy and utilities; provides fleet services, including tugging, towing, and other related services; and operates container and passenger terminals. In addition, the company provides emergency services, such as transferring vessels to shelter zones during emergencies, cleaning and containment services for oil or other liquid spills in and around the port, and hazardous material response and waste management services, as well as mooring and bunkering services. It serves ship owners or marine agents, freight owners or freight owners/agents, freighters, and other customers. The company was founded in 1845 and is based in Novorossiysk, Russia. Public Joint Stock Company Novorossiysk Commercial Sea Port is a subsidiary of Public Joint Stock Company Transneft.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Novorossiysk",
        "zipcode": "353900",
        "website": "http://www.nmtp.info",
        "market_cap": 131228598272
    },
    "OMZZP.ME": {
        "short_name": "UNITED HEAVY MACH",
        "long_name": "Open Joint Stock Company OMZ",
        "summary": "Open Joint Stock Company OMZ operates as a heavy machine-building company in Russia and internationally. The company manufactures equipment for nuclear power plants; and storing and transporting spent nuclear fuel, as well as provides investment engineering and servicing for nuclear power plants. It is involved in the development and implementation of technologies for the production of air separation equipment, supply of industrial gases, and development of comprehensive solutions for associated gas, natural gas, and liquefied natural gas. The company also manufactures equipment for nuclear power plants; and equipment for hydrocracking units, hydrotreating units, catalytic cracking units, and others. In addition, it produces special steels for power and nuclear power, metallurgical, mining, and petrochemical machine-building, as well as special-purpose items. Further, the company designs and produces general industrial and special-purpose valves, including shutoff, gate, butterfly, control, ball, check, swing check, hermetically sealed, relief, and instrumentation valves; and products for ship-building, such as autonomous, self-installing shaft line slip bearings. Additionally, it provides engineering integrated solutions and services. Open Joint Stock Company OMZ was founded in 1996 and is based in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "115035",
        "website": "http://www.omz.ru",
        "market_cap": 3534396325888
    },
    "RKKE.ME": {
        "short_name": "ENERGIA ROCKET AND",
        "long_name": "S.P. Korolev Rocket and Space Public Corporation Energia Open Joint Stock Company",
        "summary": "S.P. Korolev Rocket and Space Public Corporation Energia Open Joint Stock Company operates in the rocket-space industry in Russia, the United States, Egypt, Japan, Italy, and the United Arab Emirates. The company develops and operates international space station; manufactures and launches transport manned space vehicles and transport cargo space vehicles; and conducts research and development activities in the field of building manned transportation systems, space infrastructure, and arranging space expeditions to different areas of circumterrestrial space and the solar system. It also builds automatic space vehicles for multipurpose space systems, including automatic space vehicles of satellite communication and earth remote sensing systems; and manufactures upper stages DM for launching global satellite navigation systems and spacecraft. In addition, the company provides services for commercial launches of foreign astronauts and tourists; communication services; health resort treatment and children's health camp services; and catering, food commodities, security, and printing services. Further, it produces heat carrier, as well as heat energy in the form of steam and hot water. The company was founded in 1946 and is based in Korolev, Russia.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Korolev",
        "zipcode": "141070",
        "website": "http://www.energia.ru",
        "market_cap": 9270459392
    },
    "SFIN.ME": {
        "short_name": "SAFMAR FINL INV",
        "long_name": "Public Joint Stock Company \"SAFMAR Financial investments\"",
        "summary": "Public Joint Stock Company Â\u0093SAFMAR Financial InvestmentsÂ\u0094, an investment holding, operates in the financial sector. The company leases passenger cars, commercial vehicles, self-propelled machines, buses, and other assets. It also offers life and property, motor, health, and other insurance products; compulsory pension insurance services; corporate and individual pension plans; and POS lending brokerage services. The company was founded in 1999 and is based in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "119049",
        "website": "http://www.safmarinvest.ru",
        "market_cap": 50683650048
    },
    "TUZA.ME": {
        "short_name": "TUIMAZINSKIY ZAVOD",
        "long_name": "Tuimazinskiy Zavod Avtobetonovozov Publicly Traded Company",
        "summary": "Tuimazinskiy Zavod Avtobetonovozov Publicly Traded Company designs and manufactures special purpose machinery for concrete covering inclined-axis mixers, autoconcrete pumps, and booms. The company provides concrete mixers, stationary concrete pumps, trailers, trailer shorts, fire-fighting foam lifters, linear concrete pumps, and other products. It also offers capacitive equipment, metal structures, and steel castings, as well as plasma cutting and metalworking services. The company was formerly known as OAO Tuimazinskiy Zavod Avtobetonovozov and changed its name to Tuimazinskiy Zavod Avtobetonovozov Publicly Traded Company in November 2016. The company was founded in 1980 and is based in Tuymazy, Russia. Tuimazinskiy Zavod Avtobetonovozov Publicly Traded Company is a subsidiary of KAMAZ Publicly Traded Company.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Tuymazy",
        "zipcode": "452755",
        "website": "http://www.tzacom.ru",
        "market_cap": 789120000
    },
    "UNAC.ME": {
        "short_name": "UNITED AIRCRAFT CO",
        "long_name": "Public Joint Stock Company United Aircraft Corporation",
        "summary": "Public Joint Stock Company United Aircraft Corporation, together with its subsidiaries, engages in the development, manufacture, sale, and aftersales maintenance of civil, military, transport, and special-purpose aircraft in Russia. The company offers aircraft primarily under the Sukhoi, MiG, Ilyushin, Tupolev, Yakovlev, MC-21, Superjet 100, and Beriev brands. It is also involved in the modernization, repair, and recycling of aircraft; and training of aircrews. The company was incorporated in 2006 and is headquartered in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "101000",
        "website": "http://www.uacrussia.ru",
        "market_cap": 308619411456
    },
    "UTAR.ME": {
        "short_name": "UTAIR AVIATION",
        "long_name": "Public Joint-Stock Company UTair Aviation",
        "summary": "Public Joint-Stock Company UTair Aviation provides passenger and cargo transportation services on domestic and international routes. It offers its services through aircraft and helicopters. The company was incorporated in 1992 and is based in Surgut, Russia. Public Joint-Stock Company UTair Aviation operates as a subsidiary of OOO AK-invest.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Airlines",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Surgut",
        "zipcode": "628422",
        "website": "http://www.utair.ru",
        "market_cap": 26098724864
    },
    "UWGN.ME": {
        "short_name": "UNITED WAGON COMPA",
        "long_name": "Public Joint Stock Company Research and Production Corporation United Wagon Company",
        "summary": "Public Joint Stock Company Research and Production Corporation United Wagon Company engages in the freight car building business in Russia and internationally. The company offers gondolas, hoppers, tank cars, platforms, box and dump cars, bogies, car castings, bogie suspension springs, wheelsets, and flat cars. It also sells and leases railcars; generates power; and issues debt securities. In addition, the company provides goods transportation; utilities; and engineering and construction services. The company operates 72 service centers. Public Joint Stock Company Research and Production Corporation United Wagon Company was incorporated in 2011 and is based in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "119002",
        "website": "http://www.uniwagon.com",
        "market_cap": 8120000000
    },
    "VSYD.ME": {
        "short_name": "VYBORG SHIPYARD P",
        "long_name": "Public joint-stock company Vyborg Shipyard",
        "summary": "Public joint-stock company Vyborg Shipyard operates as a shipbuilding company in the north-western region of Russia. The company is involved in the construction of small and medium tonnage vessels, icebreaking supply vessels, icebreakers, trawlers, and offshore drilling rigs. It also provides ship repair and upgrading services. The company was founded in 1948 and is based in Vyborg, Russia. Public joint-stock company Vyborg Shipyard operates as a subsidiary of OAO \"Western Shipbuilding Center\".",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Vyborg",
        "zipcode": "188800",
        "website": "http://www.vyborgshipyard.ru",
        "market_cap": 9132758016
    },
    "ZILL.ME": {
        "short_name": "LIKHACHOV PLANT PJ",
        "long_name": "Public Joint-Stock Company The Likhachov Plant",
        "summary": "Public Joint-Stock Company The Likhachov Plant produces and sells automobiles in Russia. It offers cars and spare parts. The company was founded in 1916 and is based in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "115280",
        "website": "http://www.amo-zil.ru/en/",
        "market_cap": 10998934528
    }
}