{
    "IRKT.ME": {
        "short_name": "IRKUT CORPORATION",
        "long_name": "Irkut Corporation",
        "summary": "Irkut Corporation researches, designs, tests, manufactures, sells, and markets military and civil aircraft for Russian and foreign governments. It also offers after-sales support services. The company was founded in 1932 and is headquartered in Moscow, Russia. Irkut Corporation is a subsidiary of Public Joint Stock Company United Aircraft Corporation.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Moscow"
    },
    "KMEZ.ME": {
        "short_name": "KOVROV MECHANICAL",
        "long_name": "Kovrov Mechanical Plant, Public Joint-Stock Company",
        "summary": "Public Joint Stock Company Kovrov Mechanical Plant develops and manufactures gas centrifuges for the nuclear industry in Russia. The company's gas centrifuges are used for the separation of uranium isotopes. It also produces and sells permanent magnets and magnet systems; manufactures various tools; and leases non-residential office premises and production areas, as well as engaged in water supply services. The company was founded in 1950 and is based in Kovrov, Russia. Public Joint Stock Company Kovrov Mechanical Plant operates as a subsidiary of JSC TVEL.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Kovrov"
    },
    "NAUK.ME": {
        "short_name": "NPO NAUKA",
        "long_name": "Public joint stock company NPO Nauka",
        "summary": "Public joint stock company NPO Nauka manufactures and sells aerospace equipment in Russia and internationally. It offers products, such as dehumidifiers, dampers, valves, pneumatic controls, ground control boards, pressure regulators, heat exchangers, turbo refrigerators, air controlling units, filters, and air ejectors, as well as electronic control and monitoring units, signaling devices, and regulators. The company also provides services, such as design support, architectural supervision, testing center services, test and control laboratory, and implementation of unclaimed components. Public joint stock company NPO Nauka was founded in 1893 and is based in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Moscow"
    },
    "RKKE.ME": {
        "short_name": "ENERGIA ROCKET AND",
        "long_name": "S.P. Korolev Rocket and Space Public Corporation Energia Open Joint Stock Company",
        "summary": "S.P. Korolev Rocket and Space Public Corporation Energia Open Joint Stock Company operates in the rocket-space industry in Russia, the United States, Egypt, Japan, Italy, and the United Arab Emirates. The company develops and operates international space station; manufactures and launches transport manned space vehicles and transport cargo space vehicles; and conducts research and development activities in the field of building manned transportation systems, space infrastructure, and arranging space expeditions to different areas of circumterrestrial space and the solar system. It also builds automatic space vehicles for multipurpose space systems, including automatic space vehicles of satellite communication and earth remote sensing systems; and manufactures upper stages DM for launching global satellite navigation systems and spacecraft. In addition, the company provides services for commercial launches of foreign astronauts and tourists; communication services; health resort treatment and children's health camp services; and catering, food commodities, security, and printing services. Further, it produces heat carrier, as well as heat energy in the form of steam and hot water. The company was founded in 1946 and is based in Korolev, Russia.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Korolev"
    },
    "UNAC.ME": {
        "short_name": "UNITED AIRCRAFT CO",
        "long_name": "Public Joint Stock Company United Aircraft Corporation",
        "summary": "Public Joint Stock Company United Aircraft Corporation, together with its subsidiaries, engages in the development, manufacture, sale, and aftersales maintenance of civil, military, transport, and special-purpose aircraft in Russia. The company offers aircraft primarily under the Sukhoi, MiG, Ilyushin, Tupolev, Yakovlev, MC-21, Superjet 100, and Beriev brands. It is also involved in the modernization, repair, and recycling of aircraft; and training of aircrews. The company was incorporated in 2006 and is headquartered in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Moscow"
    },
    "VSYD.ME": {
        "short_name": "VYBORG SHIPYARD P",
        "long_name": "Public joint-stock company Vyborg Shipyard",
        "summary": "Public joint-stock company Vyborg Shipyard operates as a shipbuilding company in the north-western region of Russia. The company is involved in the construction of small and medium tonnage vessels, icebreaking supply vessels, icebreakers, trawlers, and offshore drilling rigs. It also provides ship repair and upgrading services. The company was founded in 1948 and is based in Vyborg, Russia. Public joint-stock company Vyborg Shipyard operates as a subsidiary of OAO \"Western Shipbuilding Center\".",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Vyborg"
    }
}