{
    "CHEP.ME": {
        "short_name": "CHELYABINSK PIPE",
        "long_name": "Public Joint Stock Company \"Chelyabinsk Pipe-Rolling Plant\"",
        "summary": "Public Joint Stock Company Chelyabinsk Pipe Plant produces and sells welded and seamless steel pipe products for fuel and energy industries in Russia. The company operates through four segments: Steel Pipe Production, Oilfield Services, Trunk Pipeline Systems, and Scrap Procurement. It offers casings, tubing, boiler tubes, cold-finished and hot-finished pipes and tubes, small-diameter welded pipes, and stainless steel pipes; pipeline transport; and high pressure pumps. The company pipeline fittings, which include tee, elbow, reducer, cap, split tees, cold and hot induction bends, and 3D bends products. In addition, it offers ball, bellows-type globe, check, globe, and swing check valves; electrical submersible motors; gas separators and dispersers; surface pumping system; and perforated liner products. It serves oil and gas industry, housing, utilities infrastructure, and industrial applications. It exports its products to the European Union, the Commonwealth of Independent States, North America, the Middle East, and North Africa. The company was founded in 1942 and is based in Chelyabinsk, Russia. As of March 16, 2021, Public Joint Stock Company \"Chelyabinsk Pipe-Rolling Plant\" operates as a subsidiary of PAO TMK.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Chelyabinsk",
        "zipcode": "454129",
        "website": "http://www.chelpipe.ru",
        "market_cap": "Large Cap"
    },
    "CHKZ.ME": {
        "short_name": "CHELYABINSK FORGE&",
        "long_name": "Chelyabinsk Forge-and-Press Plant, Public Joint Stock Company",
        "summary": "Chelyabinsk Forge-and-Press Plant, Public Joint Stock Company operates as a forging company in Russia and internationally. The company offers hot-die forgings and machined parts, cold sheet-metal stampings, flanges, wheels and rims, and special purpose vehicles, as well as finished pipeline fittings. It serves automotive and agriculture industries. The company was founded in 1942 and is based in Chelyabinsk, Russia.",
        "currency": "RUB",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Chelyabinsk",
        "zipcode": "454012",
        "website": "http://www.chkpz.ru",
        "market_cap": "Mid Cap"
    }
}