{
    "SUPVN.MX": {
        "short_name": "GRUPO SUPERVIELLE S.A.",
        "long_name": "Grupo Supervielle S.A.",
        "summary": "Grupo Supervielle S.A., a financial services holding company, provides various banking products and services in Argentina. The company operates through Retail Banking, Corporate Banking, Treasury, Consumer, Insurance, and Mutual Fund Administration and Other segments. It offers savings accounts, time and demand deposits, and checking accounts; personal loans, mortgage loans, unsecured loans, pledge loans; car loans, loans with special facilities for project and working capital financing; leasing, bank guarantees for tenants, salary advances, domestic and international factoring, international guarantees and letters of credit, payroll payment plans, credit cards, debit cards, and financial services and investments such as mutual funds and guarantees. The company provides foreign trade finance and cash management; advisory services; treasury services include operations with government securities of the Group, syndicated loans, and financial lease; insurance products primarily personal accidents insurance, protected bag insurance, life insurance, and integral insurance policies for entrepreneurs and SMEs; and asset management and other services, as well as operates as an online broker. It operates through a network of 316 access points, including 185 bank branches, 13 banking payment and collection centers, 79 CCF sales points, 34 consumer financing branches and other sale points, 5 Mila's customer support offices, and 393 car dealers, as well as 536 ATMs, 217 self-service terminals, and 202 cash dispensers. The company was formerly known as Inversiones y Participaciones S.A. and changed its name to Grupo Supervielle S.A. in November 2008. Grupo Supervielle S.A. was founded in 1887 and is headquartered in Buenos Aires, Argentina.",
        "currency": "MXN",
        "sector": "Financial",
        "industry": "Money Center Banks",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Argentina",
        "state": null,
        "city": "Buenos Aires",
        "zipcode": "C1036AAH",
        "website": "http://www.gruposupervielle.com",
        "market_cap": null
    }
}