{
    "2801.TW": {
        "short_name": "CHANG HWA COMMERCIAL BANK LTD",
        "long_name": "Chang Hwa Commercial Bank, Ltd.",
        "summary": "Chang Hwa Commercial Bank, Ltd., together with its subsidiaries, provides commercial banking products and services in Taiwan and internationally. The company offers deposits, including checking, demand, time, and savings deposits, as well as negotiable certificates of deposit; and remittances and credit cards. It also provides TWD/foreign currency loans for SMEs projects; personal mortgage loans; syndicated loans; negotiated and discounted, margin, short-term, medium-term, long-term, and overdue loans; and overdrafts. In addition, the company offers foreign exchange, wealth management, and e-banking services. Further, it is involved in trust, international banking, and investment operations; and the provision of life insurance agency and securities brokerage services. The company serves individuals and corporates. It operates through 185 domestic offices; 7 overseas units in New York, Los Angeles, Tokyo, London, Hong Kong, Singapore, and Manila; and 1 representative office in Yangon, as well as 649 ATMs. The company was founded in 1905 and is headquartered in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung City",
        "zipcode": "40045",
        "website": "http://www.bankchb.com",
        "market_cap": "Mid Cap"
    },
    "2812.TW": {
        "short_name": "TAICHUNG COMMERCIAL BANK",
        "long_name": "Taichung Commercial Bank Co., Ltd.",
        "summary": "Taichung Commercial Bank Co., Ltd. provides various banking products and services in Taiwan. The company offers various deposit products, such as savings account and time deposit accounts, foreign currency demand deposits, cash, and travel checks and remittance; corporate finance services, which include corporate loans, letter of credit, collections, and factoring and forfaiting, as well as account information, deposits, payments, accounts receivable financing, hedging strategies, financial instruments, and consultation services; and personal mortgage loans comprising house mortgage, house renovations, children's education funds, business start-up capital, investments, and financial management services. It also provides financial advice, asset allocation, consultation service, and trust planning, as well as family and retirement services; credit cards; and online banking, mobile banking, and mobile payment services. As of December 31, 2020, the company had 81 branches, a Malaysia Labuan branch, and an offshore banking unit. The company was formerly known as Taichung Small and Medium Business Bank Company Limited and changed its name to Taichung Commercial Bank Co., Ltd. in December 1998. Taichung Commercial Bank Co., Ltd. was founded in 1952 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "40341",
        "website": "http://www.tcbbank.com.tw",
        "market_cap": "Small Cap"
    },
    "2820.TW": {
        "short_name": "CHINA BILLS FINANCE CORP",
        "long_name": "China Bills Finance Corporation",
        "summary": "China Bills Finance Corporation provides various financial services in Taiwan. The company engages in the certification and underwriting of short-term bills, bank debentures, and foreign currency bills; brokerage and trading of short-term bills, bank debentures, government bonds, and foreign bonds; guaranteeing short-term bills; and provision of financial consulting services to enterprises. It is also involved in the proprietary trading of corporate bonds; equity investments; and fixed income securities trading, as well as provision of inter-bank call loans. The company operates through a network of five branches located in Banqiao, Taoyuan, Taichung, Tainan, and Kaohsiung. China Bills Finance Corporation was incorporated in 1978 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "114",
        "website": "http://www.cbf.com.tw",
        "market_cap": "Small Cap"
    },
    "2836.TW": {
        "short_name": "BANK OF KAOHSIUNG LTD",
        "long_name": "Bank of Kaohsiung Co., Ltd.",
        "summary": "Bank of Kaohsiung Co., Ltd. provides commercial banking products and services primarily in Taiwan. The company offers Taiwan dollar and foreign exchange deposits. It also provides personal loans, such as consumer, mortgage, reverse mortgage, and student loans, as well as personal overdrafts; and business loans comprising unsecured and secured overdrafts, short-term unsecured and secured loans, bank discounts, discount notes loans, general export financing, procurement loans, general commercial loans, guarantees and acceptances, and SME and emergency financing services. In addition, the company offers foreign exchange services, including import and export business, remittances and deposits, outright forwards, swaps, and margin trade, as well as structured products; offshore banking services; foreign exchange deposits; investment management services, such as offshore bonds services, funds, and life and non-life insurance services; credit cards; electronic banking services; and trust services. It operates approximately 36 branch offices, including one offshore banking unit and two mini-branches. The company was formerly known as City Bank of Kaohsiung Co., Ltd. and changed its name to Bank of Kaohsiung Co., Ltd. in January 1994. Bank of Kaohsiung Co., Ltd. was founded in 1982 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": null,
        "website": "http://www.bok.com.tw",
        "market_cap": "Small Cap"
    },
    "2836A.TW": {
        "short_name": "BANK OF KAOHSIUNG LTD",
        "long_name": "Bank of Kaohsiung Co., Ltd.",
        "summary": "Bank of Kaohsiung Co., Ltd. provides commercial banking products and services primarily in Taiwan. The company offers Taiwan dollar and foreign exchange deposits. It also provides personal loans, such as consumer, mortgage, reverse mortgage, and student loans, as well as personal overdrafts; and business loans comprising unsecured and secured overdrafts, short-term unsecured and secured loans, bank discounts, discount notes loans, general export financing, procurement loans, general commercial loans, guarantees and acceptances, and SME and emergency financing services. In addition, the company offers foreign exchange services, including import and export business, remittances and deposits, outright forwards, swaps, and margin trade, as well as structured products; offshore banking services; foreign exchange deposits; investment management services, such as offshore bonds services, funds, and life and non-life insurance services; credit cards; electronic banking services; and trust services. It operates approximately 36 branch offices, including one offshore banking unit and two mini-branches. The company was formerly known as City Bank of Kaohsiung Co., Ltd. and changed its name to Bank of Kaohsiung Co., Ltd. in January 1994. Bank of Kaohsiung Co., Ltd. was founded in 1982 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": null,
        "website": "http://www.bok.com.tw",
        "market_cap": null
    },
    "2849.TW": {
        "short_name": "EN TIE COMMERCIAL BANK",
        "long_name": "EnTie Commercial Bank Co., Ltd.",
        "summary": "EnTie Commercial Bank Co., Ltd. provides banking products and services primarily in Taiwan. The company offers accounts and deposits. It also provides loans and overdrafts. In addition, the company offers consumer finance and wealth management products; and engages in the corporate and financial market operations. The company was founded in 1992 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11049",
        "website": "http://www.entiebank.com.tw",
        "market_cap": "Small Cap"
    },
    "2850.TW": {
        "short_name": "SHINKONG INSURANCE CO",
        "long_name": "Shinkong Insurance Co., Ltd.",
        "summary": "Shinkong Insurance Co., Ltd. engages in the insurance business in Taiwan. Its insurance products include motor, fire, marine, engineering, liability, and accident and health insurance. The company was founded in 1963 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Insurance - Property & Casualty",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "104",
        "website": "http://www.skinsurance.com.tw",
        "market_cap": "Small Cap"
    },
    "2855.TW": {
        "short_name": "PRESIDENT SECURITIES",
        "long_name": "President Securities Corporation",
        "summary": "President Securities Corporation, together with its subsidiaries, engages in the brokerage, proprietary trading, fixed income, reinvestment, wealth management, and shareholder services in the People's Republic of China. It is involved in various activities, including underwriting of securities; dealing or brokerage business of securities at the securities exchange markets and business premises; registration and transfer agency service for securities; margin loans and short sales business of securities; securities lending and borrowing business; futures introducing brokerage services; futures dealing; issuance of call warrants; new financial instrument transactions; and trust business. The company was founded in 1988 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "105",
        "website": "http://www.pscnet.com.tw",
        "market_cap": "Small Cap"
    },
    "2867.TW": {
        "short_name": "MERCURIES LIFE INSURANCE CO LTD",
        "long_name": "Mercuries Life Insurance Co., Ltd.",
        "summary": "Mercuries Life Insurance Co., Ltd. provides life insurance products primarily in Taiwan. The company also offers term life, health, accident, annuities, group, travel safety, and investment insurance products, as well as pension, group, and bank channel goods insurance products. It operates through six branch offices located in Taipei, Taichung, Chiayi, Tainan, and Kaohsiung. The company was founded in 1993 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.mli.com.tw",
        "market_cap": "Small Cap"
    },
    "2881.TW": {
        "short_name": "FUBON FINANCIAL HLDG CO LTD",
        "long_name": "Fubon Financial Holding Co., Ltd.",
        "summary": "Fubon Financial Holding Co., Ltd. provides various financial services in Taiwan, rest of Asia, the United States, and internationally. It operates through Bank Business, Insurance Business, Life Insurance Business, Securities Business, and Others segments. The company primarily offers insurance products, including property, casualty, life, accident, health, fire, marine cargo, motor, liability, engineering and nuclear, surety and credit, and personal and commercial multiple peril insurance, as well as typhoon, flood, and earthquake insurance products. It also provides retail and consumer, corporate, and investment banking services; brokerage services; margin lending; securities financing and refinancing, trading, underwriting, and transfer services; and investment and financial management, futures, and foreign currency and CNY services, as well as operates insurance agency. In addition, the company offers venture capital, marketing management, creditor's rights management, IT software, asset management, stadium management, and sports services, as well as trust, financial bill, and credit card services; and invests in and manages real estate properties. Fubon Financial Holding Co., Ltd. was founded in 1961 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "106",
        "website": "http://www.fubon.com",
        "market_cap": "Large Cap"
    },
    "2881A.TW": {
        "short_name": "FUBON FINANCIAL HLDG CO LTD",
        "long_name": "Fubon Financial Holding Co., Ltd.",
        "summary": "Fubon Financial Holding Co., Ltd. provides various financial services in Taiwan, rest of Asia, the United States, and internationally. It operates through Bank Business, Insurance Business, Life Insurance Business, Securities Business, and Others segments. The company primarily offers insurance products, including property, casualty, life, accident, health, fire, marine cargo, motor, liability, engineering and nuclear, surety and credit, and personal and commercial multiple peril insurance, as well as typhoon, flood, and earthquake insurance products. It also provides retail and consumer, corporate, and investment banking services; brokerage services; margin lending; securities financing and refinancing, trading, underwriting, and transfer services; and investment and financial management, futures, and foreign currency and CNY services, as well as operates insurance agency. In addition, the company offers venture capital, marketing management, creditor's rights management, IT software, asset management, stadium management, and sports services, as well as trust, financial bill, and credit card services; and invests in and manages real estate properties. Fubon Financial Holding Co., Ltd. was founded in 1961 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "106",
        "website": "http://www.fubon.com",
        "market_cap": "Large Cap"
    },
    "2882.TW": {
        "short_name": "CATHAY FINANCIAL HLDG CO",
        "long_name": "Cathay Financial Holding Co., Ltd.",
        "summary": "Cathay Financial Holding Co., Ltd., through its subsidiaries, provides various financial services in Taiwan. The company operates through five segments: Banking, Life Insurance, Property Insurance, Securities, and Other. It provides foreign exchange and guarantee, foreign currency investment advisory, trust, offshore banking, and other financial services. The company also offers traditional, investment-linked, and annuity insurance products; fire insurance, marine insurance, land and air insurance, liability insurance, financial guarantee insurance, reinsurance, and other insurance products; and financial planning services and policy loan services. In addition, it provides securities brokerage, discretionary and underwriting, and security financial services, as well as other financial products. Further, the company also provides real estate investment and management, wealth management, venture capital, asset management, fund management, banking, futures, risk management software, and securities investment consulting services. Cathay Financial Holding Co., Ltd. was founded in 2001 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "106",
        "website": "http://www.cathayholdings.com",
        "market_cap": "Large Cap"
    },
    "2884.TW": {
        "short_name": "E SUN FINANCIAL HOLDINGS",
        "long_name": "E.SUN Financial Holding Company, Ltd.",
        "summary": "E.SUN Financial Holding Company, Ltd., through its subsidiaries, provides various financial products and services in Taiwan and internationally. The company operates through Corporate Banking Unit, Individual Banking Unit, Overseas Branches and Subsidiaries, and Others segments. It offers corporate and unsecured personal loans, and residential mortgages; foreign exchange, financial banking, and wealth management services; and credit cards and payment services. The company also deals in, underwrites, and brokers securities; and futures brokerage, venture capital investment, trust, insurance agency, security consultancy, real estate leasing and management, and remittance services. In addition, it is involved in the retail sale of computer software; and provision of software design, data processing, digital information supply, and business consultancy services. As of December 31, 2019, it operated a business department, an international banking department, a trust department, a credit card and payment division, an offshore banking unit, an insurance agent department, 8 overseas branches, and 138 domestic branches. E.SUN Financial Holding Company, Ltd. was founded in 1992 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10546",
        "website": "http://www.esunfhc.com",
        "market_cap": "Large Cap"
    },
    "2887.TW": {
        "short_name": "TAISHIN FINANCIAL HLDGS CO LTD",
        "long_name": "Taishin Financial Holding Co., Ltd.",
        "summary": "Taishin Financial Holding Co., Ltd., through its subsidiaries, provides various financial products and services in Taiwan and internationally. The company offers wealth management services to individuals, households, and business owners; consumer loans, micro corporate loans, and credit cards to individuals, as well as payment processing services for merchants; digital banking services; wholesale banking services for multinationals, corporations, small and medium sized enterprises, government agencies, and financial institutions; and financial market and trust services. It also provides securities underwriting, brokerage, margin lending, and security transfer services, as well as deals in futures; and property and life insurance brokerage services. In addition, the company engages in the acquisition, evaluation, auction, and management of delinquent loans; audit and consultation of construction plans, contract witness, and assessment and trade of real estate, etc.; lease, wholesale, and retail sale of machinery, precision machinery, motor vehicles, aircrafts, and vessels and components; and financial leasing and investment start-up activities. Further, it accepts mandates from customers, provides analytical opinions or recommendations on securities investment, acts as an agent for investment consultancy of offshore funds, and issues publications or holds lectures about securities investment and other related business. Additionally, the company offers securities investment trust funds; issues beneficial interest certificates; and invests and trades in securities, securities-related products, and other items. Taishin Financial Holding Co., Ltd. was founded in 1992 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "106",
        "website": "http://www.taishinholdings.com.tw",
        "market_cap": "Mid Cap"
    },
    "2887E.TW": {
        "short_name": "TAISHIN FINANCIAL HLDGS CO LTD",
        "long_name": "Taishin Financial Holding Co., Ltd.",
        "summary": "Taishin Financial Holding Co., Ltd., through its subsidiaries, provides various financial products and services in Taiwan and internationally. The company offers wealth management services to individuals, households, and business owners; consumer loans, micro corporate loans, and credit cards to individuals, as well as payment processing services for merchants; digital banking services; wholesale banking services for multinationals, corporations, small and medium sized enterprises, government agencies, and financial institutions; and financial market and trust services. It also provides securities underwriting, brokerage, margin lending, and security transfer services, as well as deals in futures; and property and life insurance brokerage services. In addition, the company engages in the acquisition, evaluation, auction, and management of delinquent loans; audit and consultation of construction plans, contract witness, and assessment and trade of real estate, etc.; lease, wholesale, and retail sale of machinery, precision machinery, motor vehicles, aircrafts, and vessels and components; and financial leasing and investment start-up activities. Further, it accepts mandates from customers, provides analytical opinions or recommendations on securities investment, acts as an agent for investment consultancy of offshore funds, and issues publications or holds lectures about securities investment and other related business. Additionally, the company offers securities investment trust funds; issues beneficial interest certificates; and invests and trades in securities, securities-related products, and other items. Taishin Financial Holding Co., Ltd. was founded in 1992 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "106",
        "website": "http://www.taishinholdings.com.tw",
        "market_cap": "Mid Cap"
    },
    "2889.TW": {
        "short_name": "IBF FINANCIAL HOLDINGS CO LTD",
        "long_name": "IBF Financial Holdings Co., Ltd.",
        "summary": "IBF Financial Holdings Co., Ltd., through its subsidiaries, provides various financial products and services for individual and corporate clients. The company is involved in the certification and underwriting of short-term bills, financial debentures, and securities; brokerage and proprietary trading of short-term bills, as well as futures and securities brokerage transactions; guarantee and endorsement of short-term bills; and proprietary trading of government bonds, financial debentures, corporate and foreign currency bonds, securities, and equity-related futures. It also provides corporate finance, equity, securities investment, and futures investment advisory services; financial derivatives; investment trust services; convertible bond asset services; margin lending and short sales financing; stock affairs and interbank call loans agent services; wealth management services; capital, management expertise and consultative services to investees; and general investment and financial leasing services. In addition, the company engages in the procurement of leased property, as well as leased property residual value disposal and maintenance activities; offers leasing transactions counseling, and non-financing guarantee services; and invests in equity related commodities. IBF Financial Holdings Co., Ltd. was founded in 2002 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "104",
        "website": "http://www.ibf.com.tw",
        "market_cap": "Small Cap"
    },
    "2890.TW": {
        "short_name": "SINOPAC FINANCIAL HLDGS CO LTD",
        "long_name": "SinoPac Financial Holdings Company Limited",
        "summary": "SinoPac Financial Holdings Company Limited, through its subsidiaries, provides banking, securities, investment trust, leasing, and venture capital services worldwide. It operates through Banking, Securities, and Other Business segments. The company offers commercial banking services, such as corporate finance, personal finance, wealth management, money and finance products, electronic banking, etc. It also provides broking, proprietary trading, underwriting, international business, fixed income, financial products, etc.; installment sale and purchase, lease, real estate lease, and other financing services; and products and services in the areas of mutual funds, discretionary accounts, and private equity. In addition, the company assists in deal sourcing, business cooperation, establishing strategic partnerships, and creating value in its portfolio companies; and provides factoring, fund management, asset management, insurance brokerage, and corporation management services. It operates 125 branches, including 83 branches in the greater Taipei area, with service locations in major metropolitan areas in the central and south, Hualien, and Kinmen. The company was founded in 1948 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://www.sinopac.com",
        "market_cap": "Mid Cap"
    },
    "2891.TW": {
        "short_name": "CTBC FINANCIAL HOLDINGS COMPANY",
        "long_name": "CTBC Financial Holding Co., Ltd.",
        "summary": "CTBC Financial Holding Co., Ltd. engages in the banking, bills financing, credit card, trust, securities, futures, asset management, and other financial related business investment activities. The company offers loans, guarantees, foreign exchange, bonds, proprietary trading, safe deposit boxes, derivatives, factoring, online banking, and lottery services; installment, leasing, and account receivable services; and transaction financing, cash management, fiduciary and agent, international trade financing, syndication lending, structured finance, and financial advisory services. It also provides life, health, annuity, group, and investment insurance products; and property insurance products, including fire, marine, miscellaneous casualty, voluntary auto, and personal accident insurances. In addition, the company offers securities and futures related services, as well as publicly-traded securities and investment opportunities in emerging stocks and futures trading; and asset-backed security services. Further, it is involved in the venture capital business investing in information technology, communications, biotechnology, health care, cultural, creative, and alternative energy industries, as well as companies in traditional industries; debt and mortgage management business; and overseas, international, and payment business. Additionally, the company provides securities investment trust, consulting, foreign financial institutions, discretionary investment, and offshore fund master agent services, as well as security services to corporate entities. It operates approximately 152 branches in Taiwan; and 116 overseas branches in the United States, Japan, Canada, the Philippines, Indonesia, Vietnam, India, and Singapore. The company was formerly known as ChinaTrust Financial Holding Co., Ltd. and changed its name to CTBC Financial Holding Co., Ltd. in June 2013. CTBC Financial Holding Co., Ltd. was founded in 2002 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "115",
        "website": "http://www.ctbcholding.com",
        "market_cap": "Large Cap"
    },
    "2891C.TW": {
        "short_name": "CTBC FINANCIAL HOLDINGS COMPANY",
        "long_name": "CTBC Financial Holding Co., Ltd.",
        "summary": "CTBC Financial Holding Co., Ltd. engages in the banking, bills financing, credit card, trust, securities, futures, asset management, and other financial related business investment activities. The company offers loans, guarantees, foreign exchange, bonds, proprietary trading, safe deposit boxes, derivatives, factoring, online banking, and lottery services; installment, leasing, and account receivable services; and transaction financing, cash management, fiduciary and agent, international trade financing, syndication lending, structured finance, and financial advisory services. It also provides life, health, annuity, group, and investment insurance products; and property insurance products, including fire, marine, miscellaneous casualty, voluntary auto, and personal accident insurances. In addition, the company offers securities and futures related services, as well as publicly-traded securities and investment opportunities in emerging stocks and futures trading; and asset-backed security services. Further, it is involved in the venture capital business investing in information technology, communications, biotechnology, health care, cultural, creative, and alternative energy industries, as well as companies in traditional industries; debt and mortgage management business; and overseas, international, and payment business. Additionally, the company provides securities investment trust, consulting, foreign financial institutions, discretionary investment, and offshore fund master agent services, as well as security services to corporate entities. It operates approximately 152 branches in Taiwan; and 116 overseas branches in the United States, Japan, Canada, the Philippines, Indonesia, Vietnam, India, and Singapore. The company was formerly known as ChinaTrust Financial Holding Co., Ltd. and changed its name to CTBC Financial Holding Co., Ltd. in June 2013. CTBC Financial Holding Co., Ltd. was founded in 2002 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "115",
        "website": "http://www.ctbcholding.com",
        "market_cap": "Large Cap"
    },
    "2905.TW": {
        "short_name": "MERCURIES & ASSOCIATES HOLDING ",
        "long_name": "Mercuries & Associates Holding, Ltd.",
        "summary": "Mercuries & Associates Holding, Ltd., an investment holding company, engages in the life insurance, daily commodities and food retail, pharmaceuticals, and information services businesses. The company offers lifetime and whole life insurance; hospitalization and medical care, cancer, and whole life medical and healthcare insurance; personal accident, travel, and online accident insurance; immediate and deferred annuity insurance, and pension insurance with floating interest rates; variable annuity and variable life insurance; 1 year term group life and group health insurance; group accident insurance; and long-term care lifetime, and disability care lifetime health insurance, as well as insurance in foreign currencies. It also purchases and sells daily commodities and food, alcohols, beverages, tobacco, daily necessities, cooked food, fresh foods, medical supplies, infant products, cosmetics, and beauty products; and branded footwear, apparel, and accessories, as well as serves fast food, including noodles, rice, fried pork chops, Japanese bento sets, and pizzas. In addition, the company engages in the sale and decoration of furniture, cabinets, kitchen utensils, and mattresses. Further, it manufactures active pharmaceutical ingredients (API), such as valporic acid and allopurinol; API intermediates comprising diethyl dipropyl malonate and PENT-2 ethyl 2-allyl-2-cyano-3-methylhexanoate; and specialty chemicals that include diethyl ketone. Additionally, the company offers software and hardware planning, development, and establishment services for financial information systems and public utilities; and software and hardware maintenance services. The company was formerly known as Mercuries & Associates, Ltd. and changed its name to Mercuries & Associates Holding, Ltd. in January 2015. Mercuries & Associates Holding, Ltd. was founded in 1965 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.mercuries.com.tw",
        "market_cap": "Small Cap"
    },
    "3158.TWO": {
        "short_name": "SysJust",
        "long_name": "SysJust Co., Ltd.",
        "summary": "SysJust Co., Ltd. operates as a financial technology company in Taiwan. It offers various platforms, including XQ Global Winner, XS strategy radar, and XQ mobile platform; WQ new VIP viewing room; MoneyDJ; Lok Fu Finance channel for data analysis and reading on smart phones, tablets, and computers; and database. The company was founded in 1999 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23141",
        "website": "http://www.sysjust.com.tw",
        "market_cap": "Micro Cap"
    },
    "3709.TWO": {
        "short_name": "TRIGOLD HOLDINGS LTD",
        "long_name": "Trigold Holdings Limited",
        "summary": "Trigold Holdings Limited, through its subsidiaries, sells computers and its peripherals in Taiwan and Mainland China. It also operates B2C and O2O businesses, and amusement parks. The company was founded in 1988 and is based in Taipei, Taiwan. Trigold Holdings Limited is a subsidiary of WPG Holdings Limited.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "115",
        "website": "http://www.trigoldholdings.com",
        "market_cap": "Micro Cap"
    },
    "5820.TWO": {
        "short_name": "JIH SUN FINANCIAL HLDG CO",
        "long_name": "JihSun Financial Holding Co.,Ltd.",
        "summary": "JihSun Financial Holding Co.,Ltd., together with its subsidiaries, operates as a financial holding company in Taiwan. It engages in securities brokerage, trading, underwriting, and margin purchases and short sales; and stock transaction agency and futures trading activities, as well as provides auxiliary services for futures trading and stock warrant issuance. The company also offers general deposits, loans and discounts, stocks, short term securities, financial bonds, and others, as well as government bond investment and collection, fund trust transaction, and employee investment trust services. In addition, it operates as a property and life insurance agent, as well as provides venture capital, securities investment research, and proprietary trading services. Further, the company is involved in the securities research and analysis, corporate and personal financial planning, and financing activities, as well as sale of mutual funds and other financial products. JihSun Financial Holding Co.,Ltd. was incorporated in 2002 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.jsun.com",
        "market_cap": "Small Cap"
    },
    "5859.TWO": {
        "short_name": "FGLIFE",
        "long_name": "Farglory Life Insurance Co., Ltd.",
        "summary": "Farglory Life Insurance Co., Ltd. provides insurance products and services in Taiwan. It offers life, health, injury, travel, savings, and annuity insurance products, as well as investment products. The company was founded in 1993 and is headquartered in Taipei, Taiwan. Farglory Life Insurance Co., Ltd. is a subsidiary of Farglory Group.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.fglife.com.tw",
        "market_cap": "Small Cap"
    },
    "5863.TWO": {
        "short_name": "BOFT",
        "long_name": "Taipei Star Bank",
        "summary": "Taipei Star Bank provides various banking products and services in Taiwan. The company accepts check deposits, demand deposits, and time deposits; and domestic foreign exchange and commercial bills. It also provides short-term, medium-term, and long-term loans; bill discounts; letters of credit; treasury bills; safe deposit box; and guarantees. In addition, the company also invests in financial, public, short-term, and corporate bonds, as well as stocks; collects and pays against agents; and purchases and sells foreign currencies cash and traveler cheque. Further, it provides warehousing, and storage and agency services. The company was formerly known as Bank of Taipei, Ltd. Taipei Star Bank is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.taipeistarbank.com.tw",
        "market_cap": "Micro Cap"
    },
    "5871.TW": {
        "short_name": "CHAILEASE HOLDING COMPANY LIMIT",
        "long_name": "Chailease Holding Company Limited",
        "summary": "Chailease Holding Company Limited, an investment holding company, provides various leasing and financing services in Taiwan, China, ASEAN countries, and internationally. It offers leasing services for a range of assets, including transportation, industrial, medical, and information and office-related equipment, as well as aircraft; and installment sales service to corporate customers in various industries, such as transportation, storage and communications, wholesale and retail, and construction, as well as to individual consumers. The company also provides import/export factoring services; direct financing services, such as corporate loans to SMEs, and micro and large size enterprises; and debt collection and management, debt and collateral appraisal, auctioning, and past-due accounts receivable management services to financial institutions. In addition, it is involved in the life and property insurance brokerage; engineering, procurement, construction, operations, and maintenance of solar power plants; and real estate development businesses. Further, the company provides house property leasing and management services; financial consulting and investment activities; mortgage services; and cloud products software. Chailease Holding Company Limited was founded in 1977 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.chaileaseholding.com",
        "market_cap": "Large Cap"
    },
    "5871A.TW": {
        "short_name": "CHAILEASE HOLDING COMPANY LIMIT",
        "long_name": "Chailease Holding Company Limited",
        "summary": "Chailease Holding Company Limited, an investment holding company, provides various leasing and financing services in Taiwan, China, ASEAN countries, and internationally. It offers leasing services for a range of assets, including transportation, industrial, medical, and information and office-related equipment, as well as aircraft; and installment sales service to corporate customers in various industries, such as transportation, storage and communications, wholesale and retail, and construction, as well as to individual consumers. The company also provides import/export factoring services; direct financing services, such as corporate loans to SMEs, and micro and large size enterprises; and debt collection and management, debt and collateral appraisal, auctioning, and past-due accounts receivable management services to financial institutions. In addition, it is involved in the life and property insurance brokerage; engineering, procurement, construction, operations, and maintenance of solar power plants; and real estate development businesses. Further, the company provides house property leasing and management services; financial consulting and investment activities; mortgage services; and cloud products software. Chailease Holding Company Limited was founded in 1977 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.chaileaseholding.com",
        "market_cap": null
    },
    "5878.TWO": {
        "short_name": "TAIMING ASSURANCE BROKER CO LTD",
        "long_name": "Taiming Assurance Broker Co.,Ltd.",
        "summary": "Taiming Assurance Broker Co., Ltd. engages in the life and property insurance brokerage business in Taiwan. It offers personal life, injury, health, annuity, group, and investment insurance products. The company also provides fire, automobile, liability, and other property insurance. Taiming Assurance Broker Co., Ltd. was founded in 2002 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Insurance Brokers",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.tabc.com.tw",
        "market_cap": "Nano Cap"
    },
    "5880.TW": {
        "short_name": "TAIWAN COOPERATIVE FINANCIAL HL",
        "long_name": "Taiwan Cooperative Financial Holding Co., Ltd.",
        "summary": "Taiwan Cooperative Financial Holding Co., Ltd., together with its subsidiaries, provides commercial banking, insurance, securities, bills finance, asset management, and investment trust services in Taiwan. It offers general deposits and loans. The company is also involved in the planning, management, and operation of the trust business; and custodianship of nondiscretionary trust funds in domestic and overseas securities and mutual funds. In addition, it engages in securities brokerage, dealing, and underwriting activities; provision of pecuniary and securities financing facilities for the trading of listed securities; and trading of futures and futures proprietary trading business. Further, the company brokers and deals in short-term bills, government bonds, and bank debentures; underwrites commercial papers; acts as a registrar of commercial papers; provides guarantees on or endorsements of commercial paper and bank acceptance, as well as consulting services on corporate financial matters; brokers call loans between financial institutions; deals in corporate bonds; and offers investment related equity instruments. Additionally, it is involved in the purchase, appraisal, auction, and management of financial institutions' creditors' rights, as well as the purchase of accounts receivable and management of overdue receivables; and life and property insurance brokering business. As of December 31, 2020, the company operated 269 branches in Taiwan, as well as 1 offshore banking unit, 13 overseas branches, 8 overseas sub-branches, and 2 representative offices. Taiwan Cooperative Financial Holding Co., Ltd. was founded in 2011 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "105",
        "website": "http://www.tcfhc.com.tw",
        "market_cap": "Large Cap"
    },
    "6020.TWO": {
        "short_name": "TACHAN SECURITIES CO",
        "long_name": "TaChan Securities Co.,Ltd.",
        "summary": "TaChan Securities Co.,Ltd. provides brokerage services in Taiwan. The company operates through three segments: Brokerage Department, Investment Banking Department, and Proprietary Trading Department. It offers securities lending/borrowing services, such as margin trading and short sale for the trading of securities, securities-backed lending, and unrestricted purpose loans; stock-related custody settlement, IPO subscription, bid auction, and securities borrowing and lending services; futures introducing brokerage services; and other securities investment consulting services, as well as undertakes the trading of securities, including online, mobile, and telephone order placements. The company also trades in securities comprising listed stocks, funds, and bonds for own account; manages derivatives consisting of call warrants, and securities-related futures and options; plans and counsels IPO process; guides and plans listing process of shares; plans and evaluates raising of capital and corporate financing strategy; invests and trades in emerging stocks; and promotes investment and venture capital business. In addition, it engages in the convertible bond asset swap business; trading of corporate and financial bonds, and bond transactions, and electronic bond trading systems; and reverse auction of government bonds on primary market. Further, the company provides securities investment consulting services, including accepting consignment to offer research and analysis opinions or suggestions on securities investment related matters; accepting discretionary investment; issuing securities-related products; and organizing securities-related seminars. The company was incorporated in 1988 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10351",
        "website": "http://www.tachan.com.tw",
        "market_cap": "Micro Cap"
    },
    "6021.TWO": {
        "short_name": "TA CHING SECURITIES CO",
        "long_name": "Ta Ching Securities Co., Ltd.",
        "summary": "Ta Ching Securities Co., Ltd. provides securities services in Taiwan. The company engages in the general brokerage of market securities and self-financing securities, stock index futures, options, and foreign securities; and securities trading business. It is also involved in the provision of securities underwriting and issuing, and financial advisory services; and futures business. In addition, the company offers bond buyout and selling services; and bond investment advisory services. Ta Ching Securities Co., Ltd. was founded in 1988 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.tcstock.com.tw",
        "market_cap": "Micro Cap"
    },
    "6592.TW": {
        "short_name": "HOTAI FINANCE CO LTD",
        "long_name": "Hotai Finance Co., Ltd.",
        "summary": "Hotai Finance Co., Ltd., together with its subsidiaries, provides vehicle installment sales, and machinery and equipment leasing services in Taiwan and China. It also offers new and used car installment loans; installment loan for motorcycle and scooter; and refinance loans for car, motorcycle, and scooter. In addition, the company provides corporate financing/leasing products, such as medical, freight truck, and CNC machines leasing; installment loans for equipment and semi-finished products or materials; and factoring services. Further, it engages in passenger car leasing activities. The company was founded in 1999 and is headquartered in Taipei, Taiwan. Hotai Finance Co., Ltd. Is a subsidiary of Hotai Motor Co.,Ltd.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://www.hfcfinance.com.tw",
        "market_cap": "Small Cap"
    },
    "9941.TW": {
        "short_name": "YULON FINANCE CORPORATION",
        "long_name": "Yulon Finance Corporation",
        "summary": "Yulon Finance Corporation provides various financial services in Taiwan, China, and internationally. The company operates through Financing, Leasing, and Others segments. It offers vehicle and personal financing services, including new and used car, and motorcycle loan installments; auto mortgage loans; and auto leasing services, as well as installment plans for other products and services. The company also provides corporate financing services, such as installment plans for heavy vehicles and equipment leasing services. In addition, it offers used car sale intermediation services comprising auto auction and vehicle inspection; installment financing services for consumer goods; and advisory services, as well as acts as a business agent for secondhand vehicles. Further, the company provides temporary labor services; taxi transportation services; truck installment payment services; used vehicle authentication and evaluation services; and electric vehicles brokerage services. Additionally, it engages in the sale and brokerage of second hand vehicles; wholesale of cars and parts; wholesale and retail of information software and batteries; trading of cars; sale and maintenance of cars and parts; towing activities; and sale of automotive related products. Yulon Finance Corporation was founded in 1990 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10683",
        "website": "http://www.tac.com.tw",
        "market_cap": "Small Cap"
    },
    "9941A.TW": {
        "short_name": "YULON FINANCE CORPORATION",
        "long_name": "Yulon Finance Corporation",
        "summary": "Yulon Finance Corporation provides various financial services in Taiwan, China, and internationally. The company operates through Financing, Leasing, and Others segments. It offers vehicle and personal financing services, including new and used car, and motorcycle loan installments; auto mortgage loans; and auto leasing services, as well as installment plans for other products and services. The company also provides corporate financing services, such as installment plans for heavy vehicles and equipment leasing services. In addition, it offers used car sale intermediation services comprising auto auction and vehicle inspection; installment financing services for consumer goods; and advisory services, as well as acts as a business agent for secondhand vehicles. Further, the company provides temporary labor services; taxi transportation services; truck installment payment services; used vehicle authentication and evaluation services; and electric vehicles brokerage services. Additionally, it engages in the sale and brokerage of second hand vehicles; wholesale and retail of information software and batteries; trading of cars; sale and maintenance of cars and parts; towing activities; and sale of automotive related products. Yulon Finance Corporation was incorporated in 1990 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10683",
        "website": "http://www.tac.com.tw",
        "market_cap": "Small Cap"
    },
    "BLS.SI": {
        "short_name": "Hotung Inv",
        "long_name": "Hotung Investment Holdings Limited",
        "summary": "Hotung Investment Holdings Limited, an investment holding company, engages in the venture capital business in Taiwan, China, and internationally. It invests in listed, over the counter, and unlisted companies. The company also provides consultancy services, as well as manages third party funds. Hotung Investment Holdings Limited was incorporated in 1997 and is based in Taipei, Taiwan.",
        "currency": "SGD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10483",
        "website": "http://www.hihl.com.sg",
        "market_cap": "Micro Cap"
    },
    "CUII": {
        "short_name": "CHINA UNITED INSURANCE SERVICE ",
        "long_name": "China United Insurance Service, Inc.",
        "summary": "China United Insurance Service, Inc., through its subsidiaries, provides brokerage and related services related to life insurance, and property and casualty insurance products in the People's Republic of China. The company offers life insurance products, including individual whole life, individual term life, individual health, accidental injury, investment-oriented, foreign currency insurance commodities, travel accident, individual endowment life, and individual annuity insurance. It also provides property and casualty insurance products, such as automobile, casualty, liability, and commercial property insurance. The company markets and sells life, and property and casualty insurance products directly to customers through the sales professionals, who are independent contractors. China United Insurance Service, Inc. was incorporated in 2010 and is headquartered in Taipei City, Taiwan.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance Brokers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10595",
        "website": "http://www.holdingscuis.com/cuis_en/",
        "market_cap": "Micro Cap"
    },
    "SYQH": {
        "short_name": "LIAONING SHUIYUN QINGHE RICE IN",
        "long_name": "Liaoning Shuiyun Qinghe Rice Industry Co., Ltd.",
        "summary": "Evergreen International Corp. provides sea, air, and land transportation services. It also engages in the hotel, advertising, printing, and shipping agency businesses. The company was founded in 1968 and is based in Taipei, Taiwan.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://www.evergreen.com.tw",
        "market_cap": null
    }
}