{"2812.TW": {"short_name": "TAICHUNG COMMERCIAL BANK", "long_name": "Taichung Commercial Bank Co., Ltd.", "summary": "Taichung Commercial Bank Co., Ltd. provides various banking products and services in Taiwan. The company offers various deposit products, such as passbooks, check deposits, certificates of deposit, and negotiable certificates of deposit. Its loan portfolio comprises general, project, policy, syndication, international trade finance, mortgage, subordinate mortgages and small-amount credit, and auto loans, as well as credit cards. The company is also involved in foreign exchange operations, including import, export, and foreign exchange activities, as well as foreign currency deposits and loans; the provision of e-banking services, such as personal/corporate online banking, mobile banking, Web ATM, all-round collection business, evaluation and management of automation equipment settings, and account-link services with e-commerce platforms; and TWD and foreign-currency capital management, foreign exchange trading, securities trading, and long-term equity investment activities. In addition, it offers wealth management; trust services, including specific money trust funds, securities certification, real estate-related trust, advance payment trust, specific-purpose and individually managed money trust, and custody of securities investment trust; and financial instruments and financial advisory services. Further, the company engages in insurance brokerage, leasing, and securities and futures businesses. As of December 31, 2019, it had 81 branches, a Malaysia Labuan branch, and an offshore banking unit. The company was formerly known as Taichung Small and Medium Business Bank Company Limited and changed its name to Taichung Commercial Bank Co., Ltd. in December 1998. Taichung Commercial Bank Co., Ltd. was founded in 1952 and is headquartered in Taichung, Taiwan.", "currency": "TWD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taichung"}, "2820.TW": {"short_name": "CHINA BILLS FINANCE CORP", "long_name": "China Bills Finance Corporation", "summary": "China Bills Finance Corporation provides various financial services in Taiwan. The company engages in the certification and underwriting of short-term bills, bank debentures, and foreign currency bills; brokerage and trading of short-term bills, bank debentures, government bonds, and foreign bonds; guaranteeing short-term bills; and provision of financial consulting services to enterprises. It is also involved in the proprietary trading of corporate bonds; equity investments; and fixed income securities trading, as well as provision of inter-bank call loans. The company operates through a network of five branches located in Banqiao, Taoyuan, Taichung, Tainan, and Kaohsiung. China Bills Finance Corporation was incorporated in 1978 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "2836.TW": {"short_name": "BANK OF KAOHSIUNG LTD", "long_name": "Bank of Kaohsiung Co., Ltd.", "summary": "Bank of Kaohsiung Co., Ltd. provides commercial banking products and services primarily in Taiwan. The company offers Taiwan dollar and foreign exchange deposits. It also provides personal loans, such as consumer, mortgage, reverse mortgage, and student loans, as well as personal overdrafts; and business loans comprising unsecured and secured overdrafts, short-term unsecured and secured loans, bank discounts, discount notes loans, general export financing, procurement loans, general commercial loans, guarantees and acceptances, and SME and emergency financing services. In addition, the company offers foreign exchange services, including import and export business, remittances and deposits, outright forwards, swaps, and margin trade, as well as structured products; offshore banking services; foreign exchange deposits; investment management services, such as offshore bonds services, funds, and life and non-life insurance services; credit cards; electronic banking services; and trust services. It operates approximately 36 branch offices, including one offshore banking unit and two mini-branches. The company was formerly known as City Bank of Kaohsiung Co., Ltd. and changed its name to Bank of Kaohsiung Co., Ltd. in January 1994. Bank of Kaohsiung Co., Ltd. was founded in 1982 and is headquartered in Kaohsiung, Taiwan.", "currency": "TWD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Kaohsiung"}, "2836A.TW": {"short_name": "BANK OF KAOHSIUNG LTD", "long_name": "Bank of Kaohsiung Co., Ltd.", "summary": "Bank of Kaohsiung Co., Ltd. provides commercial banking products and services primarily in Taiwan. The company offers Taiwan dollar and foreign exchange deposits. It also provides personal loans, such as consumer, mortgage, reverse mortgage, and student loans, as well as personal overdrafts; and business loans comprising unsecured and secured overdrafts, short-term unsecured and secured loans, bank discounts, discount notes loans, general export financing, procurement loans, general commercial loans, guarantees and acceptances, and SME and emergency financing services. In addition, the company offers foreign exchange services, including import and export business, remittances and deposits, outright forwards, swaps, and margin trade, as well as structured products; offshore banking services; foreign exchange deposits; investment management services, such as offshore bonds services, funds, and life and non-life insurance services; credit cards; electronic banking services; and trust services. It operates approximately 36 branch offices, including one offshore banking unit and two mini-branches. The company was formerly known as City Bank of Kaohsiung Co., Ltd. and changed its name to Bank of Kaohsiung Co., Ltd. in January 1994. Bank of Kaohsiung Co., Ltd. was founded in 1982 and is headquartered in Kaohsiung, Taiwan.", "currency": "TWD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Kaohsiung"}, "2849.TW": {"short_name": "EN TIE COMMERCIAL BANK", "long_name": "EnTie Commercial Bank Co., Ltd.", "summary": "EnTie Commercial Bank Co., Ltd. provides banking products and services primarily in Taiwan. The company offers accounts and deposits. It also provides loans and overdrafts. In addition, the company offers consumer finance and wealth management products; and engages in the corporate and financial market operations. The company was founded in 1992 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "2850.TW": {"short_name": "SHINKONG INSURANCE CO", "long_name": "Shinkong Insurance Co., Ltd.", "summary": "Shinkong Insurance Co., Ltd. engages in the insurance business in Taiwan. Its insurance products include motor, fire, marine, engineering, liability, and accident and health insurance. The company was founded in 1963 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Financial Services", "industry": "Insurance—Property & Casualty", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "2867.TW": {"short_name": "MERCURIES LIFE INSURANCE CO LTD", "long_name": "Mercuries Life Insurance Co., Ltd.", "summary": "Mercuries Life Insurance Co., Ltd. provides life insurance products primarily in Taiwan. The company also offers term life, health, accident, annuities, group, travel safety, and investment insurance products, as well as pension, group, and bank channel goods insurance products. It operates through six branch offices located in Taipei, Taichung, Chiayi, Tainan, and Kaohsiung. The company was founded in 1993 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Financial Services", "industry": "Insurance—Life", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "2881.TW": {"short_name": "FUBON FINANCIAL HLDG CO LTD", "long_name": "Fubon Financial Holding Co., Ltd.", "summary": "Fubon Financial Holding Co., Ltd. provides various financial services in Taiwan, rest of Asia, the United States, and internationally. It operates through Bank Business, Insurance Business, Life Insurance Business, Securities Business, and Others segments. The company primarily offers insurance products, including property, casualty, life, accident, health, fire, marine cargo, motor, liability, engineering and nuclear, surety and credit, and personal and commercial multiple peril insurance, as well as typhoon, flood, and earthquake insurance products. It also provides retail and consumer, corporate, and investment banking services; brokerage services; margin lending; securities financing and refinancing, trading, underwriting, and transfer services; and investment and financial management, futures, and foreign currency and CNY services, as well as operates insurance agency. In addition, the company offers venture capital, marketing management, creditor's rights management, IT software, asset management, stadium management, and sports services, as well as trust, financial bill, and credit card services; and invests in and manages real estate properties. Fubon Financial Holding Co., Ltd. was founded in 1961 and is based in Taipei City, Taiwan.", "currency": "TWD", "sector": "Financial Services", "industry": "Insurance—Life", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "2881A.TW": {"short_name": "FUBON FINANCIAL HLDG CO LTD", "long_name": "Fubon Financial Holding Co., Ltd.", "summary": "Fubon Financial Holding Co., Ltd. provides various financial services in Taiwan, rest of Asia, the United States, and internationally. It operates through Bank Business, Insurance Business, Life Insurance Business, Securities Business, and Others segments. The company primarily offers insurance products, including property, casualty, life, accident, health, fire, marine cargo, motor, liability, engineering and nuclear, surety and credit, and personal and commercial multiple peril insurance, as well as typhoon, flood, and earthquake insurance products. It also provides retail and consumer, corporate, and investment banking services; brokerage services; margin lending; securities financing and refinancing, trading, underwriting, and transfer services; and investment and financial management, futures, and foreign currency and CNY services, as well as operates insurance agency. In addition, the company offers venture capital, marketing management, creditor's rights management, IT software, asset management, stadium management, and sports services, as well as trust, financial bill, and credit card services; and invests in and manages real estate properties. Fubon Financial Holding Co., Ltd. was founded in 1961 and is based in Taipei City, Taiwan.", "currency": "TWD", "sector": "Financial Services", "industry": "Insurance—Life", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "2882.TW": {"short_name": "CATHAY FINANCIAL HLDG CO", "long_name": "Cathay Financial Holding Co., Ltd.", "summary": "Cathay Financial Holding Co., Ltd., through its subsidiaries, provides various financial services in Taiwan. The company operates through five segments: Banking, Life Insurance, Property Insurance, Securities, and Other. It provides foreign exchange and guarantee, foreign currency investment advisory, trust, offshore banking, and other financial services. The company also offers traditional, investment-linked, and annuity insurance products; fire insurance, marine insurance, land and air insurance, liability insurance, financial guarantee insurance, reinsurance, and other insurance products; and financial planning services and policy loan services. In addition, it provides securities brokerage, discretionary and underwriting, and security financial services, as well as other financial products. Further, the company also provides real estate investment and management, wealth management, venture capital, asset management, fund management, banking, futures, risk management software, and securities investment consulting services. Cathay Financial Holding Co., Ltd. was founded in 2001 and is based in Taipei City, Taiwan.", "currency": "TWD", "sector": "Financial Services", "industry": "Insurance—Life", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "2887.TW": {"short_name": "TAISHIN FINANCIAL HLDGS CO LTD", "long_name": "Taishin Financial Holding Co., Ltd.", "summary": "Taishin Financial Holding Co., Ltd., through its subsidiaries, provides various financial products and services in Taiwan and internationally. The company offers wealth management services to individuals, households, and business owners; consumer loans, micro corporate loans, and credit cards to individuals, as well as payment processing services for merchants; digital banking services; wholesale banking services for multinationals, corporations, small and medium sized enterprises, government agencies, and financial institutions; and financial market and trust services. It also provides securities underwriting, brokerage, margin lending, and security transfer services, as well as deals in futures; and property and life insurance brokerage services. In addition, the company engages in the acquisition, evaluation, auction, and management of delinquent loans; audit and consultation of construction plans, contract witness, and assessment and trade of real estate, etc.; lease, wholesale, and retail sale of machinery, precision machinery, motor vehicles, aircrafts, and vessels and components; and financial leasing and investment start-up activities. Further, it accepts mandates from customers, provides analytical opinions or recommendations on securities investment, acts as an agent for investment consultancy of offshore funds, and issues publications or holds lectures about securities investment and other related business. Additionally, the company offers securities investment trust funds; issues beneficial interest certificates; and invests and trades in securities, securities-related products, and other items. Taishin Financial Holding Co., Ltd. was founded in 1992 and is based in Taipei City, Taiwan.", "currency": "TWD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "2887E.TW": {"short_name": "TAISHIN FINANCIAL HLDGS CO LTD", "long_name": "Taishin Financial Holding Co., Ltd.", "summary": "Taishin Financial Holding Co., Ltd., through its subsidiaries, provides various financial products and services in Taiwan and internationally. The company offers wealth management services to individuals, households, and business owners; consumer loans, micro corporate loans, and credit cards to individuals, as well as payment processing services for merchants; digital banking services; wholesale banking services for multinationals, corporations, small and medium sized enterprises, government agencies, and financial institutions; and financial market and trust services. It also provides securities underwriting, brokerage, margin lending, and security transfer services, as well as deals in futures; and property and life insurance brokerage services. In addition, the company engages in the acquisition, evaluation, auction, and management of delinquent loans; audit and consultation of construction plans, contract witness, and assessment and trade of real estate, etc.; lease, wholesale, and retail sale of machinery, precision machinery, motor vehicles, aircrafts, and vessels and components; and financial leasing and investment start-up activities. Further, it accepts mandates from customers, provides analytical opinions or recommendations on securities investment, acts as an agent for investment consultancy of offshore funds, and issues publications or holds lectures about securities investment and other related business. Additionally, the company offers securities investment trust funds; issues beneficial interest certificates; and invests and trades in securities, securities-related products, and other items. Taishin Financial Holding Co., Ltd. was founded in 1992 and is based in Taipei City, Taiwan.", "currency": "TWD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "2889.TW": {"short_name": "IBF FINANCIAL HOLDINGS CO LTD", "long_name": "IBF Financial Holdings Co., Ltd.", "summary": "IBF Financial Holdings Co., Ltd., through its subsidiaries, provides various financial products and services for individual and corporate clients. The company is involved in the certification and underwriting of short-term bills, financial debentures, and securities; brokerage and proprietary trading of short-term bills, as well as futures and securities brokerage transactions; guarantee and endorsement of short-term bills; and proprietary trading of government bonds, financial debentures, corporate and foreign currency bonds, securities, and equity-related futures. It also provides corporate finance, equity, securities investment, and futures investment advisory services; financial derivatives; investment trust services; convertible bond asset services; margin lending and short sales financing; stock affairs and interbank call loans agent services; wealth management services; capital, management expertise and consultative services to investees; and general investment and financial leasing services. In addition, the company engages in the procurement of leased property, as well as leased property residual value disposal and maintenance activities; offers leasing transactions counseling, and non-financing guarantee services; and invests in equity related commodities. IBF Financial Holdings Co., Ltd. was founded in 2002 and is based in Taipei City, Taiwan.", "currency": "TWD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "2891.TW": {"short_name": "CTBC FINANCIAL HOLDINGS COMPANY", "long_name": "CTBC Financial Holding Co., Ltd.", "summary": "CTBC Financial Holding Co., Ltd. engages in the banking, bills financing, credit card, trust, securities, futures, asset management, and other financial related business investment activities. The company offers loans, guarantees, foreign exchange, bonds, proprietary trading, safe deposit boxes, derivatives, factoring, online banking, and lottery services; installment, leasing, and account receivable services; and transaction financing, cash management, fiduciary and agent, international trade financing, syndication lending, structured finance, and financial advisory services. It also provides life, health, annuity, group, and investment insurance products; and property insurance products, including fire, marine, miscellaneous casualty, voluntary auto, and personal accident insurances. In addition, the company offers securities and futures related services, as well as publicly-traded securities and investment opportunities in emerging stocks and futures trading; and asset-backed security services. Further, it is involved in the venture capital business investing in information technology, communications, biotechnology, health care, cultural, creative, and alternative energy industries, as well as companies in traditional industries; debt and mortgage management business; and overseas, international, and payment business. Additionally, the company provides securities investment trust, consulting, foreign financial institutions, discretionary investment, and offshore fund master agent services, as well as security services to corporate entities. It operates approximately 152 branches in Taiwan; and 116 overseas branches in the United States, Japan, Canada, the Philippines, Indonesia, Vietnam, India, and Singapore. The company was formerly known as ChinaTrust Financial Holding Co., Ltd. and changed its name to CTBC Financial Holding Co., Ltd. in June 2013. CTBC Financial Holding Co., Ltd. was founded in 2002 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Financial Services", "industry": "Insurance—Life", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "2891C.TW": {"short_name": "CTBC FINANCIAL HOLDINGS COMPANY", "long_name": "CTBC Financial Holding Co., Ltd.", "summary": "CTBC Financial Holding Co., Ltd. engages in the banking, bills financing, credit card, trust, securities, futures, asset management, and other financial related business investment activities. The company offers loans, guarantees, foreign exchange, bonds, proprietary trading, safe deposit boxes, derivatives, factoring, online banking, and lottery services; installment, leasing, and account receivable services; and transaction financing, cash management, fiduciary and agent, international trade financing, syndication lending, structured finance, and financial advisory services. It also provides life, health, annuity, group, and investment insurance products; and property insurance products, including fire, marine, miscellaneous casualty, voluntary auto, and personal accident insurances. In addition, the company offers securities and futures related services, as well as publicly-traded securities and investment opportunities in emerging stocks and futures trading; and asset-backed security services. Further, it is involved in the venture capital business investing in information technology, communications, biotechnology, health care, cultural, creative, and alternative energy industries, as well as companies in traditional industries; debt and mortgage management business; and overseas, international, and payment business. Additionally, the company provides securities investment trust, consulting, foreign financial institutions, discretionary investment, and offshore fund master agent services, as well as security services to corporate entities. It operates approximately 152 branches in Taiwan; and 116 overseas branches in the United States, Japan, Canada, the Philippines, Indonesia, Vietnam, India, and Singapore. The company was formerly known as ChinaTrust Financial Holding Co., Ltd. and changed its name to CTBC Financial Holding Co., Ltd. in June 2013. CTBC Financial Holding Co., Ltd. was founded in 2002 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Financial Services", "industry": "Insurance—Life", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "2897.TW": {"short_name": "O-BANK CO LTD", "long_name": "O-Bank Co., Ltd.", "summary": "O-Bank Co., Ltd. provides various banking products and services in Taiwan, rest of Asia, and the United States. It offers corporate banking services, including short and long term financing for working capitals, guarantees, syndications, and factoring services, as well as general trade finance services, cross-strait banking services, and forfaiting services; and project finance and syndicated loan products. The company also provides trade financing services, such as export and import financing services; factoring services; cash management services, which include corporate internet banking, and payable and receivable management services; and financial advisory services for mergers and acquisitions, corporate restructuring, spin off, share swap, tender offer, management buyout, leveraged buyout, fund raising, and private placement. In addition, it offers foreign exchange deposits; foreign currency guarantees; export services; interest rate products consisting of cross currency swaps, interest rate options, and interest rate swaps; exchange rate products, such as currency forward contract, currency options, and currency swaps; and structured products. Further, it provides securitization products, including real estate asset and asset backed securitization, and collateralized debt obligation services; monetary and property trust services, custodian services; financial consultancy services; and escrow services. The company was formerly known as Industrial Bank of Taiwan Co., Ltd. and changed its name to O-Bank Co., Ltd. in January 2017. O-Bank Co., Ltd. was founded in 1998 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "2897A.TW": {"short_name": "O-BANK CO LTD", "long_name": "O-Bank Co., Ltd.", "summary": "O-Bank Co., Ltd. provides various banking products and services in Taiwan, rest of Asia, and the United States. It offers corporate banking services, including short and long term financing for working capitals, guarantees, syndications, and factoring services, as well as general trade finance services, cross-strait banking services, and forfaiting services; and project finance and syndicated loan products. The company also provides trade financing services, such as export and import financing services; factoring services; cash management services, which include corporate internet banking, and payable and receivable management services; and financial advisory services for mergers and acquisitions, corporate restructuring, spin off, share swap, tender offer, management buyout, leveraged buyout, fund raising, and private placement. In addition, it offers foreign exchange deposits; foreign currency guarantees; export services; interest rate products consisting of cross currency swaps, interest rate options, and interest rate swaps; exchange rate products, such as currency forward contract, currency options, and currency swaps; and structured products. Further, it provides securitization products, including real estate asset and asset backed securitization, and collateralized debt obligation services; monetary and property trust services, custodian services; financial consultancy services; and escrow services. The company was formerly known as Industrial Bank of Taiwan Co., Ltd. and changed its name to O-Bank Co., Ltd. in January 2017. O-Bank Co., Ltd. was founded in 1998 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "2905.TW": {"short_name": "MERCURIES & ASSOCIATES HOLDING ", "long_name": "Mercuries & Associates Holding, Ltd.", "summary": "Mercuries & Associates Holding, Ltd., an investment holding company, engages in the life insurance, daily commodities and food retail, pharmaceuticals, and information services businesses. The company offers lifetime and whole life insurance; hospitalization and medical care, cancer, and whole life medical and healthcare insurance; personal accident, travel, and online accident insurance; immediate and deferred annuity insurance, and pension insurance with floating interest rates; variable annuity and variable life insurance; 1 year term group life and group health insurance; group accident insurance; and long-term care lifetime, and disability care lifetime health insurance, as well as insurance in foreign currencies. It also purchases and sells daily commodities and food, alcohols, beverages, tobacco, daily necessities, cooked food, fresh foods, medical supplies, infant products, cosmetics, and beauty products; and branded footwear, apparel, and accessories, as well as serves fast food, including noodles, rice, fried pork chops, Japanese bento sets, and pizzas. In addition, the company engages in the sale and decoration of furniture, cabinets, kitchen utensils, and mattresses. Further, it manufactures active pharmaceutical ingredients (API), such as valporic acid and allopurinol; API intermediates comprising diethyl dipropyl malonate and PENT-2 ethyl 2-allyl-2-cyano-3-methylhexanoate; and specialty chemicals that include diethyl ketone. Additionally, the company offers software and hardware planning, development, and establishment services for financial information systems and public utilities; and software and hardware maintenance services. The company was formerly known as Mercuries & Associates, Ltd. and changed its name to Mercuries & Associates Holding, Ltd. in January 2015. Mercuries & Associates Holding, Ltd. was founded in 1965 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Financial Services", "industry": "Insurance—Life", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "5871.TW": {"short_name": "CHAILEASE HOLDING COMPANY LIMIT", "long_name": "Chailease Holding Company Limited", "summary": "Chailease Holding Company Limited, an investment holding company, provides various leasing and financing services in Taiwan, China, ASEAN countries, and internationally. It offers leasing services for a range of assets, including transportation, industrial, medical, and information and office-related equipment, as well as aircraft; and installment sales service to corporate customers in various industries, such as transportation, storage and communications, wholesale and retail, and construction, as well as to individual consumers. The company also provides import/export factoring services; direct financing services, such as corporate loans to SMEs, and micro and large size enterprises; and debt collection and management, debt and collateral appraisal, auctioning, and past-due accounts receivable management services to financial institutions. In addition, it offers personal and property insurance brokerage; solar power; and real estate development services. Further, the company provides house property leasing and management services; financial consulting and investment activities; mortgage services; and cloud products software. Chailease Holding Company Limited was founded in 1977 and is based in Taipei, Taiwan. Chailease Holding Company Limited was formerly a subsidiary of Financial One Corp.", "currency": "TWD", "sector": "Financial Services", "industry": "Financial Conglomerates", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "5871A.TW": {"short_name": "CHAILEASE HOLDING COMPANY LIMIT", "long_name": "Chailease Holding Company Limited", "summary": "Chailease Holding Company Limited, an investment holding company, provides various leasing and financing services in Taiwan, China, ASEAN countries, and internationally. It offers leasing services for a range of assets, including transportation, industrial, medical, and information and office-related equipment, as well as aircraft; and installment sales service to corporate customers in various industries, such as transportation, storage and communications, wholesale and retail, and construction, as well as to individual consumers. The company also provides import/export factoring services; direct financing services, such as corporate loans to SMEs, and micro and large size enterprises; and debt collection and management, debt and collateral appraisal, auctioning, and past-due accounts receivable management services to financial institutions. In addition, it offers personal and property insurance brokerage; solar power; and real estate development services. Further, the company provides house property leasing and management services; financial consulting and investment activities; mortgage services; and cloud products software. Chailease Holding Company Limited was founded in 1977 and is based in Taipei, Taiwan. Chailease Holding Company Limited was formerly a subsidiary of Financial One Corp.", "currency": "TWD", "sector": "Financial Services", "industry": "Financial Conglomerates", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "6592.TW": {"short_name": "HOTAI FINANCE CO LTD", "long_name": "Hotai Finance Co., Ltd.", "summary": "Hotai Finance Co., Ltd., together with its subsidiaries, provides vehicle installment sales, and machinery and equipment leasing services in Taiwan and China. It also offers new and used car installment loans; installment loan for motorcycle and scooter; and refinance loans for car, motorcycle, and scooter. In addition, the company provides corporate financing/leasing products, such as medical, freight truck, and CNC machines leasing; installment loans for equipment and semi-finished products or materials; and factoring services. Further, it engages in passenger car leasing activities. The company was founded in 1999 and is headquartered in Taipei, Taiwan. Hotai Finance Co., Ltd. Is a subsidiary of Hotai Motor Co.,Ltd.", "currency": "TWD", "sector": "Financial Services", "industry": "Credit Services", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "9941.TW": {"short_name": "YULON FINANCE CORPORATION", "long_name": "Yulon Finance Corporation", "summary": "Yulon Finance Corporation provides various financial services in Taiwan, China, and internationally. The company operates through Financing, Leasing, and Others segments. It offers vehicle and personal financing services, including new and used car, and motorcycle loan installments; auto mortgage loans; and auto leasing services, as well as installment plans for other products and services. The company also provides corporate financing services, such as installment plans for heavy vehicles and equipment leasing services. In addition, it offers used car sale intermediation services comprising auto auction and vehicle inspection; installment financing services for consumer goods; and advisory services, as well as acts as a business agent for secondhand vehicles. Further, the company provides temporary labor services; taxi transportation services; truck installment payment services; used vehicle authentication and evaluation services; and electric vehicles brokerage services. Additionally, it engages in the sale and brokerage of second hand vehicles; wholesale of cars and parts; wholesale and retail of information software and batteries; trading of cars; sale and maintenance of cars and parts; towing activities; and sale of automotive related products. Yulon Finance Corporation was founded in 1990 and is based in Taipei City, Taiwan.", "currency": "TWD", "sector": "Financial Services", "industry": "Credit Services", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "9941A.TW": {"short_name": "YULON FINANCE CORPORATION", "long_name": "Yulon Finance Corporation", "summary": "Yulon Finance Corporation provides various financial services in Taiwan, China, and internationally. The company operates through Financing, Leasing, and Others segments. It offers vehicle and personal financing services, including new and used car, and motorcycle loan installments; auto mortgage loans; and auto leasing services, as well as installment plans for other products and services. The company also provides corporate financing services, such as installment plans for heavy vehicles and equipment leasing services. In addition, it offers used car sale intermediation services comprising auto auction and vehicle inspection; installment financing services for consumer goods; and advisory services, as well as acts as a business agent for secondhand vehicles. Further, the company provides temporary labor services; taxi transportation services; truck installment payment services; used vehicle authentication and evaluation services; and electric vehicles brokerage services. Additionally, it engages in the sale and brokerage of second hand vehicles; wholesale of cars and parts; wholesale and retail of information software and batteries; trading of cars; sale and maintenance of cars and parts; towing activities; and sale of automotive related products. Yulon Finance Corporation was founded in 1990 and is based in Taipei City, Taiwan.", "currency": "TWD", "sector": "Financial Services", "industry": "Credit Services", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "BLS.SI": {"short_name": "Hotung Inv", "long_name": "Hotung Investment Holdings Limited", "summary": "Hotung Investment Holdings Limited, an investment holding company, engages in the venture capital business in Taiwan, China, and internationally. It invests in listed, over the counter, and unlisted companies. The company also provides consultancy services, as well as manages third party funds. Hotung Investment Holdings Limited was incorporated in 1997 and is based in Taipei, Taiwan.", "currency": "SGD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "SES", "market": "sg_market", "country": "Taiwan", "city": "Taipei"}, "CUII": {"short_name": "CHINA UNITED INSURANCE SERVICE ", "long_name": "China United Insurance Service, Inc.", "summary": "China United Insurance Service, Inc., through its subsidiaries, provides brokerage and related services related to life insurance, and property and casualty insurance products in Taiwan and the People's Republic of China. The company offers life insurance products, including individual whole life, individual term life, individual health, accidental injury, investment-oriented, foreign currency insurance commodities, travel accident, individual endowment life, and individual annuity insurance. It also provides property and casualty insurance products, such as automobile, casualty, liability, and commercial property insurance. The company markets and sells life, and property and casualty insurance products directly to the targeted customers through the sales professionals, who are independent contractors. China United Insurance Service, Inc. was founded in 2010 and is headquartered in Taipei City, Taiwan.", "currency": "USD", "sector": "Financial Services", "industry": "Insurance Brokers", "exchange": "PNK", "market": "us_market", "country": "Taiwan", "city": "Taipei"}, "EVGI": {"short_name": "EVERGREEN INTERNATIONAL CORP (U", "long_name": "Evergreen International Corp.", "summary": "Evergreen International Corp. provides sea, air, and land transportation services. It also engages in the hotel, advertising, printing, and shipping agency businesses. The company was founded in 1968 and is based in Taipei, Taiwan.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "PNK", "market": "us_market", "country": "Taiwan", "city": "Taipei"}, "LNGB": {"short_name": "LONGBAU GROUP INC", "long_name": "Kaopu Group, Inc.", "summary": "Kaopu Group, Inc. offers pre-need death care contracts, and pre-need and at need funeral services in Hong Kong and Taiwan. The company also sells funeral related products; and provides death care consulting services and death care products across Taiwan. It consults on the purchase of cemetery property, and funeral and cemetery merchandise and services at the time of need and on a preneed basis; and provides consultancy services for deferred preneed funeral and cemetery receipts held in trust, preneed cemetery activities, preneed funeral activities, preneed funeral and cemetery, burial vaults, cemetery property, and cemetery property revenue. In addition, the company provides life, property, and casualty insurance products; and insurance brokerage services. The company was formerly known as Longbau Group, Inc. and changed its name to Kaopu Group, Inc. in December 2018. The company was founded in 2013 and is based in Taichung, Taiwan.", "currency": "USD", "sector": "Financial Services", "industry": "Insurance Brokers", "exchange": "PNK", "market": "us_market", "country": "Taiwan", "city": "Taichung"}}