{
    "2801.TW": {
        "short_name": "CHANG HWA COMMERCIAL BANK LTD",
        "long_name": "Chang Hwa Commercial Bank, Ltd.",
        "summary": "Chang Hwa Commercial Bank, Ltd., together with its subsidiaries, provides commercial banking products and services in Taiwan and internationally. The company offers deposits, including checking, demand, time, and savings deposits, as well as negotiable certificates of deposit; and remittances and credit cards. It also provides TWD/foreign currency loans for SMEs projects; personal mortgage loans; syndicated loans; negotiated and discounted, margin, short-term, medium-term, long-term, and overdue loans; and overdrafts. In addition, the company offers foreign exchange, wealth management, and e-banking services. Further, it is involved in trust, international banking, and investment operations; and the provision of life insurance agency and securities brokerage services. The company serves individuals and corporates. It operates through 185 domestic offices; 7 overseas units in New York, Los Angeles, Tokyo, London, Hong Kong, Singapore, and Manila; and 1 representative office in Yangon, as well as 649 ATMs. The company was founded in 1905 and is headquartered in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung City",
        "zipcode": "40045",
        "website": "http://www.bankchb.com",
        "market_cap": "Large Cap"
    },
    "2812.TW": {
        "short_name": "TAICHUNG COMMERCIAL BANK",
        "long_name": "Taichung Commercial Bank Co., Ltd.",
        "summary": "Taichung Commercial Bank Co., Ltd. provides various banking products and services in Taiwan. The company offers various deposit products, such as savings account and time deposit accounts, foreign currency demand deposits, cash, and travel checks and remittance; corporate finance services, which include corporate loans, letter of credit, collections, and factoring and forfaiting, as well as account information, deposits, payments, accounts receivable financing, hedging strategies, financial instruments, and consultation services; and personal mortgage loans comprising house mortgage, house renovations, children's education funds, business start-up capital, investments, and financial management services. It also provides financial advice, asset allocation, consultation service, and trust planning, as well as family and retirement services; credit cards; and online banking, mobile banking, and mobile payment services. As of December 31, 2020, the company had 81 branches, a Malaysia Labuan branch, and an offshore banking unit. The company was formerly known as Taichung Small and Medium Business Bank Company Limited and changed its name to Taichung Commercial Bank Co., Ltd. in December 1998. Taichung Commercial Bank Co., Ltd. was founded in 1952 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "40341",
        "website": "http://www.tcbbank.com.tw",
        "market_cap": "Large Cap"
    },
    "2836.TW": {
        "short_name": "BANK OF KAOHSIUNG LTD",
        "long_name": "Bank of Kaohsiung Co., Ltd.",
        "summary": "Bank of Kaohsiung Co., Ltd. provides commercial banking products and services primarily in Taiwan. The company offers Taiwan dollar and foreign exchange deposits. It also provides personal loans, such as consumer, mortgage, reverse mortgage, and student loans, as well as personal overdrafts; and business loans comprising unsecured and secured overdrafts, short-term unsecured and secured loans, bank discounts, discount notes loans, general export financing, procurement loans, general commercial loans, guarantees and acceptances, and SME and emergency financing services. In addition, the company offers foreign exchange services, including import and export business, remittances and deposits, outright forwards, swaps, and margin trade, as well as structured products; offshore banking services; foreign exchange deposits; investment management services, such as offshore bonds services, funds, and life and non-life insurance services; credit cards; electronic banking services; and trust services. It operates approximately 36 branch offices, including one offshore banking unit and two mini-branches. The company was formerly known as City Bank of Kaohsiung Co., Ltd. and changed its name to Bank of Kaohsiung Co., Ltd. in January 1994. Bank of Kaohsiung Co., Ltd. was founded in 1982 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": null,
        "website": "http://www.bok.com.tw",
        "market_cap": "Large Cap"
    },
    "2836A.TW": {
        "short_name": "BANK OF KAOHSIUNG LTD",
        "long_name": "Bank of Kaohsiung Co., Ltd.",
        "summary": "Bank of Kaohsiung Co., Ltd. provides commercial banking products and services primarily in Taiwan. The company offers Taiwan dollar and foreign exchange deposits. It also provides personal loans, such as consumer, mortgage, reverse mortgage, and student loans, as well as personal overdrafts; and business loans comprising unsecured and secured overdrafts, short-term unsecured and secured loans, bank discounts, discount notes loans, general export financing, procurement loans, general commercial loans, guarantees and acceptances, and SME and emergency financing services. In addition, the company offers foreign exchange services, including import and export business, remittances and deposits, outright forwards, swaps, and margin trade, as well as structured products; offshore banking services; foreign exchange deposits; investment management services, such as offshore bonds services, funds, and life and non-life insurance services; credit cards; electronic banking services; and trust services. It operates approximately 36 branch offices, including one offshore banking unit and two mini-branches. The company was formerly known as City Bank of Kaohsiung Co., Ltd. and changed its name to Bank of Kaohsiung Co., Ltd. in January 1994. Bank of Kaohsiung Co., Ltd. was founded in 1982 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": null,
        "website": "http://www.bok.com.tw",
        "market_cap": null
    },
    "2849.TW": {
        "short_name": "EN TIE COMMERCIAL BANK",
        "long_name": "EnTie Commercial Bank Co., Ltd.",
        "summary": "EnTie Commercial Bank Co., Ltd. provides banking products and services primarily in Taiwan. The company offers accounts and deposits. It also provides loans and overdrafts. In addition, the company offers consumer finance and wealth management products; and engages in the corporate and financial market operations. The company was founded in 1992 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11049",
        "website": "http://www.entiebank.com.tw",
        "market_cap": "Large Cap"
    },
    "2884.TW": {
        "short_name": "E SUN FINANCIAL HOLDINGS",
        "long_name": "E.SUN Financial Holding Company, Ltd.",
        "summary": "E.SUN Financial Holding Company, Ltd., through its subsidiaries, provides various financial products and services in Taiwan and internationally. The company operates through Corporate Banking Unit, Individual Banking Unit, Overseas Branches and Subsidiaries, and Others segments. It offers corporate and unsecured personal loans, and residential mortgages; foreign exchange, financial banking, and wealth management services; and credit cards and payment services. The company also deals in, underwrites, and brokers securities; and futures brokerage, venture capital investment, trust, insurance agency, security consultancy, real estate leasing and management, and remittance services. In addition, it is involved in the retail sale of computer software; and provision of software design, data processing, digital information supply, and business consultancy services. As of December 31, 2019, it operated a business department, an international banking department, a trust department, a credit card and payment division, an offshore banking unit, an insurance agent department, 8 overseas branches, and 138 domestic branches. E.SUN Financial Holding Company, Ltd. was founded in 1992 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10546",
        "website": "http://www.esunfhc.com",
        "market_cap": "Large Cap"
    },
    "2887.TW": {
        "short_name": "TAISHIN FINANCIAL HLDGS CO LTD",
        "long_name": "Taishin Financial Holding Co., Ltd.",
        "summary": "Taishin Financial Holding Co., Ltd., through its subsidiaries, provides various financial products and services in Taiwan and internationally. The company offers wealth management services to individuals, households, and business owners; consumer loans, micro corporate loans, and credit cards to individuals, as well as payment processing services for merchants; digital banking services; wholesale banking services for multinationals, corporations, small and medium sized enterprises, government agencies, and financial institutions; and financial market and trust services. It also provides securities underwriting, brokerage, margin lending, and security transfer services, as well as deals in futures; and property and life insurance brokerage services. In addition, the company engages in the acquisition, evaluation, auction, and management of delinquent loans; audit and consultation of construction plans, contract witness, and assessment and trade of real estate, etc.; lease, wholesale, and retail sale of machinery, precision machinery, motor vehicles, aircrafts, and vessels and components; and financial leasing and investment start-up activities. Further, it accepts mandates from customers, provides analytical opinions or recommendations on securities investment, acts as an agent for investment consultancy of offshore funds, and issues publications or holds lectures about securities investment and other related business. Additionally, the company offers securities investment trust funds; issues beneficial interest certificates; and invests and trades in securities, securities-related products, and other items. Taishin Financial Holding Co., Ltd. was founded in 1992 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "106",
        "website": "http://www.taishinholdings.com.tw",
        "market_cap": "Large Cap"
    },
    "2887E.TW": {
        "short_name": "TAISHIN FINANCIAL HLDGS CO LTD",
        "long_name": "Taishin Financial Holding Co., Ltd.",
        "summary": "Taishin Financial Holding Co., Ltd., through its subsidiaries, provides various financial products and services in Taiwan and internationally. The company offers wealth management services to individuals, households, and business owners; consumer loans, micro corporate loans, and credit cards to individuals, as well as payment processing services for merchants; digital banking services; wholesale banking services for multinationals, corporations, small and medium sized enterprises, government agencies, and financial institutions; and financial market and trust services. It also provides securities underwriting, brokerage, margin lending, and security transfer services, as well as deals in futures; and property and life insurance brokerage services. In addition, the company engages in the acquisition, evaluation, auction, and management of delinquent loans; audit and consultation of construction plans, contract witness, and assessment and trade of real estate, etc.; lease, wholesale, and retail sale of machinery, precision machinery, motor vehicles, aircrafts, and vessels and components; and financial leasing and investment start-up activities. Further, it accepts mandates from customers, provides analytical opinions or recommendations on securities investment, acts as an agent for investment consultancy of offshore funds, and issues publications or holds lectures about securities investment and other related business. Additionally, the company offers securities investment trust funds; issues beneficial interest certificates; and invests and trades in securities, securities-related products, and other items. Taishin Financial Holding Co., Ltd. was founded in 1992 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "106",
        "website": "http://www.taishinholdings.com.tw",
        "market_cap": "Large Cap"
    },
    "2890.TW": {
        "short_name": "SINOPAC FINANCIAL HLDGS CO LTD",
        "long_name": "SinoPac Financial Holdings Company Limited",
        "summary": "SinoPac Financial Holdings Company Limited, through its subsidiaries, provides banking, securities, investment trust, leasing, and venture capital services worldwide. It operates through Banking, Securities, and Other Business segments. The company offers commercial banking services, such as corporate finance, personal finance, wealth management, money and finance products, electronic banking, etc. It also provides broking, proprietary trading, underwriting, international business, fixed income, financial products, etc.; installment sale and purchase, lease, real estate lease, and other financing services; and products and services in the areas of mutual funds, discretionary accounts, and private equity. In addition, the company assists in deal sourcing, business cooperation, establishing strategic partnerships, and creating value in its portfolio companies; and provides factoring, fund management, asset management, insurance brokerage, and corporation management services. It operates 125 branches, including 83 branches in the greater Taipei area, with service locations in major metropolitan areas in the central and south, Hualien, and Kinmen. The company was founded in 1948 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://www.sinopac.com",
        "market_cap": "Large Cap"
    },
    "5863.TWO": {
        "short_name": "BOFT",
        "long_name": "Taipei Star Bank",
        "summary": "Taipei Star Bank provides various banking products and services in Taiwan. The company accepts check deposits, demand deposits, and time deposits; and domestic foreign exchange and commercial bills. It also provides short-term, medium-term, and long-term loans; bill discounts; letters of credit; treasury bills; safe deposit box; and guarantees. In addition, the company also invests in financial, public, short-term, and corporate bonds, as well as stocks; collects and pays against agents; and purchases and sells foreign currencies cash and traveler cheque. Further, it provides warehousing, and storage and agency services. The company was formerly known as Bank of Taipei, Ltd. Taipei Star Bank is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.taipeistarbank.com.tw",
        "market_cap": "Mid Cap"
    },
    "5880.TW": {
        "short_name": "TAIWAN COOPERATIVE FINANCIAL HL",
        "long_name": "Taiwan Cooperative Financial Holding Co., Ltd.",
        "summary": "Taiwan Cooperative Financial Holding Co., Ltd., together with its subsidiaries, provides commercial banking, insurance, securities, bills finance, asset management, and investment trust services in Taiwan. It offers general deposits and loans. The company is also involved in the planning, management, and operation of the trust business; and custodianship of nondiscretionary trust funds in domestic and overseas securities and mutual funds. In addition, it engages in securities brokerage, dealing, and underwriting activities; provision of pecuniary and securities financing facilities for the trading of listed securities; and trading of futures and futures proprietary trading business. Further, the company brokers and deals in short-term bills, government bonds, and bank debentures; underwrites commercial papers; acts as a registrar of commercial papers; provides guarantees on or endorsements of commercial paper and bank acceptance, as well as consulting services on corporate financial matters; brokers call loans between financial institutions; deals in corporate bonds; and offers investment related equity instruments. Additionally, it is involved in the purchase, appraisal, auction, and management of financial institutions' creditors' rights, as well as the purchase of accounts receivable and management of overdue receivables; and life and property insurance brokering business. As of December 31, 2020, the company operated 269 branches in Taiwan, as well as 1 offshore banking unit, 13 overseas branches, 8 overseas sub-branches, and 2 representative offices. Taiwan Cooperative Financial Holding Co., Ltd. was founded in 2011 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "105",
        "website": "http://www.tcfhc.com.tw",
        "market_cap": "Large Cap"
    }
}