{
    "2867.TW": {
        "short_name": "MERCURIES LIFE INSURANCE CO LTD",
        "long_name": "Mercuries Life Insurance Co., Ltd.",
        "summary": "Mercuries Life Insurance Co., Ltd. provides life insurance products primarily in Taiwan. The company also offers term life, health, accident, annuities, group, travel safety, and investment insurance products, as well as pension, group, and bank channel goods insurance products. It operates through six branch offices located in Taipei, Taichung, Chiayi, Tainan, and Kaohsiung. The company was founded in 1993 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.mli.com.tw",
        "market_cap": "Small Cap"
    },
    "2881.TW": {
        "short_name": "FUBON FINANCIAL HLDG CO LTD",
        "long_name": "Fubon Financial Holding Co., Ltd.",
        "summary": "Fubon Financial Holding Co., Ltd. provides various financial services in Taiwan, rest of Asia, the United States, and internationally. It operates through Bank Business, Insurance Business, Life Insurance Business, Securities Business, and Others segments. The company primarily offers insurance products, including property, casualty, life, accident, health, fire, marine cargo, motor, liability, engineering and nuclear, surety and credit, and personal and commercial multiple peril insurance, as well as typhoon, flood, and earthquake insurance products. It also provides retail and consumer, corporate, and investment banking services; brokerage services; margin lending; securities financing and refinancing, trading, underwriting, and transfer services; and investment and financial management, futures, and foreign currency and CNY services, as well as operates insurance agency. In addition, the company offers venture capital, marketing management, creditor's rights management, IT software, asset management, stadium management, and sports services, as well as trust, financial bill, and credit card services; and invests in and manages real estate properties. Fubon Financial Holding Co., Ltd. was founded in 1961 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "106",
        "website": "http://www.fubon.com",
        "market_cap": "Large Cap"
    },
    "2881A.TW": {
        "short_name": "FUBON FINANCIAL HLDG CO LTD",
        "long_name": "Fubon Financial Holding Co., Ltd.",
        "summary": "Fubon Financial Holding Co., Ltd. provides various financial services in Taiwan, rest of Asia, the United States, and internationally. It operates through Bank Business, Insurance Business, Life Insurance Business, Securities Business, and Others segments. The company primarily offers insurance products, including property, casualty, life, accident, health, fire, marine cargo, motor, liability, engineering and nuclear, surety and credit, and personal and commercial multiple peril insurance, as well as typhoon, flood, and earthquake insurance products. It also provides retail and consumer, corporate, and investment banking services; brokerage services; margin lending; securities financing and refinancing, trading, underwriting, and transfer services; and investment and financial management, futures, and foreign currency and CNY services, as well as operates insurance agency. In addition, the company offers venture capital, marketing management, creditor's rights management, IT software, asset management, stadium management, and sports services, as well as trust, financial bill, and credit card services; and invests in and manages real estate properties. Fubon Financial Holding Co., Ltd. was founded in 1961 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "106",
        "website": "http://www.fubon.com",
        "market_cap": "Large Cap"
    },
    "2882.TW": {
        "short_name": "CATHAY FINANCIAL HLDG CO",
        "long_name": "Cathay Financial Holding Co., Ltd.",
        "summary": "Cathay Financial Holding Co., Ltd., through its subsidiaries, provides various financial services in Taiwan. The company operates through five segments: Banking, Life Insurance, Property Insurance, Securities, and Other. It provides foreign exchange and guarantee, foreign currency investment advisory, trust, offshore banking, and other financial services. The company also offers traditional, investment-linked, and annuity insurance products; fire insurance, marine insurance, land and air insurance, liability insurance, financial guarantee insurance, reinsurance, and other insurance products; and financial planning services and policy loan services. In addition, it provides securities brokerage, discretionary and underwriting, and security financial services, as well as other financial products. Further, the company also provides real estate investment and management, wealth management, venture capital, asset management, fund management, banking, futures, risk management software, and securities investment consulting services. Cathay Financial Holding Co., Ltd. was founded in 2001 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "106",
        "website": "http://www.cathayholdings.com",
        "market_cap": "Large Cap"
    },
    "2891.TW": {
        "short_name": "CTBC FINANCIAL HOLDINGS COMPANY",
        "long_name": "CTBC Financial Holding Co., Ltd.",
        "summary": "CTBC Financial Holding Co., Ltd. engages in the banking, bills financing, credit card, trust, securities, futures, asset management, and other financial related business investment activities. The company offers loans, guarantees, foreign exchange, bonds, proprietary trading, safe deposit boxes, derivatives, factoring, online banking, and lottery services; installment, leasing, and account receivable services; and transaction financing, cash management, fiduciary and agent, international trade financing, syndication lending, structured finance, and financial advisory services. It also provides life, health, annuity, group, and investment insurance products; and property insurance products, including fire, marine, miscellaneous casualty, voluntary auto, and personal accident insurances. In addition, the company offers securities and futures related services, as well as publicly-traded securities and investment opportunities in emerging stocks and futures trading; and asset-backed security services. Further, it is involved in the venture capital business investing in information technology, communications, biotechnology, health care, cultural, creative, and alternative energy industries, as well as companies in traditional industries; debt and mortgage management business; and overseas, international, and payment business. Additionally, the company provides securities investment trust, consulting, foreign financial institutions, discretionary investment, and offshore fund master agent services, as well as security services to corporate entities. It operates approximately 152 branches in Taiwan; and 116 overseas branches in the United States, Japan, Canada, the Philippines, Indonesia, Vietnam, India, and Singapore. The company was formerly known as ChinaTrust Financial Holding Co., Ltd. and changed its name to CTBC Financial Holding Co., Ltd. in June 2013. CTBC Financial Holding Co., Ltd. was founded in 2002 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "115",
        "website": "http://www.ctbcholding.com",
        "market_cap": "Large Cap"
    },
    "2891C.TW": {
        "short_name": "CTBC FINANCIAL HOLDINGS COMPANY",
        "long_name": "CTBC Financial Holding Co., Ltd.",
        "summary": "CTBC Financial Holding Co., Ltd. engages in the banking, bills financing, credit card, trust, securities, futures, asset management, and other financial related business investment activities. The company offers loans, guarantees, foreign exchange, bonds, proprietary trading, safe deposit boxes, derivatives, factoring, online banking, and lottery services; installment, leasing, and account receivable services; and transaction financing, cash management, fiduciary and agent, international trade financing, syndication lending, structured finance, and financial advisory services. It also provides life, health, annuity, group, and investment insurance products; and property insurance products, including fire, marine, miscellaneous casualty, voluntary auto, and personal accident insurances. In addition, the company offers securities and futures related services, as well as publicly-traded securities and investment opportunities in emerging stocks and futures trading; and asset-backed security services. Further, it is involved in the venture capital business investing in information technology, communications, biotechnology, health care, cultural, creative, and alternative energy industries, as well as companies in traditional industries; debt and mortgage management business; and overseas, international, and payment business. Additionally, the company provides securities investment trust, consulting, foreign financial institutions, discretionary investment, and offshore fund master agent services, as well as security services to corporate entities. It operates approximately 152 branches in Taiwan; and 116 overseas branches in the United States, Japan, Canada, the Philippines, Indonesia, Vietnam, India, and Singapore. The company was formerly known as ChinaTrust Financial Holding Co., Ltd. and changed its name to CTBC Financial Holding Co., Ltd. in June 2013. CTBC Financial Holding Co., Ltd. was founded in 2002 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "115",
        "website": "http://www.ctbcholding.com",
        "market_cap": "Large Cap"
    },
    "2905.TW": {
        "short_name": "MERCURIES & ASSOCIATES HOLDING ",
        "long_name": "Mercuries & Associates Holding, Ltd.",
        "summary": "Mercuries & Associates Holding, Ltd., an investment holding company, engages in the life insurance, daily commodities and food retail, pharmaceuticals, and information services businesses. The company offers lifetime and whole life insurance; hospitalization and medical care, cancer, and whole life medical and healthcare insurance; personal accident, travel, and online accident insurance; immediate and deferred annuity insurance, and pension insurance with floating interest rates; variable annuity and variable life insurance; 1 year term group life and group health insurance; group accident insurance; and long-term care lifetime, and disability care lifetime health insurance, as well as insurance in foreign currencies. It also purchases and sells daily commodities and food, alcohols, beverages, tobacco, daily necessities, cooked food, fresh foods, medical supplies, infant products, cosmetics, and beauty products; and branded footwear, apparel, and accessories, as well as serves fast food, including noodles, rice, fried pork chops, Japanese bento sets, and pizzas. In addition, the company engages in the sale and decoration of furniture, cabinets, kitchen utensils, and mattresses. Further, it manufactures active pharmaceutical ingredients (API), such as valporic acid and allopurinol; API intermediates comprising diethyl dipropyl malonate and PENT-2 ethyl 2-allyl-2-cyano-3-methylhexanoate; and specialty chemicals that include diethyl ketone. Additionally, the company offers software and hardware planning, development, and establishment services for financial information systems and public utilities; and software and hardware maintenance services. The company was formerly known as Mercuries & Associates, Ltd. and changed its name to Mercuries & Associates Holding, Ltd. in January 2015. Mercuries & Associates Holding, Ltd. was founded in 1965 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.mercuries.com.tw",
        "market_cap": "Small Cap"
    },
    "5859.TWO": {
        "short_name": "FGLIFE",
        "long_name": "Farglory Life Insurance Co., Ltd.",
        "summary": "Farglory Life Insurance Co., Ltd. provides insurance products and services in Taiwan. It offers life, health, injury, travel, savings, and annuity insurance products, as well as investment products. The company was founded in 1993 and is headquartered in Taipei, Taiwan. Farglory Life Insurance Co., Ltd. is a subsidiary of Farglory Group.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.fglife.com.tw",
        "market_cap": "Small Cap"
    }
}