{
    "5878.TWO": {
        "short_name": "TAIMING ASSURANCE BROKER CO LTD",
        "long_name": "Taiming Assurance Broker Co.,Ltd.",
        "summary": "Taiming Assurance Broker Co., Ltd. engages in the life and property insurance brokerage business in Taiwan. It offers personal life, injury, health, annuity, group, and investment insurance products. The company also provides fire, automobile, liability, and other property insurance. Taiming Assurance Broker Co., Ltd. was founded in 2002 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Insurance Brokers",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.tabc.com.tw",
        "market_cap": "Nano Cap"
    },
    "CUII": {
        "short_name": "CHINA UNITED INSURANCE SERVICE ",
        "long_name": "China United Insurance Service, Inc.",
        "summary": "China United Insurance Service, Inc., through its subsidiaries, provides brokerage and related services related to life insurance, and property and casualty insurance products in the People's Republic of China. The company offers life insurance products, including individual whole life, individual term life, individual health, accidental injury, investment-oriented, foreign currency insurance commodities, travel accident, individual endowment life, and individual annuity insurance. It also provides property and casualty insurance products, such as automobile, casualty, liability, and commercial property insurance. The company markets and sells life, and property and casualty insurance products directly to customers through the sales professionals, who are independent contractors. China United Insurance Service, Inc. was incorporated in 2010 and is headquartered in Taipei City, Taiwan.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance Brokers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10595",
        "website": "http://www.holdingscuis.com/cuis_en/",
        "market_cap": "Micro Cap"
    }
}