{
    "6022.T": {
        "short_name": "AKASAKA DIESELS",
        "long_name": "Akasaka Diesels Limited",
        "summary": "Akasaka Diesels Limited manufactures and sells ship diesel engines, and various machinery and equipment in Japan and internationally. The company's product portfolio comprises 4 stroke and 2 stroke diesel engines, remote controllers, engine monitoring devices, customer support systems, vibration and noise control engineering products, and DCB flexible couplings. It is involved in the manufacture, sale, and repair of primary and onboard support engines for ordinary cargo and passenger ships, and fishing boats, as well as diesel engines for power and electricity generation. The company also designs, manufactures, sells, and leases ship equipment and ocean observation equipment; industrial, civil engineering, and building machinery; and transportation and shipping equipment. In addition, it engages in the design, manufacture, installation, and sale of pollution prevention equipment; design, manufacture, and sale of measurement devices and astronomical observation equipment for use in satellites; and manufacture and sale of forged goods, including ordinary and ductile cast iron, and forged steel products. Further, the company manages and leases goods, as well as real estate properties. Akasaka Diesels Limited was founded in 1910 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0006",
        "website": "http://www.akasaka-diesel.jp",
        "market_cap": "Nano Cap"
    },
    "7014.T": {
        "short_name": "NAMURA SHIPBUILDING CO",
        "long_name": "Namura Shipbuilding Co., Ltd.",
        "summary": "Namura Shipbuilding Co., Ltd. engages in shipbuilding business worldwide. The company builds crude oil carriers, tankers, product carriers, bulk carriers, ore carriers, LPG carriers, etc., as well as provides ship repair services. It is also involved in the design, production, and installation of bridges and steel structures. Namura Shipbuilding Co., Ltd. was founded in 1911 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "550-0012",
        "website": "http://www.namura.co.jp",
        "market_cap": "Micro Cap"
    },
    "7018.T": {
        "short_name": "NAIKAI ZOSEN CORP",
        "long_name": "Naikai Zosen Corporation",
        "summary": "Naikai Zosen Corporation engages in shipbuilding business in Japan. The company constructs ferries for trasnport, container ships, product tankers, bulk carriers, general cargo ships, car carriers, refrigerated carriers, ro-ro ships, survey ships, research vessels, investigation and control ships, LPG/LNG tankers, chemical tankers, etc. It is also involved in the repair and remodeling of ships and governmental vessels. Naikai Zosen Corporation was founded in 1940 and is headquartered in Onomichi, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Onomichi",
        "zipcode": "722-2413",
        "website": "http://www.naikaizosen.co.jp",
        "market_cap": "Nano Cap"
    },
    "7022.T": {
        "short_name": "SANOYAS HOLDINGS CORPORATION",
        "long_name": "Sanoyas Holdings Corporation",
        "summary": "Sanoyas Holdings Corporation engages in the shipbuilding and engineering, and machinery and technology businesses in Japan and internationally. It offers tank facilities, steel structures, car parking systems and devices, construction project elevators and construction cranes, passenger and freight elevators, lifts, service gondolas, customized cranes and chain blocks, devices, and facilities. The company also provides industrial machinery, precision, agricultural, automotive, and construction machinery parts; press mold components; architectural hardware; and others, as well as generates solar power. In addition, it offers emulsion devices and mixers for cosmetic and pharmaceutical products; plant wastewater treatment and air conditioning systems; water supply/wastewater and sanitation facilities; waste pretreatment machinery and devices; human waste treatment and public sewage facilities, etc.; medical waste treatment equipment and devices; and shot blast machines. Further, the company wholesales grinding materials; operates and manages amusement parks, game arcades, other leisure facilities, hotels, and restaurants; provides corporate employee welfare facilities; develops and sells computer software packages; offers information processing and services; and manufactures, sells, leases, and maintains computer terminals. Additionally, it trades in steel, nonferrous metals, and steel structures; offers security patrol, cleaning, and various device repair and maintenance services; manufactures, rents, and manages amusement park equipment and facilities; manages, rents, trades in, and brokers real estate properties; and dismantles, reconstructs, remodels, and moves buildings and structures. The company was founded in 1911 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-6109",
        "website": "http://www.sanoyas.co.jp",
        "market_cap": "Nano Cap"
    },
    "7408.T": {
        "short_name": "JAMCO CORPORATION",
        "long_name": "JAMCO Corporation",
        "summary": "JAMCO Corporation operates in the aircraft industry in Japan. It offers aircraft interior products, including galleys and bar counters; lavatories comprising touch-less faucets, counters, mirrors and lights, bidet systems, and touch-less flush switches; galley inserts consisting of steam ovens; and flight deck linings, consoles, and stowages, as well as seats and seat consoles. The company also provides aircraft components, which includes heat exchangers and chassis for electronic equipment; aircraft engine parts, such as cooling manifolds, engine pipes, turbine shrouds, and outer transition liner products; and stringers and stiffeners for vertical tails. In addition, it offers aircraft maintenance, including small-sized aircraft and helicopters and regional aircraft; and aircraft accessories, such as avionics, system components, rescue hoists, manufacturing and maintenance of testing equipment, wheels and brakes, propellers, emergency evacuation slides, and cabin and atmospheric observation equipment. The company was formerly known as New Japan Aircraft Maintenance Co., Ltd. and changed its name to JAMCO Corporation in June 1988. JAMCO Corporation was founded in 1949 and is headquartered in Tachikawa, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tachikawa",
        "zipcode": "190-0011",
        "website": "http://www.jamco.co.jp",
        "market_cap": "Micro Cap"
    },
    "8AF.F": {
        "short_name": "NAMURA SHIPBLDG LTD",
        "long_name": "Namura Shipbuilding Co., Ltd.",
        "summary": "Namura Shipbuilding Co., Ltd. engages in shipbuilding business worldwide. The company builds crude oil carriers, tankers, product carriers, bulk carriers, ore carriers, LPG carriers, etc., as well as provides ship repair services. It is also involved in the design, production, and installation of bridges and steel structures. Namura Shipbuilding Co., Ltd. was founded in 1911 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "550-0012",
        "website": "http://www.namura.co.jp",
        "market_cap": "Micro Cap"
    },
    "MIESF": {
        "short_name": "MITSUI E&S HOLDINGS CO LTD",
        "long_name": "Mitsui E&S Holdings Co., Ltd.",
        "summary": "Mitsui E&S Holdings Co., Ltd. engages in shipbuilding and engineering businesses worldwide. The company operates through Ship, Ocean Development, Machinery, Engineering, and Others segments. The Ship segment builds bulk carriers, oil tankers, LNG carriers, research vessel/training vessels, fishery patrol vessels, high-speed vessels, naval ships/patrol ships, and submersibles. The Ocean Development segment provides floating production storage offloading systems. The Machinery segment offers marine diesel engines, gas turbines and gas engine co-generation systems, process compressors, top pressure recovery turbine generating systems, reactors/heat exchangers, rotary dryers/coal moistures controllers, portainers, transtainers, container terminal management systems, etc. The Engineering segment operates biomass and biogas power plants; wind power facility; power plant engineering and construction business; an environmental facility; and diesel engine generating, petro-chemical, and inorganic chemical plants. The Others segment engages in the real estate development and system development businesses. The company was formerly known as Mitsui Engineering & Shipbuilding Co., Ltd. Mitsui E&S Holdings Co., Ltd. was founded in 1917 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8439",
        "website": "http://www.mes.co.jp",
        "market_cap": "Small Cap"
    },
    "MU1.F": {
        "short_name": "MITSUI E+S HLDGS CO. LTD.",
        "long_name": "Mitsui E&S Holdings Co., Ltd.",
        "summary": "Mitsui E&S Holdings Co., Ltd. engages in shipbuilding and engineering businesses worldwide. The company operates through Ship, Ocean Development, Machinery, Engineering, and Others segments. The Ship segment builds bulk carriers, oil tankers, LNG carriers, research vessel/training vessels, fishery patrol vessels, high-speed vessels, naval ships/patrol ships, and submersibles. The Ocean Development segment provides floating production storage offloading systems. The Machinery segment offers marine diesel engines, gas turbines and gas engine co-generation systems, process compressors, top pressure recovery turbine generating systems, reactors/heat exchangers, rotary dryers/coal moistures controllers, portainers, transtainers, container terminal management systems, etc. The Engineering segment operates biomass and biogas power plants; wind power facility; power plant engineering and construction business; an environmental facility; and diesel engine generating, petro-chemical, and inorganic chemical plants. The Others segment engages in the real estate development and system development businesses. The company was formerly known as Mitsui Engineering & Shipbuilding Co., Ltd. Mitsui E&S Holdings Co., Ltd. was founded in 1917 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8439",
        "website": "http://www.mes.co.jp",
        "market_cap": "Small Cap"
    }
}