{
    "2337.T": {
        "short_name": "ICHIGO INC",
        "long_name": "Ichigo Inc.",
        "summary": "Ichigo Inc. owns and operates real estate properties in Japan. The company manages J-REIT and private equity real estate funds; and develops small-and mid-size assets and ground leases. It also acquires, manages, leases, and sells real estate properties; and manages wholesale market properties and shopping mall properties. In addition, the company produces and supplies clean energy; and provides engineering, consulting, and technical solutions. Further, it is involved in the building and operation of solar power plants; and operating self-storage facilities. Additionally, the company, through its subsidiary, Ichigo Animation, is involved in the planning, editing, developing, streaming, distributing, and import/export of printed and digital content; planning, developing, creating, streaming, and domestic and overseas distribution of films and content for streaming, TV, and other media; planning, developing, and distribution of scripts; planning, manufacturing, sale, and import/export of character-themed products, toys, household products, apparel, accessories, stationary, household electronics, shoes, and bags. As of February 12, 2020, it operated 45 solar power plants. The company was formerly known as Ichigo Group Holdings Co., Ltd. and changed its name to Ichigo Inc. in August 2015. Ichigo Inc. was founded in 2000 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0011",
        "website": "http://www.ichigo.gr.jp",
        "full_time_employees": null
    },
    "3121.T": {
        "short_name": "MBK CO LTD (JAPAN)",
        "long_name": "MBK Co.,Ltd.",
        "summary": "MBK Co.,Ltd. engages in the merchant banking, hotel, and sports fitness businesses in Japan and China. Its activities include equity investment and debt finance for corporate and real estate; fund management and advisory; intermediate the transaction of corporate equity and real estate; operating management of hotels and sport facilities; and property management of hotels and sport facilities. The company was formerly known as Asset Investors Co., Ltd. and changed its name to MBK Co.,Ltd. in July 2009. MBK Co.,Ltd. was founded in 1946 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0006",
        "website": "http://www.mbkworld.co.jp",
        "full_time_employees": 50
    },
    "3266.T": {
        "short_name": "FUND CREATION GROUP CO LTD",
        "long_name": "Fund Creation Group Company Limited",
        "summary": "Fund Creation Group Company Limited provides asset management services and investment banking services in real estate and securities market in Japan. It offers fund creation and management services; and invests in the fields of real estate properties, as well as in the listed and unlisted companies. The company also provides brokerage services of the financial products. Fund Creation Group Company Limited was founded in 2002 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0083",
        "website": "http://www.fc-group.co.jp",
        "full_time_employees": 26
    },
    "4310.T": {
        "short_name": "DREAM INCUBATOR INC",
        "long_name": "Dream Incubator Inc.",
        "summary": "Dream Incubator Inc. is a venture capital and private equity firm specializing in incubation and investments in all business stages. It seeks to invest in Japan and Vietnam including other part of Asia. The firm offers assistance in formulating capital policies and business plans to venture companies, as well as provides support required to meet the needs of companies in hi-tech and IT fields. Dream Incubator Inc. was founded in 2000 and is based in Tokyo, Japan, with additional offices in China, Singapore and Vietnam.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0013",
        "website": "http://www.dreamincubator.co.jp",
        "full_time_employees": 591
    },
    "4479.T": {
        "short_name": "MAKUAKE INC",
        "long_name": "Makuake, Inc.",
        "summary": "Makuake, Inc. operates the Makuake crowdfunding platform in Japan. It provides support services for new business development and human resource development; displays and sells products; and operates a shopping site that sells developed products to the general public. The company was founded in 2013 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0002",
        "website": "http://www.makuake.co.jp",
        "full_time_employees": 92
    },
    "6620.T": {
        "short_name": "MIYAKOSHI HOLDINGS INC",
        "long_name": "Miyakoshi Holdings, Inc.",
        "summary": "Miyakoshi Holdings, Inc., through its subsidiaries, engages in promoting Shenzhen municipal integrated development activities. It also plans and promotes for the development of environment and energy conservation projects; and invests in projects located in Japan, China, and other Asian countries. Miyakoshi Holdings, Inc. was founded in 1966 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "143-0016",
        "website": "http://www.miyakoshi-holdings.com",
        "full_time_employees": null
    },
    "7162.T": {
        "short_name": "ASTMAX CO LTD",
        "long_name": "ASTMAX Co., Ltd.",
        "summary": "ASTMAX Co., Ltd. engages in asset management business for managing the assets of individual and institutional investors in Japan. It is also involved in the solar and geothermal power generation activities; electricity trading, including procurement and supply of electricity; and provision of management systems to retail electric utilities. ASTMAX Co., Ltd. was founded in 1992 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.astmax.com",
        "full_time_employees": 48
    },
    "7190.T": {
        "short_name": "MERCURIA INVESTMENT CO LTD",
        "long_name": "Mercuria Investment Co., Ltd.",
        "summary": "Mercuria Investment Co., Ltd. is a private equity firm specializing in growth investments, buyout, succession investment, and value investment strategy. It also invests in real estate. The firm seeks to invest in Japan and China as well as the United States and other parts of Asia. It prefers to invests a minority stake. Mercuria Investment Co., Ltd., previously known as AD Capital Co., Ltd., was founded in 2005 and is based in Tokyo, Japan with additional office in Beijing, China.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0011",
        "website": "http://www.mercuria.jp",
        "full_time_employees": 61
    },
    "7342.T": {
        "short_name": "WEALTHNAVI INC",
        "long_name": "WealthNavi Inc.",
        "summary": "WealthNavi Inc. develops and delivers an online asset management and risk management platform. Its cloud-based platform provides robo advisory services that enable users to locate diversified investments internationally. The company was founded in 2015 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0002",
        "website": "http://www.wealthnavi.com",
        "full_time_employees": null
    },
    "8595.T": {
        "short_name": "JAFCO GROUP CO LTD",
        "long_name": "JAFCO Group Co., Ltd.",
        "summary": "JAFCO Group Co., Ltd. formerly known as JAFCO Co., Ltd. is a private equity and venture capital firm specializing in direct and fund of fund investments. Within direct investments, it invests in incubation, seed, startup, early stage, middle stage, late stage, buyout, business succession, and spin-out related investments. It seeks to invests in many fields such as life science, new drug development, regenerative medicine, medical equipment and healthcare, robotics, electronics, software, IT services, manufacturing, logistics, retail, restaurants, housing, and finance among others. The firm invests in the United States of America, Japan, and Europe. JAFCO Group Co., Ltd. was founded on April 5, 1973 and is based in Tokyo, Japan with additional offices in Nagoya, Japan; Osaka, Japan; and Fukuoka, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-6324",
        "website": "http://www.jafco.co.jp",
        "full_time_employees": null
    },
    "8616.T": {
        "short_name": "TOKAI TOKYO FINANCIAL HLDG INC",
        "long_name": "Tokai Tokyo Financial Holdings, Inc.",
        "summary": "Tokai Tokyo Financial Holdings, Inc. operates as a securities company in Japan. The company provides foreign equities, foreign bonds, structured bonds, mutual funds, and derivatives; investment trust services; and investment banking services, such as IPOs, public stock offerings, and M&As. Its activities also include financial instruments business; research on economic conditions and corporate performance; creation and management of funds, and self-financed investments; consulting on handling of testamentary trusts and inheritance property; asset management; fund investment; education and training; provision of transfer agency, merchandising, printing, real-estate rental management, and insurance agency services; and back-office operations. In addition, the company offers M&A, and cross-border advisory services; and investment management, advisory, and agency services. The company was formerly known as Tokai Tokyo Securities Co., Ltd. and changed its name to Tokai Tokyo Financial Holdings, Inc. in April 2009. Tokai Tokyo Financial Holdings, Inc. was incorporated in 1929 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-6130",
        "website": "http://www.tokaitokyo-fh.jp",
        "full_time_employees": null
    },
    "8624.T": {
        "short_name": "ICHIYOSHI SECURITIES",
        "long_name": "Ichiyoshi Securities Co., Ltd.",
        "summary": "Ichiyoshi Securities Co., Ltd. operates in the securities industry in Japan. The company conducts research and gathers information on stocks of small- and medium-sized growth companies. It also provides discretionary investment and advisory services for institutional investors and trusts. In addition, the company is involved in the real estate renting, broking, and management services; sale of office supplies and goods; and insurance agency activities. Ichiyoshi Securities Co., Ltd. was founded in 1944 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0025",
        "website": "http://www.ichiyoshi.co.jp",
        "full_time_employees": 988
    },
    "8737.T": {
        "short_name": "AKATSUKI CORP",
        "long_name": "Akatsuki Corp.",
        "summary": "Akatsuki Corp. operates in the real estate and securities businesses in Japan. It plans, designs, constructs, and regenerates used real estate properties, as well as sells renovated apartments. The company also provides investment advice to real estate properties; and trunk room rental services. In addition, it offers securities services; gold trading platform services to online securities companies; and algorithms for Japanese stocks, as well as advisory services to investment trust companies. The company was formerly known as Akatsuki Financial Group, Inc. and changed its name to Akatsuki Corp. in July 2016. Akatsuki Corp. was founded in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.akatsuki-fg.com",
        "full_time_employees": null
    },
    "8739.T": {
        "short_name": "SPARX GROUP CO.LTD",
        "long_name": "SPARX Group Co., Ltd.",
        "summary": "SPARX Group Co., Ltd. is a publicly owned asset management holding company. Through its subsidiaries, the firm offers asset management and investment advisory services. It invests in real estate. The firm primarily provides its services to corporate pension annuities, government entities, private and trust banks, and public pension funds. SPARX Group Co., Ltd. was founded on July 1, 1989 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0075",
        "website": "http://www.sparxgroup.com",
        "full_time_employees": null
    },
    "8783.T": {
        "short_name": "GFA CO LIMITED",
        "long_name": "GFA Co., Ltd.",
        "summary": "GFA Co., Ltd. provides various financial services in Japan. It offers financial advisory services, including financial arrangement; mergers and acquisitions (M&A) services in the areas of acquisitions, sales, mergers, joint ventures, strategic capital, business alliances, etc. for domestic and overseas companies; and real estate liquidation and securitization services. The company also raises working capital for various needs, as well as for real estate purchases. In addition, it engages in rental, real estate trading and brokerage, and real estate mortgage activities. Further, the company invests in the IT field, including block chain technology, ICO, mining business, and AI fields. The company was formerly known as Ground Financial Advisory Co., Ltd. and changed its name to GFA Co., Ltd. in July 2012. GFA Co., Ltd. was founded in 2002 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0062",
        "website": "http://www.gfa.co.jp",
        "full_time_employees": null
    },
    "8KF.F": {
        "short_name": "ICHIYOSHI SECS CO. LTD.",
        "long_name": "Ichiyoshi Securities Co., Ltd.",
        "summary": "Ichiyoshi Securities Co., Ltd. operates in the securities industry in Japan. The company conducts research and gathers information on stocks of small- and medium-sized growth companies. It also provides discretionary investment and advisory services for institutional investors and trusts. In addition, the company is involved in the real estate renting, broking, and management services; sale of office supplies and goods; and insurance agency activities. Ichiyoshi Securities Co., Ltd. was founded in 1944 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0025",
        "website": "http://www.ichiyoshi.co.jp",
        "full_time_employees": null
    },
    "JAF.F": {
        "short_name": "JAFCO GROUP CO. LTD.",
        "long_name": "JAFCO Group Co., Ltd.",
        "summary": "JAFCO Group Co., Ltd. formerly known as JAFCO Co., Ltd. is a private equity and venture capital firm specializing in direct and fund of fund investments. Within direct investments, it invests in incubation, seed, startup, early stage, middle stage, late stage, buyout, business succession, and spin-out related investments. It seeks to invests in many fields such as life science, new drug development, regenerative medicine, medical equipment and healthcare, robotics, electronics, software, IT services, manufacturing, logistics, retail, restaurants, housing, and finance among others. The firm invests in the United States of America, Japan, and Europe. JAFCO Group Co., Ltd. was founded on April 5, 1973 and is based in Tokyo, Japan with additional offices in Nagoya, Japan; Osaka, Japan; and Fukuoka, Japan.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-6324",
        "website": "http://www.jafco.co.jp",
        "full_time_employees": null
    },
    "JAN.F": {
        "short_name": "JAPAN ASIA INV.",
        "long_name": "Japan Asia Investment Co., Ltd.",
        "summary": "Japan Asia Investment Co., Ltd. is a private equity and venture capital company specializing in unlisted growth-oriented companies, medium-sized firms grappling with ownership succession issues, incubation, buyout, M&A, and corporations seeking to revitalize their businesses through restructuring. The firm seeks to invest in green technology or web related technology, environment, energy technologies, medical treatment, nursing care, health care, manufacturing, lifestyle business, digital contents and natural resource-related companies. It also offers financial, managerial support, and consulting services in the areas of initial public offerings, management buyouts, and mergers and acquisitions to these companies to grow and raise their corporate value. The firm focuses on investments across Asia. It also offers management of funds and financing services. Japan Asia Investment Co., Ltd. was founded in July 1981 and is based in Tokyo, Japan with an additional offices across Asia and United States.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0073",
        "website": "http://www.jaic-vc.co.jp",
        "full_time_employees": null
    },
    "JOF": {
        "short_name": "Japan Smaller Capitalization Fu",
        "long_name": "Japan Smaller Capitalization Fund, Inc.",
        "summary": "Japan Smaller Capitalization Fund, Inc. is a closed-ended equity mutual fund launched by Nomura Asset Management U.S.A. Inc. It is managed by Nomura Asset Management Co., Ltd. The fund invests in the public equity markets of Japan. It invests in stocks traded on the Tokyo, Osaka and Nagoya Stock Exchanges, JASDAQ, Mothers, Hercules, Centrex, and other indices. The fund seeks to invest in stocks of companies operating across diversified sectors. It primarily invests in stocks of small cap companies. The fund benchmarks the performance of its portfolio against the The Russell/Nomura Small Cap Index. It was formerly known as Japan OTC Equity Fund, Inc. Japan Smaller Capitalization Fund, Inc. was formed on March 22, 1990 and is domiciled in the United States.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "135-0061",
        "website": "http://funds.nomura-asset.com/japan-smaller-capitalization/",
        "full_time_employees": null
    },
    "SBHGF": {
        "short_name": "SBI HOLDINGS INC",
        "long_name": "SBI Holdings, Inc.",
        "summary": "SBI Holdings, Inc. engages in the online financial service businesses and investment activities in Japan and internationally. It operates through Financial Services Business, Asset Management Business, and Biotechnology-Related Business segments. The Financial Services Business segment offers financial products and services, including brokerage and investment banking; Internet banking; auto, cancer, fire, and earthquake, as well as life insurance; short term insurance; FX brokerage; exchange and transaction services related to crypto-assets; management of defined-contribution pension, etc.; leasing and lending services; operation of proprietary trading system; control and operation of the e-commerce settlement business; and remittance and back office support services. The Asset Management Business segment provides private equity, venture capital fund management, M&A advisory, savings bank, online securities, commercial banking, investment advisory and management, fintech support, and rating information services; real estate secured loans; and rent guarantees for rental housing, as well as generates power using renewable energy. The Biotechnology-Related Business segment develops and distributes pharmaceutical products, health foods, and cosmetics; and researches and develops antibody drugs and nucleic acid medicines in the field of cancer and immunology. The company also offers investment advisory services on crypto-asset funds; operates a fund-raising platform; acquires securities; operates as a crypto-asset broker; develops, manufactures, and sells crypto-asset mining systems; operates and develops cybersecurity systems; provides blockchain platform; invests in real estate properties; and offers healthcare services, as well as engages in the mining of digital assets. The company was formerly known as Softbank Investment Corporation and changed its name to SBI Holdings, Inc. in July 2005. SBI Holdings, Inc. was founded in 1999 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "106-6019",
        "website": "http://www.sbigroup.co.jp",
        "full_time_employees": null
    },
    "TOKTY": {
        "short_name": "TOKAI TOKYO FINANCIAL HLDG INC",
        "long_name": "Tokai Tokyo Financial Holdings, Inc.",
        "summary": "Tokai Tokyo Financial Holdings, Inc. operates as a securities company in Japan. The company provides foreign equities, foreign bonds, structured bonds, mutual funds, and derivatives; investment trust services; and investment banking services, such as IPOs, public stock offerings, and M&As. Its activities also include financial instruments business; research on economic conditions and corporate performance; creation and management of funds, and self-financed investments; consulting on handling of testamentary trusts and inheritance property; asset management; fund investment; education and training; provision of transfer agency, merchandising, printing, real-estate rental management, and insurance agency services; and back-office operations. In addition, the company offers M&A, and cross-border advisory services; and investment management, advisory, and agency services. The company was formerly known as Tokai Tokyo Securities Co., Ltd. and changed its name to Tokai Tokyo Financial Holdings, Inc. in April 2009. Tokai Tokyo Financial Holdings, Inc. was incorporated in 1929 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-6130",
        "website": "http://www.tokaitokyo-fh.jp",
        "full_time_employees": null
    },
    "ZOF.F": {
        "short_name": "SBI HOLDINGS INC.",
        "long_name": "SBI Holdings, Inc.",
        "summary": "SBI Holdings, Inc. engages in the online financial service businesses and investment activities in Japan and internationally. It operates through Financial Services Business, Asset Management Business, and Biotechnology-Related Business segments. The Financial Services Business segment offers financial products and services, including brokerage and investment banking; Internet banking; auto, cancer, fire, and earthquake, as well as life insurance; short term insurance; FX brokerage; exchange and transaction services related to crypto-assets; management of defined-contribution pension, etc.; leasing and lending services; operation of proprietary trading system; control and operation of the e-commerce settlement business; and remittance and back office support services. The Asset Management Business segment provides private equity, venture capital fund management, M&A advisory, savings bank, online securities, commercial banking, investment advisory and management, fintech support, and rating information services; real estate secured loans; and rent guarantees for rental housing, as well as generates power using renewable energy. The Biotechnology-Related Business segment develops and distributes pharmaceutical products, health foods, and cosmetics; and researches and develops antibody drugs and nucleic acid medicines in the field of cancer and immunology. The company also offers investment advisory services on crypto-asset funds; operates a fund-raising platform; acquires securities; operates as a crypto-asset broker; develops, manufactures, and sells crypto-asset mining systems; operates and develops cybersecurity systems; provides blockchain platform; invests in real estate properties; and offers healthcare services, as well as engages in the mining of digital assets. The company was formerly known as Softbank Investment Corporation and changed its name to SBI Holdings, Inc. in July 2005. SBI Holdings, Inc. was founded in 1999 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "106-6019",
        "website": "http://www.sbigroup.co.jp",
        "full_time_employees": null
    }
}