{
    "4FK.F": {
        "short_name": "FUKUOKA FINL GROUP",
        "long_name": "Fukuoka Financial Group, Inc.",
        "summary": "Fukuoka Financial Group, Inc., through its subsidiaries, provides banking services. The company accepts various deposits, such as current deposits, ordinary and other demand deposits, time deposits, and negotiable certificates of deposit, as well as provides loan products. It is also involved in securities, office work agent, loan guarantee, system development and operation, credit card, collateral valuation, credit management and collection, consulting, insurance, research and development, investments, and factoring businesses. In addition, the company engages in the movable property and lease of right business; and provision of information processing and communications services. Fukuoka Financial Group, Inc. was founded in 1877 and is headquartered in Fukuoka, Japan.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuoka",
        "zipcode": "810-8693",
        "website": "http://www.fukuoka-fg.com",
        "market_cap": "Mid Cap"
    },
    "5EE.F": {
        "short_name": "MEBUKI FINANCIAL GROUP",
        "long_name": "Mebuki Financial Group, Inc.",
        "summary": "Mebuki Financial Group, Inc. provides banking and financial services in Japan and internationally. The company accepts various deposits; and provides funds to corporate customers and individuals, including housing loans. It also engages in call money transactions in the short-term markets; and invests in securities primarily comprising bonds, as well as money markets. In addition, the company offers leasing, securities, and credit card services; and international business support services that includes foreign currency exchange, international remittances, loans, and standby credit in local currencies, as well as information obtained from local partner banks and government agencies. As of March 31, 2020, the company operated 336 bank offices. Mebuki Financial Group, Inc. was founded in 1935 and is headquartered in Mito, Japan.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Mito",
        "zipcode": null,
        "website": "http://www.mebuki-fg.co.jp",
        "market_cap": "Mid Cap"
    },
    "5EH.F": {
        "short_name": "IYO BK LTD",
        "long_name": "The Iyo Bank, Ltd.",
        "summary": "The Iyo Bank, Ltd., together with its subsidiaries, provides banking and other financial services in Tokyo, Nagoya, and other ASEAN regions. It operates through Commercial Banking and Leasing segments. The company's activities include deposit services, lending services, securities investment services, and exchange services, as well as business support, credit guarantee, credit card, securities trading, and fund management services. As of March 31, 2020, it operated 149 branches located in 13 prefectures; and 1 foreign branch. The Iyo Bank, Ltd. was founded in 1878 and is headquartered in Matsuyama, Japan.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Matsuyama",
        "zipcode": "790-8514",
        "website": "http://www.iyobank.co.jp",
        "market_cap": "Small Cap"
    },
    "5F0.F": {
        "short_name": "GUNMA BK LTD",
        "long_name": "The Gunma Bank, Ltd.",
        "summary": "The Gunma Bank, Ltd. provides various banking and financial services in Japan. The company is involved in the fund management activities comprising investment in securities and funding in the call market; and accepting deposits and negotiable certificates of deposit, as well as the provision of loans. It also engages in the provision of securities investment, leasing, derivative transaction, and proprietary derivative trading services. The Gunma Bank, Ltd. was founded in 1932 and is based in Maebashi, Japan.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Maebashi",
        "zipcode": "371-8611",
        "website": "http://www.gunmabank.co.jp",
        "market_cap": "Small Cap"
    },
    "5F9.F": {
        "short_name": "FIDEA HLDGS CO. LTD",
        "long_name": "FIDEA Holdings Co. Ltd.",
        "summary": "FIDEA Holdings Co. Ltd., through its subsidiaries, provides various banking products and services in Japan. The company was founded in 1878 and is headquartered in Sendai, Japan.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Sendai",
        "zipcode": "980-0021",
        "website": "http://www.fidea.co.jp",
        "market_cap": "Small Cap"
    },
    "5FI.F": {
        "short_name": "HACHIJUNI BK",
        "long_name": "The Hachijuni Bank, Ltd.",
        "summary": "The Hachijuni Bank, Ltd. provides various banking products and services. It accepts various deposits; and provides loan products. As of March 31, 2019, the company operated 167 branches in Japan; 1 overseas branch in Hong Kong; and 4 representative offices in Dalian, Shanghai, Bangkok, and Singapore. The Hachijuni Bank, Ltd. was founded in 1931 and is based in Nagano, Japan.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Nagano",
        "zipcode": "380-8682",
        "website": "http://www.82bank.co.jp",
        "market_cap": "Small Cap"
    },
    "5FW.F": {
        "short_name": "YAMAGUCHI FINL GRP INC.",
        "long_name": "Yamaguchi Financial Group, Inc.",
        "summary": "Yamaguchi Financial Group, Inc., together with its subsidiaries, provides various banking products and services in Japan. It provides securities brokerage, credit card, leasing, consulting, and other services. The company was founded in 2006 and is headquartered in Shimonoseki, Japan.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Shimonoseki",
        "zipcode": "750-8603",
        "website": "http://www.ymfg.co.jp",
        "market_cap": "Small Cap"
    },
    "7150.T": {
        "short_name": "THE SHIMANE BANK LTD",
        "long_name": "The Shimane Bank,Ltd.",
        "summary": "The Shimane Bank,Ltd. provides various banking products and services for individual and corporate customers in Japan. The company offers various deposit products; and loans, including car, card, education, housing, multipurpose, bill, certificate, and institutional loans, as well as bill discounts. It also provides whole life, personal annuity, medical, cancer, income security, disability, and fire insurance products; investment trusts; financial product brokerage; and Internet banking services. The company operates 33 branches. The Shimane Bank, Ltd. was incorporated in 1915 and is headquartered in Matsue, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Matsue",
        "zipcode": "690-0003",
        "website": "http://www.shimagin.co.jp",
        "market_cap": "Mid Cap"
    },
    "7161.T": {
        "short_name": "JIMOTO HOLDINGS INC",
        "long_name": "Jimoto Holdings, Inc.",
        "summary": "Jimoto Holdings, Inc. provides various banking and financial products and services. The company offers lease, credit card, consulting, venture capital, and administrative services. It also provides computer system development, maintenance, and operation commissioned work services. Jimoto Holdings, Inc. was founded in 2012 and is headquartered in Sendai, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sendai",
        "zipcode": null,
        "website": "http://www.jimoto-hd.co.jp",
        "market_cap": "Large Cap"
    },
    "7167.T": {
        "short_name": "MEBUKI FINANCIAL GROUP INC",
        "long_name": "Mebuki Financial Group, Inc.",
        "summary": "Mebuki Financial Group, Inc. provides banking and financial services in Japan and internationally. The company accepts various deposits; and provides funds to corporate customers and individuals, including housing loans. It also engages in call money transactions in the short-term markets; and invests in securities primarily comprising bonds, as well as money markets. In addition, the company offers leasing, securities, and credit card services; and international business support services that includes foreign currency exchange, international remittances, loans, and standby credit in local currencies, as well as information obtained from local partner banks and government agencies. As of March 31, 2020, the company operated 336 bank offices. Mebuki Financial Group, Inc. was founded in 1935 and is headquartered in Mito, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Mito",
        "zipcode": null,
        "website": "http://www.mebuki-fg.co.jp",
        "market_cap": "Large Cap"
    },
    "7173.T": {
        "short_name": "TOKYO KIRABOSHI FINANCIAL GP IN",
        "long_name": "Tokyo Kiraboshi Financial Group, Inc.",
        "summary": "Tokyo Kiraboshi Financial Group, Inc. provides various banking products and services for small and medium-sized enterprise, and individual customers in Japan. The company provides loan guarantee, and home and consumer loans; and credit card, movable property leasing, business succession, and merger and acquisition services. It also engages in the investment management and securities businesses; investment trust management business; collection agency business; consulting business; management, cleaning, and maintenance of buildings and various accessory facilities; procurement and management of advertising supplies and office equipment; and in-bank flights, remittances, and centralized office works. In addition, the company is involved in the development and provision of computer systems; provision of various management consultations, seminars, etc.; and development and provision of services utilizing fintech and construction of new businesses, etc. The company was founded in 1924 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.tokyo-kiraboshifg.co.jp",
        "market_cap": "Large Cap"
    },
    "7184.T": {
        "short_name": "THE FIRST BANK OF TOYAMA LTD",
        "long_name": "The First Bank Of Toyama, Ltd.",
        "summary": "The First Bank Of Toyama, Ltd. provides banking and financial services for individual, corporate, and business customers. It offers general accounts; savings, foreign currency, time, periodic, and other deposits; housing, auto, education, remodeling, free, and card loans; investment trust; public bonds; brokerage products; pension and insurance products; and Internet banking services. The company operates 66 branches. The First Bank Of Toyama, Ltd. was founded in 1944 and is headquartered in Toyama, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Toyama",
        "zipcode": null,
        "website": "http://www.first-bank.co.jp",
        "market_cap": "Large Cap"
    },
    "7186.T": {
        "short_name": "CONCORDIA FINANCIAL GROUP LTD",
        "long_name": "Concordia Financial Group, Ltd.",
        "summary": "Concordia Financial Group, Ltd., through its subsidiaries, provides various banking products and services to small and medium-sized businesses and individuals. It offers various deposit and loan products. The company also provides securities, leasing, survey research and other information, venture capital, and other financial services. It operates through a network of branches, sub-branches, ATMs, and representative offices in Japan and internationally. Concordia Financial Group, Ltd. was founded in 2016 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-6034",
        "website": "http://www.concordia-fg.jp",
        "market_cap": "Large Cap"
    },
    "7327.T": {
        "short_name": "DAISHI HOKUETSU FINANCIAL GROUP",
        "long_name": "Daishi Hokuetsu Financial Group, Inc.",
        "summary": "Daishi Hokuetsu Financial Group, Inc., through its subsidiaries, provides various banking products and services in Japan. The company offers deposit products, such as current accounts, savings accounts, savings deposits, notice deposits, term deposits, separate deposits, tax reserve deposits, non-residents' yen deposits, certificates of deposit, foreign currency deposits, and time deposits; loans, including note loans, certificate loans, and overdrafts. It also engages in buying and selling government bonds and other public bonds; invests in government bonds, land bonds, bonds, stocks, and other securities; provision of remittance, transfer, and cash collection, and bills of exchange services; and forex business comprising export, import, foreign remittance and other foreign exchange businesses. In addition, the company offers securities, credit cards and credit guarantee, venture capital and consulting, general leasing, computer related, and HR consulting services, as well as survey research and information provision related to the economy and society. The company was founded in 1873 and is headquartered in Niigata, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Niigata",
        "zipcode": null,
        "website": "http://www.dhfg.co.jp",
        "market_cap": "Large Cap"
    },
    "7337.T": {
        "short_name": "HIROGIN HOLDINGS INC",
        "long_name": "Hirogin Holdings, Inc.",
        "summary": "Hirogin Holdings, Inc. operates as a bank holding company for The Hiroshima Bank, Ltd. that provides various financial services in Hiroshima, Okayama, Yamaguchi, and Ehime prefectures. The company offers deposits and loans; and financial instruments brokerage, receivable debts administration and recovery, asset management and investment, credit card, credit guarantee, factoring, and financing services, as well as consolidated accounting, printing, binding, collateral real estate valuation, and contract due diligence services. It operates 151 branches in Japan and representative offices in Shanghai, Bangkok, Singapore, and Hanoi. The company was founded in 1878 and is headquartered in Hiroshima, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Hiroshima",
        "zipcode": null,
        "website": "http://www.hirogin-hd.co.jp",
        "market_cap": "Large Cap"
    },
    "8303.T": {
        "short_name": "SHINSEI BANK",
        "long_name": "Shinsei Bank, Limited",
        "summary": "Shinsei Bank, Limited provides various banking and financial products and services to individual customers, businesses, public corporations, and financial institutions in Japan. It offers Yen/foreign currency deposits, and structured deposits; home mortgages; and housing and unsecured loans, real estate related nonrecourse finance and corporate finance, ship finance, healthcare, and project finance, specialty finance, M&A-related, and renewable energy finance. The company also provides investment trusts, brokerage, life and non-life insurance, advisory, credit trading, private equity, business succession finance, and asset-backed investment services, as well as credit cards. In addition, it engages in the provision of financial transactions and services for individuals; trust businesses; foreign exchange, derivatives, equity-related, and other capital markets businesses; payment services; and securities, asset management, and wealth management businesses. The company was formerly known as The Long-Term Credit Bank of Japan, Limited and changed its name to Shinsei Bank, Limited in June 2000. Shinsei Bank, Limited was incorporated in 1952 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8303",
        "website": "http://www.shinseibank.com",
        "market_cap": "Large Cap"
    },
    "8304.T": {
        "short_name": "AOZORA BANK",
        "long_name": "Aozora Bank, Ltd.",
        "summary": "Aozora Bank, Ltd., together with its subsidiaries, provides various banking products and services in Japan and internationally. It operates through Retail Banking Group, Institutional Banking Group, Allied Banking Group, Specialty Finance Group, International Finance Group, and Financial Markets Group segments. The company offers checking accounts, savings accounts, time deposits, deposits-at-notice, non-residents deposits, and negotiable certificates of deposit, as well as deposits in foreign currencies. It also provides loans on deeds, loans on notes, and overdrafts; discount on promissory notes; securities investments, including public, local, and corporate bonds, as well as equity and other securities; domestic and foreign exchange services; and consignment of bonds. In addition, the company offers liabilities guarantee, securities lending, public bonds underwriting, agency, custody, and financial instruments intermediary services. Further, it is involved in the over-the-counter sale of securities investment trusts and insurance products; and provision of trust services for secured corporate bonds, as well as interest rate, currency, and other derivative transaction services. Additionally, the company offers asset management consultation, merger and acquisition advisory, business succession, acquisition and project financing, and equity financing through private equity fund services; syndicated loans arrangements; asset securitization, real estate finance and business recovery finance, and corporate finance services; project financing services in the areas of shipping and trade; other structured finance services; and derivative products and trust services. As of March 31, 2020, it operated 20 domestic offices. The company was formerly known as Nippon Fudosan Bank, Limited and changed its name to Aozora Bank, Ltd. in 2001. Aozora Bank, Ltd. was founded in 1957 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-8660",
        "website": "http://www.aozorabank.co.jp",
        "market_cap": "Large Cap"
    },
    "8308.T": {
        "short_name": "RESONA HOLDINGS",
        "long_name": "Resona Holdings, Inc.",
        "summary": "Resona Holdings, Inc., through its subsidiaries, provides banking products and services in Japan and internationally. It operates through Consumer Banking, Corporate Banking, and Market Trading segments. The company engages in the short term lending, borrowing, bond purchase and sale, and derivatives trading activities; and provides various services related to corporate loan, trust asset management, real estate business, corporate pension, and asset succession. It also offers banking and trust banking, credit guarantee, collection of bills and receivables, factoring, and credit card administration and guarantee facilities. In addition, the company is involved in the private equity and financing businesses; and provision of business consulting and investment management, business process outsourcing and placement, general leasing, and system development services. It serves individuals and corporate customers. As of March 31, 2020, the company operated 833 branches. Resona Holdings, Inc. was founded in 1918 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "135-8582",
        "website": "http://www.resona-gr.co.jp",
        "market_cap": "Large Cap"
    },
    "8331.T": {
        "short_name": "CHIBA BANK",
        "long_name": "The Chiba Bank, Ltd.",
        "summary": "The Chiba Bank, Ltd., together with its subsidiaries, provides banking products and services in Japan and internationally. It offers various deposit products; and various loans and bills discounting products. The company also engages in securities, leasing, credit card, and credit guarantee business; management and collection of claims; and outsourcing of operational business. In addition, it rents and maintains office buildings and welfare facilities; purchases and sells supplies and consumer goods; and develops computer systems and commissioned computation tasks. Further, the company provides housing-loan guarantees and fee collection services; consulting services for portfolio investments of client financial assets; information and survey services; and accounting and administration, and temporary staff services. Additionally, it engages in the investigation and research of advanced financial technologies; and planning and development of financial services. The company serves individuals and SMEs. As of March 31, 2020, it operated approximately 183 offices, including 159 branches, 21 sub-branches, and 3 virtual branches; 49,371 off-branch ATM locations; 3 money exchange counters; 3 branches in New York, Hong Kong, and London; and 3 representative offices in Shanghai, Singapore, and Bangkok. The Chiba Bank, Ltd. was founded in 1943 and is headquartered in Chiba, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Chiba",
        "zipcode": "260-8720",
        "website": "http://www.chibabank.co.jp",
        "market_cap": "Large Cap"
    },
    "8334.T": {
        "short_name": "GUNMA BANK",
        "long_name": "The Gunma Bank, Ltd.",
        "summary": "The Gunma Bank, Ltd. provides various banking and financial services in Japan. The company is involved in the fund management activities comprising investment in securities and funding in the call market; and accepting deposits and negotiable certificates of deposit, as well as the provision of loans. It also engages in the provision of securities investment, leasing, derivative transaction, and proprietary derivative trading services. The Gunma Bank, Ltd. was founded in 1932 and is based in Maebashi, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Maebashi",
        "zipcode": "371-8611",
        "website": "http://www.gunmabank.co.jp",
        "market_cap": "Large Cap"
    },
    "8336.T": {
        "short_name": "MUSASHINO BANK",
        "long_name": "The Musashino Bank, Ltd.",
        "summary": "The Musashino Bank, Ltd., together with its subsidiaries, provides banking products and financial services in Japan. It offers deposits, loans, loan guarantees, and credit cards, as well as financial instruments, asset management, inheritance-related, business succession support, installment-payment, and auto and general leasing services. The company also engages in the development, sale, and maintenance of computer systems; research of regional economy; management support for venture businesses; holding of seminars; and outsourcing of operational business. In addition, it offers consultation and information services. As of June 30, 2020, the company operated 99 branches and 9 mortgage loan centers. The Musashino Bank, Ltd. was founded in 1952 and is headquartered in Saitama, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Saitama",
        "zipcode": "330-0854",
        "website": "http://www.musashinobank.co.jp",
        "market_cap": "Large Cap"
    },
    "8337.T": {
        "short_name": "CHIBA KOGYO BANK",
        "long_name": "The Chiba Kogyo Bank, Ltd.",
        "summary": "The Chiba Kogyo Bank, Ltd., together with its subsidiaries, provides various banking products and services in Japan. Its products and services, include credit cards, housing and other loan guarantee services, and leasing services. The company also develops, sells, and maintains computer systems. As of March 31, 2020, it operated 74 branches. The Chiba Kogyo Bank, Ltd. was founded in 1952 and is headquartered in Chiba, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Chiba",
        "zipcode": "261-0001",
        "website": "http://www.chibakogyo-bank.co.jp",
        "market_cap": "Large Cap"
    },
    "8338.T": {
        "short_name": "TSUKUBA BANK LTD",
        "long_name": "Tsukuba Bank, Ltd.",
        "summary": "Tsukuba Bank, Ltd. provides various banking products and services primarily in Ibaraki prefecture in Japan. It offers deposits and loans; insurance; and asset management and other services. The company was formerly known as Ibaraki Mutual Bank, Ltd. and changed its name to Tsukuba Bank, Ltd. in 1989. Tsukuba Bank, Ltd. was founded in 1952 and is headquartered in Tsukuba, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tsukuba",
        "zipcode": "305-0032",
        "website": "http://www.tsukubabank.co.jp",
        "market_cap": "Large Cap"
    },
    "8342.T": {
        "short_name": "AOMORI BANK",
        "long_name": "The Aomori Bank, Ltd.",
        "summary": "The Aomori Bank, Ltd. provides various banking products and services. The company offers various deposits and loans. It operates a network of 97 offices. The Aomori Bank, Ltd. was founded in 1879 and is headquartered in Aomori, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Aomori",
        "zipcode": "030-8668",
        "website": "http://www.a-bank.jp",
        "market_cap": "Large Cap"
    },
    "8343.T": {
        "short_name": "AKITA BANK",
        "long_name": "The Akita Bank, Ltd.",
        "summary": "The Akita Bank, Ltd. provides banking and other financial services in the Akita Prefecture, Japan. It offers current, ordinary, savings, time, and other deposits, as well as installment savings and deposits at notice. The company also provides loans and credit cards, as well as guarantee, leasing, and consulting services. As of March 31, 2020, it operated through 98 branches. The company was founded in 1879 and is headquartered in Akita, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Akita",
        "zipcode": "010-8655",
        "website": "http://www.akita-bank.co.jp",
        "market_cap": "Large Cap"
    },
    "8344.T": {
        "short_name": "YAMAGATA BANK",
        "long_name": "The Yamagata Bank, Ltd.",
        "summary": "The Yamagata Bank, Ltd. provides various banking services in Japan. The company operates through Banking Leasing, and Credit Guarantee Business segments. It is involved in deposit taking and lending activities; and investment in securities. The company also offers exchange and leasing services. As of March 31, 220, it operated 80 branches. The Yamagata Bank, Ltd. was founded in 1896 and is headquartered in Yamagata, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yamagata",
        "zipcode": "990-8642",
        "website": "http://www.yamagatabank.co.jp",
        "market_cap": "Large Cap"
    },
    "8345.T": {
        "short_name": "BANK OF IWATE LTD",
        "long_name": "The Bank of Iwate, Ltd.",
        "summary": "The Bank of Iwate, Ltd. provides various financial products and services in Japan. It operates in two segments, Commercial Banking Business and Leasing Business. The Commercial Banking Business segment consists of deposits, loans, securities investment, and foreign exchange operations. The Leasing Business segment offers financial leasing, and computer processing contract services. The company also trades in securities; and provides credit card and guarantee, as well as computerized accounting services. The company was formerly known as Iwate Shokusan Bank and changed its name to The Bank of Iwate, Ltd. in 1960. The Bank of Iwate, Ltd. was founded in 1932 and is headquartered in Morioka, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Morioka",
        "zipcode": "020-8688",
        "website": "http://www.iwatebank.co.jp",
        "market_cap": "Large Cap"
    },
    "8349.T": {
        "short_name": "TOHOKU BANK",
        "long_name": "The Tohoku Bank, Ltd.",
        "summary": "The Tohoku Bank, Ltd. provides various banking and financial services for individual and corporate customers in Japan. The company also provides saving/general accounts, time deposits, investment trust, and government bonds; debit and credit cards; payment collection services; and internet and mobile banking services. It offers various loans, such as housing, car, card, free, education, remodeling, travel, bridal, mortgage, reconstruction support, medical/long-term, and agricultural loans. In addition, the company provides medical/ cancer, personal annuity, whole life, term, and income security insurance products; and pension services. As of March 31, 2020, it operated 55 stores and 2 branch offices. The company was founded in 1950 and is headquartered in Morioka, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Morioka",
        "zipcode": "020-0023",
        "website": "http://www.tohoku-bank.co.jp",
        "market_cap": "Mid Cap"
    },
    "8350.T": {
        "short_name": "MICHINOKU BANK",
        "long_name": "The Michinoku Bank, Ltd.",
        "summary": "The Michinoku Bank, Ltd. provides various banking products and services in Japan. The company accepts savings, time, and foreign currency deposits. Its loan portfolio comprises housing, remodeling, mortgage, card, car, education, multipurpose, and business loans. The company also offers various cards; investment trust, mutual fund, and government bonds; insurance and pension products; and Internet and mobile banking. It operates through a network of 92 branches, 2 offices, and 1 representative office. The Michinoku Bank, Ltd. was founded in 1921 and is headquartered in Aomori, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Aomori",
        "zipcode": "030-8622",
        "website": "http://www.michinokubank.co.jp",
        "market_cap": "Large Cap"
    },
    "8354.T": {
        "short_name": "FUKUOKA FINANCIAL GROUP INC.",
        "long_name": "Fukuoka Financial Group, Inc.",
        "summary": "Fukuoka Financial Group, Inc., through its subsidiaries, provides banking services. The company accepts various deposits, such as current deposits, ordinary and other demand deposits, time deposits, and negotiable certificates of deposit, as well as provides loan products. It is also involved in securities, office work agent, loan guarantee, system development and operation, credit card, collateral valuation, credit management and collection, consulting, insurance, research and development, investments, and factoring businesses. In addition, the company engages in the movable property and lease of right business; and provision of information processing and communications services. Fukuoka Financial Group, Inc. was founded in 1877 and is headquartered in Fukuoka, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuoka",
        "zipcode": "810-8693",
        "website": "http://www.fukuoka-fg.com",
        "market_cap": "Large Cap"
    },
    "8355.T": {
        "short_name": "SHIZUOKA BANK",
        "long_name": "The Shizuoka Bank, Ltd.",
        "summary": "The Shizuoka Bank, Ltd., a regional bank, provides various banking products and services. The company operates through Banking Operations and Leasing Operations segments. The Banking Operations segment consist of the banking business centered on deposits, loans, investment securities, and exchange transactions. The Leasing Operations segment includes lease transactions centered on finance leases. It also provides corporate and financial management advisory, bill collection, leasing, and finance and securities-related services. In addition, the company engages in the guarantee of housing loans, credit cards and prepaid cards, and consumer loans; development and operation of computer systems; provision of public-offering assistance support for corporate rehabilitation, and fee-based job placement and general administration services; and appraisal of real estate for loan collateral, as well as operation of centers for loans, remittance, and bill collection. Further, it is involved in the provision of part-time employee management, finance and securities-related, and monetary receivables purchasing services; and making, printing and binding of documents. As of July 1, 2020, the company operated a head office, 177 branches, and 27 sub-branches in Shizuoka Prefecture, Tokyo, Osaka, and Nagoya; 2 branches in New York and Los Angeles; 1 in Europe; and 1 branch in Hong Kong, as well as 2 representative offices in Shanghai and Singapore. The Shizuoka Bank, Ltd. was founded in 1943 and is headquartered in Shizuoka, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Shizuoka",
        "zipcode": "424-8677",
        "website": "http://www.shizuokabank.co.jp",
        "market_cap": "Large Cap"
    },
    "8356.T": {
        "short_name": "JUROKU BANK",
        "long_name": "The Juroku Bank, Ltd.",
        "summary": "The Juroku Bank, Ltd. engages in banking and leasing businesses in Japan. The company's Banking Business segment is involved in deposit-taking and lending, securities trading, securities investment, domestic and foreign exchange, managing bonds, derivatives, and other related activities. Its Lease Business segment offers leasing services. The company also provides credit cards, computer services, and credit guarantees. It operates 162 branch offices primarily in the prefectures of Gifu and Aichi, as well as representative offices in Shanghai, Singapore, Bangkok, and Hanoi. The Juroku Bank, Ltd. was founded in 1877 and is headquartered in Gifu, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Gifu",
        "zipcode": "500-8516",
        "website": "http://www.juroku.co.jp",
        "market_cap": "Large Cap"
    },
    "8358.T": {
        "short_name": "SURUGA BANK",
        "long_name": "Suruga Bank Ltd.",
        "summary": "Suruga Bank Ltd. provides various banking and financial products and services to individuals and corporate customers in Japan. The company offers deposit products, such as time, ordinary, savings, foreign currency, and other deposits, as well as current and general accounts; card, housing, second house, resort, startup, project assistance, and business up term loans, as well as loans by purpose; credit and debit cards; and overdrafts and other financing products. It also provides investment trust, public bond, pension contribution, insurance, inheritance/trust, lottery, foreign currency exchange reservation, pay-easy, Web oral receipt, safe deposit box, external linkage, foreign remittance, fund management, e-combination, payment, nursing care/medical care/dispensing compensation receivable factoring, mortgage, and Internet and telephone banking services. In addition, the company offers staffing, money lending and credit guarantee, mortgage loans guarantee, printing, bookbinding, packing and shipping, leasing, and clerical agency and system engineering services. It operates through a network of 128 branches in Japan. The company was founded in 1895 and is headquartered in Numazu, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Numazu",
        "zipcode": "410-8689",
        "website": "http://www.surugabank.co.jp",
        "market_cap": "Large Cap"
    },
    "8359.T": {
        "short_name": "HACHIJUNI BANK",
        "long_name": "The Hachijuni Bank, Ltd.",
        "summary": "The Hachijuni Bank, Ltd. provides various banking products and services. It accepts various deposits; and provides loan products. As of March 31, 2019, the company operated 167 branches in Japan; 1 overseas branch in Hong Kong; and 4 representative offices in Dalian, Shanghai, Bangkok, and Singapore. The Hachijuni Bank, Ltd. was founded in 1931 and is based in Nagano, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagano",
        "zipcode": "380-8682",
        "website": "http://www.82bank.co.jp",
        "market_cap": "Large Cap"
    },
    "8360.T": {
        "short_name": "YAMANASHI CHUO BANK",
        "long_name": "The Yamanashi Chuo Bank, Ltd.",
        "summary": "The Yamanashi Chuo Bank, Ltd., together with its subsidiaries, provides financial services to individual and corporate customers in Yamanashi Prefecture and western Tokyo, Japan. The company accepts deposits; and provides loans. It also offers insurance products, loan guarantees, investment trust and leasing services, credit cards, and consulting and economic research services, as well as corporate bond underwriting services. In addition, the company is involved in the asset management activities; securities trading business; provision of foreign exchange operations; and provision of over-the-counter sale of public bonds, such as Japanese government bonds. It operates through a network of 90 branches, including 1 Internet branch, 2 district offices, and 1 corporate branch; and 1 representative office in Hong Kong. The company was founded in 1941 and is headquartered in Kofu, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kofu",
        "zipcode": "400-8601",
        "website": "http://www.yamanashibank.co.jp",
        "market_cap": "Large Cap"
    },
    "8361.T": {
        "short_name": "OGAKI KYORITSU BANK",
        "long_name": "The Ogaki Kyoritsu Bank, Ltd.",
        "summary": "The Ogaki Kyoritsu Bank, Ltd., a regional financial institution, provides various banking products and services in Japan and internationally. The company also provides computing and software development services; research services on economy, industry, information processing technology, and culture; credit guarantee and investigation services; real estate collateral appraisal services; credit card services; and bank agency services, as well as engages in the preparation, printing, receiving, and forwarding of documents. It is also involved in leasing and securities activities. It operates through 159 branches, including 155 domestic and 3 foreign branches. The company was founded in 1896 and is headquartered in Ogaki, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Ogaki",
        "zipcode": "503-0887",
        "website": "http://www.okb.co.jp",
        "market_cap": "Large Cap"
    },
    "8362.T": {
        "short_name": "FUKUI BANK",
        "long_name": "The Fukui Bank, Ltd.",
        "summary": "The Fukui Bank, Ltd., together with its subsidiaries, provides various banking products and services. It operates through Banking and Leasing segments. The Banking segment offers deposits; lending services; credit cards; and domestic and foreign exchange, and credit guarantee services. The Leasing segment leases industrial machinery, computers, and office equipment. The Fukui Bank, Ltd. was founded in 1899 and is headquartered in Fukui, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukui",
        "zipcode": "910-8660",
        "website": "http://www.fukuibank.co.jp",
        "market_cap": "Large Cap"
    },
    "8363.T": {
        "short_name": "HOKKOKU BANK",
        "long_name": "The Hokkoku Bank, Ltd.",
        "summary": "The Hokkoku Bank, Ltd. provides banking and leasing services. The company accepts current and saving deposits; and offers loans on deeds, overdrafts, and guarantees. It also provides domestic and international remittance; and trade financing services, including letter of credit transactions, purchase and collection of export bills, forward exchange contracts, etc. As of June 11, 2020, it operated through 105 branches; 2 representative offices; and 9 money plazas. The Hokkoku Bank, Ltd. was founded in 1943 and is headquartered in Kanazawa, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kanazawa",
        "zipcode": "920-8670",
        "website": "http://www.hokkokubank.co.jp",
        "market_cap": "Large Cap"
    },
    "8364.T": {
        "short_name": "SHIMIZU BANK",
        "long_name": "The Shimizu Bank, Ltd.",
        "summary": "The Shimizu Bank, Ltd. provides various banking services in Japan. The company offers cash calculation, credit guaranteeing, leasing, and credit card services. It also manages real estate properties; and provides personnel delegation services, as well as financial and economic research, and training services. As of March 31, 2020, the company operated a network of 78 branches and 1 sub-branch. The Shimizu Bank, Ltd. was founded in 1928 and is headquartered in Shizuoka, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Shizuoka",
        "zipcode": "424-0941",
        "website": "http://www.shimizubank.co.jp",
        "market_cap": "Large Cap"
    },
    "8365.T": {
        "short_name": "TOYAMA BANK",
        "long_name": "The Bank of Toyama, Ltd.",
        "summary": "The Bank of Toyama, Ltd. provides various banking products and services to individual and business customers in Japan. It offers ordinary, time, savings, and term deposits, as well as housing, car, and education loans. The company also provides pension and insurance, NISA products, financial products brokerage, government bonds, and investment trust services; safe deposit boxes; automatic transfer and foreign currency services; and debit cards. In addition, it offers direct, internet, and mobile banking services, as well as operates 39 stores. The company was formerly known as Toyama Industrial Bank and changed its name to The Bank of Toyama, Ltd. in August 1967. The company was founded in 1954 and is headquartered in Takaoka, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Takaoka",
        "zipcode": "933-8606",
        "website": "http://www.toyamabank.co.jp",
        "market_cap": "Large Cap"
    },
    "8366.T": {
        "short_name": "SHIGA BANK",
        "long_name": "The Shiga Bank, Ltd.",
        "summary": "The Shiga Bank, Ltd. provides various banking products and services in Japan and internationally. The company accepts various deposits products, including current, ordinary, notice, time, and other deposits, as well as negotiable certificate of deposits. It also offers loans and bills discounted; loans on bills and deeds; overdrafts; investment trust services; life insurance products; and financial instruments intermediary services. The company operates through 133 offices and branches, including 25 agents. The Shiga Bank, Ltd. was founded in 1933 and is headquartered in Otsu, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Otsu",
        "zipcode": "520-8686",
        "website": "http://www.shigagin.com",
        "market_cap": "Large Cap"
    },
    "8367.T": {
        "short_name": "NANTO BANK",
        "long_name": "The Nanto Bank, Ltd.",
        "summary": "The Nanto Bank, Ltd., together with its subsidiaries, offers financial services, including leasing, trust banking, securities, and consulting for individual and corporate customers. It provides savings accounts, time deposits, saving deposits, large time deposits, pension schemes, foreign currency deposits, reverse deposits, investment products, government bonds, fund management, financing, and certificate of deposits; and home loans, card loans, and loans by purpose. The company also provides management and leasing of commercial real estate, as well as outsourcing and employee placement services; guarantee services for consumer loans, including Nanto Bank mortgages, and support for customers' loan use; computer system development and sales; financial services agency for regional customers; and securities services. The Nanto Bank, Ltd. was founded in 1934 and is headquartered in Nara, Japan with branches in Japan, Hong Kong, and China.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nara",
        "zipcode": "630-8677",
        "website": "http://www.nantobank.co.jp",
        "market_cap": "Large Cap"
    },
    "8368.T": {
        "short_name": "HYAKUGO BANK",
        "long_name": "The Hyakugo Bank, Ltd.",
        "summary": "The Hyakugo Bank, Ltd. provides various banking and financial services in Japan. The company also offers credit card and guarantee, leasing, regional industry survey and consulting-related, computer information processing, financial instruments transaction, cash examination and arrangement, collateralized real estate survey and appraisal, and employment placement and labor management services. In addition, it provides printing, storage, and administrative services for documents, account books, etc.; and management and administrative services for bank notes, bonds, etc. As of March 31, 2020, the company operated 85 branches and 30 sub-branches in Mie prefecture; 21 branches in Aichi prefectures; 1 branch in Wakayama prefecture; 2 branches in Tokyo and Osaka; and 3 representative offices in Singapore, Shanghai, and Bangkok, as well as 205 ATMs. The company was formerly known as 105th National Chartered Bank and changed its name to The Hyakugo Bank, Ltd. in 1897. The Hyakugo Bank, Ltd. was founded in 1878 and is headquartered in Tsu, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tsu",
        "zipcode": "514-8666",
        "website": "http://www.hyakugo.co.jp",
        "market_cap": "Large Cap"
    },
    "8369.T": {
        "short_name": "BANK OF KYOTO",
        "long_name": "The Bank of Kyoto, Ltd.",
        "summary": "The Bank of Kyoto, Ltd., together with its subsidiaries, provides various banking services for individuals and corporations in Japan. It accepts various deposits, such as current, ordinary, savings, time, and other deposits, as well as deposits at notice and negotiable certificates of deposit; and offers lending services. The company also provides securities investment, domestic and foreign exchange, research and business consulting, securities trading services, etc.; and other financial services, such as credit guarantees, leasing and investment, and credit card services, as well as financial intermediary services. It operates 174 branches in Kyoto, Osaka, Shiga, Nara, Hyogo, Aichi, Tokyo, and other prefectures. The Bank of Kyoto, Ltd. was founded in 1941 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "600-8652",
        "website": "http://www.kyotobank.co.jp",
        "market_cap": "Large Cap"
    },
    "8370.T": {
        "short_name": "KIYO BANK LTD",
        "long_name": "The Kiyo Bank, Ltd.",
        "summary": "The Kiyo Bank, Ltd. provides various banking products and services to individuals, corporates, and business customers in Japan. It offers Yen, time, and foreign currency deposits; mortgage, card, purpose, education-related, and free loans; and life, medical, cancer, financial insurance, etc., as well as pension funds. The company also provides securities investment, domestic and foreign exchange, agency, Internet banking, and ATM services; and cards, as well as engages in buying and selling government bonds, etc. It operates 111 branches in Japan, including 68 branches in Wakayama; 40 branches in Osaka prefecture; 1 branch in Tokyo; and 2 branches in Nara prefecture. The company was formerly known as Kiyo Bank Co., Ltd. and changed its name to The Kiyo Bank, Ltd. in October 2013. The Kiyo Bank, Ltd. was founded in 1895 and is headquartered in Wakayama, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Wakayama",
        "zipcode": "640-8656",
        "website": "http://www.kiyobank.co.jp",
        "market_cap": "Large Cap"
    },
    "8377.T": {
        "short_name": "HOKUHOKU FINANCIAL GROUP INC",
        "long_name": "Hokuhoku Financial Group, Inc.",
        "summary": "Hokuhoku Financial Group, Inc., together with its subsidiaries, provides various banking services to individuals, and small and medium-sized enterprises in Japan. The company offers various deposit products, including current, ordinary, savings, time, and installment savings, as well as deposits at notice and negotiable certificates of deposit; loans on bills and deeds; overdrafts; bills discounted; and a range of services, including leases, credit cards, loan guarantees, and venture capital. It also provides software development, document and cash management, and business processing solutions, as well as research on the regional economy, and survey research and consulting services. As of June 30, 2020, it operated 188 branches in Japan and 6 representative offices internationally. Hokuhoku Financial Group, Inc. was founded in 2003 and is headquartered in Toyama, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Toyama",
        "zipcode": "930-8637",
        "website": "http://www.hokuhoku-fg.co.jp",
        "market_cap": "Large Cap"
    },
    "8381.T": {
        "short_name": "SAN-IN GODO BANK",
        "long_name": "The San-in Godo Bank,Ltd.",
        "summary": "The San-in Godo Bank, Ltd. provides various banking products and services for individuals and corporate customers in Japan. The company operates in two segments, Banking and Leasing. It offers deposits and loans; and leasing, currency exchange, and securities investment services. The company also provides real estate leasing and credit guarantee services; collection, delivery, and sorting and safekeeping services for cash/checks; maintenance and management services for ATMs; and bad loan collection services. In addition, it offers public fund and account transfer services; and services for card member stores. Further, the company provides consulting services on the acquisition, safekeeping, and sale of securities, as well as corporate diagnosis and management consulting services. As of March 31, 2019, it operated 81 branches and 69 sub-branches in Tokyo and Osaka, as well as representative offices in Dalian, Shanghai, and Bangkok. The San-in Godo Bank, Ltd. was founded in 1878 and is headquartered in Matsue, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Matsue",
        "zipcode": "690-0062",
        "website": "http://www.gogin.co.jp",
        "market_cap": "Large Cap"
    },
    "8383.T": {
        "short_name": "TOTTORI BANK",
        "long_name": "The Tottori Bank, Ltd.",
        "summary": "The Tottori Bank, Ltd. provides various banking products and services in Japan. The company operates through Banking and Card Business segments. The Banking segment offers financial services, primarily depositing, lending, securities investment, and foreign exchange services. The Card Business segment provides credit cards. As of March 31, 2020, it operated a network of 65 branches. The company was founded in 1921 and is headquartered in Tottori, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tottori",
        "zipcode": "680-8686",
        "website": "http://www.tottoribank.co.jp",
        "market_cap": "Large Cap"
    },
    "8385.T": {
        "short_name": "IYO BANK",
        "long_name": "The Iyo Bank, Ltd.",
        "summary": "The Iyo Bank, Ltd., together with its subsidiaries, provides banking and other financial services in Tokyo, Nagoya, and other ASEAN regions. It operates through Commercial Banking and Leasing segments. The company's activities include deposit services, lending services, securities investment services, and exchange services, as well as business support, credit guarantee, credit card, securities trading, and fund management services. As of March 31, 2020, it operated 149 branches located in 13 prefectures; and 1 foreign branch. The Iyo Bank, Ltd. was founded in 1878 and is headquartered in Matsuyama, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Matsuyama",
        "zipcode": "790-8514",
        "website": "http://www.iyobank.co.jp",
        "market_cap": "Large Cap"
    },
    "8386.T": {
        "short_name": "HYAKUJUSHI BANK",
        "long_name": "The Hyakujushi Bank, Ltd.",
        "summary": "The Hyakujushi Bank, Ltd. primarily engages in banking activities in Japan. It operates through two segments, Banking and Leasing. The Banking segment provides deposits, loans, marketable securities and related investment services, and foreign currency exchange services. The Leasing segment is involved in leasing and other operations. As of March 31, 20120, it operated 125 offices, including 99 branches, 21 sub-branches, 1 quick square, and 4 consulting plaza. The company was founded in 1878 and is headquartered in Takamatsu, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Takamatsu",
        "zipcode": "760-8574",
        "website": "http://www.114bank.co.jp",
        "market_cap": "Large Cap"
    },
    "8387.T": {
        "short_name": "SHIKOKU BANK",
        "long_name": "The Shikoku Bank, Ltd.",
        "summary": "The Shikoku Bank, Ltd. provides various commercial banking products and services for individual and corporate customers in Japan. The company offers time, property accumulation, and foreign currency deposits; guaranteed, mortgages, card, owner's, education, car, purpose, remodeling, pension free, proxy and syndicated, and unoccupied house demolition support loans; loan simulation; and factoring services, as well as prepaid, credit, and cash cards. It also provides personal annuity, and life and pet insurance products; government and private placement bonds; payroll, foreign remittance, payment, trust, management consultation, merger and acquisition intermediary support, business succession, financial diagnostic, grant diagnostic, and farm banking services; and safe deposit boxes, as well as Internet services. The company was formerly known as Koichi Bank, Ltd. and changed its name to The Shikoku Bank, Ltd. in 1923. The Shikoku Bank, Ltd. was founded in 1878 and is headquartered in Kochi, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kochi",
        "zipcode": "780-8605",
        "website": "http://www.shikokubank.co.jp",
        "market_cap": "Large Cap"
    },
    "8392.T": {
        "short_name": "OITA BANK",
        "long_name": "The Oita Bank, Ltd.",
        "summary": "The Oita Bank, Ltd. provides various banking products and services to individual and corporate clients primarily in Oita Prefecture, Japan. It operates through Banking and Lease segments. The company engages in accepting deposits; providing loans; discounting bills; and buying and selling marketable securities and other financial instruments. It also offers leasing and credit card, financial instruments handling, and foreign exchange services. As of September 30, 2020, it operated through 93 branches and 34 money exchange offices. The Oita Bank, Ltd. was founded in 1893 and is headquartered in Oita, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Oita",
        "zipcode": "870-0021",
        "website": "http://www.oitabank.co.jp",
        "market_cap": "Large Cap"
    },
    "8393.T": {
        "short_name": "MIYAZAKI BANK",
        "long_name": "The Miyazaki Bank, Ltd.",
        "summary": "The Miyazaki Bank, Ltd. provides banking products and services to individual and corporate clients in Japan. It offers current account, savings, notification, settlement, fixed, tax reserve, and non-resident yen deposits, as well as negotiable certificates of deposit. The company also provides bills lending, certificates lending, securities lending, and overdraft services; proxy loans; leasing services; export, import, remittance, and other foreign exchange services; bonds and registration services; pension contribution operation and management services; and M&A and financial product brokerage services. In addition, it invests in government, municipal, and corporate bonds, as well as in stocks and other securities; manages funds; discounts on bank bills, commercial bills, and bills of exchange bills; and sells public bond windows, investment trust windows, and insurance products. Further, the company provides money transfer, payments collection, agency work, commercial papers, syndication, trust agency, safe deposit, and debt guarantee services; and representative services for SME infrastructure maintenance organizations, worker retirement allowance mutual aid organizations, etc. As of March 31, 2020, it operated 96 branches; and 396 automatic teller machines. The Miyazaki Bank, Ltd. was founded in 1932 and is headquartered in Miyazaki, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Miyazaki",
        "zipcode": "880-0805",
        "website": "http://www.miyagin.co.jp",
        "market_cap": "Large Cap"
    },
    "8397.T": {
        "short_name": "OKINAWA BANK",
        "long_name": "The Bank of Okinawa, Ltd.",
        "summary": "The Bank of Okinawa, Ltd., together with its subsidiaries, provides various banking and financial services in Japan and internationally. The company offers leasing, credit card, credit guaranty, security, and other services. It also engages in the cash counting and clerical operations; financial and economic conditions surveys, and general research; and credit management and collection operations, as well as the provision of computer-related services. As of March 31, 2020, it operated 65 branches. The company was founded in 1956 and is headquartered in Naha, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Naha",
        "zipcode": "900-8651",
        "website": "http://www.okinawa-bank.co.jp",
        "market_cap": "Large Cap"
    },
    "8398.F": {
        "short_name": "CHIKUHO BANK",
        "long_name": "The Chikuho Bank, Ltd.",
        "summary": "The Chikuho Bank, Ltd. provides various banking products and services to individual and corporate customers in Japan. The company offers deposits, certificates of deposits, loans, financing, fund management, and management support services. As of September 30, 2020, it operated 44 branches. The company was founded in 1952 and is headquartered in Kurume, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FKA",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kurume",
        "zipcode": "830-0037",
        "website": "http://www.chikugin.co.jp",
        "market_cap": "Large Cap"
    },
    "8399.T": {
        "short_name": "BANK OF RYUKYUS",
        "long_name": "Bank of The Ryukyus, Limited",
        "summary": "Bank of The Ryukyus, Limited provides various banking products and services in Japan. The company offers savings, time, and property deposits; loan products, including housing, apartment, car, education, card, and corporate loans, as well as loans for travel, moving and purchasing furniture, etc.; reverse mortgages; and insurance products, such as individual, lifetime, annuity, whole life, medical, term, fire, pet, and cancer insurance. It also engages in the intermediation of securities trading and handling of securities for sale; and provision of mutual funds, bonds, and foreign currency deposits. In addition, the company provides structured finance, mergers and acquisitions, business matching, local revitalization, and reorganization services, as well as business succession planning; cards; money transfer, safe deposit boxes; securities brokerage; foreign currency exchange; remittance; internet banking; and merchant services. Bank of The Ryukyus, Limited was founded in 1948 and is headquartered in Naha, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Naha",
        "zipcode": "900-0015",
        "website": "http://www.ryugin.co.jp",
        "market_cap": "Large Cap"
    },
    "8411.T": {
        "short_name": "MIZUHO FINANCIAL GROUP",
        "long_name": "Mizuho Financial Group, Inc.",
        "summary": "Mizuho Financial Group, Inc., together with its subsidiaries, engages in banking, trust, securities, and other businesses related to financial services in Japan, the Americas, Europe, Asia/Oceania, and internationally. It operates through five segments: Retail & Business Banking Company, Corporate & Institutional Company, Global Corporate Company, Global Markets Company, and Asset Management Company. The company provides deposit products; syndicated, housing, and card loans; business matching services; and advisory services related to overseas expansions, and mergers and acquisitions-related services. It also offers consulting services, including asset management and asset succession; payroll services; and sells lottery tickets issued by prefectures and ordinance-designated cities. In addition, it offers financial solutions, such as fund management, underwriting of equity and bonds, M&A advisory, and risk hedging products, etc. for corporate customers to meet their needs in fund-raising, investment management, and financial strategies; solutions based on their capital management, business strategy, and financial strategy; solutions related to real estate; advisory services and solutions, such as advice on proposals on various investment products; and financial services that include funding support. Further, the company offers sales and trading services to meet risk hedging and investment needs; investment products for individual customers; and consulting services for institutional investors. Additionally, the company provides products and services related to trust, securitization and structured finance, pension, and stock transfers; securities services; and research, private banking, and information technology-related services. As of March 31, 2020, its branch network included 464 Mizuho Bank, 60 Mizuho Trust and Banking, and 256 Mizuho Securities; and 7,200 automated teller machines in Japan. The company was founded in 2003 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8176",
        "website": "http://www.mizuho-fg.co.jp",
        "market_cap": "Large Cap"
    },
    "8416.T": {
        "short_name": "BANK OF KOCHI LTD (THE)",
        "long_name": "The Bank Of Kochi, Ltd.",
        "summary": "The Bank Of Kochi, Ltd. provides various banking products and services in Japan. The company offers savings and term deposits; mortgage, education, and car loans; insurance products and services; investment trust services; and cards. It operates 72 branches. The company was founded in 1930 and is headquartered in Kochi, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kochi",
        "zipcode": "780-0834",
        "website": "http://www.kochi-bank.co.jp",
        "market_cap": "Mid Cap"
    },
    "8418.T": {
        "short_name": "YAMAGUCHI FINANCIAL GROUP INC",
        "long_name": "Yamaguchi Financial Group, Inc.",
        "summary": "Yamaguchi Financial Group, Inc., together with its subsidiaries, provides various banking products and services in Japan. It provides securities brokerage, credit card, leasing, consulting, and other services. The company was founded in 2006 and is headquartered in Shimonoseki, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Shimonoseki",
        "zipcode": "750-8603",
        "website": "http://www.ymfg.co.jp",
        "market_cap": "Large Cap"
    },
    "8421.T": {
        "short_name": "SHINKIN CENTRAL BANK NON-CUM PR",
        "long_name": "Shinkin Central Bank",
        "summary": "Shinkin Central Bank, a financial institution, operates as a central bank for Shinkin banks in Japan. The company provides various products and services, such as deposits, debentures, lending, market fund management, trading operations, clearing, and trust services. It also offers securities dealing, brokerage, and underwriting services, as well as securities investment and consulting services; asset management services; guarantees for unsecured personal loans; investment banking, merger and acquisition brokerage, and corporate business consulting services; and data processing services. As of March 31, 2020, the company had 255 banks. Shinkin Central Bank was founded in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0028",
        "website": "http://www.shinkin-central-bank.jp",
        "market_cap": "Large Cap"
    },
    "8521.T": {
        "short_name": "NAGANO BANK",
        "long_name": "The Naganobank, Ltd.",
        "summary": "The Naganobank, Ltd. provides banking products and services to individual and corporate customers in Japan. The company offers current accounts and fund management products, as well as ordinary, settlement, notification, and tax reserve deposits. It also provides business and card, ISO, SME, agricultural support, medical, and other loans; private placement bonds; overdraft root guarantees; credit card related services; and leasing, overseas business support, contribution pension, power consortium, business matching, and collection services. In addition, the company offers corporate life insurance, farm banking, night safe, and financial EDI services. It operates 52 prefecture stores, including 1 branch office; and 1 store in Tokyo, as well as 56 outside store ATMs. The Naganobank, Ltd. was founded in 1950 and is headquartered in Matsumoto, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Matsumoto",
        "zipcode": null,
        "website": "http://www.naganobank.co.jp",
        "market_cap": "Large Cap"
    },
    "8522.T": {
        "short_name": "BANK OF NAGOYA",
        "long_name": "The Bank of Nagoya, Ltd.",
        "summary": "The Bank of Nagoya, Ltd. provides various banking products and financial services in Japan. The company operates through Banking, Leasing, and Credit Card segments. It offers deposits and loans; domestic and foreign exchange transactions; securities investments; trading of trading account securities; and underwriting and registration of corporate bonds. The company also engages in finance leasing, credit card, and clerical outsourcing businesses. As of March 31, 2020, it operated 113 branches. The Bank of Nagoya, Ltd. was founded in 1949 and is based in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "460-0003",
        "website": "http://www.meigin.com",
        "market_cap": "Large Cap"
    },
    "8527.T": {
        "short_name": "AICHI BANK",
        "long_name": "The Aichi Bank, Ltd.",
        "summary": "The Aichi Bank, Ltd., together with its subsidiaries, provides various financial products and services in Japan. It offers deposit products. The company is also involved in the domestic and foreign exchange; securities and leasing; and trust contract agency businesses, as well as over-the-counter sale of investment trusts and life insurance products. It operates through a network of 106 branches. The company was founded in 1910 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "460-8678",
        "website": "http://www.aichibank.co.jp",
        "market_cap": "Large Cap"
    },
    "8530.T": {
        "short_name": "CHUKYO BANK",
        "long_name": "The Chukyo Bank, Limited",
        "summary": "The Chukyo Bank, Limited provides various banking products and services to individual and corporate customers in Japan. The company offers ordinary, savings, time, and foreign currency deposits; housing, mortgage, card, car, education, travel, bridal, dental, hobby, furniture/home appliance, sporting goods purchase, remodeling and eco- remodeling, and multipurpose loans; and individual annuity, whole life, medical, cancer, student insurance products, as well as individual defined contribution pension products. The company also provides management, founding, financing, business matching, and overseas business support services, as well as accounting office work efficiency and forex Web services for corporate customers. In addition, it offers investment trust, government bonds, and financial product brokerage products and services. Further, the company provides Internet banking, pension, fund and Web account transfer, foreign currency exchange and remittance, and safe deposit box services, as well as debit cards. As of September 30, 2020, it operated 87 branches, including 1 Internet branch. The company was incorporated in 1943 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": null,
        "website": "http://www.chukyo-bank.co.jp",
        "market_cap": "Large Cap"
    },
    "8537.T": {
        "short_name": "TAIKO BANK",
        "long_name": "The Taiko Bank,Ltd.",
        "summary": "The Taiko Bank,Ltd. provides various banking products and services in Japan. The company offers loans, credit card and guarantee, general leasing, foreign exchange, and Internet banking services. It operates through a network of 71 branches. The company was founded in 1942 and is headquartered in Nagaoka, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagaoka",
        "zipcode": null,
        "website": "http://www.taikobank.jp",
        "market_cap": "Large Cap"
    },
    "8540.F": {
        "short_name": "FUKUOKA CHUO BANK",
        "long_name": "The Fukuoka Chuo Bank, Ltd.",
        "summary": "The Fukuoka Chuo Bank, Ltd. provides financial services in Japan. The company's deposit products include time deposits and foreign currency deposits; and loan products comprise education, renovation, housing, auto, and apartment loans, as well as real estate secured loans. It also provides mortgage consultation; financing and management consultation; life insurance and non-life insurance; asset management consultation; loan and business consultation; and foreign exchange services. In addition, the company offers debit cards, IC cash cards, and Internet and mobile banking services. It operates through 41 branches. The company was founded in 1951 and is headquartered in Fukuoka, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FKA",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuoka",
        "zipcode": null,
        "website": "http://www.fukuokachuo-bank.co.jp",
        "market_cap": "Mid Cap"
    },
    "8541.T": {
        "short_name": "EHIME BANK",
        "long_name": "The Ehime Bank, Ltd.",
        "summary": "The Ehime Bank, Ltd. provides banking products and financial services in Japan. It offers savings, interest-free-bearing savings, checking, foreign currency savings, notification, automatic savings time, super time, large time, negotiable, certificate of deposit, and foreign currency time deposit products, as well as various loans. The company also provides business support, corporate association/tax accountant collaboration, and shipping and shipbuilding loans; and guarantee/institutional financing and co-financing services. In addition, it offers pension, life, non-life, medical, and cancer insurance products; asset management, fund management, trust agency, and management/business support services, as well as farm and internet banking; and e-net payment collection services. As of March 31, 2020, the company operated through 112 branches. The Ehime Bank, Ltd. was founded in 1915 and is headquartered in Matsuyama, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Matsuyama",
        "zipcode": "790-8580",
        "website": "http://www.himegin.co.jp",
        "market_cap": "Large Cap"
    },
    "8542.T": {
        "short_name": "TOMATO BANK",
        "long_name": "Tomato Bank, Ltd.",
        "summary": "Tomato Bank, Ltd. provides banking products and services for individual and corporate customers in Japan. It accepts saving, time, reserve, foreign currency, and education fund deposits, as well as provides loan products, such as card, housing, car, education, and other loans. The company also offers debit and credit cards; insurance products and services; mutual funds and government bonds; and private placements and guarantees. In addition, it provides pension, investment trust, electronic money charge, foreign currency delivery, payment and transfer, safe deposit box, securities, and Internet and mobile banking services. Further, the company provides management consulting, business support, fund management, and ATM services. It operates through 61 branches. The company was formerly known as Sanyo Mutual Bank, Ltd. and changed its name to Tomato Bank, Ltd. in April 1989. Tomato Bank, Ltd. was founded in 1931 and is headquartered in Okayama, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Okayama",
        "zipcode": "700-0811",
        "website": "http://www.tomatobank.co.jp",
        "market_cap": "Large Cap"
    },
    "8544.T": {
        "short_name": "KEIYO BANK",
        "long_name": "The Keiyo Bank, Ltd.",
        "summary": "The Keiyo Bank, Ltd. offers various banking products and services in Japan. It accepts deposits; and housing and other consumer loans, as well as loans to small and medium-sized companies. The company operates in 284 locations, including 120 branch offices, 2 sub-branches, and 162 ATMs. The Keiyo Bank, Ltd. was founded in 1943 and is headquartered in Chiba, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Chiba",
        "zipcode": "260-0015",
        "website": "http://www.keiyobank.co.jp",
        "market_cap": "Large Cap"
    },
    "8550.T": {
        "short_name": "TOCHIGI BANK",
        "long_name": "The Tochigi Bank, Ltd.",
        "summary": "The Tochigi Bank, Ltd. provides various banking products and services for individual and corporate customers in Japan. It offers various deposits, including ordinary deposits, savings deposits, time deposits, wealth deposits, foreign currency time deposits, and general accounts. The company also provides mortgage loans, housing loans, car loans, and bank card loans; asset management services; and insurance and pension products. It operates through a network of 88 stores and 6 loan plazas; and 347 ATMs in 207 locations. The company was formerly known as Tochigi Mutual Bank Co., Ltd. and changed its name to The Tochigi Bank, Ltd. in 1989. The Tochigi Bank, Ltd. was founded in 1945 and is headquartered in Utsunomiya, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Utsunomiya",
        "zipcode": null,
        "website": "http://www.tochigibank.co.jp",
        "market_cap": "Large Cap"
    },
    "8551.T": {
        "short_name": "KITA-NIPPON BANK",
        "long_name": "The Kita-Nippon Bank, Ltd.",
        "summary": "The Kita-Nippon Bank, Ltd., together with its subsidiaries, provides commercial banking products and services in Japan. The company accepts various deposits; and offers business, housing, and other loans. It also provides credit cards; and credit guarantee, leasing and financing, computer, software development, and software sale services. As of March 31, 2020, the company had 77 offices in Iwate Prefecture. The Kita-Nippon Bank, Ltd. was founded in 1942 and is headquartered in Morioka, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Morioka",
        "zipcode": "020-8666",
        "website": "http://www.kitagin.co.jp",
        "market_cap": "Large Cap"
    },
    "8554.F": {
        "short_name": "MINAMI-NIPPON BANK",
        "long_name": "The Minami-Nippon Bank,Ltd.",
        "summary": "The Minami-Nippon Bank,Ltd. provides various banking products and services to individual and corporate customers in Japan. The company accepts savings, ordinary, time, and reserve time, periodic, and foreign currency deposits; and certificates of deposit. Its loan products include card, free, car, education, and business loans. The company also offers investment trusts and government bonds; life and non-life insurance, and pension products; cash and debit cards; payroll transfer/automatic pension receipt; online fund transfer; and other services, as well as rating agency, fund management, security, and internet and mobile banking services. In addition, it provides leasing; and transport and security services. The company operates 64 branches. The Minami-Nippon Bank,Ltd. was founded in 1913 and is headquartered in Kagoshima, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FKA",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kagoshima",
        "zipcode": null,
        "website": "http://nangin.jp",
        "market_cap": "Mid Cap"
    },
    "8558.T": {
        "short_name": "TOWA BANK",
        "long_name": "The Towa Bank, Ltd.",
        "summary": "The Towa Bank, Ltd. provides various banking products and services. The company was founded in 1917 and is based in Maebashi, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Maebashi",
        "zipcode": null,
        "website": "http://www.towabank.co.jp",
        "market_cap": "Large Cap"
    },
    "8559.F": {
        "short_name": "HOWA BANK",
        "long_name": "The Howa Bank, Ltd.",
        "summary": "The Howa Bank,Ltd. provides various banking products and services to individuals and businesses in Japan. It offers time deposits, mutual funds, and government bonds; housing, reform, card, education, and auto loans; and personal pension, one-time lifetime, life, medical, and fire insurance products. The Howa Bank,Ltd. was founded in 1948 and is based in Oita, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FKA",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Oita",
        "zipcode": null,
        "website": "http://www.howabank.co.jp",
        "market_cap": "Mid Cap"
    },
    "8560.F": {
        "short_name": "MIYAZAKI TAIYO BANK",
        "long_name": "The Miyazaki Taiyo Bank, Ltd.",
        "summary": "The Miyazaki Taiyo Bank, Ltd. provides various banking products and services for individual and corporate customers primarily in Japan. The company operates through Banking, and Lease and Guarantee Business segments. It offers deposit, lending, domestic exchange, foreign exchange, and other incidental business services. The company also provides comprehensive leasing and guarantee services, such as personal loans, as well as engages in the venture capital business. It operates through 52 branches. The company was formerly known as K.K. Miyazaki Sogo Ginko and changed its name to The Miyazaki Taiyo Bank, Ltd. in February 1989. The Miyazaki Taiyo Bank, Ltd. was founded in 1941 and is headquartered in Miyazaki, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FKA",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Miyazaki",
        "zipcode": null,
        "website": "http://www.taiyobank.co.jp",
        "market_cap": "Mid Cap"
    },
    "8562.T": {
        "short_name": "FUKUSHIMA BANK",
        "long_name": "The Fukushima Bank, Ltd.",
        "summary": "The Fukushima Bank, Ltd. provides various banking products and services to individual and corporate customers in Japan. The company accepts time deposits; and offers housing, car, remodelling, card, simulation, education, and business loans, as well as provides loans for women and pensioners. It also provides investment trust and insurance products; and foreign currency, ATM, safe deposit box, and Internet banking services. In addition, the company leases and sells construction equipment, work equipment, transportation equipment, communication equipment, office equipment, household electrical equipment, medical equipment, precision machinery, etc. Further, it is involved in the credit card and credit guarantee activities; the development, maintenance, and contracting of computer software; the sale and rental of computer software, and computers and related equipment, as well as related consumables; and the operation and contracting of computer systems. The company was founded in 1922 and is headquartered in Fukushima, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukushima",
        "zipcode": null,
        "website": "http://www.fukushimabank.co.jp",
        "market_cap": "Mid Cap"
    },
    "8563.T": {
        "short_name": "DAITO BANK",
        "long_name": "The Daito Bank, Ltd.",
        "summary": "The Daito Bank, Ltd. provides various banking products and services to individual and corporate customers in Japan. The company accepts time, savings, and foreign currency deposits; and offers mutual fund and government bonds. It also provides housing, car, education, card, free, expansion and renovation, and business and institutional loans; and pension and insurance, as well as financial product brokerage, investment trust, web account transfer reception, online payment/electronic money charge, and pay-easy fund transfer reception services. In addition, the company offers credit and debit cards, mail orders, safe-deposit boxes, and credit guarantees, as well as foreign currency exchange, automatic remittance, ATM, and Internet banking services. It operates through 58 branches. The company was formerly known as Daito Mutual Bank and changed its name to The Daito Bank, Ltd. in 1989. The Daito Bank, Ltd. was founded in 1942 and is headquartered in Koriyama, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Koriyama",
        "zipcode": "963-8004",
        "website": "http://www.daitobank.co.jp",
        "market_cap": "Mid Cap"
    },
    "8713.T": {
        "short_name": "FIDEA HOLDINGS CO LTD",
        "long_name": "FIDEA Holdings Co. Ltd.",
        "summary": "FIDEA Holdings Co. Ltd., through its subsidiaries, provides various banking products and services in Japan. The company was founded in 1878 and is headquartered in Sendai, Japan.",
        "currency": "JPY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sendai",
        "zipcode": "980-0021",
        "website": "http://www.fidea.co.jp",
        "market_cap": "Large Cap"
    },
    "AON.F": {
        "short_name": "AOZORA BANK LTD",
        "long_name": "Aozora Bank, Ltd.",
        "summary": "Aozora Bank, Ltd., together with its subsidiaries, provides various banking products and services in Japan and internationally. It operates through Retail Banking Group, Institutional Banking Group, Allied Banking Group, Specialty Finance Group, International Finance Group, and Financial Markets Group segments. The company offers checking accounts, savings accounts, time deposits, deposits-at-notice, non-residents deposits, and negotiable certificates of deposit, as well as deposits in foreign currencies. It also provides loans on deeds, loans on notes, and overdrafts; discount on promissory notes; securities investments, including public, local, and corporate bonds, as well as equity and other securities; domestic and foreign exchange services; and consignment of bonds. In addition, the company offers liabilities guarantee, securities lending, public bonds underwriting, agency, custody, and financial instruments intermediary services. Further, it is involved in the over-the-counter sale of securities investment trusts and insurance products; and provision of trust services for secured corporate bonds, as well as interest rate, currency, and other derivative transaction services. Additionally, the company offers asset management consultation, merger and acquisition advisory, business succession, acquisition and project financing, and equity financing through private equity fund services; syndicated loans arrangements; asset securitization, real estate finance and business recovery finance, and corporate finance services; project financing services in the areas of shipping and trade; other structured finance services; and derivative products and trust services. As of March 31, 2020, it operated 20 domestic offices. The company was formerly known as Nippon Fudosan Bank, Limited and changed its name to Aozora Bank, Ltd. in 2001. Aozora Bank, Ltd. was founded in 1957 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-8660",
        "website": "http://www.aozorabank.co.jp",
        "market_cap": "Mid Cap"
    },
    "AOZOY": {
        "short_name": "AOZORA BANK",
        "long_name": "Aozora Bank, Ltd.",
        "summary": "Aozora Bank, Ltd., together with its subsidiaries, provides various banking products and services in Japan and internationally. It operates through Retail Banking Group, Institutional Banking Group, Allied Banking Group, Specialty Finance Group, International Finance Group, and Financial Markets Group segments. The company offers checking accounts, savings accounts, time deposits, deposits-at-notice, non-residents deposits, and negotiable certificates of deposit, as well as deposits in foreign currencies. It also provides loans on deeds, loans on notes, and overdrafts; discount on promissory notes; securities investments, including public, local, and corporate bonds, as well as equity and other securities; domestic and foreign exchange services; and consignment of bonds. In addition, the company offers liabilities guarantee, securities lending, public bonds underwriting, agency, custody, and financial instruments intermediary services. Further, it is involved in the over-the-counter sale of securities investment trusts and insurance products; and provision of trust services for secured corporate bonds, as well as interest rate, currency, and other derivative transaction services. Additionally, the company offers asset management consultation, merger and acquisition advisory, business succession, acquisition and project financing, and equity financing through private equity fund services; syndicated loans arrangements; asset securitization, real estate finance and business recovery finance, and corporate finance services; project financing services in the areas of shipping and trade; other structured finance services; and derivative products and trust services. As of March 31, 2020, it operated 20 domestic offices. The company was formerly known as Nippon Fudosan Bank, Limited and changed its name to Aozora Bank, Ltd. in 2001. Aozora Bank, Ltd. was founded in 1957 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-8660",
        "website": "http://www.aozorabank.co.jp",
        "market_cap": "Mid Cap"
    },
    "BKY.F": {
        "short_name": "BK OF KYOTO LTD",
        "long_name": "The Bank of Kyoto, Ltd.",
        "summary": "The Bank of Kyoto, Ltd., together with its subsidiaries, provides various banking services for individuals and corporations in Japan. It accepts various deposits, such as current, ordinary, savings, time, and other deposits, as well as deposits at notice and negotiable certificates of deposit; and offers lending services. The company also provides securities investment, domestic and foreign exchange, research and business consulting, securities trading services, etc.; and other financial services, such as credit guarantees, leasing and investment, and credit card services, as well as financial intermediary services. It operates 174 branches in Kyoto, Osaka, Shiga, Nara, Hyogo, Aichi, Tokyo, and other prefectures. The Bank of Kyoto, Ltd. was founded in 1941 and is headquartered in Kyoto, Japan.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "600-8652",
        "website": "http://www.kyotobank.co.jp",
        "market_cap": "Mid Cap"
    },
    "CMTDF": {
        "short_name": "SUMITOMO MITSUI TRUST HOLDINGS ",
        "long_name": "Sumitomo Mitsui Trust Holdings, Inc.",
        "summary": "Sumitomo Mitsui Trust Holdings, Inc. operates as a trust bank in Japan and internationally. It offers retail services, such as asset management, inheritance and succession, mortgage loans, and installment-type products and insurance products; and wholesale services, including loans and financing schemes, corporate consultations, and M&A advisory services. The company also provides property administration and alliance services; and stock and shareholders meetings, IPO, investor and capital strategies, and governance enhancement consulting services. In addition, it offers real estate brokerage and consulting, management and administration, infrastructure, and other services; fiduciary services comprising pensions, asset management, and asset administration; and global markets services. The company was formerly known as Chuo Mitsui Trust Holdings, Inc. and changed its name to Sumitomo Mitsui Trust Holdings, Inc. in 2011. Sumitomo Mitsui Trust Holdings, Inc. was founded in 2002 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8233",
        "website": "http://www.smth.jp",
        "market_cap": "Large Cap"
    },
    "DW1.F": {
        "short_name": "RESONA HOLDINGS INC.",
        "long_name": "Resona Holdings, Inc.",
        "summary": "Resona Holdings, Inc., through its subsidiaries, provides banking products and services in Japan and internationally. It operates through Consumer Banking, Corporate Banking, and Market Trading segments. The company engages in the short term lending, borrowing, bond purchase and sale, and derivatives trading activities; and provides various services related to corporate loan, trust asset management, real estate business, corporate pension, and asset succession. It also offers banking and trust banking, credit guarantee, collection of bills and receivables, factoring, and credit card administration and guarantee facilities. In addition, the company is involved in the private equity and financing businesses; and provision of business consulting and investment management, business process outsourcing and placement, general leasing, and system development services. It serves individuals and corporate customers. As of March 31, 2020, the company operated 833 branches. Resona Holdings, Inc. was founded in 1918 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "135-8582",
        "website": "http://www.resona-gr.co.jp",
        "market_cap": "Mid Cap"
    },
    "HACBY": {
        "short_name": "HACHIJUNI BANK",
        "long_name": "The Hachijuni Bank, Ltd.",
        "summary": "The Hachijuni Bank, Ltd. provides various banking products and services. It accepts various deposits; and provides loan products. As of March 31, 2019, the company operated 167 branches in Japan; 1 overseas branch in Hong Kong; and 4 representative offices in Dalian, Shanghai, Bangkok, and Singapore. The Hachijuni Bank, Ltd. was founded in 1931 and is based in Nagano, Japan.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Nagano",
        "zipcode": "380-8682",
        "website": "http://www.82bank.co.jp",
        "market_cap": "Small Cap"
    },
    "JPHLF": {
        "short_name": "JAPAN POST HLDGS CO LTD",
        "long_name": "Japan Post Holdings Co., Ltd.",
        "summary": "Japan Post Holdings Co., Ltd., through its subsidiaries, provides postal, banking, and insurance services in Japan. It operates through Postal and Domestic Logistics, Post Office, International Logistics, Banking, Life Insurance, and Other segments. The company engages in the postal, banking counter, and insurance counter operations; sale of documentary stamps, petroleum, and catalog products; operations consigned by local government entities; and provision of other bank, and life and non-life insurance agency services. It also provides distribution and delivery; and merchandise sale services, as well as international cargo transport and agency services. In addition, the company offers Yu-Pack, Yu-Mail, and other parcel delivery; deposits, securities investment, remittances, credit card, and personal loans; road, rail, ship, and air transportation; freight forwarding and other logistics; and asset management services. Further, it provides truck cargo transportation, automobile and machinery maintenance, vehicle maintenance and management, post office advertisements posting, facilities management, automobile liability insurance agency, alcohol agency, 3PL, and express services. Additionally, it provides temporary staffing, contracting, office cleaning, hotel management, communication network maintenance and management, investment, financial and management consulting, and telemarketing services. The company also engages in the planning, development, and sale of direct mail and contracted shipment of merchandise; property management for commercial buildings; and commissioning of design, development, maintenance, and operation of information systems. In addition, it owns, leases, and manages real estate; develops residential and commercial land; consults, plans and develops business systems and basic technologies; and operates 3 Teishin hospitals, MIELPARQUE hotels, and 35 Kanpo no Yado inns in Japan. The company was founded in 1871 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8791",
        "website": "http://www.japanpost.jp",
        "market_cap": "Large Cap"
    },
    "JPPHY": {
        "short_name": "JAPAN POST HLDGS CO LTD",
        "long_name": "Japan Post Holdings Co., Ltd.",
        "summary": "Japan Post Holdings Co., Ltd., through its subsidiaries, provides postal, banking, and insurance services in Japan. It operates through Postal and Domestic Logistics, Post Office, International Logistics, Banking, Life Insurance, and Other segments. The company engages in the postal, banking counter, and insurance counter operations; sale of documentary stamps, petroleum, and catalog products; operations consigned by local government entities; and provision of other bank, and life and non-life insurance agency services. It also provides distribution and delivery; and merchandise sale services, as well as international cargo transport and agency services. In addition, the company offers Yu-Pack, Yu-Mail, and other parcel delivery; deposits, securities investment, remittances, credit card, and personal loans; road, rail, ship, and air transportation; freight forwarding and other logistics; and asset management services. Further, it provides truck cargo transportation, automobile and machinery maintenance, vehicle maintenance and management, post office advertisements posting, facilities management, automobile liability insurance agency, alcohol agency, 3PL, and express services. Additionally, it provides temporary staffing, contracting, office cleaning, hotel management, communication network maintenance and management, investment, financial and management consulting, and telemarketing services. The company also engages in the planning, development, and sale of direct mail and contracted shipment of merchandise; property management for commercial buildings; and commissioning of design, development, maintenance, and operation of information systems. In addition, it owns, leases, and manages real estate; develops residential and commercial land; consults, plans and develops business systems and basic technologies; and operates 3 Teishin hospitals, MIELPARQUE hotels, and 35 Kanpo no Yado inns in Japan. The company was founded in 1871 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8791",
        "website": "http://www.japanpost.jp",
        "market_cap": "Large Cap"
    },
    "LCJ.F": {
        "short_name": "SHINSEI BANK",
        "long_name": "Shinsei Bank, Limited",
        "summary": "Shinsei Bank, Limited provides various banking and financial products and services to individual customers, businesses, public corporations, and financial institutions in Japan. It offers Yen/foreign currency deposits, and structured deposits; home mortgages; and housing and unsecured loans, real estate related nonrecourse finance and corporate finance, ship finance, healthcare, and project finance, specialty finance, M&A-related, and renewable energy finance. The company also provides investment trusts, brokerage, life and non-life insurance, advisory, credit trading, private equity, business succession finance, and asset-backed investment services, as well as credit cards. In addition, it engages in the provision of financial transactions and services for individuals; trust businesses; foreign exchange, derivatives, equity-related, and other capital markets businesses; payment services; and securities, asset management, and wealth management businesses. The company was formerly known as The Long-Term Credit Bank of Japan, Limited and changed its name to Shinsei Bank, Limited in June 2000. Shinsei Bank, Limited was incorporated in 1952 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8303",
        "website": "http://www.shinseibank.com",
        "market_cap": "Mid Cap"
    },
    "MFG": {
        "short_name": "Mizuho Financial Group, Inc. Sp",
        "long_name": "Mizuho Financial Group, Inc.",
        "summary": "Mizuho Financial Group, Inc., together with its subsidiaries, engages in banking, trust, securities, and other businesses related to financial services in Japan, the Americas, Europe, Asia/Oceania, and internationally. It operates through five segments: Retail & Business Banking Company, Corporate & Institutional Company, Global Corporate Company, Global Markets Company, and Asset Management Company. The company provides deposit products; syndicated, housing, and card loans; business matching services; and advisory services related to overseas expansions, and mergers and acquisitions-related services. It also offers consulting services, including asset management and asset succession; payroll services; and sells lottery tickets issued by prefectures and ordinance-designated cities. In addition, it offers financial solutions, such as fund management, underwriting of equity and bonds, M&A advisory, and risk hedging products, etc. for corporate customers to meet their needs in fund-raising, investment management, and financial strategies; solutions based on their capital management, business strategy, and financial strategy; solutions related to real estate; advisory services and solutions, such as advice on proposals on various investment products; and financial services that include funding support. Further, the company offers sales and trading services to meet risk hedging and investment needs; investment products for individual customers; and consulting services for institutional investors. Additionally, the company provides products and services related to trust, securitization and structured finance, pension, and stock transfers; securities services; and research, private banking, and information technology-related services. As of March 31, 2020, its branch network included 464 Mizuho Bank, 60 Mizuho Trust and Banking, and 256 Mizuho Securities; and 7,200 automated teller machines in Japan. The company was founded in 2003 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8176",
        "website": "http://www.mizuho-fg.co.jp",
        "market_cap": "Large Cap"
    },
    "MIU.F": {
        "short_name": "SUMITOMO MITSUI TR.HLDGS",
        "long_name": "Sumitomo Mitsui Trust Holdings, Inc.",
        "summary": "Sumitomo Mitsui Trust Holdings, Inc. operates as a trust bank in Japan and internationally. It offers retail services, such as asset management, inheritance and succession, mortgage loans, and installment-type products and insurance products; and wholesale services, including loans and financing schemes, corporate consultations, and M&A advisory services. The company also provides property administration and alliance services; and stock and shareholders meetings, IPO, investor and capital strategies, and governance enhancement consulting services. In addition, it offers real estate brokerage and consulting, management and administration, infrastructure, and other services; fiduciary services comprising pensions, asset management, and asset administration; and global markets services. The company was formerly known as Chuo Mitsui Trust Holdings, Inc. and changed its name to Sumitomo Mitsui Trust Holdings, Inc. in 2011. Sumitomo Mitsui Trust Holdings, Inc. was incorporated in 2002 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8233",
        "website": "http://www.smth.jp",
        "market_cap": "Large Cap"
    },
    "MZ8.F": {
        "short_name": "MIZUHO FINL GROUP",
        "long_name": "Mizuho Financial Group, Inc.",
        "summary": "Mizuho Financial Group, Inc., together with its subsidiaries, engages in banking, trust, securities, and other businesses related to financial services in Japan, the Americas, Europe, Asia/Oceania, and internationally. It operates through five segments: Retail & Business Banking Company, Corporate & Institutional Company, Global Corporate Company, Global Markets Company, and Asset Management Company. The company provides deposit products; syndicated, housing, and card loans; business matching services; and advisory services related to overseas expansions, and mergers and acquisitions-related services. It also offers consulting services, including asset management and asset succession; payroll services; and sells lottery tickets issued by prefectures and ordinance-designated cities. In addition, it offers financial solutions, such as fund management, underwriting of equity and bonds, M&A advisory, and risk hedging products, etc. for corporate customers to meet their needs in fund-raising, investment management, and financial strategies; solutions based on their capital management, business strategy, and financial strategy; solutions related to real estate; advisory services and solutions, such as advice on proposals on various investment products; and financial services that include funding support. Further, the company offers sales and trading services to meet risk hedging and investment needs; investment products for individual customers; and consulting services for institutional investors. Additionally, the company provides products and services related to trust, securitization and structured finance, pension, and stock transfers; securities services; and research, private banking, and information technology-related services. As of March 31, 2020, its branch network included 464 Mizuho Bank, 60 Mizuho Trust and Banking, and 256 Mizuho Securities; and 7,200 automated teller machines in Japan. The company was founded in 2003 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8176",
        "website": "http://www.mizuho-fg.co.jp",
        "market_cap": "Large Cap"
    },
    "MZ8A.F": {
        "short_name": "MIZUHO FINL GR. ADR/0,2",
        "long_name": "Mizuho Financial Group, Inc.",
        "summary": "Mizuho Financial Group, Inc., together with its subsidiaries, engages in banking, trust, securities, and other businesses related to financial services in Japan, the Americas, Europe, Asia/Oceania, and internationally. It operates through five segments: Retail & Business Banking Company, Corporate & Institutional Company, Global Corporate Company, Global Markets Company, and Asset Management Company. The company provides deposit products; syndicated, housing, and card loans; business matching services; and advisory services related to overseas expansions, and mergers and acquisitions-related services. It also offers consulting services, including asset management and asset succession; payroll services; and sells lottery tickets issued by prefectures and ordinance-designated cities. In addition, it offers financial solutions, such as fund management, underwriting of equity and bonds, M&A advisory, and risk hedging products, etc. for corporate customers to meet their needs in fund-raising, investment management, and financial strategies; solutions based on their capital management, business strategy, and financial strategy; solutions related to real estate; advisory services and solutions, such as advice on proposals on various investment products; and financial services that include funding support. Further, the company offers sales and trading services to meet risk hedging and investment needs; investment products for individual customers; and consulting services for institutional investors. Additionally, the company provides products and services related to trust, securitization and structured finance, pension, and stock transfers; securities services; and research, private banking, and information technology-related services. As of March 31, 2020, its branch network included 464 Mizuho Bank, 60 Mizuho Trust and Banking, and 256 Mizuho Securities; and 7,200 automated teller machines in Japan. The company was founded in 2003 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8176",
        "website": "http://www.mizuho-fg.co.jp",
        "market_cap": "Large Cap"
    },
    "MZ8A.SG": {
        "short_name": "Mizuho Financial Group Inc. Reg",
        "long_name": "Mizuho Financial Group, Inc.",
        "summary": "Mizuho Financial Group, Inc., together with its subsidiaries, engages in banking, trust, securities, and other businesses related to financial services in Japan, the Americas, Europe, Asia/Oceania, and internationally. It operates through five segments: Retail & Business Banking Company, Corporate & Institutional Company, Global Corporate Company, Global Markets Company, and Asset Management Company. The company provides deposit products; syndicated, housing, and card loans; business matching services; and advisory services related to overseas expansions, and mergers and acquisitions-related services. It also offers consulting services, including asset management and asset succession; payroll services; and sells lottery tickets issued by prefectures and ordinance-designated cities. In addition, it offers financial solutions, such as fund management, underwriting of equity and bonds, M&A advisory, and risk hedging products, etc. for corporate customers to meet their needs in fund-raising, investment management, and financial strategies; solutions based on their capital management, business strategy, and financial strategy; solutions related to real estate; advisory services and solutions, such as advice on proposals on various investment products; and financial services that include funding support. Further, the company offers sales and trading services to meet risk hedging and investment needs; investment products for individual customers; and consulting services for institutional investors. Additionally, the company provides products and services related to trust, securitization and structured finance, pension, and stock transfers; securities services; and research, private banking, and information technology-related services. As of March 31, 2020, its branch network included 464 Mizuho Bank, 60 Mizuho Trust and Banking, and 256 Mizuho Securities; and 7,200 automated teller machines in Japan. The company was founded in 2003 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8176",
        "website": "http://www.mizuho-fg.co.jp",
        "market_cap": "Large Cap"
    },
    "MZHOF": {
        "short_name": "MIZUHO FINANCIAL GROUP",
        "long_name": "Mizuho Financial Group, Inc.",
        "summary": "Mizuho Financial Group, Inc., together with its subsidiaries, engages in banking, trust, securities, and other businesses related to financial services in Japan, the Americas, Europe, Asia/Oceania, and internationally. It operates through five segments: Retail & Business Banking Company, Corporate & Institutional Company, Global Corporate Company, Global Markets Company, and Asset Management Company. The company provides deposit products; syndicated, housing, and card loans; business matching services; and advisory services related to overseas expansions, and mergers and acquisitions-related services. It also offers consulting services, including asset management and asset succession; payroll services; and sells lottery tickets issued by prefectures and ordinance-designated cities. In addition, it offers financial solutions, such as fund management, underwriting of equity and bonds, M&A advisory, and risk hedging products, etc. for corporate customers to meet their needs in fund-raising, investment management, and financial strategies; solutions based on their capital management, business strategy, and financial strategy; solutions related to real estate; advisory services and solutions, such as advice on proposals on various investment products; and financial services that include funding support. Further, the company offers sales and trading services to meet risk hedging and investment needs; investment products for individual customers; and consulting services for institutional investors. Additionally, the company provides products and services related to trust, securitization and structured finance, pension, and stock transfers; securities services; and research, private banking, and information technology-related services. As of March 31, 2020, its branch network included 464 Mizuho Bank, 60 Mizuho Trust and Banking, and 256 Mizuho Securities; and 7,200 automated teller machines in Japan. The company was founded in 2003 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8176",
        "website": "http://www.mizuho-fg.co.jp",
        "market_cap": "Large Cap"
    },
    "RSNHF": {
        "short_name": "RESONA HOLDINGS",
        "long_name": "Resona Holdings, Inc.",
        "summary": "Resona Holdings, Inc., through its subsidiaries, provides banking products and services in Japan and internationally. It operates through Consumer Banking, Corporate Banking, and Market Trading segments. The company engages in the short term lending, borrowing, bond purchase and sale, and derivatives trading activities; and provides various services related to corporate loan, trust asset management, real estate business, corporate pension, and asset succession. It also offers banking and trust banking, credit guarantee, collection of bills and receivables, factoring, and credit card administration and guarantee facilities. In addition, the company is involved in the private equity and financing businesses; and provision of business consulting and investment management, business process outsourcing and placement, general leasing, and system development services. It serves individuals and corporate customers. As of March 31, 2020, the company operated 833 branches. Resona Holdings, Inc. was founded in 1918 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "135-8582",
        "website": "http://www.resona-gr.co.jp",
        "market_cap": "Mid Cap"
    },
    "SHZUY": {
        "short_name": "SHIZUOKA BANK",
        "long_name": "The Shizuoka Bank, Ltd.",
        "summary": "The Shizuoka Bank, Ltd., a regional bank, provides various banking products and services. The company operates through Banking Operations and Leasing Operations segments. The Banking Operations segment consist of the banking business centered on deposits, loans, investment securities, and exchange transactions. The Leasing Operations segment includes lease transactions centered on finance leases. It also provides corporate and financial management advisory, bill collection, leasing, and finance and securities-related services. In addition, the company engages in the guarantee of housing loans, credit cards and prepaid cards, and consumer loans; development and operation of computer systems; provision of public-offering assistance support for corporate rehabilitation, and fee-based job placement and general administration services; and appraisal of real estate for loan collateral, as well as operation of centers for loans, remittance, and bill collection. Further, it is involved in the provision of part-time employee management, finance and securities-related, and monetary receivables purchasing services; and making, printing and binding of documents. As of July 1, 2020, the company operated a head office, 177 branches, and 27 sub-branches in Shizuoka Prefecture, Tokyo, Osaka, and Nagoya; 2 branches in New York and Los Angeles; 1 in Europe; and 1 branch in Hong Kong, as well as 2 representative offices in Shanghai and Singapore. The Shizuoka Bank, Ltd. was founded in 1943 and is headquartered in Shizuoka, Japan.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Shizuoka",
        "zipcode": "424-8677",
        "website": "http://www.shizuokabank.co.jp",
        "market_cap": "Mid Cap"
    },
    "SKLKF": {
        "short_name": "SHINSEI BANK",
        "long_name": "Shinsei Bank, Limited",
        "summary": "Shinsei Bank, Limited provides various banking and financial products and services to individual customers, businesses, public corporations, and financial institutions in Japan. It offers Yen/foreign currency deposits, and structured deposits; home mortgages; and housing and unsecured loans, real estate related nonrecourse finance and corporate finance, ship finance, healthcare, and project finance, specialty finance, M&A-related, and renewable energy finance. The company also provides investment trusts, brokerage, life and non-life insurance, advisory, credit trading, private equity, business succession finance, and asset-backed investment services, as well as credit cards. In addition, it engages in the provision of financial transactions and services for individuals; trust businesses; foreign exchange, derivatives, equity-related, and other capital markets businesses; payment services; and securities, asset management, and wealth management businesses. The company was formerly known as The Long-Term Credit Bank of Japan, Limited and changed its name to Shinsei Bank, Limited in June 2000. Shinsei Bank, Limited was incorporated in 1952 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8303",
        "website": "http://www.shinseibank.com",
        "market_cap": "Mid Cap"
    },
    "SKLKY": {
        "short_name": "SHINSEI BANK",
        "long_name": "Shinsei Bank, Limited",
        "summary": "Shinsei Bank, Limited provides various banking and financial products and services to individual customers, businesses, public corporations, and financial institutions in Japan. It offers Yen/foreign currency deposits, and structured deposits; home mortgages; and housing and unsecured loans, real estate related nonrecourse finance and corporate finance, ship finance, healthcare, and project finance, specialty finance, M&A-related, and renewable energy finance. The company also provides investment trusts, brokerage, life and non-life insurance, advisory, credit trading, private equity, business succession finance, and asset-backed investment services, as well as credit cards. In addition, it engages in the provision of financial transactions and services for individuals; trust businesses; foreign exchange, derivatives, equity-related, and other capital markets businesses; payment services; and securities, asset management, and wealth management businesses. The company was formerly known as The Long-Term Credit Bank of Japan, Limited and changed its name to Shinsei Bank, Limited in June 2000. Shinsei Bank, Limited was incorporated in 1952 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8303",
        "website": "http://www.shinseibank.com",
        "market_cap": "Mid Cap"
    },
    "SUGBY": {
        "short_name": "SURUGA BANK",
        "long_name": "Suruga Bank Ltd.",
        "summary": "Suruga Bank Ltd. provides various banking and financial products and services to individuals and corporate customers in Japan. The company offers deposit products, such as time, ordinary, savings, foreign currency, and other deposits, as well as current and general accounts; card, housing, second house, resort, startup, project assistance, and business up term loans, as well as loans by purpose; credit and debit cards; and overdrafts and other financing products. It also provides investment trust, public bond, pension contribution, insurance, inheritance/trust, lottery, foreign currency exchange reservation, pay-easy, Web oral receipt, safe deposit box, external linkage, foreign remittance, fund management, e-combination, payment, nursing care/medical care/dispensing compensation receivable factoring, mortgage, and Internet and telephone banking services. In addition, the company offers staffing, money lending and credit guarantee, mortgage loans guarantee, printing, bookbinding, packing and shipping, leasing, and clerical agency and system engineering services. It operates through a network of 128 branches in Japan. The company was founded in 1895 and is headquartered in Numazu, Japan.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Numazu",
        "zipcode": "410-8689",
        "website": "http://www.surugabank.co.jp",
        "market_cap": "Small Cap"
    },
    "SUTNY": {
        "short_name": "SUMITOMO MITSUI TRUST HOLDINGS ",
        "long_name": "Sumitomo Mitsui Trust Holdings, Inc.",
        "summary": "Sumitomo Mitsui Trust Holdings, Inc. operates as a trust bank in Japan and internationally. It offers retail services, such as asset management, inheritance and succession, mortgage loans, and installment-type products and insurance products; and wholesale services, including loans and financing schemes, corporate consultations, and M&A advisory services. The company also provides property administration and alliance services; and stock and shareholders meetings, IPO, investor and capital strategies, and governance enhancement consulting services. In addition, it offers real estate brokerage and consulting, management and administration, infrastructure, and other services; fiduciary services comprising pensions, asset management, and asset administration; and global markets services. The company was formerly known as Chuo Mitsui Trust Holdings, Inc. and changed its name to Sumitomo Mitsui Trust Holdings, Inc. in 2011. Sumitomo Mitsui Trust Holdings, Inc. was founded in 2002 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8233",
        "website": "http://www.smth.jp",
        "market_cap": "Large Cap"
    },
    "SVNBY": {
        "short_name": "SEVEN BANK LTD",
        "long_name": "Seven Bank, Ltd.",
        "summary": "Seven Bank, Ltd. provides various banking products and services to individual and corporate customers in Japan and internationally. It accepts accounts, and ordinary and time deposits; and offers personal loans, as well as debit and credit card, debit, money transfer, Internet banking, ATM, and other services. The company also provides back-office support services for financial institutions. It operates through 25,152 installed ATMs in Japan; 10,886 installed ATMs in the United States; and 200 installed ATMs in Indonesia. The company was founded in 2001 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.sevenbank.co.jp",
        "market_cap": "Mid Cap"
    },
    "URU.F": {
        "short_name": "SURUGA BK",
        "long_name": "Suruga Bank Ltd.",
        "summary": "Suruga Bank Ltd. provides various banking and financial products and services to individuals and corporate customers in Japan. The company offers deposit products, such as time, ordinary, savings, foreign currency, and other deposits, as well as current and general accounts; card, housing, second house, resort, startup, project assistance, and business up term loans, as well as loans by purpose; credit and debit cards; and overdrafts and other financing products. It also provides investment trust, public bond, pension contribution, insurance, inheritance/trust, lottery, foreign currency exchange reservation, pay-easy, Web oral receipt, safe deposit box, external linkage, foreign remittance, fund management, e-combination, payment, nursing care/medical care/dispensing compensation receivable factoring, mortgage, and Internet and telephone banking services. In addition, the company offers staffing, money lending and credit guarantee, mortgage loans guarantee, printing, bookbinding, packing and shipping, leasing, and clerical agency and system engineering services. It operates through a network of 128 branches in Japan. The company was founded in 1895 and is headquartered in Numazu, Japan.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Numazu",
        "zipcode": "410-8689",
        "website": "http://www.surugabank.co.jp",
        "market_cap": "Small Cap"
    },
    "YC3.F": {
        "short_name": "CONCORDIA FINL GROUP",
        "long_name": "Concordia Financial Group, Ltd.",
        "summary": "Concordia Financial Group, Ltd., through its subsidiaries, provides various banking products and services to small and medium-sized businesses and individuals. It offers various deposit and loan products. The company also provides securities, leasing, survey research and other information, venture capital, and other financial services. It operates through a network of branches, sub-branches, ATMs, and representative offices in Japan and internationally. Concordia Financial Group, Ltd. was founded in 2016 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-6034",
        "website": "http://www.concordia-fg.jp",
        "market_cap": "Mid Cap"
    }
}