{
    "0H9.F": {
        "short_name": "SEIBU HOLDINGS INC.",
        "long_name": "Seibu Holdings Inc.",
        "summary": "Seibu Holdings Inc. engages in the urban and regional transportation, hotel and leisure, real estate, construction, and other businesses in Japan and internationally. It operates through Urban Transportation and Regional, Hotel and Leisure, Real Estate, Construction, Hawaii Business, and Other Business segments. The company offers railway, bus, and taxi transportation services; operates hotels, golf courses, ski resorts, and leisure facilities; develops Seibu Railway lines and hotel sites in city centers; leases office and residential facilities; and develops and operates stores in train stations, shopping malls, and other commercial facilities. It is also involved in the construction of railway lines, social infrastructure, hotel remodeling, private sector construction, and housing. In addition, the company produces, processes, and sells gravel, sand, and other raw materials used in civil engineering and construction projects; designs and executes landscaping projects; and maintains and operates state-run parks. Further, the company operates express ways and cruise ships; and maintains a professional baseball team. Additionally, the company offers housekeeping, child-rearing support, home, urban development, and other services; and insurance products, as well as builds cemeteries. The company operates a network of 47 hotels. Seibu Holdings Inc. was founded in 2006 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "171-0022",
        "website": "http://www.seibuholdings.co.jp",
        "full_time_employees": 23504
    },
    "1417.T": {
        "short_name": "MIRAIT HLDG CORP",
        "long_name": "MIRAIT Holdings Corporation",
        "summary": "MIRAIT Holdings Corporation engages in the telecommunications engineering, electrical, civil engineering, and construction works in Japan. It is involved in the various activities, including cloud computing, smart office solution, and Wi-Fi solution engineering services; LAN/WAN/Wi-Fi construction activities; system design, application development, etc.; on-site maintenance, remote monitoring service, etc.; and PBX/IP-PBX construction activities. The company also undertakes construction of facilities for environmental conservation and alternative energy; power supply and air-conditioning facilities; and social infrastructure facilities, as well as base station construction, indoor base station construction, and blind spot eliminating works. In addition, it undertakes fixed telecommunications networks construction and troubleshooting/post-disaster restoration works. MIRAIT Holdings Corporation was founded in 2010 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "135-8111",
        "website": "http://www.mirait.co.jp",
        "full_time_employees": 12580
    },
    "1445.T": {
        "short_name": "HIKARI HOLDINGS CO LTD",
        "long_name": "Hikari Holdings Co.,Ltd.",
        "summary": "HIKARI Holdings Co., Ltd. is a holdings company. It was founded on September 2015 and is based in Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tajimi",
        "zipcode": "507-0901",
        "website": "http://h-holdings.jp",
        "full_time_employees": null
    },
    "2388.T": {
        "short_name": "WEDGE HOLDINGS CO",
        "long_name": "Wedge Holdings CO., LTD.",
        "summary": "Wedge Holdings CO., LTD., together with its subsidiaries, engages in the finance and content businesses in Japan and South-East Asia. The company offers motorcycle leasing financing services for the purchase of motorcycles. It also engages in the publication editing activities; planning and development of card games; and production and distribution of company owned contents and music labels. The company was founded in 2001 and is headquartered in Tokyo, Japan. Wedge Holdings CO., LTD. is a subsidiary of Showa Holdings Co., Ltd.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0023",
        "website": "http://www.wedge-hd.com",
        "full_time_employees": 2616
    },
    "2462.T": {
        "short_name": "LIKE CO LTD",
        "long_name": "LIKE Co., Ltd.",
        "summary": "LIKE Co., Ltd. provides a range of human resource services in Japan. The company's services include temporary staffing, outsourcing, recruitment, and recruitment and educational support; and outsourced and public childcare services. It also operates nursing homes that offer nursing care related services. The company was formerly known as J-COM Holdings Co., Ltd. and changed its name to LIKE Co., Ltd. in December 2016. LIKE Co., Ltd. was founded in 1993 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0017",
        "website": "http://www.like-gr.co.jp",
        "full_time_employees": 5296
    },
    "2676.T": {
        "short_name": "TAKACHIHO KOHEKI CO",
        "long_name": "Takachiho Koheki Co.,Ltd.",
        "summary": "Takachiho Koheki Co.,Ltd., together with its subsidiaries, operates as an electronics technology trading company in Japan and internationally. It offers mechanical component products, including slide rails, cable guides, conston springs, dampers, gas springs, lifting and cylinder lock systems, monitor arms, and other mechanical components; and semiconductor products, such as communication devices, power modules and devices, sensors, connectors, trans, coils, and GPU boards. The company also provides retail security products comprising electronic article surveillance, display product security, image surveillance, image analysis, store management, and remote monitoring systems, as well as source tagging labels for music stores, fashion boutiques, drugstores, general merchandise stores, home centers, and home appliance discounters; and business solution products consisting of WAN/LAN and network security products, as well as office security products, such as access control and properties removal management systems, and IP solutions/IP cameras/NVR systems. In addition, it offers retail solutions, including video sensing cloud service that provides data on customer behavior; cloud computing service, which analyses data; age estimation services for male and female customers; shelf browsing time service, which enables retailers to enhance their sales and display plans; and IQ Lane for zero-wait time checkout service for retail businesses. Further, the company offers and support, maintenance, operation and management, and installation and tuning solutions. Takachiho Koheki Co., Ltd. was founded in 1952 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-0004",
        "website": "http://www.takachiho-kk.co.jp",
        "full_time_employees": 506
    },
    "2768.T": {
        "short_name": "SOJITZ CORPORATION",
        "long_name": "Sojitz Corporation",
        "summary": "Sojitz Corporation operates as a general trading company. It offers automotive parts and components; supply chain management; and auto-financing services, as well as internet and digital technologies. The company also provides aircraft leasing/part-out; engineering, procurement, and construction; cargo transport infrastructure; sales representation for commercial/defense; business jet; airport management; railcar maintenance, repair, and overhaul; energy management, system integration, software development, and cloud and managed; and daycare and after-school care management services. In addition, it engages in the medical infrastructure, surface mounter sales, and plant project; new building, secondhand ships, ship chartering, and ship equipment and owning; and tuna and vegetable farming, confectionery, bakery, and grain port businesses. Further, the company constructs, operates, and generates solar, wind, biomass, and gas fired power; LNG plant; LNG receiving and regasification terminals, as well as constructs network for telecommunication carriers; and data centers. Additionally, it mines and smelts coal, and rare and non-ferrous metals; prints 3D metal; and offers exfoliated vermiculite. The company also trades in ferrous materials, thermal coal, non-ferrous and precious metals, and industrial minerals and steel production materials; methanol, plastic resins, industrial salts, C5 and petroleum resins, and rare earths; livestock feed raw materials; industrial machinery and bearings; and carbon products. In addition, it refines sugar; produces and sells fertilizers, feed, woodchip, and meat products; retail foods; invests in and manages shopping centers; distributes building materials, brand and consumer goods, and still products; sells textiles; mills flour; develops industrial park, condominiums, offices, shopping centers, and urban infrastructure; and offers communications and IT equipment. The company was founded in 2003 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8691",
        "website": "http://www.sojitz.com",
        "full_time_employees": null
    },
    "3001.T": {
        "short_name": "KATAKURA INDUSTRIES CO",
        "long_name": "Katakura Industries Co.,Ltd.",
        "summary": "Katakura Industries Co.,Ltd. engages in the textile, pharmaceutical, machinery, real estate, and life solutions businesses in Japan. The company manufactures and sells undergarments, hosiery products, aprons, and relaxing garments, as well as various functional fibers, such as the water-soluble fiber solvron and the thermal resistant NITIVY ALF. It also engages in the manufacture and sale of pharmaceuticals for treating cardiovascular illnesses comprising Frandol for the treatment of angina pectoris; and Frandol Tape, a heart medicine. In addition, the company manufactures and sells environment-related equipment (washers) and cutting oilÂ\u0096related products, fire engines and firefighting-related equipment, and agricultural machinery, as well as car parts. Further, it provides commercial facility management services; and leases and develops various real estate lands. Additionally, the company offers agriculture-related products, food products, nursing care equipment, and general building maintenance and flower/tree planting services, as well as operates plant and pet specialty shops. The company was formerly known as Katakura Silk Spinning Co., Ltd. and changed its name to Katakura Industries Co.,Ltd. in November 1943. Katakura Industries Co.,Ltd. was founded in 1873 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8312",
        "website": "http://www.katakura.co.jp",
        "full_time_employees": 1069
    },
    "3004.T": {
        "short_name": "SHINYEI KAISHA",
        "long_name": "Shinyei Kaisha",
        "summary": "Shinyei Kaisha engages in the apparel and textiles, foodstuffs, general merchandise, and electronics businesses worldwide. It provides a range of clothing products for men, women, and children; legwear products; and fabrics for clothing and industrial applications. The company is also involved in the retail sale of apparel and fashion accessories. In addition, it offers frozen and fresh vegetables, frozen processed foods, and frozen marine products; and peanuts and nuts, spices, and additives. Further, the company provides consulting and materials supply related to disaster prevention; exports construction machinery, ball bearings, and testing machinery and sensors; sells casting products, filaments and brush products, household products and related materials, and architectural hardware and materials for apartments and condominiums; and handles ball bearings, testing machinery, and other commercial materials. Additionally, it offers real estate management and brokerage services; sells electronic equipment, electronic components, and other commodities, as well as insurance policies; develops, produces and sells sensors and measuring instruments, testing machinery, and capacitors; provides consulting for testing and measurement; and engages in research and development for agriculture-related business. The company was formerly known as Shinyei Kiito Kaisha and changed its name to Shinyei Kaisha in August 1966. Shinyei Kaisha was founded in 1887 and is headquartered in Kobe, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kobe",
        "zipcode": "651-0178",
        "website": "http://www.shinyei.co.jp",
        "full_time_employees": 548
    },
    "3105.T": {
        "short_name": "NISSHINBO HOLDINGS INC",
        "long_name": "Nisshinbo Holdings Inc.",
        "summary": "Nisshinbo Holdings Inc., along with its subsidiaries, engages in the wireless and communications, micro devices, automobile brakes, precision instruments, chemicals, textiles, and real estate businesses worldwide. The company offers wireless communication equipment, including disaster-prevention systems and surveillance systems; mobile communication equipment for shipping and automobiles; power-supply and energy equipment focusing on environment friendliness and energy conservation; electronic devices; microwave products; automotive radars; ultrasound sensors; semiconductor devices and analog semiconductors; SAW components and MEMS microphones; microwave components; and navigation equipment. It also manufactures and supplies friction materials, such as disc pads and brake linings, and drum and disc brakes for use in compact cars, ordinary passenger cars, sports cars, large trucks, and buses, as well as for repairs and tests in garages and dealers; and molding products, precision parts, and system equipment, as well as electronic brake systems. In addition, the company manufactures and supplies rigid polyurethane foam/wastewater treatment carriers; carbodilite, a high-performance resin additive; bipolar plates for fuel cells; and amorphous carbon products, as well as shirts, uniforms, mobilons/elastomers, and oikos products. Further, it redevelops unused plant sites; leases office and commercial facilities; and sells housing lots. Nisshinbo Holdings Inc. was founded in 1907 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8650",
        "website": "http://www.nisshinbo.co.jp",
        "full_time_employees": 21725
    },
    "3106.T": {
        "short_name": "KURABO INDUSTRIES",
        "long_name": "Kurabo Industries Ltd.",
        "summary": "Kurabo Industries Ltd. engages in textile, chemical, technology, food and service, and real estate businesses in Japan and internationally. The company manufactures and sells cotton, synthetic, wool, and other materials, including yarns, fabrics, knits, and secondary products. It is also involved in dyeing, treatment, and finishing of cotton and synthetic woven, and knitted fabrics. In addition, the company manufactures, processes, and sells polyurethane foam products, synthetic woods, inorganic building materials, functional films, microfiltration equipment, and engineering plastics, as well as non-woven fabrics and reinforcing nets. Further, it manufactures, sells, and maintains electronics-related products; designs, manufactures, constructs, and sells environmental and energy-related plants and equipment; generates biomass power; and manufactures and sells biomedical and its related products, as well as machine tools, such as boring and milling machines, and CAD/CAM systems. Additionally, the company manufactures and sells freeze-dried food; engages in the management of hotel, driving school, and other facilities; and leases real estate properties. Kurabo Industries Ltd. was founded in 1888 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-8581",
        "website": "http://www.kurabo.co.jp",
        "full_time_employees": 4467
    },
    "3167.T": {
        "short_name": "TOKAI HLDGS CORP",
        "long_name": "TOKAI Holdings Corporation",
        "summary": "TOKAI Holdings Corporation engages in energy, information and communications, and other businesses in Japan and internationally. The company supplies liquefied petroleum gas for industrial, automotive, and individual use; liquefied natural gas; piped natural gas; and other high-pressure gases; provides electricity to individuals and corporations; and offers water-related facility renovation services under the TOKAI WiLL brand, as well as directly operates 2 service stations and 13 wholesale service stations. It also offers Internet access services under the @T COM and TOKAI Network Club names, and mobile phone communications services, as well as operates 15 mobile shops; outsourcing services, such as co-location, mailing system, back-up, and cloud platforms; system development services, including consulting, construction, operation, and maintenance to various industries and fields; and mobile virtual network operator services. In addition, the company provides CATV services, as well as fiber-optic internet and telephone services; bottled water delivery services under the Ulunom and Fujishigen brands; security services ranging from monitoring services for senior citizens to surveillance services for factories, stores, and offices; life and property insurance agency services; office furniture, photocopiers, etc.; management systems for buildings and condominiums; wedding, reception, and restaurant facilities; and nursing care, ship repair, and bridal services. Further, it constructs detached and single-family homes, apartment complexes, and office buildings; engages in real estate business; design, constructs, sells, and installs housing equipment for home builders and construction companies; leases shops and offices; and designs, installs, and maintains air conditioning and sanitation equipment. TOKAI Holdings Corporation was founded in 1950 and is headquartered in Shizuoka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Shizuoka",
        "zipcode": "420-0034",
        "website": "http://www.tokaiholdings.co.jp",
        "full_time_employees": 4130
    },
    "3232.T": {
        "short_name": "MIE KOTSU GROUP HOLDINGS INC",
        "long_name": "Mie Kotsu Group Holdings, Inc.",
        "summary": "Mie Kotsu Group Holdings, Inc., together with its subsidiaries, engages in the transportation, real estate, distribution, and leisure service businesses in Japan. It offers transit and charter bus services; operates intercity express buses and limousine buses for Chubu Centrair International Airport; and tour taxi services, as well as engages in the insurance, advertising, tourist consulting, and rental businesses. The company also sells housing properties under the Precia brand; condominiums under the Praise brand; housing renovation, housing brokerage, and facility rental business under the SANCO HOME name; develops solar power plants; manages condominiums, buildings, and commercial facilities; and provides hotel housekeeping, renovates premises/equipment and condominiums, and trimming services for gardens and planted trees, as well as offers real estate appraising and compensation consulting services. In addition, it operates service stations; sells petroleum products and private cars; provides automobile repair services; runs Komeda's Coffee shops, Ootoya Gohan Dokoro restaurants, and wash house coin laundries under the WASH House name; and franchisees Tokyu Hands Nagoya, Tokyu Hands Kuwana, and Tokyu Hands Nagoya Mozo Wonder City stores; sells new trucks, buses, and used vehicles; produces and sells auto parts and supplies; and provides auto body manufacturing services. Further, the company operates 15 business hotels, Toba Seaside Hotel, Gozaisho Ropeway, elderly housing facility, resort golf course, Matsusaka Country Club, Yokkaichi Driving School, and Iseshima Skyline toll road; provides landscaping, security life support, and nursing care services. Mie Kotsu Group Holdings, Inc. was founded in 2006 and is headquartered in Tsu, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tsu",
        "zipcode": "514-0032",
        "website": "http://holdings.sanco.co.jp",
        "full_time_employees": 3434
    },
    "3306.T": {
        "short_name": "NIHON SEIMA CO LTD",
        "long_name": "The Nihon Seima Co.,Ltd.",
        "summary": "The Nihon Seima Co.,Ltd. manufactures and sells food products, industrial materials, and mats. The company offers food products, such as spaghetti, soup, curry, pasta sauces, and retort sauces; and imported ingredients, including pasta and extra virgin olive oil. It also provides jute and kenaf products, and hemp bags/sandbags; and mixture sheets, a heat insulating sheets used for transporting composite materials. In addition, the company sells packaging products, such as rice, paper, polyethylene, polypropylene, and resin bags, as well as flexible container bags; and automobile mats and carpets. The Nihon Seima Co.,Ltd. offers its food products under the Volcano brand. The company was formerly known as Nakagoe Boshoku Co., Ltd. and changed its name to The Nihon Seima Co.,Ltd. in May 1959. The Nihon Seima Co.,Ltd. was founded in 1947 and is headquartered in Tonami, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tonami",
        "zipcode": "939-1347",
        "website": "http://www.nihonseima.co.jp",
        "full_time_employees": 315
    },
    "3353.T": {
        "short_name": "MEDICAL IKKOU GP CO LTD",
        "long_name": "Medical Ikkou Group Co.,Ltd.",
        "summary": "Medical Ikkou Group Co.,Ltd. operates dispensing pharmacies in Japan. The company is also involved in the operation of nursing homes, outpatient nursing care facilities, and home-visit nursing care facilities; wholesale of generic drugs; and rental of real estate properties, as well as invests in listed and unlisted stocks, M&A, etc. It operates 93 dispensing pharmacy stores. The company was founded in 1980 and is headquartered in Tsu, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tsu",
        "zipcode": "514-0035",
        "website": "http://www.m-ikkou.co.jp",
        "full_time_employees": null
    },
    "3420.T": {
        "short_name": "KFC LTD (JAPAN)",
        "long_name": "KFC, Ltd.",
        "summary": "KFC, Ltd. develops, produces, and sells building construction fastening materials in Japan. The company offers post-construction anchors, and steel and various hardware products; sells earthquake-resistant materials; undertakes earthquake-resistant construction works, such as roads and rail piers; and sells poly-knitted ropes and power tools. It also sells fixing agents for lock bolts, such as dry mortar; and tunnel waterproof sheets and accessories, and welding machines and other construction machinery, as well as sells and rents tunnel rock mass consolidation agents, such as urethane infusion and construction machines. In addition, the company manufactures and sells tunnel support materials, including lock bolts; and designs, constructs, imports, and sells waterproof sheets. Further, it undertakes tunnel interior and fireproof, and sound insulation wall installation works; designs and constructs safety facilities, such as guard fence installations and falling object preventions; and undertakes tunnel reinforcement and building outer wall repair, tunnel interior lighting and disaster prevention, and bridge equipment related works. The company was founded in 1965 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0047",
        "website": "http://www.kfc-net.co.jp",
        "full_time_employees": 282
    },
    "3498.T": {
        "short_name": "KASUMIGASEKI CAPITAL CO LTD",
        "long_name": "Kasumigaseki Capital Co.,Ltd.",
        "summary": "Kasumigaseki Capital Co.,Ltd. engages in the power generation, real estate, and shopping center businesses primarily in Japan. The company operates and manages power generation business through natural energy facilities covering solar, wind, and biomass power plants, as well as supplies and sells electricity. It is also involved in the development, buying and selling, leasing, and management of real estate; provision of real estate mediation and consulting services; and operation of a shopping center. The company was founded in 2011 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0013",
        "website": "http://kasumigaseki.co.jp",
        "full_time_employees": 100
    },
    "3512.T": {
        "short_name": "NIPPON FELT CO",
        "long_name": "Nippon Felt Co., Ltd.",
        "summary": "Nippon Felt Co., Ltd. manufactures and sells press felts, shoe press belts, and industrial textile products in Japan and internationally. The company offers papermaking felts and pulp-making felts; felts for slate and building materials manufacturing; synthetic textiles for paper making or other industrial uses; industrial use felts; industrial tubular needle-felts for industrial use; industrial woven jackets; industrial detergents and industrial chemicals; and high-pressure shower equipment for paper-making. It is also involved in leasing and managing real estate properties, as well as producing and selling industrial machinery and anti-pollution devices. The company was founded in 1917 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "115-0055",
        "website": "http://www.felt.co.jp",
        "full_time_employees": 626
    },
    "3696.T": {
        "short_name": "CERES INC.",
        "long_name": "Ceres Inc.",
        "summary": "Ceres Inc. engages in the advertising media business in Japan. The company offers smartphone advertising media services with point system. It provides its users with given points that can be exchanged to digital contents, such as cash, various electronic money, and games; and is involved in the operation of Moby byte, a recruitment based part-time job recruiting site. The company was founded in 2005 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "158-0097",
        "website": "http://ceres-inc.jp",
        "full_time_employees": 383
    },
    "3814.T": {
        "short_name": "ALPHAX FOOD SYSTEM CO LTD",
        "long_name": "Alphax Food System Co., Ltd",
        "summary": "Alphax Food System Co., Ltd provides information systems for food service industry in Japan. It offers restaurant business management system through ASP method; plans and sells system equipment; provides hardware and software maintenance services; and operates hotels and restaurants. The company was founded in 1987 and is headquartered in Sanyoonoda, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sanyoonoda",
        "zipcode": "756-0039",
        "website": "http://www.afs.co.jp",
        "full_time_employees": 113
    },
    "4206.T": {
        "short_name": "AICA KOGYO CO",
        "long_name": "Aica Kogyo Company, Limited",
        "summary": "Aica Kogyo Company, Limited manufactures and sells chemicals, architectural, housing materials, and specialty and performance materials. The company offers chemical products, including exterior and interior finishing materials, floor coating materials, adhesives, and construction and civil works repair and reinforcement materials; and building panels, such as melamine and noncombustible decorative panels, and decorative boards and films. It also provides building materials comprising interior doors and building materials, storage products, and countertops; and functional materials, such as solar battery and automotive part adhesives and sealants, silicone materials, organic particles, and electronic materials. In addition, the company offers toilet booths; residential and nursing home housing products; and water based resins. The company was formerly known as Aichi Kagaku Kogyo Co., Ltd. and changed its name to Aica Kogyo Company, Limited in June 1966. Aica Kogyo Company, Limited was founded in 1936 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "450-6326",
        "website": "http://www.aica.co.jp",
        "full_time_employees": null
    },
    "4241.T": {
        "short_name": "ATECT CORPORATION",
        "long_name": "atect corporation",
        "summary": "atect corporation engages in the sanitation inspection equipment, powder injection molding (PIM), and semiconductor material businesses. The company develops, sells, and services inspection and sanitation management goods that respond to the environment, including disposable inspection equipment for bio-products, foodstuffs, and medical supplies, as well as disposable petri dishes and culture mediums directly under the Full-Steri brand; and provides support services to its customers in bacteria cultures and detection. It also develops and manufactures protective products and parts, such as spacer tapes used for TAB and COF in information electronic equipment parts and mold spacer tapes for PAT. In addition, the company provides sintered products for machines, electronic parts, and green devices in various industries; heat sinks for cameras, medical endoscope parts, implant articles, and other precision instruments, as well as automotive industry; and PIM binders, feedstock materials, molds, injection moldings, and sintering furnaces. atect corporation was founded in 1959 and is headquartered in Higashiomi, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Higashiomi",
        "zipcode": null,
        "website": "http://www.atect.co.jp",
        "full_time_employees": 107
    },
    "4399.T": {
        "short_name": "KUFU CO INC",
        "long_name": "Kufu Company Inc.",
        "summary": "Kufu Company Inc. operates a housing and real estate Web portal. It also provides high net worth and wedding related community site services; and support services to entrepreneurs, managers, venture companies. The company was founded in 2018 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0073",
        "website": "http://kufu.co.jp",
        "full_time_employees": 230
    },
    "4439.T": {
        "short_name": "TOUMEI CO LTD",
        "long_name": "Toumei Co.,Ltd.",
        "summary": "Toumei Co., Ltd. primarily constructs telecommunications infrastructure of optical line Internet, offices, and stores in Japan. The company provides optical collaboration services for small and medium enterprises; offers Internet and contents, domain, network security, and support services; and creates Websites. It also provides business air conditioners; electric power sales agency services; information terminal equipment sales/security services; office supplies mail order services; and insurance agency services by visiting shop. The company was formerly known as Tomei Mie and changed its name to Tomei Co., Ltd. in 2001. Tomei Co., Ltd. was founded in 1997 and is headquartered in Yokkaichi, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokkaichi",
        "zipcode": "510-0001",
        "website": "http://www.toumei.co.jp",
        "full_time_employees": 329
    },
    "4685.T": {
        "short_name": "RYOYU SYSTEMS CO LTD",
        "long_name": "Ryoyu Systems Co., Ltd.",
        "summary": "Ryoyu Systems Co., Ltd. provides information technology (IT) solutions for various industries in Japan. The company offers system development services for production management systems; system maintenance/operation/monitoring services, including design of information systems and communication network; and IT infrastructure construction services comprising planning, design, construction, and operation of IT platforms, such as computers, peripherals, network devices, and communication cables. It also provides analysis solutions, including aerodynamic/structural analysis of aircraft, rockets, and engines and mechanical devices, as well as collision/impact analysis of automobiles; CAD design services; product lifecycle management system that integrates and manages various data, processes, and resources; information security operation services; and digital businesses support services. The company was founded in 1968 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0023",
        "website": "http://www.ryoyu.co.jp",
        "full_time_employees": 2002
    },
    "4840.T": {
        "short_name": "TRIIS INCORPORATED",
        "long_name": "TriIs Incorporated",
        "summary": "TriIs Incorporated primarily engages in the construction consulting and fashion businesses in Japan and internationally. It provides water-related construction consulting services, as well as constructs dams. The company is also involved in the mail-order business through the operation of Internet shopping malls and Internet sites; and design, manufacture, import, export, and wholesale of clothing, handbags, accessories, and other leather products. It offers its clothing and miscellaneous goods under the CLATHAS and Hamano brands, as well as licenses its trademarks. In addition, the company engages in the real estate and securities investment businesses in the United States. TriIs Incorporated was founded in 1995 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-8578",
        "website": "http://www.triis.co.jp",
        "full_time_employees": 41
    },
    "5331.T": {
        "short_name": "NORITAKE COMPANY LIMITED",
        "long_name": "Noritake Co., Limited",
        "summary": "Noritake Co., Limited manufactures and sells industrial, ceramic and material, tabletop, and engineering products in Japan and internationally. The company offers industrial products, such as abrasive wheels, coated abrasives, diamond and CBN tools, and grinding and polishing related products to automotive, steel, and bearing industries. Its ceramics and materials products include electronic pastes for multilayer ceramic capacitors and other electronic parts; thick film circuit boards for automotive, medical instruments, and light emitting diodes; and vacuum fluorescent displays and ceramic cores. In addition, the company develops and produces various engineering equipment, such as mixers for combining ingredients in chemical, medical, and food products; and filtration systems in grinding and polishing processes, as well as heating equipment for automobiles, electronic components, and energy-related industries. Further, it offers tabletop products comprising tableware for dining. Noritake Co., Limited was founded in 1904 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "451-8501",
        "website": "http://www.noritake.co.jp",
        "full_time_employees": null
    },
    "5355.T": {
        "short_name": "NIPPON CRUCIBLE CO",
        "long_name": "Nippon Crucible Co., Ltd.",
        "summary": "Nippon Crucible Co., Ltd. manufactures and sells refractory products primarily in Japan. The company offers refractory products for non-ferrous metals, ferrous metals, iron and steel making, and incinerators and fusion furnaces. It is also involved in engineering business comprising the design, manufacture, and sale of refractories for metal melting industrial furnaces, induction furnaces, and incinerators and fusion furnaces, as well as provision of maintenance and repair services for furnaces. In addition, the company manufactures and sells monolithic refractories, such as trough materials and tap hole mixtures; and aluminum rapid melting furnaces. Further, it engages in real estate business. The company also exports its refractory products to Korea, China, Taiwan, Thailand, Indonesia, the Philippines, Australia, the United States, and Europe. Nippon Crucible Co., Ltd. was founded in 1885 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0013",
        "website": "http://www.rutsubo.com",
        "full_time_employees": null
    },
    "5393.T": {
        "short_name": "NICHIAS CORP",
        "long_name": "Nichias Corporation",
        "summary": "Nichias Corporation manufactures and sells thermal insulation materials primarily in Japan. It operates in five segments: Energy and Industrial Plants, Industrial Products, Advanced Products, Autoparts, and Building Materials. The company offers gaskets and packings, including non-asbestos gaskets and packings, rubber type gaskets, other seal products, and peripheral function materials; and thermal insulation materials, such as fiber products, high performance thermal insulation materials, heat-insulation boards, and cryogenic insulation materials, as well as thermal insulation materials for molten aluminum. It also provides various fluoropolymer materials, processed products, and corrosion-resistant linings, as well as tubes, hoses, and bellows; filter products and environmental equipment; and auto parts, including sealing materials, retaining parts/materials, and sound-proofing parts/materials, as well as heat-protection products, control parts, and materials. In addition, the company offers building materials for buildings and housing; and undertakes hot and cold insulation, refractory, electric heater tracing, acoustic insulation, and aerogel heat-insulation works. Further, it provides furniture sliding, friction, and agricultural materials. The company serves electric power and gas, waste incineration plant, chemical, petroleum refinery, petrochemical, steel and non-ferrous metals, aluminum casting and processing, paper, building and housing construction, semiconductor and flat panel display, foods and pharmaceutical, medical and electric equipment, aerospace, automobile, ship building, ship maintenance and repair, industrial equipment, and other industries. Nichias Corporation was founded in 1896 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8555",
        "website": "http://www.nichias.co.jp",
        "full_time_employees": null
    },
    "5706.T": {
        "short_name": "MITSUI MINING & SMELTING CO",
        "long_name": "Mitsui Mining & Smelting Co., Ltd.",
        "summary": "Mitsui Mining & Smelting Co., Ltd. manufactures and sells nonferrous metal products in Japan and internationally. The company operates through four segments: Engineered Materials, Metals, Automotive Parts & Components, and Affiliates Coordination. It manufactures engineered powders comprising ultra-fine powders for electronic materials, powder metallurgy, and solder powders; rare metals, such as tantalumu and niobium oxides and carbides, and cerium oxide abrasives; battery materials, including hydrogen storage alloys, and lithium manganese oxides and nickel-lithium materials; catalysts; copper foils; PVD materials; and ceramics for electronic components. The company also offers side door latches, back door latches, hood latches, etc. for automobiles; perlite for processing and cooling; Nenisanso, a soil improvement material; and ROKAHELP, a perlite-based filter aid. In addition, it smelts and recycles nonferrous metals comprising zinc, zinc base alloys, lead, tin, bismuth, antimony trioxide, copper, gold and silver, and sulfuric acid; explores for copper and zinc ores; operates geothermal power plant; and provides resource development related engineering services. Further, the company offers zinc and lead oxide, and zinc sulfate; grinding wheels; aluminum- and magnesium-related die-casted products; and rolled copper products. Additionally, it engages in the mechatronics and corrosion prevention businesses; handling wires and cables activities; and provision of engineering services and IT systems. The company was formerly known as Kamioka Mining and Smelting Co., Ltd. and changed its name to Mitsui Mining & Smelting Co., Ltd. in 1952. Mitsui Mining & Smelting Co., Ltd. was founded in 1874 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-8584",
        "website": "http://www.mitsui-kinzoku.co.jp",
        "full_time_employees": null
    },
    "5821.T": {
        "short_name": "HIRAKAWA HEWTECH CORP",
        "long_name": "Hirakawa Hewtech Corp.",
        "summary": "Hirakawa Hewtech Corp. manufactures and sells cable and assemblies, electric and electronic equipment, and medical equipment and parts in Japan and internationally. The company offers super-fine coaxial cables for medical precision equipment; board-in cables for board mounting; wire harness products used as internal wiring and inter-machine wiring for multimedia-related industrial equipment; digital interface cables to support digital signals; and infiniband cables for connections between servers, storage devices, etc. It also provides factory automation cables that connect industrial machineries, including robot and machine tools; LCD cables to connect the displays notebook computers with main boards; flexible and power cords, and power supply parts, as well as EMI shielding products; and broadcasting cables, such as optical camera cables and HC-4E6 microphone cords. In addition, the company offers broadcast and network products; develops, manufactures, and sells special medical tubing, as well as related processed goods used in medical, analysis equipment, and other special industrial fields. Further, it undertakes design, execution, and management and contract works of electrical and telecommunications work; and leases and manages real estate properties. The company was formerly known as Hirakawa Electric Wire Corporation and changed its name to Hirakawa Hewtech Corp. in October 1990. Hirakawa Hewtech Corp. was founded in 1948 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0014",
        "website": "http://www.hewtech.co.jp",
        "full_time_employees": null
    },
    "59X.F": {
        "short_name": "KEIHAN HOLDINGS CO. LTD.",
        "long_name": "Keihan Holdings Co., Ltd.",
        "summary": "Keihan Holdings Co., Ltd. engages in the transportation and various other businesses in Japan. It operates through five segments: Transportation, Real Estate, Retail Distribution, Leisure and Service, and Others. The Transportation segment primarily offers railway and bus services. The Real Estate segment principally engages in the sale and lease of real estate; wholesale of construction materials; and survey and design of real estate. The Retail Distribution segment operates department stores, other stores, and malls. The Leisure and Service segment operates hotels; and provides sightseeing cruise services. The Others segment is involved in the credit card business. The company was formerly known as Keihan Electric Railway Co., Ltd. Keihan Holdings Co., Ltd. Keihan Holdings Co., Ltd. was founded in 1906 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": null,
        "website": "http://www.keihan.co.jp",
        "full_time_employees": null
    },
    "5FO.F": {
        "short_name": "MIRAIT HOLDINGS CORP.",
        "long_name": "MIRAIT Holdings Corporation",
        "summary": "MIRAIT Holdings Corporation engages in the telecommunications engineering, electrical, civil engineering, and construction works in Japan. It is involved in the various activities, including cloud computing, smart office solution, and Wi-Fi solution engineering services; LAN/WAN/Wi-Fi construction activities; system design, application development, etc.; on-site maintenance, remote monitoring service, etc.; and PBX/IP-PBX construction activities. The company also undertakes construction of facilities for environmental conservation and alternative energy; power supply and air-conditioning facilities; and social infrastructure facilities, as well as base station construction, indoor base station construction, and blind spot eliminating works. In addition, it undertakes fixed telecommunications networks construction and troubleshooting/post-disaster restoration works. MIRAIT Holdings Corporation was founded in 2010 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "135-8111",
        "website": "http://www.mirait.co.jp",
        "full_time_employees": 12580
    },
    "6271.T": {
        "short_name": "NISSEI CORP",
        "long_name": "Nissei Corporation",
        "summary": "Nissei Corporation manufactures and sells gearmotors and gears in Japan and internationally. The company offers induction gearmotors, IPM gearmotors, high precision reducers for servo motor, brushless DC gearmotors, battery powered gearmotors, and gearboxes. It also provides spur, helical, internal, spiral bevel, zerol bevel, HRH, and hypoid gears. In addition, it is involved in the rental of condominiums, etc. The company was formerly known as Nissei Industries Co., Ltd. and changed its name to Nissei Corporation in October 2000. The company was founded in 1942 and is headquartered in Anjo, Japan. Nissei Corporation is a subsidiary of Brother Industries, Ltd.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Anjo",
        "zipcode": "444-1297",
        "website": "http://www.nissei-gtr.co.jp",
        "full_time_employees": null
    },
    "6414.T": {
        "short_name": "KAWASAKI THERMAL ENGINEERING CO",
        "long_name": "Kawasaki Thermal Engineering Co., Ltd.",
        "summary": "Kawasaki Thermal Engineering Co., Ltd. engages in the manufacture and sale of absorption chillers and package boilers in Japan and internationally. It offers absorption chillers, such as double and triple effect direct fired, double effect steam, and single effect hot water absorption chillers; and package boilers, including multi tube once-through, and water and smoke tube boilers, as well as heat recovery steam generators. The company also was founded in 1896 and is headquartered in Tokyo, Japan. Kawasaki Thermal Engineering Co., Ltd. operates as a subsidiary of Kawasaki Heavy Industries, Ltd.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "135-0042",
        "website": "http://www.khi.co.jp/corp/kte",
        "full_time_employees": null
    },
    "6501.T": {
        "short_name": "HITACHI",
        "long_name": "Hitachi, Ltd.",
        "summary": "Hitachi, Ltd. provides information technology, energy, industry, mobility, and smart life solutions in Japan and internationally. The company offers information and telecommunication services, such as internet of things, storage systems and platforms, servers, software, ATMs and self service terminals, and scanners for manufacturing, communication, finance, healthcare and life science, energy and transportation, and distribution industries, as well as government and urban sectors; drone platform solutions, including consulting, system integration, and other services; and infrastructure inspection, data, security, measurement, unmanned aerial system traffic management, and inventory management services. It operates nuclear power plants, power grides, wind turbines, and power generation systems; provides energy and equipment management services; power semiconductors; elevators, escalators and moving sidewalk, and control elevator systems; and transportation systems and equipment. In addition, the company offers medical equipment for radiation therapy, In-vitro diagnosis, and regenerative medicines; automotive systems; navigation and audio-visual solutions; financial solutions for corporate and consumers; home appliances; and water treatment solutions for water supply and sewage infrastructure, industrial water treatment, seawater desalination, and water recycling, as well as maintenance and repair services. Further, it manufactures and sales air and centrifugal compressors, blowers, electrical machinery control systems, fans, pumps, pharmaceutical manufacturing execution systems, induction motors, industrial computers, industrial controllers, inverters, logistics and marking systems, IGBT drives, motors, nitrogen gas generators, automobile production process management systems, rope and chain hoist, PCS, UPS, switches and breakers, steel systems, and transformers. The company was founded in 1910 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8280",
        "website": "http://www.hitachi.co.jp/",
        "full_time_employees": 350864
    },
    "6838.T": {
        "short_name": "TAMAGAWA HOLDINGS CO LTD",
        "long_name": "Tamagawa Holdings Co., Ltd.",
        "summary": "Tamagawa Holdings Co., Ltd. engages in the electronic and communication device business. It also engages in the planning, design, construction, inspection, operation, and maintenance of solar and geothermal power plants. The company was founded in 1968 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0013",
        "website": "http://www.tmex.co.jp",
        "full_time_employees": null
    },
    "7066.T": {
        "short_name": "PEERS CO LTD",
        "long_name": "Peers Co.,Ltd.",
        "summary": "Peers Co.,Ltd. provides consulting, IT, and human resources solutions. It primarily offers consulting services, as well as IT and human resources solutions to stores. Peers Co.,Ltd. was founded in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0003",
        "website": "http://www.peers.jp",
        "full_time_employees": 86
    },
    "7224.T": {
        "short_name": "SHINMAYWA INDUSTRIES",
        "long_name": "ShinMaywa Industries, Ltd.",
        "summary": "ShinMaywa Industries, Ltd. manufactures and sells transportation equipment in Japan and internationally. It offers amphibian and aircraft components; and special purpose trucks, such as dump trucks, refuse compactors, tailgate lifters, concrete mixers, and petroleum tanks; and fluid and related facilities and equipment, including pumps, essentials for water treatment, and remote monitoring systems. The company also provides wire processing systems for home electric appliance and auto industries; environmental systems; thin film coating systems; direct drive motors; and aircraft passenger boarding bridges. In addition, it manufactures, sells, installs, maintains, improves, and repairs mechanical car parking systems; and develops a range of surface modification technologies that provide surface hardness, wear resistance, corrosion resistance, and polishing. The company was formerly known as Shin Meiwa Industry Company Limited. ShinMaywa Industries, Ltd. was founded in 1949 and is headquartered in Takarazuka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Takarazuka",
        "zipcode": "665-8550",
        "website": "http://www.shinmaywa.co.jp",
        "full_time_employees": 5075
    },
    "7483.T": {
        "short_name": "DOSHISHA CO LTD",
        "long_name": "Doshisha Co.,Ltd.",
        "summary": "Doshisha Co.,Ltd. plans, develops, manufactures, and wholesales lifestyle-related products in Japan and internationally. The company offers lifestyle miscellaneous goods, home appliances/A&V, interior and storage supplies, watches and jewelry, brand bags, fashion accessories, gifts, food/liquor, and fashion clothing. It also provides its products through online stores. The company was founded in 1974 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "542-8525",
        "website": "http://www.doshisha.co.jp",
        "full_time_employees": null
    },
    "7490.T": {
        "short_name": "NISSIN SHOJI CO",
        "long_name": "Nissin Shoji Co.,Ltd.",
        "summary": "Nissin Shoji Co.,Ltd. engages in the sale of petroleum and by-products in Japan. It also sells petrochemicals and synthetic resins; and automotive parts and tires, as well as manufactures and sells liquefied petroleum gas. In addition, the company engages in automobile damage compensation insurance agency, real estate rental, and restaurant businesses; selling plastic molding machinery and accessories; and leasing automobile and automobile supplies. Further, it sells electrolytic reduction water conditioners and cartridges, as well as electrolytic reduced water; food, daily commodities, and other household goods; ultra-high brightness micro prism reflective materials; and appliances and eco-friendly products. Additionally, the company offers agency services related to telecommunications equipment; and telecommunication services, as well as generates and distributes electric power. It also manufactures and sells agricultural materials; and beverages, including soft drinks. The company was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0023",
        "website": "http://www.nissin-shoji.co.jp",
        "full_time_employees": 425
    },
    "7571.T": {
        "short_name": "YAMANO HOLDING CORPORATION",
        "long_name": "Yamano Holdings Corporation",
        "summary": "Yamano Holdings Corporation engages in the retail business in Japan. Its products include Japanese and western clothing, bedding products, precious metals, jewelry, fur products, etc. The company also engages in the DSM business, such as door to door sales and holding exhibitions of health and lifestyle-related products, including sewing machines; operates beauty and nail salons; manages cram school; and operates kimono retail stores. Yamano Holdings Corporation was incorporated in 1974 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "151-0053",
        "website": "http://www.yamano-hd.com",
        "full_time_employees": null
    },
    "7827.T": {
        "short_name": "ORVIS CORPORATION",
        "long_name": "Orvis Corporation",
        "summary": "Orvis Corporation manufactures and sells timber products in Japan. The company is also involved in the manufacture and sale of packaging materials and prefabricated houses; leasing of temporary buildings; contracting of general buildings and solar power generation systems; generation of power using natural energy; and operation of fitness clubs and golf courses. In addition, it engages in buying, selling, and leasing real estate properties. The company was founded in 1950 and is headquartered in Fukuyama, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuyama",
        "zipcode": "729-0104",
        "website": "http://www.orvis.co.jp",
        "full_time_employees": 175
    },
    "8001.T": {
        "short_name": "ITOCHU CORP",
        "long_name": "ITOCHU Corporation",
        "summary": "ITOCHU Corporation engages in trading and importing/exporting various products worldwide. The company's Textile segment produces and sells textile and garment materials, textiles, textile products, apparel, and industrial materials; and imports lifestyle brands, fashion accessories, and garments in various areas, such as luxury, casual, and sports. Its Machinery segment provides engineering, procurement, and construction services; operates water and environmental, infrastructure, renewable energy, oil and gas, petrochemical, and independent power producer projects and plants; sells and leases aircraft and related equipment; sells automobiles, construction machinery, electronic system, industrial machinery, and medical devices; and owns and charters ships. The company's Metals & Minerals segment develops iron ore, coal, uranium, alumina, etc.; trades in iron ore, coal, aluminum, uranium, steel scrap, and non-ferrous products; and processes and trades in steel products. Its Energy & Chemicals segment trades in crude oil, petroleum products, LPG, LNG, natural gas, hydrogen, organic and inorganic chemicals, synthetic resins, household goods, fine chemicals, pharmaceuticals, electronic materials, power, and others. The company's Food segment produces, distributes, and retails food products. Its General Products & Realty segment produces and sells paper, pulp, natural rubber, tire, and wood products and materials; develops and operates real estate properties, such as housing, logistics facilities, and other projects; and offers logistics services. The company's ICT & Financial Business segment offers IT solutions, Internet related and venture capital services, mobile telephone equipment and services, BPO, broadcasting and communications, entertainment and content services, outsourcing services for healthcare and preventive medicine, and financial and insurance brokerage services. The company was founded in 1858 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-8077",
        "website": "http://www.itochu.co.jp",
        "full_time_employees": null
    },
    "8002.T": {
        "short_name": "MARUBENI CORP",
        "long_name": "Marubeni Corporation",
        "summary": "Marubeni Corporation engages in various business activities worldwide. The company trades in grains, feed ingredients, compound feeds, foods, agricultural and marine products, processed seafood, fresh and processed meat, and raw ingredients and materials; and apparel, footwear, lifestyle, and textile and industrial materials. It also provides agri-inputs, subcontracting and agriculture services, technical services, crop protection product formulations, fertilizer raw materials, and oilseeds; ICT and real estate services; petrochemicals and plastics, salts and chlor-alkalis, life science products, electronic materials, and inorganic mineral resources and chemicals; and wood chips, biomass fuels, pulp and waste papers, paper, paperboards, and building and construction materials. In addition, the company explores for, develops, and produces oil and gas; trades in, distributes, and markets petroleum and LPG; develops uranium, nuclear fuel cycle, iron ore, coal, and copper mines, as well as related equipment sales and services; smelts and refines aluminum; trades in iron ore, coal, ferroalloy, ferrous raw materials, non-ferrous metals, ingots and related products, and steel products; and leases temporary steel construction materials. Further, it offers engineering, procurement, and construction, as well as operation and maintenance services for plants and other facilities; invests in the oil and gas, transportation infrastructure, and water projects; and manages infrastructure funds, as well as engages in the circular economy, power generation, renewable energy, power service and retail, natural gas, hydrogen, ammonia, municipal solid waste, and thermal energy storage businesses. Additionally, it owns, purchases, operates, leases, sells, and charters aerospace and ship products; and sells, trades in, leases, finances, and services construction and industrial machinery, and automotive products. The company was founded in 1858 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8088",
        "website": "http://www.marubeni.com",
        "full_time_employees": null
    },
    "8014.T": {
        "short_name": "CHORI CO LTD",
        "long_name": "Chori Co., Ltd.",
        "summary": "Chori Co., Ltd. engages in textiles, chemicals, and machinery businesses in China and internationally. The company offers polyester yarn for use in other materials; fabrics for use in car seats; nylon yarn; waterproof fabrics for sportswear; nonwoven sheets; raw thread/raw cotton for natural and synthetic fabrics; construction and civil engineering products, such as cloth, waterproof nonwoven cloth materials, etc.; and various linen products. It also provides lightweight and thin fabrics, black materials, and traditional garment worn in the Middle East; and basic materials and finished products to inner apparel manufacturers for men's and ladies' innerwear, as well as uniforms, men's heavy clothing, golf apparel, and athletic wear, as well as produces ladies' apparels. In addition, the company offers chemical raw materials, including shock absorption and insulation materials, adhesives, coating materials, films, and others; inorganic chemical materials, metal materials, agriculture and fertilizer related materials, glass substrate raw materials used in flat panel displays, and lithium-ion battery materials; and industrial chemicals for aluminum electrolytic capacitors and ceramic capacitors, as well as raw materials for metallic surface treatment. Further, it imports and sells pharmaceutical and agrochemical ingredients and intermediates; functional organic intermediates; and proteins, sweeteners, and other food chemicals. Additionally, the company sells transportation equipment comprising four-wheel and two-wheel vehicles and trucks, as well as exports agricultural machinery, construction machinery, and industrial equipment; and provides chemical analysis, and research and development services, as well as office outsourcing services. The company was founded in 1861 and is headquartered in Osaka, Japan. Chori Co., Ltd. is a subsidiary of Toray Industries, Inc.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "540-8603",
        "website": "http://www.chori.co.jp",
        "full_time_employees": null
    },
    "8057.T": {
        "short_name": "UCHIDA YOKO CO",
        "long_name": "Uchida Yoko Co., Ltd.",
        "summary": "Uchida Yoko Co., Ltd. provides government and education, office, and information system solutions in Japan and internationally. It offers teaching aids and materials to primary and secondary schools, Boards of Education, universities, and vocational schools; equipment and fittings for educational institutions; and interior design and ICT consulting services. The company also designs and installs mission-critical systems and associated business software programs; supplies software licensing and IT asset management services; and designs, supplies, installs, and maintains IT equipment and networks. In addition, it designs, manufactures, and supplies office furniture and fittings to offices, public buildings, commercial facilities, welfare centers, and other workplaces; designs and builds office layouts; and manufactures and supplies office equipment, and hobby and craft products, as well as supplies OA equipment and products. The company was founded in 1910 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8282",
        "website": "http://www.uchida.co.jp",
        "full_time_employees": 3184
    },
    "8066.T": {
        "short_name": "MITANI CORP",
        "long_name": "Mitani Corporation",
        "summary": "Mitani Corporation engages in the information system, construction material, energy, and other businesses in Japan and internationally. The company offers system integration services focusing on planning, developing, managing, and supporting computer systems, networks, and software, as well as selling related devices; develops and sells image-processing systems; develops packaged applications; and manages Internet service providers. It also supplies construction materials, including cement, concrete, outer-wall materials, aluminum sashes, concrete-based secondary products, and other products, as well as building gondolas; and sells volatile and coal oil products, light and heavy oil products, petrochemical products, LPG, coal products, and heat supply systems. In addition, the company engages in the solar and wind power, industrial equipment, leasing, restaurant management, and cable television businesses. Further, it is involved in outsourcing, application housing, Internet solution, EMG marketing agency, gas-station operation, vehicle maintenance, plating and painting accident-insurance agency, IT, nursing-home management, other nursing and caregiving, and exterior construction services. Additionally, the company sells automotive products; leases vehicles; inspects, rents, and sells new and used vehicles; rents gondolas; supplies and sells LP gas for residential, commercial, and industrial uses; and sells gas fixtures and housing equipment. It is also involved in planning, surveying, measuring, and designing in civil engineering and construction management; and information processing and construction IT support system businesses, as well as home renovation piping work for LP gas. Mitani Corporation was founded in 1914 and is headquartered in Fukui, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukui",
        "zipcode": "910-8510",
        "website": "http://www.mitani-corp.co.jp",
        "full_time_employees": null
    },
    "8078.T": {
        "short_name": "HANWA CO LTD",
        "long_name": "Hanwa Co., Ltd.",
        "summary": "Hanwa Co., Ltd. trades in steel, metals and alloys, nonferrous metals, food products, petroleum and chemicals, lumber, machinery, and other products in Japan, Asia, and internationally. The company operates through six segments: Steel Business, Primary Metal, Metal Recycling, Foods, Petroleum and Chemicals Business, and Overseas Sales Subsidiaries. The Steel Business segment sells steel bars and shapes, steel plates and sheets, special steels, wire products, steel pipes, and steelmaking raw materials. The Primary Metal segment offers nickel, chromium, silicon, manganese, and steel alloys. The Metal Recycling segment recycles aluminum, copper, and zinc. The Foods Business segment provides seafood and meat products. The Petroleum and Chemicals Business segment offers petroleum products, industrial chemicals, chemicals, refuse plastics, and paper fuel. The Overseas Sales Subsidiaries segment is involved in the trading of various goods and related business activities. It also imports lumber products and building materials; manages and operates amusement facilities; and sells amusement machines, and steel processing machines and various conveyance machines. Hanwa Co., Ltd. was founded in 1947 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-8585",
        "website": "http://www.hanwa.co.jp",
        "full_time_employees": null
    },
    "8081.T": {
        "short_name": "KANADEN CORP",
        "long_name": "Kanaden Corporation",
        "summary": "Kanaden Corporation operates as an electronics technology trading company in Japan and internationally. The company offers FA control components, including sequencers, inverters, AC servos, robots, and other control and drive systems; FA sensors; breakers, magnets, measuring instruments and transformers, and measuring devices; electrical discharge and laser processing machines; industrial measuring instruments; and wattmeters, waveform measuring instruments, and direct current power supplies. It also provides power generators, uninterrupted power supplies, lithium ion storage batteries, and other optimal systems; elevators and escalators; building management systems; photovoltaic generation systems; LED lighting products; air conditioning systems for stores, offices, factories, and warehouses; and refrigeration and cold storage equipment, and showcases. In addition, the company offers electrical drive and control components, braking and safety devices, and in-train information display and air conditioning systems for rolling stock and other vehicles; receiving substation and station power distribution facilities, train radio systems, and other information and communication equipment; wireless microphones, photovoltaic generation systems, wind power generators, and LED lighting products for use in railway stations; LED traffic lights and road lighting fixtures; and photovoltaic generation systems and chargers for electric vehicles. Further, it provides power semiconductors and network ICs; interface connectors and TFT liquid crystal panel modules; security systems; LED display systems for indoor use and disaster prevention signage systems; and radiotherapy systems and other medical equipment. The company was formerly known as Kanagawa Electric Co., Ltd. and changed its name to Kanaden Corporation in October 1990. The company was founded in 1907 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-6215",
        "website": "http://www.kanaden.co.jp",
        "full_time_employees": null
    },
    "8088.T": {
        "short_name": "IWATANI CORPORATION",
        "long_name": "Iwatani Corporation",
        "summary": "Iwatani Corporation supplies gases and energy in Japan, China, Taiwan, South Korea, Singapore, Thailand, Malaysia, Indonesia, Vietnam, the United States, and Australia. The company operates through four segments: Energy, Industrial Gases & Machinery, Materials, and Agri-Bio & Foods. The Energy segment offers LPG for household, commercial, and industrial use; LPG-supply equipment and facilities; LNG; petroleum products; household kitchen appliances; and home energy components, ENE FARM, GHP, daily necessities, portable cooking stoves, gas canisters, mineral water, electricity, etc. The Industrial Gases & Machinery segment provides air separation gases, hydrogen, helium, other specialty gases, gas supply facilities, welding materials, welding and cutting equipment, industrial machinery and facilities, industrial robots, pumps and compressors, disaster prevention equipment, and high pressure gas containers. This segment also offers semiconductor manufacturing equipment, electronic component manufacturing equipment, factory automation systems, medicine and food packing machinery, environmental equipment, etc. In addition, it operates facilities for hydrogen stations. The Materials segment provides stainless steel and aluminum products, non-ferrous metals, plastic resins, plastic molding, functional films, electronic display materials, secondary battery materials, mineral sand, ceramic materials, biomass fuels, etc. The Agri-bio & Foods segment offers frozen vegetables and seafoods, frozen meat products, health foods, agricultural equipment and materials, livestock-related goods, etc. Further, it engages in mining and sale of mineral sand. The company was founded in 1930 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0053",
        "website": "http://www.iwatani.co.jp",
        "full_time_employees": null
    },
    "8090.T": {
        "short_name": "SHOKO CO LTD",
        "long_name": "Shoko Co., Ltd.",
        "summary": "Shoko Co., Ltd. engages in the chemicals, functional chemicals, plastics, light metal, inorganic materials, and construction materials businesses. The company offers raw materials and functional products, including organic synthetic materials and other products; and inorganic chemical products, such as acidic and alkaline products, ammonia products, mineral products, water treatment chemicals, and gases, as well as treatment agents comprising exhaust gas denitrifying/desulfurizing agents, sewage/wastewater neutralizing/flocculating agents, and related equipment. It also provides functional chemicals consisting of resin raw materials and additives, solvents, raw materials for personal care products, and others; and food materials and additives, as well as functional food materials that include collagen, collagen peptide, pichit sheets, animal feed, etc. In addition, the company offers plastic raw materials and products, and machinery; and aluminum ingots/alloys, scrap, sheets, extruded and foil products, cast and forged products, and processed products, as well as other non-ferrous metals and equipment. Further, it provides inorganic materials, such as ceramics, rare metal and earth, carbon, and other-related products; construction materials, which comprise cement and secondary products, construction materials for structures, piping and plumbing equipment, metal building materials, and others; analytical and synthetic products, environmental analytical devices, barrier packaging materials, desiccant agents for moisture-proof packaging, aluminum spacers, fertilizers, and moldings. Additionally, the company sells agricultural materials and soil conditioners; offers life and nonlife insurance agency services; and imports and export of chemical products. Shoko Co., Ltd. was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8432",
        "website": "http://www.shoko.co.jp",
        "full_time_employees": 493
    },
    "8157.T": {
        "short_name": "TSUZUKI DENKI CO",
        "long_name": "Tsuzuki Denki Co., Ltd.",
        "summary": "Tsuzuki Denki Co., Ltd. engages in the design, development, construction, and maintenance of network and information systems. It also sells electronic devices and information equipment. The company's electronic devices include logic ICs, memory ICs, discrete semiconductors, compound semiconductors, relays, connectors, keyboards, mouse, display panels, various circuit boards, communication modules, switches, volumes, sensors, magnetic devices, customized LSI design, development of microcomputer embedding software, and high frequency devices. Its information equipment include hard disks, PCs/servers, printers, other electronic devices, computer supplies, computer-related products, and stationary/office supplies, etc. The company serves manufacturing, distribution and services, medical and welfare, public and education, and financial fields. Tsuzuki Denki Co., Ltd. was founded in 1932 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8665",
        "website": "http://www.tsuzuki.co.jp",
        "full_time_employees": 2359
    },
    "8285.T": {
        "short_name": "MITANI SANGYO CO",
        "long_name": "Mitani Sangyo Co., Ltd.",
        "summary": "Mitani Sangyo Co., Ltd. engages in chemicals, information systems, air conditioning systems, energy, resin, electronics, and housing equipment businesses in Japan and internationally. The company offers inorganic chemicals comprising soda chemicals, ammonia and acid products, wastewater treatment chemicals, and others; organic chemicals, including alcohols, aromatic hydrocarbons, ester, ketones, etc.; pharmaceutical intermediates and active pharmaceutical ingredients; functional materials, such as health food materials, electronic materials, food additives, catalysts, etc.; pesticide intermediates, fine chemicals, chemical products, etc.; and reuse and recycle of waste, by-products, etc. It also provides system integration services; package software; hardware maintenance; and data center services, as well as constructs information infrastructures. In addition, the company is involved in the construction of air conditioning, sanitary plumbing, and special facilities construction, as well as other special technical construction; and renovation activities. Further, it offers petroleum products, such as heavy oil, diesel, gasoline, and reclaimed oil, etc.; LPG gas, fuel cells, and solar power generator systems. Additionally, the company provides plastic moldings, which include automotive parts, precision parts, special moldings; assembled substrates, electronic parts, dies, and composite unit products; and kitchen and bathroom products, house furniture, and air conditioning equipment. It also offers research and analysis services for the computer industry; maintenance and management services for condominiums and buildings; and temporary staffing, card printing, and travel agency services; and concrete, pottery and porcelain products, and electronic ceramics, as well as sells mobile communication equipment and supplies. Mitani Sangyo Co., Ltd. was founded in 1928 and is based in Kanazawa, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kanazawa",
        "zipcode": "920-8685",
        "website": "http://www.mitani.co.jp",
        "full_time_employees": null
    },
    "8835.T": {
        "short_name": "TAIHEIYO KOUHATSU INC",
        "long_name": "Taiheiyo Kouhatsu Incorporated",
        "summary": "Taiheiyo Kouhatsu Incorporated engages in the coal and mining equipment sale business in Japan. The company is also involved in the condominium/building management; real estate rent/brokerage; shipping; building materials and oil sale; and insurance agency businesses, as well as provision of nursing home services for the elderly. In addition, it manufactures and sells charcoal fertilizer, slaked lime, and stone powder; and offers general freight vehicle transportation services, such as warehousing, construction, and design of various plant facilities, as well as provides information processing services. The company was founded in 1920 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "111-0041",
        "website": "http://www.taiheiyo.net",
        "full_time_employees": null
    },
    "8V7.F": {
        "short_name": "FUJI KYUKO CO. LTD",
        "long_name": "Fuji Kyuko Co., Ltd.",
        "summary": "Fuji Kyuko Co., Ltd. engages in transportation, tourism, distribution service, real estate, civil engineering and construction, and information technology businesses in Japan. It operates amusement parks, hotels, golf courses, ski resorts, camp grounds, etc.; and offers transportation services that include Fujikyu railway, Fujikyuko bus, share-ride buses, highway buses, reserved buses, etc., as well as real estate services, such as building leasing, condo/villa subdivision, etc. The company was founded in 1926 and is headquartered in Fujiyoshida, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Fujiyoshida",
        "zipcode": "403-0017",
        "website": "http://www.fujikyu.co.jp",
        "full_time_employees": null
    },
    "9010.T": {
        "short_name": "FUJI KYUKO CO LTD",
        "long_name": "Fuji Kyuko Co., Ltd.",
        "summary": "Fuji Kyuko Co., Ltd. engages in transportation, tourism, distribution service, real estate, civil engineering and construction, and information technology businesses in Japan. It operates amusement parks, hotels, golf courses, ski resorts, camp grounds, etc.; and offers transportation services that include Fujikyu railway, Fujikyuko bus, share-ride buses, highway buses, reserved buses, etc., as well as real estate services, such as building leasing, condo/villa subdivision, etc. The company was founded in 1926 and is headquartered in Fujiyoshida, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fujiyoshida",
        "zipcode": "403-0017",
        "website": "http://www.fujikyu.co.jp",
        "full_time_employees": null
    },
    "9024.T": {
        "short_name": "SEIBU HOLDINGS INC",
        "long_name": "Seibu Holdings Inc.",
        "summary": "Seibu Holdings Inc. engages in the urban and regional transportation, hotel and leisure, real estate, construction, and other businesses in Japan and internationally. It operates through Urban Transportation and Regional, Hotel and Leisure, Real Estate, Construction, Hawaii Business, and Other Business segments. The company offers railway, bus, and taxi transportation services; operates hotels, golf courses, ski resorts, and leisure facilities; develops Seibu Railway lines and hotel sites in city centers; leases office and residential facilities; and develops and operates stores in train stations, shopping malls, and other commercial facilities. It is also involved in the construction of railway lines, social infrastructure, hotel remodeling, private sector construction, and housing. In addition, the company produces, processes, and sells gravel, sand, and other raw materials used in civil engineering and construction projects; designs and executes landscaping projects; and maintains and operates state-run parks. Further, the company operates express ways and cruise ships; and maintains a professional baseball team. Additionally, the company offers housekeeping, child-rearing support, home, urban development, and other services; and insurance products, as well as builds cemeteries. The company operates a network of 47 hotels. Seibu Holdings Inc. was founded in 2006 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "171-0022",
        "website": "http://www.seibuholdings.co.jp",
        "full_time_employees": 23504
    },
    "9041.T": {
        "short_name": "KINTETSU GROUP HOLDINGS CO LTD",
        "long_name": "Kintetsu Group Holdings Co.,Ltd.",
        "summary": "Kintetsu Group Holdings Co.,Ltd. engages in the transportation, real estate, distribution, hotel, and leisure businesses in Japan and internationally. The company offers railway, bus and taxi, logistics, marine, and other transportation services. It is also involved in the sale, leasing, and renovation of real estate properties; and solar and agricultural businesses. In addition, the company operates department stores; stores; convenience stores, cafes, drug stores, general merchandise stores, supermarkets, etc.; restaurants and others in the service and parking areas of expressways; and hotels under the Miyako Hotels & Resorts brand, as well as resorts and leisure facilities. Further, it engages in the tourism, travel, manufacturing and construction, and other service businesses. The company was formerly known as Kintetsu Corporation and changed its name to Kintetsu Group Holdings Co.,Ltd. in April 2015. Kintetsu Group Holdings Co.,Ltd. was founded in 1910 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "543-8585",
        "website": "http://www.kintetsu-g-hd.co.jp",
        "full_time_employees": null
    },
    "9042.T": {
        "short_name": "HANKYU HANSHIN HOLDINGS INC",
        "long_name": "Hankyu Hanshin Holdings, Inc.",
        "summary": "Hankyu Hanshin Holdings, Inc. operates in the urban transportation, real estate, entertainment, information and communication technology, travel, international transportation, and hotels businesses in Japan and internationally. It provides various urban transportation services, such as railways, buses, and taxis; advertising services; and retailing services. The company is also involved in the development, lease, and administration of condominiums, commercial facilities, and office buildings; real estate fund management; and provision of travel and international transportation services, as well as ownership and management of hotels. In addition, it engages in the operation of sports businesses, including HANSHIN Tigers, a professional baseball team; Hanshin Koshien stadium; Takarazuka Revue, a theatrical company; Umeda Arts Theater, which operates two theatres; Billboard, a music brand; and Mt. Rokko, a night-view spot that provides visitors a range of leisure facilities, including ski slopes, an alpine botanical garden, an observatory, and a music box museum, as well as the exhibition event platform Rokko Meets Art, which combines the nature and scenery of Mt. Rokko with modern art. Further, the company engages in the provision of information and communications technology services covering e-commerce and website production, systems development, solutions related to medical field, and contract services in the development of software; information infrastructure, and optical and wireless high-speed internet services; wireless IC tags for children; and conducting ProgLab robot-programming classes for children. As of September 01, 2020, it operated 49 hotels comprising 21 directly managed hotels and 28 franchised hotels with 12,470 guest rooms. Hankyu Hanshin Holdings, Inc. was founded in 1907 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0012",
        "website": "http://www.hankyu-hanshin.co.jp",
        "full_time_employees": null
    },
    "9045.T": {
        "short_name": "KEIHAN HOLDINGS CO LTD",
        "long_name": "Keihan Holdings Co., Ltd.",
        "summary": "Keihan Holdings Co., Ltd. engages in the transportation and various other businesses in Japan. It operates through five segments: Transportation, Real Estate, Retail Distribution, Leisure and Service, and Others. The Transportation segment primarily offers railway and bus services. The Real Estate segment principally engages in the sale and lease of real estate; wholesale of construction materials; and survey and design of real estate. The Retail Distribution segment operates department stores, other stores, and malls. The Leisure and Service segment operates hotels; and provides sightseeing cruise services. The Others segment is involved in the credit card business. The company was formerly known as Keihan Electric Railway Co., Ltd. Keihan Holdings Co., Ltd. Keihan Holdings Co., Ltd. was founded in 1906 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": null,
        "website": "http://www.keihan.co.jp",
        "full_time_employees": null
    },
    "9435.T": {
        "short_name": "HIKARI TSUSHIN INC",
        "long_name": "Hikari Tsushin, Inc.",
        "summary": "Hikari Tsushin, Inc. engages in the sale of communication-related products, such as business phones, OA equipment, UTMs, and servers. The company also provides Internet communication line, content, electricity, industry-specific IT solutions, water delivery services, etc., as well as insurance products and agency sales services. The company was founded in 1988 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "171-0021",
        "website": "http://www.hikari.co.jp",
        "full_time_employees": null
    },
    "9633.T": {
        "short_name": "TOKYO THEATRES CO INC",
        "long_name": "Tokyo Theatres Company, Incorporated",
        "summary": "Tokyo Theatres Company, Incorporated engages in the real estate, video related, food, and other businesses in Japan. The company is involved in the real estate leasing and management; rental office and restaurant management; and refurbishment and remodelling of second-hand condominiums. It also engages in the production and distribution of movies and dramas; advertising and event planning business; and movie box office business, as well as manages movie theatres. The company was founded in 1946 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-0022",
        "website": "http://www.theatres.co.jp",
        "full_time_employees": null
    },
    "9760.T": {
        "short_name": "SHINGAKUKAI HOLDINGS CO LTD",
        "long_name": "Shingakukai Holdings Co.,Ltd.",
        "summary": "Shingakukai Holdings Co.,Ltd. operates schools in Japan. The company conducts classes, seminars, and public mock exams. It is also involved in the development and sales promotion of computer software for education; and management of sports clubs. The company was formerly known as Shingakukai Co., Ltd. and changed its name to Shingakukai Holdings Co.,Ltd. in October 2017. Shingakukai Holdings Co.,Ltd. was founded in 1972 and is headquartered in Sapporo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sapporo",
        "zipcode": null,
        "website": "http://www.shingakukai.co.jp",
        "full_time_employees": null
    },
    "9849.T": {
        "short_name": "KYODO PAPER HOLDINGS",
        "long_name": "Kyodo Paper Holdings",
        "summary": "Kyodo Paper Holdings sells paper and paper products. It is also involved in paper processing, warehousing, car transportation, real estate leasing and management, and non-life insurance agency businesses, as well as the sale of chemical products and office equipment, and industrial equipment. The company was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.kyodopaper.com",
        "full_time_employees": null
    },
    "DDJ.F": {
        "short_name": "NEXUS BANK CO. LTD.",
        "long_name": "Nexus Bank Co., Ltd.",
        "summary": "Nexus Bank Co., Ltd. engages in the fintech and IT solution businesses in Japan. It operates a crowdfunding platform, as well as offers digital banking services. The company was formerly known as Samurai&J Partners Co.,Ltd. and changed its name to Nexus Bank Co., Ltd. in November 2020. Nexus Bank Co., Ltd. was incorporated in 1996 and is based in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0052",
        "website": "http://www.nbank.co.jp",
        "full_time_employees": 533
    },
    "HIA1.F": {
        "short_name": "HITACHI LTD",
        "long_name": "Hitachi, Ltd.",
        "summary": "Hitachi, Ltd. provides information technology, energy, industry, mobility, and smart life solutions in Japan and internationally. The company offers systems integration, consulting, and cloud services, as well as servers, storage products, software, telecommunications and network equipment, and ATMs; industrial machinery and plants, elevators, escalators, and railway systems; thermal, nuclear, and renewable energy power generation systems; and transmission and distribution systems. It also provides semiconductor processing equipment, test and measurement equipment, industrial products, and medical electronics equipment; and semiconductor and display related materials, circuit boards and materials, automotive parts, energy storage devices, specialty steel products, magnetic materials and applications, and functional components and equipment, as well as wires, cables, and related products. In addition, the company offers hydraulic excavators, wheel loaders, and mining machinery; and engine and electric powertrain systems, and integrated vehicle control systems. Further, it provides air-conditioning equipment, room air conditioners, refrigerators, and washing machines. Hitachi, Ltd. has a collaboration with Centre Leon Berard and Renesas Electronics Corporation; and a strategic alliance with Microsoft Corp. to advance digital solutions for the manufacturing and logistics industries in Southeast Asia, North America, and Japan. The company was founded in 1910 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8280",
        "website": "http://www.hitachi.co.jp/",
        "full_time_employees": null
    },
    "HIK.F": {
        "short_name": "HIKARI TSUSHIN INC.",
        "long_name": "Hikari Tsushin, Inc.",
        "summary": "Hikari Tsushin, Inc. engages in the sale of communication-related products, such as business phones, OA equipment, UTMs, and servers. The company also provides Internet communication line, content, electricity, industry-specific IT solutions, water delivery services, etc., as well as insurance products and agency sales services. The company was founded in 1988 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "171-0021",
        "website": "http://www.hikari.co.jp",
        "full_time_employees": 6449
    },
    "HKY.F": {
        "short_name": "HANKYU HANSHIN HLDGS INC.",
        "long_name": "Hankyu Hanshin Holdings, Inc.",
        "summary": "Hankyu Hanshin Holdings, Inc. operates in the urban transportation, real estate, entertainment, information and communication technology, travel, international transportation, and hotels businesses in Japan and internationally. It provides various urban transportation services, such as railways, buses, and taxis; advertising services; and retailing services. The company is also involved in the development, lease, and administration of condominiums, commercial facilities, and office buildings; real estate fund management; and provision of travel and international transportation services, as well as ownership and management of hotels. In addition, it engages in the operation of sports businesses, including HANSHIN Tigers, a professional baseball team; Hanshin Koshien stadium; Takarazuka Revue, a theatrical company; Umeda Arts Theater, which operates two theatres; Billboard, a music brand; and Mt. Rokko, a night-view spot that provides visitors a range of leisure facilities, including ski slopes, an alpine botanical garden, an observatory, and a music box museum, as well as the exhibition event platform Rokko Meets Art, which combines the nature and scenery of Mt. Rokko with modern art. Further, the company engages in the provision of information and communications technology services covering e-commerce and website production, systems development, solutions related to medical field, and contract services in the development of software; information infrastructure, and optical and wireless high-speed internet services; wireless IC tags for children; and conducting ProgLab robot-programming classes for children. As of September 01, 2020, it operated 49 hotels comprising 21 directly managed hotels and 28 franchised hotels with 12,470 guest rooms. Hankyu Hanshin Holdings, Inc. was founded in 1907 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0012",
        "website": "http://www.hankyu-hanshin.co.jp",
        "full_time_employees": null
    },
    "HTHIF": {
        "short_name": "HITACHI",
        "long_name": "Hitachi, Ltd.",
        "summary": "Hitachi, Ltd. provides information technology, energy, industry, mobility, and smart life solutions in Japan and internationally. The company offers information and telecommunication services, such as internet of things, storage systems and platforms, servers, software, ATMs and self service terminals, and scanners for manufacturing, communication, finance, healthcare and life science, energy and transportation, and distribution industries, as well as government and urban sectors; drone platform solutions, including consulting, system integration, and other services; and infrastructure inspection, data, security, measurement, unmanned aerial system traffic management, and inventory management services. It operates nuclear power plants, power grides, wind turbines, and power generation systems; provides energy and equipment management services; power semiconductors; elevators, escalators and moving sidewalk, and control elevator systems; and transportation systems and equipment. In addition, the company offers medical equipment for radiation therapy, In-vitro diagnosis, and regenerative medicines; automotive systems; navigation and audio-visual solutions; financial solutions for corporate and consumers; home appliances; and water treatment solutions for water supply and sewage infrastructure, industrial water treatment, seawater desalination, and water recycling, as well as maintenance and repair services. Further, it manufactures and sales air and centrifugal compressors, blowers, electrical machinery control systems, fans, pumps, pharmaceutical manufacturing execution systems, induction motors, industrial computers, industrial controllers, inverters, logistics and marking systems, IGBT drives, motors, nitrogen gas generators, automobile production process management systems, rope and chain hoist, PCS, UPS, switches and breakers, steel systems, and transformers. The company was founded in 1910 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8280",
        "website": "http://www.hitachi.co.jp/",
        "full_time_employees": 350864
    },
    "HTHIY": {
        "short_name": "HITACHI",
        "long_name": "Hitachi, Ltd.",
        "summary": "Hitachi, Ltd. provides information technology, energy, industry, mobility, and smart life solutions in Japan and internationally. The company offers systems integration, consulting, and cloud services, as well as servers, storage products, software, telecommunications and network equipment, and ATMs; industrial machinery and plants, elevators, escalators, and railway systems; thermal, nuclear, and renewable energy power generation systems; and transmission and distribution systems. It also provides semiconductor processing equipment, test and measurement equipment, industrial products, and medical electronics equipment; and semiconductor and display related materials, circuit boards and materials, automotive parts, energy storage devices, specialty steel products, magnetic materials and applications, and functional components and equipment, as well as wires, cables, and related products. In addition, the company offers hydraulic excavators, wheel loaders, and mining machinery; and engine and electric powertrain systems, and integrated vehicle control systems. Further, it provides air-conditioning equipment, room air conditioners, refrigerators, and washing machines. Hitachi, Ltd. has a collaboration with Centre Leon Berard and Renesas Electronics Corporation; and a strategic alliance with Microsoft Corp. to advance digital solutions for the manufacturing and logistics industries in Southeast Asia, North America, and Japan. The company was founded in 1910 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8280",
        "website": "http://www.hitachi.co.jp/",
        "full_time_employees": null
    },
    "HW4.F": {
        "short_name": "HANWA CO. LTD",
        "long_name": "Hanwa Co., Ltd.",
        "summary": "Hanwa Co., Ltd. trades in steel, metals and alloys, nonferrous metals, food products, petroleum and chemicals, lumber, machinery, and other products in Japan, Asia, and internationally. The company operates through six segments: Steel Business, Primary Metal, Metal Recycling, Foods, Petroleum and Chemicals Business, and Overseas Sales Subsidiaries. The Steel Business segment sells steel bars and shapes, steel plates and sheets, special steels, wire products, steel pipes, and steelmaking raw materials. The Primary Metal segment offers nickel, chromium, silicon, manganese, and steel alloys. The Metal Recycling segment recycles aluminum, copper, and zinc. The Foods Business segment provides seafood and meat products. The Petroleum and Chemicals Business segment offers petroleum products, industrial chemicals, chemicals, refuse plastics, and paper fuel. The Overseas Sales Subsidiaries segment is involved in the trading of various goods and related business activities. It also imports lumber products and building materials; manages and operates amusement facilities; and sells amusement machines, and steel processing machines and various conveyance machines. Hanwa Co., Ltd. was founded in 1947 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-8585",
        "website": "http://www.hanwa.co.jp",
        "full_time_employees": null
    },
    "IOC.F": {
        "short_name": "ITOCHU CORP.",
        "long_name": "ITOCHU Corporation",
        "summary": "ITOCHU Corporation engages in trading and importing/exporting various products worldwide. The company's Textile segment produces and sells textile and garment materials, textiles, textile products, apparel, and industrial materials; and imports lifestyle brands, fashion accessories, and garments in various areas, such as luxury, casual, and sports. Its Machinery segment provides engineering, procurement, and construction services; operates water and environmental, infrastructure, renewable energy, oil and gas, petrochemical, and independent power producer projects and plants; sells and leases aircraft and related equipment; sells automobiles, construction machinery, electronic system, industrial machinery, and medical devices; and owns and charters ships. The company's Metals & Minerals segment develops iron ore, coal, uranium, alumina, etc.; trades in iron ore, coal, aluminum, uranium, steel scrap, and non-ferrous products; and processes and trades in steel products. Its Energy & Chemicals segment trades in crude oil, petroleum products, LPG, LNG, natural gas, hydrogen, organic and inorganic chemicals, synthetic resins, household goods, fine chemicals, pharmaceuticals, electronic materials, power, and others. The company's Food segment produces, distributes, and retails food products. Its General Products & Realty segment produces and sells paper, pulp, natural rubber, tire, and wood products and materials; develops and operates real estate properties, such as housing, logistics facilities, and other projects; and offers logistics services. The company's ICT & Financial Business segment offers IT solutions, Internet related and venture capital services, mobile telephone equipment and services, BPO, broadcasting and communications, entertainment and content services, outsourcing services for healthcare and preventive medicine, and financial and insurance brokerage services. The company was founded in 1858 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-8077",
        "website": "http://www.itochu.co.jp",
        "full_time_employees": null
    },
    "IOC.VI": {
        "short_name": "ITOCHU CORP",
        "long_name": "ITOCHU Corporation",
        "summary": "ITOCHU Corporation engages in trading and importing/exporting various products worldwide. The company's Textile segment produces and sells textile and garment materials, textiles, textile products, apparel, and industrial materials; and imports lifestyle brands, fashion accessories, and garments in various areas, such as luxury, casual, and sports. Its Machinery segment provides engineering, procurement, and construction services; operates water and environmental, infrastructure, renewable energy, oil and gas, petrochemical, and independent power producer projects and plants; sells and leases aircraft and related equipment; sells automobiles, construction machinery, electronic system, industrial machinery, and medical devices; and owns and charters ships. The company's Metals & Minerals segment develops iron ore, coal, uranium, alumina, etc.; trades in iron ore, coal, aluminum, uranium, steel scrap, and non-ferrous products; and processes and trades in steel products. Its Energy & Chemicals segment trades in crude oil, petroleum products, LPG, LNG, natural gas, hydrogen, organic and inorganic chemicals, synthetic resins, household goods, fine chemicals, pharmaceuticals, electronic materials, power, and others. The company's Food segment produces, distributes, and retails food products. Its General Products & Realty segment produces and sells paper, pulp, natural rubber, tire, and wood products and materials; develops and operates real estate properties, such as housing, logistics facilities, and other projects; and offers logistics services. The company's ICT & Financial Business segment offers IT solutions, Internet related and venture capital services, mobile telephone equipment and services, BPO, broadcasting and communications, entertainment and content services, outsourcing services for healthcare and preventive medicine, and financial and insurance brokerage services. The company was founded in 1858 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-8077",
        "website": "http://www.itochu.co.jp",
        "full_time_employees": null
    },
    "ITOCF": {
        "short_name": "ITOCHU CORP",
        "long_name": "ITOCHU Corporation",
        "summary": "ITOCHU Corporation engages in trading and importing/exporting various products worldwide. The company's Textile segment produces and sells textile and garment materials, textiles, textile products, apparel, and industrial materials; and imports lifestyle brands, fashion accessories, and garments in various areas, such as luxury, casual, and sports. Its Machinery segment provides engineering, procurement, and construction services; operates water and environmental, infrastructure, renewable energy, oil and gas, petrochemical, and independent power producer projects and plants; sells and leases aircraft and related equipment; sells automobiles, construction machinery, electronic system, industrial machinery, and medical devices; and owns and charters ships. The company's Metals & Minerals segment develops iron ore, coal, uranium, alumina, etc.; trades in iron ore, coal, aluminum, uranium, steel scrap, and non-ferrous products; and processes and trades in steel products. Its Energy & Chemicals segment trades in crude oil, petroleum products, LPG, LNG, natural gas, hydrogen, organic and inorganic chemicals, synthetic resins, household goods, fine chemicals, pharmaceuticals, electronic materials, power, and others. The company's Food segment produces, distributes, and retails food products. Its General Products & Realty segment produces and sells paper, pulp, natural rubber, tire, and wood products and materials; develops and operates real estate properties, such as housing, logistics facilities, and other projects; and offers logistics services. The company's ICT & Financial Business segment offers IT solutions, Internet related and venture capital services, mobile telephone equipment and services, BPO, broadcasting and communications, entertainment and content services, outsourcing services for healthcare and preventive medicine, and financial and insurance brokerage services. The company was founded in 1858 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-8077",
        "website": "http://www.itochu.co.jp",
        "full_time_employees": 128146
    },
    "ITOCY": {
        "short_name": "ITOCHU CORP",
        "long_name": "ITOCHU Corporation",
        "summary": "ITOCHU Corporation engages in trading and importing/exporting various products worldwide. The company's Textile segment produces and sells textile and garment materials, textiles, textile products, apparel, and industrial materials; and imports lifestyle brands, fashion accessories, and garments in various areas, such as luxury, casual, and sports. Its Machinery segment provides engineering, procurement, and construction services; operates water and environmental, infrastructure, renewable energy, oil and gas, petrochemical, and independent power producer projects and plants; sells and leases aircraft and related equipment; sells automobiles, construction machinery, electronic system, industrial machinery, and medical devices; and owns and charters ships. The company's Metals & Minerals segment develops iron ore, coal, uranium, alumina, etc.; trades in iron ore, coal, aluminum, uranium, steel scrap, and non-ferrous products; and processes and trades in steel products. Its Energy & Chemicals segment trades in crude oil, petroleum products, LPG, LNG, natural gas, hydrogen, organic and inorganic chemicals, synthetic resins, household goods, fine chemicals, pharmaceuticals, electronic materials, power, and others. The company's Food segment produces, distributes, and retails food products. Its General Products & Realty segment produces and sells paper, pulp, natural rubber, tire, and wood products and materials; develops and operates real estate properties, such as housing, logistics facilities, and other projects; and offers logistics services. The company's ICT & Financial Business segment offers IT solutions, Internet related and venture capital services, mobile telephone equipment and services, BPO, broadcasting and communications, entertainment and content services, outsourcing services for healthcare and preventive medicine, and financial and insurance brokerage services. The company was founded in 1858 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-8077",
        "website": "http://www.itochu.co.jp",
        "full_time_employees": null
    },
    "IWA.F": {
        "short_name": "IWATANI CORP.",
        "long_name": "Iwatani Corporation",
        "summary": "Iwatani Corporation supplies gases and energy in Japan, China, Taiwan, South Korea, Singapore, Thailand, Malaysia, Indonesia, Vietnam, the United States, and Australia. The company operates through four segments: Energy, Industrial Gases & Machinery, Materials, and Agri-Bio & Foods. The Energy segment offers LPG for household, commercial, and industrial use; LPG-supply equipment and facilities; LNG; petroleum products; household kitchen appliances; and home energy components, ENE FARM, GHP, daily necessities, portable cooking stoves, gas canisters, mineral water, electricity, etc. The Industrial Gases & Machinery segment provides air separation gases, hydrogen, helium, other specialty gases, gas supply facilities, welding materials, welding and cutting equipment, industrial machinery and facilities, industrial robots, pumps and compressors, disaster prevention equipment, and high pressure gas containers. This segment also offers semiconductor manufacturing equipment, electronic component manufacturing equipment, factory automation systems, medicine and food packing machinery, environmental equipment, etc. In addition, it operates facilities for hydrogen stations. The Materials segment provides stainless steel and aluminum products, non-ferrous metals, plastic resins, plastic molding, functional films, electronic display materials, secondary battery materials, mineral sand, ceramic materials, biomass fuels, etc. The Agri-bio & Foods segment offers frozen vegetables and seafoods, frozen meat products, health foods, agricultural equipment and materials, livestock-related goods, etc. Further, it engages in mining and sale of mineral sand. The company was founded in 1930 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0053",
        "website": "http://www.iwatani.co.jp",
        "full_time_employees": null
    },
    "IWA.MU": {
        "short_name": "IWATANI CORP.",
        "long_name": "Iwatani Corporation",
        "summary": "Iwatani Corporation supplies gases and energy in Japan, China, Taiwan, South Korea, Singapore, Thailand, Malaysia, Indonesia, Vietnam, the United States, and Australia. The company operates through four segments: Energy, Industrial Gases & Machinery, Materials, and Agri-Bio & Foods. The Energy segment offers LPG for household, commercial, and industrial use; LPG-supply equipment and facilities; LNG; petroleum products; household kitchen appliances; and home energy components, ENE FARM, GHP, daily necessities, portable cooking stoves, gas canisters, mineral water, electricity, etc. The Industrial Gases & Machinery segment provides air separation gases, hydrogen, helium, other specialty gases, gas supply facilities, welding materials, welding and cutting equipment, industrial machinery and facilities, industrial robots, pumps and compressors, disaster prevention equipment, and high pressure gas containers. This segment also offers semiconductor manufacturing equipment, electronic component manufacturing equipment, factory automation systems, medicine and food packing machinery, environmental equipment, etc. In addition, it operates facilities for hydrogen stations. The Materials segment provides stainless steel and aluminum products, non-ferrous metals, plastic resins, plastic molding, functional films, electronic display materials, secondary battery materials, mineral sand, ceramic materials, biomass fuels, etc. The Agri-bio & Foods segment offers frozen vegetables and seafoods, frozen meat products, health foods, agricultural equipment and materials, livestock-related goods, etc. Further, it engages in mining and sale of mineral sand. The company was founded in 1930 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0053",
        "website": "http://www.iwatani.co.jp",
        "full_time_employees": null
    },
    "IWA.VI": {
        "short_name": "IWATANI CORP",
        "long_name": "Iwatani Corporation",
        "summary": "Iwatani Corporation supplies gases and energy in Japan, China, Taiwan, South Korea, Singapore, Thailand, Malaysia, Indonesia, Vietnam, the United States, and Australia. The company operates through four segments: Energy, Industrial Gases & Machinery, Materials, and Agri-Bio & Foods. The Energy segment offers LPG for household, commercial, and industrial use; LPG-supply equipment and facilities; LNG; petroleum products; household kitchen appliances; and home energy components, ENE FARM, GHP, daily necessities, portable cooking stoves, gas canisters, mineral water, electricity, etc. The Industrial Gases & Machinery segment provides air separation gases, hydrogen, helium, other specialty gases, gas supply facilities, welding materials, welding and cutting equipment, industrial machinery and facilities, industrial robots, pumps and compressors, disaster prevention equipment, and high pressure gas containers. This segment also offers semiconductor manufacturing equipment, electronic component manufacturing equipment, factory automation systems, medicine and food packing machinery, environmental equipment, etc. In addition, it operates facilities for hydrogen stations. The Materials segment provides stainless steel and aluminum products, non-ferrous metals, plastic resins, plastic molding, functional films, electronic display materials, secondary battery materials, mineral sand, ceramic materials, biomass fuels, etc. The Agri-bio & Foods segment offers frozen vegetables and seafoods, frozen meat products, health foods, agricultural equipment and materials, livestock-related goods, etc. Further, it engages in mining and sale of mineral sand. The company was founded in 1930 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0053",
        "website": "http://www.iwatani.co.jp",
        "full_time_employees": null
    },
    "IWTNF": {
        "short_name": "IWATANI CORPORATION",
        "long_name": "Iwatani Corporation",
        "summary": "Iwatani Corporation supplies gases and energy in Japan, China, Taiwan, South Korea, Singapore, Thailand, Malaysia, Indonesia, Vietnam, the United States, and Australia. The company operates through four segments: Energy, Industrial Gases & Machinery, Materials, and Agri-Bio & Foods. The Energy segment offers LPG for household, commercial, and industrial use; LPG-supply equipment and facilities; LNG; petroleum products; household kitchen appliances; and home energy components, ENE FARM, GHP, daily necessities, portable cooking stoves, gas canisters, mineral water, electricity, etc. The Industrial Gases & Machinery segment provides air separation gases, hydrogen, helium, other specialty gases, gas supply facilities, welding materials, welding and cutting equipment, industrial machinery and facilities, industrial robots, pumps and compressors, disaster prevention equipment, and high pressure gas containers. This segment also offers semiconductor manufacturing equipment, electronic component manufacturing equipment, factory automation systems, medicine and food packing machinery, environmental equipment, etc. In addition, it operates facilities for hydrogen stations. The Materials segment provides stainless steel and aluminum products, non-ferrous metals, plastic resins, plastic molding, functional films, electronic display materials, secondary battery materials, mineral sand, ceramic materials, biomass fuels, etc. The Agri-bio & Foods segment offers frozen vegetables and seafoods, frozen meat products, health foods, agricultural equipment and materials, livestock-related goods, etc. Further, it engages in mining and sale of mineral sand. The company was founded in 1930 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0053",
        "website": "http://www.iwatani.co.jp",
        "full_time_employees": null
    },
    "KKI.F": {
        "short_name": "KINTETSU GROUP HLDGS CO.",
        "long_name": "Kintetsu Group Holdings Co.,Ltd.",
        "summary": "Kintetsu Group Holdings Co.,Ltd. engages in the transportation, real estate, distribution, hotel, and leisure businesses in Japan and internationally. The company offers railway, bus and taxi, logistics, marine, and other transportation services. It is also involved in the sale, leasing, and renovation of real estate properties; and solar and agricultural businesses. In addition, the company operates department stores; stores; convenience stores, cafes, drug stores, general merchandise stores, supermarkets, etc.; restaurants and others in the service and parking areas of expressways; and hotels under the Miyako Hotels & Resorts brand, as well as resorts and leisure facilities. Further, it engages in the tourism, travel, manufacturing and construction, and other service businesses. The company was formerly known as Kintetsu Corporation and changed its name to Kintetsu Group Holdings Co.,Ltd. in April 2015. Kintetsu Group Holdings Co.,Ltd. was founded in 1910 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "543-8585",
        "website": "http://www.kintetsu-g-hd.co.jp",
        "full_time_employees": null
    },
    "MARA.F": {
        "short_name": "MARUBENI CORP.",
        "long_name": "Marubeni Corporation",
        "summary": "Marubeni Corporation engages in various business activities worldwide. The company trades in grains, feed ingredients, compound feeds, foods, agricultural and marine products, processed seafood, fresh and processed meat, and raw ingredients and materials; and apparel, footwear, lifestyle, and textile and industrial materials. It also provides agri-inputs, subcontracting and agriculture services, technical services, crop protection product formulations, fertilizer raw materials, and oilseeds; ICT and real estate services; petrochemicals and plastics, salts and chlor-alkalis, life science products, electronic materials, and inorganic mineral resources and chemicals; and wood chips, biomass fuels, pulp and waste papers, paper, paperboards, and building and construction materials. In addition, the company explores for, develops, and produces oil and gas; trades in, distributes, and markets petroleum and LPG; develops uranium, nuclear fuel cycle, iron ore, coal, and copper mines, as well as related equipment sales and services; smelts and refines aluminum; trades in iron ore, coal, ferroalloy, ferrous raw materials, non-ferrous metals, ingots and related products, and steel products; and leases temporary steel construction materials. Further, it offers engineering, procurement, and construction, as well as operation and maintenance services for plants and other facilities; invests in the oil and gas, transportation infrastructure, and water projects; and manages infrastructure funds, as well as engages in the circular economy, power generation, renewable energy, power service and retail, natural gas, hydrogen, ammonia, municipal solid waste, and thermal energy storage businesses. Additionally, it owns, purchases, operates, leases, sells, and charters aerospace and ship products; and sells, trades in, leases, finances, and services construction and industrial machinery, and automotive products. The company was founded in 1858 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8088",
        "website": "http://www.marubeni.com",
        "full_time_employees": null
    },
    "MARUF": {
        "short_name": "MARUBENI CORP",
        "long_name": "Marubeni Corporation",
        "summary": "Marubeni Corporation engages in various business activities worldwide. The company trades in grains, feed ingredients, compound feeds, foods, agricultural and marine products, processed seafood, fresh and processed meat, and raw ingredients and materials; and apparel, footwear, lifestyle, and textile and industrial materials. It also provides agri-inputs, subcontracting and agriculture services, technical services, crop protection product formulations, fertilizer raw materials, and oilseeds; ICT and real estate services; petrochemicals and plastics, salts and chlor-alkalis, life science products, electronic materials, and inorganic mineral resources and chemicals; and wood chips, biomass fuels, pulp and waste papers, paper, paperboards, and building and construction materials. In addition, the company explores for, develops, and produces oil and gas; trades in, distributes, and markets petroleum and LPG; develops uranium, nuclear fuel cycle, iron ore, coal, and copper mines, as well as related equipment sales and services; smelts and refines aluminum; trades in iron ore, coal, ferroalloy, ferrous raw materials, non-ferrous metals, ingots and related products, and steel products; and leases temporary steel construction materials. Further, it offers engineering, procurement, and construction, as well as operation and maintenance services for plants and other facilities; invests in the oil and gas, transportation infrastructure, and water projects; and manages infrastructure funds, as well as engages in the circular economy, power generation, renewable energy, power service and retail, natural gas, hydrogen, ammonia, municipal solid waste, and thermal energy storage businesses. Additionally, it owns, purchases, operates, leases, sells, and charters aerospace and ship products; and sells, trades in, leases, finances, and services construction and industrial machinery, and automotive products. The company was founded in 1858 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8088",
        "website": "http://www.marubeni.com",
        "full_time_employees": null
    },
    "MARUY": {
        "short_name": "MARUBENI CORP",
        "long_name": "Marubeni Corporation",
        "summary": "Marubeni Corporation engages in various business activities worldwide. The company trades in grains, feed ingredients, compound feeds, foods, agricultural and marine products, processed seafood, fresh and processed meat, and raw ingredients and materials; and apparel, footwear, lifestyle, and textile and industrial materials. It also provides agri-inputs, subcontracting and agriculture services, technical services, crop protection product formulations, fertilizer raw materials, and oilseeds; ICT and real estate services; petrochemicals and plastics, salts and chlor-alkalis, life science products, electronic materials, and inorganic mineral resources and chemicals; and wood chips, biomass fuels, pulp and waste papers, paper, paperboards, and building and construction materials. In addition, the company explores for, develops, and produces oil and gas; trades in, distributes, and markets petroleum and LPG; develops uranium, nuclear fuel cycle, iron ore, coal, and copper mines, as well as related equipment sales and services; smelts and refines aluminum; trades in iron ore, coal, ferroalloy, ferrous raw materials, non-ferrous metals, ingots and related products, and steel products; and leases temporary steel construction materials. Further, it offers engineering, procurement, and construction, as well as operation and maintenance services for plants and other facilities; invests in the oil and gas, transportation infrastructure, and water projects; and manages infrastructure funds, as well as engages in the circular economy, power generation, renewable energy, power service and retail, natural gas, hydrogen, ammonia, municipal solid waste, and thermal energy storage businesses. Additionally, it owns, purchases, operates, leases, sells, and charters aerospace and ship products; and sells, trades in, leases, finances, and services construction and industrial machinery, and automotive products. The company was founded in 1858 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8088",
        "website": "http://www.marubeni.com",
        "full_time_employees": null
    },
    "MBI.F": {
        "short_name": "MITSUBISHI CORP.",
        "long_name": "Mitsubishi Corporation",
        "summary": "Mitsubishi Corporation engages in the natural gas, industrial materials, petroleum and chemicals, mineral resources, industrial infrastructure, automotive and mobility, food industry, consumer industry, power solution, and urban development businesses worldwide. The company's Natural Gas segment engages in the natural gas/oil exploration, production, and development business; and liquified natural gas business. Its Industrial Materials segment invests in, develops, and trades in carbon, steel products, and performance materials for automobile and mobility, construction, and finance industries. The company's Petroleum & Chemicals segment invests in, develops, and trades in crude oil and oil products, LPG, ethylene, methanol, salt, ammonia, plastics, and fertilizers. Its Mineral Resources segment invests in and develops metallurgical coal, copper, iron ore, and aluminum resources. The company's Industrial Infrastructure segment trades in energy infrastructure, industrial plants, machinery tools, agricultural machinery, mining machinery, elevators, escalators, ships, and aerospace related equipment. Its Automotive & Mobility segment produces, finances, and sells passenger and commercial cars; and mobility services. The company's Food Industry segment develops and sells food resources, fresh foods, consumer goods, and food ingredients. Its Consumer Industry segment engages in food retail, apparel, healthcare, and logistics and distribution businesses. The company's Power Solution segment generates, transmits, and retails power; supplies power generating and transmitting products and equipment; develops and sells lithium ion; develops hydrogen; and offers battery services. Its Urban Development segment engages in the urban infrastructure development, operation, and management businesses. Mitsubishi Corporation was incorporated in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8086",
        "website": "http://www.mitsubishicorp.com",
        "full_time_employees": null
    },
    "MMG.F": {
        "short_name": "MITSUI MNG SMELTG",
        "long_name": "Mitsui Mining & Smelting Co., Ltd.",
        "summary": "Mitsui Mining & Smelting Co., Ltd. manufactures and sells nonferrous metal products in Japan and internationally. The company operates through four segments: Engineered Materials, Metals, Automotive Parts & Components, and Affiliates Coordination. It manufactures engineered powders comprising ultra-fine powders for electronic materials, powder metallurgy, and solder powders; rare metals, such as tantalumu and niobium oxides and carbides, and cerium oxide abrasives; battery materials, including hydrogen storage alloys, and lithium manganese oxides and nickel-lithium materials; catalysts; copper foils; PVD materials; and ceramics for electronic components. The company also offers side door latches, back door latches, hood latches, etc. for automobiles; perlite for processing and cooling; Nenisanso, a soil improvement material; and ROKAHELP, a perlite-based filter aid. In addition, it smelts and recycles nonferrous metals comprising zinc, zinc base alloys, lead, tin, bismuth, antimony trioxide, copper, gold and silver, and sulfuric acid; explores for copper and zinc ores; operates geothermal power plant; and provides resource development related engineering services. Further, the company offers zinc and lead oxide, and zinc sulfate; grinding wheels; aluminum- and magnesium-related die-casted products; and rolled copper products. Additionally, it engages in the mechatronics and corrosion prevention businesses; handling wires and cables activities; and provision of engineering services and IT systems. The company was formerly known as Kamioka Mining and Smelting Co., Ltd. and changed its name to Mitsui Mining & Smelting Co., Ltd. in 1952. Mitsui Mining & Smelting Co., Ltd. was founded in 1874 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-8584",
        "website": "http://www.mitsui-kinzoku.co.jp",
        "full_time_employees": null
    },
    "MMSMY": {
        "short_name": "MITSUI MINING & SMELTING CO",
        "long_name": "Mitsui Mining & Smelting Co., Ltd.",
        "summary": "Mitsui Mining & Smelting Co., Ltd. manufactures and sells nonferrous metal products in Japan and internationally. The company operates through four segments: Engineered Materials, Metals, Automotive Parts & Components, and Affiliates Coordination. It manufactures engineered powders comprising ultra-fine powders for electronic materials, powder metallurgy, and solder powders; rare metals, such as tantalumu and niobium oxides and carbides, and cerium oxide abrasives; battery materials, including hydrogen storage alloys, and lithium manganese oxides and nickel-lithium materials; catalysts; copper foils; PVD materials; and ceramics for electronic components. The company also offers side door latches, back door latches, hood latches, etc. for automobiles; perlite for processing and cooling; Nenisanso, a soil improvement material; and ROKAHELP, a perlite-based filter aid. In addition, it smelts and recycles nonferrous metals comprising zinc, zinc base alloys, lead, tin, bismuth, antimony trioxide, copper, gold and silver, and sulfuric acid; explores for copper and zinc ores; operates geothermal power plant; and provides resource development related engineering services. Further, the company offers zinc and lead oxide, and zinc sulfate; grinding wheels; aluminum- and magnesium-related die-casted products; and rolled copper products. Additionally, it engages in the mechatronics and corrosion prevention businesses; handling wires and cables activities; and provision of engineering services and IT systems. The company was formerly known as Kamioka Mining and Smelting Co., Ltd. and changed its name to Mitsui Mining & Smelting Co., Ltd. in 1952. Mitsui Mining & Smelting Co., Ltd. was founded in 1874 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-8584",
        "website": "http://www.mitsui-kinzoku.co.jp",
        "full_time_employees": null
    },
    "MSBHF": {
        "short_name": "MITSUBISHI CORP",
        "long_name": "Mitsubishi Corporation",
        "summary": "Mitsubishi Corporation engages in the natural gas, industrial materials, petroleum and chemicals, mineral resources, industrial infrastructure, automotive and mobility, food industry, consumer industry, power solution, and urban development businesses worldwide. The company's Natural Gas segment engages in the natural gas/oil exploration, production, and development business; and liquified natural gas business. Its Industrial Materials segment invests in, develops, and trades in carbon, steel products, and performance materials for automobile and mobility, construction, and finance industries. The company's Petroleum & Chemicals segment invests in, develops, and trades in crude oil and oil products, LPG, ethylene, methanol, salt, ammonia, plastics, and fertilizers. Its Mineral Resources segment invests in and develops metallurgical coal, copper, iron ore, and aluminum resources. The company's Industrial Infrastructure segment trades in energy infrastructure, industrial plants, machinery tools, agricultural machinery, mining machinery, elevators, escalators, ships, and aerospace related equipment. Its Automotive & Mobility segment produces, finances, and sells passenger and commercial cars; and mobility services. The company's Food Industry segment develops and sells food resources, fresh foods, consumer goods, and food ingredients. Its Consumer Industry segment engages in food retail, apparel, healthcare, and logistics and distribution businesses. The company's Power Solution segment generates, transmits, and retails power; supplies power generating and transmitting products and equipment; develops and sells lithium ion; develops hydrogen; and offers battery services. Its Urban Development segment engages in the urban infrastructure development, operation, and management businesses. Mitsubishi Corporation was incorporated in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8086",
        "website": "http://www.mitsubishicorp.com",
        "full_time_employees": null
    },
    "NBO.F": {
        "short_name": "NISSHINBO HOLDINGS INC.",
        "long_name": "Nisshinbo Holdings Inc.",
        "summary": "Nisshinbo Holdings Inc., along with its subsidiaries, engages in the wireless and communications, micro devices, automobile brakes, precision instruments, chemicals, textiles, and real estate businesses worldwide. The company offers wireless communication equipment, including disaster-prevention systems and surveillance systems; mobile communication equipment for shipping and automobiles; power-supply and energy equipment focusing on environment friendliness and energy conservation; electronic devices; microwave products; automotive radars; ultrasound sensors; semiconductor devices and analog semiconductors; SAW components and MEMS microphones; microwave components; and navigation equipment. It also manufactures and supplies friction materials, such as disc pads and brake linings, and drum and disc brakes for use in compact cars, ordinary passenger cars, sports cars, large trucks, and buses, as well as for repairs and tests in garages and dealers; and molding products, precision parts, and system equipment, as well as electronic brake systems. In addition, the company manufactures and supplies rigid polyurethane foam/wastewater treatment carriers; carbodilite, a high-performance resin additive; bipolar plates for fuel cells; and amorphous carbon products, as well as shirts, uniforms, mobilons/elastomers, and oikos products. Further, it redevelops unused plant sites; leases office and commercial facilities; and sells housing lots. Nisshinbo Holdings Inc. was founded in 1907 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8650",
        "website": "http://www.nisshinbo.co.jp",
        "full_time_employees": 21725
    },
    "NO4.F": {
        "short_name": "NORITAKE CO. LTD",
        "long_name": "Noritake Co., Limited",
        "summary": "Noritake Co., Limited manufactures and sells industrial, ceramic and material, tabletop, and engineering products in Japan and internationally. The company offers industrial products, such as abrasive wheels, coated abrasives, diamond and CBN tools, and grinding and polishing related products to automotive, steel, and bearing industries. Its ceramics and materials products include electronic pastes for multilayer ceramic capacitors and other electronic parts; thick film circuit boards for automotive, medical instruments, and light emitting diodes; and vacuum fluorescent displays and ceramic cores. In addition, the company develops and produces various engineering equipment, such as mixers for combining ingredients in chemical, medical, and food products; and filtration systems in grinding and polishing processes, as well as heating equipment for automobiles, electronic components, and energy-related industries. Further, it offers tabletop products comprising tableware for dining. Noritake Co., Limited was founded in 1904 and is headquartered in Nagoya, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "451-8501",
        "website": "http://www.noritake.co.jp",
        "full_time_employees": 5120
    },
    "SSUMF": {
        "short_name": "SUMITOMO CORP",
        "long_name": "Sumitomo Corporation",
        "summary": "Sumitomo Corporation imports, exports, and sells various goods and commodities worldwide. The company's Metal Products segment offers steel sheets and tubular products; and non-ferrous metals, such as aluminum and titanium. Its Transportation & Construction Systems segment manufactures, sells, services, leases, and finances ships, aircraft, aerospace equipment, and automotive and related products; and deals in, rents, and trades in construction, mining and agricultural machinery, and industrial vehicles. The company's Infrastructure segment provides engineering, procurement, and construction services; retails electricity; and offers delivery, customs clearance, transportation, and insurance services. It also engages in the development and operation of industrial parks; and industrial facilities and equipment, water, transportation systems and infrastructure, airports, smart city project, environmental solutions, and storage battery businesses. Its Media & Digital segment engages in the cable television, multi-channel programming distribution, movies, digital media-related, video content-related, TV shopping, e-commerce, ICT platform, digital solution, corporate venture capital, cellular phones, gift cards, and smart communications platform businesses, as well as provision of value-added services. The company's Living Related & Real Estate segment operates food supermarkets and drugstore chains; offers vegetables, fruits, and meats; and trades in cement, wood, building materials, and biomass, as well as buildings, retail facilities, residences, logistics facilities, and real estate funds. Its Mineral Resources, Energy, Chemical & Electronics segment develops and trades in mineral and energy resources, commodity derivatives, liquefied petroleum gas, battery, carbon products, plastics, organic and inorganic chemicals, pharmaceuticals, agricultural chemicals, fertilizers, and animal drugs. Sumitomo Corporation was founded in 1919 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8601",
        "website": "http://www.sumitomocorp.com",
        "full_time_employees": 74920
    },
    "SSUMY": {
        "short_name": "SUMITOMO CORP",
        "long_name": "Sumitomo Corporation",
        "summary": "Sumitomo Corporation imports, exports, and sells various goods and commodities worldwide. The company's Metal Products segment offers steel sheets and tubular products; and non-ferrous metals, such as aluminum and titanium. Its Transportation & Construction Systems segment manufactures, sells, services, leases, and finances ships, aircraft, aerospace equipment, and automotive and related products; and deals in, rents, and trades in construction, mining and agricultural machinery, and industrial vehicles. The company's Infrastructure segment provides engineering, procurement, and construction services; retails electricity; and offers delivery, customs clearance, transportation, and insurance services. It also engages in the development and operation of industrial parks; and industrial facilities and equipment, water, transportation systems and infrastructure, airports, smart city project, environmental solutions, and storage battery businesses. Its Media & Digital segment engages in the cable television, multi-channel programming distribution, movies, digital media-related, video content-related, TV shopping, e-commerce, ICT platform, digital solution, corporate venture capital, cellular phones, gift cards, and smart communications platform businesses, as well as provision of value-added services. The company's Living Related & Real Estate segment operates food supermarkets and drugstore chains; offers vegetables, fruits, and meats; and trades in cement, wood, building materials, and biomass, as well as buildings, retail facilities, residences, logistics facilities, and real estate funds. Its Mineral Resources, Energy, Chemical & Electronics segment develops and trades in mineral and energy resources, commodity derivatives, liquefied petroleum gas, battery, carbon products, plastics, organic and inorganic chemicals, pharmaceuticals, agricultural chemicals, fertilizers, and animal drugs. Sumitomo Corporation was founded in 1919 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8601",
        "website": "http://www.sumitomocorp.com",
        "full_time_employees": 74920
    },
    "SUMA.F": {
        "short_name": "SUMITOMO CORP.",
        "long_name": "Sumitomo Corporation",
        "summary": "Sumitomo Corporation imports, exports, and sells various goods and commodities worldwide. The company's Metal Products segment offers steel sheets and tubular products; and non-ferrous metals, such as aluminum and titanium. Its Transportation & Construction Systems segment manufactures, sells, services, leases, and finances ships, aircraft, aerospace equipment, and automotive and related products; and deals in, rents, and trades in construction, mining and agricultural machinery, and industrial vehicles. The company's Infrastructure segment provides engineering, procurement, and construction services; retails electricity; and offers delivery, customs clearance, transportation, and insurance services. It also engages in the development and operation of industrial parks; and industrial facilities and equipment, water, transportation systems and infrastructure, airports, smart city project, environmental solutions, and storage battery businesses. Its Media & Digital segment engages in the cable television, multi-channel programming distribution, movies, digital media-related, video content-related, TV shopping, e-commerce, ICT platform, digital solution, corporate venture capital, cellular phones, gift cards, and smart communications platform businesses, as well as provision of value-added services. The company's Living Related & Real Estate segment operates food supermarkets and drugstore chains; offers vegetables, fruits, and meats; and trades in cement, wood, building materials, and biomass, as well as buildings, retail facilities, residences, logistics facilities, and real estate funds. Its Mineral Resources, Energy, Chemical & Electronics segment develops and trades in mineral and energy resources, commodity derivatives, liquefied petroleum gas, battery, carbon products, plastics, organic and inorganic chemicals, pharmaceuticals, agricultural chemicals, fertilizers, and animal drugs. Sumitomo Corporation was founded in 1919 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8601",
        "website": "http://www.sumitomocorp.com",
        "full_time_employees": 74920
    },
    "SUMB.F": {
        "short_name": "SUMITOMO CORP. SP. ADR 1",
        "long_name": "Sumitomo Corporation",
        "summary": "Sumitomo Corporation imports, exports, and sells various goods and commodities worldwide. The company's Metal Products segment offers steel sheets and tubular products; and non-ferrous metals, such as aluminum and titanium. Its Transportation & Construction Systems segment manufactures, sells, services, leases, and finances ships, aircraft, aerospace equipment, and automotive and related products; and deals in, rents, and trades in construction, mining and agricultural machinery, and industrial vehicles. The company's Infrastructure segment provides engineering, procurement, and construction services; retails electricity; and offers delivery, customs clearance, transportation, and insurance services. It also engages in the development and operation of industrial parks; and industrial facilities and equipment, water, transportation systems and infrastructure, airports, smart city project, environmental solutions, and storage battery businesses. Its Media & Digital segment engages in the cable television, multi-channel programming distribution, movies, digital media-related, video content-related, TV shopping, e-commerce, ICT platform, digital solution, corporate venture capital, cellular phones, gift cards, and smart communications platform businesses, as well as provision of value-added services. The company's Living Related & Real Estate segment operates food supermarkets and drugstore chains; offers vegetables, fruits, and meats; and trades in cement, wood, building materials, and biomass, as well as buildings, retail facilities, residences, logistics facilities, and real estate funds. Its Mineral Resources, Energy, Chemical & Electronics segment develops and trades in mineral and energy resources, commodity derivatives, liquefied petroleum gas, battery, carbon products, plastics, organic and inorganic chemicals, pharmaceuticals, agricultural chemicals, fertilizers, and animal drugs. Sumitomo Corporation was founded in 1919 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8601",
        "website": "http://www.sumitomocorp.com",
        "full_time_employees": 74920
    },
    "SZHFF": {
        "short_name": "SOJITZ CORPORATION",
        "long_name": "Sojitz Corporation",
        "summary": "Sojitz Corporation operates as a general trading company. It offers automotive parts and components; supply chain management; and auto-financing services, as well as internet and digital technologies. The company also provides aircraft leasing/part-out; engineering, procurement, and construction; cargo transport infrastructure; sales representation for commercial/defense; business jet; airport management; railcar maintenance, repair, and overhaul; energy management, system integration, software development, and cloud and managed; and daycare and after-school care management services. In addition, it engages in the medical infrastructure, surface mounter sales, and plant project; new building, secondhand ships, ship chartering, and ship equipment and owning; and tuna and vegetable farming, confectionery, bakery, and grain port businesses. Further, the company constructs, operates, and generates solar, wind, biomass, and gas fired power; LNG plant; LNG receiving and regasification terminals, as well as constructs network for telecommunication carriers; and data centers. Additionally, it mines and smelts coal, and rare and non-ferrous metals; prints 3D metal; and offers exfoliated vermiculite. The company also trades in ferrous materials, thermal coal, non-ferrous and precious metals, and industrial minerals and steel production materials; methanol, plastic resins, industrial salts, C5 and petroleum resins, and rare earths; livestock feed raw materials; industrial machinery and bearings; and carbon products. In addition, it refines sugar; produces and sells fertilizers, feed, woodchip, and meat products; retail foods; invests in and manages shopping centers; distributes building materials, brand and consumer goods, and still products; sells textiles; mills flour; develops industrial park, condominiums, offices, shopping centers, and urban infrastructure; and offers communications and IT equipment. The company was founded in 2003 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8691",
        "website": "http://www.sojitz.com",
        "full_time_employees": null
    },
    "XEB.F": {
        "short_name": "SOJITZ CORP.",
        "long_name": "Sojitz Corporation",
        "summary": "Sojitz Corporation operates as a general trading company. It offers automotive parts and components; supply chain management; and auto-financing services, as well as internet and digital technologies. The company also provides aircraft leasing/part-out; engineering, procurement, and construction; cargo transport infrastructure; sales representation for commercial/defense; business jet; airport management; railcar maintenance, repair, and overhaul; energy management, system integration, software development, and cloud and managed; and daycare and after-school care management services. In addition, it engages in the medical infrastructure, surface mounter sales, and plant project; new building, secondhand ships, ship chartering, and ship equipment and owning; and tuna and vegetable farming, confectionery, bakery, and grain port businesses. Further, the company constructs, operates, and generates solar, wind, biomass, and gas fired power; LNG plant; LNG receiving and regasification terminals, as well as constructs network for telecommunication carriers; and data centers. Additionally, it mines and smelts coal, and rare and non-ferrous metals; prints 3D metal; and offers exfoliated vermiculite. The company also trades in ferrous materials, thermal coal, non-ferrous and precious metals, and industrial minerals and steel production materials; methanol, plastic resins, industrial salts, C5 and petroleum resins, and rare earths; livestock feed raw materials; industrial machinery and bearings; and carbon products. In addition, it refines sugar; produces and sells fertilizers, feed, woodchip, and meat products; retail foods; invests in and manages shopping centers; distributes building materials, brand and consumer goods, and still products; sells textiles; mills flour; develops industrial park, condominiums, offices, shopping centers, and urban infrastructure; and offers communications and IT equipment. The company was founded in 2003 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8691",
        "website": "http://www.sojitz.com",
        "full_time_employees": null
    }
}