{
    "3341.T": {
        "short_name": "NIHON CHOUZAI CO LTD",
        "long_name": "Nihon Chouzai Co.,Ltd.",
        "summary": "Nihon Chouzai Co., Ltd. engages in the management of health insurance dispensing chain pharmacies in Japan. The company also manufactures and sells generic drugs to medical institutions and other pharmacies. In addition, it offers temporary staffing services for pharmacist; and employment services for physicians and registered sales personnel, and other healthcare professionals. Further, the company provides studies and research services for pharmaceutical companies and organizations; information and consulting services for industries associated with pharmaceuticals and healthcare; and other services. Nihon Chouzai Co., Ltd. was founded in 1980 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-6737",
        "website": "http://www.nicho.co.jp",
        "market_cap": 48370642944
    },
    "4502.T": {
        "short_name": "TAKEDA PHARMACEUTICAL CO LTD",
        "long_name": "Takeda Pharmaceutical Company Limited",
        "summary": "Takeda Pharmaceutical Company Limited engages in the research, development, manufacturing, and marketing of pharmaceutical products, over-the-counter medicines and quasi-drug consumer products, and other healthcare products. It offers pharmaceutical products in the areas of gastroenterology; oncology; neuroscience; and rare diseases, such as rare metabolic and hematology, and heredity angioedema, as well as plasma-derived therapies and vaccines. The company provides its products under the ENTYVIO, GATTEX/REVESTIVE, ALOFISEL, NATPARA, ADYNOVATE/ADYNOVI, TAKHZYRO, ELAPRASE, VPRIV, GAMMAGARD LIQUID/KIOVIG, HYQVIA, CUVITRU, ALBUMIN/FLEXBUMIN, NINLARO, and ALUNBRIG brands. It operates in Japan, the United States, Europe and Canada, Russia/CIS, Latin America, rest of Asia, the Middle East, Oceania, and Africa. The company has licensing agreements with TESARO, Inc., Denali Therapeutics, and Wave Life Sciences Ltd; collaboration agreements with Rani Therapeutics LLC, Novimmune S.A., AB Biosciences Inc., Sosei Group Corporation, and LogicBio Therapeutics, Inc.; strategic collaboration with Prometheus Biosciences, Inc; a license and research agreement with The University of Texas MD Anderson Cancer Center; a research collaboration agreements with Enzyre BV and Cerevance; a collaboration agreement with Artisan Bio, Inc.; and a multi-target rare disease collaboration with Evox Therapeutics Ltd., as well as licensing agreement with ProThera Biologics Inc. It also has a strategic alliance with Egle Therapeutics SAS and Evotec SE; a strategic partnership with Neurocrine Biosciences, Inc.; Carmine Therapeutics and HemoShear Therapeutics, LLC; strategic collaboration with KSQ Therapeutics to research, develop, and commercialize immune-based therapies for cancer; and strategic collaboration with Anima Biotech. Takeda Pharmaceutical Company Limited was founded in 1781 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8668",
        "website": "http://www.takeda.com",
        "market_cap": 5957177835520
    },
    "4506.T": {
        "short_name": "SUMITOMO DAINIPPON PHARMA CO LT",
        "long_name": "Sumitomo Dainippon Pharma Co., Ltd.",
        "summary": "Sumitomo Dainippon Pharma Co., Ltd. manufactures and sells pharmaceuticals, food ingredients and additives, veterinary medicines, diagnostics, and others. The company offers pharmaceutical products, such as therapeutic agents for Parkinson's disease, depression, type 2 diabetes, systemic fungal infection, pruritus, chronic obstructive pulmonary disease, angina pectoris, and arrhythmia. It also provides atypical antipsychotic, antiepileptic, carbapenem antibiotic, and gastroprokine products; and Anderson-Fabry disease drugs. In addition, the company offers food ingredients and additives, such as polysaccharides, and seasonings, such as soups or bouillons; and chemical product materials consisting of pharmaceutical excipients, personal care products, coatings and industrial materials, and electronic materials. Further, it provides veterinary medicines for companion animals, primarily dogs and cats; and livestock comprising cattle, swine, poultry, horses, and aquacultured fish. Sumitomo Dainippon Pharma Co., Ltd. has partnerships with Healios K.K.; Keio University; RIKEN; the Center for iPS Cell Research and Application (CiRA); Kyoto University; and Aikomi Co., Ltd., as well as a joint development agreement with SanBio, Inc. It also has a strategic research collaboration agreement with Gain Therapeutics, Inc. for the research and development of structurally targeted allosteric regulators to restore functional activity of defective lysosomal enzymes in rare genetic and demyelinating diseases. The company was formerly known as Dainippon Sumitomo Pharma Co., Ltd. and changed its name to Sumitomo Dainippon Pharma Co., Ltd. in June 2014. Sumitomo Dainippon Pharma Co., Ltd. was founded in 1897 and is headquartered in Osaka, Japan. Sumitomo Dainippon Pharma Co., Ltd. is a subsidiary of Sumitomo Chemical Company, Limited.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0045",
        "website": "http://www.ds-pharma.com",
        "market_cap": 937218932736
    },
    "4507.T": {
        "short_name": "SHIONOGI & CO",
        "long_name": "Shionogi & Co., Ltd.",
        "summary": "Shionogi & Co., Ltd. engages in the research, development, manufacture, and distribution of pharmaceuticals, diagnostic reagents, and medical devices in Japan. Its primary products Tivicay for HIV treatment; Mulpleta for the treatment of thrombocytopenia; Xofluza, an influenza drug; Symproic for opioid-induced constipation treatment; and Fetroja, a multidrug-resistant for gram-negative bacterial infection treatment. The company also offers antibody detection kits for COVID-19. Shionogi & Co., Ltd. has collaboration agreements with InveniAI, LLC.; Hsiri Therapeutics Inc.; Nagasaki University; Roche Group to develop and commercialize Xofluza; and Nagasaki University and The Kitasato Institute to develop antimalarial drugs and vaccines. The company was formerly known as Shionogi Shoten Co., Ltd. and changed its name to Shionogi & Co., Ltd. in 1943. Shionogi & Co., Ltd. was founded in 1878 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0045",
        "website": "http://www.shionogi.com",
        "market_cap": 1745777983488
    },
    "4512.T": {
        "short_name": "WAKAMOTO PHARMACEUTICAL CO",
        "long_name": "Wakamoto Pharmaceutical Co.,Ltd.",
        "summary": "Wakamoto Pharmaceutical Co., Ltd. manufactures and sells ethical and non-prescription drugs in Japan. The company offers Strong Wakamoto, a gastrointestinal drug for digestion, intestinal regulation, and nutritional supplementation. It also provides AVANTBISE oral tablets, a supplement of bacteria to restore the balance of oral flora; and medicated toothpaste. The company was formerly known as Society for Nutrition and Raising Children Co., Ltd. and changed its name to Wakamoto Pharmaceutical Co., Ltd. in July 1943. Wakamoto Pharmaceutical Co., Ltd. was founded in 1929 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8330",
        "website": "http://www.wakamoto-pharm.co.jp",
        "market_cap": 11419030528
    },
    "4516.T": {
        "short_name": "NIPPON SHINYAKU CO",
        "long_name": "Nippon Shinyaku Co., Ltd.",
        "summary": "Nippon Shinyaku Co., Ltd. manufactures and sells pharmaceuticals and foodstuffs in Japan, Switzerland, and internationally. The company operates through Pharmaceuticals and Functional Food segments. It offers drugs for urological diseases, inflammation and allergies, hematologic malignancies, cardiovascular and metabolic diseases, gastrointestinal disorders, and other diseases. The company's products include Zalutia for urinary disorder caused by benign prostatic; Eviprostat for prostatic hypertrophy; Bladderon for pollakisuria; Estracyt for prostate cancer; Cialis for erectile dysfunction; Vidaza for myelodysplastic syndrome; Cylocide for solid tumor and acute leukemia; CylocideN for relapsed and refractory acute leukemia and malignant lymphoma; Gazyva for humanized anti-CD20 monoclonal antibody; Defiterio sinusoidal obstruction syndrome; and Trisenox and Amnolake for relapsed and refractory acute promyelocytic leukemia. Nippon Shinyaku Co., Ltd.'s products also comprise Uptravi, Adcirca, and Opsumit for pulmonary arterial hypertension; VILTEPSO for muscular dystrophy; Lunabel LD and Lunabel ULD for dysmenorrhea; Erizas, a dry powder inhaler solution for allergic rhinitis; Azunol Gargle liquid, a gargling solution containing azulene; Isobide for oral osmotic diuresis/meniere's disease; Cephadol for vertigo; Livostin for allergic rhinitis and conjunctivitis; Regtect for maintaining alcohol abstinence; and Onetram and Tramal for cancer and chronic pain. In addition, it researches, develops, and markets drugs in the areas of gynecology, otorhinolaryngology, and orthopedics. Further, the company provides functional foods, such as health food ingredients, preservatives, protein preparations, supplements, and spice and condiments. Nippon Shinyaku Co., Ltd. was founded in 1911 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "601-8550",
        "website": "http://www.nippon-shinyaku.co.jp",
        "market_cap": 573860282368
    },
    "4517.T": {
        "short_name": "BIOFERMIN PHARMACEUTICAL CO",
        "long_name": "Biofermin Pharmaceutical Co., Ltd.",
        "summary": "Biofermin Pharmaceutical Co., Ltd. manufactures and sells drugs and quasi-drugs in Japan. It offers drugs for the treatment of diarrhea, constipation, and stomach digestion; and veterinary medicines, pesticides and other chemicals, cosmetics, medical equipment, foods, beverages, food additives, feeds, feed additives, and various tests. The company was formerly known as Kobe hygiene Laboratory Co., Ltd. and changed its name to Biofermin Pharmaceutical Co., Ltd. in March 1949. The company was founded in 1917 and is headquartered in Kobe, Japan. Biofermin Pharmaceutical Co., Ltd. is a subsidiary of Taisho Pharmaceutical Co., Ltd.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kobe",
        "zipcode": "650-0021",
        "website": "http://www.biofermin.co.jp",
        "market_cap": 37319569408
    },
    "4521.T": {
        "short_name": "KAKEN PHARMACEUTICAL",
        "long_name": "Kaken Pharmaceutical Co., Ltd.",
        "summary": "Kaken Pharmaceutical Co., Ltd. produces, markets, and sells medical products, medical devices, and agrochemicals in Japan and internationally. It offers pharmaceutical products and medical devices, such as Clenafin, a topical treatment for onychomycosis; Artz, an anti-osteoarthritis agent; Seprafilm, a semitransparent film-type absorbable adhesion barrier, which is applied to damaged tissue; Fiblast, a spray-on drug for the treatment of pressure ulcers and other skin ulcers; Regroth, a medicinal product for periodontal regeneration; and Hernicore for the treatment of lumbar disc herniation. The company also provides Adofeed, a pain- and inflammation-relieving plaster; Ebrantil for the treatment of dysuria and hypertension; Procylin, an oral-use prostaglandin I2 analog; Lipidil, an anti-hyperlipidemia agent; Mentax, an anti-trichophyton agent; and Loxoprofen Na Tape, a pain-relieving and anti-inflammatory plaster. In addition, it offers Ropion, a pain relief injection; and agrochemicals and animal health products, including Polyoxins that is used as fungicide; Pentoxazone, a rice herbicide; and Salinomycin, an anti-coccidial feed additive for chicken. Further, the company is developing BBI-4000 that has completed phase III clinical trial for primary axillary hyperhidrosis; KMW-1, which is in phase III clinical trial for the removal of eschar with thermal burns; KAR for treatment of hide lice infestation; and KP-607, which is in phase II clinical trial for the treatment of onychomycosis. Additionally, it is involved in the rental of Bunkyo Green Court, a commercial complex. The company offers its products under the Mentax Lotrimin Ultra, Mentax Butena, Mentax, Kaifen, Fiblast, and Jublia brands. It has license agreements with Corbus Pharmaceuticals Holdings, Inc. and Arbor Pharmaceuticals, LLC. Kaken Pharmaceutical Co., Ltd. was founded in 1917 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "113-8650",
        "website": "http://www.kaken.co.jp",
        "market_cap": 181055864832
    },
    "4523.T": {
        "short_name": "EISAI CO",
        "long_name": "Eisai Co., Ltd.",
        "summary": "Eisai Co., Ltd. offers pharmaceutical products in Japan. It offers Aricept for the treatment of alzheimer's disease/dementia with Lewy bodies; Methycobal for the treatment of peripheral neuropathy; and Fycompa, an antiepileptic drug for the adjunctive treatment of partial-onset and primary generalized tonic-clonic seizures. The company also provides Lyrica for pain treatment; Dayvigo, an anti-insomnia drug for the treatment of adults with insomnia; Lenvima, an anticancer agent/molecular targeted medicine for the treatment of thyroid cancer, renal cell carcinoma in combination with everolimus, and hepatocellular carcinoma; and Halaven, an anticancer agent/microtubule dynamics inhibitor for the treatment of breast cancer and liposarcoma. In addition, it offers Pariet, a proton-pump inhibitor for the treatment of gastric and duodenal ulcers, reflux esophagitis, and eradication of Helicobacter pylori infections, etc.; Humira, a fully human anti-TNF-a monoclonal antibody for the treatment of autoimmune diseases, such as rheumatoid arthritis; and Chocola BB plus, a vitamin B2 preparation for rough skin and stomatitis, as well as various products, which include third-class OTC drugs, designated quasi-drugs, and food with nutrient function. Eisai Co., Ltd. has a research collaboration agreement with Wren Therapeutics Ltd. for the discovery of small molecules that target synuclein for the potential treatment of synucleinopathies, including Parkinson's disease and dementia with Lewy bodies; and a collaboration with BioLabs for the launch of the Eisai Innovation Center BioLabs, a shared lab and office space for start-ups to innovate in the field of neurological diseases. The company was formerly known as Nihon Eisai Co., Ltd. and changed its name to Eisai Co., Ltd. in 1955. Eisai Co., Ltd. was founded in 1941 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "112-8088",
        "website": "http://www.eisai.co.jp",
        "market_cap": 2865779965952
    },
    "4524.T": {
        "short_name": "MORISHITA JINTAN",
        "long_name": "Morishita Jintan Co., Ltd.",
        "summary": "Morishita Jintan Co., Ltd. produces and distributes pharmaceuticals, quasi drugs, medical devices, and food products in Japan. It operates through Healthcare Business and Capsule Business divisions. The Healthcare Business division manufactures and sells Jintan branded products, as well as engages in OEM/ODM of dietary supplements, cosmetics, foods, etc. The Capsule Business division is involved in the OEM/ODM of pharmaceuticals, foods, etc., as well as the development of industrial use capsules. The company was founded in 1893 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "540-8566",
        "website": "http://www.jintan.co.jp",
        "market_cap": 7995620864
    },
    "4530.T": {
        "short_name": "HISAMITSU PHARMACEUTICAL CO INC",
        "long_name": "Hisamitsu Pharmaceutical Co., Inc.",
        "summary": "Hisamitsu Pharmaceutical Co., Inc. engages in the research and development, manufacture, purchase, and sale of pharmaceuticals in Japan. The company provides analgesic / anti-inflammatory patches; athlete's foot / ringworm remedy products; allergy-only rhinitis drugs; eye drops; high cholesterol improving drugs; acne remedies; cooling sheets; and supporters for knee, waist, elbow, calf and ankle. It also provides cooling sprays; bactericidal antibacterial spray and deodorant spray; ship fixing sheet; adhesive plasters for magnetic products; skin care products; sweat sheet; massage roller gel and oil spray; thermal equipment, and dietary supplements. The company offers its products under the Salon pass, Salonship, Air Salon Pass, Fatus, Butena Rock, Allegra, Direct pasting, Choleston, Life Cera, Deco Deco Cool, Children Robin Eye Plus. Eye cool, MSM, and other brand names. It sells its products in North America, Central and South America, Asia, Oceania, the Middle East, Africa, and Europe. Hisamitsu Pharmaceutical Co., Inc. was founded in 1847 and is headquartered in Tosu, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tosu",
        "zipcode": "841-0017",
        "website": "http://www.hisamitsu.co.jp",
        "market_cap": 475283324928
    },
    "4534.T": {
        "short_name": "MOCHIDA PHARMACEUTICAL CO",
        "long_name": "Mochida Pharmaceutical Co., Ltd.",
        "summary": "Mochida Pharmaceutical Co., Ltd. produces and sells pharmaceuticals, skincare products, and diagnostics solutions in Japan. The company provides cardiovascular, analgesic, gastrointestinal, neurological, anti-infective, antidiabetics, and anticancer products, as well as hormone and biological preparations, and biosimilars; diagnostic reagents, such as reagents for fertility/infertility and other reagents; and face and body care, hair care, and skincare products, as well as dermatology, psychiatry, obstetrics, and gynecology products. It also developing drugs for the treatment of intractable diseases. The company has collaboration agreements with Amarin Corporation plc for the development and commercialization of ethyl icosapentate products; and Gene Techno Science Co., Ltd. to develop new regenerative medicine for the treatment of digestive rare and intractable diseases, such as congenital isolated hypoganglionosis. Mochida Pharmaceutical Co., Ltd. was founded in 1913 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "162-0845",
        "website": "http://www.mochida.co.jp",
        "market_cap": 143318908928
    },
    "4538.T": {
        "short_name": "FUSO PHARMACEUTICAL INDUSTRIES",
        "long_name": "Fuso Pharmaceutical Industries,Ltd.",
        "summary": "Fuso Pharmaceutical Industries,Ltd. manufactures and sells pharmaceutical products in Japan. It primarily offers dialysates for artificial kidneys. The company was founded in 1937 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0045",
        "website": "http://www.fuso-pharm.co.jp",
        "market_cap": 20698550272
    },
    "4539.T": {
        "short_name": "NIPPON CHEMIPHAR CO",
        "long_name": "Nippon Chemiphar Co., Ltd.",
        "summary": "Nippon Chemiphar Co., Ltd., together with its subsidiaries, manufactures, markets, imports, exports, and sells, ethical pharmaceuticals and diagnostic agents in Japan and internationally. It offers diagnostic products, such as IgE NC, a diagnostic kit that provides results and reveals total IgE levels, as well as 57 individual allergen reagents; and DP3000, a device for allergen-specific IgE measurements. The company also develops NC-2400, a PPAR-delta agonist; NC-2500, a novel advanced xanthine oxidoreductase inhibitor for the treatment of hyperuricemia/gout; and NC-2600, a P2X4 receptor antagonist for the treatment of neuropathic pain. In addition, it develops NC-2700, a novel urate transporter 1 inhibitor that enhance excretion urate to urine; NC-2800, a delta opioid receptor agonist for the treatment of depression/anxiety; Uralyt-U, an alkalization therapeutic drug; Soleton, an analgesic and anti-inflammatory drug; and Calvan, a hypertension therapeutic drug. Further, the company provides quasi-drugs, nutrients, health foods, cosmetics, and various type of creams. It distributes its generic pharmaceuticals through wholesalers to hospitals and pharmacies. The company was formerly known as Hitachi Chemical Co., Ltd. and changed its name to Nippon Chemiphar Co., Ltd. in 1970. Nippon Chemiphar Co., Ltd. was founded in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0032",
        "website": "http://www.chemiphar.co.jp",
        "market_cap": 9132083200
    },
    "4540.T": {
        "short_name": "TSUMURA & CO",
        "long_name": "Tsumura & Co.",
        "summary": "Tsumura & Co. engages in the manufacture and sale of pharmaceutical products worldwide. The company offers Kampo extract intermediates and granular Kampo formulations. It is involved in the procurement, selection and processing, and storage of raw material crude drugs and crude drug pieces for decoction; manufacture of Kampo powdered extracts and traditional Chinese medicines, as well as Kampo powdered extracts; and sale of pharmaceuticals and food products. The company was founded in 1893 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-8521",
        "website": "http://www.tsumura.co.jp",
        "market_cap": 283081080832
    },
    "4541.T": {
        "short_name": "NICHI-IKO PHARMACEUTICAL CO",
        "long_name": "Nichi-Iko Pharmaceutical Co., Ltd.",
        "summary": "Nichi-Iko Pharmaceutical Co., Ltd. manufactures, sells, imports, and distributes various pharmaceutical products. It primarily focuses on the production of generic drugs. The company offers antidiabetic agents, antacids, antireflux agents, beta-blocker, hypnotic and sedative, angiotensin ? antagonist, angiotensin ? antagonist/diuretic combination, dyslipidaemic agent, and calcium antagonist products. It also provides treatments for circulatory, digestive, respiratory, central and peripheral nervous systems, and others. In addition, the company engages in the packaging design business. Further, it exports its products. The company was formerly known as Nihon Iyakuhin Kogyo Co., Ltd. and changed its name to Nichi-Iko Pharmaceutical Co., Ltd. in 2005. Nichi-Iko Pharmaceutical Co., Ltd. was founded in 1965 and is headquartered in Toyama, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Toyama",
        "zipcode": "930-8583",
        "website": "http://www.nichiiko.co.jp",
        "market_cap": 61446148096
    },
    "4547.T": {
        "short_name": "KISSEI PHARMACEUTICAL CO",
        "long_name": "Kissei Pharmaceutical Co., Ltd.",
        "summary": "Kissei Pharmaceutical Co., Ltd. engages in the research, development, manufacture, and sale of pharmaceutical products primarily in Japan. It offers Urief and Urief OD tablets for the treatment of dysuria; Glufast, Glubes, and Marizev tablets for type 2 diabetes; Darbepoetin Alfa BS and Epoetin Alfa BS injections for the treatment of renal anemia; Beova tablets for overactive bladder treatment; P-TOL chewable tablets for treating hyperphosphatemia; and Minirin Melt OD tablets for nocturia due to nocturnal polyuria in males, central diabetes insipidus, and nocturnal enuresis resulted from decrease of urine osmolality. The company's products in pipeline include KPS-0373 that has completed Phase III clinical trial to treat spinocerebellar ataxia; CCX168, which has completed Phase III clinical trial for the treatment of microscopic polyangiitis and granulomatosis with polyangiitis; AJM300, which is in Phase III clinical trial to treat ulcerative colitis; R788 that is in Phase III clinical trial to treat chronic idiopathic thrombocytopenic purpura; and MR13A9, which is in Phase III clinical trial to treat uremic pruritus in dialysis patients. It is also developing KLH-2109 for treating endometriosis and uterine fibroids; KDT-3594 for the treatment of Parkinson's disease; Silodosin for dysuria associated with benign prostatic hyperplasia; Mitiglinide for type 2 diabetes mellitus; and Bedoradrine for the treatment of acute exacerbation of asthma. In addition, it develops and sells protein controlled and energy supply foods; and purchases and sells related materials, as well as offers system development and information processing, construction contracting, equipment and facility management, and information gathering and development support services. The company was formerly known as Kissei Yakuhin Kogyo Co., Ltd. and changed its name to Kissei Pharmaceutical Co., Ltd. in October 1964. The company was founded in 1946 and is headquartered in Matsumoto, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Matsumoto",
        "zipcode": "399-8710",
        "website": "http://www.kissei.co.jp",
        "market_cap": 100993818624
    },
    "4551.T": {
        "short_name": "TORII PHARMACEUTICAL CO",
        "long_name": "Torii Pharmaceutical Co., Ltd.",
        "summary": "Torii Pharmaceutical Co., Ltd. manufactures and markets pharmaceutical products in Japan. It offers therapeutic agents, such as Riona for the treatment of hyperphosphatemia; and REMITCH, an oral therapeutic agent used for the treatment of pruritus in dialysis and liver disease patients. The company also provides ANTEBATE that is used for the treatment of skin diseases, such as atopic dermatitis and contact dermatitis by reducing inflammation; allergen immunotherapy tablets comprising CEDARCURE and MITICURE; and CEDARTOLEN, a sublingual immunotherapy drug. Torii Pharmaceutical Co., Ltd. markets its products primarily through medical representatives for medical professionals. The company was formerly known as Torii Shoten K.K and changed its name to Torii Pharmaceutical Co., Ltd. in May 1949. The company was founded in 1872 and is headquartered in Tokyo, Japan. Torii Pharmaceutical Co., Ltd. is a subsidiary of Japan Tobacco Inc.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8439",
        "website": "http://www.torii.co.jp",
        "market_cap": 71619297280
    },
    "4553.T": {
        "short_name": "TOWA PHARMACEUTICAL CO",
        "long_name": "Towa Pharmaceutical Co., Ltd.",
        "summary": "Towa Pharmaceutical Co., Ltd., together with its subsidiaries, researches, develops, produces, and sells ethical drugs, active pharmaceutical ingredients, and intermediates in Japan. The company provides its products in the therapeutic areas of diabetes, digestive system, nervous system, and allergic diseases, as well as vitamins, antibiotics, and oncology products. It had a portfolio of approximately 700 drug products. Towa Pharmaceutical Co., Ltd. was founded in 1951 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "571-8580",
        "website": "http://www.towayakuhin.co.jp",
        "market_cap": 125397778432
    },
    "4559.T": {
        "short_name": "ZERIA PHARMACEUTICAL",
        "long_name": "Zeria Pharmaceutical Co., Ltd.",
        "summary": "Zeria Pharmaceutical Co., Ltd., together with its subsidiaries, manufactures, sells, imports, and exports pharmaceuticals, non-pharmaceutical products, veterinary pharmaceuticals, agricultural chemicals, industrial chemicals, and reagents in Japan and internationally. It also provides cosmetics, health foods, alcoholic beverages, soft drinks, food additives, livestock feed, hygienic goods, medical devices, health equipment, hygiene facilities and equipment, beauty appliances, and measuring and analytical equipment. The company offers products in the gastrointestinal field, including therapeutic agents for functional dyspepsia, ulcerative colitis, Crohn's disease, and gastritis and ulcers; zinc containing anti-ulcerants; oral bowel cleansing agents; laxatives; therapeutic agents for hypophosphatemia; long-acting calcium channel blockers; oral NSAID; anti-leukopenia after radiotherapy products; sclerosing agent for varicose veins; anti-inflammatory topical blood circulation enhancers; non-steroidal anti-inflammatory ophthalmic solutions; absorbable topical hemostat products; and proton pump inhibitors. In addition, it offers consumer healthcare products, such as nutritional health drugs, cold remedies, ophthalmic solutions, anti-inflammatory/analgesics, hemorroidal remedies, dermal remedies, quasi-drugs/cosmetics, nutrient tonics, and food for specified health uses. The company was formerly known as Zeria Yakusho Kenkyusho Co., Ltd. and changed its name to Zeria Pharmaceutical Co., Ltd. in May 1970. Zeria Pharmaceutical Co., Ltd. was founded in 1955 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8351",
        "website": "http://www.zeria.co.jp",
        "market_cap": 96104366080
    },
    "4569.T": {
        "short_name": "KYORIN HOLDINGS INC",
        "long_name": "KYORIN Holdings, Inc.",
        "summary": "KYORIN Holdings, Inc., through its subsidiaries, researches and develops, produces, and sells ethical, generic, and over-the-counter drugs in Japan and internationally. It operates through Ethical Pharmaceutical Business and Consumer Healthcare Business segments. The company's products primarily include Flutiform, a drug for the treatment of asthma; Lasvic, an oral quinolone synthetic antibacterial agent; Desalex, an antiallergic agent; Kipres, a product for the treatment of bronchial asthma and allergic rhinitis; NASONEX, an allergic rhinitis therapeutic agent; Uritos and Beova, which are therapeutic agents for overactive bladder; Pentasa, a remedy for ulcerative colitis/Crohn's disease; Mucodyne, a mucoregulan drug; and MONTELUKAST KM, which are generic drugs for the treatment of bronchial asthma and allergic rhinitis. It also provides Milton, a baby bottle disinfectant; Rubysta, a disinfectant cleaner; hand hygiene and skincare products; and prescription medicines and quasi-drugs, diagnostics, and industrial chemicals. In addition, the company is involved in the discovery and evaluation of candidate compounds; and research and analysis of other companies' technologies and collection of information concerning clinical trials business. Further, its pipeline products include KRP-AM1977Y, a quinolone synthetic antibacterial agent; KRP-116D for the treatment of interstitial cystitis; KRP-108P for the treatment of bronchial asthma; and Ad-SGE-REIC for treating Malignant pleural mesothelioma. Additionally, the company's out-licensed products in pipeline comprise FPR2 agonist program and KRP-203. KYORIN Holdings, Inc. was founded in 1923 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-8311",
        "website": "http://www.kyorin-gr.co.jp/en",
        "market_cap": 99965640704
    },
    "4574.T": {
        "short_name": "TAIKO PHARMACEUTICAL CO LTD",
        "long_name": "Taiko Pharmaceutical Co.,Ltd.",
        "summary": "Taiko Pharmaceutical Co.,Ltd. engages in pharmaceuticals, infection control, and other businesses. The company manufactures and sells non-prescription drugs, including gastrointestinal drugs under the Seirogan and Seirogan Toi-A brands for the treatment of loose stools, diarrhea, food and water poisoning, vomiting, and related conditions; and quasi-drugs, such as Trumpet Intestinal Regulator BF for stomach distention, loose stools, and constipation. It also manufactures and sells sanitation control products under the Cleverin brand name to wholesalers, as well as LISPASS Cleverin generator, a machine which emits low concentrations of chlorine dioxide gas; and supplies products using the patented Cleverin technology through OEM agreements and products developed jointly with other companies. In addition, the company manufactures and sells bath additives and pyroligneous acids for horticultural use. It operates in Japan, China, Hong Kong, Taiwan, Thailand, Malaysia, Vietnam, Mongolia, the United States, and Canada. Taiko Pharmaceutical Co.,Ltd. was founded in 1946 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "550-0005",
        "website": "http://www.seirogan.co.jp",
        "market_cap": 46191058944
    },
    "4577.T": {
        "short_name": "DAITO PHARMACEUTICAL CO.LTD",
        "long_name": "Daito Pharmaceutical Co.,Ltd.",
        "summary": "Daito Pharmaceutical Co.,Ltd. manufactures and sells pharmaceutical products worldwide. The company offers various active pharmaceutical ingredients and intermediates, prescription drugs, OTC drugs, and home-delivery medicines; formulations in various forms, such as tablets, capsules, troches, granules, and powders; and contract manufacturing services for formulations of medicinal products to pharmaceutical companies. It also sells health food products. The company was formerly known as Daito Corporation and changed its name to Daito Pharmaceutical Co.,Ltd. in 1992. Daito Pharmaceutical Co.,Ltd. was founded in 1942 and is headquartered in Toyama, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Toyama",
        "zipcode": "939-8567",
        "website": "http://www.daitonet.co.jp",
        "market_cap": 47586193408
    },
    "4581.T": {
        "short_name": "TAISHO PHARMACEUTICAL HLDG CO L",
        "long_name": "Taisho Pharmaceutical Holdings Co., Ltd.",
        "summary": "Taisho Pharmaceutical Holdings Co., Ltd., through its subsidiaries, researches, develops, manufactures, markets, distributes, and sells over-the-counter (OTC) drugs and prescription pharmaceutical products in Japan and internationally. It operates through Self-Medication Operation Group and Prescription Pharmaceutical Operation Group segments. The Self-Medication Operation Group segment offers OTC drugs, quasi-drugs, food products, and general medical and hygiene supplies, such as Lipovitan series of energy drinks; the Pabron series of cold remedies and sinus treatments; the RiUP series of hair re-growth treatment products; the Taisho Kampo series of gastrointestinal treatment products; the Colac series of laxative products; the Naron series and other products for antipyretic analgesics; the Preser series of hemorrhoid treatment products; Hapacol, Efferalgan, Dafalgan, and Tempra for antipyretic analgesics; Counterpain topical anti-inflammatory analgesics; Vitacilina, a dermatological treatment product; and VICKS, a cough suppressant throat lozenges and medicated drops. This segment also engages in the real estate leasing and facility management, and hotel management operations. The Prescription Pharmaceutical Operation Group segment offers ethical drugs, including Edirol, an active vitamin D3 osteoporosis agent; Clarith, a macrolide antibiotic; Palux, a peripheral vasodilator; Bonviva, a bisphosphonate osteoporosis agent; Lusefi, a type 2 diabetes mellitus agent; and LOQOA, a transdermal anti-inflammatory analgesic. This segment has various products under development primarily in therapeutic areas, such as central nervous system, infectious, and metabolic diseases, as well as orthopedic disorders. The company also offers raw materials for pharmaceuticals and quasi-drugs; and supplies health foods and skin care products. Taisho Pharmaceutical Holdings Co., Ltd. was founded in 1912 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "170-8655",
        "website": "http://www.taisho-holdings.co.jp",
        "market_cap": 525180764160
    },
    "4582.T": {
        "short_name": "SYMBIO PHARMACEUTICALS LTD",
        "long_name": "SymBio Pharmaceuticals Limited",
        "summary": "SymBio Pharmaceuticals Limited engages in the research and development, manufacturing, and marketing of pharmaceutical drugs in the areas of oncology and hematology. It primarily develops anti-cancer agents. The company's Treakisym SyB L-0501, an anti-cancer agent, which is marketed for the treatment of non-Hodgkin's lymphoma, multiple myeloma, and chronic lymphocytic leukemia under the TREAKISYM name; and is in the Phase III clinical trial to treat relapsed/refractory diffuse large B-cell lymphoma. It also develops SyB L-1701, a ready-to-dilute formulation; and SyB L-1702, a rapid infusion liquid formulation. In addition, the company develops SyB L-1101, an intravenous formulation, which is in Phase III clinical trial for the treatment of higher-risk myelodysplastic syndromes (HR-MDS); and SyB C-1101, an oral formulation that is in Phase II/III clinical trial in combination with azacitidine to treat HR-MDS. Further, it develops SyB V-1901, an antiviral drug for the treatment of infectious diseases. The company primarily operates in Japan, South Korea, China, Hong Kong, Taiwan, and Singapore. SymBio Pharmaceuticals Limited was founded in 2005 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0001",
        "website": "http://www.symbiopharma.com",
        "market_cap": 48499404800
    },
    "4586.T": {
        "short_name": "MEDRX CO LTD",
        "long_name": "MedRx Co., Ltd",
        "summary": "MedRx Co., Ltd, a pharmaceutical company, develops pharmaceutical drugs based on the transdermal absorption system in Japan. It develops medicines based on Ionic liquid transdermal system. The company's products pipeline include MRX-4TZT, which is in phase II; MRX-5LBT, which is phase III; MRX-10XT, which is in phase I; and MRX-7MLL, which is in pre-clinical stage. It also offers micro needle patches for delivery of vaccines and/or APIs through skin, as well as adhesive skin patches. The company was founded in 2002 and is headquartered in Higashikagawa, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Higashikagawa",
        "zipcode": "769-2712",
        "website": "http://www.medrx.co.jp",
        "market_cap": 4195056384
    },
    "4595.T": {
        "short_name": "MIZUHO MEDY CO LTD",
        "long_name": "Mizuho Medy Co.,Ltd.",
        "summary": "Mizuho Medy Co.,Ltd. researches and develops, manufactures, and sells in-vitro diagnostic products primarily in Japan. The company provides immuno assay test products, such as influenza virus kits; Infectious diseases test kits; fecal occult blood test kits for detection of human hemoglobin and human transferrin in feces; and biochemical liquid stable reagents for professionals. It also offers HCG (midstream test), including digital p-check test for OTC. The company also operates in the United States, Belgium, France, China, South Korea, Singapore, and Taiwan. Mizuho Medy Co.,Ltd. was founded in 1977 and is headquartered in Tosu, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tosu",
        "zipcode": "841-0048",
        "website": "http://www.mizuho-m.co.jp",
        "market_cap": 24097187840
    },
    "4597.T": {
        "short_name": "SOLASIA PHARMA K K",
        "long_name": "Solasia Pharma K.K.",
        "summary": "Solasia Pharma K.K. develops and commercializes drugs in the field of oncology in Japan and other Asian countries. The company offers SP-03 (episil oral liquid) for the protection and relief of oral pain associated with oral mucositis/stomatitis caused by chemotherapy and radiotherapy for cancer; and SP-01 (Sancuso), a transdermal delivery system that delivers granisetron, an anti-emetic into the patient's bloodstream for the treatment of chemotherapy induced nausea and vomiting. It is also developing SP-02 (Darinaparsin), a mitochondrial-targeted agent that has completed phase III clinical study to treat various hematologic and solid cancers; and SP-04 (PledOx), an intracellular superoxide removing agent, which is in phase IIb clinical trials for chemotherapy induced peripheral neuropathy. In addition, the company is developing SP-05 (Arfolitixorin) that is in phase III clinical study for the enhancement of antitumor efficacy of fluorouracil, including the treatment for pancreatic cancer, breast cancer, stomach cancer, and head and neck cancers. Solasia Pharma K.K. was founded in 2006 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0011",
        "website": "http://www.solasia.co.jp",
        "market_cap": 20184076288
    },
    "4883.T": {
        "short_name": "MODALIS THERAPEUTICS CORP",
        "long_name": "Modalis Therapeutics Corporation",
        "summary": "Modalis Therapeutics Corporation engages in the research and development of therapeutics to treat patients with serious genetic disorders. It is developing therapies for orphan genetic diseases using its proprietary CRISPR-GNDM technology that enables the locus specific modulation of gene expression or histone modification without the need for double-stranded DNA cleavage, gene editing, or base editing. The company was formerly known as EdiGENE Corporation and changed its name to Modalis Therapeutics Corporation in August 2019. Modalis Therapeutics Corporation was founded in 2016 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0026",
        "website": "http://modalistx.com",
        "market_cap": 40577699840
    },
    "4886.T": {
        "short_name": "ASKA PHARMACEUTICAL HOLDINGS CO",
        "long_name": "ASKA Pharmaceutical Holdings Co.,Ltd.",
        "summary": "ASKA Pharmaceutical Holdings Co., Ltd. engages in the manufacture, sale, and import/export of pharmaceuticals, veterinary medicines, quasi-drugs, foods, and medical devices in Japan. The company offers Altat for the treatment of peptic ulcer and gastritis; Prostal drugs for the treatment of prostatic hypertrophy and cancer; Lipidil for the treatment of hyperlipidemia; Thyradin, a drug for the treatment of thyroid disease; Ange, an oral contraceptive agent; and Menoaid Combipatch, a climacteric syndrome treatment. It is also developing L-105 for the treatment of hepatic encephalopathy; AKP-501, a fertility treatment with follicle stimulating hormone preparation of recombinant DNA as an active agent; and CDB-2914, a uterine leiomyomata treatment. The company was founded in 1920 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-8532",
        "website": "http://www.aska-pharma.co.jp",
        "market_cap": 62837940224
    },
    "4887.T": {
        "short_name": "SAWAI GROUP HOLDINGS CO LTD",
        "long_name": "Sawai Group Holdings Co., Ltd.",
        "summary": "Sawai Group Holdings Co., Ltd., together with subsidiaries, manufactures, sells, imports, and exports pharmaceutical products in Japan and the United States. The company offers drugs in various formulations, including tablets, oral dispersing tablets, capsules, granules, injections, tapes, ophthalmic/nasal solutions, syrups, etc. in the therapeutic areas of cardiovascular, gastro-intestinal, blood/body fluid, other metabolic, antibiotics, central nervous system, antiallergics, chemotherapeutics, vitamins, anti-cancer, etc. It serves hospitals, general practitioners, and dispensing pharmacies. Sawai Group Holdings Co., Ltd. was founded in 1929 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "532-0003",
        "website": "http://www.sawai.co.jp",
        "market_cap": 229040521216
    },
    "71U.F": {
        "short_name": "SAWAI GROUP HOLDINGS CO.",
        "long_name": "Sawai Group Holdings Co., Ltd.",
        "summary": "Sawai Group Holdings Co., Ltd., together with subsidiaries, manufactures, sells, imports, and exports pharmaceutical products in Japan and the United States. The company offers drugs in various formulations, including tablets, oral dispersing tablets, capsules, granules, injections, tapes, ophthalmic/nasal solutions, syrups, etc. in the therapeutic areas of cardiovascular, gastro-intestinal, blood/body fluid, other metabolic, antibiotics, central nervous system, antiallergics, chemotherapeutics, vitamins, anti-cancer, etc. It serves hospitals, general practitioners, and dispensing pharmacies. Sawai Group Holdings Co., Ltd. was founded in 1929 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "532-0003",
        "website": "http://www.sawai.co.jp",
        "market_cap": 1651940992
    },
    "9273.T": {
        "short_name": "KOA SHOJI HOLDINGS CO LTD",
        "long_name": "Koa Shoji Holdings Co.,Ltd.",
        "summary": "Koa Shoji Holdings Co.,Ltd., through its subsidiaries, engages in import and sale of generic APIs/intermediates in Japan. It is also involved in the manufacture of various injections; OTC drugs, primarily various vitamins; and generic drugs. In addition, the company engages in contract manufacturing of pharmaceuticals; and packaging of pharmaceutical products. Koa Shoji Holdings Co.,Ltd. was founded in 1991 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "223-0061",
        "website": "http://www.koashoji-hd.com",
        "market_cap": 28802795520
    },
    "9SO.F": {
        "short_name": "SOLASIA PHARMA K.K.  O.N.",
        "long_name": "Solasia Pharma K.K.",
        "summary": "Solasia Pharma K.K. develops and commercializes drugs in the field of oncology in Japan and other Asian countries. The company offers SP-03 (episil oral liquid) for the protection and relief of oral pain associated with oral mucositis/stomatitis caused by chemotherapy and radiotherapy for cancer; and SP-01 (Sancuso), a transdermal delivery system that delivers granisetron, an anti-emetic into the patient's bloodstream for the treatment of chemotherapy induced nausea and vomiting. It is also developing SP-02 (Darinaparsin), a mitochondrial-targeted agent that has completed phase III clinical study to treat various hematologic and solid cancers; and SP-04 (PledOx), an intracellular superoxide removing agent, which is in phase IIb clinical trials for chemotherapy induced peripheral neuropathy. In addition, the company is developing SP-05 (Arfolitixorin) that is in phase III clinical study for the enhancement of antitumor efficacy of fluorouracil, including the treatment for pancreatic cancer, breast cancer, stomach cancer, and head and neck cancers. Solasia Pharma K.K. was founded in 2006 and is based in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0011",
        "website": "http://www.solasia.co.jp",
        "market_cap": 151529632
    },
    "DNPUF": {
        "short_name": "SUMITOMO DAINIPPON PHARMA CO LT",
        "long_name": "Sumitomo Dainippon Pharma Co., Ltd.",
        "summary": "Sumitomo Dainippon Pharma Co., Ltd. manufactures and sells pharmaceuticals, food ingredients and additives, veterinary medicines, diagnostics, and others. The company offers pharmaceutical products, such as therapeutic agents for Parkinson's disease, depression, type 2 diabetes, systemic fungal infection, pruritus, chronic obstructive pulmonary disease, angina pectoris, and arrhythmia. It also provides atypical antipsychotic, antiepileptic, carbapenem antibiotic, and gastroprokine products; and Anderson-Fabry disease drugs. In addition, the company offers food ingredients and additives, such as polysaccharides, and seasonings, such as soups or bouillons; and chemical product materials consisting of pharmaceutical excipients, personal care products, coatings and industrial materials, and electronic materials. Further, it provides veterinary medicines for companion animals, primarily dogs and cats; and livestock comprising cattle, swine, poultry, horses, and aquacultured fish. Sumitomo Dainippon Pharma Co., Ltd. has partnerships with Healios K.K.; Keio University; RIKEN; the Center for iPS Cell Research and Application (CiRA); Kyoto University; and Aikomi Co., Ltd., as well as a joint development agreement with SanBio, Inc. It also has a strategic research collaboration agreement with Gain Therapeutics, Inc. for the research and development of structurally targeted allosteric regulators to restore functional activity of defective lysosomal enzymes in rare genetic and demyelinating diseases. The company was formerly known as Dainippon Sumitomo Pharma Co., Ltd. and changed its name to Sumitomo Dainippon Pharma Co., Ltd. in June 2014. Sumitomo Dainippon Pharma Co., Ltd. was founded in 1897 and is headquartered in Osaka, Japan. Sumitomo Dainippon Pharma Co., Ltd. is a subsidiary of Sumitomo Chemical Company, Limited.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0045",
        "website": "http://www.ds-pharma.com",
        "market_cap": 7832336896
    },
    "DPA.F": {
        "short_name": "DAITO PHARMACEUTICAL",
        "long_name": "Daito Pharmaceutical Co.,Ltd.",
        "summary": "Daito Pharmaceutical Co.,Ltd. manufactures and sells pharmaceutical products worldwide. The company offers various active pharmaceutical ingredients and intermediates, prescription drugs, OTC drugs, and home-delivery medicines; formulations in various forms, such as tablets, capsules, troches, granules, and powders; and contract manufacturing services for formulations of medicinal products to pharmaceutical companies. It also sells health food products. The company was formerly known as Daito Corporation and changed its name to Daito Pharmaceutical Co.,Ltd. in 1992. Daito Pharmaceutical Co.,Ltd. was founded in 1942 and is headquartered in Toyama, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Toyama",
        "zipcode": "939-8567",
        "website": "http://www.daitonet.co.jp",
        "market_cap": 353287488
    },
    "DPM.F": {
        "short_name": "SUMITOMO DAINIPPON PHARMA",
        "long_name": "Sumitomo Dainippon Pharma Co., Ltd.",
        "summary": "Sumitomo Dainippon Pharma Co., Ltd. manufactures and sells pharmaceuticals, food ingredients and additives, veterinary medicines, diagnostics, and others. The company offers pharmaceutical products, such as therapeutic agents for Parkinson's disease, depression, type 2 diabetes, systemic fungal infection, pruritus, chronic obstructive pulmonary disease, angina pectoris, and arrhythmia. It also provides atypical antipsychotic, antiepileptic, carbapenem antibiotic, and gastroprokine products; and Anderson-Fabry disease drugs. In addition, the company offers food ingredients and additives, such as polysaccharides, and seasonings, such as soups or bouillons; and chemical product materials consisting of pharmaceutical excipients, personal care products, coatings and industrial materials, and electronic materials. Further, it provides veterinary medicines for companion animals, primarily dogs and cats; and livestock comprising cattle, swine, poultry, horses, and aquacultured fish. Sumitomo Dainippon Pharma Co., Ltd. has partnerships with Healios K.K.; Keio University; RIKEN; the Center for iPS Cell Research and Application (CiRA); Kyoto University; and Aikomi Co., Ltd., as well as a joint development agreement with SanBio, Inc. It also has a strategic research collaboration agreement with Gain Therapeutics, Inc. for the research and development of structurally targeted allosteric regulators to restore functional activity of defective lysosomal enzymes in rare genetic and demyelinating diseases. The company was formerly known as Dainippon Sumitomo Pharma Co., Ltd. and changed its name to Sumitomo Dainippon Pharma Co., Ltd. in June 2014. Sumitomo Dainippon Pharma Co., Ltd. was founded in 1897 and is headquartered in Osaka, Japan. Sumitomo Dainippon Pharma Co., Ltd. is a subsidiary of Sumitomo Chemical Company, Limited.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0045",
        "website": "http://www.ds-pharma.com",
        "market_cap": 7022606336
    },
    "EII.F": {
        "short_name": "EISAI CO. LTD",
        "long_name": "Eisai Co., Ltd.",
        "summary": "Eisai Co., Ltd. offers pharmaceutical products in Japan. It offers Aricept for the treatment of alzheimer's disease/dementia with Lewy bodies; Methycobal for the treatment of peripheral neuropathy; and Fycompa, an antiepileptic drug for the adjunctive treatment of partial-onset and primary generalized tonic-clonic seizures. The company also provides Lyrica for pain treatment; Dayvigo, an anti-insomnia drug for the treatment of adults with insomnia; Lenvima, an anticancer agent/molecular targeted medicine for the treatment of thyroid cancer, renal cell carcinoma in combination with everolimus, and hepatocellular carcinoma; and Halaven, an anticancer agent/microtubule dynamics inhibitor for the treatment of breast cancer and liposarcoma. In addition, it offers Pariet, a proton-pump inhibitor for the treatment of gastric and duodenal ulcers, reflux esophagitis, and eradication of Helicobacter pylori infections, etc.; Humira, a fully human anti-TNF-a monoclonal antibody for the treatment of autoimmune diseases, such as rheumatoid arthritis; and Chocola BB plus, a vitamin B2 preparation for rough skin and stomatitis, as well as various products, which include third-class OTC drugs, designated quasi-drugs, and food with nutrient function. Eisai Co., Ltd. has a research collaboration agreement with Wren Therapeutics Ltd. for the discovery of small molecules that target synuclein for the potential treatment of synucleinopathies, including Parkinson's disease and dementia with Lewy bodies; and a collaboration with BioLabs for the launch of the Eisai Innovation Center BioLabs, a shared lab and office space for start-ups to innovate in the field of neurological diseases. The company was formerly known as Nihon Eisai Co., Ltd. and changed its name to Eisai Co., Ltd. in 1955. Eisai Co., Ltd. was founded in 1941 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "112-8088",
        "website": "http://www.eisai.co.jp",
        "market_cap": 22866186240
    },
    "ESALY": {
        "short_name": "EISAI CO",
        "long_name": "Eisai Co., Ltd.",
        "summary": "Eisai Co., Ltd. offers pharmaceutical products in Japan. It offers Aricept for the treatment of alzheimer's disease/dementia with Lewy bodies; Methycobal for the treatment of peripheral neuropathy; and Fycompa, an antiepileptic drug for the adjunctive treatment of partial-onset and primary generalized tonic-clonic seizures. The company also provides Lyrica for pain treatment; Dayvigo, an anti-insomnia drug for the treatment of adults with insomnia; Lenvima, an anticancer agent/molecular targeted medicine for the treatment of thyroid cancer, renal cell carcinoma in combination with everolimus, and hepatocellular carcinoma; and Halaven, an anticancer agent/microtubule dynamics inhibitor for the treatment of breast cancer and liposarcoma. In addition, it offers Pariet, a proton-pump inhibitor for the treatment of gastric and duodenal ulcers, reflux esophagitis, and eradication of Helicobacter pylori infections, etc.; Humira, a fully human anti-TNF-a monoclonal antibody for the treatment of autoimmune diseases, such as rheumatoid arthritis; and Chocola BB plus, a vitamin B2 preparation for rough skin and stomatitis, as well as various products, which include third-class OTC drugs, designated quasi-drugs, and food with nutrient function. Eisai Co., Ltd. has a research collaboration agreement with Wren Therapeutics Ltd. for the discovery of small molecules that target synuclein for the potential treatment of synucleinopathies, including Parkinson's disease and dementia with Lewy bodies; and a collaboration with BioLabs for the launch of the Eisai Innovation Center BioLabs, a shared lab and office space for start-ups to innovate in the field of neurological diseases. The company was formerly known as Nihon Eisai Co., Ltd. and changed its name to Eisai Co., Ltd. in 1955. Eisai Co., Ltd. was founded in 1941 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "112-8088",
        "website": "http://www.eisai.co.jp",
        "market_cap": 27289593856
    },
    "FUP.F": {
        "short_name": "FUJI PHARMA CO.LTD.",
        "long_name": "Fuji Pharma Co., Ltd.",
        "summary": "Fuji Pharma Co., Ltd. engages in the research and development, manufacture, and marketing of pharmaceutical products in Japan and internationally. The company offers hormone medicines for obstetrics and gynecology therapies, as well as injectable drugs, such as radiopharmaceutical products. It also provides medical care for women; in vitro diagnostics, acute medical care products, and curative medicines; and information regarding pharmaceuticals and health. The company was founded in 1965 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0075",
        "website": "http://www.fujipharma.jp",
        "market_cap": 217538320
    },
    "HPX.F": {
        "short_name": "HISAMITSU PHARMA.",
        "long_name": "Hisamitsu Pharmaceutical Co., Inc.",
        "summary": "Hisamitsu Pharmaceutical Co., Inc. engages in the research and development, manufacture, purchase, and sale of pharmaceuticals in Japan. The company provides analgesic / anti-inflammatory patches; athlete's foot / ringworm remedy products; allergy-only rhinitis drugs; eye drops; high cholesterol improving drugs; acne remedies; cooling sheets; and supporters for knee, waist, elbow, calf and ankle. It also provides cooling sprays; bactericidal antibacterial spray and deodorant spray; ship fixing sheet; adhesive plasters for magnetic products; skin care products; sweat sheet; massage roller gel and oil spray; thermal equipment, and dietary supplements. The company offers its products under the Salon pass, Salonship, Air Salon Pass, Fatus, Butena Rock, Allegra, Direct pasting, Choleston, Life Cera, Deco Deco Cool, Children Robin Eye Plus. Eye cool, MSM, and other brand names. It sells its products in North America, Central and South America, Asia, Oceania, the Middle East, Africa, and Europe. Hisamitsu Pharmaceutical Co., Inc. was founded in 1847 and is headquartered in Tosu, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tosu",
        "zipcode": "841-0017",
        "website": "http://www.hisamitsu.co.jp",
        "market_cap": 4040273664
    },
    "HTSUF": {
        "short_name": "HISAMITSU PHARMACEUTICAL CO INC",
        "long_name": "Hisamitsu Pharmaceutical Co., Inc.",
        "summary": "Hisamitsu Pharmaceutical Co., Inc. engages in the research and development, manufacture, purchase, and sale of pharmaceuticals in Japan. The company provides analgesic / anti-inflammatory patches; athlete's foot / ringworm remedy products; allergy-only rhinitis drugs; eye drops; high cholesterol improving drugs; acne remedies; cooling sheets; and supporters for knee, waist, elbow, calf and ankle. It also provides cooling sprays; bactericidal antibacterial spray and deodorant spray; ship fixing sheet; adhesive plasters for magnetic products; skin care products; sweat sheet; massage roller gel and oil spray; thermal equipment, and dietary supplements. The company offers its products under the Salon pass, Salonship, Air Salon Pass, Fatus, Butena Rock, Allegra, Direct pasting, Choleston, Life Cera, Deco Deco Cool, Children Robin Eye Plus. Eye cool, MSM, and other brand names. It sells its products in North America, Central and South America, Asia, Oceania, the Middle East, Africa, and Europe. Hisamitsu Pharmaceutical Co., Inc. was founded in 1847 and is headquartered in Tosu, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tosu",
        "zipcode": "841-0017",
        "website": "http://www.hisamitsu.co.jp",
        "market_cap": 4760342528
    },
    "KIS.F": {
        "short_name": "KISSEI PHARM. LTD",
        "long_name": "Kissei Pharmaceutical Co., Ltd.",
        "summary": "Kissei Pharmaceutical Co., Ltd. engages in the research, development, manufacture, and sale of pharmaceutical products primarily in Japan. It offers Urief and Urief OD tablets for the treatment of dysuria; Glufast, Glubes, and Marizev tablets for type 2 diabetes; Darbepoetin Alfa BS and Epoetin Alfa BS injections for the treatment of renal anemia; Beova tablets for overactive bladder treatment; P-TOL chewable tablets for treating hyperphosphatemia; and Minirin Melt OD tablets for nocturia due to nocturnal polyuria in males, central diabetes insipidus, and nocturnal enuresis resulted from decrease of urine osmolality. The company's products in pipeline include KPS-0373 that has completed Phase III clinical trial to treat spinocerebellar ataxia; CCX168, which has completed Phase III clinical trial for the treatment of microscopic polyangiitis and granulomatosis with polyangiitis; AJM300, which is in Phase III clinical trial to treat ulcerative colitis; R788 that is in Phase III clinical trial to treat chronic idiopathic thrombocytopenic purpura; and MR13A9, which is in Phase III clinical trial to treat uremic pruritus in dialysis patients. It is also developing KLH-2109 for treating endometriosis and uterine fibroids; KDT-3594 for the treatment of Parkinson's disease; Silodosin for dysuria associated with benign prostatic hyperplasia; Mitiglinide for type 2 diabetes mellitus; and Bedoradrine for the treatment of acute exacerbation of asthma. In addition, it develops and sells protein controlled and energy supply foods; and purchases and sells related materials, as well as offers system development and information processing, construction contracting, equipment and facility management, and information gathering and development support services. The company was formerly known as Kissei Yakuhin Kogyo Co., Ltd. and changed its name to Kissei Pharmaceutical Co., Ltd. in October 1964. The company was founded in 1946 and is headquartered in Matsumoto, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Matsumoto",
        "zipcode": "399-8710",
        "website": "http://www.kissei.co.jp",
        "market_cap": 749160192
    },
    "KKPCF": {
        "short_name": "KAKEN PHARMACEUTICAL",
        "long_name": "Kaken Pharmaceutical Co., Ltd.",
        "summary": "Kaken Pharmaceutical Co., Ltd. produces, markets, and sells medical products, medical devices, and agrochemicals in Japan and internationally. It offers pharmaceutical products and medical devices, such as Clenafin, a topical treatment for onychomycosis; Artz, an anti-osteoarthritis agent; Seprafilm, a semitransparent film-type absorbable adhesion barrier, which is applied to damaged tissue; Fiblast, a spray-on drug for the treatment of pressure ulcers and other skin ulcers; Regroth, a medicinal product for periodontal regeneration; and Hernicore for the treatment of lumbar disc herniation. The company also provides Adofeed, a pain- and inflammation-relieving plaster; Ebrantil for the treatment of dysuria and hypertension; Procylin, an oral-use prostaglandin I2 analog; Lipidil, an anti-hyperlipidemia agent; Mentax, an anti-trichophyton agent; and Loxoprofen Na Tape, a pain-relieving and anti-inflammatory plaster. In addition, it offers Ropion, a pain relief injection; and agrochemicals and animal health products, including Polyoxins that is used as fungicide; Pentoxazone, a rice herbicide; and Salinomycin, an anti-coccidial feed additive for chicken. Further, the company is developing BBI-4000 that has completed phase III clinical trial for primary axillary hyperhidrosis; KMW-1, which is in phase III clinical trial for the removal of eschar with thermal burns; KAR for treatment of hide lice infestation; and KP-607, which is in phase II clinical trial for the treatment of onychomycosis. Additionally, it is involved in the rental of Bunkyo Green Court, a commercial complex. The company offers its products under the Mentax Lotrimin Ultra, Mentax Butena, Mentax, Kaifen, Fiblast, and Jublia brands. It has license agreements with Corbus Pharmaceuticals Holdings, Inc. and Arbor Pharmaceuticals, LLC. Kaken Pharmaceutical Co., Ltd. was founded in 1917 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "113-8650",
        "website": "http://www.kaken.co.jp",
        "market_cap": 1577600256
    },
    "KSPHF": {
        "short_name": "KISSEI PHARMACEUTICAL CO",
        "long_name": "Kissei Pharmaceutical Co., Ltd.",
        "summary": "Kissei Pharmaceutical Co., Ltd. engages in the research, development, manufacture, and sale of pharmaceutical products primarily in Japan. It offers Urief and Urief OD tablets for the treatment of dysuria; Glufast, Glubes, and Marizev tablets for type 2 diabetes; Darbepoetin Alfa BS and Epoetin Alfa BS injections for the treatment of renal anemia; Beova tablets for overactive bladder treatment; P-TOL chewable tablets for treating hyperphosphatemia; and Minirin Melt OD tablets for nocturia due to nocturnal polyuria in males, central diabetes insipidus, and nocturnal enuresis resulted from decrease of urine osmolality. The company's products in pipeline include KPS-0373 that has completed Phase III clinical trial to treat spinocerebellar ataxia; CCX168, which has completed Phase III clinical trial for the treatment of microscopic polyangiitis and granulomatosis with polyangiitis; AJM300, which is in Phase III clinical trial to treat ulcerative colitis; R788 that is in Phase III clinical trial to treat chronic idiopathic thrombocytopenic purpura; and MR13A9, which is in Phase III clinical trial to treat uremic pruritus in dialysis patients. It is also developing KLH-2109 for treating endometriosis and uterine fibroids; KDT-3594 for the treatment of Parkinson's disease; Silodosin for dysuria associated with benign prostatic hyperplasia; Mitiglinide for type 2 diabetes mellitus; and Bedoradrine for the treatment of acute exacerbation of asthma. In addition, it develops and sells protein controlled and energy supply foods; and purchases and sells related materials, as well as offers system development and information processing, construction contracting, equipment and facility management, and information gathering and development support services. The company was formerly known as Kissei Yakuhin Kogyo Co., Ltd. and changed its name to Kissei Pharmaceutical Co., Ltd. in October 1964. The company was founded in 1946 and is headquartered in Matsumoto, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Matsumoto",
        "zipcode": "399-8710",
        "website": "http://www.kissei.co.jp",
        "market_cap": 888718336
    },
    "MFY.F": {
        "short_name": "MOCHIDA PHARM.",
        "long_name": "Mochida Pharmaceutical Co., Ltd.",
        "summary": "Mochida Pharmaceutical Co., Ltd. produces and sells pharmaceuticals, skincare products, and diagnostics solutions in Japan. The company provides cardiovascular, analgesic, gastrointestinal, neurological, anti-infective, antidiabetics, and anticancer products, as well as hormone and biological preparations, and biosimilars; diagnostic reagents, such as reagents for fertility/infertility and other reagents; and face and body care, hair care, and skincare products, as well as dermatology, psychiatry, obstetrics, and gynecology products. It also developing drugs for the treatment of intractable diseases. The company has collaboration agreements with Amarin Corporation plc for the development and commercialization of ethyl icosapentate products; and Gene Techno Science Co., Ltd. to develop new regenerative medicine for the treatment of digestive rare and intractable diseases, such as congenital isolated hypoganglionosis. Mochida Pharmaceutical Co., Ltd. was founded in 1913 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "162-0845",
        "website": "http://www.mochida.co.jp",
        "market_cap": 1068038272
    },
    "NPPNY": {
        "short_name": "NIPPON SHINYAKU CO",
        "long_name": "Nippon Shinyaku Co., Ltd.",
        "summary": "Nippon Shinyaku Co., Ltd. manufactures and sells pharmaceuticals and foodstuffs in Japan, Switzerland, and internationally. The company operates through Pharmaceuticals and Functional Food segments. It offers drugs for urological diseases, inflammation and allergies, hematologic malignancies, cardiovascular and metabolic diseases, gastrointestinal disorders, and other diseases. The company's products include Zalutia for urinary disorder caused by benign prostatic; Eviprostat for prostatic hypertrophy; Bladderon for pollakisuria; Estracyt for prostate cancer; Cialis for erectile dysfunction; Vidaza for myelodysplastic syndrome; Cylocide for solid tumor and acute leukemia; CylocideN for relapsed and refractory acute leukemia and malignant lymphoma; Gazyva for humanized anti-CD20 monoclonal antibody; Defiterio sinusoidal obstruction syndrome; and Trisenox and Amnolake for relapsed and refractory acute promyelocytic leukemia. Nippon Shinyaku Co., Ltd.'s products also comprise Uptravi, Adcirca, and Opsumit for pulmonary arterial hypertension; VILTEPSO for muscular dystrophy; Lunabel LD and Lunabel ULD for dysmenorrhea; Erizas, a dry powder inhaler solution for allergic rhinitis; Azunol Gargle liquid, a gargling solution containing azulene; Isobide for oral osmotic diuresis/meniere's disease; Cephadol for vertigo; Livostin for allergic rhinitis and conjunctivitis; Regtect for maintaining alcohol abstinence; and Onetram and Tramal for cancer and chronic pain. In addition, it researches, develops, and markets drugs in the areas of gynecology, otorhinolaryngology, and orthopedics. Further, the company provides functional foods, such as health food ingredients, preservatives, protein preparations, supplements, and spice and condiments. Nippon Shinyaku Co., Ltd. was founded in 1911 and is headquartered in Kyoto, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "601-8550",
        "website": "http://www.nippon-shinyaku.co.jp",
        "market_cap": 4796929024
    },
    "SGIOF": {
        "short_name": "SHIONOGI & CO",
        "long_name": "Shionogi & Co., Ltd.",
        "summary": "Shionogi & Co., Ltd. engages in the research, development, manufacture, and distribution of pharmaceuticals, diagnostic reagents, and medical devices in Japan. Its primary products Tivicay for HIV treatment; Mulpleta for the treatment of thrombocytopenia; Xofluza, an influenza drug; Symproic for opioid-induced constipation treatment; and Fetroja, a multidrug-resistant for gram-negative bacterial infection treatment. The company also offers antibody detection kits for COVID-19. Shionogi & Co., Ltd. has collaboration agreements with InveniAI, LLC.; Hsiri Therapeutics Inc.; Nagasaki University; Roche Group to develop and commercialize Xofluza; and Nagasaki University and The Kitasato Institute to develop antimalarial drugs and vaccines. The company was formerly known as Shionogi Shoten Co., Ltd. and changed its name to Shionogi & Co., Ltd. in 1943. Shionogi & Co., Ltd. was founded in 1878 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0045",
        "website": "http://www.shionogi.com",
        "market_cap": 15954073600
    },
    "SGIOY": {
        "short_name": "SHIONOGI & CO",
        "long_name": "Shionogi & Co., Ltd.",
        "summary": "Shionogi & Co., Ltd. engages in the research, development, manufacture, and distribution of pharmaceuticals, diagnostic reagents, and medical devices in Japan. Its primary products Tivicay for HIV treatment; Mulpleta for the treatment of thrombocytopenia; Xofluza, an influenza drug; Symproic for opioid-induced constipation treatment; and Fetroja, a multidrug-resistant for gram-negative bacterial infection treatment. The company also offers antibody detection kits for COVID-19. Shionogi & Co., Ltd. has collaboration agreements with Hsiri Therapeutics Inc.; Nagasaki University; Roche Group to develop and commercialize Xofluza; and Nagasaki University and The Kitasato Institute to develop antimalarial drugs and vaccines. The company was formerly known as Shionogi Shoten Co., Ltd. and changed its name to Shionogi & Co., Ltd. in 1943. Shionogi & Co., Ltd. was founded in 1878 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0045",
        "website": "http://www.shionogi.com",
        "market_cap": 15458276352
    },
    "SH0.F": {
        "short_name": "SHIONOGI + CO. LTD",
        "long_name": "Shionogi & Co., Ltd.",
        "summary": "Shionogi & Co., Ltd. engages in the research, development, manufacture, and distribution of pharmaceuticals, diagnostic reagents, and medical devices in Japan. Its primary products Tivicay for HIV treatment; Mulpleta for the treatment of thrombocytopenia; Xofluza, an influenza drug; Symproic for opioid-induced constipation treatment; and Fetroja, a multidrug-resistant for gram-negative bacterial infection treatment. The company also offers antibody detection kits for COVID-19. Shionogi & Co., Ltd. has collaboration agreements with InveniAI, LLC.; Hsiri Therapeutics Inc.; Nagasaki University; Roche Group to develop and commercialize Xofluza; and Nagasaki University and The Kitasato Institute to develop antimalarial drugs and vaccines. The company was formerly known as Shionogi Shoten Co., Ltd. and changed its name to Shionogi & Co., Ltd. in 1943. Shionogi & Co., Ltd. was founded in 1878 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0045",
        "website": "http://www.shionogi.com",
        "market_cap": 13110183936
    },
    "SWPIF": {
        "short_name": "SAWAI PHARMACEUTICAL",
        "long_name": "Sawai Group Holdings Co., Ltd.",
        "summary": "Sawai Group Holdings Co., Ltd., together with subsidiaries, manufactures, sells, imports, and exports pharmaceutical products in Japan and the United States. The company offers drugs in various formulations, including tablets, oral dispersing tablets, capsules, granules, injections, tapes, ophthalmic/nasal solutions, syrups, etc. in the therapeutic areas of cardiovascular, gastro-intestinal, blood/body fluid, other metabolic, antibiotics, central nervous system, antiallergics, chemotherapeutics, vitamins, anti-cancer, etc. It serves hospitals, general practitioners, and dispensing pharmacies. Sawai Group Holdings Co., Ltd. was founded in 1929 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "532-0003",
        "website": "http://www.sawai.co.jp",
        "market_cap": 2109426816
    },
    "TAIPY": {
        "short_name": "TAISHO PHARMACEUTICAL HLDG CO L",
        "long_name": "Taisho Pharmaceutical Holdings Co., Ltd.",
        "summary": "Taisho Pharmaceutical Holdings Co., Ltd., through its subsidiaries, researches, develops, manufactures, markets, distributes, and sells over-the-counter (OTC) drugs and prescription pharmaceutical products in Japan and internationally. It operates through Self-Medication Operation Group and Prescription Pharmaceutical Operation Group segments. The Self-Medication Operation Group segment offers OTC drugs, quasi-drugs, food products, and general medical and hygiene supplies, such as Lipovitan series of energy drinks; the Pabron series of cold remedies and sinus treatments; the RiUP series of hair re-growth treatment products; the Taisho Kampo series of gastrointestinal treatment products; the Colac series of laxative products; the Naron series and other products for antipyretic analgesics; the Preser series of hemorrhoid treatment products; Hapacol, Efferalgan, Dafalgan, and Tempra for antipyretic analgesics; Counterpain topical anti-inflammatory analgesics; Vitacilina, a dermatological treatment product; and VICKS, a cough suppressant throat lozenges and medicated drops. This segment also engages in the real estate leasing and facility management, and hotel management operations. The Prescription Pharmaceutical Operation Group segment offers ethical drugs, including Edirol, an active vitamin D3 osteoporosis agent; Clarith, a macrolide antibiotic; Palux, a peripheral vasodilator; Bonviva, a bisphosphonate osteoporosis agent; Lusefi, a type 2 diabetes mellitus agent; and LOQOA, a transdermal anti-inflammatory analgesic. This segment has various products under development primarily in therapeutic areas, such as central nervous system, infectious, and metabolic diseases, as well as orthopedic disorders. The company also offers raw materials for pharmaceuticals and quasi-drugs; and supplies health foods and skin care products. Taisho Pharmaceutical Holdings Co., Ltd. was founded in 1912 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "170-8655",
        "website": "http://www.taisho-holdings.co.jp",
        "market_cap": 5020137472
    },
    "TAK": {
        "short_name": "Takeda Pharmaceutical Company L",
        "long_name": "Takeda Pharmaceutical Company Limited",
        "summary": "Takeda Pharmaceutical Company Limited engages in the research, development, manufacturing, and marketing of pharmaceutical products, over-the-counter medicines and quasi-drug consumer products, and other healthcare products. It offers pharmaceutical products in the areas of gastroenterology; oncology; neuroscience; and rare diseases, such as rare metabolic and hematology, and heredity angioedema, as well as plasma-derived therapies and vaccines. The company provides its products under the ENTYVIO, GATTEX/REVESTIVE, ALOFISEL, NATPARA, ADYNOVATE/ADYNOVI, TAKHZYRO, ELAPRASE, VPRIV, GAMMAGARD LIQUID/KIOVIG, HYQVIA, CUVITRU, ALBUMIN/FLEXBUMIN, NINLARO, and ALUNBRIG brands. It operates in Japan, the United States, Europe and Canada, Russia/CIS, Latin America, rest of Asia, the Middle East, Oceania, and Africa. The company has licensing agreements with TESARO, Inc., Denali Therapeutics, and Wave Life Sciences Ltd; collaboration agreements with Rani Therapeutics LLC, Novimmune S.A., AB Biosciences Inc., Sosei Group Corporation, and LogicBio Therapeutics, Inc.; strategic collaboration with Prometheus Biosciences, Inc; a license and research agreement with The University of Texas MD Anderson Cancer Center; a research collaboration agreements with Enzyre BV and Cerevance; a collaboration agreement with Artisan Bio, Inc.; and a multi-target rare disease collaboration with Evox Therapeutics Ltd., as well as licensing agreement with ProThera Biologics Inc. It also has a strategic alliance with Egle Therapeutics SAS and Evotec SE; a strategic partnership with Neurocrine Biosciences, Inc.; Carmine Therapeutics and HemoShear Therapeutics, LLC; strategic collaboration with KSQ Therapeutics to research, develop, and commercialize immune-based therapies for cancer; and strategic collaboration with Anima Biotech. Takeda Pharmaceutical Company Limited was founded in 1781 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8668",
        "website": "http://www.takeda.com",
        "market_cap": 53403475968
    },
    "TKD.F": {
        "short_name": "TAKEDA PHARM.CO.LTD.",
        "long_name": "Takeda Pharmaceutical Company Limited",
        "summary": "Takeda Pharmaceutical Company Limited engages in the research, development, manufacturing, and marketing of pharmaceutical products, over-the-counter medicines and quasi-drug consumer products, and other healthcare products. It offers pharmaceutical products in the areas of gastroenterology; oncology; neuroscience; and rare diseases, such as rare metabolic and hematology, and heredity angioedema, as well as plasma-derived therapies and vaccines. The company provides its products under the ENTYVIO, GATTEX/REVESTIVE, ALOFISEL, NATPARA, ADYNOVATE/ADYNOVI, TAKHZYRO, ELAPRASE, VPRIV, GAMMAGARD LIQUID/KIOVIG, HYQVIA, CUVITRU, ALBUMIN/FLEXBUMIN, NINLARO, and ALUNBRIG brands. It operates in Japan, the United States, Europe and Canada, Russia/CIS, Latin America, rest of Asia, the Middle East, Oceania, and Africa. The company has licensing agreements with TESARO, Inc., Denali Therapeutics, and Wave Life Sciences Ltd; collaboration agreements with Rani Therapeutics LLC, Novimmune S.A., AB Biosciences Inc., Sosei Group Corporation, and LogicBio Therapeutics, Inc.; strategic collaboration with Prometheus Biosciences, Inc; a license and research agreement with The University of Texas MD Anderson Cancer Center; a research collaboration agreements with Enzyre BV and Cerevance; a collaboration agreement with Artisan Bio, Inc.; and a multi-target rare disease collaboration with Evox Therapeutics Ltd., as well as licensing agreement with ProThera Biologics Inc. It also has a strategic alliance with Egle Therapeutics SAS and Evotec SE; a strategic partnership with Neurocrine Biosciences, Inc.; Carmine Therapeutics and HemoShear Therapeutics, LLC; strategic collaboration with KSQ Therapeutics to research, develop, and commercialize immune-based therapies for cancer; and strategic collaboration with Anima Biotech. Takeda Pharmaceutical Company Limited was founded in 1781 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8668",
        "website": "http://www.takeda.com",
        "market_cap": 43485556736
    },
    "TKD.VI": {
        "short_name": "TAKEDA PHARMACEUTICAL CO LTD",
        "long_name": "Takeda Pharmaceutical Company Limited",
        "summary": "Takeda Pharmaceutical Company Limited engages in the research, development, manufacturing, and marketing of pharmaceutical products, over-the-counter medicines and quasi-drug consumer products, and other healthcare products. It offers pharmaceutical products in the areas of gastroenterology; oncology; neuroscience; and rare diseases, such as rare metabolic and hematology, and heredity angioedema, as well as plasma-derived therapies and vaccines. The company provides its products under the ENTYVIO, GATTEX/REVESTIVE, ALOFISEL, NATPARA, ADYNOVATE/ADYNOVI, TAKHZYRO, ELAPRASE, VPRIV, GAMMAGARD LIQUID/KIOVIG, HYQVIA, CUVITRU, ALBUMIN/FLEXBUMIN, NINLARO, and ALUNBRIG brands. It operates in Japan, the United States, Europe and Canada, Russia/CIS, Latin America, rest of Asia, the Middle East, Oceania, and Africa. The company has licensing agreements with TESARO, Inc., Denali Therapeutics, and Wave Life Sciences Ltd; collaboration agreements with Rani Therapeutics LLC, Novimmune S.A., AB Biosciences Inc., Sosei Group Corporation, and LogicBio Therapeutics, Inc.; strategic collaboration with Prometheus Biosciences, Inc; a license and research agreement with The University of Texas MD Anderson Cancer Center; a research collaboration agreements with Enzyre BV and Cerevance; a collaboration agreement with Artisan Bio, Inc.; and a multi-target rare disease collaboration with Evox Therapeutics Ltd., as well as licensing agreement with ProThera Biologics Inc. It also has a strategic alliance with Egle Therapeutics SAS and Evotec SE; a strategic partnership with Neurocrine Biosciences, Inc.; Carmine Therapeutics and HemoShear Therapeutics, LLC; strategic collaboration with KSQ Therapeutics to research, develop, and commercialize immune-based therapies for cancer; and strategic collaboration with Anima Biotech. Takeda Pharmaceutical Company Limited was founded in 1781 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8668",
        "website": "http://www.takeda.com",
        "market_cap": 44217782272
    },
    "TKDA.F": {
        "short_name": "TAKEDA PHARM.SPON.ADR/1/2",
        "long_name": "Takeda Pharmaceutical Company Limited",
        "summary": "Takeda Pharmaceutical Company Limited engages in the research, development, manufacturing, and marketing of pharmaceutical products, over-the-counter medicines and quasi-drug consumer products, and other healthcare products. It offers pharmaceutical products in the areas of gastroenterology; oncology; neuroscience; and rare diseases, such as rare metabolic and hematology, and heredity angioedema, as well as plasma-derived therapies and vaccines. The company provides its products under the ENTYVIO, GATTEX/REVESTIVE, ALOFISEL, NATPARA, ADYNOVATE/ADYNOVI, TAKHZYRO, ELAPRASE, VPRIV, GAMMAGARD LIQUID/KIOVIG, HYQVIA, CUVITRU, ALBUMIN/FLEXBUMIN, NINLARO, and ALUNBRIG brands. It operates in Japan, the United States, Europe and Canada, Russia/CIS, Latin America, rest of Asia, the Middle East, Oceania, and Africa. The company has licensing agreements with TESARO, Inc., Denali Therapeutics, and Wave Life Sciences Ltd; collaboration agreements with Rani Therapeutics LLC, Novimmune S.A., AB Biosciences Inc., Sosei Group Corporation, and LogicBio Therapeutics, Inc.; strategic collaboration with Prometheus Biosciences, Inc; a license and research agreement with The University of Texas MD Anderson Cancer Center; a research collaboration agreements with Enzyre BV and Cerevance; a collaboration agreement with Artisan Bio, Inc.; and a multi-target rare disease collaboration with Evox Therapeutics Ltd., as well as licensing agreement with ProThera Biologics Inc. It also has a strategic alliance with Egle Therapeutics SAS and Evotec SE; a strategic partnership with Neurocrine Biosciences, Inc.; Carmine Therapeutics and HemoShear Therapeutics, LLC; strategic collaboration with KSQ Therapeutics to research, develop, and commercialize immune-based therapies for cancer; and strategic collaboration with Anima Biotech. Takeda Pharmaceutical Company Limited was founded in 1781 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8668",
        "website": "http://www.takeda.com",
        "market_cap": 43562876928
    },
    "TKPHF": {
        "short_name": "TAKEDA PHARMACEUTICAL CO LTD",
        "long_name": "Takeda Pharmaceutical Company Limited",
        "summary": "Takeda Pharmaceutical Company Limited engages in the research, development, manufacturing, and marketing of pharmaceutical products, over-the-counter medicines and quasi-drug consumer products, and other healthcare products. It offers pharmaceutical products in the areas of gastroenterology; oncology; neuroscience; and rare diseases, such as rare metabolic and hematology, and heredity angioedema, as well as plasma-derived therapies and vaccines. The company provides its products under the ENTYVIO, GATTEX/REVESTIVE, ALOFISEL, NATPARA, ADYNOVATE/ADYNOVI, TAKHZYRO, ELAPRASE, VPRIV, GAMMAGARD LIQUID/KIOVIG, HYQVIA, CUVITRU, ALBUMIN/FLEXBUMIN, NINLARO, and ALUNBRIG brands. It operates in Japan, the United States, Europe and Canada, Russia/CIS, Latin America, rest of Asia, the Middle East, Oceania, and Africa. The company has licensing agreements with TESARO, Inc., Denali Therapeutics, and Wave Life Sciences Ltd; collaboration agreements with Rani Therapeutics LLC, Novimmune S.A., AB Biosciences Inc., Sosei Group Corporation, and LogicBio Therapeutics, Inc.; strategic collaboration with Prometheus Biosciences, Inc; a license and research agreement with The University of Texas MD Anderson Cancer Center; a research collaboration agreements with Enzyre BV and Cerevance; a collaboration agreement with Artisan Bio, Inc.; and a multi-target rare disease collaboration with Evox Therapeutics Ltd., as well as licensing agreement with ProThera Biologics Inc. It also has a strategic alliance with Egle Therapeutics SAS and Evotec SE; a strategic partnership with Neurocrine Biosciences, Inc.; Carmine Therapeutics and HemoShear Therapeutics, LLC; strategic collaboration with KSQ Therapeutics to research, develop, and commercialize immune-based therapies for cancer; and strategic collaboration with Anima Biotech. Takeda Pharmaceutical Company Limited was founded in 1781 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8668",
        "website": "http://www.takeda.com",
        "market_cap": 52674162688
    },
    "TON.F": {
        "short_name": "TOHO HOLDINGS CO. LTD.",
        "long_name": "Toho Holdings Co., Ltd.",
        "summary": "Toho Holdings Co., Ltd. engages in the wholesale distribution of pharmaceutical products in Japan. It sells prescription pharmaceuticals, reagents, medical devices and materials, OTC drugs, and health foods to preventive care, clinical care, community healthcare linkage, and home medical and nursing care, as well as provides support services, including the development and sale of customer support systems, assistance in the start-up of medical institutions and pharmacies, management consulting services, medical support, and personnel recruitment. The company also engages in dispensing pharmacy business; manufacture and sale of generic drugs; and site management organization business that assists various medical institutions with clinical trials under contract, as well as sells software to medical institutions. In addition, it provides various customer support systems, including ENIF, an information terminal for pharmaceutical ordering; ENI-Pharmacy, a support system for the separation of dispensing and prescribing functions; LXMATE HeLios and SELENE, a medical care appointment system; Appointment service for first patients, a system to make an appointment via medical institute search engine prior to visiting hospital; ENIFwin, an inventory control system for large hospitals, ENIFvoice SP/ ENIFvoice SP + A/ Core, a supporting system for electronic medication history recording with voice recognition; and ENIF Nurse, an operation support terminal for home-visit nurses; and logistics systems. Toho Holdings Co., Ltd. was founded in 1948 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "155-8655",
        "website": "http://www.tohohd.co.jp",
        "market_cap": 915795776
    },
    "TSMRF": {
        "short_name": "TSUMURA & CO",
        "long_name": "Tsumura & Co.",
        "summary": "Tsumura & Co. engages in the manufacture and sale of pharmaceutical products worldwide. The company offers Kampo extract intermediates and granular Kampo formulations. It is involved in the procurement, selection and processing, and storage of raw material crude drugs and crude drug pieces for decoction; manufacture of Kampo powdered extracts and traditional Chinese medicines, as well as Kampo powdered extracts; and sale of pharmaceuticals and food products. The company was founded in 1893 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-8521",
        "website": "http://www.tsumura.co.jp",
        "market_cap": 2559536128
    }
}