{
    "2152.T": {
        "short_name": "YOUJI CORPORATION",
        "long_name": "Youji Corporation",
        "summary": "Youji Corporation provides physical education services for children in Japan. It offers physical education and guidance for primary school children; travel planning and arrangement services; kindergarten and nursery school management consulting services; and garden development services. The company was founded in 1972 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-0031",
        "website": "http://www.youji.co.jp",
        "market_cap": "Large Cap"
    },
    "2179.T": {
        "short_name": "SEIGAKUSHA CO LTD",
        "long_name": "Seigakusya Co., Ltd.",
        "summary": "Seigakusya Co., Ltd. operates junior secondary schools in Japan. It also provides junior high school entry courses, university entry courses, and individual instruction courses, as well as operates examination image lesson preparatory school. The company was founded in 1982 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": null,
        "website": "http://www.kaisei-group.co.jp",
        "market_cap": "Mid Cap"
    },
    "2415.T": {
        "short_name": "HUMAN HLDGS CO.LTD",
        "long_name": "Human Holdings Co., Ltd.",
        "summary": "Human Holdings Co., Ltd. operates in human resource business in Japan. The company offers solutions to various human resources issues, such as recruitment, organization, consulting, personnel introduction, outsourcing, etc.; education services, including training of human resources, acquisition and improvement of skills, acquisition of specialized knowledge and qualifications, science classroom for children, Japanese language education for foreigners, e-learning system, MBA programs, kids and junior school, full-time specialized school, evening weekend course, and translation services. It also provides day care, home help, multifunctional home care, nursing small-scale multifunctional home care, communal living care for dementia patients, and elderly nursing home services, as well as lectures and trainings for corporations and organizations to acquire nursing care related qualifications; and operates public childcare facilities comprising of authorized and certified childcare centers, as well as childcare centers within companies, hospitals, and universities. In addition, the company operates nail salon under the DASHING DIVA name; and develops and sells gel original nail related products; and manages and operates Ookini Arena Maishima equipped with 4 projectors, 52 moving lights, and 4 LED visions to promote music and sports events; Osaka Evessa, a professional basketball team; engages in advertising business consisting of PR / advertising planning and production, and sales promotion and merchandising services. Further, it engages in the Website production and system development businesses. Human Holdings Co., Ltd. was founded in 1985 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-0023",
        "website": "http://www.athuman.com",
        "market_cap": "Mid Cap"
    },
    "3998.T": {
        "short_name": "SURALA NET CO LTD",
        "long_name": "SuRaLa Net Co.,Ltd.",
        "summary": "SuRaLa Net Co.,Ltd. provides educational services through e-learning in Japan and internationally. It also provides operation consulting, marketing promotion, and Website operation services. The company was founded in 2008 and is headquartered in Tokyo, Japan. SuRaLa Net Co.,Ltd. is a subsidiary of FC Education Inc.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.surala.jp",
        "market_cap": "Large Cap"
    },
    "4645.T": {
        "short_name": "ICHISHIN HOLDINGS CO LTD",
        "long_name": "Ichishin Holdings Co.,Ltd.",
        "summary": "Ichishin Holdings Co.,Ltd., through its subsidiaries, engages in the education business in Japan. The company operates Cram, preparatory, junior, high, and international schools; and day and group homes. It also engages in the video planning and production, homepage production, and fitness businesses; and travel planning and arrangement business. In addition, the company operates Japanese language school; a housing for the elderly, day service, dementia-friendly communal living care facility, and small-scale multifunctional home care facility; and nursing and home care facilities. Further, it offers community outpatient and home care support and clerical services. The company was founded in 1965 and is headquartered in Ichikawa, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Ichikawa",
        "zipcode": "272-0021",
        "website": "http://www.ichishin.jp",
        "market_cap": "Mid Cap"
    },
    "4668.T": {
        "short_name": "MEIKO NETWORK JAPAN",
        "long_name": "Meiko Network Japan Co., Ltd.",
        "summary": "Meiko Network Japan Co., Ltd. engages in the educational activities in Japan. The company operates individual tutoring cram schools for children of various ages from elementary school to university entrance examinations preparation directly, as well as through its franchise system. It also operates medical cram school for medicine-related university entrance examinations; soccer schools for preschool children, and elementary and junior high school students; and extended-hours cram schools for elementary school children performing the added function of after school care, as well as operates individual tutoring cram school for students with high academic performance seeking to enter high-ranking and difficult-to-enter schools. In addition, the company sells practice examinations and teaching materials; and publishes academic books. As of August 31, 2019, it operated 1,932 classrooms. The company was formerly known as Meiko Gijuku Corporation and changed its name to Meiko Network Japan Co., Ltd. in December 1986. Meiko Network Japan Co., Ltd. was founded in 1984 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-0023",
        "website": "http://www.meikonet.co.jp",
        "market_cap": "Large Cap"
    },
    "4678.T": {
        "short_name": "SHUEI YOBIKO CO",
        "long_name": "SHUEI YOBIKO Co., Ltd.",
        "summary": "SHUEI YOBIKO Co., Ltd. provides various educational services in Japan. It provides elementary and junior high school services; and distributes educational video content, as well as operates cram and preparatory schools. The company is also involved in the Franchise business. SHUEI YOBIKO Co., Ltd. was founded in 1977 and is headquartered in Shizuoka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Shizuoka",
        "zipcode": "420-0839",
        "website": "http://www.shuei-yobiko.co.jp",
        "market_cap": "Mid Cap"
    },
    "4705.T": {
        "short_name": "CLIP CORPORATION",
        "long_name": "CLIP Corporation",
        "summary": "CLIP Corporation engages in the education and sports businesses in Japan. It is involved in the management of cram school for elementary and junior high school students; soccer classes for infants and elementary school lower grades; Yuasa football club; dance school for young and third graders; and basket school for infants and elementary schools. The company also engages in the home delivery of lunch; agricultural; development of osteopathic and manipulative clinics; management of a yakiniku restaurant; and residential land and building transaction businesses. In addition, it sells plant mineral water; and leases real estate properties. The company was founded in 1981 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "464-0075",
        "website": "http://www.clip-cor.co.jp",
        "market_cap": "Mid Cap"
    },
    "4714.T": {
        "short_name": "RISO KYOIKU CO LTD",
        "long_name": "Riso Kyoiku Co., Ltd.",
        "summary": "Riso Kyoiku Co., Ltd. operates TOMAS private study Juku schools for elementary, and junior and senior high school students in Japan. The company also operates MEDIC TOMAS private study Juku schools that specialize in preparation for medical school exams. It operates 64 TOMAS private study Juku schools. Riso Kyoiku Co., Ltd. was founded in 1985 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "171-0031",
        "website": "http://www.riso-kyoikugroup.com",
        "market_cap": "Large Cap"
    },
    "4718.T": {
        "short_name": "WASEDA ACADEMY",
        "long_name": "Waseda Academy Co., Ltd.",
        "summary": "Waseda Academy Co., Ltd. manages cram schools for elementary, junior, and high school students. It operates 161 schools. The company was incorporated in 1974 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "171-0022",
        "website": "http://www.waseda-ac.co.jp",
        "market_cap": "Large Cap"
    },
    "4720.T": {
        "short_name": "JOHNAN ACADEMIC PREPARATORY",
        "long_name": "Johnan Academic Preparatory Institute, Inc.",
        "summary": "Johnan Academic Preparatory Institute, Inc. engages in the education business primarily in Japan. It manages cram schools and other various classrooms, as well as provides recruitment and management guidance for preparatory schools and entrance classes. The company also plans, produces, and sells teaching materials for university, high school, junior high school exams; and engages in the infant education and childcare activities, as well as web learning systems. In addition, it franchises its preparatory schools. The company was founded in 1961 and is headquartered in Kawasaki, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kawasaki",
        "zipcode": "210-0007",
        "website": "http://www.johnan.co.jp",
        "market_cap": "Mid Cap"
    },
    "4735.T": {
        "short_name": "KYOSHIN CO LTD",
        "long_name": "Kyoshin Co., Ltd.",
        "summary": "Kyoshin Co., Ltd., together with its subsidiaries, provides educational services in Japan and internationally. The company offers various educational services, such as exam preparation, early childhood education, and basic academic achievement improvement. It also provides learning cram school services, childcare service, English conversation, nursing care services, and Japanese education services, as well as offers Kyoto e-DES, an online learning program. In addition, the company franchises classroom tutoring services under the Kyosei School One brand. Further, it engages in the International human resources exchange project. Kyoshin Co., Ltd. was founded in 1975 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "600-8177",
        "website": "http://www.kyoshin.co.jp",
        "market_cap": "Mid Cap"
    },
    "4745.T": {
        "short_name": "TOKYO INDIVIDUALIZED EDUCATIONA",
        "long_name": "Tokyo Individualized Educational Institute, Inc.",
        "summary": "Tokyo Individualized Educational Institute, Inc. engages in education business primarily in Japan. The company offers individual instruction services to high, junior high, and elementary school students. It also provides human resources development training, and personnel and human resources development consulting services. The company was founded in 1985 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "163-0525",
        "website": "http://www.tkg-jp.com",
        "market_cap": "Large Cap"
    },
    "6096.T": {
        "short_name": "RAREJOB INC",
        "long_name": "RareJob Inc.",
        "summary": "RareJob Inc. provides online English speaking and conversation services for individuals, corporates, and educational institutions in Japan and the Philippines. The company was founded in 2007 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.rarejob.co.jp",
        "market_cap": "Large Cap"
    },
    "7030.T": {
        "short_name": "SPRIX LTD",
        "long_name": "SPRIX, Ltd.",
        "summary": "SPRIX, Ltd. operates as an educational company in Japan. It offers various online learning contents, including planning and development of educational apps that include learning videos and manga; operates Morijuku, a private tutoring school and RED, an independent online learning school; operates a recruitment site for cram school teachers; and operates Tokyo Dance Village, a dance school. The company also develops and sells teaching materials for cram schools for elementary, junior high, and high schools, as well as produces and sells Chinese language education and reading education programs. SPRIX, Ltd. was founded in 1997 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "171-0021",
        "website": "http://www.sprix.jp",
        "market_cap": "Large Cap"
    },
    "7073.T": {
        "short_name": "JAIC CO LTD",
        "long_name": "JAIC Co.,Ltd.",
        "summary": "JAIC Co.,Ltd. provides employment and recruitment support services. It offers young, female full-time, new graduate student, and university dropout employment and recruitment support services. The company also engages in education training business, including developing and selling employee education teaching materials. In addition, it develops and operates career education and employment support programs with universities. The company was founded in 1991 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0051",
        "website": "http://www.jaic-g.com",
        "market_cap": "Mid Cap"
    },
    "7084.T": {
        "short_name": "KIDS SMILE HOLDINGS INC",
        "long_name": "Kids Smile Holdings Inc.",
        "summary": "Kids Smile Holdings Inc. provides childcare and early childhood education services in Japan. As of December 31, 2019, it operated a total of 51 facilities, including 4 preschool integrated nursery schools, 46 licensed nursery schools, and one preschool classroom. The company was founded in 2008 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-0031",
        "website": "http://www.kidssmile-hd.co.jp",
        "market_cap": "Mid Cap"
    },
    "7353.T": {
        "short_name": "KIYO LEARNING CO LTD",
        "long_name": "KIYO Learning Co., Ltd.",
        "summary": "KIYO Learning Co.,Ltd. engages in planning, production, sale, and operation of educational content and services for business people in Japan. The company was founded in 2010 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0094",
        "website": "http://www.kiyo-learning.com",
        "market_cap": "Large Cap"
    },
    "9470.T": {
        "short_name": "GAKKEN HOLDINGS CO LTD",
        "long_name": "Gakken Holdings Co., Ltd.",
        "summary": "Gakken Holdings Co., Ltd. publishes books and magazines in Japan and internationally. The company provides learning classes for developing capabilities to think for oneself for preschoolers, elementary, and junior high and high school students; piano courses; operates science classroom Kagaku Plus, and learning centers and cram schools, as well as a service to dispatch home tutors; and develops educational materials for learning centers. It also operates approximately 400 housing and facilities for the elderly; offers home-based care services, including home-visit nursing and daycare services; conducts food delivery services to prevent nursing care and promotes health; and operates nursery school/children' s daycare center and afterschool children's clubs, as well as developmental support programs. In addition, the company is involved in the publication of children's books, study-aid books, dictionaries, general books/ technical books, practical books, magazines, and books for libraries; online classes business; developing web services and software to digitalizing contents in the medical field; and designing, developing, and selling of stationeries and miscellaneous goods. Further, it offers educational toys/learning materials/ games; school supplies, playground equipment, picture books for pre-school children, kindergarten facilities, and seminar for guardians/toddler classrooms; textbooks/supplemental books/education information contents, educational books/magazines, movies, and welfare/health/special needs education contents for elementary and junior high school; and mock exam/various test materials and essay writing materials. Additionally, it provides employment support, logistics, and office support services; and operates research institutions. The company was formerly known as Gakken Co., Ltd. and changed its name to Gakken Holdings Co., Ltd. in October 2009. Gakken Holdings Co., Ltd. was founded in 1947 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-8510",
        "website": "http://www.gakken.co.jp",
        "market_cap": "Large Cap"
    },
    "9733.T": {
        "short_name": "NAGASE BROTHERS INC",
        "long_name": "Nagase Brothers Inc.",
        "summary": "Nagase Brothers Inc. provides education services in Japan. It operates high schools, preparatory schools, junior high schools, business schools, elementary schools, and swimming schools; and offers entrance examination services, as well as publishes reference books. The company was founded in 1971 and is headquartered in Musashino, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Musashino",
        "zipcode": null,
        "website": "http://www.toshin.com",
        "market_cap": "Large Cap"
    },
    "9769.T": {
        "short_name": "GAKKYUSHA CO LTD",
        "long_name": "Gakkyusha Co.,Ltd.",
        "summary": "Gakkyusha Co.,Ltd. manages a cram school that provides guidance for entrance exams to junior high schools, high schools, and universities in Japan and internationally. The company was founded in 1972 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "151-0053",
        "website": "http://www.gakkyusha.com",
        "market_cap": "Large Cap"
    },
    "9778.T": {
        "short_name": "SUBARU CO LTD",
        "long_name": "Subaru Co., Ltd.",
        "summary": "Subaru Company, Ltd. provides learning and examination instruction services in Japan. It offers elementary school, junior high school, middle school, high school, satellite preparatory school, and individualized instruction courses. The company operates 37 schools in Kagoshima, 15 schools in Miyazaki, 11 schools in Kumamoto, and 4 schools in Fukuoka. Subaru Co., Ltd. was founded in 1965 and is headquartered in Kagoshima, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kagoshima",
        "zipcode": "892-0846",
        "website": "http://www.subaru-net.com",
        "market_cap": "Mid Cap"
    },
    "9783.T": {
        "short_name": "BENESSE HOLDINGS INC",
        "long_name": "Benesse Holdings, Inc.",
        "summary": "Benesse Holdings, Inc. provides educational, senior nursing care, and childcare services in Japan and internationally. The company operates through four segments: Domestic Education, Global Kodomo Challenge, Nursing Care and Childcare, and Berlitz. The Domestic Education segment engages in the correspondence course business, school and teacher support business, cram and prep school business, English language classes for children business, and other businesses for primary school students to high school students. The Global Kodomo Challenge segment is involved in the correspondence course business in Japan, China, Taiwan, and Indonesia, primarily targeting infants. The Nursing Care and Childcare segment engages in the residential care services business, which include the operation of nursing homes and elderly homes; home helper services business; training courses for nursing care personnel; a staff placement and personnel dispatch company specializing in medical and nursing care personnel; the daycare and afterschool childcare operations business; and other businesses. The Berlitz segment is involved in the language instruction business; the ELS business, which provides educational services, including language training to those who want to study abroad; the worldwide leadership training business; and other businesses. It also offers interpretation and translation services; information and products relating to pregnancy, childbirth, and parenting; lifestyle information and support everyday living through forums for communication with customers; and magazines, websites, and others to help enrich life with pets. The company was formerly known as Benesse Corporation and changed its name to Benesse Holdings, Inc. in 2009. Benesse Holdings, Inc. was founded in 1955 and is headquartered in Okayama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Okayama",
        "zipcode": "700-0807",
        "website": "http://www.benesse-hd.co.jp/ja",
        "market_cap": "Large Cap"
    },
    "BE8.F": {
        "short_name": "BENESSE HOLDINGS INC.",
        "long_name": "Benesse Holdings, Inc.",
        "summary": "Benesse Holdings, Inc. provides educational, senior nursing care, and childcare services in Japan and internationally. The company operates through four segments: Domestic Education, Global Kodomo Challenge, Nursing Care and Childcare, and Berlitz. The Domestic Education segment engages in the correspondence course business, school and teacher support business, cram and prep school business, English language classes for children business, and other businesses for primary school students to high school students. The Global Kodomo Challenge segment is involved in the correspondence course business in Japan, China, Taiwan, and Indonesia, primarily targeting infants. The Nursing Care and Childcare segment engages in the residential care services business, which include the operation of nursing homes and elderly homes; home helper services business; training courses for nursing care personnel; a staff placement and personnel dispatch company specializing in medical and nursing care personnel; the daycare and afterschool childcare operations business; and other businesses. The Berlitz segment is involved in the language instruction business; the ELS business, which provides educational services, including language training to those who want to study abroad; the worldwide leadership training business; and other businesses. It also offers interpretation and translation services; information and products relating to pregnancy, childbirth, and parenting; lifestyle information and support everyday living through forums for communication with customers; and magazines, websites, and others to help enrich life with pets. The company was formerly known as Benesse Corporation and changed its name to Benesse Holdings, Inc. in 2009. Benesse Holdings, Inc. was founded in 1955 and is headquartered in Okayama, Japan.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Okayama",
        "zipcode": "700-0807",
        "website": "http://www.benesse-hd.co.jp/ja",
        "market_cap": "Small Cap"
    },
    "BSEFY": {
        "short_name": "BENESSE HOLDINGS INC",
        "long_name": "Benesse Holdings, Inc.",
        "summary": "Benesse Holdings, Inc. provides educational, senior nursing care, and childcare services in Japan and internationally. The company operates through four segments: Domestic Education, Global Kodomo Challenge, Nursing Care and Childcare, and Berlitz. The Domestic Education segment engages in the correspondence course business, school and teacher support business, cram and prep school business, English language classes for children business, and other businesses for primary school students to high school students. The Global Kodomo Challenge segment is involved in the correspondence course business in Japan, China, Taiwan, and Indonesia, primarily targeting infants. The Nursing Care and Childcare segment engages in the residential care services business, which include the operation of nursing homes and elderly homes; home helper services business; training courses for nursing care personnel; a staff placement and personnel dispatch company specializing in medical and nursing care personnel; the daycare and afterschool childcare operations business; and other businesses. The Berlitz segment is involved in the language instruction business; the ELS business, which provides educational services, including language training to those who want to study abroad; the worldwide leadership training business; and other businesses. It also offers interpretation and translation services; information and products relating to pregnancy, childbirth, and parenting; lifestyle information and support everyday living through forums for communication with customers; and magazines, websites, and others to help enrich life with pets. The company was formerly known as Benesse Corporation and changed its name to Benesse Holdings, Inc. in 2009. Benesse Holdings, Inc. was founded in 1955 and is headquartered in Okayama, Japan.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Okayama",
        "zipcode": "700-0807",
        "website": "http://www.benesse-hd.co.jp/ja",
        "market_cap": "Mid Cap"
    },
    "EXDW": {
        "short_name": "EXCEED WORLD INC",
        "long_name": "Exceed World, Inc.",
        "summary": "Exceed World, Inc., together with its subsidiaries, provides education services to pre-school children, students, and adult learners in Japan. The company offers a range of e-learning education programs, which include pre-school learning resources, learning resources supplementing elementary school, junior high school and senior high school curriculum, preparation courses for university entrance examinations, professional qualification examinations, and English learning. It also provides supporting services through Force Club, an internet platform. The company was formerly known as Brilliant Acquisition, Inc. and changed its name to Exceed World, Inc. in January 2016. Exceed World, Inc. was founded in 2014 and is based in Suita, Japan. Exceed World, Inc. is a subsidiary of Force Internationale Limited.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Suita",
        "zipcode": "564-0063",
        "website": null,
        "market_cap": "Small Cap"
    },
    "TDC.F": {
        "short_name": "TAC CO. LTD",
        "long_name": "TAC Co.,Ltd.",
        "summary": "TAC Co.,Ltd. engages in personal education, corporate training, publishing, and manpower businesses in Japan. The company's Personal Education segment offers study materials, such as classroom, individual DVD and DVD, Web-based broadband, Audio Data Download, and material courses. Its Corporate Training segment provides training programs for practical skill, social skill, and acquisition of qualifications; distance learning; educational materials; in-university seminars; courses for business professionals; IT license education; and education services, as well as operates affiliated schools. The company's Publishing segment publishes textbooks and exam practice book; and books of job-searching activities, liberal arts, and travel guide, as well as learning book for elementary school students, translated business books and novels, entertainment, etc. under the TAC Publishing and Waseda Management Publishing brands. This segment also offers learning contents; and various media products, including e-books apps. Its Manpower segment provides manpower dispatching and placement, and job advertisement services. The company was founded in 1980 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-8383",
        "website": "http://www.tac-school.co.jp",
        "market_cap": "Small Cap"
    }
}