{
    "3374.T": {
        "short_name": "NAIGAI TEC CORP",
        "long_name": "Naigai Tec Corporation",
        "summary": "Naigai Tec Corporation offers pneumatic devices, pneumatic application devices, working machines, electric and electronic devices, and other tools. The company procures and sells mechatronics, including pneumatic equipment, vacuum equipment, drive units, temperature and liquid control equipment, power supply equipment, aluminum frames and FA equipment, environmental and general industrial equipment, logistics and materials handling equipment, and products for semiconductor and liquid crystal industries. It also designs, develops, and manufactures tensile testing machines and durability evaluation machines for rubber materials; sun tracking solar units; creasers and sealing machines; semiconductor manufacturing equipment units, such as prototypes and mass production equipment; aluminum frames; labor-saving devices and automated machines; various testing machines for laboratories, universities, and graduate schools; control units for a range of air-related equipment, including drive and vacuum systems; and water-cooled control units. In addition, the company is involved in the assembly and production of liquid crystal exposure apparatus; and creation of assembly procedure manuals and other documents. Further, it provides repair and maintenance services for temperature control equipment, vacuum valves and pumps, and other equipment. Naigai Tec Corporation was founded in 1961 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "5310.T": {
        "short_name": "TOYO TANSO CO LTD",
        "long_name": "Toyo Tanso Co., Ltd.",
        "summary": "Toyo Tanso Co., Ltd. produces and sells various carbon products in Japan and internationally. The company provides isotropic graphite products for use in semi-conductor, mold, renewable energy, and atomic power industries; carbon-carbon composite materials for use in general industries, as well as in technological fields, such as aerospace and semiconductor manufacture; and PERMA-FOIL, a flexible graphite sheet that is used as a seal to note automotive gaskets and packing. It also offers mechanical carbon for sliding parts in high temperature environments, for submersion in chemicals, and in fields where lubricated parts cannot be used, as well as copper-impregnated carbon materials for a pantograph slider; carbon brushes for home appliances and power tools; PERMA KOTE, a SiC coated graphite for use in the semiconductor manufacturing industry; PYROGRAPH, a high purity graphite product; and GLASTIX KOTE, a graphite substrate impregnated or coated with glass-like carbon. In addition, the company provides CNovel, a porous carbon; EVEREDKOTE-B, a high-purity isotropic graphite substrate; TaC/Ta Composite EVEREDKOTE-K, a high-purity tantalum; KLASTA MATE, a metalÂ\u0096carbon composite; MetalizeKote metal carbide-coated graphite; and CARBOCELL, a ceramic composite. Further, it offers technical services, such as machining, heat treatment, high purity treatment, surface treatment, impregnation, forming, and measurement. The company was formerly known as Kondo Carbon Manufacturing Co., Ltd. and changed its name to Toyo Tanso Co., Ltd. in November 1949. Toyo Tanso Co., Ltd. was founded in 1941 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "5801.T": {
        "short_name": "FURUKAWA ELECTRIC CO",
        "long_name": "Furukawa Electric Co., Ltd.",
        "summary": "Furukawa Electric Co., Ltd. manufactures and sells telecommunications, energy, automobile, electronic parts, and construction products worldwide. It operates through Infrastructure, Automotive Products & Materials, Functional Products, and Service and Developments segments. The company offers telecommunications products, such as broadband systems, routers/network equipment, and wireless products; and optical fiber cables and identifiers, optical closures/termination boxes, optical connectors/cords, fusion splicers/optical connecting tools, optical fiber line monitoring/management systems, optical component/devices, and metal communication cables, as well as wiring materials. It also offers energy products, including power cables, cable-related equipment/connection and terminal products, industrial machine-related equipment, fire-prevention products, electrical conductors, power distribution products, and cable conduit materials; and automobile products comprising wire harnesses, connectors, functional products and materials, and interior finishing materials. In addition, the company provides electronics parts materials, fluorescent lamps, and LED reflectors, as well as healthcare products, such as polyimide tubes and shape memory/super-elastic alloys; construction products, including water distribution piping and fluid transport piping products, heat insulators, and cable-related equipment/connection and terminal products; and superconducting cables, industrial lasers, single cell hunters, flow cytometers, and fluorescent silica nanoparticles. Furukawa Electric Co., Ltd. was founded in 1884 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "5803.T": {
        "short_name": "FUJIKURA",
        "long_name": "Fujikura Ltd.",
        "summary": "Fujikura Ltd. researches, develops, manufactures, and sells wires and cables in Japan, the United States, China, and internationally. The company operates in four segments: Power & Telecommunication Systems Company, Electronics Business Company, Automotive Products Company, and Real Estate Business Company. It offers power and telecommunication systems products, including twisted pair cables, coaxial cables, eco cables, conductors, OHTL and power cables, magnet wires, energy harvesting products, optical fibers/fiber cables, splicers and others, optical components, optical connectors/connected parts, specialty fibers, optical applied products, optical camera link cable assemblies, and fiber lasers. The company also offers electronics products, such as sensors, electrical components, electronic wires, thermal products, and connectors; automotive components, automotive wires, wire harnesses, relay connectors, main fuse and joint boxes, and other products; and superconductors, medical devices, and wireless communications modules. In addition, it develops a complex facility to combine businesses, shopping, and amenities; leases offices; and provides real estate brokerage, professional lessons, golf school, and event services. Fujikura Ltd. was founded in 1885 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "5805.T": {
        "short_name": "SWCC SHOWA HOLDINGS CO.LTD",
        "long_name": "SWCC Showa Holdings Co., Ltd.",
        "summary": "SWCC Showa Holdings Co., Ltd., together with its subsidiaries, operates in the energy systems, communication systems, and device businesses in Japan and internationally. The company's Electrical Wire and Wire Rod Operations segment offers bare wires, rubber/plastic insulated wires, power distribution equipment, bus cables, and overhead cables. Its Energy System Operations segment is involved in the provision of electric power cables, power cable accessories, and power cable and communication system installation works. The company's Magnet Wire Operations segment provides magnet wires. Its Communication System Operations segment offers optical fiber cables, communication cables and accessories, optical peripheral devices/connector assemblies, and network solutions. The company's Device Operations segment provides wire harnesses, devices for seismic isolation, vibration dampers/isolators, and devices for photocopiers and printing machines. Its Others segment engages in the distribution, superconducting wire operation, and other activities. The company also produces and sells rollers for information processing equipment, seismic isolators and vibration dampers, vibration isolation rubber, etc., as well as fire-proof and coated wires; and sells vibration-control equipment, air spring vibration isolators, optical instrumentation units, precision surface plates, and electrical and electronic equipment. In addition, it is involved in the development and maintenance of systems; security and network development; design/execution/supervision of electric works; disassembly of electric wires and cables; transportation activities through motor trucks; management of warehouses; shipment and delivery operations; production and sale of copier components and oxygen-free copper products; production and sale of drums for electric wires; and provision of electricity distribution equipment. SWCC Showa Holdings Co., Ltd. was founded in 1936 and is headquartered in Kawasaki, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kawasaki"
    },
    "5807.T": {
        "short_name": "TOTOKU ELECTRIC CO",
        "long_name": "Totoku Electric Co., Ltd.",
        "summary": "Totoku Electric Co., Ltd. develops and sells electric wires, heater products, and cable and wire processed products in Japan. The company offers triple insulated winding wires, heat resistance wires, extra fine alloy wires, high frequency cable assemblies, suspension wires, contact probes, high mechanical strength lead wires, and flexible flat cables. It also provides information and communication cables, equipment wires, heater wires, coaxial cables, and precision coils. Totoku Electric Co., Ltd. was founded in 1940 and is headquartered in Tokyo, Japan. Totoku Electric Co., Ltd, operates as a subsidiary of Furukawa Electric Co., Ltd.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "5809.T": {
        "short_name": "TATSUTA ELECTRIC WIRE & CABLE C",
        "long_name": "TATSUTA Electric Wire and Cable Co., Ltd.",
        "summary": "TATSUTA Electric Wire and Cable Co., Ltd. engages in the manufacture and sale of electric wires/cables, electronic materials, and sensor and medical products in Japan. The company provides electric wires and cables for power distribution, equipment and machinery, nuclear power plants, and railways and vehicles; telecommunications and instrumentation cables; and insect-resistant cables. It also offers equipment wires and cables comprising high-strength cables, thin high-strength cables, high-strength slip cables, and spatter-resistant high-strength cables; functional materials, such as multi-functional electromagnetic interference (EMI) shielding films, EMI shielding film related materials, conductive pastes, and films for FFC applications; and bonding wires, including gold/gold bumping, silver, copper, and palladium wires. In addition, the company provides sensor products, such as water leakage detection sensors, water leakage detection systems, water (chemical) leakage detection systems, water leakage sheets, and intruder monitoring systems; and medical equipment products, which include liquid leakage sensors, IV counter, liquid control systems for artificial dialysis equipment, optical fiber interference tomography meter for OCT applications, and electric wires for medical applications. Further, it offers optical fiber components, as well as environmental analysis services. The company was founded in 1945 and is headquartered in Higashiosaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Higashiosaka"
    },
    "5816.T": {
        "short_name": "ONAMBA CO LTD",
        "long_name": "Onamba Co., Ltd.",
        "summary": "Onamba Co., Ltd. manufactures and distributes wires and components for household electronic appliances, business equipment, and industrial electronic appliances in Japan and internationally. The company offers renewable energy related products, including photovoltaic-interconnecting units (PVU), PVU-Finders, solar system cables, battery and sensor systems, IoT gateway solutions, remote monitoring systems, and automated misting systems. It also provides automotive wire harnesses for seatbelts and airbags, air conditioners, lighting, audio equipment, and starters for automobile engines; consumer harnesses; industrial harnesses; and cable processed products. In addition, the company offers harness processing machinery and parts, including automotive connectors, and equipment and machinery; various cables and wires, which include general purpose cables, computer cables, camera cables, production regulation cables, measurement cables, LAN cables, etc.; and coaxial cables for automotive camera modules. Onamba Co., Ltd. was incorporated in 1941 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "5819.T": {
        "short_name": "CANARE ELECTRIC CO",
        "long_name": "Canare Electric Co., Ltd.",
        "summary": "Canare Electric Co., Ltd. develops, manufactures, and sells audio and video cables, connectors, patchbays, assemblies, converters and related products, and fiber-optic products in Japan and internationally. The company also offers video jacks, crimp plugs, receptacles and adapters, and coaxial cable strippers. It serves television broadcasting, and professional audio and video industries. The company was founded in 1970 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "5939.T": {
        "short_name": "OTANI KOGYO CO LTD",
        "long_name": "Otani Kogyo Co.,Ltd.",
        "summary": "Otani Kogyo Co.,Ltd. manufactures and sells overhead wire hardware for power distribution/communication lines and CATVs in Japan. The company also designs, manufactures, and sells hardware for radio disaster prevention; screws; and power transmission towers/wireless towers, outdoor ironworks, mounts, racks, and fences. In Addition, it produces, sells, and constructs studs; and offers hot dip galvanizing services. The company was founded in 1945 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "5983.T": {
        "short_name": "IWABUCHI CORP",
        "long_name": "Iwabuchi Corporation",
        "summary": "Iwabuchi Corporation manufactures and sells electrical overhead wire hardware for power, communication, signals, broadcasting, and railway industries in Japan. The company offers parts of power transmission and distribution equipment; communication equipment; broadcast receiving and supporting equipment; synthetic electrical insulation materials; and other electrical connection equipment. It also provides distribution line pillar, telecommunication/telephone line pole, broadband pillar, and traffic lights/road signs column accessories; and disaster prevention wireless facility column and sports facilities supplies. In addition, the company offers lamination prevention sheets; spring filter, a commodity that is developed for the re-use of industrial water and industrial lubricating oils; Mag Plus One, a high corrosion-resistant plating for salt damage area; and sheet precision sheet metal workpieces. Iwabuchi Corporation was founded in 1950 and is headquartered in Matsudo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Matsudo"
    },
    "5JW.SG": {
        "short_name": "W-SCOPE Corp. Registered Shares",
        "long_name": "W-SCOPE Corporation",
        "summary": "W-SCOPE Corporation manufactures and sells plastic films and sheets. It offers separators for lithium-ion secondary batteries. It serves in Japan, South Korea, China, Europe, and North America. The company was founded in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "5KE.SG": {
        "short_name": "KIKUSUI ELECTRONICS CORP. Regis",
        "long_name": "Kikusui Electronics Corporation",
        "summary": "Kikusui Electronics Corporation manufactures, imports, exports, and sells electronic test and measuring instruments, power supplies, and software products in Japan and internationally. Its principal products include DC and AC power supplies, electronic loads, telecommunication measuring instruments, withstanding voltage testers, insulation testers, earth continuity testers, leakage current testers, calibrators, and signal generators. The company also offers power supply controllers, electrical safety testers, EMC testers, harmonics and flicker testers, fuel cell impedance meters, battery and capacitor testers, and rack mount accessories, as well as custom-made systems. In addition, it imports and sells digital communication, microwave, and avionics measuring instruments. The company was formerly known as Kikusui Denpa and changed its name to Kikusui Electronics Corporation in 1962. The company was founded in 1951 and is headquartered in Yokohama, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "6231.T": {
        "short_name": "KIMURA KOHKI CO LTD",
        "long_name": "KIMURA KOHKI Co.,Ltd.",
        "summary": "KIMURA KOHKI Co.,Ltd. manufactures and sells air conditioners in Japan. It offers building, large space zone, and industrial air conditioning products. The company was founded in 1947 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "6506.T": {
        "short_name": "YASKAWA ELECTRIC CORP",
        "long_name": "YASKAWA Electric Corporation",
        "summary": "YASKAWA Electric Corporation engages in motion control, robotics, system engineering, and other businesses worldwide. It manufactures and sells various AC drives, including general purpose AC drives, medium-voltage AC drives, system-use AC drives, and power regenerative units for use in cranes, fans, pumps, machine tools, conveyors, automated warehouses, and metal working machinery; and rotary servo motors, direct drive servo motors, linear servo motors, machine controllers, and machine vision systems that are used in chip mounters, robots, and metal working machinery. The company also offers arc and spot welding, handling/assembling, collaborative, biomedical, palletizing, press handling, sealing/cutting/laser machining, deburring, painting, glass substrates transfer, and semiconductor wafer transfer robots for use in semiconductor/liquid crystal manufacturing, arc welding, spot welding, palletizing, painting, and handling and assembly applications. In addition, it provides industrial system electrical products, such as medium-voltage AC drives, system use AC drives, and system controllers for use in iron and steel systems, water and wastewater treatment, and paper-making/film/port cargo handling/fiber/printing applications. Further, the company offers equipment for energy saving and creation comprising PV inverters, systems for large wind turbines, control equipment for small-scale power generation, and motor drive systems for use in photovoltaic power generation and electric vehicles. YASKAWA Electric Corporation was founded in 1915 and is headquartered in Kitakyushu, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kitakyushu"
    },
    "6516.T": {
        "short_name": "SANYO DENKI CO",
        "long_name": "Sanyo Denki Co., Ltd.",
        "summary": "Sanyo Denki Co., Ltd. engages in cooling systems, power systems, servo systems, electrical equipment sales, and electrical works contracting businesses in Japan, North America, Europe, East Asia, and Southeast Asia. Its cooling systems include cooling fans and cooling fan units; power systems products comprise uninterruptible power supplies, inverters, engine generators, and power conditioners for photovoltaic generation systems; and servo systems products consist of servo motors, servo amplifiers, stepping motors and drivers, controllers, and encoders. The company also sells industrial electrical equipment, control equipment, and electrical materials for medical and other markets. In addition, it operates in the field of electrical contracting for steel mills, and maintenance and repair work of old electrical equipment. The company sells its products under the SANYO DENKI brand. The company was formerly known as Sanyo Shokai Co., Ltd. and changed its name to Sanyo Denki Co., Ltd. in April 1942. Sanyo Denki Co., Ltd. was founded in 1927 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6617.T": {
        "short_name": "TAKAOKA TOKO CO LTD",
        "long_name": "Takaoka Toko Co., Ltd.",
        "summary": "Takaoka Toko Co., Ltd., together its subsidiaries, engages in the power equipment and systems, electric equipment, energy solutions, measurement, applied optics inspection systems, and smart grid businesses. It is involved in the electrical engineering and construction works; manufacture and sale of applied macromolecular electric equipment and components, gas-insulated instrument transformers, and disconnectors; manufacture and service of electric equipment; and power line and telecommunication construction. The company also engages in the transportation, logistics, and installation of high-voltage instrument transformers; development, manufacture, and sale of C meters; and meter-related electrical construction works and dispatch of workers. In addition, it manufactures and sells thin client systems, as well as develops computer and embedded software; and manufactures and sells wireless telecommunications equipment. The company was formerly known as Takaoka Toko Holdings Co., Ltd. and changed its name to Takaoka Toko Co., Ltd. in April 2014. Takaoka Toko Co., Ltd. was founded in 1918 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6619.T": {
        "short_name": "W-SCOPE CORPORATION",
        "long_name": "W-SCOPE Corporation",
        "summary": "W-SCOPE Corporation manufactures and sells plastic films and sheets. It offers separators for lithium-ion secondary batteries. It serves in Japan, South Korea, China, Europe, and North America. The company was founded in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6637.T": {
        "short_name": "TERASAKI ELECTRIC CO.LTD.",
        "long_name": "Terasaki Electric Co.,Ltd.",
        "summary": "Terasaki Electric Co.,Ltd. manufactures and sells marine and industrial systems, circuit breakers, and medical devices in Japan and internationally. The company offers medium voltage switchgears, power distribution systems, arc proof LV switchgears and control gears, group starter panels, and generating plant management systems; integrated control and monitoring and engine monitoring systems, and engine room simulators; and shore connection and obsolete products. It also provides industrial systems, such as industrial power distribution control and cogeneration systems. In addition, the company offers molded case and air circuit breakers, multi-protection and earth leakage relays, as well as related software; and medical tools and equipment. Further, it provides retrofit solution and lifecycle services for electrical equipment, as well as engineering services in power distribution and control for marine, railway, and industrial applications. Terasaki Electric Co.,Ltd. was founded in 1923 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "6647.T": {
        "short_name": "MORIO DENKI CO LTD",
        "long_name": "Morio Denki Co., Ltd.",
        "summary": "Morio Denki Co., Ltd. designs, manufactures, and sells various electronic components and electrical parts for the transportation infrastructure field in Japan and internationally. It offers information indicators, such as destination and interior information indicators; cab equipment comprising master controllers, buzzer units, conductor's switch units, and change-over switches; and controllers consisting of under-floor switchboard boxes, switchboards, multiple unit control boards, and heaters. The company also provides information display systems, such as signboard vehicle with lifting-type display systems and road information display systems, car-borne information display systems, lifting-type car-borne display systems, and portable LED information display panels for automobiles. In addition, the company offers electrical equipment for ships, which include deck lights, explosion-proof lights and switches, and white/red fluorescent lights; and ceiling fluorescent lights, emergency braking devices, and operation status recorders. Further, it is involved in the real estate-related business. The company was founded in 1911 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6668.T": {
        "short_name": "ADTEC PLASMA TECHNOLOGY CO LTD",
        "long_name": "Adtec Plasma Technology Co., Ltd.",
        "summary": "Adtec Plasma Technology Co., Ltd. designs, manufactures, and sells/supports RF plasma generators, visual matching units, digital RF power tracers, and chamber analyzers in Japan. Its products are installed on tools for LCD panels and semiconductor processes. The company was formerly known as Adtec Co. and changed its name to Adtec Plasma Technology Co., Ltd. in December 2000. Adtec Plasma Technology Co., Ltd. was founded in 1985 and is headquartered in Fukuyama, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Fukuyama"
    },
    "6674.T": {
        "short_name": "GS YUASA CORP",
        "long_name": "GS Yuasa Corporation",
        "summary": "GS Yuasa Corporation manufactures and sells batteries, power supply systems, lighting equipment, and membrane systems in Japan, the rest of Asia, North America, Europe, and internationally. The company operates through Automotive Batteries (Japan), Automotive Batteries (Overseas), Industrial Batteries and Power Supplies, and Automotive Lithium-ion Batteries segments. It offers automotive and motorcycle lead-acid batteries; automotive lithium-ion batteries for electric vehicles, hybrid electric vehicles, and plug-in hybrid electric vehicles; batteries for industrial use; power supply systems; and lithium-ion batteries for manned research submersibles, satellites, rockets, and industrial use. The company was founded in 2004 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kyoto"
    },
    "6748.T": {
        "short_name": "SEIWA ELECTRIC MFG CO",
        "long_name": "Seiwa Electric Mfg. Co., Ltd.",
        "summary": "Seiwa Electric Mfg. Co., Ltd. provides information display systems, industrial lighting equipment, road and tunnel lighting equipment, EMC products, LED module products for lighting, and wire protection devices in Japan. It offers information display systems for roadways, and parking and waterway conditions; emergency information systems for tunnels; monitoring boards for industrial plants; traffic control systems; and LED information displays. The company also produces explosion-proof lighting for use in chemical plants, oil refineries, and other hazardous environments; air-and watertight light fixtures for various industrial environments, as well as supplies illumination for tunnels, highways, and expressways; street lighting for towns and cities; and landscape lighting. In addition, it develops e-Duct, a polyvinyl chloride-free protective cable housing. Further, the company provides fingers, edge fingers, surface mounting fingers and gaskets, gaskets, nonwoven fabric gaskets, ferrite cores, conductive cloth tapes, shield tubes, grounding straps and clamps, electromagnetic wave control sheets, conductive silicone rubbers, metal foil tapes and sheets, vibration control products, thermal conductive sheets, radiation paints and heat shielding paints, and magnetic field probes. Seiwa Electric Mfg. Co., Ltd. was founded in 1945 and is headquartered in Joyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Joyo"
    },
    "6763.T": {
        "short_name": "TEIKOKU TSUSHIN KOGYO CO",
        "long_name": "Teikoku Tsushin Kogyo Co., Ltd.",
        "summary": "Teikoku Tsushin Kogyo Co., Ltd. provides various electronic components in Japan and internationally. It offers discrete products comprising potentiometers, resistance sensors, trimmer potentiometers, switches, encoders, plugs, and fixed resistors; and integrated control box products used in automotive, gaming devices, photographic equipment, video devices, heaters, home appliances, office equipment, video recorders, medical and health devices. Teikoku Tsushin Kogyo Co., Ltd. was founded in 1944 and is headquartered in Kawasaki, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kawasaki"
    },
    "6804.T": {
        "short_name": "HOSIDEN CORP",
        "long_name": "Hosiden Corporation",
        "summary": "Hosiden Corporation manufactures and sells electronics, electrical appliances, auto parts, information telecommunications equipment, office machines, and medical equipment and related parts in Japan and internationally. It offers connectors, switches, and remote-control units; acoustic components comprising speakers, receivers, microphones, headphones, and earphones; and wireless modules consisting of Bluetooth and Bluetooth low energy modules. The company also provides other products, such as AC adapters, wireless chargers, circuit protectors, touch sensors, and A2B compatible acceleration sensors. Its products are used in mobiles, automobiles, audio and visual products, and home electronics. Hosiden Corporation was founded in 1947 and is headquartered in Yao, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Yao"
    },
    "6882.T": {
        "short_name": "SANSHA ELECTRIC MANUFACTURING",
        "long_name": "Sansha Electric Manufacturing Co.,Ltd.",
        "summary": "Sansha Electric Manufacturing Co.,Ltd. manufactures and sells electric, semiconductor and its applied, and medical machinery and equipment in Japan and internationally. It provides discrete semiconductors, such as triac, thyristors, rectifier diodes, and fast recovery diodes; and power modules, including triac, thyristors, rectifier diodes, fast and soft recovery diodes, and SBD and SiC products. The company also offers power supply products for metal surface treatment; grid connected photovoltaic central inverters; uninterrupted power sources; DC power supplies/charging apparatus; electrical regulators; welding machines; and rectification devices. In addition, it is involved in the installation of machinery and equipment, electric wiring, and piping activities. The company was founded in 1933 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "6894.T": {
        "short_name": "PULSTEC INDUSTRIAL CO",
        "long_name": "Pulstec Industrial Co., Ltd.",
        "summary": "Pulstec Industrial Co., Ltd. manufactures and sells electronic applied equipment and systems in China, Japan, South Korea, Taiwan, Thailand, Europe, the United States, and internationally. It offers Âµ-X360s portable X-ray residual stress analyzer, which is used in various industrial fields, such as transportation equipment, bearings, iron and steel structure and components, electric power, heavy machines, surface modification, etc.; and non-contact surface hardness variation scanner for use in the inspection of machining burn or grinding burn, and quenching variation after heat treatment, as well as destructive or visual inspection by nital etching. The company also provides 3D scanners; wavefront sensors; optical disc evaluation systems/stamper evaluation systems for evaluating Blu-ray disc production line and quality control purposes; checkers for inspecting Blu-ray discs; facilitators for use in the inspection of optical discs; and BCA writers that are used in Blu-ray disc production line. It serves clients in steel and non-ferrous metal, electric machinery and apparatus, car, precision instrument, chemical, and machine industries, as well as trading companies, university research institutions, and others. The company was founded in 1969 and is headquartered in Hamamatsu, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Hamamatsu"
    },
    "6905.T": {
        "short_name": "COSEL CO LTD",
        "long_name": "Cosel Co., Ltd.",
        "summary": "Cosel Co., Ltd. manufactures and sells electrical components and EMI filters in Japan and internationally. It offers AC-DC switching power supplies; DC-DC converters; and semiconductor devices, such as IC, FET, transistors, diodes, etc. for use in industrial and consumer equipment. The company was formerly known as Elco Co., Ltd. and changed its name to Cosel Co., Ltd. in April 1992. Cosel Co., Ltd. was founded in 1969 and is headquartered in Toyama, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Toyama"
    },
    "6912.T": {
        "short_name": "KIKUSUI ELECTRONICS",
        "long_name": "Kikusui Electronics Corporation",
        "summary": "Kikusui Electronics Corporation manufactures, imports, exports, and sells electronic test and measuring instruments, power supplies, and software products in Japan and internationally. Its principal products include DC and AC power supplies, electronic loads, telecommunication measuring instruments, withstanding voltage testers, insulation testers, earth continuity testers, leakage current testers, calibrators, and signal generators. The company also offers power supply controllers, electrical safety testers, EMC testers, harmonics and flicker testers, fuel cell impedance meters, battery and capacitor testers, and rack mount accessories, as well as custom-made systems. In addition, it imports and sells digital communication, microwave, and avionics measuring instruments. The company was formerly known as Kikusui Denpa and changed its name to Kikusui Electronics Corporation in 1962. The company was founded in 1951 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "6943.T": {
        "short_name": "NKK SWITCHES CO LTD",
        "long_name": "NKK Switches Co., Ltd.",
        "summary": "NKK Switches Co., Ltd. manufactures and sells miniature and illuminated industrial switches worldwide. It offers DIP, illuminated, keylock, membrane keypads, OLED and LCD programmable, pushbutton, rocker, rotary, slide, surface mount, tactile, tilt, toggle, and touch screen switches; switch guides; and accessories. The company was formerly known as Nihon Kaiheiki Ind. Co., Ltd. and changed its name to NKK Switches Co., Ltd. in April 2014. NKK Switches Co., Ltd. was founded in 1951 and is based in Kawasaki, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kawasaki"
    },
    "6946.T": {
        "short_name": "NIPPON AVIONICS CO",
        "long_name": "Nippon Avionics Co., Ltd.",
        "summary": "Nippon Avionics Co., Ltd. manufactures and sells micro joining equipment in Japan. The company's micro joining equipment include resistance, laser, and seam welders; ultrasonic equipment; and high-frequency induction heaters and pulse heat units, as well as joining monitors. It also provides infrared thermal imaging cameras and radiation hardened point of load DC/DC converters. The company was formerly known as Nippon Aviotronics Co., Ltd. and changed its name to Nippon Avionics Co., Ltd. in April 1980. The company was incorporated in 1960 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "6993.T": {
        "short_name": "Daikokuya Holdings Co Ltd",
        "long_name": "Daikokuya Holdings Co.,Ltd.",
        "summary": "Daikokuya Holdings Co.,Ltd. develops, manufactures, and sells industrial lighting fixtures and electrical circuit piping equipment primarily in Japan. The company offers explosion-proof, sealed anti-corrosion, and emergency and portable explosion-proof lighting fixtures, as well as hand lamps; control equipment, such as connectors; and various OEM electrical equipment for industrial use. It also provides explosion-proof type, closed, and waterproof electric circuit piping equipment, as well as pull boxes and waterproof flexible tubes, as well as purchases and sells used brand products, such as bags, watches, and jewelry; and pawn shops. The company was formerly known as Asia Growth Capital, Ltd. and changed its name to Daikokuya Holdings Co.,Ltd. in August 2016. Daikokuya Holdings Co.,Ltd. was founded in 1915 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6994.T": {
        "short_name": "SHIZUKI ELECTRIC CO INC",
        "long_name": "Shizuki Electric Company Inc.",
        "summary": "Shizuki Electric Company Inc. provides capacitors, and related equipment and facilities; and electrical machinery and equipment in Japan and internationally. It offers power factor correction products, harmonic filters, and voltage sag compensators; and AC and DC filter capacitors, and snubber capacitors for automotive inverters, power electronics circuits, and home appliances. The company was founded in 1939 and is based in Nishinomiya, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Nishinomiya"
    },
    "6NA.SG": {
        "short_name": "NIPPON AVIONICS CO. LTD. Regist",
        "long_name": "Nippon Avionics Co., Ltd.",
        "summary": "Nippon Avionics Co., Ltd. manufactures and sells micro joining equipment in Japan. The company's micro joining equipment include resistance, laser, and seam welders; ultrasonic equipment; and high-frequency induction heaters and pulse heat units, as well as joining monitors. It also provides infrared thermal imaging cameras and radiation hardened point of load DC/DC converters. The company was formerly known as Nippon Aviotronics Co., Ltd. and changed its name to Nippon Avionics Co., Ltd. in April 1980. The company was incorporated in 1960 and is headquartered in Yokohama, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "7480.T": {
        "short_name": "SUZUDEN CORP",
        "long_name": "Suzuden Corporation",
        "summary": "Suzuden Corporation distributes mechanical and electronic parts in Japan. The company trades in air cylinders, breakers, bridges, cables, conduit pipes, connectors, contactors, fans, input devices, lights and lamps, and magnets, as well as monitors, semiconductors, sensors, servomotors, single board computers, transducers, transformers, trimmers, UPS, valves, wires, and various other products. It also offers factory automation equipment and parts. The company was founded in 1948 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7567.T": {
        "short_name": "SAKAE ELECTRONICS CORP",
        "long_name": "Sakae Electronics Corporation",
        "summary": "Sakae Electronics Corporation engages in the trading of electronic parts. It offers digital ICs, analog ICs, diodes, transistors, thyristors, paristors, thermistors, liquid crystal displays, coils, chokes, resistors, capacitors, crystal oscillators, sensors, motors, printed circuit boards, fans, connectors, sockets, switches, keyboards, relays, noise filters, switching power supplies, uninterruptable power supplies, converters, and transformers. The company was founded in 1967 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7711.T": {
        "short_name": "SUKEGAWA ELECTRIC CO",
        "long_name": "Sukegawa Electric Co., Ltd.",
        "summary": "Sukegawa Electric Co., Ltd. manufactures and sells energy and industrial systems in Japan. It offers mineral insulated cables, including simple co-axial cables, double sheathed cables, tri-axial cables, banded-type, twisted cables, etc.; temperature sensors comprising thermocouples, resistance bulbs, sheathed wires, and heat flux sensors; micro heaters for general type industrial plants and various apparatuses for facilities related with vacuum components; and sheathed heaters that are used as the heat source for various devices. The company also provides a range of vacuum components, such as steping motors, aluminum alloy ultra vacuum chambers, vacuum systems, vacuum furnaces with carbon heater, hot plate with cold systems, and vacuum heat treating furnaces; and molten metal systems comprising electromagnetic pumps, Pb-Bi test loops, liquid level indicators, and electromagnetic flowmeters and pump type sand mold casting systems, as well as induction type level meters and control panels. In addition, it offers various apparatuses, fuel rods simulators, boiling water capsules, electromagnetic sensors, fuel cell gas heating units, fuel cell test facilities, and electromagnetic horns for use in the energy field. Sukegawa Electric Co., Ltd. was founded in 1949 and is headquartered in Takahagi, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Takahagi"
    },
    "7727.T": {
        "short_name": "OVAL CORP",
        "long_name": "OVAL Corporation",
        "summary": "OVAL Corporation manufactures and sells various flowmeters, metrological control equipment and related systems, measuring devices, and environmental control related instruments in Japan and internationally. Its flowmeters include positive displacement, coriolis, vortex, ultrasonic, electromagnetic, turbine, and thermal mass flowmeters, as well as controller flowmeters for energy saving; and electronic instruments comprise totalizers, batch counters, flow computers, SU series electronic instruments, and other electronic instruments. The company also provides peripherals and related instruments, such as strainers, air eliminators, flow-straighteners, pneumatic valve actuators, divertors, vent tanks, and other ancillary instruments, as well as flow calibration and other systems. OVAL Corporation was founded in 1949 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7931.T": {
        "short_name": "MIRAI INDUSTRY CO LTD",
        "long_name": "Mirai Industry Co.,Ltd.",
        "summary": "Mirai Industry Co.,Ltd. manufactures and sells electrical equipment materials in Japan. The company provides fire protection materials; tools; underground and protective pipes; CD, PF, and flexible tubes; resins; cable support insert; retractable covers; mall; vinyl conduit accessories; mounting plates; mirai panel; air conditioner piping materials; and duct, lighting, support bracket, and cable rack, as well as iron, slide, pool, wall, and electricity meter boxes. It also offers pipework equipment, such as fire protection materials; water supply remodeling and related accessories; drainage related; gas/kerosene remodeling and plumbing related; air-conditioning related, insert, and burial related; tool; resin pipe; scabbard and resin pipes; around the header; fittings; faucet box; bathroom parts; reheating; snow melting; heating; and others products. Mirai Industry Co.,Ltd. was founded in 1965 and is headquartered in Wanouchi, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Wanouchi"
    },
    "9857.T": {
        "short_name": "EIWA CORPORATION",
        "long_name": "Eiwa Corporation",
        "summary": "Eiwa Corporation operates as a trading company primarily in Japan. It offers industrial measuring instrumentation, such as pressure and level sensors, flow meters, thermometers, water analyzers, and other sensors; and electronic measuring instruments comprising data logging systems, signal converters, PLCs, touch panels, indicators, and recorders. The company also provides inspection and analytical equipment that include scales, gauges, testers, detectors, and test machines; and information communication systems, which comprise telemetering, wireless communication, network communication, and image processing systems. In addition, it offers industrial equipment, including hydraulic/pneumatic units, pumps, valves, and video scopes; and environment monitors, such as atmospheric air monitors, water analyzers, gas detectors, soil monitors, noise monitors, and vibration monitors. Further, the company provides industrial machinery comprising road maintenance machines, environment measuring units, waste treatment equipment, and power supply products; and fuel cells, including DMFC standard cells, PEFC test benches, and methanol concentration meters. It serves chemical and material, food and beverage, energy, machinery, and research and development companies, as well as government offices. The company was formerly known as Eiwa Seiko Co., Ltd. and changed its name to Eiwa Corporation in 1987. Eiwa Corporation was founded in 1947 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "9934.T": {
        "short_name": "INABA DENKISANGYO CO",
        "long_name": "Inaba Denki Sangyo Co.,Ltd.",
        "summary": "Inaba Denki Sangyo Co.,Ltd. provides electrical equipment and materials, industrial solutions, and proprietary products in Japan. The company supplies a range of products, including light fittings, air conditioning systems, distribution panels, and other electric equipment; and power sockets, wiring accessories, and other electrical materials for various types of houses, office buildings, and public facilities. It also sells environment-friendly products, such as solar photovoltaic systems and LED light fittings; and plans and sells JAPPY brand products. In addition, the company offers sensors, switches, relays, and other control units; and combinations of LCD devices, connectors, condensers, and other electrical components. Further, it develops pipe covers, insulated copper tubes, and other products for use with air conditioners under the INABA DENKO brand; multimedia-compatible wiring systems for newly-built digital age residences under the ABANIACT brand; and provides LED status indicating lights, sound alarms, visual, and audible communication network system and solutions under the PATLITE brand. Inaba Denki Sangyo Co.,Ltd. was founded in 1938 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "FELTY": {
        "short_name": "FUJI ELECTRIC CO. LTD.",
        "long_name": "Fuji Electric Co., Ltd.",
        "summary": "Fuji Electric Co., Ltd., together with its subsidiaries, operates in the power electronics systems, power and new energy, electronic devices, and food and beverage distribution businesses worldwide. It offers AC drives, motors, and servo systems; semiconductors, photoconductors, and storage devices; uninterruptible power systems, solar inverters, data centers, rectifiers, and formers; instrumentation products and sensors, and radiation monitoring systems; factory automation Systems; and LV and MV distributions, motor controls, and energy control equipment. The company also provides oil-immersed transformers, shunt reactors, cast resin transformers, gas insulated switchgears, MV and LV switchgears and control centers, vacuum circuit breakers, and pure water vaporization cooling silicon rectifiers; tunnel ventilation systems, marine environment protection systems, and electrical equipment for railcars; thermal, geothermal, nuclear, and fuel cell power generation equipment and plants; power system simulators; system solutions; and service solutions and after sales services, as well as upgrade services for equipment. In addition, it offers multipurpose vending machines, can vending machines, coin mechanisms, and bill validators. The company was formerly known as Fuji Electric Holdings Co., Ltd. and changed its name to Fuji Electric Co., Ltd. in 2011. Fuji Electric Co., Ltd. was founded in 1923 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "FJE.F": {
        "short_name": "FUJI ELECTRIC CO. LTD.",
        "long_name": "Fuji Electric Co., Ltd.",
        "summary": "Fuji Electric Co., Ltd., together with its subsidiaries, operates in the power electronics systems, power and new energy, electronic devices, and food and beverage distribution businesses worldwide. It offers AC drives, motors, and servo systems; semiconductors, photoconductors, and storage devices; uninterruptible power systems, solar inverters, data centers, rectifiers, and formers; instrumentation products and sensors, and radiation monitoring systems; factory automation Systems; and LV and MV distributions, motor controls, and energy control equipment. The company also provides oil-immersed transformers, shunt reactors, cast resin transformers, gas insulated switchgears, MV and LV switchgears and control centers, vacuum circuit breakers, and pure water vaporization cooling silicon rectifiers; tunnel ventilation systems, marine environment protection systems, and electrical equipment for railcars; thermal, geothermal, nuclear, and fuel cell power generation equipment and plants; power system simulators; system solutions; and service solutions and after sales services, as well as upgrade services for equipment. In addition, it offers multipurpose vending machines, can vending machines, coin mechanisms, and bill validators. The company was formerly known as Fuji Electric Holdings Co., Ltd. and changed its name to Fuji Electric Co., Ltd. in 2011. Fuji Electric Co., Ltd. was founded in 1923 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "FJK.F": {
        "short_name": "FUJIKURA LTD",
        "long_name": "Fujikura Ltd.",
        "summary": "Fujikura Ltd. researches, develops, manufactures, and sells wires and cables in Japan, the United States, China, and internationally. The company operates in four segments: Power & Telecommunication Systems Company, Electronics Business Company, Automotive Products Company, and Real Estate Business Company. It offers power and telecommunication systems products, including twisted pair cables, coaxial cables, eco cables, conductors, OHTL and power cables, magnet wires, energy harvesting products, optical fibers/fiber cables, splicers and others, optical components, optical connectors/connected parts, specialty fibers, optical applied products, optical camera link cable assemblies, and fiber lasers. The company also offers electronics products, such as sensors, electrical components, electronic wires, thermal products, and connectors; automotive components, automotive wires, wire harnesses, relay connectors, main fuse and joint boxes, and other products; and superconductors, medical devices, and wireless communications modules. In addition, it develops a complex facility to combine businesses, shopping, and amenities; leases offices; and provides real estate brokerage, professional lessons, golf school, and event services. Fujikura Ltd. was founded in 1885 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "FKA.F": {
        "short_name": "FURUKAWA ELECTRIC CO.LTD.",
        "long_name": "Furukawa Electric Co., Ltd.",
        "summary": "Furukawa Electric Co., Ltd. manufactures and sells telecommunications, energy, automobile, electronic parts, and construction products worldwide. It operates through Infrastructure, Automotive Products & Materials, Functional Products, and Service and Developments segments. The company offers telecommunications products, such as broadband systems, routers/network equipment, and wireless products; and optical fiber cables and identifiers, optical closures/termination boxes, optical connectors/cords, fusion splicers/optical connecting tools, optical fiber line monitoring/management systems, optical component/devices, and metal communication cables, as well as wiring materials. It also offers energy products, including power cables, cable-related equipment/connection and terminal products, industrial machine-related equipment, fire-prevention products, electrical conductors, power distribution products, and cable conduit materials; and automobile products comprising wire harnesses, connectors, functional products and materials, and interior finishing materials. In addition, the company provides electronics parts materials, fluorescent lamps, and LED reflectors, as well as healthcare products, such as polyimide tubes and shape memory/super-elastic alloys; construction products, including water distribution piping and fluid transport piping products, heat insulators, and cable-related equipment/connection and terminal products; and superconducting cables, industrial lasers, single cell hunters, flow cytometers, and fluorescent silica nanoparticles. Furukawa Electric Co., Ltd. was founded in 1884 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "FUWAY": {
        "short_name": "FURUKAWA ELECTRIC CO",
        "long_name": "Furukawa Electric Co., Ltd.",
        "summary": "Furukawa Electric Co., Ltd. manufactures and sells telecommunications, energy, automobile, electronic parts, and construction products worldwide. It operates through Infrastructure, Automotive Products & Materials, Functional Products, and Service and Developments segments. The company offers telecommunications products, such as broadband systems, routers/network equipment, and wireless products; and optical fiber cables and identifiers, optical closures/termination boxes, optical connectors/cords, fusion splicers/optical connecting tools, optical fiber line monitoring/management systems, optical component/devices, and metal communication cables, as well as wiring materials. It also offers energy products, including power cables, cable-related equipment/connection and terminal products, industrial machine-related equipment, fire-prevention products, electrical conductors, power distribution products, and cable conduit materials; and automobile products comprising wire harnesses, connectors, functional products and materials, and interior finishing materials. In addition, the company provides electronics parts materials, fluorescent lamps, and LED reflectors, as well as healthcare products, such as polyimide tubes and shape memory/super-elastic alloys; construction products, including water distribution piping and fluid transport piping products, heat insulators, and cable-related equipment/connection and terminal products; and superconducting cables, industrial lasers, single cell hunters, flow cytometers, and fluorescent silica nanoparticles. Furukawa Electric Co., Ltd. was founded in 1884 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "G9Y.F": {
        "short_name": "GS YUASA CORP.",
        "long_name": "GS Yuasa Corporation",
        "summary": "GS Yuasa Corporation manufactures and sells batteries, power supply systems, lighting equipment, and membrane systems in Japan, the rest of Asia, North America, Europe, and internationally. The company operates through Automotive Batteries (Japan), Automotive Batteries (Overseas), Industrial Batteries and Power Supplies, and Automotive Lithium-ion Batteries segments. It offers automotive and motorcycle lead-acid batteries; automotive lithium-ion batteries for electric vehicles, hybrid electric vehicles, and plug-in hybrid electric vehicles; batteries for industrial use; power supply systems; and lithium-ion batteries for manned research submersibles, satellites, rockets, and industrial use. The company was founded in 2004 and is headquartered in Kyoto, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Kyoto"
    },
    "GYUAF": {
        "short_name": "GS YUASA CORP",
        "long_name": "GS Yuasa Corporation",
        "summary": "GS Yuasa Corporation manufactures and sells batteries, power supply systems, lighting equipment, and membrane systems in Japan, the rest of Asia, North America, Europe, and internationally. The company operates through Automotive Batteries (Japan), Automotive Batteries (Overseas), Industrial Batteries and Power Supplies, and Automotive Lithium-ion Batteries segments. It offers automotive and motorcycle lead-acid batteries; automotive lithium-ion batteries for electric vehicles, hybrid electric vehicles, and plug-in hybrid electric vehicles; batteries for industrial use; power supply systems; and lithium-ion batteries for manned research submersibles, satellites, rockets, and industrial use. The company was founded in 2004 and is headquartered in Kyoto, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Kyoto"
    },
    "HOD.F": {
        "short_name": "HOSIDEN CORP.",
        "long_name": "Hosiden Corporation",
        "summary": "Hosiden Corporation manufactures and sells electronics, electrical appliances, auto parts, information telecommunications equipment, office machines, and medical equipment and related parts in Japan and internationally. It offers connectors, switches, and remote-control units; acoustic components comprising speakers, receivers, microphones, headphones, and earphones; and wireless modules consisting of Bluetooth and Bluetooth low energy modules. The company also provides other products, such as AC adapters, wireless chargers, circuit protectors, touch sensors, and A2B compatible acceleration sensors. Its products are used in mobiles, automobiles, audio and visual products, and home electronics. Hosiden Corporation was founded in 1947 and is headquartered in Yao, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Yao"
    },
    "MIELF": {
        "short_name": "MITSUBISHI ELECTRIC CORP",
        "long_name": "Mitsubishi Electric Corporation",
        "summary": "Mitsubishi Electric Corporation develops, manufactures, distributes, and sells electrical and electronic equipment worldwide. The company offers turbine generators, hydraulic turbine generators, nuclear power plant and power electronics equipment, motors, transformers, circuit breakers, gas insulated switchgears, switch controls, display devices, surveillance-system control and security systems, transmission and distribution ICT systems, large display devices, locomotive and rolling stock electrical equipment, elevators, escalators, building security and management systems, and others. It also provides programmable logic controllers, inverters, servomotors, human-machine interfaces, hoists, magnetic switches, circuit breakers, time and power meters, uninterruptible power supply, industrial fans, computerized numerical controllers, electrical-discharge and laser processing machines, industrial robots, clutches, automotive electrical equipment, car electronics and mechatronics, car multimedia, and others. In addition, the company offers wireless and wired communications systems, network camera systems, satellite communications and radar equipment, satellites, antennas, missile and fire control systems, broadcasting and information systems equipment, data transmission devices, network security systems, systems integration products, and others; and power modules, high-frequency devices, optical and LCD devices, and others. Further, it provides air conditioners, chillers, showcases, compressors, refrigeration units, air-to-water heat pump boilers, ventilators, hot water supply systems, IH cooking heaters, LED lamps, indoor lighting, LCD televisions, refrigerators, electric fans, dehumidifiers, air purifiers, cleaners, jar rice cookers, microwave ovens, and others. Additionally, the company offers procurement, logistics, real estate, advertising, finance, and other services. Mitsubishi Electric Corporation was founded in 1921 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "MIELY": {
        "short_name": "MITSUBISHI ELECTRIC CORP",
        "long_name": "Mitsubishi Electric Corporation",
        "summary": "Mitsubishi Electric Corporation develops, manufactures, distributes, and sells electrical and electronic equipment worldwide. The company offers turbine generators, hydraulic turbine generators, nuclear power plant and power electronics equipment, motors, transformers, circuit breakers, gas insulated switchgears, switch controls, display devices, surveillance-system control and security systems, transmission and distribution ICT systems, large display devices, locomotive and rolling stock electrical equipment, elevators, escalators, building security and management systems, and others. It also provides programmable logic controllers, inverters, servomotors, human-machine interfaces, hoists, magnetic switches, circuit breakers, time and power meters, uninterruptible power supply, industrial fans, computerized numerical controllers, electrical-discharge and laser processing machines, industrial robots, clutches, automotive electrical equipment, car electronics and mechatronics, car multimedia, and others. In addition, the company offers wireless and wired communications systems, network camera systems, satellite communications and radar equipment, satellites, antennas, missile and fire control systems, broadcasting and information systems equipment, data transmission devices, network security systems, systems integration products, and others; and power modules, high-frequency devices, optical and LCD devices, and others. Further, it provides air conditioners, chillers, showcases, compressors, refrigeration units, air-to-water heat pump boilers, ventilators, hot water supply systems, IH cooking heaters, LED lamps, indoor lighting, LCD televisions, refrigerators, electric fans, dehumidifiers, air purifiers, cleaners, jar rice cookers, microwave ovens, and others. Additionally, the company offers procurement, logistics, real estate, advertising, finance, and other services. Mitsubishi Electric Corporation was founded in 1921 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "NCZ.MU": {
        "short_name": "NIPPON CHEMI-CON",
        "long_name": "Nippon Chemi-Con Corporation",
        "summary": "Nippon Chemi-Con Corporation manufactures and sells aluminum and other capacitors, precision mechanical components, and electronics equipment in Japan, China, the United States, Europe, and internationally. The company offers aluminum electrolytic capacitors, conductive polymer aluminum solid capacitors, and conductive polymer hybrid aluminum electrolytic capacitors. It also provides multilayer ceramic capacitors, film capacitors, metal oxide varistors TNR, nanocrystalline/amorphous/dust choke coils, electric double layer capacitors, and camera modules, as well as manufactures and distributes silicon wafers and wafer related products. The company was formerly known as Nippon Chemical Capacitor Inc. and changed its name to Nippon Chemi-Con Corporation in July 1981. Nippon Chemi-Con Corporation was founded in 1931 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "T9T.F": {
        "short_name": "TOYO TANSO CO. LTD",
        "long_name": "Toyo Tanso Co., Ltd.",
        "summary": "Toyo Tanso Co., Ltd. produces and sells various carbon products in Japan and internationally. The company provides isotropic graphite products for use in semi-conductor, mold, renewable energy, and atomic power industries; carbon-carbon composite materials for use in general industries, as well as in technological fields, such as aerospace and semiconductor manufacture; and PERMA-FOIL, a flexible graphite sheet that is used as a seal to note automotive gaskets and packing. It also offers mechanical carbon for sliding parts in high temperature environments, for submersion in chemicals, and in fields where lubricated parts cannot be used, as well as copper-impregnated carbon materials for a pantograph slider; carbon brushes for home appliances and power tools; PERMA KOTE, a SiC coated graphite for use in the semiconductor manufacturing industry; PYROGRAPH, a high purity graphite product; and GLASTIX KOTE, a graphite substrate impregnated or coated with glass-like carbon. In addition, the company provides CNovel, a porous carbon; EVEREDKOTE-B, a high-purity isotropic graphite substrate; TaC/Ta Composite EVEREDKOTE-K, a high-purity tantalum; KLASTA MATE, a metalÂ\u0096carbon composite; MetalizeKote metal carbide-coated graphite; and CARBOCELL, a ceramic composite. Further, it offers technical services, such as machining, heat treatment, high purity treatment, surface treatment, impregnation, forming, and measurement. The company was formerly known as Kondo Carbon Manufacturing Co., Ltd. and changed its name to Toyo Tanso Co., Ltd. in November 1949. Toyo Tanso Co., Ltd. was founded in 1941 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "YASKF": {
        "short_name": "YASKAWA ELECTRIC CORP",
        "long_name": "YASKAWA Electric Corporation",
        "summary": "YASKAWA Electric Corporation engages in motion control, robotics, system engineering, and other businesses worldwide. It manufactures and sells various AC drives, including general purpose AC drives, medium-voltage AC drives, system-use AC drives, and power regenerative units for use in cranes, fans, pumps, machine tools, conveyors, automated warehouses, and metal working machinery; and rotary servo motors, direct drive servo motors, linear servo motors, machine controllers, and machine vision systems that are used in chip mounters, robots, and metal working machinery. The company also offers arc and spot welding, handling/assembling, collaborative, biomedical, palletizing, press handling, sealing/cutting/laser machining, deburring, painting, glass substrates transfer, and semiconductor wafer transfer robots for use in semiconductor/liquid crystal manufacturing, arc welding, spot welding, palletizing, painting, and handling and assembly applications. In addition, it provides industrial system electrical products, such as medium-voltage AC drives, system use AC drives, and system controllers for use in iron and steel systems, water and wastewater treatment, and paper-making/film/port cargo handling/fiber/printing applications. Further, the company offers equipment for energy saving and creation comprising PV inverters, systems for large wind turbines, control equipment for small-scale power generation, and motor drive systems for use in photovoltaic power generation and electric vehicles. YASKAWA Electric Corporation was founded in 1915 and is headquartered in Kitakyushu, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Kitakyushu"
    },
    "YASKY": {
        "short_name": "YASKAWA ELECTRIC CORP",
        "long_name": "YASKAWA Electric Corporation",
        "summary": "YASKAWA Electric Corporation engages in motion control, robotics, system engineering, and other businesses worldwide. It manufactures and sells various AC drives, including general purpose AC drives, medium-voltage AC drives, system-use AC drives, and power regenerative units for use in cranes, fans, pumps, machine tools, conveyors, automated warehouses, and metal working machinery; and rotary servo motors, direct drive servo motors, linear servo motors, machine controllers, and machine vision systems that are used in chip mounters, robots, and metal working machinery. The company also offers arc and spot welding, handling/assembling, collaborative, biomedical, palletizing, press handling, sealing/cutting/laser machining, deburring, painting, glass substrates transfer, and semiconductor wafer transfer robots for use in semiconductor/liquid crystal manufacturing, arc welding, spot welding, palletizing, painting, and handling and assembly applications. In addition, it provides industrial system electrical products, such as medium-voltage AC drives, system use AC drives, and system controllers for use in iron and steel systems, water and wastewater treatment, and paper-making/film/port cargo handling/fiber/printing applications. Further, the company offers equipment for energy saving and creation comprising PV inverters, systems for large wind turbines, control equipment for small-scale power generation, and motor drive systems for use in photovoltaic power generation and electric vehicles. YASKAWA Electric Corporation was founded in 1915 and is headquartered in Kitakyushu, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Kitakyushu"
    },
    "YEC.F": {
        "short_name": "YASKAWA EL. CORP.",
        "long_name": "YASKAWA Electric Corporation",
        "summary": "YASKAWA Electric Corporation engages in motion control, robotics, system engineering, and other businesses worldwide. It manufactures and sells various AC drives, including general purpose AC drives, medium-voltage AC drives, system-use AC drives, and power regenerative units for use in cranes, fans, pumps, machine tools, conveyors, automated warehouses, and metal working machinery; and rotary servo motors, direct drive servo motors, linear servo motors, machine controllers, and machine vision systems that are used in chip mounters, robots, and metal working machinery. The company also offers arc and spot welding, handling/assembling, collaborative, biomedical, palletizing, press handling, sealing/cutting/laser machining, deburring, painting, glass substrates transfer, and semiconductor wafer transfer robots for use in semiconductor/liquid crystal manufacturing, arc welding, spot welding, palletizing, painting, and handling and assembly applications. In addition, it provides industrial system electrical products, such as medium-voltage AC drives, system use AC drives, and system controllers for use in iron and steel systems, water and wastewater treatment, and paper-making/film/port cargo handling/fiber/printing applications. Further, the company offers equipment for energy saving and creation comprising PV inverters, systems for large wind turbines, control equipment for small-scale power generation, and motor drive systems for use in photovoltaic power generation and electric vehicles. YASKAWA Electric Corporation was founded in 1915 and is headquartered in Kitakyushu, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Kitakyushu"
    }
}