{
    "2715.T": {
        "short_name": "ELEMATEC CORPORATION",
        "long_name": "Elematec Corporation",
        "summary": "Elematec Corporation supplies electronic parts, materials, and modules for manufacturers of electronic products in Japan and internationally. It offers a range of products that are applied in various electronic products, such as smartphone camera modules, cameras, household electric appliances, video equipment, semiconductors, OA equipment, super computers, health care equipment, automotive equipment, construction equipment, housing equipment, industrial equipment, medical equipment, infrastructure and energy equipment, and toys and hobbies. The company also distributes other products, such as adhesives, tapes, and peltiers. In addition, it offers procurement agency services; processing services comprising screen printing, cutting, and assembling; planning and development services; and quality and environmental services, including inspection of environmentally hazardous substances, identifying and analyzing defects, and quality follow-up services. The company was founded in 1947 and is headquartered in Tokyo, Japan. Elematec Corporation is a subsidiary of Toyota Tsusho Corporation.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3020.T": {
        "short_name": "APPLIED CO.LTD",
        "long_name": "Applied Co.,Ltd.",
        "summary": "Applied Co.,Ltd. sells personal computers, peripheral equipment, and digital products in Japan. It is also involved in the planning, development, manufacture, sale, and wholesale of private brand PCs and digital products. The company also engages in the procurement, advertising, and sale of products of other manufacturers. In addition, it provides network system construction and maintenance, and remote services. The company was founded in 1977 and is headquartered in Fukuoka City, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Fukuoka City"
    },
    "3131.T": {
        "short_name": "SHINDEN HIGHTEX CORPORATION",
        "long_name": "Shinden Hightex Corporation",
        "summary": "Shinden Hightex Corporation sells various electronic components primarily in Japan. The company manufactures ICs and liquid crystal displays; electronic component printed circuit board packaging, BGA/CSP re-work/re-ball, and outsourcing; flash storage and DRAM modules; graphics cards; and hardware and software products comprising cellular communication modules and the global navigation satellite system products. It also provides CF cards and SSD products; e-mail security software; directional speakers; defense against pirate, bird deterrent devices, industrial warning surveillance, tunnel safety, and pedestrian safety products; Gateways, modules for LoRa, LTE-M1, and private LTE; automotive connectivity modules for cellular and V2X communication; server and data centers; and Li-ion batteries. In addition, the company offers semiconductor components, such as memory products; accelerated processing units and GPUs; LCD controllers, MCUs for remote controllers, power supply MCUs, ARM CPU-based 32bit MCUs, and segment driver ICs; ARM core SoC; ASICs; CMOS image sensor and flat panel display driver products; LEDs, wireless modules, touch windows, and PCBs; foundry products and services; semiconductor packaging and test solutions; bumping services; memory controllers; and speakers/receivers/vibration motors/actuators for automobile. The company was founded in 1995 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3375.T": {
        "short_name": "ZOA CORPORATION",
        "long_name": "Zoa Corporation",
        "summary": "Zoa Corporation engages in the retail sale of computer and related equipment, motorcycle supplies, etc. It also provides various support, iPhone repair, personal computer repair Web reception, and smartphone data recovery services. The company was founded in 1984 and is headquartered in Numazu, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Numazu"
    },
    "4420.T": {
        "short_name": "ESOL CO LTD",
        "long_name": "eSOL Co.,Ltd.",
        "summary": "eSOL Co.,Ltd. designs, plans, operates, and maintains embedded software solutions and logistics systems in Japan. The company offers real-time operating systems(RTOS) that include Extended T-Kernel, RTOS for embedded systems; POSIX, a compliant RTOS that provides support for pthread, signal, and inter process communication on the system level; process model-based RTOS with memory protection; compact RTOS with small footprint; and RTOS for multi-core processors, as well as software development kit for many-core processors. It also provides eBinder, a development suite for embedded software; FAT12/16/32, VFAT, and exFAT-compatible file systems for embedded systems; software platforms; and evaluation kits. In addition, the company offers application middleware, including graphical user interface (GUI), computer vision, and embedded database solutions; automotive software, such as AUBIST classic and adaptive platforms, and ECU diagnostics and reprogramming. Further, it develops and sells devices primarily focused on portable terminals, automotive printers, and sensor device products; and software systems to solve diversifying issues on the ground. The company was formerly known as ERG Co., Ltd. and changed its name to eSOL Co.,Ltd. in May 2001. eSOL Co.,Ltd. was founded in 1975 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "4768.T": {
        "short_name": "OTSUKA CORPORATION",
        "long_name": "Otsuka Corporation",
        "summary": "Otsuka Corporation provides system integration, support, and other services in Japan. The company operates through two segments, System Integration Business, and Service and Support Business. The System Integration Business segment offers system services ranging from consulting, system design and development, transport and installation work, and network construction. It also provides management systems and collaborative software to cover a range of specialized fields, including CAD and web technologies; and software, hardware, intranet, and security products for the construction and expansion of computer networks. In addition, this segment sells computers, copiers, and communications equipment and software; and develops consigned software. The Service and Support Business segment offers supplies, hardware and software maintenance, telephone support, and outsourcing services; emergency computer rescue services for corporate and individual clients; and network support and services for the planning, design, construction, and operation of corporate information systems, as well as out-sources system engineers. It also provides educational support services. The company was incorporated in 1961 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6638.T": {
        "short_name": "MIMAKI ENGINEERING CO.LTD",
        "long_name": "Mimaki Engineering Co., Ltd.",
        "summary": "Mimaki Engineering Co., Ltd. develops, manufactures, and sells computer devices and software in Japan and internationally. It offers inkjet printers, including roll to roll, print and cut, flat bed, hybrid, textile, and option printers; cutting plotters, such as roll to roll, flat bed, and apparel cutter plotters; laminators; desktop modeling plotters; and 3D printers. The company also provides software products comprising RIP software; software for color management; software products for cutting that consist of FineCut9, FineCut8, Simple POP, Simple Cut, and Simple Studio; and ArtiosCAD designer solution used in designing packages. Its products are used in smartphone case, glass, acrylic, sticker, magnet, stationery, novelty, apparel and textile, bottle, window film, and other items. The company was founded in 1975 and is headquartered in Tomi, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tomi"
    },
    "7513.T": {
        "short_name": "KOJIMA CO LTD",
        "long_name": "Kojima Co.,Ltd.",
        "summary": "Kojima Co., Ltd. sells and repairs/ constructs household and electric appliances. The company was formerly known as Kojima Denki K.K. and changed its name to Kojima Co., Ltd. in January 1993. The company was founded in 1963 and is headquartered in Utsunomiya, Japan. Kojima Co., Ltd. is a subsidiary of Bic Camera Inc.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Utsunomiya"
    },
    "7537.T": {
        "short_name": "MARUBUN CORP",
        "long_name": "Marubun Corporation",
        "summary": "Marubun Corporation distributes electronics products in Japan and internationally. The company offers semiconductors and electronic devices, including memory and special use ICs, solar panels, micro-processors, connectors, ASICs, and displays, as well as standard logic, analog, software, discrete, and other devices. It also provides industrial manufacturing equipment comprising industrial robots, IC test handlers, embedded computers, plasma nano-processing equipment, and nanoimprint equipment; industrial inspection equipment comprising IC lead inspection systems, X-ray inspection systems, and reflow simulation equipment; and network and optical communication products that include network time servers, frequency standard products, and components for optical communication. In addition, the company offers lasers and optoelectronics, such as laser oscillators, laser diodes, laser processing systems, optical components, laser measurement equipment, lamps and optics, and laser sensors; measurement and sensor products, including acoustic and vibration measurement, and radio frequency measurement products, as well as partial discharge monitoring products for generators and motors; and aerospace and defense products, which include space equipment, geophysical equipment, microwave components, and simulator equipment. Marubun Corporation has a strategic collaboration with Ossia Inc. to bring Cota real wireless power technology to the Japanese market. Marubun Corporation was founded in 1844 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7565.T": {
        "short_name": "MANSEI  CORP",
        "long_name": "Mansei Corporation",
        "summary": "Mansei Corporation provides electric powered machines in Japan. The company engages in the provision of support services for the development and maintenance of electronic devices and multimedia systems; and sale of video and information machines. It also offers semiconductor products, including high-density memory, one-chip microcomputers, gate arrays, ASICs, etc.; and software for system design and development. In addition, the company provides computers for FA, flexible production systems, related control units, CAD/CAM systems NC, robots for industrial use, etc.; and various total systems, as well as operates a training school. Further, it offers industrial components and equipment, which include drive control units, such as AC servos and inverters; controllers comprising sequencers; power distribution units consisting of circuit breakers and transformers; and rotary machines, including motors and industrial fans. Additionally, the company provides industrial automation machinery; various transport machines, such as elevators and escalators for buildings, condominiums, and public facilities; and equipment for shops, as well as housing related products. The company was founded in 1947 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "7619.T": {
        "short_name": "TANAKA CO LTD",
        "long_name": "Tanaka Co.,Ltd.",
        "summary": "Tanaka Co.,Ltd. engages in the wholesale of electrical materials and appliances in Japan. It offers fluorescent and incandescent light fixtures, HID fixtures, explosion-proof fixtures, ventilation and duct fans, and LED fixtures; and high and low voltage power cables, communication cables, insulation cables, synthetic rubber wires, steel conduits, vinyl chloride pipes, synthetic resin flexible conduits, and various accessories. The company also provides high voltage power receiving equipment, power distribution boards, control equipment, wiring equipment, electric circuit equipment, communication equipment, disaster prevention equipment, and sound equipment. In addition, it offers home appliances, housing equipment, OA equipment, and solar power generation equipment; and concrete columns, steel pipe poles, wire materials, measuring equipment, power tools, security equipment, etc. The company was founded in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8020.T": {
        "short_name": "KANEMATSU CORP",
        "long_name": "Kanematsu Corporation",
        "summary": "Kanematsu Corporation trades in commercial products worldwide. The company's Electronics & Devices segment offers electronic parts and components, semiconductor and LCD manufacturing equipment, materials and indirect materials, and development and proposal services; and deals with mobile communication terminals, mobile internet systems, information and telecommunication equipment, and security equipment and services. Its Foods & Grain segment provides cooked foods, processed fruits and agricultural products, beverage ingredients, animal and fishery products, wheat, rice, soybeans, feedstuff, and pet foods. The company's Steel, Materials & Plant segment trades in general steel products, crude oil, petroleum products, LPG, functional chemicals and food products, pharmaceuticals and pharmaceutical intermediates, and other products; undertakes plant and infrastructure development projects; and sells machine tools and industrial machinery, as well as operates in environmental and emissions rights business. Its Motor Vehicles & Aerospace segment primarily trades in aircrafts, helicopters, satellite and aerospace-related products, automobiles, motorcycles, industrial vehicles and related parts, construction machinery, etc. The company also develops software; and provides computers and computer peripherals, security cameras, mobile contents delivery and solutions, control modules for lithium ion batteries, home-construction materials, feeds and fertilizers, millet, grain, processed and health foods, oil well-related parts, defense products, general-purpose machinery, hay and roughage products, merchandise, and aircraft rotable components. In addition, it offers ground inspection and improvement, technical, cold storage, medical information, insurance agency, logistics, freight forwarding, and seed development and contract farming services. Kanematsu Corporation was founded in 1889 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8023.T": {
        "short_name": "DAIKO DENSHI TSUSHIN CO",
        "long_name": "Daiko Denshi Tsushin, Ltd.",
        "summary": "Daiko Denshi Tsushin, Ltd. provides information technology solutions in Japan. It offers rBOM, a production management system for the manufacturing industry; PROCURESUITE, an indirect materials procurement support system; EdiGate/POST, a cloud-type WEB-EDI service; RetailFocus, an inventory management system for specialty stores; IOT/IOW; AppGuard, a security solution; i-Compass, a cloud-based information distribution solution; and D's Mobile, a mobile leased line service solution, as well as fishing cooperative economic systems. The company was founded in 1953 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8093.T": {
        "short_name": "KYOKUTO BOEKI KAISHA",
        "long_name": "Kyokuto Boeki Kaisha, Ltd.",
        "summary": "Kyokuto Boeki Kaisha, Ltd., a technology-oriented trading firm, trades in basic industry products, electronic and control systems, and industrial materials in Japan and internationally. It offers electric instrumentation control systems and permanent-magnetic couplings to steel, non-ferrous metal, chemical, automotive, electronics, and electrical power industries; and equipment and technical services for the exploration, drilling, finishing, and production of natural resources, such as oil, natural gas, and geothermal energy, as well as develops carbon dioxide capture and storage, and methane hydrate. The company also provides mechanical parts, such as screws, springs, and spiral springs; aerospace equipment, laser equipment, and 3D scanning systems, and simulation systems and software packages with engineering and other services; and power operational amplifiers, linear ICs, electrostatic accelerators, thermal conductivity meters/dilatometers, seismometers, strain gauges, and telecommunication products, as well as various other advanced-technology products. In addition, it offers paints, plastics, metals, and related equipment primarily for automotive industry, as well as exports materials to China, Southeast Asia, and other countries; high-performance/intensity steel belts and belt equipment; advanced materials and fabrication technologies to conserve valuable resources; and food processing machinery for manufacturing ham and sausage, as well as deodorant roll towels to support food safety and environment. The company was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8137.T": {
        "short_name": "SUN-WA TECHNOS CORP",
        "long_name": "Sun-Wa Technos Corporation",
        "summary": "Sun-Wa Technos Corporation engages in the distribution of electrical machinery, electronics, and general machinery in Japan, rest of Asia, Europe, the United States, and internationally. The company offers AC servo, linear, and various other motors; clean room robots and vacuum chamber robots for semiconductor manufacturing devices; inverters, power substations, other facility works, etc.; and factory automation (FA) equipment and systems, such as machine controllers and vision systems, power conditioners and supply devices, and electrical engineering works. It also sells power supplies, connectors, semiconductors, sensors, miniature fans, liquid crystal displays, touch panels, industrial PCs, CPU boards, memory modules, etc.; assembled boards; and optical components, including light emitting diodes, electronics components, office automation (OA) related equipment, FA systems, and telecommunications and information equipment, as well as electric components and traffic control systems for railroad trains. In addition, the company offers general machinery products, such as industrial robots, clean room robots, semiconductor and liquid crystal related manufacturing equipment, conveying devices and facilities for logistics, substrate mounting devices, various inspection devices, environmental related equipment and devices, air conditioners and kitchen facilities, wind- and hydro-power equipment, and nursing care and medical equipment, as well as maintenance services. Its products are used in various fields, such as Internet of Things, food, and pharmaceutical industries. The company was formerly known as Yamada Kogyo Corporation and changed its name to Sun-Wa Technos Corporation in April 1993. Sun-Wa Technos Corporation was founded in 1949 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8140.T": {
        "short_name": "RYOSAN CO LTD",
        "long_name": "Ryosan Company, Limited",
        "summary": "Ryosan Company, Limited, an electronics trading company, engages in the sale of semiconductors, and electronic components and equipment in Japan and internationally. It sells semiconductor products, including microcontrollers, analog and power devices, compound devices, system LSIs, DRAM, and other products; and electronic components, such as display devices, power supplies, and electromechanical components comprising LCDs, power supplies/batteries, passive components, sensors, electronic circuit boards, and others. The company also offers electronic equipment products comprising servers, industrial computers, and PCs; embedded systems; and sputtering devices, as well as laser machining, etching, CVD, deposition, vacuum drying, and various second-hand equipment to customers manufacturing semiconductors, electronic components, and lithium-ion batteries. In addition, it provides consigned processing services to customers in selling various target materials, EMIs for smartphone and tablet devices, thermal solutions, and water-resistant products; and various solutions. Ryosan Company, Limited was incorporated in 1949 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8141.T": {
        "short_name": "SHINKO SHOJI CO",
        "long_name": "Shinko Shoji Co., Ltd.",
        "summary": "Shinko Shoji Co., Ltd. deals in electric motors and transformers in Japan and internationally. It operates through Electronic Components Business, Assembly Business, and Other Business segments. The company offers electronic components, including integrated circuits, semiconductor chips, circuit components, LCD products, and other electronic parts, as well as assembly products. It also develops embedded software products; and undertakes ASIC/FPGA design and development projects on a contract basis, as well as offers AIplay, an aerial image manipulation device. In addition, the company provides EMS and device solutions; embedded and Internet of things solutions; and parts and systems for the amusement industry. The company was founded in 1953 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8154.T": {
        "short_name": "KAGA ELECTRONICS CO",
        "long_name": "Kaga Electronics Co.,Ltd.",
        "summary": "Kaga Electronics Co., Ltd. sells electronics parts, semiconductors, PCs, and peripherals in Japan, North America, Europe, and Asia. It offers semiconductors, generic electronic parts, LEDs, sensors, and liquid crystal panels; amusement machines and software; and PCs and PC peripherals to electronics mass retailers, schools, and educational institutions, as well as electronics design manufacturing services. The company also provides communication, information processing and industrial equipment, application boards, embedded software of microcomputers, application integrated circuits, safety and earth leakage breakers/DC switches/in-vehicle electric products, and cell packs. In addition, it produces commercials, movies, and animations, as well as various original content using computer graphics technology; offers PC reuse and recycling services; retails and wholesales golf supplies; and produces, develops, distributes, and sells game software. Further, the company constructs and maintains local area network systems and energy systems for corporations and government agencies; develops and manufactures IoT devices, such as security sensors and AI cameras for home and town security; sells home electric appliances, sports goods, and other activities; photograph and imaging products, original brand, and other products; IT-related products for schools and other educational institutions; develops medical devices for diagnosis and treatment; and repairs electronics equipment. The company was founded in 1968 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "9824.T": {
        "short_name": "SENSHU ELECTRIC CO",
        "long_name": "Senshu Electric Co.,Ltd.",
        "summary": "Senshu Electric Co., Ltd. operates as an electric trading company in Japan and internationally. It develops, sells, and consults information processing systems and communication systems. The company also manufactures and sells electronic control equipment and devices; and installs and sells air conditioning equipment, household electrical appliances, and office equipment. In addition, it is involved in the operation and management of power generation business; and sale and purchase of electricity. Further, the company engages in the real estate leasing business. Additionally, it offers equipment, communication, firefighting, heat resistant, network, thermocouple/compensated lead, instrumentation, and magnet wires. The company also provides power, control, signal, and various eco cables, as well as lightning rod, bare copper, and insulated wires; overseas standard cable, electric wire for robot, and electric wire for movement; and peripheral equipment, LAN, optical communications, and wire processing and network construction, as well as system solutions. The company was founded in 1922 and is headquartered in Suita, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Suita"
    },
    "9880.T": {
        "short_name": "INNOTECH CORP (JAPAN)",
        "long_name": "Innotech Corporation",
        "summary": "Innotech Corporation, together with its subsidiaries, imports and sells electronic design automation software, electric components, and semiconductor products. The company also develops and sells testers and CPU boards. Its products include industrial boards/systems, rugged boards/systems, EDA and OrCAD software, servers/storage solutions, noise analysis solutions, model based development solutions, media analysis and BI solutions, and testers/probe cards. Innotech Corporation was incorporated in 1976 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "9V2.F": {
        "short_name": "KAGA EL. CO. LTD",
        "long_name": "Kaga Electronics Co.,Ltd.",
        "summary": "Kaga Electronics Co., Ltd. sells electronics parts, semiconductors, PCs, and peripherals in Japan, North America, Europe, and Asia. It offers semiconductors, generic electronic parts, LEDs, sensors, and liquid crystal panels; amusement machines and software; and PCs and PC peripherals to electronics mass retailers, schools, and educational institutions, as well as electronics design manufacturing services. The company also provides communication, information processing and industrial equipment, application boards, embedded software of microcomputers, application integrated circuits, safety and earth leakage breakers/DC switches/in-vehicle electric products, and cell packs. In addition, it produces commercials, movies, and animations, as well as various original content using computer graphics technology; offers PC reuse and recycling services; retails and wholesales golf supplies; and produces, develops, distributes, and sells game software. Further, the company constructs and maintains local area network systems and energy systems for corporations and government agencies; develops and manufactures IoT devices, such as security sensors and AI cameras for home and town security; sells home electric appliances, sports goods, and other activities; photograph and imaging products, original brand, and other products; IT-related products for schools and other educational institutions; develops medical devices for diagnosis and treatment; and repairs electronics equipment. The company was founded in 1968 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "OTK.F": {
        "short_name": "OTSUKA CORP.",
        "long_name": "Otsuka Corporation",
        "summary": "Otsuka Corporation provides system integration, support, and other services in Japan. The company operates through two segments, System Integration Business, and Service and Support Business. The System Integration Business segment offers system services ranging from consulting, system design and development, transport and installation work, and network construction. It also provides management systems and collaborative software to cover a range of specialized fields, including CAD and web technologies; and software, hardware, intranet, and security products for the construction and expansion of computer networks. In addition, this segment sells computers, copiers, and communications equipment and software; and develops consigned software. The Service and Support Business segment offers supplies, hardware and software maintenance, telephone support, and outsourcing services; emergency computer rescue services for corporate and individual clients; and network support and services for the planning, design, construction, and operation of corporate information systems, as well as out-sources system engineers. It also provides educational support services. The company was incorporated in 1961 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "TDJ.F": {
        "short_name": "TANAKA CO. LTD",
        "long_name": "Tanaka Co.,Ltd.",
        "summary": "Tanaka Co.,Ltd. engages in the wholesale of electrical materials and appliances in Japan. It offers fluorescent and incandescent light fixtures, HID fixtures, explosion-proof fixtures, ventilation and duct fans, and LED fixtures; and high and low voltage power cables, communication cables, insulation cables, synthetic rubber wires, steel conduits, vinyl chloride pipes, synthetic resin flexible conduits, and various accessories. The company also provides high voltage power receiving equipment, power distribution boards, control equipment, wiring equipment, electric circuit equipment, communication equipment, disaster prevention equipment, and sound equipment. In addition, it offers home appliances, housing equipment, OA equipment, and solar power generation equipment; and concrete columns, steel pipe poles, wire materials, measuring equipment, power tools, security equipment, etc. The company was founded in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    }
}