{
    "2790.T": {
        "short_name": "NAFCO CO LTD",
        "long_name": "NAFCO Co., Ltd.",
        "summary": "NAFCO Co., Ltd. operates a chain of home and furniture retail outlets in Japan. Its furniture/home fashion stores offer kitchen and dining, living room, bed and bedroom, study room, and wedding gift furniture; and bedding products, small furniture, and other items. The company also operates home centers that offer DIY hardware, gardening products, exterior and interior furnishings, automobile accessories, and pet goods. In addition, it operates combination stores that provide general furniture, interior and furnishings, DIY hardware, gardening merchandises, automobile and car accessories, and pet goods. It operates 357 stores. The company was founded in 1970 and is headquartered in Kitakyushu, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Home Improvement Retail",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kitakyushu"
    },
    "3166.T": {
        "short_name": "OCHI HLDG CO LTD",
        "long_name": "Ochi Holdings Co., Ltd.",
        "summary": "Ochi Holdings Co., Ltd., through its subsidiaries, trades in building materials in Japan. It engages in the wholesale of construction materials and housing equipment, such as wood building materials, plywood, eco-related goods, etc. The company also wholesales and sells air conditioning equipment, heating equipment, cooling equipment, household goods, etc.; and processes, manufactures, and sells wood precuts 2 x 4 panels for wooden houses. In addition, it is involved in the nursing care related business in the construction industry; and sale of industrial materials. Ochi Holdings Co., Ltd. was founded in 1955 and is based in Fukuoka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Home Improvement Retail",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Fukuoka City"
    },
    "3191.T": {
        "short_name": "JOYFUL HONDA CO LTD",
        "long_name": "Joyful Honda Co., Ltd.",
        "summary": "Joyful Honda Co., Ltd. engages in the home improvement retail business in Japan. The company operates home centers, which provide timber, building materials, paints, tools, hardware, worker essentials, and electrical fittings; gardening and plumbing supplies, agricultural materials, and engine machinery; wallpapers, carpets and curtains, lighting fixtures, and electrical appliances, as well as daily living essentials, daily consumables, and fresh cut flowers; and storage goods, stationery and office supplies, outdoor goods, automotive accessories, bicycles, medicines, and alcoholic and non-alcoholic drinks. It also operates garden centers that offer flower seedlings, vegetable seedlings, plants, mulch and other soil for horticulture, fertilizers, plant pots and other gardening supplies, bricks, paving stones, and other landscaping supplies; pet centers, which provide dogs, cats, small animals, birds and fish, and pet supplies, as well as pet foods, cages, toys, and trimmer service facilities; and self-service gas stations. It operates 15 stores in Ibaraki, Chiba, Saitama, Tochigi, Gunma, and Tokyo. In addition, the company, through its subsidiaries, is involved in home renovation, art and craft supplies retail, sports club, vehicle inspection and maintenance, and tire sales and fitting businesses. It also operates an online shop. Joyful Honda Co., Ltd. was founded in 1975 and is headquartered in Tsuchiura, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Home Improvement Retail",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tsuchiura"
    },
    "3199.T": {
        "short_name": "WATAHAN CO LTD",
        "long_name": "Watahan & Co.,Ltd.",
        "summary": "Watahan & Co.,Ltd., through its subsidiaries, engages in the retail, construction, trading, and other businesses in Japan. The company operates a chain of 21 home improvement super centers primarily in Nagano; manages 5 grocery stores in and around Ichinomiya City; and manages 11 stores of home improvement centers in Kanto-Koshin area, as well as online retailing business. It is also involved in the construction design, operation, maintenance, and management activities; civil engineering operations; construction of landscaping and facades; sale and rental of construction materials, event goods, playground equipment, nursing care, and social welfare goods; operation of parking lots; and parked vehicle management activities. In addition, it provides consultancy services related to building construction, maintenance, management, and renovation activities; and manufactures and constructs steel buildings and bridge frames, as well as constructs earthquake resistant bridges. Further, it imports and sells pharmaceutical and cosmetic materials, industrial-use waxes, and general and health food materials. Additionally, the company provides home care services for individuals and seniors with disabilities; technical advisory, architectural and steel frame construction drawing, building maintenance, and construction material import and sale services; and welfare services. Watahan & Co.,Ltd. was founded in 1598 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Home Improvement Retail",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3546.T": {
        "short_name": "ALLEANZA HOLDINGS CO LTD",
        "long_name": "Alleanza Holdings Co.,Ltd.",
        "summary": "Alleanza Holdings Co., Ltd. operates in the home improvement, pet shop, and related businesses. The company is based in Fukushima, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Home Improvement Retail",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Fukushima"
    },
    "7450.T": {
        "short_name": "SUNDAY CO LTD",
        "long_name": "Sunday Co.,Ltd.",
        "summary": "Sunday Co.,Ltd. engages in home center business in Japan. The company offers horticulture, gardening supplies, gardening machines, and agricultural materials; leisure goods, including outdoor sports equipment, cycle parts, silver cars, and toy watches; car supplies, car washes and interiors, and car maintenance services; and work clothes, work supplies, work wear, footwear, dog food, cat food, and small animal supplies, as well as circle, collar, and sanitary goods. It also provides wood and building materials; processing and wood products; organized storage supplies and hardware; electric tools, and work tools, storage safety products; paint and repair materials, repair agents, and packing supplies; and OA supplies and stationery products. In addition, the company offers bedding and sleeping goods; interior wall accessories, window decorations, floor decorations, decorative goods, storage items, and LDK furniture; cooking home appliances and wiring antennas; and daily necessities, life supporting products, makeup and hygiene products, and daily consumption products. Further, it provides household goods, cooking utensils, house cleaning products, exterior garden supplies, work equipment, and outdoor storage products; kitchen equipment, faucet, and plumbing supplies, as well as air conditioning equipment; professional tools, logistics storage supplies, research management supplies, construction supplies, office dwelling supplies, environmental safety products, work supplies, production processing goods, and cutting tools; processed food and seasonings; and daily distribution, cold food, and fresh food. The company was formerly known as Sunday Years Mart Co., Ltd. and changed its name to Sunday Co.,Ltd. in November 1976. The company was founded in 1930 and is headquartered in Hachinohe, Japan. Sunday Co.,Ltd. is a subsidiary of Aeon Co., Ltd.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Home Improvement Retail",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Hachinohe"
    },
    "7516.T": {
        "short_name": "KOHNAN SHOJI",
        "long_name": "Kohnan Shoji Co., Ltd.",
        "summary": "Kohnan Shoji Co., Ltd. operates and manages a chain of home center stores that offer DIY products and household goods to general consumers and professionals in Japan. Its home center stores offer home improvement products, which include lumber, building materials, tools, hardware, pain supplies, working clothes and equipment, gardening tools and equipment, plants, material handling products, housing and plumbing supplies, and remodeling and renovating products; housekeeping products, such as electrical appliance, kitchenware and dining, furniture and decor, bedding, electronics and lighting, household supply, health and personal care, footwear, clothing, cleaning, and laundry products; and car and leisure products, including automotive supplies and accessories, pet supplies, stationary and office supplies, cycling products, and sports and outdoor products. The company also operates Homestock store, a discount and convenient home center that offer approximately 22,000 items to consumers; and KOHNAN PRO stores, which sell various tools, building materials, paint supplies, and working equipment for professional customers. As of February 29, 2020, it operated 453 shops primarily in the Kinki area. The company was founded in 1978 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Home Improvement Retail",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "7590.T": {
        "short_name": "TAKASHO CO LTD",
        "long_name": "Takasho Co.,Ltd.",
        "summary": "Takasho Co.,Ltd. engages in import and export of garden supplies in Japan and internationally. The company is also involved in the planning, design, and development of exterior products, such as indoor and outdoor garden and greening related products. In addition, it provides and processes CAD and CG software. The company was founded in 1935 and is headquartered in Kainan, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Home Improvement Retail",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kainan"
    },
    "8208.T": {
        "short_name": "ENCHO CO LTD",
        "long_name": "Encho Co.,Ltd.",
        "summary": "Encho Co.,Ltd. operates stores in Japan. Its stores offer lumber, construction materials, gardening supplies, pains, glues and adhesives, power tools, carpenter's tools, metal materials for construction, interior materials, electrical equipment, lamps, automobile parts, miscellaneous goods, stationery, bicycles, and leisure goods. The company is also involved in the house remodeling business. The company was founded in 1939 and is headquartered in Fuji, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Home Improvement Retail",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Fuji"
    },
    "8218.T": {
        "short_name": "KOMERI CO LTD",
        "long_name": "Komeri Co.,Ltd.",
        "summary": "Komeri Co.,Ltd. operates a chain of home improvement stores in Japan. The company's stores offer hard merchandise, such as tools, hardware, and building materials; and green merchandise, including green plants and gardening/farming materials. As of March 31, 2019, it operated 1,192 stores comprising 64 Powers, 164 Homecenters, 956 Hard and Greens, and 8 Athenas. The company was formerly known as Komeri Showten Co., Ltd. and changed its name to Komeri Co.,Ltd. in January 1973. Komeri Co.,Ltd. was founded in 1952 and is headquartered in Niigata, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Home Improvement Retail",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Niigata"
    },
    "9835.T": {
        "short_name": "JUNTENDO CO LTD",
        "long_name": "Juntendo Co.,Ltd.",
        "summary": "Juntendo Co.,Ltd. develops and operates home centers, drug stores, and book centers. The company's home centers offer agricultural and gardening materials, DIY products, leisure and sports supplies, cars, pet supplies, etc.; drug stores provide medicines, health foods, daily necessities, and cosmetics; and book centers offer books, CDs, DVDs, stationery, miscellaneous goods, etc. It also rents CDs and DVDs. The company was founded in 1894 and is headquartered in Masuda, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Home Improvement Retail",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Masuda"
    },
    "9903.T": {
        "short_name": "KANSEKI CO LTD",
        "long_name": "Kanseki Co., Ltd.",
        "summary": "Kanseki Co., Ltd. manages home centers, specialty stores, and related business in Japan. The company operates pet stores that offer a range of dogs, cats, birds and other animals, goldfishes, tropical fishes, and breeding equipment. It also operates supermarkets that include seasonings, canned foods, beverages, livestock processed goods, miscellaneous goods, and frozen food products; and off house stores that offer furniture, home appliances, interior goods, gifts, household goods, clothing, sporting goods, etc. In addition, the company operates Wildburn, a hamburger and pasta shop. It operates 75 stores under Home Center Kanseki and WILD-1. The company was formerly known as Hattori Co., Ltd. and changed its name to Kanseki Co., Ltd. in December 1976. The company was founded in 1975 and is headquartered in Utsunomiya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Home Improvement Retail",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Utsunomiya"
    },
    "9976.T": {
        "short_name": "SEKICHU CO LTD",
        "long_name": "Sekichu Co., Ltd.",
        "summary": "Sekichu Co., Ltd. operates home solution centers. It also operates car supplies and bicycle specialty stores. The company was formerly known as Sekiguchi Mokuzai Co., Ltd. and changed its name to Sekichu Co., Ltd. in July 1977. Sekichu Co., Ltd. was founded in 1952 and is headquartered in Takasaki, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Home Improvement Retail",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Takasaki"
    }
}