{
  "1447.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "ITbook Holdings Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "ITBOOK HLDGS CO LTD",
    "state": null,
    "summary": "ITbook Holdings Co.,Ltd., through its subsidiaries, provides IT consulting services in Japan. It offers consulting services related to ICT, and system development and maintenance operations; sells software and hardware; and provision of introduction/dispatch of human resources to public and private enterprises, such as government agencies, independent administrative agencies, local governments, and others. The company also engages in ground survey and improvement work; and the provision of guarantee services for safety of houses, as well as implements ground and inspection systems for enhancing the value of housing properties. In addition, it manufactures and sells construction related meteorological observation systems, noise and vibration measurement equipment, and other products to general contractors; and engages in temporary staffing services. Further, the company provides ground improvement projects and ground guarantees through diagnosis of existing structures; and disaster prevention services. ITbook Holdings Co., Ltd. was founded in 2018 and is based in Tokyo, Japan.",
    "website": "http://www.itbook-hd.co.jp",
    "zipcode": "103-0025"
  },
  "1973.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "NEC Networks & System Integration Corporation",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "NEC NETWORKS & SYSTEM INTEGRATI",
    "state": null,
    "summary": "NEC Networks & System Integration Corporation provides planning, consulting, system design and integration, construction, and installation services in Japan and internationally. It operates through Digital Solutions Business, Network Infrastructures Business, and Engineering & Support Services Business segments. The Digital Solutions Business segment offers systems and services for information and communications technology (ICT), such as corporate networks and IT using digital technologies, which includes artificial intelligence, the Internet of Things, and robotic process automation. The Network Infrastructures Business segment builds systems and provides services for the network infrastructure for public use, including networks for telecom carriers, and ICT infrastructure for national and local governments, as well as broadcasters. The Engineering & Support Services Business segment offers maintenance, operating and monitoring, outsourcing, and other support services, as well as construction for ICT systems and services. It's products include telephony servers, video conferencing systems, routers, switches, network testers, interface converters, load balancers, accelerators, internet traffic, SSL-VPN access firewalls, unauthorized access detection, authentication systems, operation and maintenance, spam blocking, physical security, log management industry and task-specific applications, and software. The company operates through a service network of approximately 400 locations in Japan. NEC Networks & System Integration Corporation was founded in 1953 and is headquartered in Tokyo, Japan.",
    "website": "http://www.nesic.co.jp",
    "zipcode": "112-8560"
  },
  "2158.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "FRONTEO, Inc.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "FRONTEO INC",
    "state": null,
    "summary": "FRONTEO, Inc. provides Asian-language eDiscovery solutions and services primarily in Japan, the United States, Korea, and internationally. The company operates through LegalTech AI Business and AI Solution Business segments. It has eDiscovery and forensic information documented in Japanese, Korean, Chinese, and English. The company assists clients involved in cross-border litigation, administrative proceedings, and internal investigations, including those related to antitrust investigations, intellectual property litigation, the Foreign Corrupt Practices Act, and product liability investigations. It also provides Lit i View, an online eDiscovery software, which handles Asian-language characters, encoding schemes, and native file systems; and Intelligence Cloud solution to address the substantial complexity and cost associated with international investigations and litigations. In addition, the company offers electronic data forensic investigation solutions and services that enable the preservation, analysis, processing, and production of electronically stored information in connection with fraud and corporate information leakage; and Lit i View XAMINER, a digital forensic software, and other related hardware and software products; and forensic tools. Further, it helps to create document management procedures; conduct corporate risk audits; and comply with legal requirements to provide information to stakeholders. Additionally, the company provides AI solutions in the fields of business intelligence, healthcare, and digital communications. It serves enterprises, government agencies, law firms, corporate legal departments, and other professional advisors under the FRONTEO, KIBIT, Lit i View, and Landscaping brands. The company was formerly known as UBIC, Inc. and changed its name to FRONTEO, Inc. in July 2016. FRONTEO, Inc. was founded in 2003 and is headquartered in Tokyo, Japan.",
    "website": "http://www.fronteo.com",
    "zipcode": "108-0075"
  },
  "2317.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Systena Corporation",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "SYSTENA CORPORATION",
    "state": null,
    "summary": "Systena Corporation engages in the development and technical assistance for information terminal software, quality assurance for mobile terminals and Web applications, and system maintenance and operation in Japan. It also designs, manufactures, and sells IoT/M2M routers, LTE/3G/WiMAX2+/PHS routers, Wi-Fi board, Android terminal, wireless digital signage, antenna, etc., as well as software development, evaluation and verification, and IT services. In addition, the company engages in the provision of data entry, volume output, mailing, and secretariat and paperwork agency services, as well as employs heavily disabled persons; employment transition and work continuation support project based on services and supports for persons with disabilities act; and planning and management of social games for mobiles, smartphones, and PCs. Further, it is involved in the planning, development, sale, and other services in the fields of AI, IoT, robots, fintech, and social media; and mobile and communication development and verification support, solution, and consumer businesses, including SNS gaming. The company was founded in 1981 and is headquartered in Tokyo, Japan.",
    "website": "http://www.systena.co.jp",
    "zipcode": "105-0022"
  },
  "2323.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "fonfun corporation",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "FONFUN CORPORATION",
    "state": null,
    "summary": "fonfun corporation provides content services for internet-compatible mobile phones. It offers Remote mail (personal version), an email service; Remote mail (corporate service), a service to view and send and receive company emails from mobile phones, smartphones, and tablets; Remote catalog, a solution to convert Word, Excel, PowerPoint, and PDF files to image files; Remote browsing, a gateway service to access business servers from terminals; and Remote business card BizCompass, a solution to convert scanned business cards into data. It also provides Remote talk, a business chat; fonfun Any Clutch remote, a service to access and operate its PC from laptop, smartphone, and tablet; and Voice mail, a business communication tool. In addition, it offers Web application diagnosis, a service that diagnoses and investigates whether there is a security problem in Web application by performing a pseudo attack; Network diagnosis, a service that diagnoses and investigates whether there are any security problems with the servers, network devices, OS, middleware, and server software; fonfun SMS, a SMS service for site guidance, notification transmission, reminder, and reservation reminders; and Questionnaire Connect, a questionnaire system that connects site and top management. The company was formerly known as Net Village Co., Ltd. and changed its name to fonfun corporation in October 2006. fonfun corporation was founded in 1997 and is headquartered in Tokyo, Japan.",
    "website": "http://www.fonfun.co.jp",
    "zipcode": "151-0073"
  },
  "2335.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Cube System Inc.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "CUBE SYSTEM INC",
    "state": null,
    "summary": "Cube System Inc. provides various technological services in Japan and internationally. It offers system integration services ranging from configuration of the user interface to operational testing; professional services, such as system consulting, infrastructure, database configuration, organization and management, and system migration services; and system outsourcing services. The company provides its solutions for finance, distribution, telecommunications, and manufacturing industries. It also offers system infrastructure solutions; services for system and core system operational maintenance; and service configurations in system planning, development, and maintenance. The company was formerly known as Customer Engineers Corporation and changed its name to Cube System Inc. in October 1990. Cube System Inc. was founded in 1972 and is headquartered in Tokyo, Japan.",
    "website": "http://www.cubesystem.co.jp",
    "zipcode": "141-0032"
  },
  "2391.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Planet, Inc.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "PLANET INC",
    "state": null,
    "summary": "Planet, Inc. provides electronic data interchange (EDI) services for raw materials suppliers, CPG/OTC manufacturers, wholesalers, and retailers in Japan. The company offers EDI for enterprise systems, procurement/Web-EDI/MITEOS, etc.; location database, CPG and OTC product database, OTC medicines instructions database, product master registration support services, etc.; and product lookup/trend markets/business navigator, etc., which enables the perusal of data, including product information, industry news, and the campaigns of various companies. Planet, Inc. was founded in 1985 and is based in Tokyo, Japan.",
    "website": "http://www.planet-van.co.jp",
    "zipcode": "105-0013"
  },
  "2468.T": {
    "city": "Osaka",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "FueTrek Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "FUETREK CO.LTD",
    "state": null,
    "summary": "FueTrek Co., Ltd. provides speech recognition, speech dialogue, speech synthesis, and machine translation technologies and solutions in Japan. The company offers vGate ASR, a speech recognition system; vGate TTS, a speech synthesis product; vGate Talk2Me, a speech dialogue system; and speech translation system, as well as Dictation Editor, a transcription software. It also provides sound generator IP, Voice Memo and Voice UI application, and speech recognition ASP services. In addition, the company offers image media solutions, including TV programs and other imaging production, as well as CRM system and system development businesses. It provides the solution for various markets and industries comprising car navigation system/telematics, home appliances/smart homes, inspection/manufacturing/logistics, sales visit/negotiation records, SFA transcription of lectures/meeting minutes, mobile device UI, advertising/marketing, contact center solutions, deployment support services, and operation and maintenance services. The company was founded in 2000 and is headquartered in Osaka, Japan.",
    "website": "http://www.fuetrek.co.jp",
    "zipcode": "532-0011"
  },
  "2488.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "JTP Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "JTP CO LTD",
    "state": null,
    "summary": "JTP CO.,Ltd. provides outsourced technical services to technology companies in Japan. The company offers integration services, including consultation, system design and integration, system development, operation and maintenance, helpdesk, and supply chain management for users; and training program for enterprises. It also provides training services, such as delivering training programs, preparing and cultivating training staff, promoting training programs, rental lesson venues, and localizing course materials. In addition, the company offers medical devices support services comprising medical device repairs and maintenance, substitute device, sales support, technological implementation support, and help desk; and analytical instruments solutions, which consists of technical support on delivery, maintenance, help desk, equipment and software localization, and lab management system, as well as IT skill assessments. Further, it engages in the development of custom application; sale and rental of robots; importing and localization; and provision of robotics business consulting, and technical support services. The company was formerly known as Japan Third Party Co., Ltd. and changed its name to JTP CO.,Ltd. in April 2021. JTP CO.,Ltd. was founded in 1987 and is headquartered in Tokyo, Japan.",
    "website": "http://www.jtp.co.jp",
    "zipcode": "140-0001"
  },
  "3356.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Terilogy Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "TERILOGY CO LTD",
    "state": null,
    "summary": "Terilogy Co., Ltd. provides IP-network-related products, and products and solutions in the network security field to corporations in Japan and internationally. The company imports and sells hardware, software, and network products; offers system-related consulting, and system building and training services for end users; provides network building and related construction/installation work, as well as maintenance services for network-related products; and develops application software. It sells routers, switches, WLAN equipment, DNS and DHCP equipment, and others; network security products and services, such as firewalls, intrusion detection and prevention systems, information leakage countermeasures, and others, as well as security authentication systems; products that collect data on various network traffic to telecommunications carriers and other corporations; and EzAvater, a software-based robotic process automation tool. The company also offers proprietary CloudTriage services, which entail cloud-based performance monitoring for applications; and real-time video interpreting, managed-VPN, web conferencing, corporate internet connection, high-speed mobile data communication, rental server, and other network solutions and services for small and medium-sized enterprises. In addition, it provides corporate in-house communication network system design, and infrastructure design services for building of networks; and after-sale maintenance services. The company primarily serves manufacturers and telecommunications carriers. Terilogy Co., Ltd. was founded in 1989 and is headquartered in Tokyo, Japan.",
    "website": "http://www.terilogy.com",
    "zipcode": "102-0073"
  },
  "3371.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Softcreate Holdings Corp.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "SOFTCREATE HOLDINGS CORP",
    "state": null,
    "summary": "Softcreate Holdings Corp., through its subsidiaries, provides system integration and other IT related services in Japan. The company offers EC solutions by providing value-added services, such as promotions in addition to selling and customizing the EC site construction package; and hosting services at the data center. It also provides system integration services comprising network construction and cloud services for three software products, including X-point, AgileWorks, and L2Blocker; and sells IT equipment, such as personal computers and servers to corporate customers, as well as provides commercial package software. The company was founded in 1983 and is headquartered in Tokyo, Japan.",
    "website": "http://www.softcreate-holdings.co.jp",
    "zipcode": "150-0002"
  },
  "3393.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Startia Holdings,Inc.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "STARTIA HLDGS INC",
    "state": null,
    "summary": "Startia Holdings,Inc. engages in the IT business in Japan and internationally. It offers IT infrastructure, including system integration, high-speed Internet, communication line, countermeasure, MFP, business phone, network construction/maintenance, cloud file server, and others; and develops and sells cloud applications related to digital marketing, such as Website creation/management tool, AR creation tool, marketing automation tool, and document management/e-book creation software. The company also provides PC automation, document central management, online storage, Intelligent backup, and number collection/storage services; corporate venture capital; and disability people employment services. The company was formerly known as Startia, Inc. and changed its name to Startia Holdings,Inc. in April 2018. Startia Holdings,Inc. was founded in 1996 and is based in Tokyo, Japan.",
    "website": "http://www.startiaholdings.com",
    "zipcode": "163-0919"
  },
  "3565.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Ascentech K.K.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "ASCENTECH K K",
    "state": null,
    "summary": "Ascentech K.K. provides virtual desktop infrastructure (VDI) and IT infrastructure solutions. It provides VDI software, VDI server, network, security, VDI printing, ThinClient, and various infrastructure products and solutions. The company also offers professional services, such as consulting, system design and integration; and support and maintenance services, as well as cloud and technical consultation services. Ascentech K.K. was founded in 2009 and is based in Tokyo, Japan.",
    "website": "http://www.ascentech.co.jp",
    "zipcode": "101-0022"
  },
  "3625.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Techfirm Holdings Inc.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "TECHFIRM HOLDINGS INC",
    "state": null,
    "summary": "Techfirm Holdings Inc. develops, operates, and maintains system solutions for business support activities. It also provides marketing solutions utilizing the Internet, such as smartphones, tablets and PCs; and system and service consulting, and server and network integration services. In addition, the company offers mobile advertisements. The company was formerly known as Techfirm Inc. and changed its name to Techfirm Holdings Inc. in July 2015. Techfirm Holdings Inc. was founded in 1991 and is headquartered in Tokyo, Japan.",
    "website": "http://www.techfirm.co.jp",
    "zipcode": "163-1423"
  },
  "3630.T": {
    "city": "Gifu",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Densan System Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "DENSAN SYSTEM CO LTD",
    "state": null,
    "summary": "Densan System Co., Ltd. operates as an integrated data processing service company in Japan. It offers a range of services, such as business proposals, systems engineering and development, the procurement of hardware for the construction of systems environment, and the operation and maintenance of the systems. The company's data processing services include maintenance and operation for sales and management-accounting systems; the outsourcing of data processing from data-entry to data agglomeration, analysis, and processing; and provision of data centers with protection through its disaster-prevention facility, as well as systems solutions, and office supplies procurement and sales services. In addition, it offers systems integration services comprising the installation of application systems for systems or office equipment, as well as office equipment, and procurement and sales systems. Further, the company provides integrated payment solutions consisting of payment acceptance and mobile payment services. It serves e-commerce, payment, medical, dental, and other industries. The company was formerly known as Gifu Electronic Calculation Center and changed its name to Densan System Co., Ltd. in 1977. Densan System Co., Ltd. was founded in 1967 and is headquartered in Gifu, Japan.",
    "website": "http://www.densan-s.co.jp",
    "zipcode": "501-6196"
  },
  "3634.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Sockets Inc.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "SOCKETS INC",
    "state": null,
    "summary": "Sockets Inc. develops and provides applications, and database for Internet platforms. It offers data services, cross-media recommendation, emotional metadata analysis services, specialized search services, integral system development and construction, and database service planning and developing. The company was founded in 2000 and is based in Tokyo, Japan.",
    "website": "http://www.sockets.co.jp",
    "zipcode": "151-0051"
  },
  "3636.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Mitsubishi Research Institute, Inc.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "MITSUBISHI RESEARCH INSTITUTE I",
    "state": null,
    "summary": "Mitsubishi Research Institute, Inc. provides think tank, consulting, and IT services to government agencies, financial institutions, and private companies in Japan. Its service solutions include management consulting, digital innovation, financial innovation, environment/energy, healthcare/wellness, regional revitalization, next-generation infrastructure, science/safety, nuclear safety, economy/society/R&D, project case, and public sector orders. Mitsubishi Research Institute, Inc. has a partnership with ForePaaS SAS to deliver cloud-native data intensive solutions in Japan. The company was founded in 1970 and is headquartered in Tokyo, Japan.",
    "website": "http://www.mri.co.jp",
    "zipcode": "100-8141"
  },
  "3655.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "BrainPad Inc.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "BRAINPAD INC.",
    "state": null,
    "summary": "BrainPad Inc. provides prediction/analysis, system integration, and digital marketing services in Japan. The company's prediction/analysis services consist of data analytics/prediction to suggested concrete action plans and measures; prediction scores; and machine learning/deep learning/optimization services, etc. It also offers automatic operational systems development services, such as system integration of prediction developed logics/algorithms and 3rd party analytics packages; and customer relationship management system consultation services. In addition, the company's digital marketing services comprise software as a service based marketing service, in house developed recommendations, and natural language analysis. BrainPad Inc. was founded in 2004 and is headquartered in Tokyo, Japan.",
    "website": "http://www.brainpad.co.jp",
    "zipcode": "108-0071"
  },
  "3657.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Poletowin Pitcrew Holdings, Inc.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "POLETOWIN PITCREW HLDG",
    "state": null,
    "summary": "Poletowin Pitcrew Holdings, Inc., together with its subsidiaries, engages in the testing/verification and evaluation, and Internet supporting businesses in Japan and internationally. The company's Testing/Verification and Evaluation Business segment provides defect detection services in support of enhancement in product quality of software and hardware. This segment also offers testing services, such as detecting defects and adjusting the balance of difficulty level in consumer electronic games, social games, mobile phone content, smartphone and tablet PC content, and PC software, as well as in pachinko and arcade slot machines; verification and evaluation services; and translation services, including the translations of the in-game texts of game software designed for overseas markets, instruction manuals, Websites, game proposals, and specification documents. Its Internet Supporting Business segment monitors texts, images, and videos posted on Internet message boards, blogs, SNS, etc.; and provides Web investigation and server monitoring, and customer support services. The company also offers services to produce subtitles audio guides for television programs; develops and operates UDCast service; and provides support services, such as visa obtainment, school enrollment, and daily life procedures for foreign personnel working in medical institutes. Poletowin Pitcrew Holdings, Inc. was founded in 2009 and is headquartered in Tokyo, Japan.",
    "website": "http://www.poletowin-pitcrew-holdings.co.jp",
    "zipcode": "163-0811"
  },
  "3666.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Tecnos Japan Incorporated",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "TECNOS JAPAN INCORPORATED",
    "state": null,
    "summary": "Tecnos Japan Incorporated engages in ERP/CRM core system and related business activities in Japan. The company's services include business consulting, system grand design support, requirements definition, design, development, and maintenance. It also provides digital transformation consulting and IoT/blockchain/big data utilization promotion services. The company was founded in 1994 and is headquartered in Tokyo, Japan.",
    "website": "http://www.tecnos.co.jp",
    "zipcode": "163-1414"
  },
  "3670.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Kyoritsu Computer & Communication Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "KYORITSU COMPUTER & COMMUNICATI",
    "state": null,
    "summary": "Kyoritsu Computer & Communication Co.,Ltd. provides management information solutions for sales, construction, education and operation services, etc. in Japan. Its solutions and software related to information and communication are used in promoting management activities for corporate customers. The company offers accounting information installation support, cloud implementation support, information content, information utilization support, infrastructure operation support, infrastructure implementation support, and communications infrastructure installation support services; and software and information utilization education services, as well as ICT courses, such as cloud services and smartphones, and educational curriculum courses. It also sell smart and mobile phones, data cards, etc. to corporate customers, as well as six DoCoMo shops in Tokyo and Saitama prefecture. The company was formerly known as Kyoritsu Densetsu Co., Ltd. and changed its name to Kyoritsu Computer & Communication Co.,Ltd. in November 1988. Kyoritsu Computer & Communication Co.,Ltd. was founded in 1964 and is based in Tokyo, Japan.",
    "website": "http://www.kccnet.co.jp",
    "zipcode": "105-0013"
  },
  "3676.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "DIGITAL HEARTS HOLDINGS Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "DIGITAL HEARTS HOLDINGS CO LTD",
    "state": null,
    "summary": "DIGITAL HEARTS HOLDINGS Co., Ltd., together with its subsidiaries, engages in debugging, media, and other businesses. It operates 4Gamer.net, a gaming site that gathers new and original coverage of games and related information, as well as publishes news and distributes movies, free trials, weekly publications, and other content. The company also provides support services for the creation of content, including game development, CG video creation, etc. In addition, it offers debug testing and reporting services for the consumer games, mobile and online games, arcade games, etc.; testing services for IT-related software, including websites and operations systems; solutions for development of AI application and testing automation; consultation for Website or systems for end users; and security services. The company was formerly known as Hearts United Group Co., Ltd. and changed its name to DIGITAL HEARTS HOLDINGS Co., Ltd. in July 2018. DIGITAL HEARTS HOLDINGS Co., Ltd. was founded in 2001 and is headquartered in Tokyo, Japan.",
    "website": "http://www.digitalhearts-hd.com",
    "zipcode": "163-1441"
  },
  "3682.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Encourage Technologies Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "ENCOURAGE TECHNOLOGIES CO LTD",
    "state": null,
    "summary": "Encourage Technologies Co., Ltd. develops, maintains, and sells computer system software products primarily in Japan. The company offers ESS SmartIT Operation products, including ESS REC, a standard tool for monitoring and auditing user system operations; Remote Access Auditor that records the remote user system operations, including capturing desktop screen, such as videos; and ESS AdminGate, which covers security management for servers, including privileged access management, password management, log management, and file transfer controls. It also provides ESS FileGate that provides safe transferring file environment by various type of file sanitization technologies; ESS AdminControl, a privilege ID management product; ESS AdminControl for Client for managing local administrator password; and ID Inspector, which identifies the user who uses Shared ID, such as root/administrators without any customization of application and operation systems. In addition, the company offers ESS AutoAuditor, which is an automated audit for user system operation validation; ESS AutoQuality, a user system operation solution; and Encourage Super Station, a system monitoring solution. Further, it provides BPO and consulting services related to IT system operations. Encourage Technologies Co., Ltd. was founded in 2002 and is headquartered in Tokyo, Japan.",
    "website": "http://www.et-x.jp",
    "zipcode": "103-0007"
  },
  "3753.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Flight Holdings Inc.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "FLIGHT HOLDINGS INC",
    "state": null,
    "summary": "Flight Holdings Inc. provides electronic payment solutions in Japan. It operates through Consulting & Solutions Business, Service Business, and EC Solutions Business segments. The Consulting & Solutions Business segment develops core systems for operating companies, as well as develops and maintains systems for existing customers. The Service Business segment develops and sells electronic payment solutions. The Solutions Business segment develops and sells EC-RiderB2B, an EC site construction package for B-to-B companies. The company was formerly known as Flight System Consulting Inc. and changed its name to Flight Holdings Inc. in June 2013. Flight Holdings Inc. was founded in 1988 and is headquartered in Tokyo, Japan.",
    "website": "http://www.flight-hd.co.jp",
    "zipcode": "150-0013"
  },
  "3762.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "TechMatrix Corporation",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "TECHMATRIX CORP",
    "state": null,
    "summary": "TechMatrix Corporation engages in the information infrastructure and application service business in Japan. It offers information infrastructure solutions in the green information technology (IT), virtualization, next-generation networks, security and storage, and other related fields; and IT services, which include lifecycle of systems comprising the maintenance, operation, and monitoring services. The company also provides various application services, such as systems development, cloud, test, process analysis, design, software development and integration, and operation and maintenance services, as well as application packages to healthcare, CRM, Internet services, finance, and software quality control markets. In addition, it offers network solutions, SDN, storage products, IT security products, and temporary dispatch and employee placement services for IT technicians; and system development and training services for skill-development of IT technicians. The company was formerly known as Nichimen Data Systems Co., Ltd. and changed its name to TechMatrix Corporation in November 2000. TechMatrix Corporation was founded in 1984 and is headquartered in Tokyo, Japan.",
    "website": "http://www.techmatrix.co.jp",
    "zipcode": "108-8588"
  },
  "3798.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "ULS Group, Inc.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "ULS GROUP INC",
    "state": null,
    "summary": "ULS Group, Inc. provides IT consulting and solutions in Japan. The company was founded in 2000 and is based in Tokyo, Japan.",
    "website": "http://www.ulsgroup.co.jp",
    "zipcode": "104-6014"
  },
  "3799.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Keyware Solutions Inc.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "KEYWARE SOLUTIONS INC",
    "state": null,
    "summary": "Keyware Solutions Inc. creates and sells information systems for the support of social infrastructure in Japan. The company offers medical service systems to hospital management analysis systems across examination, nutrition, and medical administration divisions; electronic approval group ware solutions for the preparation of corporate internal work-flows for application and approval routines; corporate internal intellectual property management systems for patent administration and management; and WEB based system that enables the management of advertising in public transportation and supports the sales activities of advertising agencies. It also provides logistics and distribution systems for the preparation of various analysis documentations; operations support systems for temporary staffing and subcontracting industries; template collection for SAP ERP systems for manufacturing companies; package software, which enables the implementation of network management systems to corporations and local governments; and GO-Global, a middleware used as engine to enable server side computing structured as hybrid thin client solutions. In addition, the company offers support services, including creation, implementation, operation, maintenance, and training services, as well as system integration services. It offers its products and services for use in financial services, distribution and logistics, manufacturing, telecommunications, transportation, media, government agencies, medical services, network administration, system monitoring, transmission control, and interface control fields, as well as for service providers. The company was formerly known as Nippon Electronics Development Co., Ltd. and changed its name to Keyware Solutions Inc. in January 2001. Keyware Solutions Inc. was founded in 1965 and is headquartered in Tokyo, Japan.",
    "website": "http://www.keyware.co.jp",
    "zipcode": "156-8588"
  },
  "3837.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Ad-Sol Nissin Corporation",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "AD-SOL NISSIN CORPORATION",
    "state": null,
    "summary": "Ad-Sol Nissin Corporation develops information and embedded systems for companies in Japan. The company offers various ZigBee products, such as wireless communication standard implementing multi-pop communication; tag solution for managing the location of people and objects; communication checker, which allows checkers to check the communication status between two points; and communication environment evaluation tool, a support tool to evaluate the wireless communication environment and communication performance. It also provides power line communication environment evaluation software that allows communication using existing power lines without the need for new wiring; and ruby technology platform. In addition, the company offers Touch Tag products, including starter kits for electric field communication; hands-free authentication systems for individual authentication from natural behavior that does not require an ID card to be held over a reader; and energy monitoring systems for visualization of energy. Further, it provides consulting, maintenance, and information system life cycle services. Ad-Sol Nissin Corporation primarily serves power/gas utilities, financial organizations, large manufacturers, communication carriers, and other fields. The company was formerly known as Nissin Software and changed its name to Ad-Sol Nissin Corporation in November 2003. Ad-Sol Nissin Corporation was founded in 1976 and is headquartered in Tokyo, Japan.",
    "website": "http://www.adniss.jp",
    "zipcode": "108-0075"
  },
  "3839.T": {
    "city": "Osaka",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "ODK Solutions Company, Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "ODK SOLUTIONS COMPANY LTD",
    "state": null,
    "summary": "ODK Solutions Company, Ltd. provides business process outsourcing services. The company also offers trust calculation services, software development services, network associated systems, and open systems, as well as sells computer packages and OA machines. Its services for educational facilities include business process outsourcing services; Web application services; Web A&A systems; public relations support for entrance examination; cooperation with intramural systems; and services for score conversion and verification of National Center Test for university admissions. The company's services for securities companies comprise back office systems, and system for prevention of unfair transactions, as well as outsourcing services related to connection between securities company and Japan Securities Depository Center, Inc.; and services for general companies consist of data management, batch processing, and report creation, as well as data aggregation and analysis, and housing services. In addition, it develops and sells applications for smart phones and tablet-type devices based on iOS and Android; and offers services for securities finance and clearing service companies. The company was founded in 1963 and is headquartered in Osaka, Japan.",
    "website": "http://www.odk.co.jp",
    "zipcode": "541-0045"
  },
  "3844.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Comture Corporation",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "COMTURE CORPORATION",
    "state": null,
    "summary": "Comture Corporation provides information technology (IT) services. It offers cloud, mobile links, system construction, and other activities, as well as installation of products; data analysis solutions using big data and artificial intelligence tools, and support services for the visualization, efficiency, and automation of business processes using robotic process automation tools; and consulting, design, development, maintenance, and other services for ERP packages and enterprise systems. The company also provides groupware and IT system surveillance services; marketing services; help desk operations for PCs and business applications; and constructs and operates networks, as well as sells products. Comture Corporation was founded in 1985 and is headquartered in Tokyo, Japan.",
    "website": "http://www.comture.com",
    "zipcode": "141-0032"
  },
  "3908.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Collabos Corporation",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "COLLABOS CORPORATION",
    "state": null,
    "summary": "Collabos Corporation provides cloud-based call center systems. The company offers its cloud-based call center systems to corporations, including customer consultation offices and product inquiry centers. Its service includes COLLABOS PHONE, a softphone service for call centers. The company was founded in 2001 and is headquartered in Tokyo, Japan.",
    "website": "http://www.collabos.com",
    "zipcode": "131-0045"
  },
  "3919.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "PiPEDO HD, Inc.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "PIPEDO HD INC",
    "state": null,
    "summary": "PiPEDO HD, Inc. engages in the management of information asset platform in Japan. It provides various platforms, such as information asset, apparel specialized EC, cloud type groupware × CMS × SNS cooperation, call center, medical examination, social management, architectural information, and electronic regional currency platforms. The company is also involved in the provision of digital CRM business and BtoB marketing support services; contract of Web system development business, etc.; and construction, management, and consulting of EC site application, specialized in apparel fashion. In addition, it engages in advertising and human resource development agency business. PiPEDO HD, Inc. was founded in 2015 and is headquartered in Tokyo, Japan.",
    "website": "http://www.pipedohd.com",
    "zipcode": "107-0052"
  },
  "3920.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Internetworking and Broadband Consulting Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "INTERNETWORKING & BROADBAND CON",
    "state": null,
    "summary": "Internetworking and Broadband Consulting Co.,Ltd. engages in the development, sale, and support of network system performance monitoring tools in Japan. It is also involved in the performance assessment of network systems; design, construction, and consulting of network systems; and sale of various devices and software. In addition, the company offers consulting, design, and operation services for system infrastructure; and reporting services, including analyzing the performance of ICT services, such as network systems and servers. Internetworking and Broadband Consulting Co.,Ltd. was founded in 2002 and is headquartered in Tokyo, Japan.",
    "website": "http://www.ibc21.co.jp",
    "zipcode": "104-0033"
  },
  "3923.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Rakus Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "RAKUS CO LTD",
    "state": null,
    "summary": "Rakus Co., Ltd. provides cloud and IT engineer dispatch services in Japan. The company was founded in 2000 and is headquartered in Tokyo, Japan.",
    "website": "http://www.rakus.co.jp",
    "zipcode": "151-0051"
  },
  "3962.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Change Inc.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "CHANGE INC",
    "state": null,
    "summary": "Change Inc. provides IT human resources development training services in Japan. It offers training services utilizing libraries and basic technologies of various algorithms, such as artificial intelligence, robotics, voice internet, mobility, big data, cloud, cyber security, and new-IT transformation projects. The company was founded in 2003 and is headquartered in Tokyo, Japan.",
    "website": "http://www.change-jp.com",
    "zipcode": "105-0001"
  },
  "3968.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Segue Group Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "SEGUE GROUP CO LTD",
    "state": null,
    "summary": "Segue Group Co.,Ltd. provides design, construction, operation, and maintenance services related to IT infrastructure and network security products in Japan. It offers distribution; system integration; voice network, LAN environment, and BX environment construction; help desk support; human resources consulting; and training and educational services, as well as computer network equipment; and maintenance of computer, peripheral equipment, and communication equipment services. The company was incorporated in 2014 and is headquartered in Tokyo, Japan.",
    "website": "http://segue-g.jp",
    "zipcode": "104-0033"
  },
  "3970.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Innovation Inc.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "INNOVATION INC",
    "state": null,
    "summary": "Innovation Inc. provides B2B marketing strategy support services in Japan. The company offers online media and sales cloud services. It offers online media services, including IT Trend, a comparison site that offers information about IT products and services; and Biz Trend, a comparison site that offers information about business solutions for personnel in charge of human resources, general affairs, marketing, etc. The company also provides marketing automation service through List Finder, a B2B focused Web analytics tool; and online sales services through Sales Doc, an online sales tool. In addition, it offers Seminar Self, a seminar video platform. Innovation Inc. was founded in 2000 and is headquartered in Tokyo, Japan.",
    "website": "http://www.innovation.co.jp",
    "zipcode": "150-0002"
  },
  "3974.T": {
    "city": "Oyama",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "TBCSCAT Inc.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "TBCSCAT INC",
    "state": null,
    "summary": "TBCSCAT Inc. develops and sells IT solutions for beauty salons in Japan. The company's solutions include Sacla, a POS cash register customer management system for beauty salons; Salon Appli, a salon application; Mail Meister, an automatic manual mail delivery system; and Reservation Meister, a Web reservation system. Its solutions also comprise HairPota, a beauty salon search portal site; SBWEB for displaying medical record and reservation tables; and I-SCAP EX, an integrated strategy sales management system, as well as membership card issuance, enhanced security, and handwritten medical record system. In addition, the company offers finance and accounting services for SMEs. Further, it operates nursing homes with nursing care services. The company was founded in 1969 and is headquartered in Oyama, Japan.",
    "website": "http://www.tbcscat.jp",
    "zipcode": "323-0807"
  },
  "3979.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "ULURU.CO.,LTD.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "ULURU CO LTD",
    "state": null,
    "summary": "ULURU.CO.,LTD. provides crowd sourcing, BPO, data input substitution, and scanning service in Japan. It also offers bid information breaking service, garden navigation and kindergarten information service, and vacant house utilization portal services. ULURU.CO.,LTD. was founded in 2001 and is headquartered in Tokyo, Japan.",
    "website": "http://www.uluru.biz",
    "zipcode": "104-0053"
  },
  "3984.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "User Local, Inc.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "USER LOCAL INC",
    "state": null,
    "summary": "User Local, Inc. develops various analysis tools for website creators and marketers. The company engages in the research and development of big data analysis systems. It also provides Web marketing support tools under the User Insight name; social media analysis tools under the Social Insight name; and media analysis tools under the Media Insight name, as well as manages artificial intelligence chat bot. In addition, the company offers text mining, emotion and face recognition, future prediction, and automotive image processing AI services, as well as automatic summarization tools, AI comment systems, personal information anonymization filters, and duplicate aggregation tools. The company was incorporated in 2005 and is based in Tokyo, Japan.",
    "website": "http://www.userlocal.jp",
    "zipcode": "108-0014"
  },
  "3996.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Signpost Corporation",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "SIGNPOST CORPORATION",
    "state": null,
    "summary": "Signpost Corporation provides information technology related services for the customers primarily in the financial industry and public institutions. It offers financial consulting services, including information strategy, systemization concept, and business improvement for financial institutions, such as banks, securities companies, and card companies. The company also provides public consulting services for central government agencies and local governments, such as informatization policy planning/planning/implementation support; optimization support; review of budget system and support for optimizing procurement of information system; development project management support; and support for introducing social security/tax number system. In addition, it offers package solution, which includes business evaluation service, batch processing speedup, e electronic flight, open system foundation design checklist, and open standard system development standard, as well as Sales Advance Pro, a questionnaire function. Further, the company provides WonderChr, a cash register that is equipped with artificial intelligence. The company was founded in 2007 and is headquartered in Tokyo, Japan.",
    "website": "http://www.signpost1.com",
    "zipcode": "103-0023"
  },
  "4056.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Neural Pocket Inc.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "NEURAL POCKET INC",
    "state": null,
    "summary": "Neural Pocket Inc. develops and owns a range of proprietary AI technologies. Its AI technologies detect images and videos, classification, spatial awareness, body movement/behavior analysis, facial expression and viewing analysis, and others. The company offers its services for creation of smart cities, such as mobility and mobile object-related fields; facility and infrastructure-related fields; and people and object movement tracking and security-related fields. It also provides digital signage services for advertisers and advertising agencies, developers, railway operators, commercial facilities, and other businesses; and AI-driven fashion trend analysis service that offers information on fashion trends to analyze data from SNS sites, shopping sites, and other services. The company was formerly known as Fashion Pocket Inc. and changed its name to Neural Pocket Inc. in March 2019. Neural Pocket Inc. was founded in 2018 and is headquartered in Tokyo, Japan.",
    "website": "http://www.neuralpocket.com",
    "zipcode": "100-0006"
  },
  "4307.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Nomura Research Institute, Ltd.",
    "market": "jp_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "NOMURA RESEARCH INSTITUTE",
    "state": null,
    "summary": "Nomura Research Institute, Ltd. provides consulting, financial information technology (IT) solution, industrial IT solution, and IT platform service in Japan. Its Consulting segment offers management, operational, and system consulting services for enterprise and government agencies. This segment is also involved in the research, future projection, and recommendations related to society, economics, business, technology, etc. The company's Financial IT Solutions segment provides system consulting, development, and management solutions, as well as shared online services for the financial institutions, including the securities, insurance, banking, asset management, and other financial sectors. Its Industrial IT Solutions segment offers system consulting, development, and management solutions, as well as shared online services primarily for the distribution, manufacturing, service, and public sectors. The company's IT Platform Services segment engages in the data center operation activities and construction of platforms and networks to the Financial IT and Industrial IT Solutions segments, as well as provides IT platform solutions and information security services to external clients. This segment is also involved in research related to advance IT, etc. The company was founded in 1965 and is headquartered in Tokyo, Japan.",
    "website": "http://www.nri.com",
    "zipcode": "100-0004"
  },
  "4316.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "BeMap, Inc.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "BEMAP INC",
    "state": null,
    "summary": "BeMap, Inc. engages in the mobile system integration business in Japan. It offers systems for railways, including customized timetable and route search services, as well as allows railway service companies to provide users with information using content management system (CMS) Wi-Fi infrastructures. The company also develops and maintains CMS for Wi-Fi; Wi-Fi authentication systems that supports public wireless LAN services for telecommunication carriers; and platforms to enable the supply content services for Wi-Fi with location-based systems and smartphone applications. In addition, it provides systems for individuals to use a public wireless LAN at railway stations, airports, convenience stores, and other places through telecommunication carriers and railway operators; and cloud-based digital video recording services. Further, the company offers SmartPush, an online advertising platform for area marketing; 02020, an on-air to online to offline solution; TV metadata, which offers descriptive information about TV programs that includes title, storyline, cast, genre, release date, images, featured products/companies/shops, and others; and Website/software development services. BeMap, Inc. was incorporated in 1998 and is based in Tokyo, Japan.",
    "website": "http://www.bemap.co.jp",
    "zipcode": "101-0047"
  },
  "4348.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Infocom Corporation",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "INFOCOM CORPORATION",
    "state": null,
    "summary": "Infocom Corporation provides IT solutions and services to medical institutions, regular corporations, public agencies, educational institutions, and research facilities in Japan. The company offers system planning, operation, and management development services for mobile service providers, enterprises, medical institutions, public offices, and research organizations. It also provides health IT solutions for radiology, pharmaceuticals, and other fields for medical institutions. In addition, the company offers enterprise service management, which provides IT services and solutions in planning, information systems development, operations, and maintenance for groups, communication providers, and other customers. Further, the company offers GRANDIT, a Web based ERP; and Emergency Call, an emergency contact and safety confirmation system, as well as operates Mecha Comic, an e-comic distribution service. The company was founded in 1983 and is headquartered in Tokyo, Japan. Infocom Corporation is a subsidiary of Teijin Limited.",
    "website": "http://www.infocom.co.jp",
    "zipcode": "150-0001"
  },
  "4394.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "eXmotion Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "EXMOTION CO LTD",
    "state": null,
    "summary": "eXmotion Co., Ltd. provides technical consulting and education services for systems and software. It offers project diagnosis and site support services; and practical courses to acquire skilled skills that can be used on site. In addition, the company provides eXquto, a diagnostic tool for C language that diagnoses software design and implementation quality; MODEL EVALUATOR, a tool to diagnose the quality of MATLAB/Simulink model; and Mtrip, a tool for mutually converting an architectural design model described in a general-purpose modeling language. eXmotion Co., Ltd. was founded in 2008 and is headquartered in Tokyo, Japan.",
    "website": "http://www.corporate.exmotion.co.jp/",
    "zipcode": "141-0032"
  },
  "4421.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "D. I. System Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "D I SYSTEM CO LTD",
    "state": null,
    "summary": "D. I. System Co., Ltd. provides information security consulting services. The company offers system development, network and platform construction, Microsoft, enhanced security, sales/service outsourcing, IT education/qualification acquisition, and stress check solutions. It also provides e-learning system, framework and workflow, Web performer, and targeted mail training services. The company was founded in 1997 and is headquartered in Tokyo, Japan.",
    "website": "http://www.di-system.co.jp",
    "zipcode": "164-0001"
  },
  "4427.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "EduLab, Inc.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "EDULAB INC",
    "state": null,
    "summary": "EduLab, Inc., together with its subsidiaries, researches and develops academic ability measurement technologies and educational tools in Japan and internationally. The company provides test and study services primarily for language learning educational institutions, including universities, private companies, and individuals. It also offers Einavi! and StudyGear, an online service that supports learners preparing for the test in practical English proficiency; Eiken Jr., an English-language education and testing program for preschool and elementary school children; TEAP CBT; an English proficiency test for reading, writing, listening, and speaking; computerized assessment system for English communication (CASEC), an English proficiency test that utilizes item response theory and computer-adaptive testing technologies; and speaking test systems for Eiken grade 4 and 5, online Eiken enrollment and various fee payment solution, as well as support systems for Eiken group enrollment. The company was founded in 2015 and is headquartered in Tokyo, Japan.",
    "website": "http://www.edulab-inc.com/",
    "zipcode": "150-0043"
  },
  "4442.T": {
    "city": "Osaka",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Valtes Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "VALTES CO LTD",
    "state": null,
    "summary": "Valtes Co., Ltd. offers testing services to products and processes. The company provides software and content testing, and software testing consultation services. It offers testing services for software, Web and smart phone applications, and social games. The company also provides digital broadcasting, functional operation, stream reception, digital broadcast receiver record, and multimedia broadcast testing services; and test stream creation and sales, test center, equipment, and device services for digital broadcast receivers. In addition, it offers testing services for digital multifunction office machines, as well as digital cameras. The company was founded in 2004 and is headquartered in Osaka, Japan.",
    "website": "http://www.valtes.co.jp",
    "zipcode": null
  },
  "4444.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "infoNet inc.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "INFONET INC",
    "state": null,
    "summary": "infoNet inc. engages in the Website and CMS site construction activities in Japan. It is also involved in the system development Hosting and ASP service activities; and advertisement design/printing video production activities. The company was founded in 2002 and is headquartered in Tokyo, Japan.",
    "website": "http://www.e-infonet.jp",
    "zipcode": "1100-0004"
  },
  "4498.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Cybertrust Japan Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "CYBERTRUST JAPAN CO LTD",
    "state": null,
    "summary": "Cybertrust Japan Co., Ltd. engages in the certification authority and security, IoT, and Linux/OSS businesses in Japan. It offers commercial digital authentication services covering SSL/TLS server certificate, client certificate, web security service, and vulnerability testing; secure IoT platform that allow users to manage the security status of IoT devices throughout their lifecycle from the semiconductor design to the disposal process stage; and Linux OS/integrated monitoring tool and backup software services. The company was founded in 2000 and is headquartered in Tokyo, Japan.",
    "website": "http://www.cybertrust.co.jp",
    "zipcode": "106-0032"
  },
  "4674.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Cresco Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "CRESCO LTD",
    "state": null,
    "summary": "Cresco Ltd., together with its subsidiaries, provides various services in the fields of application development, IT infrastructure system architecture, and embedded systems in Japan. The company offers software and systems design, development, and consulting services; ERP consulting services; hardware design and development/prototyping services; data processing services; and design and development support services through system consulting related to control and embedding technologies, as well as cloud and Web design services. It is also involved in the development of add-on applications, and mainframe and open systems; consulting, design, deployment, and development of computer systems; and construction of server infrastructure. The company was founded in 1988 and is headquartered in Tokyo, Japan.",
    "website": "http://www.cresco.co.jp",
    "zipcode": "108-6026"
  },
  "4699.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Uchida Esco Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "UCHIDA ESCO CORP",
    "state": null,
    "summary": "Uchida Esco Co., Ltd. operates as a software development company in Japan. It provides hardware maintenance and office services, as well as integrated network services. The company was founded in 1972 and is headquartered in Tokyo, Japan.",
    "website": "http://www.esco.co.jp",
    "zipcode": null
  },
  "4733.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "OBIC Business Consultants Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "OBIC BUSINESS CONSULTANT",
    "state": null,
    "summary": "OBIC Business Consultants Co., Ltd. develops and sells business and information technology solutions in Japan. The company offers packaged software for business systems. It also provides maintenance and introduction guidance services. The company was founded in 1980 and is based in Tokyo, Japan.",
    "website": "http://www.obc.co.jp",
    "zipcode": "163-6032"
  },
  "4739.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "ITOCHU Techno-Solutions Corporation",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "ITOCHU TECHNO-SOLUTIONS CORP",
    "state": null,
    "summary": "ITOCHU Techno-Solutions Corporation engages in the sale, maintenance, and support of computers and network systems, software development, and data center and support services in Japan, Asia, and internationally. The company operates through six segments: Enterprise Business, Distribution Business, Telecommunication Business, Regional and Social Infrastructure Business, Financial Services Business, and IT Services Business. It offers information processing; information services-related to science and engineering; system maintenance and support services, including assembly, transfer, and installation of equipment, as well as 24-hour maintenance and systems operation services; and IT engineer training services. The company also provides IT infrastructure construction services; IT systems, infrastructure, business and applications, and data centers operation and management services; ERP-related software development and maintenance services; satellite communications and broadcasting operation services; cloud services; and application development services. In addition, it offers sale of network and security-related equipment, storage-related devices, and software and other peripheral devices, as well as provision of related consulting, deployment/building, and support services; and building facility operations management activities for computer centers. Further, the company is involved in the exportation of IT products; resale of hardware and software; planning, production, and maintenance of web content; planning and production of advertising media; and information gathering, research, and marketing activities. It serves telecommunication, finance, retail and distribution, public sectors and utilities, manufacturing, and information and communications industries, as well as educational and research institutions. The company was founded in 1972 and is headquartered in Tokyo, Japan. ITOCHU Techno-Solutions Corporation is a subsidiary of ITOCHU Corporation.",
    "website": "http://www.ctc-g.co.jp",
    "zipcode": "100-6080"
  },
  "4743.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "ITFOR Inc.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "ITFOR INC",
    "state": null,
    "summary": "ITFOR Inc. provides support services for the implementation of information technology in Japan. It develops solutions comprising consulting, system configuration, customer specific solution development, operation, and management for network security. The company also offers financial solution systems, such as credit collection, loan assessment management, scoring, collecting, tele-marketing, and local governments systems; CTI systems that offer call-center productivity enhancements; consultation and installation of open platform for retail service customers; and e-commerce systems. In addition, it provides network systems, including corporate infrastructure network, backbone network consultation and design, IP services, edge solutions for telecom carriers, network security solutions, and personal information management; and professional and consultation services, as well as customer services. The company was formerly known as CJK Co. Ltd. and changed its name to ITFOR Inc. in 2000. ITFOR Inc. was founded in 1972 and is headquartered in Tokyo, Japan.",
    "website": "http://www.itfor.co.jp",
    "zipcode": "102-0082"
  },
  "4752.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Showa System Engineering Corporation",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "SHOWA SYSTEM ENGINEERING",
    "state": null,
    "summary": "Showa System Engineering Corporation engages in the development, operation, and consulting of information systems. It also offers system integration and BPO entry services. The company serves customers in a range of industries comprising finance, manufacturing, distribution, and service industries. Showa System Engineering Corporation was founded in 1966 and is headquartered in Tokyo, Japan.",
    "website": "http://www.showa-sys-eng.co.jp",
    "zipcode": "103-0001"
  },
  "4761.T": {
    "city": "Kobe",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "SAKURA KCS Corporation",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "SAKURA KCS",
    "state": null,
    "summary": "SAKURA KCS Corporation provides information technology services in Japan. The company offers various consulting services, such as privacy mark acquisition support, ISMS acquisition certification, information security structure construction, system audit, software asset management implementation, cyber-attack countermeasure support, system support, and system consulting services. It also provides system integration services; industry and business solutions; information and communication technology infrastructure solutions for the support of information system; and business process outsourcing services, as well as offers data centers. SAKURA KCS Corporation was founded in 1969 and is headquartered in Kobe, Japan.",
    "website": "http://www.kcs.co.jp",
    "zipcode": "650-0036"
  },
  "4813.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Access Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "ACCESS CO LTD",
    "state": null,
    "summary": "Access Co., Ltd. provides mobile and network software technologies to telecom carriers, consumer electronics manufacturers, broadcasting and publishing companies, automotive industry, and energy infrastructure providers worldwide. It offers NetFront Browser BE, an advanced HTML5 browser for smart TV, STB, game consoles, and automotive in-vehicle infotainment systems; NetFront Browser NX, a WebKit-based HTML5 browser; Browser SDKs for HbbTV and UK freeview play; embedded automotive platforms HTML engine; and chromium blink based HTML engine for automotive. The company also provides IoT devices, such as human to machine interface engines for LCD touch panels and IoT gateway products; multiscreen products, including 360° smart media platform for operators and content owners; content service and software solutions for connected car infotainment; multiscreen media sharing solutions for consumer electronic devices and home networks; and media sharing and playback solutions for automotive manufacturers and consumer electronic companies. In addition, it offers digital publishing platforms for digital content distribution; PUBLUS Reader, an EPUB viewer; and PUBLUS Lite, a cloud-based electronic text delivery system. Further, the company provides network OS for white box systems; VirNOS, a cutting-edge virtual software platform for mobile operators and corporate data centers; and ZebOS, a middleware for network devices. Access Co., Ltd. was founded in 1979 and is headquartered in Tokyo, Japan.",
    "website": "http://www.access-company.com",
    "zipcode": "101-0022"
  },
  "4814.T": {
    "city": "Osaka",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Nextware Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "NEXTWARE",
    "state": null,
    "summary": "Nextware Ltd. provides IT consulting services in Japan. The company is involved in the computer system design and software development activities; rental, sale, import, and export of computers and its peripherals; operational management and support of computer systems; and computer system consulting business. It also engages in consulting and management, events planning and operation contracting, and damages insurance agency businesses. The company was founded in 1990 and is headquartered in Osaka, Japan.",
    "website": "http://www.nextware.co.jp",
    "zipcode": null
  },
  "4819.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Digital Garage, Inc.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "DIGITAL GARAGE",
    "state": null,
    "summary": "Digital Garage, Inc. operates as a context company in Japan and internationally. The company operates through Financial Technology, Marketing Technology, Incubation Technology, and Long-term Incubation segments. The Financial Technology segment provides payment platforms, including credit card payment, convenience store payment, and QR code payment systems. The Marketing Technology segment provides marketing solutions that integrate digital and real solutions. The Incubation Technology segment invests in early-stage startups and later-stage businesses in the United States, Japan, and Asia. The Long-term Incubation segment provides medium- to long-term cash inflows. Digital Garage, Inc. was founded in 1995 and is headquartered in Tokyo, Japan.",
    "website": "http://www.garage.co.jp/en/",
    "zipcode": "150-0022"
  },
  "4824.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "MEDIASEEK,inc.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "MEDIASEEK INC",
    "state": null,
    "summary": "MEDIASEEK, inc. provides system development consulting services in Japan. The company offers IT support consulting, system construction, system support services, etc. It also provides package solutions, including My Class, a management system for school management; GatePass, a solution for events; and MADO, a video distribution solution for smartphones. In addition, the company offers content development, distribution, and management services to consumers. MEDIASEEK, inc. was founded in 2000 and is based in Tokyo, Japan.",
    "website": "http://www.mediaseek.co.jp",
    "zipcode": "106-0047"
  },
  "6182.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Rozetta Corp.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "ROZETTA CORPORATION",
    "state": null,
    "summary": "Rozetta Corp. develops and administers AI translation services. It offers automatic and professional translation services; wearable devices; and quality evaluation and AI learning data creation Services. It also provides consulting, advisory, and development support services for RPA; crowdsourcing services; translation and interpretation services; and corporate in-house language training services. The company was founded in 2004 and is headquartered in Tokyo, Japan.",
    "website": "http://www.rozetta.jp",
    "zipcode": "163-6023"
  },
  "6188.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Fujisoft Service Bureau Incorporated",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "FUJI SOFT SERVICE BUREAU INC",
    "state": null,
    "summary": "Fujisoft Service Bureau Incorporated provides business process outsourcing services in Japan. It also offers office support services, such as temporary staffing, strategic team dispatch, referral scheduled dispatch, and recruitment services; and contact center and web content and system support services. The company was founded in 1984 and is headquartered in Tokyo, Japan. Fujisoft Service Bureau Incorporated is a subsidiary of Fuji Soft Incorporated.",
    "website": "http://www.fsisb.co.jp",
    "zipcode": "130-0022"
  },
  "6193.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Virtualex Holdings, Inc.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "VIRTUALEX HOLDINGS INC",
    "state": null,
    "summary": "Virtualex Holdings, Inc. provides consulting and outsourcing services in Japan and internationally. The company offers CRM solutions and services, including CRM consulting for sales process transformation, sales channel transformation, business process design and implementation, change management, and SFA and CRM system implementation; IT solutions for multi-channel CRM systems, DWH, BI solutions, EC systems, and reservation systems; and BPO solutions for non-face-to-face sales centers, customer centers, and back-office centers. It also provides BPO solutions and services comprising contact center BPO, data entry BPO, and application operation and maintenance/system operation and maintenance services. In addition, the company offers contact center solutions and services that include inspirX platform, an application in CRM that provides customer, marketing, and contents database functions for contact center operations; and contact center BPO service, which provides supports for contact center operation and its system operation with focus on customer contact point, as well as inspirX contact center application. Further, it provides marketing solutions and services, which comprise EC/mail order business consultation, system design, and business fulfillment services; and time to market (TTM) solutions and services, including TTM consulting, development, offshore system development, and BPO services. Additionally, the company offers BPM solutions and services, such as BPM consulting, system design, and business template applicable design services. The company was formerly known as Virtualex Consulting, Inc. and changed its name to Virtualex Holdings, Inc. in October 2017. The company was founded in 1999 and is headquartered in Tokyo, Japan. Virtualex Holdings, Inc. is a subsidiary of Simplex, Inc.",
    "website": "http://www.virtualex.co.jp",
    "zipcode": "105-0001"
  },
  "6199.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "SERAKU Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "SERAKU CO LTD",
    "state": null,
    "summary": "SERAKU Co., Ltd., a business support company, provides internet solutions. It offers IT infrastructure cloud technology solutions, smartphone applications and web system development services, web marketing communication, IoT platform, and IT agriculture solutions. The company was founded in 1987 and is headquartered in Tokyo, Japan.",
    "website": "http://www.seraku.co.jp",
    "zipcode": "160-0023"
  },
  "6532.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "BayCurrent Consulting, Inc.",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "BAYCURRENT CONSULTING INC",
    "state": null,
    "summary": "BayCurrent Consulting, Inc. provides consulting services in Japan. The company provides engaged in designing and implementing strategy/business strategy, globalization, m&a/jv/alliances, innovation/new business development, turn-around, innovation/new business development, overseas expansion, global resource utilization, global governance design, change towards capturing inbound demand, marketing and sales strategy, and business due diligence.It offers DX-based high level planning, digital department launch, blockchain utilization, business model DX, designing thinking/agile operations, digital marketing, AI/IoT implementation, DX strategy/roadmap formulation, digital human resource development, fintech/insurtech, operation DX, and lean start-ups services. Additionally, the company provides procurement cost reduction, business process re-engineering, supply chain management, customer relationship management, risk management, value chain transformation, governance/management design, operation reform/standardization, and leadership training services. Further, it offers IT strategy, IT governance, IT cost optimization, IT organizational improvement, IT talent development, PMO, IT architecture, system design/ development, and IT asset evaluation services. The company serves financial, high-tech/telecommunication, media/entertainment, industrial/distribution/retail, health care, energy, and public sector industries. BayCurrent Consulting, Inc. was founded in 1998 and is based in Tokyo, Japan.",
    "website": "http://www.baycurrent.co.jp",
    "zipcode": "105-6309"
  },
  "6541.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Grace Technology, Inc.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "GRACE TECHNOLOGY INC",
    "state": null,
    "summary": "Grace Technology, Inc. engages in the creation and translation of technical documents, including product manuals for domestic and overseas IT-related manufacturers and various domestic manufacturers in Japan. It is also involved in the operation of e-manual, a cloud service for the creation and management of manuals; consulting works related to various documents, including manuals; production of internal management manuals; and provision of hardware and software agency services. The company was founded in 2000 and is headquartered in Tokyo, Japan.",
    "website": "http://www.g-race.com",
    "zipcode": "105-0001"
  },
  "6553.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "SoldOut, Inc.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "SOLDOUT INC",
    "state": null,
    "summary": "SoldOut, Inc. provides digital marketing support services to small and medium-sized venture companies in Japan. The company offers promotion tools, as well as Internet advertisement operation services for advertising companies; corporate branding, EC support and sales agency, online web promotion support, and digital marketing information services; and human resource development support services, including digital marketing specialized human resource development, crowdsourcing, recruitment support, digital marketing recruitment, Web marketing personnel recruitment information, and direct recruiting implementation and operation support services. It also operates ZIP, a social advertising platform; and supports the development and introduction of IT tools for streamlining and automating tasks that arise when raising sales through digital marketing. The company was founded in 2009 and is headquartered in Tokyo, Japan. SoldOut, Inc. is a subsidiary of Digital Holdings, Inc.",
    "website": "http://www.sold-out.co.jp",
    "zipcode": "112-0004"
  },
  "6701.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "NEC Corporation",
    "market": "jp_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "NEC CORP",
    "state": null,
    "summary": "NEC Corporation operates as a provider of information and communication technology solutions in Japan and internationally. The company operates in six segments: Public Solutions, Public Infrastructure, Enterprise, Network Services, System Platform, and Global. It provides systems integration services, such as systems implementation and consulting; maintenance and support services; outsourcing and cloud services; and system equipment. The company also offers network infrastructure products, including core network equipment, mobile phone base stations, optical transmission systems, and routers and switches; wireless LAN routers; and enterprise network solutions comprising IP telephony systems, WAN/wireless access equipment, and LAN products. In addition, it provides hardware products, such as servers, mainframes, supercomputers, storage products, business and personal computers, point-of-sale systems, automatic teller machines, control equipment, and wireless LAN routers; software products, including integrated operation management, middleware, and security and database software; and maintenance services. Further, the company offers software services for service providers consisting of operation support system/business support system, software-defined networking, and network functions virtualization; submarine systems comprising submarine cable and ocean observation systems; wireless backhaul solutions; displays and projectors; and energy storage solutions. It serves aerospace, defense, media, manufacturing, retail, financial, and telecommunication industries, as well as government entities, medical institutions, and medium-sized enterprises. NEC Corporation has collaboration with Analog Devices, Inc. to provide 5G O-RAN Massive MIMO Radio for Rakuten Mobile. The company was formerly known as Nippon Electric Company, Limited and changed its name to NEC Corporation in April 1983. NEC Corporation was founded in 1899 and is headquartered in Tokyo, Japan.",
    "website": "http://www.nec.com",
    "zipcode": "108-8001"
  },
  "6702.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Fujitsu Limited",
    "market": "jp_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "FUJITSU",
    "state": null,
    "summary": "Fujitsu Limited operates as an information and communication technology (ICT) company in japan and internationally. The company operates through Technology Solutions, Ubiquitous Solutions, and Device Solutions segments. The Technology Solutions segment offers system integration services, including system construction and business applications; consulting services; front-end technologies comprising ATMs, point-of-sale systems, etc.; and outsourcing services, such as datacenters, ICT and application operation/management, SaaS, business process outsourcing, etc. This segment also provides network services, such as business network, etc.; cloud services; system support services comprising maintenance and surveillance services for information systems and networks; and security solutions that include information systems and networks installation. In addition, it offers system products, such as servers, storage systems, and operating system and middleware software; and network management and optical transmission systems, and mobile phone base stations. The Ubiquitous Solutions segment provides personal computers and mobile phones. The Device Solutions segment offers LSI devices for digital consumer electronics, automobiles, mobile phones, and servers; and electronic components, such as semiconductor packages, batteries, optical transceiver modules, printed circuit boards, relays, connectors, etc. The company also provides infrastructure, industry, and business and technology solutions. It serves automotive, manufacturing, retail, financial services, transport, telecommunications, and healthcare industries; the public sectors; and services providers. The company has strategic partnership with NetApp for enhancing data management infrastructure. Fujitsu Limited was founded in 1923 and is headquartered in Tokyo, Japan.",
    "website": "http://www.fujitsu.com",
    "zipcode": "105-7123"
  },
  "6888.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Acmos Inc.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "ACMOS INC",
    "state": null,
    "summary": "Acmos Inc., together with its subsidiaries, provides information technology (IT) solutions and services in Japan. The company offers IT infrastructure/building, system integration, and software development services, as well as system development, operation, and maintenance services. It also provides construction and maintenance of server environments and networks, and security related diagnosis services; back up services; business systems for enterprises, IT solutions for local government, space related systems, and fire-fighting communication command systems; consulting, system construction, operation management, and other services; and map related information and systems. In addition, the company offers data utilization solutions, such as university classroom evaluation questionnaire and campaign secretariat, as well as outsource services. It provides its services to clients in local governments, space, automobile, security, and medical sectors. Acmos Inc. was founded in 1991 and is headquartered in Tokyo, Japan.",
    "website": "http://www.acmos.co.jp",
    "zipcode": "101-0052"
  },
  "6942.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Sophia Holdings Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "SOPHIA HOLDINGS CO LTD",
    "state": null,
    "summary": "Sophia Holdings Co.,Ltd., through its subsidiaries, engages in the Internet related business in Japan and internationally. The company is involved in the planning, design development, business contracting, and consultation of Web services; provision of solutions across various data centers, hardware, software, contents, and business categories. It also operates as mobile virtual network operator; and provides Esmobi SIM for data for corporations and organizations with voice services. In addition, the company provides support services for start-up operations and management services to healthcare institutions and dispensing pharmacies; offers consultation on medicine or illness; and develops and sells security-related software. Further, it is involved in the provision of hosting services; planning and production of Website, Web system application development, and others; and development of RIMS, a cloud based real estate information management system. Additionally, the company plans and manages Mobpe, a pet information site. It also involved in the health and nursing care, and genetic information services businesses. The company was formerly known as Sophia Systems Co., Ltd. and changed its name to Sophia Holdings Co.,Ltd. in April 2007. Sophia Holdings Co.,Ltd. was founded in 1975 and is based in Tokyo, Japan.",
    "website": "http://www.sophia.com",
    "zipcode": "222-0033"
  },
  "6WJ.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "MEDIASEEK,inc.",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "MEDIASEEK INC.",
    "state": null,
    "summary": "MEDIASEEK, inc. provides system development consulting services in Japan. The company offers IT support consulting, system construction, system support services, etc. It also provides package solutions, including My Class, a management system for school management; GatePass, a solution for events; and MADO, a video distribution solution for smartphones. In addition, the company offers content development, distribution, and management services to consumers. MEDIASEEK, inc. was founded in 2000 and is based in Tokyo, Japan.",
    "website": "http://www.mediaseek.co.jp",
    "zipcode": "106-0047"
  },
  "7046.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Tecnos Data Science Engineering Incorporated",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "TECNOS DATA SCI ENG INC",
    "state": null,
    "summary": "Tecnos Data Science Engineering Incorporated primarily provides consulting services on information processing and computer systems in Japan. The company offers DX and analytics consulting, SNS analysis, analysis base construction, and analysis operation and application development services; and IoT data utilization, learning utilization, and data scientist development support services. It also provides Scorobo, an artificial intelligence engine for use in finance, digital marketing, manufacture, social infrastructure, human resources, and telematics industries; and NetBase, a social listening tool for enterprise social analytics. Tecnos Data Science Engineering Incorporated was formerly known as Technos Data Science & Engineering Co., Ltd. and changed its name to Tecnos Data Science Engineering Incorporated in April 2016. The company was founded in 2013 and is based in Tokyo, Japan.",
    "website": "http://www.tdse.jp",
    "zipcode": "163-1427"
  },
  "7060.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "geechs inc.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "GEECHS INC",
    "state": null,
    "summary": "geechs Inc., together with its subsidiaries, engages in IT human resources, games, video, and Internet businesses. It offers IT human resources; and IT freelance platform search site; various games for smartphones, as well as develops videos on various platforms, such as AR, VR, MR, Hologram, etc. It also operates Gridge, a golf specialty information site. The company was founded in 2007 and is headquartered in Tokyo, Japan.",
    "website": "http://geechs.com",
    "zipcode": "150-0043"
  },
  "7072.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Intimate Merger, Inc.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "INTIMATE MERGER INC",
    "state": null,
    "summary": "Intimate Merger, Inc. develops and sells data management platforms for marketing companies. The company was founded in 2013 and is based in Tokyo, Japan. Intimate Merger, Inc. is a subsidiary of FreakOut Holdings, inc.",
    "website": "http://corp.intimatemerger.com",
    "zipcode": "106-0032"
  },
  "7093.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "adish Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "ADISH CO LTD",
    "state": null,
    "summary": "adish Co., Ltd. provides Internet monitoring and social media management solutions in Japan and internationally. It also offers cyberbullying prevention, customer support, localization, customer activation, and chatbot services. The company was founded in 2014 and is headquartered in Tokyo, Japan.",
    "website": "http://www.adish.co.jp",
    "zipcode": "141-0031"
  },
  "7505.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Fuso Dentsu Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "FUSO DENTSU CO LTD",
    "state": null,
    "summary": "Fuso Dentsu Co., Ltd. engages in the information and communication technology (ICT) business in Japan. The company offers IT solutions in the areas of printing, network, communication, cloud, digital signage, and information security; operation/maintenance, application development, and telephone operation management support services; procurement of indirect materials; and facilities and ICT foundation construction services. It also provides business IT solutions for the healthcare, government agency municipality, education, energy saving, airport, corporate, sales, sales management, accounting, human resources, design and manufacture, rice wholesale, production control, logistics, distribution transportation, retail store facility, hotel, medical/welfare, consulting, big data, and region creation industries. The company operates a network of 54 branches. Fuso Dentsu Co., Ltd. was founded in 1948 and is headquartered in Tokyo, Japan.",
    "website": "http://www.fusodentsu.co.jp",
    "zipcode": "104-0045"
  },
  "7595.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "ARGO GRAPHICS Inc.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "ARGO GRAPHICS",
    "state": null,
    "summary": "ARGO GRAPHICS Inc. provides technical solutions in Japan. The company provides PLM solutions to organize elements related to product development; HPC solutions that enable processing of technical calculations through system design/construction; and IT solutions, which offer virtualization of server/client, server/storage consolidation, and IT infrastructure. It also provides a range of services to support its clients, including consulting for improving operations; system development for process construction; system realization/construction; and training/operational support. In addition, the company offers CAE analysis, analysis tool development, engineering experimentation and measurement, 3D CAD modeling, engineer education, and customer support services; human resource, computer system operation, and data entry services; and system development, IT hardware sales and consulting, and IT services. Further, it engages in the DTP software sale and system integration, quality management software sale, document management software development and sale, and implementation of information sharing system; architecture and sale of the system for scientific computation; computer cluster sale and development support; and sale and support of 2D CAD software and 3D design CAD. Additionally, the company is involved in the development and sale of support software for power semiconductor and liquid crystal panel development; PDM software development, sale, and construction support; development and sale of CAM data of press die; production and sale of engineering animations; and provision of development support for IT infrastructure, and manufacturing processes and related services. ARGO GRAPHICS Inc. was founded in 1985 and is headquartered in Tokyo, Japan.",
    "website": "http://www.argo-graph.co.jp",
    "zipcode": "103-0015"
  },
  "7671.T": {
    "city": "Osaka",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "AmidA Holdings Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "AMIDA HOLDINGS CO LTD",
    "state": null,
    "summary": "AmidA Holdings Co.,Ltd. engages in digital marketing, Internet media, and Web and IT consulting businesses in Taiwan. The company was founded in 1998 and is headquartered in Osaka, Japan.",
    "website": "http://www.amida.co.jp",
    "zipcode": "510-0004"
  },
  "8056.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Nihon Unisys, Ltd.",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "NIHON UNISYS",
    "state": null,
    "summary": "Nihon Unisys, Ltd. provides information technology (IT) solutions in Japan. The company operates through five segments: System Services, Support Services, Outsourcing, Software, and Hardware. It offers contracted software development; technology support and ICT strategy consulting services; and support services, such as software and hardware maintenance, and installation support. The company also engages in the sale and rental of computer and network systems; and cloud computing and outsourcing businesses. In addition, it provides CRM/customer channel, business intelligence, SRM/electronic purchasing, SCM/logistics, energy management/environment, office communication, enterprise education, ERP/enterprise resource management, and regional revitalization solutions. Further, the company offers ICT infrastructure solutions and services; hardware, middleware, and related services; and business process restructuring, ICT visualization, construction, implementation, maintenance, operation, and training services. It provides solutions for various industries, including financial services, engineering, distribution, transportation, central and local governments, healthcare, leasing, telecommunications, media, education, and social insurance. Nihon Unisys, Ltd. was founded in 1947 and is headquartered in Tokyo, Japan.",
    "website": "http://www.unisys.co.jp",
    "zipcode": "135-8560"
  },
  "8096.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Kanematsu Electronics Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "KANEMATSU ELECTRONICS",
    "state": null,
    "summary": "Kanematsu Electronics Ltd. designs and implements information systems, and provides operation and consulting services for businesses based on information technologies in Japan. It also retails, leases, maintains, and develops IT system products and software. The company offers document solutions that process large amounts of data amassed by companies; storage solutions that provide sharing and applying of information; network solutions, which design, construct, operate, and maintain network-system infrastructures; and engineering solutions. Its solutions include supply chain management systems and business integration solutions. The company was founded in 1968 and is headquartered in Tokyo, Japan. Kanematsu Electronics Ltd. is a subsidiary of Kanematsu Corporation.",
    "website": "http://www.kel.co.jp",
    "zipcode": "104-8338"
  },
  "8226.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Rikei Corporation",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "RIKEI CORPORATION",
    "state": null,
    "summary": "Rikei Corporation, together with its subsidiaries, engages in the system and network solutions, and electronic components and instrument businesses in Japan and internationally. It provides system solutions, including infrastructure platforms, information security, 3-D CAD, entrance exam and curriculum systems, virtual reality, and digital marketing for private firms, manufacturers, universities, government offices, and research institutions. The company offers network solutions for information transfer and distribution for broadcasters and communication operators; and electronic components, instruments, and functional materials for various sectors comprising industrial machinery, electric power, automobiles, medical care, and defense. In addition, it engages in the sale and lease of aircraft and aircraft parts; system development activities; and export, import, and sale of electronic products. The company was formerly known as Rikei Trading Co., Ltd. and changed its name to Rikei Corporation in June 1971. Rikei Corporation was founded in 1957 and is headquartered in Tokyo, Japan.",
    "website": "http://www.rikei.co.jp",
    "zipcode": "163-0535"
  },
  "8275.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Forval Corporation",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "FORVAL CORP",
    "state": null,
    "summary": "Forval Corporation provides information telecommunications consulting services to small-and medium-sized companies in Japan. It also offers management consulting services. Forval Corporation was founded in 1980 and is headquartered in Tokyo, Japan.",
    "website": "http://www.forval.co.jp",
    "zipcode": "150-0001"
  },
  "9360.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Suzuyo Shinwart Corporation",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "SUZUYO SHINWART CORP",
    "state": null,
    "summary": "Suzuyo Shinwart Corporation operates as an information services company. The company's activities include computer software contract development and development support; support for introduction of software products and add-on development; and outsourcing business, primarily based on personnel salary; and data center and cloud service business. It offers S-Port data center and cloud services; STAFFBRAIN personnel, salary, and employment services; S-PAYCIAL salary outsourcing services; online storage; POSITIVE, an integrated human capital management solution; groupware solutions; expense management solutions; SuperStream management platform soltuion; HeartCore CMS services; Web mail solutions; and Cyber mail solutions. The company also provides system construction and development, and network construction services, as well as logistics consulting services. Suzuyo Shinwart Corporation was founded in 1947 and is headquartered in Tokyo, Japan.",
    "website": "http://www.shinwart.co.jp",
    "zipcode": "108-0014"
  },
  "957.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "DIGITAL HEARTS HOLDINGS Co., Ltd.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "DIGITAL HEARTS",
    "state": null,
    "summary": "DIGITAL HEARTS HOLDINGS Co., Ltd., together with its subsidiaries, engages in debugging, media, and other businesses. It operates 4Gamer.net, a gaming site that gathers new and original coverage of games and related information, as well as publishes news and distributes movies, free trials, weekly publications, and other content. The company also provides support services for the creation of content, including game development, CG video creation, etc. In addition, it offers debug testing and reporting services for the consumer games, mobile and online games, arcade games, etc.; testing services for IT-related software, including websites and operations systems; solutions for development of AI application and testing automation; consultation for Website or systems for end users; and security services. The company was formerly known as Hearts United Group Co., Ltd. and changed its name to DIGITAL HEARTS HOLDINGS Co., Ltd. in July 2018. DIGITAL HEARTS HOLDINGS Co., Ltd. was founded in 2001 and is headquartered in Tokyo, Japan.",
    "website": "http://www.digitalhearts-hd.com",
    "zipcode": "163-1441"
  },
  "9658.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Business Brain Showa-Ota Inc.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "BUSINESS BRAIN SHOWA OTA INC",
    "state": null,
    "summary": "Business Brain Showa-Ota Inc. provides system development and IT solutions in Japan. The company offers consulting, work restructuring, system development, system integration and sustainment services. It also provides managed services based on specialized human resources, such as certified accountants, certified tax accountants, social insurance consultants, and SEs; and BPO solutions in the field of accounting, finance, HR, payroll, labor, and IT. Business Brain Showa-Ota Inc. was founded in 1967 and is headquartered in Tokyo, Japan.",
    "website": "http://www.bbs.co.jp",
    "zipcode": "105-0003"
  },
  "9709.T": {
    "city": "Osaka",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "NCS&A Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "NCS&A CO LTD",
    "state": null,
    "summary": "NCS&A Co., Ltd. provides various IT services in Japan. It offers system development and construction services, as well as sells system equipment. The company also provides platform solutions, including visualization, business, and security solutions; migration, outsourcing, cloud, and AI tools and services; and geospatial information software, etc. In addition, it offers industry/task solutions for financial and medical services, public sector, manufacturing, distribution, hotel/restaurant, nursing care, etc. NCS&A Co., Ltd. was founded in 1961 and is headquartered in Osaka, Japan.",
    "website": "http://ncsa.jp",
    "zipcode": "540-6316"
  },
  "9715.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "transcosmos inc.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "TRANSCOSMOS INC",
    "state": null,
    "summary": "transcosmos inc. provides business outsourcing services worldwide. The company offers outsourcing services to back-office operations, including accounting/finance and human resources; order placement services; operation and maintenance of IT systems; and mechanical, architectural, and other design operations. It also provides contract center services, such as outsourcing services for customer support operations comprising dealing with inquires and complaints from consumers, providing products and services information to the customers, and supporting marketing and sales. In addition, the company offers digital marketing services that make use of Internet infrastructures, Internet promotions, Website design and operations, omni cahnnel marketing, and analysis and research services. Further, it provides e-commerce services, including various functions required for e-commerce, such as e-commerce Website development and operation, fulfillment, customer care, online promotions, and analysis services. The company serves financial, telecommunication, high-tech, medical, cosmetics, distribution, automobile, and airline industries, as well as the public sector. transcosmos inc. was founded in 1966 and is based in Tokyo, Japan.",
    "website": "http://www.trans-cosmos.co.jp",
    "zipcode": "150-8530"
  },
  "9719.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "SCSK Corporation",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "SCSK CORP",
    "state": null,
    "summary": "SCSK Corporation provides information technology (IT) services in Japan and internationally. The company's Manufacturing & Telecommunication Systems Business segment offers IT solutions for core systems, manufacturing and information management systems, supply chain management (SCM), and customer relationship management (CRM) systems for manufacturing, telecommunication, and energy industries. Its Distribution & Media Systems Business segment offers IT solutions, such as core and information systems, SCM, CRM, and e-commerce systems for distribution, service, and media industries. The company's Financial Systems Business segment develops, maintains, and operates systems for banks and trust banks, as well as insurance, securities, lease, and credit companies. Its Global System Solutions & Innovation Business segment provides IT solutions for trading companies. The company's Business Solutions segment provides contact center services; and application management outsourcing services that covers development, installation, maintenance, and operation of enterprise resource planning and CRM products, such as ProActive, SAP, Oracle, and Salesforce, as well as business process outsourcing services. Its IT Platform Solutions segment provides services and products in the fields of IT infrastructure and manufacturing, including computer-aided design and engineering. The company's IT Management segment develops solutions-oriented netXDC data centers to provide outsourcing services; and provides cloud infrastructure, on-site management, and SE support services. Its Mobility System segment offers software solutions for the electronic vehicle unit that controls vehicle's onboard electronics. The company was formerly known as Sumisho Computer Systems Corporation and changed its name to SCSK Corporation in October 2011. The company was founded in 1969 and is headquartered in Tokyo, Japan. SCSK Corporation is a subsidiary of Sumitomo Corporation.",
    "website": "http://www.scsk.jp",
    "zipcode": "135-8110"
  },
  "9739.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "Nippon Systemware Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "NIPPON SYSTEMWARE CO",
    "state": null,
    "summary": "Nippon Systemware Co., Ltd. provides information technology (IT) and embedded solutions in Japan. It offers business solutions, including consulting, system design, development, maintenance, and operational services for manufacturing, distribution, finance, insurance, and government sectors. The company also provides a range of IT services, such as designing servers and networks for optimum system performance; developing secure environments; and operating and monitoring systems via its urban and suburban data centers. In addition, it offers embedded technologies for app, middleware, and driver development for the automotive, industrial, and other sectors; and high-level design, logic design and verification, logic synthesis, layout design, manufacturing, and testing services, as well as low-power design and advanced process services, including image processing and communication control. Further, the company provides IoT and AI services, including gathering, analyzing, and utilizing data; and edge device solutions. Nippon Systemware Co., Ltd. was founded in 1966 and is headquartered in Tokyo, Japan.",
    "website": "http://www.nsw.co.jp",
    "zipcode": "150-8577"
  },
  "9742.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "INES Corporation",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "INES CORPORATION",
    "state": null,
    "summary": "INES Corporation provides information network system services to industrial corporations, financial institutions, and public entities in Japan. It offers operation and maintenance services for information systems and communication networks, including IT outsourcing and iDC services; and information system analysis and design, program development, testing, and conversion services, such as software development for the financial, distribution, and service industries, as well as for the public sector. The company also provides system integration services for software and hardware systems comprising construction of Web-based networks, client/server networks, local area networks, and wide-area networks; and sells mobile PCs, automatic printing device systems, and other equipment. In addition, it offers other system related services, including data input, help desk, and security services, as well as machine-room, and network operation and management, systems maintenance, and training in PC systems; and hardware procurement, staff training and education, ERP consulting, and outsourcing services. The company was formerly known as Kyoei Computer Center and changed its name to INES Corporation in August 1984. INES Corporation was founded in 1964 and is headquartered in Tokyo, Japan.",
    "website": "http://www.ines.co.jp",
    "zipcode": "104-0053"
  },
  "9746.T": {
    "city": "Utsunomiya",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "TKC Corporation",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "TKC CORPORATION",
    "state": null,
    "summary": "TKC Corporation engages in the accounting firm, local governments, and printing businesses in Japan. The company provides information processing, and software and consulting services; and sells office equipment and office supplies for computer based accounting, as well as offers help desk services to accounting firms and their clients, medium and large size companies, local municipalities, etc. It also develops and provides software to be installed on system devices for information service applications; manufactures and sells business forms for PCs and general office forms; and publishes books and monthly magazines on business management, and taxing and accounting. In addition, the company provides data printing and systems consulting; security, maintenance, and repair; liability insurance and banking agency; and cloud computing and internet services. Further, it engages in the development and maintenance of website; money loaning and mediation of money loaning for tax consulting firms and their client companies; and collections administration on behalf of tax consulting firms and their client companies. The company was formerly known as Tochigi Prefecture Computing Center Co., Ltd. and changed its name to TKC Corporation in December 1986. TKC Corporation was founded in 1966 and is headquartered in Utsunomiya, Japan.",
    "website": "http://www.tkc.jp",
    "zipcode": "320-8644"
  },
  "9889.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Information Technology Services",
    "long_name": "JBCC Holdings Inc.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "JBCC HOLDINGS INC",
    "state": null,
    "summary": "JBCC Holdings Inc. provides IT-related services in Japan. The company's services include consulting, application development, system development, operation, maintenance, monitoring, and outsourcing. It also develops and markets software, and provides printing and cloud services, as well as provides customized hardware; and offers staff services. The company was founded in 1964 and is headquartered in Tokyo, Japan",
    "website": "http://www.jbcchd.co.jp",
    "zipcode": "144-8721"
  },
  "CB4.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "CAC Holdings Corporation",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "CAC HOLDINGS CORP.",
    "state": null,
    "summary": "CAC Holdings Corporation, through its subsidiaries, provides information technology (IT) services worldwide. The company offers systems development, integration, operation, and management services, as well as human resource BPO/BTO services; drug development support services; mainframe, open system, Web-based system, and IT management solutions; and system consulting, and software planning and development services, as well as develops various kinds of hardware and software for factories. It also provides system planning and design, system integration, helpdesk, IT infrastructure, warranty management, and contracted software development services, as well as develops and sells packaged software. The company was founded in 1966 and is headquartered in Tokyo, Japan.",
    "website": "http://www.cac-holdings.com",
    "zipcode": "103-0015"
  },
  "CEJOF": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Information Technology Services",
    "long_name": "Cresco Ltd.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "CRESCO LTD",
    "state": null,
    "summary": "Cresco Ltd., together with its subsidiaries, provides various services in the fields of application development, IT infrastructure system architecture, and embedded systems in Japan. The company offers software and systems design, development, and consulting services; ERP consulting services; hardware design and development/prototyping services; data processing services; and design and development support services through system consulting related to control and embedding technologies, as well as cloud and Web design services. It is also involved in the development of add-on applications, and mainframe and open systems; consulting, design, deployment, and development of computer systems; and construction of server infrastructure. The company was founded in 1988 and is headquartered in Tokyo, Japan.",
    "website": "http://www.cresco.co.jp",
    "zipcode": "108-6026"
  },
  "DA9.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "DTS Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "DTS CORP.",
    "state": null,
    "summary": "DTS Corporation provides systems integration services in Japan. The company operates through four segments: Finance and Society; Corporate Solutions; Operational Infrastructure BPO; and Regional, Overseas, Etc. It develops and maintains information systems; designs and executes electrical and telecommunications construction work related to information systems; develops, purchases, sells, and leases educational equipment and materials related to the information systems; and publishes, edits, and translates work related to the information systems. The company also installs, operates, and maintains computer systems and networks; manufactures, develops, purchases, sells, and leases computers, and other information related equipment and software; processes and provides information and commercial transactions; creates, purchases, sells, and leases multimedia related content; and acquires, develops, licenses, manages, and transfers intellectual property, such as copyrights. In addition, it engages in worker dispatch business; and contracting for planning, surveying, researching, training, educating, and consulting activities related to information systems. Further, the company offers multimedia; enterprise resource planning; and network integration systems. It serves financial industry, communications industry, public institutions, and distribution and transportation industries. DTS Corporation was founded in 1972 and is headquartered in Tokyo, Japan.",
    "website": "http://www.dts.co.jp",
    "zipcode": "104-0032"
  },
  "DGK.SG": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Information Technology Services",
    "long_name": "Digital Garage, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "DIGITAL GARAGE INC. Registered ",
    "state": null,
    "summary": "Digital Garage, Inc. operates as a context company in Japan and internationally. The company operates through Financial Technology, Marketing Technology, Incubation Technology, and Long-term Incubation segments. The Financial Technology segment provides payment platforms, including credit card payment, convenience store payment, and QR code payment systems. The Marketing Technology segment provides marketing solutions that integrate digital and real solutions. The Incubation Technology segment invests in early-stage startups and later-stage businesses in the United States, Japan, and Asia. The Long-term Incubation segment provides medium- to long-term cash inflows. Digital Garage, Inc. was founded in 1995 and is headquartered in Tokyo, Japan.",
    "website": "http://www.garage.co.jp/en/",
    "zipcode": "150-0022"
  },
  "FJT.MU": {
    "city": "Yokohama",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "MUN",
    "industry": "Information Technology Services",
    "long_name": "Fuji Soft Incorporated",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "FUJI SOFT INC.",
    "state": null,
    "summary": "Fuji Soft Incorporated operates as an IT company worldwide. It offers PALRO, a humanoid robot technology that provides information and services; and cloud integration services, such as FSSaaBIS, a solution combined with SaaS for collaboration tools and virtualization environment. The company also provides security solutions, such as surveillance camera solution; finger vein authentication technology, consulting services; and security diagnosis services. In addition, it offers broadband solutions, including FSStream consisting system development, image creation, copyright transaction, video encoding, and Website building services; mobile solutions, including FSMobile, a service of mobile phone development. Further, the company offers digital living solutions comprising FSDTV middleware for association of radio industries and businesses; FSDTV middleware for IPTV; and FSDTV for mobile. Additionally, it provides data warehousing, outsourcing, and mobile phone and information appliance development services; operates AKIBA PLAZA for presentation, events, receptions, meetings, and seminars; and embedded technology. The company was formerly known as FUJISOFT ABC Incorporated and changed its name to Fuji Soft Incorporated in July 2006. Fuji Soft Incorporated was founded in 1970 and is headquartered in Yokohama, Japan.",
    "website": "http://www.fsi.co.jp",
    "zipcode": "231-8008"
  },
  "FJTSF": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Information Technology Services",
    "long_name": "Fujitsu Limited",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "FUJITSU",
    "state": null,
    "summary": "Fujitsu Limited operates as an information and communication technology (ICT) company in japan and internationally. The company operates through Technology Solutions, Ubiquitous Solutions, and Device Solutions segments. The Technology Solutions segment offers system integration services, including system construction and business applications; consulting services; front-end technologies comprising ATMs, point-of-sale systems, etc.; and outsourcing services, such as datacenters, ICT and application operation/management, SaaS, business process outsourcing, etc. This segment also provides network services, such as business network, etc.; cloud services; system support services comprising maintenance and surveillance services for information systems and networks; and security solutions that include information systems and networks installation. In addition, it offers system products, such as servers, storage systems, and operating system and middleware software; and network management and optical transmission systems, and mobile phone base stations. The Ubiquitous Solutions segment provides personal computers and mobile phones. The Device Solutions segment offers LSI devices for digital consumer electronics, automobiles, mobile phones, and servers; and electronic components, such as semiconductor packages, batteries, optical transceiver modules, printed circuit boards, relays, connectors, etc. The company also provides infrastructure, industry, and business and technology solutions. It serves automotive, manufacturing, retail, financial services, transport, telecommunications, and healthcare industries; the public sectors; and services providers. The company has strategic partnership with NetApp for enhancing data management infrastructure. Fujitsu Limited was founded in 1923 and is headquartered in Tokyo, Japan.",
    "website": "http://www.fujitsu.com",
    "zipcode": "105-7123"
  },
  "FJTSY": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Information Technology Services",
    "long_name": "Fujitsu Limited",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "FUJITSU",
    "state": null,
    "summary": "Fujitsu Limited operates as an information and communication technology (ICT) company in japan and internationally. The company operates through Technology Solutions, Ubiquitous Solutions, and Device Solutions segments. The Technology Solutions segment offers system integration services, including system construction and business applications; consulting services; front-end technologies comprising ATMs, point-of-sale systems, etc.; and outsourcing services, such as datacenters, ICT and application operation/management, SaaS, business process outsourcing, etc. This segment also provides network services, such as business network, etc.; cloud services; system support services comprising maintenance and surveillance services for information systems and networks; and security solutions that include information systems and networks installation. In addition, it offers system products, such as servers, storage systems, and operating system and middleware software; and network management and optical transmission systems, and mobile phone base stations. The Ubiquitous Solutions segment provides personal computers and mobile phones. The Device Solutions segment offers LSI devices for digital consumer electronics, automobiles, mobile phones, and servers; and electronic components, such as semiconductor packages, batteries, optical transceiver modules, printed circuit boards, relays, connectors, etc. The company also provides infrastructure, industry, and business and technology solutions. It serves automotive, manufacturing, retail, financial services, transport, telecommunications, and healthcare industries; the public sectors; and services providers. The company has strategic partnership with NetApp for enhancing data management infrastructure. Fujitsu Limited was founded in 1923 and is headquartered in Tokyo, Japan.",
    "website": "http://www.fujitsu.com",
    "zipcode": "105-7123"
  },
  "FSX.MU": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "MUN",
    "industry": "Information Technology Services",
    "long_name": "Future Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "FUTURE CORP.",
    "state": null,
    "summary": "Future Corporation provides IT consulting and services primarily in Japan. The company offers its services in digital marketing, IT education, e-commerce, and various other fields. The company was formerly known as Future Architect, Inc. and changed its name to Future Corporation in April 2016. Future Corporation was founded in 1989 and is headquartered in Tokyo, Japan.",
    "website": "http://www.future.co.jp",
    "zipcode": "141-0032"
  },
  "FUJ1.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Fujitsu Limited",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "FUJITSU LTD",
    "state": null,
    "summary": "Fujitsu Limited operates as an information and communication technology (ICT) company in japan and internationally. The company operates through Technology Solutions, Ubiquitous Solutions, and Device Solutions segments. The Technology Solutions segment offers system integration services, including system construction and business applications; consulting services; front-end technologies comprising ATMs, point-of-sale systems, etc.; and outsourcing services, such as datacenters, ICT and application operation/management, SaaS, business process outsourcing, etc. This segment also provides network services, such as business network, etc.; cloud services; system support services comprising maintenance and surveillance services for information systems and networks; and security solutions that include information systems and networks installation. In addition, it offers system products, such as servers, storage systems, and operating system and middleware software; and network management and optical transmission systems, and mobile phone base stations. The Ubiquitous Solutions segment provides personal computers and mobile phones. The Device Solutions segment offers LSI devices for digital consumer electronics, automobiles, mobile phones, and servers; and electronic components, such as semiconductor packages, batteries, optical transceiver modules, printed circuit boards, relays, connectors, etc. The company also provides infrastructure, industry, and business and technology solutions. It serves automotive, manufacturing, retail, financial services, transport, telecommunications, and healthcare industries; the public sectors; and services providers. The company has strategic partnership with NetApp for enhancing data management infrastructure. Fujitsu Limited was founded in 1923 and is headquartered in Tokyo, Japan.",
    "website": "http://www.fujitsu.com",
    "zipcode": "105-7123"
  },
  "FUJA.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Fujitsu Limited",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "FUJITSU LTD. ADR 5/1",
    "state": null,
    "summary": "Fujitsu Limited operates as an information and communication technology (ICT) company in japan and internationally. The company operates through Technology Solutions, Ubiquitous Solutions, and Device Solutions segments. The Technology Solutions segment offers system integration services, including system construction and business applications; consulting services; front-end technologies comprising ATMs, point-of-sale systems, etc.; and outsourcing services, such as datacenters, ICT and application operation/management, SaaS, business process outsourcing, etc. This segment also provides network services, such as business network, etc.; cloud services; system support services comprising maintenance and surveillance services for information systems and networks; and security solutions that include information systems and networks installation. In addition, it offers system products, such as servers, storage systems, and operating system and middleware software; and network management and optical transmission systems, and mobile phone base stations. The Ubiquitous Solutions segment provides personal computers and mobile phones. The Device Solutions segment offers LSI devices for digital consumer electronics, automobiles, mobile phones, and servers; and electronic components, such as semiconductor packages, batteries, optical transceiver modules, printed circuit boards, relays, connectors, etc. The company also provides infrastructure, industry, and business and technology solutions. It serves automotive, manufacturing, retail, financial services, transport, telecommunications, and healthcare industries; the public sectors; and services providers. The company has strategic partnership with NetApp for enhancing data management infrastructure. Fujitsu Limited was founded in 1923 and is headquartered in Tokyo, Japan.",
    "website": "http://www.fujitsu.com",
    "zipcode": "105-7123"
  },
  "IE7.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "INES Corporation",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "INES CORP.",
    "state": null,
    "summary": "INES Corporation provides information network system services to industrial corporations, financial institutions, and public entities in Japan. It offers operation and maintenance services for information systems and communication networks, including IT outsourcing and iDC services; and information system analysis and design, program development, testing, and conversion services, such as software development for the financial, distribution, and service industries, as well as for the public sector. The company also provides system integration services for software and hardware systems comprising construction of Web-based networks, client/server networks, local area networks, and wide-area networks; and sells mobile PCs, automatic printing device systems, and other equipment. In addition, it offers other system related services, including data input, help desk, and security services, as well as machine-room, and network operation and management, systems maintenance, and training in PC systems; and hardware procurement, staff training and education, ERP consulting, and outsourcing services. The company was formerly known as Kyoei Computer Center and changed its name to INES Corporation in August 1984. INES Corporation was founded in 1964 and is headquartered in Tokyo, Japan.",
    "website": "http://www.ines.co.jp",
    "zipcode": "104-0053"
  },
  "IO4.MU": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "MUN",
    "industry": "Information Technology Services",
    "long_name": "ITOCHU Techno-Solutions Corporation",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "ITOCHU TECHNO-SOLUT.CORP.",
    "state": null,
    "summary": "ITOCHU Techno-Solutions Corporation engages in the sale, maintenance, and support of computers and network systems, software development, and data center and support services in Japan, Asia, and internationally. The company operates through six segments: Enterprise Business, Distribution Business, Telecommunication Business, Regional and Social Infrastructure Business, Financial Services Business, and IT Services Business. It offers information processing; information services-related to science and engineering; system maintenance and support services, including assembly, transfer, and installation of equipment, as well as 24-hour maintenance and systems operation services; and IT engineer training services. The company also provides IT infrastructure construction services; IT systems, infrastructure, business and applications, and data centers operation and management services; ERP-related software development and maintenance services; satellite communications and broadcasting operation services; cloud services; and application development services. In addition, it offers sale of network and security-related equipment, storage-related devices, and software and other peripheral devices, as well as provision of related consulting, deployment/building, and support services; and building facility operations management activities for computer centers. Further, the company is involved in the exportation of IT products; resale of hardware and software; planning, production, and maintenance of web content; planning and production of advertising media; and information gathering, research, and marketing activities. It serves telecommunication, finance, retail and distribution, public sectors and utilities, manufacturing, and information and communications industries, as well as educational and research institutions. The company was founded in 1972 and is headquartered in Tokyo, Japan. ITOCHU Techno-Solutions Corporation is a subsidiary of ITOCHU Corporation.",
    "website": "http://www.ctc-g.co.jp",
    "zipcode": "100-6080"
  },
  "ISW.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Information Services International-Dentsu, Ltd.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "INFORM. SVCS INTL-DENTSU",
    "state": null,
    "summary": "Information Services International-Dentsu, Ltd. provides information technology (IT) solutions for the financial, manufacturing, and service sectors worldwide. The company operates in four segments: Financial Solutions, Business Solutions, Manufacturing Solutions, and Communication IT. It offers back office systems and liquidity management systems; capital market dealing and risk management systems; loan solutions; lease and finance operation management packages; and integrated CRM systems and cloud business applications. The company also provides business solutions, including STRAVIS, a consolidated accounting software; Ci*X Expense, an expense settlement system; Ci*X Journalizer, an automated journalizing system; company management solution; integrated accounting solution; POSITIVE, an integrated human capital management solution; STAFFBRAIN, an integrated human resource solution; SAP S/4HANA, an ERP package; and BusinessSPECTRE, a SAP data linkage framework. In addition, it provides product development process consulting, CAD/CAM/computer aided engineering/PLM software introduction/deployment support, and model based systems engineering support services; digital manufacturing solutions, robotics, product logistics simulations, and global process design support systems; and after-sales services, such as failure prediction specialized analysis framework, field service solutions, and Internet of things platforms. Further, the company offers ICT platform and digital marketing solutions, as well as athletic ability measurement systems. Additionally, it provides custom system development services; and outsourcing, operation, and maintenance services, as well as sells IT equipment and others. The company was incorporated in 1975 and is headquartered in Tokyo, Japan. Information Services International-Dentsu, Ltd. operates as a subsidiary of Dentsu Group Inc.",
    "website": "http://www.isid.co.jp",
    "zipcode": "108-0075"
  },
  "ITTOY": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Information Technology Services",
    "long_name": "ITOCHU Techno-Solutions Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "ITOCHU TECHNO-SOLUTIONS CORP",
    "state": null,
    "summary": "ITOCHU Techno-Solutions Corporation engages in the sale, maintenance, and support of computers and network systems, software development, and data center and support services in Japan, Asia, and internationally. The company operates through six segments: Enterprise Business, Distribution Business, Telecommunication Business, Regional and Social Infrastructure Business, Financial Services Business, and IT Services Business. It offers information processing; information services-related to science and engineering; system maintenance and support services, including assembly, transfer, and installation of equipment, as well as 24-hour maintenance and systems operation services; and IT engineer training services. The company also provides IT infrastructure construction services; IT systems, infrastructure, business and applications, and data centers operation and management services; ERP-related software development and maintenance services; satellite communications and broadcasting operation services; cloud services; and application development services. In addition, it offers sale of network and security-related equipment, storage-related devices, and software and other peripheral devices, as well as provision of related consulting, deployment/building, and support services; and building facility operations management activities for computer centers. Further, the company is involved in the exportation of IT products; resale of hardware and software; planning, production, and maintenance of web content; planning and production of advertising media; and information gathering, research, and marketing activities. It serves telecommunication, finance, retail and distribution, public sectors and utilities, manufacturing, and information and communications industries, as well as educational and research institutions. The company was founded in 1972 and is headquartered in Tokyo, Japan. ITOCHU Techno-Solutions Corporation is a subsidiary of ITOCHU Corporation.",
    "website": "http://www.ctc-g.co.jp",
    "zipcode": "100-6080"
  },
  "LJ1.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Core Corporation",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "CORE CORP.",
    "state": null,
    "summary": "Core Corporation provides information and communication technology services in Japan. The company offers system integration services that include embedded and systems development services for home appliances, OA equipment, in-vehicle equipment, facility equipment, and manufacturing equipment, as well as manufacturing, distribution, finance, and public system integration services for various industries and operations. It also provides solutions for various fields, such as security, efficiency, cloud/big data utilization, cloud services, Internet of Things, GNSS, etc.; and data center and cloud center services comprising housing, hosting, cloud, system monitoring/maintenance, backup service, business process outsourcing services, etc. The company was founded in 1969 and is headquartered in Tokyo, Japan.",
    "website": "http://www.core.co.jp",
    "zipcode": "154-8552"
  },
  "NEC1.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "NEC Corporation",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "NEC CORP.",
    "state": null,
    "summary": "NEC Corporation operates as a provider of information and communication technology solutions in Japan and internationally. The company operates in six segments: Public Solutions, Public Infrastructure, Enterprise, Network Services, System Platform, and Global. It provides systems integration services, such as systems implementation and consulting; maintenance and support services; outsourcing and cloud services; and system equipment. The company also offers network infrastructure products, including core network equipment, mobile phone base stations, optical transmission systems, and routers and switches; wireless LAN routers; and enterprise network solutions comprising IP telephony systems, WAN/wireless access equipment, and LAN products. In addition, it provides hardware products, such as servers, mainframes, supercomputers, storage products, business and personal computers, point-of-sale systems, automatic teller machines, control equipment, and wireless LAN routers; software products, including integrated operation management, middleware, and security and database software; and maintenance services. Further, the company offers software services for service providers consisting of operation support system/business support system, software-defined networking, and network functions virtualization; submarine systems comprising submarine cable and ocean observation systems; wireless backhaul solutions; displays and projectors; and energy storage solutions. It serves aerospace, defense, media, manufacturing, retail, financial, and telecommunication industries, as well as government entities, medical institutions, and medium-sized enterprises. NEC Corporation has collaboration with Analog Devices, Inc. to provide 5G O-RAN Massive MIMO Radio for Rakuten Mobile. The company was formerly known as Nippon Electric Company, Limited and changed its name to NEC Corporation in April 1983. NEC Corporation was founded in 1899 and is headquartered in Tokyo, Japan.",
    "website": "http://www.nec.com",
    "zipcode": "108-8001"
  },
  "NIU.MU": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "MUN",
    "industry": "Information Technology Services",
    "long_name": "Nihon Unisys, Ltd.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "NIHON UNISYS LTD",
    "state": null,
    "summary": "Nihon Unisys, Ltd. provides information technology (IT) solutions in Japan. The company operates through five segments: System Services, Support Services, Outsourcing, Software, and Hardware. It offers contracted software development; technology support and ICT strategy consulting services; and support services, such as software and hardware maintenance, and installation support. The company also engages in the sale and rental of computer and network systems; and cloud computing and outsourcing businesses. In addition, it provides CRM/customer channel, business intelligence, SRM/electronic purchasing, SCM/logistics, energy management/environment, office communication, enterprise education, ERP/enterprise resource management, and regional revitalization solutions. Further, the company offers ICT infrastructure solutions and services; hardware, middleware, and related services; and business process restructuring, ICT visualization, construction, implementation, maintenance, operation, and training services. It provides solutions for various industries, including financial services, engineering, distribution, transportation, central and local governments, healthcare, leasing, telecommunications, media, education, and social insurance. Nihon Unisys, Ltd. was founded in 1947 and is headquartered in Tokyo, Japan.",
    "website": "http://www.unisys.co.jp",
    "zipcode": "135-8560"
  },
  "NOX.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Net One Systems Co., Ltd.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "NET ONE SYSTEMS",
    "state": null,
    "summary": "Net One Systems Co., Ltd. provides information platform solutions and services in Japan. The company offers information and communications technology, and virtual desktop infrastructure solutions. It also provides telecommunication networks, such as carrier Ethernet, IP/MPLS networks, mobile network infrastructure, and SDN/NFV for telecom operators. The company was founded in 1988 and is headquartered in Tokyo, Japan.",
    "website": "http://www.netone.co.jp",
    "zipcode": "100-7024"
  },
  "NR7.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Nomura Research Institute, Ltd.",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "NOMURA RESEARCH IN.",
    "state": null,
    "summary": "Nomura Research Institute, Ltd. provides consulting, financial information technology (IT) solution, industrial IT solution, and IT platform service in Japan. Its Consulting segment offers management, operational, and system consulting services for enterprise and government agencies. This segment is also involved in the research, future projection, and recommendations related to society, economics, business, technology, etc. The company's Financial IT Solutions segment provides system consulting, development, and management solutions, as well as shared online services for the financial institutions, including the securities, insurance, banking, asset management, and other financial sectors. Its Industrial IT Solutions segment offers system consulting, development, and management solutions, as well as shared online services primarily for the distribution, manufacturing, service, and public sectors. The company's IT Platform Services segment engages in the data center operation activities and construction of platforms and networks to the Financial IT and Industrial IT Solutions segments, as well as provides IT platform solutions and information security services to external clients. This segment is also involved in research related to advance IT, etc. The company was founded in 1965 and is headquartered in Tokyo, Japan.",
    "website": "http://www.nri.com",
    "zipcode": "100-0004"
  },
  "NRILY": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Information Technology Services",
    "long_name": "Nomura Research Institute, Ltd.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "NOMURA RESEARCH INSTITUTE",
    "state": null,
    "summary": "Nomura Research Institute, Ltd. provides consulting, financial information technology (IT) solution, industrial IT solution, and IT platform service in Japan. Its Consulting segment offers management, operational, and system consulting services for enterprise and government agencies. This segment is also involved in the research, future projection, and recommendations related to society, economics, business, technology, etc. The company's Financial IT Solutions segment provides system consulting, development, and management solutions, as well as shared online services for the financial institutions, including the securities, insurance, banking, asset management, and other financial sectors. Its Industrial IT Solutions segment offers system consulting, development, and management solutions, as well as shared online services primarily for the distribution, manufacturing, service, and public sectors. The company's IT Platform Services segment engages in the data center operation activities and construction of platforms and networks to the Financial IT and Industrial IT Solutions segments, as well as provides IT platform solutions and information security services to external clients. This segment is also involved in research related to advance IT, etc. The company was founded in 1965 and is headquartered in Tokyo, Japan.",
    "website": "http://www.nri.com",
    "zipcode": "100-0004"
  },
  "NT5.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "NTT DATA Corporation",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "NTT DATA CORP.",
    "state": null,
    "summary": "NTT DATA Corporation provides consulting, system development, and business information technology (IT) outsourcing services worldwide. The company operates through Public & Social Infrastructure, Financial, Enterprise & Solutions, North America, and EMEA & LATAM segments. It offers value-added IT services for government, medical, telecommunications, electric power, and other social infrastructure; financial institutions; and the manufacturing, distribution, and servicing industries, as well as payment services and platform solutions. The company was formerly known as NTT Data Communications Systems Corporation and changed its name to NTT DATA Corporation in 1996. NTT DATA Corporation was founded in 1967 and is headquartered in Tokyo, Japan. NTT DATA Corporation is a subsidiary of Nippon Telegraph and Telephone Corporation.",
    "website": "http://www.nttdata.com",
    "zipcode": "135-6033"
  },
  "NTDTY": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Information Technology Services",
    "long_name": "NTT DATA Corporation",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "NTT DATA CORP",
    "state": null,
    "summary": "NTT DATA Corporation provides consulting, system development, and business information technology (IT) outsourcing services worldwide. The company operates through Public & Social Infrastructure, Financial, Enterprise & Solutions, North America, and EMEA & LATAM segments. It offers value-added IT services for government, medical, telecommunications, electric power, and other social infrastructure; financial institutions; and the manufacturing, distribution, and servicing industries, as well as payment services and platform solutions. The company was formerly known as NTT Data Communications Systems Corporation and changed its name to NTT DATA Corporation in 1996. NTT DATA Corporation was founded in 1967 and is headquartered in Tokyo, Japan. NTT DATA Corporation is a subsidiary of Nippon Telegraph and Telephone Corporation.",
    "website": "http://www.nttdata.com",
    "zipcode": "135-6033"
  },
  "OBI.MU": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "MUN",
    "industry": "Information Technology Services",
    "long_name": "OBIC Business Consultants Co., Ltd.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "OBIC BUSINESS CONS.",
    "state": null,
    "summary": "OBIC Business Consultants Co., Ltd. develops and sells business and information technology solutions in Japan. The company offers packaged software for business systems. It also provides maintenance and introduction guidance services. The company was founded in 1980 and is based in Tokyo, Japan.",
    "website": "http://www.obc.co.jp",
    "zipcode": "163-6032"
  },
  "QSU.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "SCSK Corporation",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "SCSK CORP.",
    "state": null,
    "summary": "SCSK Corporation provides information technology (IT) services in Japan and internationally. The company's Manufacturing & Telecommunication Systems Business segment offers IT solutions for core systems, manufacturing and information management systems, supply chain management (SCM), and customer relationship management (CRM) systems for manufacturing, telecommunication, and energy industries. Its Distribution & Media Systems Business segment offers IT solutions, such as core and information systems, SCM, CRM, and e-commerce systems for distribution, service, and media industries. The company's Financial Systems Business segment develops, maintains, and operates systems for banks and trust banks, as well as insurance, securities, lease, and credit companies. Its Global System Solutions & Innovation Business segment provides IT solutions for trading companies. The company's Business Solutions segment provides contact center services; and application management outsourcing services that covers development, installation, maintenance, and operation of enterprise resource planning and CRM products, such as ProActive, SAP, Oracle, and Salesforce, as well as business process outsourcing services. Its IT Platform Solutions segment provides services and products in the fields of IT infrastructure and manufacturing, including computer-aided design and engineering. The company's IT Management segment develops solutions-oriented netXDC data centers to provide outsourcing services; and provides cloud infrastructure, on-site management, and SE support services. Its Mobility System segment offers software solutions for the electronic vehicle unit that controls vehicle's onboard electronics. The company was formerly known as Sumisho Computer Systems Corporation and changed its name to SCSK Corporation in October 2011. The company was founded in 1969 and is headquartered in Tokyo, Japan. SCSK Corporation is a subsidiary of Sumitomo Corporation.",
    "website": "http://www.scsk.jp",
    "zipcode": "135-8110"
  },
  "SB3.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "SB Technology Corp.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "SB TECHNOLOGY CORP.",
    "state": null,
    "summary": "SB Technology Corp. provides ICT services in Japan. The company offers data analysis and visualization services; security solutions; IT infrastructure solutions; and cloud solutions, as well as creates functional e-commerce sites to operating sites. It is also involved in planning, design, development, and operation of IT systems, mobile apps, and IoT apps. The company was formerly known as SoftBank Technology Corp. and changed its name to SB Technology Corp. in October 2019. The company was founded in 1990 and is headquartered in Tokyo, Japan.",
    "website": "http://www.softbanktech.co.jp",
    "zipcode": "160-0022"
  },
  "SCSKF": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Information Technology Services",
    "long_name": "SCSK Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "SCSK CORP",
    "state": null,
    "summary": "SCSK Corporation provides information technology (IT) services in Japan and internationally. The company's Manufacturing & Telecommunication Systems Business segment offers IT solutions for core systems, manufacturing and information management systems, supply chain management (SCM), and customer relationship management (CRM) systems for manufacturing, telecommunication, and energy industries. Its Distribution & Media Systems Business segment offers IT solutions, such as core and information systems, SCM, CRM, and e-commerce systems for distribution, service, and media industries. The company's Financial Systems Business segment develops, maintains, and operates systems for banks and trust banks, as well as insurance, securities, lease, and credit companies. Its Global System Solutions & Innovation Business segment provides IT solutions for trading companies. The company's Business Solutions segment provides contact center services; and application management outsourcing services that covers development, installation, maintenance, and operation of enterprise resource planning and CRM products, such as ProActive, SAP, Oracle, and Salesforce, as well as business process outsourcing services. Its IT Platform Solutions segment provides services and products in the fields of IT infrastructure and manufacturing, including computer-aided design and engineering. The company's IT Management segment develops solutions-oriented netXDC data centers to provide outsourcing services; and provides cloud infrastructure, on-site management, and SE support services. Its Mobility System segment offers software solutions for the electronic vehicle unit that controls vehicle's onboard electronics. The company was formerly known as Sumisho Computer Systems Corporation and changed its name to SCSK Corporation in October 2011. The company was founded in 1969 and is headquartered in Tokyo, Japan. SCSK Corporation is a subsidiary of Sumitomo Corporation.",
    "website": "http://www.scsk.jp",
    "zipcode": "135-8110"
  },
  "SFBTF": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Information Technology Services",
    "long_name": "SB Technology Corp.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "SB TECHNOLOGY CORP",
    "state": null,
    "summary": "SB Technology Corp. provides ICT services in Japan. The company offers data analysis and visualization services; security solutions; IT infrastructure solutions; and cloud solutions, as well as creates functional e-commerce sites to operating sites. It is also involved in planning, design, development, and operation of IT systems, mobile apps, and IoT apps. The company was formerly known as SoftBank Technology Corp. and changed its name to SB Technology Corp. in October 2019. The company was founded in 1990 and is headquartered in Tokyo, Japan.",
    "website": "http://www.softbanktech.co.jp",
    "zipcode": "160-0022"
  },
  "TISNF": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Information Technology Services",
    "long_name": "TIS Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "TIS INC.",
    "state": null,
    "summary": "TIS Inc. provides information technology (IT) services in Japan and internationally. The company operates through Service IT Business, BPO, Financial IT Services, Industrial IT Services, and Other segments. The Service IT Business segment provides knowledge-intensive IT services to create universalized and template-oriented solutions, such as default configuration and ERP for clients. The BPO segment offers business process outsourcing services, including marketing and sales services; and office and contract operations. The Financial IT Services segment offers value-added services for client's operations, expand use of IT, and IT-based support services for financial sector. The Industrial IT Business segment value-added services for client's operations, expand use of IT, and IT-based support services for non-financial sector. The Others segment provides leasing and other information systems. The company serves clients in the credit card, banking, insurance and other financial, manufacturing, distribution, service, public, and other sectors. The company was formerly known as IT Holdings Corporation and changed its name to TIS Inc. in July 2016. TIS Inc. was founded in 1971 and is headquartered in Tokyo, Japan.",
    "website": "http://www.tis.com",
    "zipcode": "160-0023"
  },
  "TSQ.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "transcosmos inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "TRANSCOSMOS INC.",
    "state": null,
    "summary": "transcosmos inc. provides business outsourcing services worldwide. The company offers outsourcing services to back-office operations, including accounting/finance and human resources; order placement services; operation and maintenance of IT systems; and mechanical, architectural, and other design operations. It also provides contract center services, such as outsourcing services for customer support operations comprising dealing with inquires and complaints from consumers, providing products and services information to the customers, and supporting marketing and sales. In addition, the company offers digital marketing services that make use of Internet infrastructures, Internet promotions, Website design and operations, omni cahnnel marketing, and analysis and research services. Further, it provides e-commerce services, including various functions required for e-commerce, such as e-commerce Website development and operation, fulfillment, customer care, online promotions, and analysis services. The company serves financial, telecommunication, high-tech, medical, cosmetics, distribution, automobile, and airline industries, as well as the public sector. transcosmos inc. was founded in 1966 and is based in Tokyo, Japan.",
    "website": "http://www.trans-cosmos.co.jp",
    "zipcode": "150-8530"
  }
}
