{
    "1CM.F": {
        "short_name": "NIKKON HOLDINGS CO.LTD",
        "long_name": "Nikkon Holdings Co., Ltd.",
        "summary": "Nikkon Holdings Co., Ltd. engages in the cargo and truck transportation businesses in Japan and internationally. It operates through four segments: Transportation, Warehousing, Packaging, and Testing. The company is involved in the import and export of domestic and foreign goods; collection and disposal of waste; sale of automotive parts; dismantlement works; manufacture and sale of packaging raw materials; and sale oil of products. It is also engages in the design and manufacture of equipment related to logistics; processing and sales of machinery and equipment; assembly and dismantling activities; real estate leasing and general leasing activities; industry worker dispatch business; power generation business; sale of used antiques; manufacture and distribution of pharmaceuticals, quasi-drugs, cosmetics, and medical devices; and damage insurance agency and life insurance agency businesses. In addition, the company is involved in the transportation, warehousing, and testing of finished four wheeled vehicles and motorcycles, automotive parts, housing equipment, agricultural machinery, and others; and processing for distribution, delivery agency of automotive parts and others, and export packing and other operations. Further, it engages in the sale of petroleum products; machinery assembly and installation repair businesses; automobile maintenance business; lottery construction; and forwarding activities. The company was formerly known as Nippon Konpo Unyu Soko Co., Ltd. and changed its name to Nikkon Holdings Co., Ltd. in October 2015. Nikkon Holdings Co., Ltd. was founded in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0044",
        "website": "http://www.nikkon-hd.co.jp",
        "full_time_employees": 12579
    },
    "1YM.F": {
        "short_name": "MARUWA UNYU KIKAN CO.LTD",
        "long_name": "Maruwa Unyu Kikan Co.,Ltd.",
        "summary": "Maruwa Unyu Kikan Co.,Ltd. provides logistics services. Its 3PL services include low temperature food, medical order/medical, and room temperature logistics. The company is also involved in the collection and transportation of industrial waste; warehouse and storage business; and loan management business. In addition, it provides trucking, container transport, and other services. The company was founded in 1970 and is headquartered in Yoshikawa, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Yoshikawa",
        "zipcode": "342-0008",
        "website": "http://www.momotaro.co.jp",
        "full_time_employees": 3031
    },
    "2KT.F": {
        "short_name": "KONOIKE TRANSPORT CO.LTD",
        "long_name": "Konoike Transport Co., Ltd.",
        "summary": "Konoike Transport Co., Ltd. provides logistics services in Japan and internationally. The company offers logistics services, such as transportation and delivery services, storage and warehouse services, and temperature-controlled logistics services, as well as distribution processing services for apparel, food, promotional goods, etc. It provides contracting services in steel, food products, chemical, medical, and airport industries. Konoike Transport Co., Ltd. was founded in 1880 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0044",
        "website": "http://www.konoike.net",
        "full_time_employees": 15931
    },
    "704.F": {
        "short_name": "KINTETSU WORLD EXP.",
        "long_name": "Kintetsu World Express, Inc.",
        "summary": "Kintetsu World Express, Inc., together with its subsidiaries, provides air freight forwarding, sea freight forwarding, customs brokerage, logistics, and other services in Japan, the Americas, Europe, the Middle East, Africa, East Asia, Oceania, and Southeast Asia. The company offers air freight services, including air freight forwarding services, trucking services for pick-up and delivery, customs brokerage, and customized packing services, as well as precision machinery installation services. It also provides sea freight services comprising sea freight forwarding, container drayage, trucking services for pick-up and delivery, customs brokerage, buyer's consolidation, and PO management services. In addition, the company offers contract logistics services comprising PO and inventory control management services, cross dock and call center operations, assembly works, products inspections, vendor managed inventory, etc.; logistics consulting services; truck, trailer, and rail transportation services; and finished vehicles and auto parts transportation services. Further, it provides temporary staffing primarily for logistic and trading businesses; transports art objects and other materials for events and exhibitions; and offers hand carry services. Kintetsu World Express, Inc. was founded in 1948 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-6024",
        "website": "http://www.kwe.com",
        "full_time_employees": 17339
    },
    "7WE.F": {
        "short_name": "SENKO GROUP HOLDINGS",
        "long_name": "SENKO Group Holdings Co., Ltd.",
        "summary": "SENKO Group Holdings Co., Ltd., together with its subsidiaries, operates as a logistics company worldwide. The company operates through three segments: Distribution, Trading & Commerce, and Others. The Distribution segment is involved in truck transportation, marine transportation, logistic service, retail logistics, and railway forwarding activities. The Trading & Commerce segment engages in the sale of petroleum products; and trading business. The Others segment primarily provides data processing outsourcing, automobile maintenance, and insurance agency services. The company was formerly known as Senko Co., Ltd. and changed its name to SENKO Group Holdings Co., Ltd. in April 2017. SENKO Group Holdings Co., Ltd. was founded in 1916 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "135-0052",
        "website": "http://www.senkogrouphd.co.jp",
        "full_time_employees": null
    },
    "9025.T": {
        "short_name": "KONOIKE TRANSPORT CO LIMITED",
        "long_name": "Konoike Transport Co., Ltd.",
        "summary": "Konoike Transport Co., Ltd. provides logistics services in Japan and internationally. The company offers logistics services, such as transportation and delivery services, storage and warehouse services, and temperature-controlled logistics services, as well as distribution processing services for apparel, food, promotional goods, etc. It provides contracting services in steel, food products, chemical, medical, and airport industries. Konoike Transport Co., Ltd. was founded in 1880 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0044",
        "website": "http://www.konoike.net",
        "full_time_employees": 15931
    },
    "9027.S": {
        "short_name": "LOGINET JAPAN CO LTD",
        "long_name": "Loginet Japan Co., Ltd.",
        "summary": "Loginet Japan Co., Ltd. engages in logistics and transportation related businesses in Japan. It is also involved in the industrial waste/home appliance recycling/eco-businesses; international shipping; and moving/relocation services. In addition, the company offers travel services; auto, non-life, and other insurance services; car inspection and maintenance services; storage/warehouse services; and distribution processing services, as well as proprietary operating systems. Further, it produces and sells mineral water under the Yukimizu brand name. Loginet Japan Co., Ltd. was founded in 2005 and is based in Sapporo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "SAP",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sapporo",
        "zipcode": null,
        "website": "http://www.loginet-japan.com",
        "full_time_employees": null
    },
    "9029.T": {
        "short_name": "HIGASHI TWENTY ONE CO LTD",
        "long_name": "Higashi Twenty One Co., Ltd.",
        "summary": "Higashi Twenty One Co., Ltd. provides logistics services in Japan. It engages in the transportation and delivery, distribution center/warehouse storage, logistics processing, and industrial waste management activities; provision of BPO solution, such as in-house document logistics management/mail room management, sorting/shipping of forms with personal information, confidential document storage and recycling under strict security management, etc.; and office relocation activities. The company also offers logistics services in the building; operates shops in the building under the Hills 21 name; PC kitting/IT related services; rents and sells welfare equipment comprising beds and wheelchairs; and sells hygiene products consisting of adult disposable diapers. In addition, it is involved in the temporary staffing and parking lot management activities. The company was formerly known as Eastern Transportation Service Co., Ltd. and changed its name to Higashi Twenty One Co., Ltd. in February 2002. Higashi Twenty One Co., Ltd. was founded in 1944 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "540-0013",
        "website": "http://www.e-higashi.co.jp",
        "full_time_employees": null
    },
    "9034.T": {
        "short_name": "NANSO TRANSPORT CO",
        "long_name": "NANSO Transport Co.,Ltd.",
        "summary": "NANSO Transport Co.,Ltd. provides logistics services in Japan. The company engages in the provision of railroad transportation, general freight car transportation, special assortment freight transportation, car transportation handling, light vehicle transportation, warehouse/tenant, security, parking lot, general worker dispatch, automobile maintenance, and general charter passenger car and specified passenger car transportation services. It also offers non-life insurance; real estate transaction and leasing; travel; general and industrial waste treatment; building cleaning; nursing and day care; and employment placement services, as well as agency services. NANSO Transport Co.,Ltd. was incorporated in 1942 and is headquartered in Togane, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Togane",
        "zipcode": "283-0802",
        "website": "http://www.nanso.co.jp",
        "full_time_employees": null
    },
    "9036.T": {
        "short_name": "TOHBU NETWORK CO LTD",
        "long_name": "Tohbu Network Co., Ltd.",
        "summary": "Tohbu Network Co., Ltd. provides truck transportation and logistics services. It offers products in truck transportation, freight forwarding, passenger automobile transportation, automobile maintenance industry, industrial waste collection, and transportation industry. It also engages in real estate leasing, warehousing, and labor dispatch businesses; the sale of petroleum and high-pressure gases; the provision of insurance agency services related to life, property, and casualty insurance; the recruitment business related to life insurance; the sale of cement and other various building materials; the sale and leasing of automobile and electronic computers; the sale of tires and parts of automobile; power generation business; and the sale of electricity. In addition, the company develops and sells software. The company was founded in 1943 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "221-0052",
        "website": "http://www.tohbu.co.jp",
        "full_time_employees": null
    },
    "9037.T": {
        "short_name": "HAMAKYOREX CO LTD",
        "long_name": "Hamakyorex Co., Ltd.",
        "summary": "Hamakyorex Co., Ltd. engages in logistics center business Japan and internationally. The company offers 3PL services, including apparel, medical device, cosmetics, bedding and interior, EC, food, and joint logistics services, as well as miscellaneous cargo flow services. It also provides general freight vehicle transportation services. The company was founded in 1971 and is headquartered in Hamamatsu, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Hamamatsu",
        "zipcode": "430-0841",
        "website": "http://www.hamakyorex.co.jp",
        "full_time_employees": 4908
    },
    "9051.T": {
        "short_name": "SENKON LOGISTICS CO",
        "long_name": "Senkon Logistics Co., Ltd.",
        "summary": "Senkon Logistics Co., Ltd. provides various logistics services in Japan. The company offers third party logistics services; general cargo, precision mechanical equipment, and vehicle transport services; and industrial waste collection and transportation services, as well as owns warehouses, including location management, low-temperature, agricultural tool, tire, electronic appliance, general, electronic component, open-air yard, and information warehouses, as well as trunk room facilities. It also provides document and personal data management services; moving services, including packing/unpacking, piano transportation, room cleaning, computer and vehicle transportation, disposal collection, plant machinery transportation, and AC installation/de-installation services; and international intermodal logistics services through land, sea, and air transportation. Senkon Logistics Co., Ltd. was founded in 1959 and is headquartered in Sendai, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sendai",
        "zipcode": "980-0021",
        "website": "http://www.senkon.co.jp",
        "full_time_employees": null
    },
    "9058.T": {
        "short_name": "TRANCOM CO LTD",
        "long_name": "Trancom Co., Ltd.",
        "summary": "Trancom Co., Ltd. provides various logistics services in Japan and internationally. It offers logistics center construction and operation services; transport matching and delivery services; and production contract and temporary staffing services. The company also provides personal delivery services; paid employment placement services; consulting services; automobile maintenance services; and freight and truck transportation services. In addition, it sells new and used cars; operates insurance agency business; and designs and develops software. The company was founded in 1955 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "461-0004",
        "website": "http://www.trancom.co.jp",
        "full_time_employees": null
    },
    "9065.T": {
        "short_name": "SANKYU INC",
        "long_name": "Sankyu Inc.",
        "summary": "Sankyu Inc. provides logistics services in Japan, North and South America, rest of Asia, and internationally. The company offers logistics solutions, such as consulting, air freight, international multi-modal transport, trucking, and customs brokerage services; and operates warehouse and distribution centers, and container terminals. It also provides plant engineering and installation services, including plant design and engineering; fabrication and processing of plant equipment, piping, steel, steel-frame and offshore structures, bridges, and transportation equipment; transportation of heavy loads; plant construction and installation in petrochemical, steel, environmental, and power sectors; and fabrication and construction of bridges, such as road, railway, pedestrian, and water-pipe bridges, as well as maintains the function and performance of expressways. In addition, the company offers various services, such as the transportation of raw materials, intermediate materials, and internal products, as well as line operations, process control, and warehouse management services. Sankyu Inc. was founded in 1918 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0054",
        "website": "http://www.sankyu.co.jp",
        "full_time_employees": null
    },
    "9066.T": {
        "short_name": "NISSIN CORP",
        "long_name": "Nissin Corporation",
        "summary": "Nissin Corporation provides logistics services in Japan and internationally. The company operates through Logistics, Travel Service, and Real Estate segments. It offers ocean, air, and land transport services; customs clearance; and value-added logistics services, including warehouse receiving/delivering and stock control. The company also undertakes in-plant operations, including inventory control, R.H.D., packing, sorting, and other operations at customers' plants and warehouses; logistics center operations comprising integrated transport operations; logistics processing works consisting of integrated logistics, and forwarding stages from the factory and delivery to the stores; and container handling activities. In addition, it offers moving services, such as domestic and overseas moving, trunk rooms, and office relocation services; managed IT services; and shipping agency services, as well as operates in travel and real estate businesses. The company was formerly known as Nissin Transportation & Warehousing Co., Ltd. and changed its name to Nissin Corporation in October 1985. Nissin Corporation was founded in 1938 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": null,
        "website": "http://www.nissin-tw.com",
        "full_time_employees": null
    },
    "9068.T": {
        "short_name": "MARUZEN SHOWA UNYU CO",
        "long_name": "Maruzen Showa Unyu Co., Ltd.",
        "summary": "Maruzen Showa Unyu Co., Ltd. provides logistics services in Japan and internationally. It is involved in the freight truck transportation; forwarding through truck, rail, ocean, coastal, and air transport; harbor transport operations, such as general, stevedoring, and barge transportation; and warehousing, customs brokerage, packing, ocean shipping, and air shipping agent activities. The company also engages in the yard operations and machine stevedoring activities, including on-site moving, assembly, filling, and yard warehouse storage of raw materials, products, heavy loads, precision machinery, etc.; handling of incoming and outgoing shipments and related operations; and machinery rental activities. In addition, it offers construction, security, industrial waste disposal, insurance agency, and vehicle maintenance services. The company was founded in 1931 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "231-8419",
        "website": "http://www.maruzenshowa.co.jp",
        "full_time_employees": null
    },
    "9069.T": {
        "short_name": "SENKO GROUP HOLDINGS CO LTD",
        "long_name": "SENKO Group Holdings Co., Ltd.",
        "summary": "SENKO Group Holdings Co., Ltd., together with its subsidiaries, operates as a logistics company worldwide. The company operates through three segments: Distribution, Trading & Commerce, and Others. The Distribution segment is involved in truck transportation, marine transportation, logistic service, retail logistics, and railway forwarding activities. The Trading & Commerce segment engages in the sale of petroleum products; and trading business. The Others segment primarily provides data processing outsourcing, automobile maintenance, and insurance agency services. The company was formerly known as Senko Co., Ltd. and changed its name to SENKO Group Holdings Co., Ltd. in April 2017. SENKO Group Holdings Co., Ltd. was founded in 1916 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "135-0052",
        "website": "http://www.senkogrouphd.co.jp",
        "full_time_employees": 16693
    },
    "9070.T": {
        "short_name": "TONAMI HOLDINGS CO LTD",
        "long_name": "Tonami Holdings Co., Ltd.",
        "summary": "Tonami Holdings Co., Ltd. provides various logistics solutions in Japan. It operates through Logistics, Information Processing, and Sales segments. The company offers truck transportation, parcel delivery, air freight, moving, warehousing, international air freight, international parcel delivery, value-added network distribution, direct marketing, road haulage, and harbor transport services, as well as distribution services, such as storage, sorting, pricing, classification, packing, wrapping, and delivery services. The company also provides information processing and financial services. In addition, it is involved in the merchandising, consignment sales, non-life insurance agency, and trading businesses; sale of tires; and development and sale of software products. Tonami Holdings Co., Ltd. was incorporated in 1943 and is headquartered in Takaoka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Takaoka",
        "zipcode": "933-8788",
        "website": "http://www.tonamiholdings.co.jp",
        "full_time_employees": null
    },
    "9072.T": {
        "short_name": "NIKKON HOLDINGS CO LTD",
        "long_name": "Nikkon Holdings Co., Ltd.",
        "summary": "Nikkon Holdings Co., Ltd. engages in the cargo and truck transportation businesses in Japan and internationally. It operates through four segments: Transportation, Warehousing, Packaging, and Testing. The company is involved in the import and export of domestic and foreign goods; collection and disposal of waste; sale of automotive parts; dismantlement works; manufacture and sale of packaging raw materials; and sale oil of products. It is also engages in the design and manufacture of equipment related to logistics; processing and sales of machinery and equipment; assembly and dismantling activities; real estate leasing and general leasing activities; industry worker dispatch business; power generation business; sale of used antiques; manufacture and distribution of pharmaceuticals, quasi-drugs, cosmetics, and medical devices; and damage insurance agency and life insurance agency businesses. In addition, the company is involved in the transportation, warehousing, and testing of finished four wheeled vehicles and motorcycles, automotive parts, housing equipment, agricultural machinery, and others; and processing for distribution, delivery agency of automotive parts and others, and export packing and other operations. Further, it engages in the sale of petroleum products; machinery assembly and installation repair businesses; automobile maintenance business; lottery construction; and forwarding activities. The company was formerly known as Nippon Konpo Unyu Soko Co., Ltd. and changed its name to Nikkon Holdings Co., Ltd. in October 2015. Nikkon Holdings Co., Ltd. was founded in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0044",
        "website": "http://www.nikkon-hd.co.jp",
        "full_time_employees": 12579
    },
    "9083.T": {
        "short_name": "SHINKI BUS CO LTD",
        "long_name": "Shinki Bus Co.,Ltd.",
        "summary": "Shinki Bus Co.,Ltd. provides transportation services in Japan. The company offers passenger services, such as fixed-route buses, high-speed shared buses, chartered buses, and taxis, as well as postal transportation and automobile maintenance services. It also engages in the wholesale and retail of auto parts and supplies; sale of new and used cars; maintenance and repair of cars; and sale of life and non-life insurance products. In addition, the company sells, leases, and brokerages real estate properties; and operates restaurants and cafes, and outdoor facilities. Further, it provides travel, nursing care, cleaning and security, facility management, staffing, and advertisement services, as well as offers cosmetic and agricultural products. The company was formerly known as Shinki Sogo Jidosha K.K. and changed its name to Shinki Bus Co.,Ltd. in 1972. Shinki Bus Co.,Ltd. was founded in 1927 and is headquartered in Himeji, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Himeji",
        "zipcode": "670-0913",
        "website": "http://www.shinkibus.co.jp",
        "full_time_employees": null
    },
    "9090.T": {
        "short_name": "MARUWA UNYU KIKAN CO LTD",
        "long_name": "Maruwa Unyu Kikan Co.,Ltd.",
        "summary": "Maruwa Unyu Kikan Co.,Ltd. provides logistics services. Its 3PL services include low temperature food, medical order/medical, and room temperature logistics. The company is also involved in the collection and transportation of industrial waste; warehouse and storage business; and loan management business. In addition, it provides trucking, container transport, and other services. The company was founded in 1970 and is headquartered in Yoshikawa, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yoshikawa",
        "zipcode": "342-0008",
        "website": "http://www.momotaro.co.jp",
        "full_time_employees": 3031
    },
    "9099.T": {
        "short_name": "CHILLED & FROZEN LOGISTICS HLDG",
        "long_name": "Chilled & Frozen Logistics Holdings Co., Ltd.",
        "summary": "Chilled & Frozen Logistics Holdings Co., Ltd. engages in the low temperature food logistics business in Japan. It offers freight transportation and warehouse services. The company was founded in 2015 is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "162-0056",
        "website": "http://www.cflogi.co.jp",
        "full_time_employees": null
    },
    "9115.T": {
        "short_name": "MEIJI SHIPPING CO",
        "long_name": "Meiji Shipping Co., Ltd.",
        "summary": "Meiji Shipping Co., Ltd., through its subsidiaries, operates as a shipping company in Japan and internationally. The company operates through three segments: International Shipping Business, Hotel-Related Business, and Real Estate Leasing Business. It owns crude and product oil tankers, LNG and LPG carriers, car carriers, chip carriers, and bulk carriers that are operated primarily under time charter parties with shipping companies. The company offers shipping, ship management, and related transaction services; construction supervision, remodeling and inspection, and related services; and business planning, ship finance, and commercial management services. It is also involved in manning and training of seafarers; providing IT related solutions for vessels; marketing of marine equipment and parts; and building operation and management, as well as operation of nursery schools. In addition, the company sells machinery for ships and ports; rents housing; develops office buildings; offers tugboat, non-life and cancer insurance agency, forwarding, and catering services; and operates hotels, resorts, Chinese and Japanese restaurants, and a golf course. Meiji Shipping Co., Ltd. was founded in 1911 and is headquartered in Kobe, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kobe",
        "zipcode": "650-0037",
        "website": "http://www.meiji-group.com",
        "full_time_employees": null
    },
    "9145.T": {
        "short_name": "BEING HOLDINGS CO LTD",
        "long_name": "Being Holdings Co., Ltd.",
        "summary": "Being Holdings Co., Ltd. provides logistics consulting services. The company offers third party logistics services. It also provides passenger transportation, dispatch small taxis and large buses, and create sightseeing plans, as well as various transportation spaces such as chartered sightseeing taxis, VIP hire, wedding hire, and location bus. The company was founded in 1986 and is headquartered in Kanazawa, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kanazawa",
        "zipcode": "920-0356",
        "website": "http://being-group.jp",
        "full_time_employees": 874
    },
    "9304.T": {
        "short_name": "SHIBUSAWA WAREHOUSE CO",
        "long_name": "The Shibusawa Warehouse Co., Ltd.",
        "summary": "The Shibusawa Warehouse Co., Ltd. provides logistics and warehousing services in Japan and internationally. The company provides strategic logistics services, such as warehousing and distribution processing for various type of cargo; truck transportation services, including consolidated transportation, chartered transportation, and ocean freight container transportation for customer's logistics; and ocean and air import and export handling services comprising customs clearance, overland transport, and warehouse storage at departure and arrival ports and airports, as well as multimodal transportation services by land, sea, and air. It is also involved in customs clearance; EC fulfillment services; trade/intermediary business/management/leading of real estate; packaging/indication/storage of pharmaceuticals/quasi-drugs/cosmetics and medical equipment; planning/development/sales/operation management of information systems; employment agency; and livelihood support of non-covered long-term care insurance. The Shibusawa Warehouse Co., Ltd. was founded in 1897 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "135-8513",
        "website": "http://www.shibusawa.co.jp",
        "full_time_employees": null
    },
    "9308.T": {
        "short_name": "INUI GLOBAL LOGISTICS CO LTD",
        "long_name": "Inui Global Logistics Co., Ltd.",
        "summary": "Inui Global Logistics Co., Ltd. engages in shipping, warehousing, and realty businesses worldwide. The company offers dry bulk services, and vessel operating and leasing services. It transports various products, including grains, coal, lumber, nonferrous metals, and other dry bulk cargoes; and operates 28 vessels, such as 22 company-owned vessels with deadweights ranging from 23,000 metric tons to 56,000 metric tons. The company also provides warehousing services comprising storage/cargo handling, distributive processing, and delivery services; sea/air transportation services; and document and media storage services, and confidential documents disposal services. In addition, it builts and rents residential properties. Inui Global Logistics Co., Ltd. was founded in 1904 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0054",
        "website": "http://www.inui.co.jp",
        "full_time_employees": null
    },
    "9310.T": {
        "short_name": "JAPAN TRANSCITY CORP",
        "long_name": "Japan Transcity Corporation",
        "summary": "Japan Transcity Corporation engages in logistics business in Japan and internationally. The company provides warehousing, stevedoring, cargo transportation by automobiles, consigned freight forwarding and agency, international multi modal transportation, and agency services; and customs brokerage services. It also engages in the packaging, labeling, and storage of pharmaceutical products, quasi drugs, cosmetics, and medical products; power generation and electrical supply; and trading and leasing of containers, pallets, and other transport equipment and material handling equipment. In addition, the company trades in, manages, and leases properties; and designs, constructs, and manages civil engineering and construction works. Further, it provides sport facility management and vehicle maintenance services. Japan Transcity Corporation was founded in 1895 and is headquartered in Yokkaichi, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokkaichi",
        "zipcode": "510-8651",
        "website": "http://www.trancy.co.jp",
        "full_time_employees": null
    },
    "9311.T": {
        "short_name": "ASAGAMI CORPORATION",
        "long_name": "Asagami Corporation",
        "summary": "Asagami Corporation provides logistics services in Japan. The company offers warehousing services, such as deposition, consulting, and customized services; harbor services, including marine transportation, container handling, and customs clearance; land transportation services; and third party logistics services comprising logistics network design, and warehousing and transportation services. It also provides newspaper, New Year's card, and wedding card printing services; and air cargo services consisting of air cargo forwarding, customs brokerage arrangement, and packaging and crating services. In addition, the company offers information technology logistics management services, such as transaction and inventory management, consolidation, continuous move management, carrier management, cargo/carrier matching systems, and data exchange with ERP/SCM software through global logistics network. The company was founded in 1948 and is headquartered in Tokyo, Japan. Asagami Corporation is a subsidiary of OA Corporation.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.asagami.co.jp",
        "full_time_employees": null
    },
    "9312.T": {
        "short_name": "KEIHIN CO LTD",
        "long_name": "The Keihin Co., Ltd.",
        "summary": "The Keihin Co., Ltd. provides logistics services worldwide. It primarily offers port, inland, sea, and air cargo transport services. The company's services include warehousing/distribution center, mail-order support, and domestic cargo transport, including trucking and marine container transport; and thermal, port construction, wind power/biomass, mining development, power substation, road/bridge, and hospital/ forest preservation/water supply projects cargo transport; export car handling, and customs clearance. It also provides domestic logistics IT systems, such as system for providing information on inventories at warehouses, logistics EDI system, and cargo tracking system; and global logistics IT systems comprising cargo-track and trace, and export motor vehicle loading information system, as well as system for providing information on import seaborne shipments. In addition, the company offers real estate, and transportation and handling equipment brokerage; and worker dispatching undertaking services. Further, it engages in the packaging, labeling, warehousing and distribution, and sale of medicines, quasi-drugs, cosmetics, and medical equipment. The Keihin Co., Ltd. was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-8456",
        "website": "http://www.keihin.co.jp",
        "full_time_employees": null
    },
    "9326.T": {
        "short_name": "KANTSU CO LTD",
        "long_name": "Kantsu Co.,Ltd.",
        "summary": "Kantsu Co., Ltd provides logistics services at 13 locations in Japan. It offers logistics outsourcing services; in-house distribution center operation transfer services; refrigerated distribution center services; and logistics consulting services. Kantsu Co.,Ltd. Was founded in 1986 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Higashi",
        "zipcode": "577-0015",
        "website": "http://www.kantsu.com",
        "full_time_employees": 285
    },
    "9355.T": {
        "short_name": "RINKO CORP",
        "long_name": "Rinko Corporation",
        "summary": "Rinko Corporation provides transportation services in Japan and internationally. The company offers port and freight transportation services, and logistic services; and engages in the warehousing, custom clearance, air cargo handling, and real estate business. It is also involved in shipping and insurance agency business, and product and machines sales business, as well as Industrial waste treatment industry, etc. The company was formerly known as Niigata Shinko Development and changed its name to Rinko Corporation in 1991. Rinko Corporation was founded in 1905 and is headquartered in Niigata, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Niigata",
        "zipcode": "950-8540",
        "website": "http://www.rinko.co.jp",
        "full_time_employees": null
    },
    "9358.T": {
        "short_name": "UTOC CORPORATION",
        "long_name": "Utoc Corporation",
        "summary": "Utoc Corporation provides ports, logistics, and plants services in Japan. The company offers ship loading and unloading services for container ships, car carriers, conventional ships, roll-on/roll-off (RO/RO) vessels, and heavy goods ships; operates container and RO/RO vessel terminals; and provides ship space booking and import/export customs clearance services. It also offers logistics services, including import/export, customs clearance, and warehousing of various items, as well as marine, overland, and intermodal transportation services. In addition, the company engages in the design, planning, construction, and maintenance of thermal, nuclear, or wind power plants, as well as petrochemical and chemical plants. Further, it is involved in the general cargo automobile transportation, as well as cargo transport consignment, construction, and real estate businesses. The company was formerly known as Utoku Express Co., Ltd. and changed its name to Utoc Corporation in 1994. The company was founded in 1890 and is headquartered in Yokohama, Japan. Utoc Corporation is a subsidiary of Mitsui O.S.K. Lines, Ltd.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "231-0007",
        "website": "http://www.utoc.co.jp",
        "full_time_employees": null
    },
    "9363.T": {
        "short_name": "DAIUN CO LTD",
        "long_name": "Daiun Co.,Ltd.",
        "summary": "Daiun Co.,Ltd. operates as a cargo handling company in Japan and internationally. It offers sea freight handling and forwarding services; and seaborne forwarding, harbor transport, trucking, road transport, warehousing, customs brokerage, air freight handling, travel interceding, proxy for shippers, accident insurance handling, automobiles damages, and other related services. The company was formerly known as Osaka Shipping Co., Ltd. and changed its name to Daiun Co.,Ltd. in January 1962. Daiun Co.,Ltd. was incorporated in 1945 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0056",
        "website": "http://www.daiunex.co.jp",
        "full_time_employees": 168
    },
    "9364.T": {
        "short_name": "KAMIGUMI CO LTD",
        "long_name": "Kamigumi Co., Ltd.",
        "summary": "Kamigumi Co., Ltd. provides an integrated logistics services in Japan and internationally. The company offers harbor transportation services; warehousing storage and distribution processing services; and truck, air, and rail transportation services, as well as sea freight services. It also provides on-site factory services, including loading and unloading of ship-borne raw materials; transportation of materials to sites; and provision of secondary processing, product controls/shipping work, and environmental response work services. In addition, the company offers heavy cargo transportation services for transformer plants, industrial equipment, petrochemical plant equipment, and railcars. Further, it provides construction services for housing, warehouses, offices, and stores; offers breakdown and disposal services for large equipment and facilities, such as steel plant rolling mill production lines and large conveyor systems for sand and rock; designs and constructs steel structures; constructs and maintains amusement facilities; and provides machinery maintenance services. Additionally, the company engages in apartment rental; alcoholic beverage production; and restaurant businesses. It also develops and leases commercial facilities, operates parking areas, and cultivates tomatoes. Kamigumi Co., Ltd. was founded in 1867 and is headquartered in Kobe, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kobe",
        "zipcode": "651-0083",
        "website": "http://www.kamigumi.co.jp",
        "full_time_employees": 4308
    },
    "9366.T": {
        "short_name": "SANRITSU CORP",
        "long_name": "Sanritsu Corporation",
        "summary": "Sanritsu Corporation engages in the packaging business in Japan and internationally. It offers steel, wooden box, wooden frame, and reinforced cardboard and cardboard packing products. The company also offers truck transportation, warehouse storage, and cargo handling services. In addition, it provides bonded and customer clearance services; and air and sea transport arrangement services. The company was founded in 1948 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0075",
        "website": "http://www.srt.co.jp",
        "full_time_employees": null
    },
    "9369.T": {
        "short_name": "K.R.S.CORP",
        "long_name": "K.R.S. Corporation",
        "summary": "K.R.S. Corporation provides logistics services in Japan and internationally. The company offers various services, including warehousing, freight forwarding, intermediary transport agency, motor truck transportation, and customs clearance services, as well as packing and delivery services, etc. for bottled/canned products, and other general goods. It also sells and leases vehicles and logistics-related machinery and equipment; sells industrial and automotive fuel and oil; and sells commodity goods and food products, such as fresh, preserved, and processed food products, as well as rents and leases real estate properties. In addition, the company offers automotive wrecking and maintenance services; insurance agency services; logistics information and consulting on logistics operations; and worker dispatch and various related services. K.R.S. Corporation was founded in 1966 and is headquartered in Chofu, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Chofu",
        "zipcode": "182-0021",
        "website": "http://www.krs.co.jp",
        "full_time_employees": 6342
    },
    "9375.T": {
        "short_name": "KINTETSU WORLD EXPRESS",
        "long_name": "Kintetsu World Express, Inc.",
        "summary": "Kintetsu World Express, Inc., together with its subsidiaries, provides air freight forwarding, sea freight forwarding, customs brokerage, logistics, and other services in Japan, the Americas, Europe, the Middle East, Africa, East Asia, Oceania, and Southeast Asia. The company offers air freight services, including air freight forwarding services, trucking services for pick-up and delivery, customs brokerage, and customized packing services, as well as precision machinery installation services. It also provides sea freight services comprising sea freight forwarding, container drayage, trucking services for pick-up and delivery, customs brokerage, buyer's consolidation, and PO management services. In addition, the company offers contract logistics services comprising PO and inventory control management services, cross dock and call center operations, assembly works, products inspections, vendor managed inventory, etc.; logistics consulting services; truck, trailer, and rail transportation services; and finished vehicles and auto parts transportation services. Further, it provides temporary staffing primarily for logistic and trading businesses; transports art objects and other materials for events and exhibitions; and offers hand carry services. Kintetsu World Express, Inc. was founded in 1948 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-6024",
        "website": "http://www.kwe.com",
        "full_time_employees": 17339
    },
    "9384.T": {
        "short_name": "NAIGAI TRANS LINE LTD",
        "long_name": "Naigai Trans Line Ltd.",
        "summary": "Naigai Trans Line Ltd. provides integrated logistics services in Japan and internationally. It offers ocean freight, air cargo, and warehousing services, as well as export cargo consolidation services. The company also provides project cargo services, including packing, custom clearance, storage, transportation, and installation of machinery and equipment. Naigai Trans Line Ltd. was formerly known as Naigai Shipping Co., Ltd. and changed its name to Naigai Trans Line Ltd. in December 1986. The company was founded in 1980 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0051",
        "website": "http://www.ntl-naigai.co.jp",
        "full_time_employees": 644
    },
    "KGU.F": {
        "short_name": "KAMIGUMI CO. LTD",
        "long_name": "Kamigumi Co., Ltd.",
        "summary": "Kamigumi Co., Ltd. provides an integrated logistics services in Japan and internationally. The company offers harbor transportation services; warehousing storage and distribution processing services; and truck, air, and rail transportation services, as well as sea freight services. It also provides on-site factory services, including loading and unloading of ship-borne raw materials; transportation of materials to sites; and provision of secondary processing, product controls/shipping work, and environmental response work services. In addition, the company offers heavy cargo transportation services for transformer plants, industrial equipment, petrochemical plant equipment, and railcars. Further, it provides construction services for housing, warehouses, offices, and stores; offers breakdown and disposal services for large equipment and facilities, such as steel plant rolling mill production lines and large conveyor systems for sand and rock; designs and constructs steel structures; constructs and maintains amusement facilities; and provides machinery maintenance services. Additionally, the company engages in apartment rental; alcoholic beverage production; and restaurant businesses. It also develops and leases commercial facilities, operates parking areas, and cultivates tomatoes. Kamigumi Co., Ltd. was founded in 1867 and is headquartered in Kobe, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Kobe",
        "zipcode": "651-0083",
        "website": "http://www.kamigumi.co.jp",
        "full_time_employees": null
    },
    "MIB.F": {
        "short_name": "MITSUBISHI LOGISTICS",
        "long_name": "Mitsubishi Logistics Corporation",
        "summary": "Mitsubishi Logistics Corporation provides logistic services in Japan and internationally. The company operates through Logistics and Real Estate segments. It offers warehousing and distribution center services, and truck transportation services. The company operates ports and harbors; and provides railway, ocean, and air cargo transportation, as well as import/export customs clearance services. It is also involved in the purchase, leasing, management, and construction of real estate; and provision of ship registration services and other related services. The company was formerly known as Mitsubishi Warehouse Co., Ltd. and changed its name to Mitsubishi Logistics Corporation in 1996. Mitsubishi Logistics Corporation was founded in 1887 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8630",
        "website": "http://www.mitsubishi-logistics.co.jp",
        "full_time_employees": 4625
    },
    "NEX.F": {
        "short_name": "NIPPON EXPRESS CO.",
        "long_name": "Nippon Express Co., Ltd.",
        "summary": "Nippon Express Co., Ltd., together with its subsidiaries, provides logistics services. The company operates through Logistics, Security Transportation, Heavy Haulage & Construction, and Logistics Support segments. It offers rail freight forwarding, truck transportation, truck freight forwarding, marine transportation, coastal shipping, harbor transportation, NVOCC marine transportation, air freight forwarding, and other transportation and forwarding services. The company also provides freight transportation consignment, warehousing, construction, customs-clearance, freight collection and settlement, and air freight forwarding agency services, as well as non-life insurance agency services. In addition, it engages in the packing; packaging, labeling, and storage business for pharmaceuticals, quasi-pharmaceuticals, cosmetics, and medical equipment; travel agency business; transportation, construction, and installation of heavy goods and various incidental business; purchase, sale, and lease of real estate; security and general worker dispatching business; waste management operations; delivery activities; collection and processing of logistics information; and sale of goods and commodities. Further, the company is involved in investing and financing of various businesses. It operates in Japan, the Americas, Europe, East Asia, South Asia and Oceania, and Africa. The company was founded in 1872 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8322",
        "website": "http://www.nipponexpress.com",
        "full_time_employees": null
    },
    "NPEXY": {
        "short_name": "NIPPON EXPRESS CO",
        "long_name": "Nippon Express Co., Ltd.",
        "summary": "Nippon Express Co., Ltd., together with its subsidiaries, provides logistics services. The company operates through Logistics, Security Transportation, Heavy Haulage & Construction, and Logistics Support segments. It offers rail freight forwarding, truck transportation, truck freight forwarding, marine transportation, coastal shipping, harbor transportation, NVOCC marine transportation, air freight forwarding, and other transportation and forwarding services. The company also provides freight transportation consignment, warehousing, construction, customs-clearance, freight collection and settlement, and air freight forwarding agency services, as well as non-life insurance agency services. In addition, it engages in the packing; packaging, labeling, and storage business for pharmaceuticals, quasi-pharmaceuticals, cosmetics, and medical equipment; travel agency business; transportation, construction, and installation of heavy goods and various incidental business; purchase, sale, and lease of real estate; security and general worker dispatching business; waste management operations; delivery activities; collection and processing of logistics information; and sale of goods and commodities. Further, the company is involved in investing and financing of various businesses. It operates in Japan, the Americas, Europe, East Asia, South Asia and Oceania, and Africa. The company was founded in 1872 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8322",
        "website": "http://www.nipponexpress.com",
        "full_time_employees": null
    },
    "SNK.F": {
        "short_name": "SANKYU INC.",
        "long_name": "Sankyu Inc.",
        "summary": "Sankyu Inc. provides logistics services in Japan, North and South America, rest of Asia, and internationally. The company offers logistics solutions, such as consulting, air freight, international multi-modal transport, trucking, and customs brokerage services; and operates warehouse and distribution centers, and container terminals. It also provides plant engineering and installation services, including plant design and engineering; fabrication and processing of plant equipment, piping, steel, steel-frame and offshore structures, bridges, and transportation equipment; transportation of heavy loads; plant construction and installation in petrochemical, steel, environmental, and power sectors; and fabrication and construction of bridges, such as road, railway, pedestrian, and water-pipe bridges, as well as maintains the function and performance of expressways. In addition, the company offers various services, such as the transportation of raw materials, intermediate materials, and internal products, as well as line operations, process control, and warehouse management services. Sankyu Inc. was founded in 1918 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0054",
        "website": "http://www.sankyu.co.jp",
        "full_time_employees": null
    }
}