{
    "2137.S": {
        "short_name": "HIKARI HEIGHTS-VARUS CO.LTD.",
        "long_name": "Hikari Heights-Varus Co.,Ltd.",
        "summary": "Hikari Heights-Varus Co.,Ltd. operates and manages nursing homes in Japan. Hikari Heights-Varus Co.,Ltd. was founded in 1987 and is headquartered in Sapporo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SAP",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sapporo",
        "zipcode": "064-0919",
        "website": "http://www.varus.co.jp",
        "market_cap": "Small Cap"
    },
    "2150.T": {
        "short_name": "CARENET INC",
        "long_name": "CareNet, Inc.",
        "summary": "CareNet, Inc. provides pharmaceutical sales support services for pharmaceutical companies in Japan. It offers medical content services for doctors and healthcare professionals. The company offers CareNet.com, a membership-based medical and medical information site for daily clinical practice; PubMedCLOUD, a tool for searching and managing PubMed articles in Japanese; Doctors'Picks, a site where doctors gather specialized news that they want their doctors to read; CareNeTV, a clinical medicine channel; CareNet DVD, a clinical medical education DVD teaching material; and CareNet Career, a service that guides candidates for work in response to the needs of CareNet members, such as doctors for changing jobs and seeking employment. It also provides MR Plus, a service that distributes medical information from pharmaceutical companies to CareNet doctor members via internet; and Web lecture, a service that live-streams lectures. The company was incorporated in 1996 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0074",
        "website": "http://www.carenet.co.jp",
        "market_cap": "Small Cap"
    },
    "2373.T": {
        "short_name": "CARE TWENTYONE CORP",
        "long_name": "Care Twentyone Corporation",
        "summary": "Care Twentyone Corporation provides nursing care services in Japan. The company offers visiting nursing, home nursing, home care support, and day care services. It also sells and rents welfare equipment; provides housing repair, light work contracting, education, temporary staffing, food service/food distribution dining, medical support, disability support, school lunch, childcare, and bus services; develops real estate; and offers marriage consultation brokerage services. The company was founded in 1993 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0003",
        "website": "http://www.care21.co.jp",
        "market_cap": "Small Cap"
    },
    "2374.T": {
        "short_name": "SAINT-CARE HOLDING CORPORATION",
        "long_name": "Saint-Care Holding Corporation",
        "summary": "Saint-Care Holding Corporation provides healthcare services in Japan. The company offers visiting care and nursing, visit bathing, short-stay daily-life care, small-scale and multifunction type in-home care, in-home long-term care management, and day care services; daily-life care services for the elderly with dementia; and personnel dispatch, outsourcing, and software services, as well as assisted living facilities. It also engages in the home renovation business; sale and rental of social welfare equipment; and care robot and other businesses. The company was founded in 1983 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0031",
        "website": "http://www.saint-care.com",
        "market_cap": "Small Cap"
    },
    "2398.T": {
        "short_name": "TSUKUI HOLDINGS CORP",
        "long_name": "Tsukui Holdings Corporation",
        "summary": "Tsukui Holdings Corporation provides various home and nursing care services in Japan. It operates through four segments: Home Care, Pay Nursing Home, Assisted-Living Facilities, and Human Resource Development. The company offers day care services; and operates sheltered nursing homes. It also provides living quarters that offers daily-life support and nursing care services for elderly. In addition, the company provides worker dispatching and employment placement services primarily for the medical and nursing care sectors. Further, it is involved in the leasing of vehicles and various types of assistive devices; development of IoT, AI, robots, etc. for the nursing, welfare, and medical fields; and sale of merchandise comprising nursing care related equipment and supplies, such as diapers and wheelchairs through the Internet shopping malls. As of March 31, 2019, the company operated 692 facilities. The company was formerly known as Tsukui Corporation and changed its name to Tsukui Holdings Corporation in September 2020. Tsukui Holdings Corporation was founded in 1969 and is headquartered in Yokohama, Japan. As of March 24, 2021, Tsukui Holdings Corporation operates as a subsidiary of MBKP Life LLC.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": null,
        "website": "http://www.tsukui-hd.co.jp",
        "market_cap": "Small Cap"
    },
    "2435.T": {
        "short_name": "CEDAR. CO LTD",
        "long_name": "CEDAR.Co.,Ltd.",
        "summary": "CEDAR.Co.,Ltd. provides nursing care and rehabilitation services in Japan. It offers day care, resident life care, home-visit nursing care, home help, home care support, group home, and short term residency care services. The company was founded in 1981 and is headquartered in Kitakyushu, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kitakyushu",
        "zipcode": null,
        "website": "http://www.cedar-web.com",
        "market_cap": "Small Cap"
    },
    "6029.T": {
        "short_name": "ARTRA GROUP CORPORATION",
        "long_name": "Artra Group Corporation",
        "summary": "Artra Group Corporation provides support services for acupuncture and osteopathic hospitals in Japan. The company offers billing services; and HONEY-STYLE, a system, which specializes in word-of-mouth/reservation system for acupuncture and moxibustion hospital. It also operates Atlas Store, an EC site that sells consumables for acupuncture and moxibustion hospital; and a portal site providing information for judo reduction teachers, acupuncturists/kyu teachers, and anma massage shiatsu teachers through its website and e-mail magazine, as well as offers nursing care services. The company was formerly known as artra corporation and changed its name to Artra Group Corporation in 2021. Artra Group Corporation was founded in 2005 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "550-0012",
        "website": "http://www.artra-group.co.jp",
        "market_cap": "Small Cap"
    },
    "6059.T": {
        "short_name": "UCHIYAMA HLDGS CO LTD",
        "long_name": "UCHIYAMA HOLDINGS Co.,Ltd.",
        "summary": "UCHIYAMA HOLDINGS Co.,Ltd. offers nursing care services in Japan. It is also involved in the real estate, karaoke, restaurant, and hotel businesses. The company was founded in 2006 and is headquartered in Kitakyushu, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kitakyushu",
        "zipcode": "802-0044",
        "website": "http://www.uchiyama-gr.jp",
        "market_cap": "Small Cap"
    },
    "6062.T": {
        "short_name": "CHARM CARE CORPORATION",
        "long_name": "Charm Care Corporation",
        "summary": "Charm Care Corporation engages in nursing care business. It operates fee-based nursing homes that offer nursing-assisted living care services. The company was formerly known as Fuji Clinic Laboratory and changed its name to Charm Care Corporation in December 2007. Charm Care Corporation was founded in 1984 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0005",
        "website": "http://www.charmcc.jp",
        "market_cap": "Small Cap"
    },
    "6063.T": {
        "short_name": "EMERGENCY ASSISTANCE JAPAN CO L",
        "long_name": "Emergency Assistance Japan Co., Ltd.",
        "summary": "Emergency Assistance Japan Co., Ltd. provides medical and lifestyle assistance services in Japan and internationally. It also offers security assistance program, student security management assistance, and emergency response services, as well as assistance services for foreign nationals. The company was founded in 2003 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "112-0002",
        "website": "http://www.emergency.co.jp",
        "market_cap": "Small Cap"
    },
    "6197.T": {
        "short_name": "SOLASTO CORPORATION",
        "long_name": "Solasto Corporation",
        "summary": "Solasto Corporation provides medical outsourcing services primarily to medical institutions in Japan. The company's medical outsourcing services include contracted services of medical clerical work. It also offers elderly care services, such as day service, home help, facility-based service, etc.; and childcare services, as well as engages in the education business. The company was formerly known as N.I.C Corporation. Solasto Corporation was founded in 1965 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-8210",
        "website": "http://www.solasto.co.jp",
        "market_cap": "Small Cap"
    },
    "7037.T": {
        "short_name": "TENO HOLDINGS CO LTD",
        "long_name": "teno. Holdings Company Limited",
        "summary": "teno. Holdings Company Limited provides public and consignment childcare services in Japan. The company provides public childcare services, such as operation of a nursery school and a childcare facility. It also offers contract childcare services, such as in-hospital/institutional childcare/company-led childcare; after-school childcare; and after school children's classroom promotion project, such as playground creation. In addition, the company offers home services, including babysitter, mothering, housework, staffing/dispatch, school (tenoschool), temporary childcare at the event, and nursing services. Holdings Company Limited was founded in 2015 and is headquartered in Fukuoka, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuoka City",
        "zipcode": "812-0036",
        "website": "http://www.teno.co.jp",
        "market_cap": "Small Cap"
    },
    "7061.T": {
        "short_name": "JAPAN HOSPICES HLDGS INC",
        "long_name": "Japan Hospice Holdings Inc.",
        "summary": "Japan Hospice Holdings Inc. engages in hospice housing and home care businesses in Japan. The company offers care services at hospice housing for patients with terminal cancer and intractable diseases; and home-visit nursing services. It also provides home care services, which supports medical care, including physical care and life support, as well as offers day and nursing multi-function home care services. The company was founded in 2017 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.jhospice.co.jp",
        "market_cap": "Small Cap"
    },
    "7071.T": {
        "short_name": "AMVIS HOLDINGS INC",
        "long_name": "Amvis Holdings, Inc.",
        "summary": "Amvis Holdings, Inc. provides medical and nursing care services in Japan. It operates medical centers in Aomori, Iwate, Miyagi, Yamagata, Ibaraki, Tochigi, Saitama, Tokyo, Kanagawa, Niigata, Gifu, and Aichi. The company was founded in 2013 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0028",
        "website": "http://www.amvis.co.jp",
        "market_cap": "Small Cap"
    },
    "7090.T": {
        "short_name": "LIGUA INC",
        "long_name": "Ligua Inc.",
        "summary": "Ligua Inc., a consultancy company, provides management support services in the healthcare industry. The company offers consulting services in the areas of sales office operations, such as sales improvement, organizational management, executive education, and recruitment; and corporate management areas comprising management of management figures and creation of business plans. It also provides problem solving tools for osteopaths; and insurance agency and financial products brokerage, and medical expenses billing agency services. Ligua Inc. was founded in 2004 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0047",
        "website": "http://ligua.jp",
        "market_cap": "Small Cap"
    },
    "7097.T": {
        "short_name": "SAKURASAKU PLUS CO LTD",
        "long_name": "Sakurasaku plus Co.,Ltd.",
        "summary": "Sakurasaku plus Co.,Ltd. provides real estate brokerage and management services. It also operates child daycare centers. The company was founded in 2017 and is headquartered in Chiyoda, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0006",
        "website": "http://www.sakurasakuplus.jp",
        "market_cap": "Small Cap"
    },
    "7362.T": {
        "short_name": "TERMINALCARE SUPPORT INSTITUTE ",
        "long_name": "Terminalcare Support Institute Inc.",
        "summary": "Terminalcare Support Institute Inc. provides home-visit long-term care, long-term care preventive home-visit, home care support, and serviced housing for the elderly. The company was founded in 2010 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "615-8074",
        "website": "http://www.t-s-i.jp",
        "market_cap": "Small Cap"
    },
    "7363.T": {
        "short_name": "BABY CALENDAR INC",
        "long_name": "baby calendar Inc.",
        "summary": "baby calendar Inc. operates an information site for pregnancy, childbirth, and childcare in Japan. The company also operates a gift acceptance site; Moon Calendar, an information site that provides various information about menstruation; Woman Calendar, an anti-aging site for women by women; and long-term calendar, an information site that provides information for nursing care facilities for the elderly people. In addition, the company provides First gift card, a picture book with the pictures of the baby under the dacco brand name; and management support solutions in the areas of obstetrics and gynecology. Further, it offers touch panel monitors; and web marketing services. The company was formerly known as Cookpad Baby Co., Ltd. and changed its name to baby calendar Inc. in May 2017. baby calendar Inc. was founded in 1991 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "151-0053",
        "website": "http://corp.baby-calendar.jp",
        "market_cap": "Small Cap"
    },
    "7688.T": {
        "short_name": "MIAHELSA CORP",
        "long_name": "Miahelsa Corporation",
        "summary": "Miahelsa Corporation engages in pharmaceutical, nursing care, childcare, and food businesses in Japan. The company operates dispensing pharmacies and nursery schools; and sells food ingredients. It operates 41 dispensing pharmacies; and 21 nursery schools, 1 certified nursery school, and 1 hospital nursery school. The company was founded in 1984 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "162-0054",
        "website": "http://www.merhalsa.jp",
        "market_cap": "Small Cap"
    },
    "9707.T": {
        "short_name": "UNIMAT SOYOKAZE CO. LTD.",
        "long_name": "UNIMAT Retirement Community Co.,Ltd.",
        "summary": "UNIMAT Retirement Community Co., Ltd. engages in the nursing care and retirement community businesses in Japan. The company offers nursing care services, such as day service, short stay, home-visit nursing care, home with nursing care, and housing for the elderly with services; meal delivery services; life planning services; recruiting services; and senior service consulting services. It also operates Hotel Allamanda Aoyama in Aoyama, Tokyo; and Allamanda Spa Aoyama Club, as well as restaurants, cafes, spas, fitness, and housing for seniors. In addition, the company processes and sells coffee beans; and developing services for enhancing long-term care operations, and maintains and improves the health of seniors utilizing big data, AI, sensors, etc. The company was formerly known as Unimat Soyokaze Co., Ltd. and changed its name to UNIMAT Retirement Community Co., Ltd. in October 2015. UNIMAT Retirement Community Co., Ltd. was founded in 1974 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0061",
        "website": "http://www.unimat-rc.co.jp",
        "market_cap": "Small Cap"
    },
    "KAN.F": {
        "short_name": "UNIMAT RETIREM.COMMUNITY",
        "long_name": "UNIMAT Retirement Community Co.,Ltd.",
        "summary": "UNIMAT Retirement Community Co., Ltd. engages in the nursing care and retirement community businesses in Japan. The company offers nursing care services, such as day service, short stay, home-visit nursing care, home with nursing care, and housing for the elderly with services; meal delivery services; life planning services; recruiting services; and senior service consulting services. It also operates Hotel Allamanda Aoyama in Aoyama, Tokyo; and Allamanda Spa Aoyama Club, as well as restaurants, cafes, spas, fitness, and housing for seniors. In addition, the company processes and sells coffee beans; and developing services for enhancing long-term care operations, and maintains and improves the health of seniors utilizing big data, AI, sensors, etc. The company was formerly known as Unimat Soyokaze Co., Ltd. and changed its name to UNIMAT Retirement Community Co., Ltd. in October 2015. UNIMAT Retirement Community Co., Ltd. was founded in 1974 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0061",
        "website": "http://www.unimat-rc.co.jp",
        "market_cap": "Small Cap"
    }
}