{
    "3359.T": {
        "short_name": "COTTA CO LTD",
        "long_name": "cotta CO.,LTD",
        "summary": "cotta CO.,LTD manufactures and sells confectionary food materials and food packaging materials in Japan. It offers packing materials, including cake boxes, handbags, wrapping papers, ribbons, and freshness keeping agents, as well as confectionary materials, such as butter and wheat flour. The company serves candy stores, bakeries, and individuals. It also sells its products through mail orders. The company was formerly known as Taisei Co.,Ltd (Fukuoka) and changed its name to cotta CO.,LTD in March 2020. cotta CO.,LTD was founded in 1998 and is headquartered in Tsukumi, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tsukumi"
    },
    "3941.T": {
        "short_name": "RENGO CO",
        "long_name": "Rengo Co., Ltd.",
        "summary": "Rengo Co., Ltd., together with its subsidiaries, manufactures and sells paperboard and packaging-related products in Japan and internationally. The company operates through four segments: Paperboard and Packaging-Related Business, Flexible Packaging-Related Business, Heavy Duty Packaging-Related Business, and Overseas Business. It offers paperboard products, such as containerboards, boxboards, tube boards, chipboards, and processed paper products; corrugated packaging products, including smart display packaging, functional and decorative corrugated products, and support systems for mail-order packaging, as well as materials for distribution, shipping, and construction; and folding cartons comprising general purpose cartons, gift packaging products, and multi-packs, as well as sales promotion tools. The company also provides flexible packaging products, such as film packaging products; shrink and roll on, and roll labels for PET and glass bottles; and cellophane, a film. In addition, it offers heavy duty packaging products, such as flexible container, heavy-duty polyethylene, and kraft paper bags, as well as heavy duty corrugated packaging products. Further, the company provides packaging machinery, including packaging systems for mail order, wraparound and setup forming machines, box/tray making machines, sealing machines, box opening systems, ink-jet printers, and other machines. Additionally, it offers functional materials, such as porous cellulose beads, high-function pulp products, gas adsorption sheets, viscose-processed papers, natural anti-bacterial/anti-mold agents, and tinted films; water-absorbent mats and sheets, cushioning mats, and nonwoven products; and sealing-materials, including kraft tape, OPP tape, fabric tape, and hot-melt packaging products. The company is also involved in the transportation, insurance agency, leasing, and real estate businesses. Rengo Co., Ltd. was founded in 1909 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "3943.F": {
        "short_name": "OHISHI SANGYO CO",
        "long_name": "Ohishi Sangyo Co., Ltd.",
        "summary": "Ohishi Sangyo Co., Ltd. manufactures and sells industrial packaging materials in Japan. It offers pulp moulds that are used in livestock, agricultural, and industrial applications; and thermoplastic films, such as polystyrene and T-die embossed films, and polyethylene bags, as well as film coatings. The company also provides heavy duty bags, including multi-walled sack kraft bags, which are used for chemicals, plastics, flours, foods, animal feeds, and fertilizers, as well as form fill seals for use in plastics, such as poly-olefins; and corrugated boards that are used for industrial and agricultural applications. In addition, it offers cradle, a container for packing strawberries. The company was founded in 1947 and is based in Kitakyushu, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "FKA",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kitakyushu"
    },
    "3944.T": {
        "short_name": "FURUBAYASHI SHIKO CO",
        "long_name": "Furubayashi Shiko Co.,Ltd.",
        "summary": "Furubayashi Shiko Co.,Ltd. plans, designs, manufactures, and sells packaging products in Japan and internationally. The company offers gift boxes for gifts, special moisture-proof papers, paper tubes, carry cartons, cosmetic cardboard boxes, bag-in-cartons, system cartons, etc., as well as printing products for food, beverages, confectionery, chemicals, soaps, detergents, cosmetics, miscellaneous goods, electric appliances, and agricultural products. It also provides materials, such as cellophane, resin film, metal foil, liquid, solid, powder, etc.; and packaging materials, including bags, standing pouches, labels, etc. In addition, the company offers laminations comprising paperboards, papers, resin films, metal foils, and barrier coatings; molded containers, which include synthetic resin containers, synthetic resins, and paperboards; and commercial printed matter, such as flyers, catalogs, posters, POP, storefront displays, etc. Further, it provides filling, packaging, and multi-pack packaging machineries; labeling systems and labelers; vertical/horizontal cartoning and integrated packaging machines; and packaging streamlining and engineering services, as well as contract packaging services for confectionery, food, cosmetics, miscellaneous goods, etc. The company was founded in 1934 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "3946.T": {
        "short_name": "TOMOKU CO LTD",
        "long_name": "Tomoku Co., Ltd.",
        "summary": "Tomoku Co., Ltd. manufactures and sells corrugated packaging, paper containers, and other forms of packaging indispensables for logistics and distribution businesses in Japan and internationally. The company also engages in the construction and sale of Swedish style houses; provision of logistics and insurance brokerage services; and sale of domestic and overseas materials and machinery. In addition, the company imports-exports housing-related materials; renovates, extends, and reconstructs general houses and condominiums; provides wooden truss of roofs and floors for small houses; and transports, warehouses, operates, and recycles food containers. Further, it provides automobile-inspection services, as well as warehousing, factory works, and worker dispatching services; manages food and beverage distribution center, and delivery operation; and manufactures housing components for Sweden house. The company was formerly known as Toyo Wood Products Co., Ltd. and changed its name to Tomoku Co., Ltd. in January 1971. Tomoku Co., Ltd. was founded in 1940 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3947.T": {
        "short_name": "DYNAPAC CO LTD",
        "long_name": "Dynapac Co., Ltd.",
        "summary": "Dynapac Co., Ltd. manufactures and sells packaging materials in Japan and internationally. The company offers corrugated boards, paper cushioning materials, digital printing products, cardboard products, printing paper containers, flexible packaging, pulp molds, cardboard cushioning material, cardboard pallets, cardboard furniture, functional cardboards, and plastic corrugated plastic products. Its products are used in various industries, such as electrical/ machinery, chemicals/detergents, processed foods/fruits and vegetables, textiles, pottery/glass, mail order, etc. The company was founded in 2005 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Nagoya"
    },
    "3953.T": {
        "short_name": "OHMURA SHIGYO CO",
        "long_name": "Ohmura Shigyo Co.,Ltd.",
        "summary": "Ohmura Shigyo Co.,Ltd. manufactures and sells corruball products in Japan. It offers sheets, cases, cardboards, and pallets, and label products, as well as auxiliary material products. The company was founded in 1965 and is headquartered in Chigasaki, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Chigasaki"
    },
    "3954.T": {
        "short_name": "SHOWA PAXXS CORP",
        "long_name": "Showa Paxxs Corporation",
        "summary": "Showa Paxxs Corporation manufactures and sells packaging containers and materials in Japan and internationally. It offers Kraft paper bags, such as flash pinch, double pinch, SES pinch, sunny easy pack, easy pack, Z hold, single and double bottom, echo, SCE, rice wheat, bax, and elpax bags, as well as bag in bags; medium sized bags for rice milling; polyethylene heavy bags; and Showa traceability systems. The company also provides containers for powder grains and liquids; and packaging machine equipment. Further, it leases real estate properties. The company was founded in 1935 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "4248.T": {
        "short_name": "TAKEMOTO YOHKI CO LTD",
        "long_name": "Takemoto Yohki Co., Ltd.",
        "summary": "Takemoto Yohki Co., Ltd. manufactures and sells plastic packaging containers in Japan, China, India, the United States, Thailand, the Netherlands, and internationally. It offers bottles and jars, tubes, caps and plugs, dispensers, and others. The company was founded in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "4690.T": {
        "short_name": "NIPPON PALLET POOL CO",
        "long_name": "Nippon Pallet Pool Co., Ltd.",
        "summary": "Nippon Pallet Pool Co., Ltd. engages in the rental of a pallet pool system that enables corporate activities and supports physical distribution in Japan. Its pallet pool system is used for the transportation of various consumer and industrial goods, and raw materials. The company was founded in 1972 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "4994.T": {
        "short_name": "TAISEI LAMICK CO LTD",
        "long_name": "Taisei Lamick Co., Ltd.",
        "summary": "Taisei Lamick Co., Ltd. develops and sells liquid and paste packaging systems in Japan. It offers films, including XA-series products; and filling machines, such as DANGAN series products and filling peripheral equipment, as well as managed apparatus/IT relation products. The company was formerly known as Taisei Houzai K.K. and changed its name to Taisei Lamick Co., Ltd. in April 1991. Taisei Lamick Co., Ltd. was founded in 1966 and is headquartered in Shiraoka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Shiraoka"
    },
    "5204.T": {
        "short_name": "ISHIZUKA GLASS CO",
        "long_name": "Ishizuka Glass Co., Ltd.",
        "summary": "Ishizuka Glass Co., Ltd. produces and distributes glass bottles and tableware, paper packaging products, plastic containers and related products, and ceramic products in Japan and internationally. The company offers preforms for PET bottles; mechanical recycled resins for PET bottles; chinaware and other ceramic products; metal caps; and paper packaging products for beverages, such as milk, juices, and other drinks, as well as acts as an agent for filling machines for paper packaging operations. It is also involved in the glass and plastic products inspection and packaging; freight transportation; and glass forming machines and equipment making and designing businesses. In addition, the company offers advanced glass products, such as inorganic silver antimicrobial, inorganic anti-mite, and organic and inorganic hybrid antimicrobial glass products. Ishizuka Glass Co., Ltd. was founded in 1819 and is headquartered in Iwakura, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Iwakura"
    },
    "5210.T": {
        "short_name": "NIHON YAMAMURA GLASS CO",
        "long_name": "Nihon Yamamura Glass Co., Ltd.",
        "summary": "Nihon Yamamura Glass Co., Ltd. produces and sells glass bottles and plastic closures in Japan and internationally. It is also involved in production and sale of powdered glass and glass paste; and designing, manufacturing, sale, and installation work of machines and plant facilities. The company was founded in 1914 and is headquartered in Amagasaki, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Amagasaki"
    },
    "5901.T": {
        "short_name": "TOYO SEIKAN GROUP HOLDINGS LIMI",
        "long_name": "Toyo Seikan Group Holdings, Ltd.",
        "summary": "Toyo Seikan Group Holdings, Ltd. manufactures and sells packaging containers in Japan and internationally. The company operates through four segments: Packaging Business, Steel Plate Related Business, Functional Materials Related Business, and Real Estate Related Business. It offers packaging containers, such as metal cans, plastic containers, caps, bottles, paper containers, and aerosol products, as well as packaging-related machinery and equipment. The company also provides steel-plate-related products, such as materials for cans, electrical and electronic components, automobile and industry machinery parts, and household electronic appliances, as well as construction materials. In addition, it offers functional materials comprising aluminum substrates for magnetic disks, functional films for optics, glosts, micro-element fertilizers, pigments, and gel coats. Further, the company provides machinery and equipment related with packaging containers consisting of container manufacturing equipment, and filling and seaming equipment; and hard alloys, machinery and appliances, and raw material products for agriculture, as well as stamping dies for automotive parts. Additionally, it is involved in the motor truck transportation and warehousing business; non-life insurance agency real estate management businesses; leasing of properties comprising office buildings and commercial facilities; and sale of petroleum products. The company was formerly known as Toyo Seikan Kaisha, Ltd. and changed its name to Toyo Seikan Group Holdings, Ltd. in April 2013. Toyo Seikan Group Holdings, Ltd. was founded in 1917 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "5902.T": {
        "short_name": "HOKKAN HOLDINGS LIMITED",
        "long_name": "Hokkan Holdings Limited",
        "summary": "Hokkan Holdings Limited, through its subsidiaries, engages in container, filling, and machinery production businesses. The company manufactures cans for food and beverages; and plastic bottles, as well as special use containers, such as spray cans and design cans. It also provides aerosol containers comprising pesticide, hair spray, paint, and lighter gas containers; and soft containers that include pouch containers for toiletry products, which comprise cosmetics, detergents, and shampoos. In addition, the company offers filling services for beverage companies with a capacity of 1,200 bottles per a minute. Further, it provides a range of machine manufacturing services, including container molds for cans and PET bottles, beverage containers manufacturing machines, and filling machines, as well as engages in maintenance and engineering activities. Hokkan Holdings Limited was founded in 1921 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "5905.T": {
        "short_name": "NIHON SEIKAN K.K.",
        "long_name": "Nihon Seikan k.k.",
        "summary": "Nihon Seikan k.k. manufactures and sells metal cans in Japan. It offers adhesive cans, art cans, welding cans, and other cans. The company also engages in real estate leasing business. Nihon Seikan k.k. was founded in 1914 and is based in Saitama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Saitama"
    },
    "5907.T": {
        "short_name": "JFE CONTAINER CO LTD",
        "long_name": "JFE Container Co.,Ltd.",
        "summary": "JFE Container Co.,Ltd. manufactures and sells drums and high-pressure gas containers primarily in Japan and China. It offers general, inner paint, open, straight, special, zinc, antiseptic reinforced, and stainless-steel drum cans; pails; and drum rental services. The company also provides high-pressure gas containers, including aluminum and carbon FRP containers for natural gas and fuel cell vehicles, hydrogen transportation, and biogas and natural gas transportation; and oxygen and general composite containers. It serves chemical product, petroleum, paint, food, adhesive, cosmetic, plastic, and fine chemicals industries. The company was founded in 1961 and is headquartered in Tokyo, Japan. JFE Container Co.,Ltd. is a subsidiary of JFE Steel Corporation.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7482.T": {
        "short_name": "SHIMOJIMA CO LTD",
        "long_name": "Shimojima Co., Ltd.",
        "summary": "Shimojima Co., Ltd. engages in the wholesale and retail of paper products, plastic products and packaging materials, and in-store materials in Japan. The company offers paper bags, wrapping paper, and paper containers; plastic bags, adhesive tapes, food packaging materials, strings and ribbons, and other packaging materials; and in-store display materials, stationery and office supplies, sundry goods for use in stores, apparel-related materials, and horticulture-related materials. It also provides OPP bags, wrapping products, boxes, kitchen goods, tableware, hygiene and cleaning supplies, event supplies, and ceremonial goods. The company was founded in 1920 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7504.T": {
        "short_name": "KOHSOKU CORP",
        "long_name": "Kohsoku Corporation",
        "summary": "Kohsoku Corporation trades in light food packaging materials in Japan. It offers food containers, polyminate, paper products, and packaging machinery and equipment. The company was founded in 1966 and is headquartered in Sendai, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Sendai"
    },
    "7800.T": {
        "short_name": "AMIFA CO LTD",
        "long_name": "Amifa Co.,Ltd.",
        "summary": "Amifa Co., Ltd. manufactures and distributes various merchandises in Japan. Its products include gift wrapping products, including ribbons, gift wrap papers, paper boxes, paper bags, and film bags; stationery and DIY products comprising washi tapes, journals, memo pads, and sticky notes; and table wares, such as preserving flowers, flower pots, artificial flowers, and accessories. It services companies, such as confectionery manufacturers, Packaging Companies, Yen 100 shops' FC, super market stores, Flower Shops and stationary manufacturers. Amifa Co., Ltd. was founded in 1973 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7894.F": {
        "short_name": "MARUTO SANGYO CO",
        "long_name": "Maruto Sangyo Co., Ltd.",
        "summary": "Maruto Sangyo Co., Ltd. manufactures and sells laminated films in Japan. The company engages in photogravure printing and bag making; photogravure cylinder making; and sale of paper packaging, packing paper, label stickers, plastic molding products and packing materials, packaging and industrial machinery, agricultural related materials, and horticultural equipment. It also imports and exports packaging materials; designs, constructs, and sells synthetic resin floor materials; installs machinery and appliances; plans, produces, and sells advertising; and provides package design and advertising agency services. Maruto Sangyo Co., Ltd. was founded in 1939 and is headquartered in Fukuoka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "FKA",
        "market": "jp_market",
        "country": "Japan",
        "city": "Fukuoka City"
    },
    "7895.T": {
        "short_name": "CHUO KAGAKU CO",
        "long_name": "Chuo Kagaku Co., Ltd.",
        "summary": "Chuo Kagaku Co., Ltd. manufactures and sells disposable plastic food container products in Japan and internationally. The company offers a range of containers for sashimi, sushi, bento lunches, topped rice and noodles, side dishes, fruits and vegetables, and meat, as well as provides trays for food distribution. It also offers specialty containers for catering and hors d'oeuvres, as well as plates and cups, eggs, natto (fermented soybeans), and mini sauce bottles. The company was formerly known as Sanwa Plastics Industrial Co., Ltd. Chuo Kagaku Co., Ltd. was founded in 1957 and is based in Konosu, Japan. Chuo Kagaku Co., Ltd. is a subsidiary of Mitsubishi Corporation.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Konosu"
    },
    "7899.T": {
        "short_name": "MICS CHEMICAL CO.LTD",
        "long_name": "MICS Chemical Co., Ltd.",
        "summary": "MICS Chemical Co., Ltd. develops, manufactures, and sells functional laminated plastic films for vacuum food package, medical, and industrial applications in Japan. The company offers plastic multilayer and monolayer tube films. It also engages in the gravure printing and bag-making processing businesses; and the sale of other synthetic resin products. MICS Chemical Co., Ltd. was founded in 1959 and is headquartered in Aichi, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Aichi"
    },
    "7917.T": {
        "short_name": "FUJIMORI KOGYO CO",
        "long_name": "Fujimori Kogyo Co., Ltd.",
        "summary": "Fujimori Kogyo Co., Ltd. provides packaging materials, medical/pharmaceutical packaging materials, and materials for the functional fields in Japan and internationally. It operates through Life Science, Information Electronics, and Building Materials segments. The company offers optoelectronic products, such as MASTACK TFB, a protection film for optical applications. It also provides electronic products, including MASTACK PC, a heat-resistant protection film; FILMBYNA, a release film for pharmaceutical patches, double-sided tapes, optical and other adhesion applications, electronic substrates, etc.; CLEAN PACK used for transfer between processes and transport of semiconductors and precision devices; and META-SEAL FILM, an adhesive film. In addition, the company offers single-use bags for bio-pharmaceutical production processes and microbiological cultures, plant culture bags, packaging materials for pharmaceutical products and medical instruments, PP packaging materials, chemical solution bags, liquid sticks, sealant materials, film separators, and double-structure aerosol systems. Further, it provides high-hermetic containers, refillable self-standing pouches, collapsible liquid containers, plastic film-lined liquid containers, single-use culture products, liquid-pouch packaging materials, packaging materials for retort sterilization, pouches with a spout, drum liners, and large-sized liquid transport containers. The company offers its products under the ZACROS brand name. Fujimori Kogyo Co., Ltd. was founded in 1914 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7923.T": {
        "short_name": "TOIN CORP",
        "long_name": "Toin Corporation",
        "summary": "Toin Corporation manufactures and sells paper and plastic packaging products for food, confectionary, cosmetics, and pharmaceuticals markets. The company also offers packaging materials, and paper and resin packages; label products, including pressure-sensitive and glue, POP, and delayed labels; and leaflets/package inserts for pharmaceuticals and cosmetics. In addition, it provides glue, adhesive coating, and functional painting products for smartphones, semiconductors, storage media, building materials, etc. Further, the company imports and exports packaging products and raw materials; provides contract packaging services for quasi-pharmaceuticals, cosmetics, and food products; offers advertising tools, such as paper display kits; and provides pulp mold, plastic bottles, and soft and blister packaging. Toin Corporation was founded in 1955 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "9385.T": {
        "short_name": "SHOEI CORPORATION",
        "long_name": "Shoei Corporation",
        "summary": "Shoei Corporation engages in the planning, manufacture, and sale of plastic films and packaging materials in Japan. It also provides planning services related to shipping of direct mail, catalogs, etc.; and plans and sells daily miscellaneous goods. The company was founded in 1968 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "FJ3.F": {
        "short_name": "FUJIMORI KOGYO",
        "long_name": "Fujimori Kogyo Co., Ltd.",
        "summary": "Fujimori Kogyo Co., Ltd. provides packaging materials, medical/pharmaceutical packaging materials, and materials for the functional fields in Japan and internationally. It operates through Life Science, Information Electronics, and Building Materials segments. The company offers optoelectronic products, such as MASTACK TFB, a protection film for optical applications. It also provides electronic products, including MASTACK PC, a heat-resistant protection film; FILMBYNA, a release film for pharmaceutical patches, double-sided tapes, optical and other adhesion applications, electronic substrates, etc.; CLEAN PACK used for transfer between processes and transport of semiconductors and precision devices; and META-SEAL FILM, an adhesive film. In addition, the company offers single-use bags for bio-pharmaceutical production processes and microbiological cultures, plant culture bags, packaging materials for pharmaceutical products and medical instruments, PP packaging materials, chemical solution bags, liquid sticks, sealant materials, film separators, and double-structure aerosol systems. Further, it provides high-hermetic containers, refillable self-standing pouches, collapsible liquid containers, plastic film-lined liquid containers, single-use culture products, liquid-pouch packaging materials, packaging materials for retort sterilization, pouches with a spout, drum liners, and large-sized liquid transport containers. The company offers its products under the ZACROS brand name. Fujimori Kogyo Co., Ltd. was founded in 1914 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "TQN.F": {
        "short_name": "TOYO SEIKAN GRP HLDGS LTD",
        "long_name": "Toyo Seikan Group Holdings, Ltd.",
        "summary": "Toyo Seikan Group Holdings, Ltd. manufactures and sells packaging containers in Japan and internationally. The company operates through four segments: Packaging Business, Steel Plate Related Business, Functional Materials Related Business, and Real Estate Related Business. It offers packaging containers, such as metal cans, plastic containers, caps, bottles, paper containers, and aerosol products, as well as packaging-related machinery and equipment. The company also provides steel-plate-related products, such as materials for cans, electrical and electronic components, automobile and industry machinery parts, and household electronic appliances, as well as construction materials. In addition, it offers functional materials comprising aluminum substrates for magnetic disks, functional films for optics, glosts, micro-element fertilizers, pigments, and gel coats. Further, the company provides machinery and equipment related with packaging containers consisting of container manufacturing equipment, and filling and seaming equipment; and hard alloys, machinery and appliances, and raw material products for agriculture, as well as stamping dies for automotive parts. Additionally, it is involved in the motor truck transportation and warehousing business; non-life insurance agency real estate management businesses; leasing of properties comprising office buildings and commercial facilities; and sale of petroleum products. The company was formerly known as Toyo Seikan Kaisha, Ltd. and changed its name to Toyo Seikan Group Holdings, Ltd. in April 2013. Toyo Seikan Group Holdings, Ltd. was founded in 1917 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    }
}