{
    "2MW.F": {
        "short_name": "METAWATER CO.LTD",
        "long_name": "METAWATER Co., Ltd.",
        "summary": "METAWATER Co., Ltd. designs and constructs equipment for water treatment plants, sewage treatment plants, and waste treatment facilities in Japan and internationally. The company also designs, manufactures, and sells various devices; implements repair work; and installs machine and equipment, and telecommunication work, as well as provision for services, including operation management. In addition, it offers civil engineering, building, electrical, plumbing, tile, brick, and block works; and provides water and sewage, and sanitation facilities works. The company was founded in 2007 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0041",
        "website": "http://www.metawater.co.jp",
        "market_cap": "Small Cap"
    },
    "6013.T": {
        "short_name": "TAKUMA CO LTD",
        "long_name": "Takuma Co., Ltd.",
        "summary": "Takuma Co., Ltd. engages in the design, construction, and superintendence of various boilers, plant machineries, pollution prevention and environmental equipment plants, heating and cooling equipment, and feed water/drainage sanitation equipment and facilities in Japan and internationally. It operates through four segments: Domestic Environment and Energy Business, Overseas Environment and Energy Business, Package Boiler Business, and Equipment and System Business. The Domestic Environment and Energy segment offers general waste treatment, industrial waste treatment, waste recycling, wastewater treatment, sludge combustion, and biomass power plants, as well as gas turbine cogeneration systems. The Overseas Environment and Energy Business segment provides waste combusting and biomass power plants. The Package Boiler segment offers compact through-flow boilers and vacuum water heating systems. The Equipment and System Business segment provides construction equipment, and equipment for semiconductor industry and cleaning systems. It is also involved in the design, construction, and superintendence of civil, architecture, and other works. The company was formerly known as Takuma Boiler Manufacturing Co., Ltd. and changed its name to Takuma Co., Ltd. in 1972. Takuma Co., Ltd. was founded in 1915 and is headquartered in Amagasaki, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Amagasaki",
        "zipcode": "660-0806",
        "website": "http://www.takuma.co.jp",
        "market_cap": "Large Cap"
    },
    "6328.T": {
        "short_name": "EBARA JITSUGYO CO",
        "long_name": "Ebara Jitsugyo Co.,Ltd.",
        "summary": "Ebara Jitsugyo Co.,Ltd. manufactures and sells environment and related products in Japan. It is also involved in the engineering operations for waterworks and sewerage. In addition, the company sells various industrial machines, such as a pump and air-conditioning/heating and cooling equipment, etc. Ebara Jitsugyo Co.,Ltd. was founded in 1946 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8174",
        "website": "http://www.ejk.co.jp",
        "market_cap": "Large Cap"
    },
    "6332.T": {
        "short_name": "TSUKISHIMA KIKAI CO",
        "long_name": "Tsukishima Kikai Co., Ltd.",
        "summary": "Tsukishima Kikai Co., Ltd. provides systems and plant facilities for the industry, water, and wastewater facilities in Japan, rest of Asia, and internationally. The company's Water Environmental Business segment designs, manufactures, and sells equipment and machinery used in water purification plants and wastewater treatment plants. This segment is also involved in the private finance initiatives and design-build-operate businesses; design, construction, operation, and maintenance of water purification plants and wastewater treatment plants; and generation of electric power in wastewater treatment plants. Its Industrial Business segment designs and constructs chemical plants, iron and steel plants, food plants, waste liquid plants, wastewater plants, solid waste treatment plants, etc.; and designs, manufactures, and sells process equipment. This segment also engages in the industrial general waste treatment business. The company was formerly known as Tokyo Tsukishima Kikai Seisakusho and changed its name to Tsukishima Kikai Co., Ltd. in May 1917. Tsukishima Kikai Co., Ltd. was founded in 1905 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0053",
        "website": "http://www.tsk-g.co.jp",
        "market_cap": "Large Cap"
    },
    "6368.T": {
        "short_name": "ORGANO CORP",
        "long_name": "Organo Corporation",
        "summary": "Organo Corporation operates as a water treatment engineering company in Japan and internationally. The company operates through two segments, Water Treatment Engineering Business Unit and Performance Products Business Unit. It offers pure water systems, such as reverse osmosis (RO) systems, regenerative automatic and manual pure water systems, electric regeneration pure water systems, desktop-type pure water systems, cabinet-type pure water systems, electrode ionization high-purity water systems, cartridge water purifiers, and 2-stage RO systems; ultrapure water systems, including desktop and cabinet-type ultrapure water systems, and final polishing unit; and other equipment comprising alkaline electrolyzed water production equipment, homogenizers, electro conductivity meters, resistivity meters, and ion exchange filters. The company also provides water, wastewater, and RO water treatment chemicals; industrial filters consisting of micro filter, sanitary, polypropylene, and plastic housings, as well as micro, RO wound, PF cartridge, capsule, and PF carbon; and commercial water purifiers. In addition, it offers ultrapure and multi-functional water production systems, wastewater treatment systems, valuable resource recovery systems, and organic solvent refining systems for the electronics industry; water supply and sewage treatment facilities; purified water production and supply systems, UF water production and supply systems, and water for injection production and supply systems, as well as pharmaceutical water system consulting services; condensate filter, condensate demineralizer, reactor water cleanup, fuel pool cleanup, makeup water, and waste water treatment systems; and sugar refining systems and equipment. The company was formerly known as Japan Organo Co., Ltd. and changed its name to Organo Corporation in 1966. Organo Corporation was founded in 1946 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "136-8631",
        "website": "http://www.organo.co.jp",
        "market_cap": "Large Cap"
    },
    "6370.T": {
        "short_name": "KURITA WATER INDUSTRIES",
        "long_name": "Kurita Water Industries Ltd.",
        "summary": "Kurita Water Industries Ltd. provides various water treatment solutions in Japan, rest of Asia, North America, Europe, the Middle East, Africa, and internationally. The Water Treatment Chemicals segment offers boiler water treatment chemicals, cooling water treatment chemicals, wastewater treatment chemicals, process treatment chemicals, reverse osmosis membrane water treatment chemicals, automobile paint booth chemicals, biomass generation related chemicals, civil engineering and construction related chemicals, marine vessel related water treatment chemicals, chemical dosing systems/chemical dosing control systems, and packaged contract services. The Water Treatment Facilities segment offers water treatment equipment and facilities; ultrapure water supply, tool cleaning, chemical cleaning, and soil and groundwater remediation services; and maintenance services. This segment also provides ultrapure water production systems, wastewater reclamation systems, and wastewater treatment systems and equipment. The company also offers soil and groundwater contamination remediation, plant facilities cleaning, and precision tool cleaning services, as well as water treatment equipment for professional use, products for general household's, and swimming pool-related equipment. Kurita Water Industries Ltd. was founded in 1949 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "164-0001",
        "website": "http://www.kurita.co.jp",
        "market_cap": "Large Cap"
    },
    "6489.T": {
        "short_name": "MAEZAWA INDUSTRIES INC",
        "long_name": "Maezawa Industries, Inc.",
        "summary": "Maezawa Industries, Inc. designs, manufactures, sells, and installs equipment and apparatus for water supply and sewage systems in Japan and internationally. It offers valve products, such as gate, control, butterfly, check, eccentric, air, hydrant, maintenance, emergency shutoff, and sluice gate and weir valves; and environmental systems, including water purification and sewage treatment soil purification systems, as well as system consultation services. The company also provides water supply systems consisting of hybrid MF membrane systems; water purification systems, such as advanced oxidation systems, membrane filtration systems, and water intake and sedimentation equipment; wastewater treatment systems comprising oxidation ditch nitrogen removal systems, membrane bioreactors, and LANDOX OD systems, as well as multi mesh screens; and industrial environment products that comprise UF membrane filtration equipment, PTFE membranes with activated carbon powder for water reuse, and dissolved air floatation equipment, as well as chelate fiber. Maezawa Industries, Inc. was founded in 1937 and is headquartered in Kawaguchi, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kawaguchi",
        "zipcode": "332-8556",
        "website": "http://www.maezawa.co.jp",
        "market_cap": "Large Cap"
    },
    "6788.T": {
        "short_name": "NIHON TRIM CO LTD",
        "long_name": "Nihon Trim Co., Ltd.",
        "summary": "Nihon Trim Co., Ltd. develops and sells electrolyzed hydrogen water systems in Japan and internationally. The company also offers cartridges and electrolyzed hydrogen water apparatuses for agriculture and livestock industries, as well as households; and electrolyzed water hemodialysis systems for medical care. In addition, it manufactures and sells bottled water; and undertakes research and development works of electrolyzed hydrogen water. Nihon Trim Co., Ltd. was founded in 1982 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0001",
        "website": "http://www.nihon-trim.co.jp",
        "market_cap": "Large Cap"
    },
    "7004.T": {
        "short_name": "HITACHI ZOSEN CORP",
        "long_name": "Hitachi Zosen Corporation",
        "summary": "Hitachi Zosen Corporation engages in the engineering, procurement, construction, and after-sales services, as well as operation and maintenance of energy-from-waste plants in Japan and internationally. It operates through three segments: Environmental Systems & Industrial Plants, Machinery, and Infrastructure. The Environmental Systems & Industrial Plants segment builds various water-related facilities, including sludge recycling centers and desalination plants, and energy-related facilities, including biomass plants. The Machinery segment provides marine diesel engines, press machines for automobiles, pressure vessels for petrochemical plants, and other process equipment, as well as various types of precision machinery, such as semiconductor, food, and medical related equipment; and hydrogen generation systems. This segment also offers solutions in various industries, such as mitigating environmental burdens and streamlining manufacturing processes for higher efficiency, as well as support services ranging from development to servicing. The Infrastructure segment engages in building, monitoring, maintenance, repair, and strengthening of bridges and hydraulic gates for dams and rivers; developing shield tunneling machines for the construction of underground motorways and subway tracks, and flap-gate type seawalls against flood disaster due to tsunamis or storm surges. The company was founded in 1881 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "559-8559",
        "website": "http://www.hitachizosen.co.jp",
        "market_cap": "Large Cap"
    },
    "7265.T": {
        "short_name": "EIKEN INDUSTRIES CO",
        "long_name": "Eiken Industries Co.,Ltd.",
        "summary": "Eiken Industries Co.,Ltd. manufactures and sells filters for internal combustion engines and special filters for industrial use primarily in Japan. It offers air filter clogging, fuel filters, and cabin filters. The company was formerly known as Ehken Kogyo Corporation and changed its name to Eiken Industries Co.,Ltd. in July 1972. Eiken Industries Co.,Ltd. was founded in 1967 and is headquartered in Omaezaki, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Omaezaki",
        "zipcode": "437-1698",
        "website": "http://www.eiken-kk.co.jp",
        "market_cap": "Mid Cap"
    },
    "9551.T": {
        "short_name": "METAWATER CO LTD",
        "long_name": "METAWATER Co., Ltd.",
        "summary": "METAWATER Co., Ltd. designs and constructs equipment for water treatment plants, sewage treatment plants, and waste treatment facilities in Japan and internationally. The company also designs, manufactures, and sells various devices; implements repair work; and installs machine and equipment, and telecommunication work, as well as provision for services, including operation management. In addition, it offers civil engineering, building, electrical, plumbing, tile, brick, and block works; and provides water and sewage, and sanitation facilities works. The company was founded in 2007 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0041",
        "website": "http://www.metawater.co.jp",
        "market_cap": "Large Cap"
    },
    "EJI.F": {
        "short_name": "EBARA JITSUGYO",
        "long_name": "Ebara Jitsugyo Co.,Ltd.",
        "summary": "Ebara Jitsugyo Co.,Ltd. manufactures and sells environment and related products in Japan. It is also involved in the engineering operations for waterworks and sewerage. In addition, the company sells various industrial machines, such as a pump and air-conditioning/heating and cooling equipment, etc. Ebara Jitsugyo Co.,Ltd. was founded in 1946 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8174",
        "website": "http://www.ejk.co.jp",
        "market_cap": "Small Cap"
    },
    "HZS.F": {
        "short_name": "HITACHI ZOSEN CORP.",
        "long_name": "Hitachi Zosen Corporation",
        "summary": "Hitachi Zosen Corporation engages in the engineering, procurement, construction, and after-sales services, as well as operation and maintenance of energy-from-waste plants in Japan and internationally. It operates through three segments: Environmental Systems & Industrial Plants, Machinery, and Infrastructure. The Environmental Systems & Industrial Plants segment builds various water-related facilities, including sludge recycling centers and desalination plants, and energy-related facilities, including biomass plants. The Machinery segment provides marine diesel engines, press machines for automobiles, pressure vessels for petrochemical plants, and other process equipment, as well as various types of precision machinery, such as semiconductor, food, and medical related equipment; and hydrogen generation systems. This segment also offers solutions in various industries, such as mitigating environmental burdens and streamlining manufacturing processes for higher efficiency, as well as support services ranging from development to servicing. The Infrastructure segment engages in building, monitoring, maintenance, repair, and strengthening of bridges and hydraulic gates for dams and rivers; developing shield tunneling machines for the construction of underground motorways and subway tracks, and flap-gate type seawalls against flood disaster due to tsunamis or storm surges. The company was founded in 1881 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "559-8559",
        "website": "http://www.hitachizosen.co.jp",
        "market_cap": "Small Cap"
    },
    "KTWIF": {
        "short_name": "KURITA WATER INDUSTRIES",
        "long_name": "Kurita Water Industries Ltd.",
        "summary": "Kurita Water Industries Ltd. provides various water treatment solutions in Japan, rest of Asia, North America, Europe, the Middle East, Africa, and internationally. The Water Treatment Chemicals segment offers boiler water treatment chemicals, cooling water treatment chemicals, wastewater treatment chemicals, process treatment chemicals, reverse osmosis membrane water treatment chemicals, automobile paint booth chemicals, biomass generation related chemicals, civil engineering and construction related chemicals, marine vessel related water treatment chemicals, chemical dosing systems/chemical dosing control systems, and packaged contract services. The Water Treatment Facilities segment offers water treatment equipment and facilities; ultrapure water supply, tool cleaning, chemical cleaning, and soil and groundwater remediation services; and maintenance services. This segment also provides ultrapure water production systems, wastewater reclamation systems, and wastewater treatment systems and equipment. The company also offers soil and groundwater contamination remediation, plant facilities cleaning, and precision tool cleaning services, as well as water treatment equipment for professional use, products for general household's, and swimming pool-related equipment. Kurita Water Industries Ltd. was founded in 1949 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "164-0001",
        "website": "http://www.kurita.co.jp",
        "market_cap": "Mid Cap"
    },
    "KWI.F": {
        "short_name": "KURITA WATER IND.",
        "long_name": "Kurita Water Industries Ltd.",
        "summary": "Kurita Water Industries Ltd. provides various water treatment solutions in Japan, rest of Asia, North America, Europe, the Middle East, Africa, and internationally. The Water Treatment Chemicals segment offers boiler water treatment chemicals, cooling water treatment chemicals, wastewater treatment chemicals, process treatment chemicals, reverse osmosis membrane water treatment chemicals, automobile paint booth chemicals, biomass generation related chemicals, civil engineering and construction related chemicals, marine vessel related water treatment chemicals, chemical dosing systems/chemical dosing control systems, and packaged contract services. The Water Treatment Facilities segment offers water treatment equipment and facilities; ultrapure water supply, tool cleaning, chemical cleaning, and soil and groundwater remediation services; and maintenance services. This segment also provides ultrapure water production systems, wastewater reclamation systems, and wastewater treatment systems and equipment. The company also offers soil and groundwater contamination remediation, plant facilities cleaning, and precision tool cleaning services, as well as water treatment equipment for professional use, products for general household's, and swimming pool-related equipment. Kurita Water Industries Ltd. was founded in 1949 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "164-0001",
        "website": "http://www.kurita.co.jp",
        "market_cap": "Mid Cap"
    },
    "NH8.F": {
        "short_name": "NIHON TRIM CO. LTD.",
        "long_name": "Nihon Trim Co., Ltd.",
        "summary": "Nihon Trim Co., Ltd. develops and sells electrolyzed hydrogen water systems in Japan and internationally. The company also offers cartridges and electrolyzed hydrogen water apparatuses for agriculture and livestock industries, as well as households; and electrolyzed water hemodialysis systems for medical care. In addition, it manufactures and sells bottled water; and undertakes research and development works of electrolyzed hydrogen water. Nihon Trim Co., Ltd. was founded in 1982 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0001",
        "website": "http://www.nihon-trim.co.jp",
        "market_cap": "Small Cap"
    }
}