{
    "2164.T": {
        "short_name": "CHIIKISHINBUNSHA CO LTD",
        "long_name": "Chiikishinbunsha Co.,Ltd.",
        "summary": "Chiikishinbunsha Co.,Ltd. publishes newspapers in Japan. It also inserts flyers in newspapers; and provides sales promotion support and other services. The company was founded in 1984 and is headquartered in Funabashi, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Funabashi"
    },
    "2341.T": {
        "short_name": "ARBEIT-TIMES CO LTD",
        "long_name": "Arbeit-Times Co., Ltd.",
        "summary": "Arbeit-Times Co., Ltd. edits and publishes free work magazines under the Domo name in Japan. The company also operates job sites, including domonet.jp and job.atimes.co.jp. In addition, it is involved in in-store and target media, ad agency, and paid employment introduction activities; the planning and management of new graduate job site; and the provision of consulting in the management of recruitment information Website. Arbeit-Times Co., Ltd. was founded in 1973 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "2376.T": {
        "short_name": "SCINEX CORPORATION",
        "long_name": "Scinex Corporation",
        "summary": "Scinex Corporation engages in the publishing, Web solution, logistics, and real estate businesses in Japan. It publishes my town encyclopedia, administrative information magazine, phonebooks, parenting support general information magazine, child rearing guide, and health information magazine, as well as Telepal 50, a 50-phonetic phone directory and Nasse, a regional information magazine. It also operates hometown tax payment sites; CityDO!, an area information site; our city promotion, a local video portal site; our city and a lot of nets; and various travel sites. In addition, the company provides food at the B2B portal site for restaurants; cloud type original CMS for administrative purpose; administrative application that dispatch administrative information to residents with smartphone application; and operates Yahoo! Japan with capital and business alliances to expand business areas. Further, it offers mail delivery and posting service. Scinex Corporation was founded in 1953 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "2481.T": {
        "short_name": "TOWNNEWS-SHA CO LTD",
        "long_name": "Townnews-Sha Co.,Ltd.",
        "summary": "Townnews-Sha Co.,Ltd. engages in the publishing business in Japan. It issues Town News, a local information paper. The company is also involved in the planning, production, and printing of various printed materials, such as postcards, business cards, and shop menu; and offers advertisement placement services. In addition, it publishes commemorative magazines and guidebooks; and plans and operates Websites, which include Political village, a database site introducing all politicians in Kanagawa prefecture and Rare A, a community-based event information site. Townnews-Sha Co.,Ltd. was founded in 1977 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "3137.T": {
        "short_name": "FUNDELY CO LTD",
        "long_name": "Fundely Co., Ltd.",
        "summary": "Fundely Co., Ltd. engages in the planning, editing, and publishing of mail order catalogue under the Meal Time name. It also provides marketing support services. The company was founded in 2000 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3641.T": {
        "short_name": "PAPYLESS CO LTD",
        "long_name": "Papyless Co., Ltd.",
        "summary": "Papyless Co., Ltd. sells and rents electronic books in Japan, the United States, and internationally. It offers novel and non-fiction books, practical books, photo books, comics, hobbies/life/magazines, utility books, business/education books, and audio and video books. The company also operates upppi, an e-book posting and editing platform; develops and produces next-generation content; and operates e-book agency. Papyless Co., Ltd. was founded in 1995 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "4833.T": {
        "short_name": "SUCCESS HOLDERS INC",
        "long_name": "Success Holders Inc.",
        "summary": "Success Holders Inc. engages in the publication and distribution of magazines in Japan. The company publishes Home, a regional information magazine; L'alaPado for office delivery for working women; Hama Kara; We:la and BUZZ CLIP; and Kichijoji ECCO !!, an annual magazine introducing local medical institutions. It also operates an information PC and mobile site linked with free paper, such as regional portal site Pad Navi and Baba Navi Mobile; Gurumepa, a genre site; Kirei Ba, a neighborhood doctor net; and BeYOU for beauty information. In addition, the company develops a mobile phone delivery tool, which provides an ASP service of cellular mail that can transmit information to members. The company was formerly known as Pado Corporation and changed its name to Success Holders Inc. in October 2020. Success Holders Inc. was founded in 1987 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6176.T": {
        "short_name": "BRANGISTA INC",
        "long_name": "Brangista Inc.",
        "summary": "Brangista Inc. publishes digital magazines primarily in Japan. The company offers Tabiiro, a travel guide for adult women; GOODA, a fashion for professional man; SUPER CEO, a business magazine for leaders; and Seikeidenron that contains knowledge of politics and economics. It also provides madream, a personal lifestyle design magazine; HowB, a mobile-compatible web magazine that focuses on how to get a beautiful face and body for young girls; LiSTA, a fashion magazine; Tabesaki, a gourmet information guide; and Nomitabibon, a lifestyle magazine. In addition, the company provides support services; and cloud tools that enable the integrated management of products, orders, and inventories for e-commerce sites. Further, it offers Website translation, creation, and renewal services, as well as SEO services; and logistics services to the online shops. The company was founded in 2000 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "9468.T": {
        "short_name": "KADOKAWA CORPORATION",
        "long_name": "Kadokawa Corporation",
        "summary": "Kadokawa Corporation operates in publishing, film, publishing rights, and digital content businesses in Japan. The company also engages in the planning, development, and operation of network entertainment service and contents; and operates video-sharing website. It also offers animation, videos, games, rights, and merchandising. The company was formerly known as Kadokawa Dwango Corporation. Kadokawa Corporation was founded in 1945 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "9475.T": {
        "short_name": "SHOBUNSHA HOLDINGS INC",
        "long_name": "Shobunsha Holdings, Inc.",
        "summary": "Shobunsha Holdings, Inc. plans, produces, and publishes maps, magazines, and guidebooks. It also plans, produces, and sells digital data, as well as offers electronic services. The company also publishes guidebooks covering tourist sites and attractions for Japanese travelers; produces maps and guidebooks in foreign languages for tourists; offers tools available on the Internet, smartphones, and in mobile communication; and serves as an advertising media for various range clients in the hotel, transportation, retail, and other industries. In addition, it runs MAPPLE Kanko Guide and MAPPLE Tourist Maps Websites; and operates MAPPLE Travel, a hotel booking Website. Further, the company develops and runs applications, including MAPPLE TOKYO Sky Tree App that provides MAPPLE maps and guides; and MAPPLE-LINK, a service, which allows users to download information in MAPPLE Magazine to smartphones or cellphones. Additionally, it provides digital maps and travel guides for national agencies, local governments, and private enterprises for issues concerning crime and disaster prevention, disaster measures, tourism business, regional marketing, customer management, and logistics. The company also makes maps and develops geographical information systems for enterprises and local governments; provides services ranging from inputting data to developing mapping software; and offers Mapple Navi, a car navigation software for PND makers that provide driving routes, and information about restaurants. Shobunsha Holdings, Inc. was founded in 1960 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "9476.T": {
        "short_name": "CHUOKEIZAI-SHA HOLDINGS INC",
        "long_name": "Chuokeizai-Sha Holdings, Inc.",
        "summary": "Chuokeizai-Sha Holdings, Inc. engages in publishing business in Japan. It publishes books and magazines related to law, economy, management, accounting, taxation, qualification examinations, and other social science. The company was formerly known as Chuokeizai-Sha, Inc. and changed its name to Chuokeizai-Sha Holdings, Inc. in January 2016. Chuokeizai-Sha Holdings, Inc. was founded in 1948 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "9478.T": {
        "short_name": "SE HOLDINGS AND INCUBATIONS",
        "long_name": "SE Holdings and Incubations Co., Ltd.",
        "summary": "SE Holdings and Incubations Co., Ltd. primarily engages in the publishing business in Japan. The company is involved in publishing and selling computer-related books and magazines; organizing computer-related conferences and trainings; delivering computer-related technology information through Web; publishing and selling common and translated books; selling software and hardware through online shops; selling other computer-related products and services; and real estate leasing activities. It also develops and sells entertainment software and mobile Internet technologies and services. In addition, the company plans and manufactures sub-contracting services for product accessories and enclosures; as well as offers product marketing and sales promotion related services; support services for engineers; and company PR/IR support services for IT related companies. Further, it operates amusement centers; and offers IT education, as well as provides job referral services for the medical industry. Additionally, the company produces, publishes, and sells teaching materials; and plans and manages seminars for examinees of qualified certified electrician test. The company was formerly known as SHOEISHA Co., Ltd. SE Holdings and Incubations Co., Ltd. was founded in 1985 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "9479.T": {
        "short_name": "IMPRESS HOLDINGS INC",
        "long_name": "Impress Holdings, Inc.",
        "summary": "Impress Holdings, Inc. engages in the provision of content business in Japan. The company publishes magazines, books, and e-books for various fields, such as IT, music, design, mountain nature, and mobile services; and provides net media and target media services, as well as SP/PR tools for companies and local governments and contract production of websites, etc. It also offers planning, development, and distribution functions for content businesses, including EC platforms, electronic comic platforms, and publishing and distribution platforms. The company was founded in 1992 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "IMB.F": {
        "short_name": "IMPRESS HOLDINGS INC.",
        "long_name": "Impress Holdings, Inc.",
        "summary": "Impress Holdings, Inc. engages in the provision of content business in Japan. The company publishes magazines, books, and e-books for various fields, such as IT, music, design, mountain nature, and mobile services; and provides net media and target media services, as well as SP/PR tools for companies and local governments and contract production of websites, etc. It also offers planning, development, and distribution functions for content businesses, including EC platforms, electronic comic platforms, and publishing and distribution platforms. The company was founded in 1992 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    }
}