{
    "1245.HK": {
        "short_name": "NIRAKU",
        "long_name": "Niraku GC Holdings, Inc.",
        "summary": "Niraku GC Holdings, Inc., an investment holding company, operates pachinko and pachislot halls in Japan. It also operates hotels; a Spanish restaurant franchise under the LIZARRAN brand; and a food mall under the YOKOCHO brand. In addition, the company engages in the property investment and cleaning service businesses. Further, it operates amusement centre operations; and wholesales computer games, and sporting and other recreational goods. The company was formerly known as Niraku Global Community Holdings Inc. and changed its name to Niraku GC Holdings, Inc. Niraku GC Holdings, Inc. was founded in 1950 and is headquartered in Koriyama, Japan.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Japan",
        "state": null,
        "city": "Koriyama",
        "zipcode": "963-8811",
        "website": "http://www.ngch.co.jp",
        "full_time_employees": 1870
    },
    "2378.T": {
        "short_name": "RENAISSANCE INC",
        "long_name": "Renaissance,Incorporated",
        "summary": "Renaissance,Incorporated engages in sports club business in Japan. It operates fitness clubs, swimming schools, tennis schools, golf schools, etc. The company also provides health promotional services for local municipalities, companies, etc.; nursing care and rehabilitation support services; small-scale facilities expansion services; and store development support services. In addition, it promotes Synapsology, a brain activation method; and offers support services for health education. Renaissance,Incorporated was founded in 1979 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "130-0026",
        "website": "http://www.s-renaissance.co.jp",
        "full_time_employees": null
    },
    "4681.T": {
        "short_name": "RESORTTRUST INC",
        "long_name": "Resorttrust, Inc.",
        "summary": "Resorttrust, Inc. engages in the membership sale and administration; and operation of hotels and restaurants, and golf clubs. It is also involved in the medical and other businesses. The company's resort and city hotels portfolio includes 50 locations in Japan and 1 location in Hawaii. It also operates 13 golf courses. The company was founded in 1973 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "460-8490",
        "website": "http://www.resorttrust.co.jp",
        "full_time_employees": 7937
    },
    "5261.T": {
        "short_name": "RESOL HOLDINGS CO LTD",
        "long_name": "RESOL HOLDINGS Co.,Ltd.",
        "summary": "RESOL HOLDINGS Co.,Ltd., through its subsidiaries, engages in the hotel, golf, and resort management businesses in Japan. The company provides welfare programs, including life support services. It is also involved in the renewable energy; and real estate related/investment revitalization businesses. The company was formerly known as Resort Solution Co., Ltd. and changed its name to RESOL HOLDINGS Co.,Ltd. in October 2016. RESOL HOLDINGS Co.,Ltd. was founded in 1931 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-0023",
        "website": "http://www.resol.jp",
        "full_time_employees": null
    },
    "5FY.F": {
        "short_name": "RESORTTRUST INC.",
        "long_name": "Resorttrust, Inc.",
        "summary": "Resorttrust, Inc. engages in the membership sale and administration; and operation of hotels and restaurants, and golf clubs. It is also involved in the medical and other businesses. The company's resort and city hotels portfolio includes 50 locations in Japan and 1 location in Hawaii. It also operates 13 golf courses. The company was founded in 1973 and is headquartered in Nagoya, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "460-8490",
        "website": "http://www.resorttrust.co.jp",
        "full_time_employees": 7937
    },
    "9656.T": {
        "short_name": "GREENLAND RESORT CO LTD",
        "long_name": "Greenland Resort Company Limited",
        "summary": "Greenland Resort Company Limited engages in the tourism and inn businesses in Japan. The company manages amusement parks, golf courses, and sports facilities. It is also involved in restaurant management and real estate businesses. The company was formerly known as Greenland Co., Ltd. and changed its name to Greenland Resort Company Limited in July 2006. Greenland Resort Company Limited was founded in 1964 and is based in Arao, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Arao",
        "zipcode": "864-8691",
        "website": "http://www.greenland.co.jp",
        "full_time_employees": 220
    },
    "9675.T": {
        "short_name": "JOBAN KOSAN CO LTD",
        "long_name": "Joban Kosan Co.,Ltd.",
        "summary": "Joban Kosan Co.,Ltd. engages in the tourism, trading, manufacturing, and transportation businesses in Japan and internationally. It is involved in the operation of resort under the Spa Resort Hawaiians name; and Spa Resort Hawaiians golf course. The company also engages in the wholesale of imported coal; heavy oil, and LP gas; kerosene, gasoline, light oil, lubricating oil, and petrochemical products; wood pellets; and construction materials, such as cement, ready-mixed concrete, etc. In addition, it manufactures cast iron products, such as hydrostar motors that are used in the marine equipment and industrial machinery; and hydraulic motor body, as well as provides cargo transportation services. The company was founded in 1944 and is headquartered in Iwaki, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Iwaki",
        "zipcode": "972-8326",
        "website": "http://www.joban-kosan.com",
        "full_time_employees": null
    }
}