{
    "01H.F": {
        "short_name": "HORIBA LTD",
        "long_name": "HORIBA, Ltd.",
        "summary": "HORIBA, Ltd. manufactures and sells automotive test, process and environmental, medical-diagnostics, semiconductor, and scientific instruments and systems. Its Automotive Test Systems segment offers emission measurement systems, driveline test systems, automotive emissions analyzers, engine test and brake test systems, and fuel cell and battery test systems; provides vehicle development engineering and testing engineering services; and leases and manages R&D facilities. The company's Process & Environmental Instruments & Systems segment provides stack gas analyzers, industrial water quality analyzers, water quality analysis and examination systems, air pollution analyzers, environmental radiation monitors, and process measurement equipment. Its Medical-Diagnostic Instruments & Systems segment offers hematology and CRP, immunology, clinical chemistry, and blood glucose analyzers. The company's Semiconductor Instruments & Systems segment provides mass flow controllers, chemical concentration monitors, reticle/mask particle detection systems, residual gas analyzers, and vaporizers. Its Scientific Instruments & Systems segment offers Raman spectrometers, pH meters, particle-size distribution analyzers, X-Ray fluorescence analyzers, elemental analyzers, fluorescence spectroscopy/fluorescence lifetime spectroscopy, optical components, spectrometers and detectors, and gratings. HORIBA, Ltd. was founded in 1945 and is headquartered in Kyoto, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "601-8510",
        "website": "http://www.horiba.com",
        "market_cap": "Mid Cap"
    },
    "2667.T": {
        "short_name": "IMAGEONE CO LTD",
        "long_name": "ImageONE Co., Ltd.",
        "summary": "ImageONE Co., Ltd. provides healthcare and GEO solutions in Japan. The company offers onti, a medical exposure dose management system; Ehis, a cloud-based ordering electronic medical record system; CLEVINO PACS, a general-purpose diagnostic imaging software; POP-Net Viewer for radiology interpretation; Connectio Report, a radiology department report system; Connectio RIS for radiation department information system; and Oceanio that provides remote diagnostic imaging support services. It also provides GEO solutions, such as Pix 4D software and related products, microdrones small unmanned aerial vehicles, visible and infrared spectroradiometers, and satellite image analysis services. The company was founded in 1984 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-0022",
        "website": "http://www.imageone.co.jp",
        "market_cap": "Small Cap"
    },
    "5933.T": {
        "short_name": "ALINCO INC",
        "long_name": "Alinco Incorporated",
        "summary": "Alinco Incorporated develops, manufactures, and sells scaffolding equipment in Japan and internationally. The company develops, manufactures, and sells do-it-yourself products, aluminum molds, home appliances, and radio communication equipment; and sells fitness equipment. It is also involved in the rental of construction scaffolding, Octo-system, and other temporary equipment. The company was formerly known as Inoue Iron Works Co., Ltd. and changed its name to Alinco Incorporated in March 1983. The company was founded in 1938 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0043",
        "website": "http://www.alinco.co.jp",
        "market_cap": "Small Cap"
    },
    "6424.T": {
        "short_name": "TAKAMISAWA CYBERNETICS",
        "long_name": "Takamisawa Cybernetics Company, Ltd.",
        "summary": "Takamisawa Cybernetics Company, Ltd. manufactures and sells multi-functional automatic ticket vending machines in Japan. It offers transportation equipment, such as ticket vending machines, ticket issuing machines, IC card charge machines, and door/lifting type platform fences; and mechatronics equipment, including banknote handling, coin handling, and card handling machines. The company also provides gate machines, access management systems, card vending machines, parking place management systems, open door temperature control chambers, and disaster prevention measurement systems. Takamisawa Cybernetics Company, Ltd. was founded in 1969 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "164-0011",
        "website": "http://www.tacy.co.jp",
        "market_cap": "Small Cap"
    },
    "6436.T": {
        "short_name": "AMANO CORPORATION",
        "long_name": "Amano Corporation",
        "summary": "Amano Corporation provides time information, parking, environmental, and cleaning systems in Japan, North America, and internationally. It operates through Time Information System Business and Environment System Business segments. The company's time information systems include time and attendance (T&A), payroll, human resource, and access information systems; and T&A and access information terminals, PC interfaced time recorders, time recorders, electronic time stamps, and T&A/payroll/HR cloud services. It also provides parking systems, such as gate-type, flap-lock, bicycle parking, vehicle guidance, parking lot management, and security gate systems, as well as offers parking facility data center and commissioned management services. In addition, the company offers environmental systems consisting of energy and space-saving pulse-jet, all stainless steel body, and dust explosion pressure diffusion type dust collectors; electric mist collectors; dust collectors for welding work; and volatile organic compounds removal, pneumatic powder conveying, and large-scale dust collection systems. Further, it provides cleaning systems, including autonomous robotic floor, compact automatic floor, and ride-on automatic scrubbers; commercial robotic vacuum, carpet, and industrial vacuum cleaners; and hand-pushed sweepers, electronic high-speed burnishers, and floor polishers. The company was founded in 1931 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "222-8558",
        "website": "http://www.amano.co.jp",
        "market_cap": "Small Cap"
    },
    "6644.T": {
        "short_name": "OSAKI ELECTRIC CO",
        "long_name": "Osaki Electric Co., Ltd.",
        "summary": "Osaki Electric Co., Ltd. develops, manufactures, sells, and installs measurement and control equipment in Japan, rest of Asia, the Oceania, Europe, and internationally. It operates through three segments: Measurement and Control Equipment, Flat Panel Display Assembly Equipment, and Real Estate. The company offers residential and commercial metering devices, such as smart meters and gas meters; and a range of low voltage switchgear systems, including distribution boards, sub-boards, floor stand boards, motor control sensors, and power distribution units. It also provides information and communication related products consisting of optical couplers and switches, optical distributing frames, and electric power distribution panels and shelters. In addition, the company offers software, and related products and services, such as demand control equipment, head end systems, meter data management systems, and data visualization products. Further, it rents real estate properties. The company was formerly known as Kogyo Seisakujo and changed its name to Osaki Electric Co., Ltd. in April 1941. Osaki Electric Co., Ltd. was founded in 1916 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-8646",
        "website": "http://www.osaki.co.jp",
        "market_cap": "Small Cap"
    },
    "6664.T": {
        "short_name": "OPTOELECTRONICS CO LTD",
        "long_name": "Optoelectronics Co.,Ltd.",
        "summary": "Optoelectronics Co.,Ltd. develops, manufactures, and sells automatic recognition devices in Japan and internationally. It offers 2D imagers and 1D laser/CCD module engines, handy scanners, data collectors, handy terminals, and desktop/embedded and stationary scanners. The company was founded in 1976 and is headquartered in Warabi, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Warabi",
        "zipcode": "335-0002",
        "website": "http://www.opto.co.jp",
        "market_cap": "Small Cap"
    },
    "6709.T": {
        "short_name": "MEISEI ELECTRIC CO",
        "long_name": "Meisei Electric Co., Ltd.",
        "summary": "Meisei Electric Co., Ltd. manufactures and sells communication, electronic, electric measuring, information processing, other electric and electronic instruments, machineries, and parts in Japan and internationally. It also offers physical and chemical equipment, precision equipment, and others; and computer software. The company's products include radiosonde equipment, automatic radiosonde systems, automated meteorological data acquisition systems, visibility meters, and compact weather stations; and water management technology solutions, including telemetry systems, water discharge warning systems, dam data processing systems, etc. Its products also consist of disaster prevention information systems, QCAST earthquake early warning systems, landslide alert facility systems, external system control seismometers, and seismic intensity meters; neutron monitoring instruments, including space observation units; air-traffic control equipment, such as airport meteorological observing systems, air traffic control systems, and control tower systems for emergency; and space technology diversion for ground equipment. In addition, it offers products in the fields of rocket monitoring used for launching and control devices, as well as satellite-mounted devices, including rocket-mounted cameras, picture compressor equipment, hot gas valve motor controllers, and power sequence distribution boxes; and measuring instruments for various tests and training of military equipment, as well as provides various testing services for assessment of vibration and environmental resistance during launch and thermal design, performance, etc. in space for satellite and rocket components. The company was founded in 1938 and is headquartered in Isesaki, Japan. Meisei Electric Co., Ltd is a subsidiary of IHI Corporation.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Isesaki",
        "zipcode": "372-8585",
        "website": "http://www.meisei.co.jp",
        "market_cap": "Small Cap"
    },
    "6721.T": {
        "short_name": "WINTEST CORP",
        "long_name": "Wintest Corporation",
        "summary": "Wintest Corporation designs, develops, and sells automatic test equipment for semiconductor integrated circuits and flat panel displays for image sensor tester, LCD driver tester, and logic tester markets primarily in Japan. It offers LCD/OLED high speed driver test equipment, LCD/PDP/OLED driver IC test systems, standard logic IC test systems, digital output CIS test systems, high-end CCD/CIS test systems, LCD/OLED/LCOS array/CCD/CIS test systems, compact analog mixed signal IC test systems, and analog and mixed signal IC test systems. The company was founded in 1993 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "220-0023",
        "website": "http://www.wintest.co.jp",
        "market_cap": "Small Cap"
    },
    "6742.T": {
        "short_name": "KYOSAN ELECTRIC MANUFACTURING C",
        "long_name": "Kyosan Electric Manufacturing Co., Ltd.",
        "summary": "Kyosan Electric Manufacturing Co., Ltd. develops, manufactures, sells, and services railway signal equipment, road traffic signal equipment, and power conversion equipment in Japan and internationally. It offers railway signal systems, including train control and detection equipment, interlocking equipment, block systems, field equipment, level crossing protection equipment, total traffic control systems, maintenance equipment, power supply for signaling systems, and railway-related equipment. The company also provides safeguards for passenger transfer area; passenger information display devices; traffic management systems, such as road traffic control systems, road traffic signal controllers, road traffic signal units, traffic/pedestrian sensors, and other devices. In addition, it offers power conversion systems comprising digitally controlled RF systems and DC converters; uninterruptible power supplies for signal; and power supplies for communications devices. The company was formerly known as Tokyo Denki Kogyo Co., Ltd. and changed its name to Kyosan Electric Manufacturing Co., Ltd. in 1926. Kyosan Electric Manufacturing Co., Ltd. was founded in 1917 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "230-0031",
        "website": "http://www.kyosan.co.jp",
        "market_cap": "Small Cap"
    },
    "6777.T": {
        "short_name": "SANTEC CORP",
        "long_name": "Santec Corporation",
        "summary": "Santec Corporation produces and sells optical components, optical instruments, and optical coherence tomography (OCT) systems. The company offers optical instruments, including tunable lasers, tunable filters, optical test platforms, and polarization extinction ratio measurement equipment; and optical imaging and sensing products comprising OCT systems, accessories and software, 3D optical profilers, and lasers. It also provides optical components, including liquid crystal on silicon spatial light modulators, power monitors, variable attenuators, optical filters, filter chips, and optical submodules; and medical devices, such as biometers. The company was formerly known as Samcom Electronics Corporation and changed its name to Santec Corporation in June 1983. Santec Corporation was incorporated in 1979 and is headquartered in Komaki, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Komaki",
        "zipcode": "485-0802",
        "website": "http://www.santec.com",
        "market_cap": "Small Cap"
    },
    "6814.T": {
        "short_name": "FURUNO ELECTRIC CO",
        "long_name": "Furuno Electric Co., Ltd.",
        "summary": "Furuno Electric Co., Ltd. engages in the manufacture and sale of marine equipment, industrial electronics equipment, wireless LAN system, and handy terminals in Japan, the Americas, Europe, Asia, and internationally. It offers radars, AIS and ECDIS systems, and satellite communication equipment for merchant vessels; fish finders, scanning sonars, and radiotelephones for fishing vessels; and navigation systems, GPS and chart plotters, fish finders, and autopilot systems for sport fishing boats, sailboats, and yachts. The company also provides medical equipment devices, such as ultrasound bone densitometers and clinical chemical analyzers; and automotive ETC2.0/ETC systems, dedicated short range communication systems, GPS receivers, and GPS disciplined oscillators. In addition, it offers meteorological monitoring and analyzing systems, and global navigation satellite system displacement monitoring systems; and wireless LAN access points and wireless handheld terminals, as well as provides electromagnetic environment testing services. Furuno Electric Co., Ltd. was founded in 1938 and is headquartered in Nishinomiya, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nishinomiya",
        "zipcode": "662-8580",
        "website": "http://www.furuno.co.jp",
        "market_cap": "Small Cap"
    },
    "6850.T": {
        "short_name": "CHINO CORPORATION",
        "long_name": "Chino Corporation",
        "summary": "Chino Corporation manufactures and sells instrumentation and control equipment. Its products include temperature sensors, infrared radiation thermometers, temperature calibration equipment, traceability, temperature/humidity meters and sensors, constituent/moisture/thickness meters, data loggers, controllers/indicators, recorders, thyristor regulators, fuel cell testing systems, compressor performance testing systems, and instrumentation components. The company was formerly known as CHINO Works, Ltd. and changed its name to Chino Corporation in 1986. Chino Corporation was founded in 1913 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "173-8632",
        "website": "http://www.chino.co.jp",
        "market_cap": "Small Cap"
    },
    "6856.T": {
        "short_name": "HORIBA LTD",
        "long_name": "HORIBA, Ltd.",
        "summary": "HORIBA, Ltd. manufactures and sells automotive test, process and environmental, medical-diagnostics, semiconductor, and scientific instruments and systems. Its Automotive Test Systems segment offers emission measurement systems, driveline test systems, automotive emissions analyzers, engine test and brake test systems, and fuel cell and battery test systems; provides vehicle development engineering and testing engineering services; and leases and manages R&D facilities. The company's Process & Environmental Instruments & Systems segment provides stack gas analyzers, industrial water quality analyzers, water quality analysis and examination systems, air pollution analyzers, environmental radiation monitors, and process measurement equipment. Its Medical-Diagnostic Instruments & Systems segment offers hematology and CRP, immunology, clinical chemistry, and blood glucose analyzers. The company's Semiconductor Instruments & Systems segment provides mass flow controllers, chemical concentration monitors, reticle/mask particle detection systems, residual gas analyzers, and vaporizers. Its Scientific Instruments & Systems segment offers Raman spectrometers, pH meters, particle-size distribution analyzers, X-Ray fluorescence analyzers, elemental analyzers, fluorescence spectroscopy/fluorescence lifetime spectroscopy, optical components, spectrometers and detectors, and gratings. HORIBA, Ltd. was founded in 1945 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "601-8510",
        "website": "http://www.horiba.com",
        "market_cap": "Mid Cap"
    },
    "6858.T": {
        "short_name": "ONO SOKKI CO",
        "long_name": "Ono Sokki Co., Ltd.",
        "summary": "Ono Sokki Co., Ltd., together with its subsidiaries, manufactures and sells electronic measuring instruments in Japan and internationally. It provides automotive test systems, flow meters, GPS speed meters, and engine tachometers; sound level meters, microphones, amps, accelerometers, vibration comparators, and laser doppler vibrometers; and torque detectors, torque converters, and motor torques. In addition, it offers digital linear gages, non-contact thickness meters, and rotary and roller encoders; revolving detectors and indicators, speedometers, and portable tachometers; and FFT analyzers and data station software. Further, the company provides custom-made test equipment for R&D and quality control applications; and acoustic/vibration consulting services, after-sales services, engineering services, etc. Ono Sokki Co., Ltd. was incorporated in 1940 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "222-8507",
        "website": "http://www.onosokki.co.jp",
        "market_cap": "Small Cap"
    },
    "6859.T": {
        "short_name": "ESPEC CORP",
        "long_name": "Espec Corp.",
        "summary": "Espec Corp. manufactures and sells environmental test chambers worldwide. It operates through three segments: Equipment Business, Service Business, and Other Business. The company offers temperature and humidity chambers/rapid-rate thermal cycle chambers, thermal shock chambers, temperature chambers, and Web integrated network systems. It also provides secondary battery-related equipment; measurement and evaluation systems, and semiconductor-related equipment; and indoor farm and growth chambers. In addition, the company offers after-sales and engineering, and laboratory testing services; and analysis, calibration, and equipment rental and resale services. Espec Corp. was founded in 1947 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-8550",
        "website": "http://www.espec.co.jp",
        "market_cap": "Small Cap"
    },
    "6861.T": {
        "short_name": "KEYENCE CORP",
        "long_name": "Keyence Corporation",
        "summary": "Keyence Corporation, together with its subsidiaries, develops, manufactures, and sells factory automation solutions worldwide. The company offers photoelectric, fiber optic, laser, positioning, vision, and inductive proximity sensors, as well as network communication units used for presence/absence and part differentiation applications. It also provides measurement sensors, such as laser displacement and profiler, optical/laser micrometer, 3D interference measurement, spectral interference displacement, and contact displacement/LVDT sensors; and measurement systems, including optical comparators, 3D scanners, and CMM/laser trackers. In addition, the company offers safety products comprising safety laser scanners, light curtains, interlock switches, and controllers to protect operators from machine hazards; and pressure, flow, level, and temperature sensors for monitoring equipment processes. Further, it provides static eliminators/ionizers and electrostatic sensors which protect workers, machinery, and products from the damaging effects of electrostatic charge; vision systems and sensors, and barcode scanners to perform automatic inspection and part identification; and programmable logic controllers and other controls that are used for machine control applications. Additionally, the company offers laser marking systems/laser markers and industrial continuous inkjet printers; digital, 3D laser scanning, and fluorescence microscopes, as well as wide-area 3D measuring systems for industrial and life science applications; and handheld mobile computers. It serves customers in automotive/chassis assembly, metals/machining, FPD/glass, semiconductor/ICS, plastic/molding, food/pharmaceutical, steel, and other industries. Keyence Corporation was founded in 1972 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "533-8555",
        "website": "http://www.keyence.com",
        "market_cap": "Large Cap"
    },
    "6863.T": {
        "short_name": "NIRECO CORPORATION",
        "long_name": "Nireco Corporation",
        "summary": "Nireco Corporation provides process control, Web control, and inspection systems in Japan. It offers control and measuring systems, including electro-hydraulic actuators, eddy current level meters, thickness measuring systems, metal industry related edge position control systems, and automatic marking systems for steel and non-ferrous metal production lines. The company also provides Web control products, which include printing film related edge position control systems, tension control systems, automatic register control systems, print-to-cut register control systems, printing quality inspection systems, and gluing control systems. In addition, it offers inspection systems, such as defect inspection systems for plain surfaces, pouch packaging inspection systems, near-infrared ray analysis systems, image processing and analysis systems, and fruit and vegetable quality analysis systems, as well as fish selectors. The company was formerly known as Nippon Regulator Co., Ltd. and changed its name to Nireco Corporation in November 1984. Nireco Corporation was founded in 1931 and is headquartered in Hachioji, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Hachioji",
        "zipcode": "192-8522",
        "website": "http://www.nireco.com",
        "market_cap": "Small Cap"
    },
    "6866.T": {
        "short_name": "HIOKI E.E. CORP",
        "long_name": "Hioki E.E. Corporation",
        "summary": "Hioki E.E. Corporation, together with its subsidiaries, develops, manufactures, sells, and services electrical measuring instruments worldwide. The company offers automatic test equipment for testing of electronic circuit boards, and boards with embedded active and passive devices. It also provides data recording equipment for development of transport-related equipment, as well as monitoring and detecting equipment malfunctions. In addition, the company offers electronic measuring equipment for testing electronic components and evaluation of the quality of energy-saving equipment and power supplies; and field measuring instruments for performing maintenance and inspection of electrical work and equipment. Further, it provides data acquisition oscilloscopes, multichannel and compact data loggers, residence meters and battery testers, LCR and capacitance meters, impedance analyzers, super megohmmeters, electrometers, picoammeters, electrical safety testers, digital multi meters, signal generators, high precision power meters, power quality analyzers and power loggers, RGB laser optical meters, LED optical meters, and LAN cable testers, as well as hipot, insulation, and leakage testers. Additionally, the company offers current probes and sensors, magnetic field meters, infrared thermometers, temperature meters, insulation testers, clamp multi meters, ground resistance testers, phase rotation meters, and voltage detectors; solar panel and photovoltaic system maintenance testers; bare board/package/populated board testing products; meter relays, CTs, and shunts; specialized solutions; and other electrical measuring instruments. Its products are used in the automotive, environmental and alternative energy, and electronic components; and other applications, such as construction and facilities, household appliances, office, communications, chemical, food product, and pharmaceutical and medical research. The company was founded in 1935 and is headquartered in Ueda, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Ueda",
        "zipcode": "386-1192",
        "website": "http://www.hioki.co.jp",
        "market_cap": "Small Cap"
    },
    "6874.T": {
        "short_name": "KYORITSU ELECTRIC CORPORATION",
        "long_name": "Kyoritsu Electric Corporation",
        "summary": "Kyoritsu Electric Corporation offers various systems, testing and measuring instruments, etc. primarily in Japan. It provides process automation products, such as integrated production control systems, network-based control systems, and compact control systems, as well as flow, pressure, and temperature sensors; and factory automation products and services comprising Web camera monitoring systems and system integration services. The company also provides test and measurement products, including automatic optical measurement products, in-circuit testers, vibroducers, combination testers, PC-based function testers, PC-based multi meters and oscilloscopes, data acquisition systems, and digital oscilloscopes; laboratory automation products; and open network products, such as Linux and diskless servers. In addition, it offers civil automation products, which include shield and tunnel boring machine management systems; electromagnetic compatibility products; and environmental products. Kyoritsu Electric Corporation was founded in 1957 and is based in Shizuoka, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Shizuoka",
        "zipcode": "422-8686",
        "website": "http://www.kdwan.co.jp",
        "market_cap": "Small Cap"
    },
    "6920.T": {
        "short_name": "LASERTEC CORP",
        "long_name": "Lasertec Corporation",
        "summary": "Lasertec Corporation develops, manufactures, sells, and services semiconductor-related equipment, energy efficiency and environment products, laser microscopes, and flat panel display-related equipment worldwide. The company provides systems used to inspect and measure defects on semiconductor photomasks and wafers; wafer inspection and measurement equipment, such as lithography process inspection systems and coating thickness non-uniformity inspection systems; systems used to inspect and review SiC and transparent wafers, which have applications in electric power systems, and railway, office, and consumer equipment. It also offers flat panel display photomask inspection systems; and laser microscopes, which are used for the observation and analysis of various materials and components comprising semiconductor materials, transparent films, coating materials, inorganic and organic materials, biological samples, metal parts, and plastic components. The company was formerly known as NJS Corporation and changed its name to Lasertec Corporation in 1986. Lasertec Corporation was founded in 1960 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "222-8552",
        "website": "http://www.lasertec.co.jp",
        "market_cap": "Large Cap"
    },
    "6951.T": {
        "short_name": "JEOL LTD",
        "long_name": "JEOL Ltd.",
        "summary": "JEOL Ltd. engages in the research, development, manufacture, and marketing of scientific and metrology instruments, semiconductor and industrial equipment, and medical equipment. The company provides transmission electron microscopes; scanning electron microscopes; ion beam application equipment, including specimen preparation equipment and multibeam systems; instruments for micro area and surface analysis, such as electron probe micro analyzers, auger microprobes, and photoelectron spectrometers; magnetic resonance equipment, such as nuclear magnetic resonance and electron spin resonance spectrometers; X-ray fluorescence spectrometers; mass spectrometers; electron beam lithography systems; and clinical chemistry analyzers. It also offers industrial equipment for thin-film formation and material processing, including thin film formation equipment and material processing equipment. The company was formerly known as Japan Electron Optics Laboratory Co., Ltd. and changed its name to JEOL Ltd. in 1961. JEOL Ltd. was founded in 1949 and is headquartered in Akishima, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Akishima",
        "zipcode": "196-8558",
        "website": "http://www.jeol.co.jp",
        "market_cap": "Mid Cap"
    },
    "6957.T": {
        "short_name": "SHIBAURA ELECTRONICS CO",
        "long_name": "Shibaura Electronics Co.,Ltd.",
        "summary": "Shibaura Electronics Co.,Ltd. manufactures and sells thermistor elements, and products utilizing thermistor elements in Japan and internationally. The company offers temperature sensors, humidity sensors, temperature controllers, anemometers, etc. Its products are used in automobiles, air conditioners, home appliances, housing equipment, industrial equipment, and printers. Shibaura Electronics Co.,Ltd. was founded in 1953 and is headquartered in Saitama, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Saitama",
        "zipcode": null,
        "website": "http://www.shibauraelectronics.com",
        "market_cap": "Small Cap"
    },
    "7500.T": {
        "short_name": "NISHIKAWA KEISOKU CO",
        "long_name": "Nishikawa Keisoku Co., Ltd.",
        "summary": "Nishikawa Keisoku Co., Ltd. sells control and information equipment systems, measuring instruments, and analytical equipment in Japan. The company also provides system engineering, control system design, instrumentation work, construction, and technical services. Its products are used in various industries, such as electricity, gas, water and sewage, petroleum, chemical, automobile, electrical machinery, telecommunication, environment, forensic, chemical weapons, and pharmaceuticals. Nishikawa Keisoku Co., Ltd. was founded in 1932 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "151-8620",
        "website": "http://www.nskw.co.jp",
        "market_cap": "Small Cap"
    },
    "7701.T": {
        "short_name": "SHIMADZU CORP",
        "long_name": "Shimadzu Corporation",
        "summary": "Shimadzu Corporation manufactures and sells analytical and measuring instruments, medical systems, industrial machinery, and aircraft equipment worldwide. Its analytical and measuring instruments include gas and liquid chromatography, gas and liquid chromatograph-mass spectrometry, data management and software, molecular spectroscopy, elemental analysis, surface analysis, life science lab instrument, total organic carbon analysis, continuous monitoring analysis, thermal analysis, particle size analysis, materials testing and inspection, non-destructive testing, and balance products. It provides medical systems comprising angiography, fluoroscopy, mobile C-arm, radiography, mobile X-ray systems, and fluorescence imaging products; and optical devices that consist of diffraction gratings, aspherical mirrors, laser mirrors and windows for high power lasers, polka-dot beam splitters, and precision refractometers. The company also offers vacuum and industrial machinery, including turbo molecular pumps, helium leak detectors, vacuum heat-treatment furnaces, liquid delivery equipment gear pumps, mechatronic systems glass fiber winders, and dynamic balancing machines. Further, it provides hydraulic equipment, such as hydraulic gear pumps, power packages, and multi control valves; and aircraft equipment/marine devices/magnetic measurements, including electro-mechanical actuators, flight control systems, landing gear systems, and ferromagnetic object detectors/magnetometers. Shimadzu Corporation was founded in 1875 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "604-8511",
        "website": "http://www.shimadzu.com",
        "market_cap": "Large Cap"
    },
    "7715.T": {
        "short_name": "NAGANO KEIKI CO LTD",
        "long_name": "Nagano Keiki Co., Ltd.",
        "summary": "Nagano Keiki Co., Ltd. manufactures and sells measurement instruments and control equipment in Japan and internationally. It offers various pressure gauges, including compound, vacuum, differential pressure, low pressure, absolute pressure, and diaphragm-seal type products; mechanical and electrical types switches, indicators with switches, and plug-in connectors for pressure switches; pressure sensors comprising pressure transmitters, load and level sensors, and converters; digital pressure gauges, and digital indicators and meter relays; and various types of temperature gauges. The company also provides flow meters for use in water, air, and gas; heat meters and heat monitors; inspection and calibration instruments, including dead weight testers, liquid column manometers, precision aneroid manometers, digital precision manometers, digital pressure checkers, programmable pressure controllers, and data loggers and fiber brag grating sensors; and accessories, such as regulators, ceramic products, noise level and vibration meters; and aluminum and magnesium die cast components, as well as maintenance and calibration services. It serves automobile, industrial vehicle and construction, FA and industrial machinery, HVAC and refrigerator, semiconductor, process instrumentation, and medical and welfare industries; food, drug, and cosmetics sectors; marine, aeronautical, and rail industries; and high-pressure hydrogen, gas, and energy applications. Nagano Keiki Co., Ltd. was founded in 1896 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "143-8544",
        "website": "http://www.naganokeiki.co.jp",
        "market_cap": "Small Cap"
    },
    "7721.T": {
        "short_name": "TOKYO KEIKI INC",
        "long_name": "TOKYO KEIKI INC.",
        "summary": "TOKYO KEIKI INC., together with its subsidiaries, manufactures and sells measuring instruments in Japan and internationally. The company offers marine systems; hydraulic equipment and control systems; flow meters and related systems and equipment; communication control systems; printing inspection equipment and systems; track maintenance equipment; construction equipment and systems; inertial sensor and applied equipment; maritime traffic systems; and microwave devices. It also provides fluid power systems, flow and level measurement, RF components, and railway maintenance systems; and helicopter broadcasting systems and aerospace electronic equipment. The company was formerly known as Tokimec Inc. and changed its name to TOKYO KEIKI INC. in 2008. TOKYO KEIKI INC. was founded in 1896 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "144-8551",
        "website": "http://www.tokyo-keiki.co.jp",
        "market_cap": "Small Cap"
    },
    "7723.T": {
        "short_name": "AICHI TOKEI DENKI CO",
        "long_name": "Aichi Tokei Denki Co., Ltd.",
        "summary": "Aichi Tokei Denki Co., Ltd. provides water and gas meters, and related equipment in Japan and internationally. Its products for liquid measurement include electromagnetic water meters, residential water meters, portable and electronic water meters, capacitive electromagnetic flow sensors, compact electromagnetic flow sensors, microflow sensors, micro stream sensors, flow sensors, instantaneous flow-rate/integrating flow volume flowmeters, small-size flow sensors, ultrasonic flow meters, and electromagnetic flow meters for agricultural applications. The company's products for gas measurement comprise ultrasonic flow meters for compressed air and nitrogen; ultrasonic flow meter for fuel gas; turbine gas meters for flow management; pressure-reducing valves; intelligent gas meters; digital manometers for town gas and LP gas; and systems, such as housing and building equipment and systems, instrumentations, and dies and other parts. Its products are used in infrastructure, healthcare, and energy industries, as well as houses and buildings. The company was formerly known as AICHI TOKEI MFG. CO., LTD. and changed its name to Aichi Tokei Denki Co., Ltd. in July 1912. Aichi Tokei Denki Co., Ltd. was founded in 1898 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "456-8691",
        "website": "http://www.aichitokei.co.jp",
        "market_cap": "Small Cap"
    },
    "7732.T": {
        "short_name": "TOPCON CORPORATION",
        "long_name": "Topcon Corporation",
        "summary": "Topcon Corporation, together with its subsidiaries, develops, manufactures, and sells positioning, eye care, and smart infrastructure products worldwide. Its positioning products include GNSS receivers, GPS systems, machine control systems, precision agriculture systems, and asset management systems. The company's infrastructure products consists of total stations, surveying instruments, layout navigators, mobile mapping systems, 3D laser scanners, field controllers, levels, theodolites, rotating lasers, and pipe lasers. Its eye care products comprise 3D optical coherence tomography systems, retinal cameras, laser photocoagulators, tonometers, slit lamps, operation and specular microscopes, ophthalmic data system IMAGEnet, vision testers, auto refractometer, auto kerato-refractometers, lens meters/analyzer, and chart projectors. In addition, it provide crop analysis, data management, guidance and autosteering, weighing and measurement, mapping, implement control, feed management, elevation lasers, alignment lasers, GPS rovers, layout instruments, equipment automation, sonic grade control, workflow solutions, and telematics site management services. The company was formerly known as Tokyo Optical Co., Ltd. and changed its name to Topcon Corporation in 1989. Topcon Corporation was incorporated in 1932 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "174-8580",
        "website": "http://www.topcon.co.jp",
        "market_cap": "Small Cap"
    },
    "7758.T": {
        "short_name": "SEKONIC CORPORATION",
        "long_name": "Sekonic Holdings Corporation",
        "summary": "Sekonic Holdings Corporation engages in the contract production business in Japan and internationally. Its products include exposure and color meters, optical mark reader (OMR), temperature and humidity recorders, viscometers, inorganic electroluminescence (EL), and surveillance cameras. The company also manufactures and sells copier option units, plotters, display devices, board mounting, and bundle processing units, as well as leases real estate properties. In addition, it develops software. The company supplies its products to office equipment manufacturers, camera equipment manufacturers, home appliance manufacturers, telecommunications equipment manufacturers, optical equipment manufacturers, distributors, and users. Sekonic Holdings Corporation was founded in 1951 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "154-0001",
        "website": "http://www.sekonic-hd.jp",
        "market_cap": "Small Cap"
    },
    "7B4.F": {
        "short_name": "KYOSAN EL. MFG",
        "long_name": "Kyosan Electric Manufacturing Co., Ltd.",
        "summary": "Kyosan Electric Manufacturing Co., Ltd. develops, manufactures, sells, and services railway signal equipment, road traffic signal equipment, and power conversion equipment in Japan and internationally. It offers railway signal systems, including train control and detection equipment, interlocking equipment, block systems, field equipment, level crossing protection equipment, total traffic control systems, maintenance equipment, power supply for signaling systems, and railway-related equipment. The company also provides safeguards for passenger transfer area; passenger information display devices; traffic management systems, such as road traffic control systems, road traffic signal controllers, road traffic signal units, traffic/pedestrian sensors, and other devices. In addition, it offers power conversion systems comprising digitally controlled RF systems and DC converters; uninterruptible power supplies for signal; and power supplies for communications devices. The company was formerly known as Tokyo Denki Kogyo Co., Ltd. and changed its name to Kyosan Electric Manufacturing Co., Ltd. in 1926. Kyosan Electric Manufacturing Co., Ltd. was founded in 1917 and is headquartered in Yokohama, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "230-0031",
        "website": "http://www.kyosan.co.jp",
        "market_cap": "Small Cap"
    },
    "8AU.F": {
        "short_name": "SANTEC CORP.",
        "long_name": "Santec Corporation",
        "summary": "Santec Corporation produces and sells optical components, optical instruments, and optical coherence tomography (OCT) systems. The company offers optical instruments, including tunable lasers, tunable filters, optical test platforms, and polarization extinction ratio measurement equipment; and optical imaging and sensing products comprising OCT systems, accessories and software, 3D optical profilers, and lasers. It also provides optical components, including liquid crystal on silicon spatial light modulators, power monitors, variable attenuators, optical filters, filter chips, and optical submodules; and medical devices, such as biometers. The company was formerly known as Samcom Electronics Corporation and changed its name to Santec Corporation in June 1983. Santec Corporation was incorporated in 1979 and is headquartered in Komaki, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Komaki",
        "zipcode": "485-0802",
        "website": "http://www.santec.com",
        "market_cap": "Small Cap"
    },
    "9474.T": {
        "short_name": "ZENRIN CO LTD",
        "long_name": "Zenrin Co., Ltd.",
        "summary": "Zenrin Co., Ltd. engages in the collection and management of a range of geospatial information worldwide. The company operates through Map Database, General Printing, and Other segments. It manufactures and sells printed residential maps, special-purpose maps, residential map databases, and data for in-car navigation systems; and map data for internet services, as well as provides services for smartphones. The company also manufactures and sells general printing goods; provides marketing solutions; and sells purchased products. In addition, it is involved in the development of software and services related to Zenrin integrated geospatial system. Zenrin Co., Ltd. was founded in 1948 and is headquartered in Kitakyushu, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kitakyushu",
        "zipcode": "804-0003",
        "website": "http://www.zenrin.co.jp",
        "market_cap": "Small Cap"
    },
    "HDZ.F": {
        "short_name": "SHIMADZU CORP.",
        "long_name": "Shimadzu Corporation",
        "summary": "Shimadzu Corporation manufactures and sells analytical and measuring instruments, medical systems, industrial machinery, and aircraft equipment worldwide. Its analytical and measuring instruments include gas and liquid chromatography, gas and liquid chromatograph-mass spectrometry, data management and software, molecular spectroscopy, elemental analysis, surface analysis, life science lab instrument, total organic carbon analysis, continuous monitoring analysis, thermal analysis, particle size analysis, materials testing and inspection, non-destructive testing, and balance products. It provides medical systems comprising angiography, fluoroscopy, mobile C-arm, radiography, mobile X-ray systems, and fluorescence imaging products; and optical devices that consist of diffraction gratings, aspherical mirrors, laser mirrors and windows for high power lasers, polka-dot beam splitters, and precision refractometers. The company also offers vacuum and industrial machinery, including turbo molecular pumps, helium leak detectors, vacuum heat-treatment furnaces, liquid delivery equipment gear pumps, mechatronic systems glass fiber winders, and dynamic balancing machines. Further, it provides hydraulic equipment, such as hydraulic gear pumps, power packages, and multi control valves; and aircraft equipment/marine devices/magnetic measurements, including electro-mechanical actuators, flight control systems, landing gear systems, and ferromagnetic object detectors/magnetometers. Shimadzu Corporation was founded in 1875 and is headquartered in Kyoto, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "604-8511",
        "website": "http://www.shimadzu.com",
        "market_cap": "Large Cap"
    },
    "JEL.F": {
        "short_name": "JEOL -JAPAN EL.OPT.-",
        "long_name": "JEOL Ltd.",
        "summary": "JEOL Ltd. engages in the research, development, manufacture, and marketing of scientific and metrology instruments, semiconductor and industrial equipment, and medical equipment. The company provides transmission electron microscopes; scanning electron microscopes; ion beam application equipment, including specimen preparation equipment and multibeam systems; instruments for micro area and surface analysis, such as electron probe micro analyzers, auger microprobes, and photoelectron spectrometers; magnetic resonance equipment, such as nuclear magnetic resonance and electron spin resonance spectrometers; X-ray fluorescence spectrometers; mass spectrometers; electron beam lithography systems; and clinical chemistry analyzers. It also offers industrial equipment for thin-film formation and material processing, including thin film formation equipment and material processing equipment. The company was formerly known as Japan Electron Optics Laboratory Co., Ltd. and changed its name to JEOL Ltd. in 1961. JEOL Ltd. was founded in 1949 and is headquartered in Akishima, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Akishima",
        "zipcode": "196-8558",
        "website": "http://www.jeol.co.jp",
        "market_cap": "Mid Cap"
    },
    "KEE.F": {
        "short_name": "KEYENCE CORP.",
        "long_name": "Keyence Corporation",
        "summary": "Keyence Corporation, together with its subsidiaries, develops, manufactures, and sells factory automation solutions worldwide. The company offers photoelectric, fiber optic, laser, positioning, vision, and inductive proximity sensors, as well as network communication units used for presence/absence and part differentiation applications. It also provides measurement sensors, such as laser displacement and profiler, optical/laser micrometer, 3D interference measurement, spectral interference displacement, and contact displacement/LVDT sensors; and measurement systems, including optical comparators, 3D scanners, and CMM/laser trackers. In addition, the company offers safety products comprising safety laser scanners, light curtains, interlock switches, and controllers to protect operators from machine hazards; and pressure, flow, level, and temperature sensors for monitoring equipment processes. Further, it provides static eliminators/ionizers and electrostatic sensors which protect workers, machinery, and products from the damaging effects of electrostatic charge; vision systems and sensors, and barcode scanners to perform automatic inspection and part identification; and programmable logic controllers and other controls that are used for machine control applications. Additionally, the company offers laser marking systems/laser markers and industrial continuous inkjet printers; digital, 3D laser scanning, and fluorescence microscopes, as well as wide-area 3D measuring systems for industrial and life science applications; and handheld mobile computers. It serves customers in automotive/chassis assembly, metals/machining, FPD/glass, semiconductor/ICS, plastic/molding, food/pharmaceutical, steel, and other industries. Keyence Corporation was founded in 1972 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "533-8555",
        "website": "http://www.keyence.com",
        "market_cap": "Large Cap"
    },
    "KEE.VI": {
        "short_name": "KEYENCE CORP",
        "long_name": "Keyence Corporation",
        "summary": "Keyence Corporation, together with its subsidiaries, develops, manufactures, and sells factory automation solutions worldwide. The company offers photoelectric, fiber optic, laser, positioning, vision, and inductive proximity sensors, as well as network communication units used for presence/absence and part differentiation applications. It also provides measurement sensors, such as laser displacement and profiler, optical/laser micrometer, 3D interference measurement, spectral interference displacement, and contact displacement/LVDT sensors; and measurement systems, including optical comparators, 3D scanners, and CMM/laser trackers. In addition, the company offers safety products comprising safety laser scanners, light curtains, interlock switches, and controllers to protect operators from machine hazards; and pressure, flow, level, and temperature sensors for monitoring equipment processes. Further, it provides static eliminators/ionizers and electrostatic sensors which protect workers, machinery, and products from the damaging effects of electrostatic charge; vision systems and sensors, and barcode scanners to perform automatic inspection and part identification; and programmable logic controllers and other controls that are used for machine control applications. Additionally, the company offers laser marking systems/laser markers and industrial continuous inkjet printers; digital, 3D laser scanning, and fluorescence microscopes, as well as wide-area 3D measuring systems for industrial and life science applications; and handheld mobile computers. It serves customers in automotive/chassis assembly, metals/machining, FPD/glass, semiconductor/ICS, plastic/molding, food/pharmaceutical, steel, and other industries. Keyence Corporation was founded in 1972 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "533-8555",
        "website": "http://www.keyence.com",
        "market_cap": "Large Cap"
    },
    "KYCCF": {
        "short_name": "KEYENCE CORP",
        "long_name": "Keyence Corporation",
        "summary": "Keyence Corporation, together with its subsidiaries, develops, manufactures, and sells factory automation solutions worldwide. The company offers photoelectric, fiber optic, laser, positioning, vision, and inductive proximity sensors, as well as network communication units used for presence/absence and part differentiation applications. It also provides measurement sensors, such as laser displacement and profiler, optical/laser micrometer, 3D interference measurement, spectral interference displacement, and contact displacement/LVDT sensors; and measurement systems, including optical comparators, 3D scanners, and CMM/laser trackers. In addition, the company offers safety products comprising safety laser scanners, light curtains, interlock switches, and controllers to protect operators from machine hazards; and pressure, flow, level, and temperature sensors for monitoring equipment processes. Further, it provides static eliminators/ionizers and electrostatic sensors which protect workers, machinery, and products from the damaging effects of electrostatic charge; vision systems and sensors, and barcode scanners to perform automatic inspection and part identification; and programmable logic controllers and other controls that are used for machine control applications. Additionally, the company offers laser marking systems/laser markers and industrial continuous inkjet printers; digital, 3D laser scanning, and fluorescence microscopes, as well as wide-area 3D measuring systems for industrial and life science applications; and handheld mobile computers. It serves customers in automotive/chassis assembly, metals/machining, FPD/glass, semiconductor/ICS, plastic/molding, food/pharmaceutical, steel, and other industries. Keyence Corporation was founded in 1972 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "533-8555",
        "website": "http://www.keyence.com",
        "market_cap": "Large Cap"
    },
    "LSRCF": {
        "short_name": "LASERTEC CORP",
        "long_name": "Lasertec Corporation",
        "summary": "Lasertec Corporation develops, manufactures, sells, and services semiconductor-related equipment, energy efficiency and environment products, laser microscopes, and flat panel display-related equipment worldwide. The company provides systems used to inspect and measure defects on semiconductor photomasks and wafers; wafer inspection and measurement equipment, such as lithography process inspection systems and coating thickness non-uniformity inspection systems; systems used to inspect and review SiC and transparent wafers, which have applications in electric power systems, and railway, office, and consumer equipment. It also offers flat panel display photomask inspection systems; and laser microscopes, which are used for the observation and analysis of various materials and components comprising semiconductor materials, transparent films, coating materials, inorganic and organic materials, biological samples, metal parts, and plastic components. The company was formerly known as NJS Corporation and changed its name to Lasertec Corporation in 1986. Lasertec Corporation was founded in 1960 and is headquartered in Yokohama, Japan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "222-8552",
        "website": "http://www.lasertec.co.jp",
        "market_cap": "Large Cap"
    },
    "LSRCY": {
        "short_name": "LASERTEC CORP",
        "long_name": "Lasertec Corporation",
        "summary": "Lasertec Corporation develops, manufactures, sells, and services semiconductor-related equipment, energy efficiency and environment products, laser microscopes, and flat panel display-related equipment worldwide. The company provides systems used to inspect and measure defects on semiconductor photomasks and wafers; wafer inspection and measurement equipment, such as lithography process inspection systems and coating thickness non-uniformity inspection systems; systems used to inspect and review SiC and transparent wafers, which have applications in electric power systems, and railway, office, and consumer equipment. It also offers flat panel display photomask inspection systems; and laser microscopes, which are used for the observation and analysis of various materials and components comprising semiconductor materials, transparent films, coating materials, inorganic and organic materials, biological samples, metal parts, and plastic components. The company was formerly known as NJS Corporation and changed its name to Lasertec Corporation in 1986. Lasertec Corporation was founded in 1960 and is headquartered in Yokohama, Japan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "222-8552",
        "website": "http://www.lasertec.co.jp",
        "market_cap": "Large Cap"
    },
    "TOPCF": {
        "short_name": "TOPCON CORPORATION",
        "long_name": "Topcon Corporation",
        "summary": "Topcon Corporation, together with its subsidiaries, develops, manufactures, and sells positioning, eye care, and smart infrastructure products worldwide. Its positioning products include GNSS receivers, GPS systems, machine control systems, precision agriculture systems, and asset management systems. The company's infrastructure products consists of total stations, surveying instruments, layout navigators, mobile mapping systems, 3D laser scanners, field controllers, levels, theodolites, rotating lasers, and pipe lasers. Its eye care products comprise 3D optical coherence tomography systems, retinal cameras, laser photocoagulators, tonometers, slit lamps, operation and specular microscopes, ophthalmic data system IMAGEnet, vision testers, auto refractometer, auto kerato-refractometers, lens meters/analyzer, and chart projectors. In addition, it provide crop analysis, data management, guidance and autosteering, weighing and measurement, mapping, implement control, feed management, elevation lasers, alignment lasers, GPS rovers, layout instruments, equipment automation, sonic grade control, workflow solutions, and telematics site management services. The company was formerly known as Tokyo Optical Co., Ltd. and changed its name to Topcon Corporation in 1989. Topcon Corporation was incorporated in 1932 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "174-8580",
        "website": "http://www.topcon.co.jp",
        "market_cap": "Small Cap"
    },
    "TOY.MU": {
        "short_name": "TOYO CORP.",
        "long_name": "TOYO Corporation",
        "summary": "TOYO Corporation provides measurement instruments and technologies in Japan and internationally. The company's products include multi-channel LC material characteristics measurement systems; synesis (portable type) packet capture/analysis systems; automatic EMI measurement systems; liquid crystal materials evaluation systems; TFT-LCD panel measurement systems; automatic immunity measurement systems; shielding material permeation loss measurement systems; hall measurement systems; fuel cell test systems; secondary battery charge/discharge test systems; packet capture/analysis systems; DDoS mitigation systems; motor torque test systems; power boosters; amplifiers; ferroelectric substance evaluation systems; antenna pattern measurement systems; noise and vibration analysis systems; engine test bench measurement systems; control stability analysis systems; driver monitoring and stimulation systems; and on-vehicle brake evaluation systems, as well as impedance analysis support software products. It offers measurement instruments in the areas of information communication technologies, automotive measurements, sustainable energy and environment, EMC (electromagnetic compatibility) testing, ocean surveys, software quality and productivity, and medical systems. TOYO Corporation also provides cyber security services; communication standards certification services through lab testing of various wireless communication devices. In addition, it offers consulting, technical support, and after sales services, as well as organizes seminars and training courses. The company was formerly known as TOYO Trading Co., Ltd. and changed its name to TOYO Corporation in February 1977. TOYO Corporation was founded in 1953 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8284",
        "website": "http://www.toyo.co.jp",
        "market_cap": "Small Cap"
    }
}