{
    "3104.T": {
        "short_name": "FUJIBO HOLDINGS INC",
        "long_name": "Fujibo Holdings, Inc.",
        "summary": "Fujibo Holdings, Inc. engages in polishing pads, chemical industrial products, textiles, and other businesses in Japan. The company provides POLYPAS polishing pads for precision polishing of silicon wafers, as well as for various types of semiconductor materials, metals, and glasses; and functional non-woven fabrics, functional films, as well as cleaning and polishing tapes. It also offers fine chemical intermediates for the production of raw materials for medicines, agricultural chemicals, electronic materials, and functional chemicals. In addition, the company is involved in the export of vehicles and automotive components; recovery and refining of used solvents; operation of solar power generation plant; and trading businesses. Further, it provides functional fiber products. Fujibo Holdings, Inc. was founded in 1896 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0013",
        "website": "http://www.fujibo.co.jp",
        "market_cap": "Large Cap"
    },
    "3107.T": {
        "short_name": "DAIWABO HOLDINGS CO LTD",
        "long_name": "Daiwabo Holdings Co., Ltd.",
        "summary": "Daiwabo Holdings Co., Ltd. operates as an IT distributor in Japan and internationally. The company distributes computer appliances, peripheral devices, etc.; and provides services and support. It also manufactures, processes, and sells synthetic fiber, nonwoven fabric, and industrial materials and related products; spun yarn, fabric, knitting, and secondary products; and clothing products. In addition, the company manufactures and sells machine tools, such as vertical lathes, grinding machines, and specialized machines; and cartoning machines, intermediate packaging machines, corrugated cardboard casers, and other automatic machinery. Further, it manufactures and sells rubber sponge products; and provides hotel management, insurance agency, and engineering services. Daiwabo Holdings Co., Ltd. was founded in 1941 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0056",
        "website": "http://www.daiwabo-holdings.com",
        "market_cap": "Large Cap"
    },
    "3109.T": {
        "short_name": "SHIKIBO LTD",
        "long_name": "Shikibo Ltd.",
        "summary": "Shikibo Ltd. manufactures, processes, and markets various textile products in Japan and internationally. The company offers spun yarns, textured yarns, textile materials and products, knit materials and products, bedding materials and products, etc. It also manufactures, processes, and markets various chemical industry products, including industrial adhesive agents, food additives, etc.; industrial materials comprising dryer fabrics for paper making, filter cloths, etc.; and advanced composite materials. In addition, the company is involved in the real estate development activities, such as urban development. Shikibo Ltd. was founded in 1892 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0051",
        "website": "http://www.shikibo.co.jp",
        "market_cap": "Large Cap"
    },
    "3111.T": {
        "short_name": "OMIKENSHI CO LTD",
        "long_name": "Omikenshi Co., Ltd.",
        "summary": "Omikenshi Co., Ltd. engages in the manufacture, processing, and sale of rayon steple fiber and spinning yarn in Japan. The company also offers knitting, woven, and nonwoven fabric products; various towels and sleeping products; and various foods and beverages. In addition, it is involved in the software development and horticulture activities, as well as in the sale of basic cosmetics. Omikenshi Co., Ltd. was founded in 1917 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-8541",
        "website": "http://www.omikenshi.co.jp",
        "market_cap": "Mid Cap"
    },
    "3123.T": {
        "short_name": "SAIBO CO LTD",
        "long_name": "Saibo Co., Ltd.",
        "summary": "Saibo Co., Ltd. primarily manufactures and sells textile products in Japan and internationally. It offers apparel products, such as corporate office uniforms, working wear, service wear, jackets, and suits; and novelty and sports-related products. The company also provides textile materials, including rayon filament yarn, polyester yarn, mixed yarn, synthetic cotton, and polyester and linen fabrics, as well as embroidery lace materials. In addition, it engages in the rental of commercial facilities and real estate properties, as well as golf driving range management activities. Further, the company manufactures and sells automatic water supply pots and plants; provision of repairing services for automobile sheet metal paint products; provision of building maintenance services; interior construction activities; and sale of new and used cars. Saibo Co., Ltd. was founded in 1948 and is headquartered in Kawaguchi, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kawaguchi",
        "zipcode": "333-0842",
        "website": "http://www.saibo.co.jp",
        "market_cap": "Mid Cap"
    },
    "3125.T": {
        "short_name": "SHINNAIGAI TEXTILE",
        "long_name": "Shinnaigai Textile Ltd.",
        "summary": "Shinnaigai Textile Ltd. manufactures and sells textile products in Japan. It provides shape change, color change, and special material threads, as well as spun and mixed yarns. The company was founded in 1887 and is based in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0051",
        "website": "http://www.shinnaigai-tex.co.jp",
        "market_cap": "Small Cap"
    },
    "3161.T": {
        "short_name": "AZEARTH CORPORATION",
        "long_name": "AZEARTH Corporation",
        "summary": "AZEARTH Corporation manufactures and sells chemical protective garments and environmental equipment in Japan and internationally. It provides polystyrene foam for tatami matting and flooring, insulation boards, threads, edges, and machines, as well as other types of tatami materials. The company also engages in the laying and construction work on the section that lies beneath tatami. In addition, it offers garment materials, such as inner linings, interlining clothes, pocket clothes, and quarter lining belts; and other textile materials, as well as provides contract cutting manufacturing services. AZEARTH Corporation was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "111-8623",
        "website": "http://www.azearth.co.jp",
        "market_cap": "Mid Cap"
    },
    "3190.T": {
        "short_name": "HOTMAN CO LTD",
        "long_name": "HOTMAN Co., Ltd.",
        "summary": "HOTMAN Co., Ltd. operates car accessories stores in Japan. Its stores offer tires, wheels, car audio products, and other car accessories, as well as vehicle inspection, sheet metal, and maintenance services. The company's stores also provide used cars, miscellaneous goods, etc., as well as car rental services. The company operates approximately 113 stores. In addition, it is involved in the lottery, Internet and tea place, and amusement activities; and automobile sales and purchase activities. HOTMAN Co., Ltd. was founded in 1975 and is headquartered in Sendai, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sendai",
        "zipcode": null,
        "website": "http://www.yg-hotman.com",
        "market_cap": "Mid Cap"
    },
    "3202.T": {
        "short_name": "DAITOBO CO LTD",
        "long_name": "Daitobo Co., Ltd.",
        "summary": "Daitobo Co., Ltd. engages in the fashion apparel and uniform, commercial facility/real estate, healthcare, and other related businesses in Japan and internationally. The company offers textile fabric OEM and knit ODM services; value-added and Chinese materials; and wool, cotton, and synthetic fiber uniforms, as well as uniforms for government agencies. It also invests in and develops commercial facilities; rents housing; and purchases and sells real estate properties. In addition, the company engages in the manufacture of health related materials, including sleeping products under the EWOOL name, as well as other value added products under the Mixley Wool brand name; sale and wholesale of futon type home medical equipment; and provision of health-related food products under the Kenyosen and SpoLife LN2 names. Further, it provides OEM services primarily in China; and general bedding products. The company was formerly known as Daito Woolen Spinning & Weaving Co Ltd and changed its name to Daitobo Co., Ltd. in September 2016. Daitobo Co., Ltd. was founded in 1896 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0023",
        "website": "http://www.daitobo.co.jp",
        "market_cap": "Mid Cap"
    },
    "3204.T": {
        "short_name": "TOABO CORPORATION",
        "long_name": "Toabo Corporation",
        "summary": "Toabo Corporation manufactures and sells textiles in Japan and internationally. It offers fabrics, suits, uniforms, and wool products. The company is also involved in the manufacture of fine chemicals used in electronic materials and healthcare-related fields; electronic products for use in the field of power tools, vacuum cleaners, home appliances, industrial equipment, and OA equipment; and automotive interior, wastewater treatment, civil engineering, and greening materials. In addition, it leases offices, commercial complexes, and factory sites, as well as engages in driving school businesses. Toabo Corporation was founded in 1922 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "540-6018",
        "website": "http://www.toabo.co.jp",
        "market_cap": "Mid Cap"
    },
    "3302.T": {
        "short_name": "TEIKOKU SEN-I CO",
        "long_name": "Teikoku Sen-i Co., Ltd.",
        "summary": "Teikoku Sen-i Co., Ltd. manufactures and sells disaster prevention products and equipment primarily in Japan. The company offers fire hoses and fire-fighting systems; rescue and special purpose vehicles; rescue and search equipment; and anti-CBRNE terrorism and HazMat equipment consisting of detection, decontamination, protection, monitoring, and other equipment. It also provides firefighting and specialized protective clothing products; industrial rubber goods and tents; and linen yarns and fabrics. The company sells its products through sales agencies; and directly to government organizations. Teikoku Sen-i Co., Ltd. was founded in 1907 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.teisen.co.jp",
        "market_cap": "Large Cap"
    },
    "3402.T": {
        "short_name": "TORAY INDUSTRIES INC",
        "long_name": "Toray Industries, Inc.",
        "summary": "Toray Industries, Inc. manufactures, processes, and sells fibers and textiles, performance chemicals, carbon fiber composite materials, environment and engineering products, and life science products in Japan, China, North America, Europe, and internationally. The company offers filament yarns, staple fibers, and spun yarns, as well as woven and knitted fabrics of nylon, polyester, acrylics, and others; non-woven fabrics; ultra-microfiber non-woven fabric with suede-texture; and apparel products. It also provides nylon, ABS, PBT, PPS, and other resins and molded products; polyolefin foam products; polyester, polyethylene, polypropylene, and other films; processed film products; raw materials for synthetic fibers and plastics; fine chemicals; electronic and information materials; and graphic materials. In addition, the company offers carbon fibers, carbon fiber composite materials, and molded products; analysis, physical evaluation, research, and other services; and pharmaceuticals, medical devices, etc. Further, it provides engineering services; condominiums; industrial equipment and machinery; IT-related equipment; water treatment membranes and related equipment; and materials for housing, building, and civil engineering applications. The company was formerly known as Toyo Rayon Co., Ltd. and changed its name to Toray Industries, Inc. in 1970. Toray Industries, Inc. was founded in 1926 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8666",
        "website": "http://www.toray.co.jp",
        "market_cap": "Large Cap"
    },
    "3408.T": {
        "short_name": "SAKAI OVEX CO LTD",
        "long_name": "Sakai Ovex Co.,Ltd.",
        "summary": "Sakai Ovex Co.,Ltd. engages in the dyeing and processing of various textile products in Japan. The company is involved in the planning, manufacture, and sale of textile and apparel products; and production and sale of medical products, such as base fabrics for skin plaster. It also produces and sells carbon fiber products, including spread tow yarns and woven fabrics; and fishery material products comprising artificial fish-breeding grounds and plant cultivation beds. The company was formerly known as Sakai Textile Indus-tries, Co., Ltd. and changed its name to Sakai Ovex Co.,Ltd. in 1992. The company was founded in 1891 and is headquartered in Fukui, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukui",
        "zipcode": "918-8530",
        "website": "http://www.sakaiovex.co.jp",
        "market_cap": "Large Cap"
    },
    "3409.T": {
        "short_name": "KITANIHON SPINNING",
        "long_name": "Kitanihon Spinning Co., Ltd.",
        "summary": "Kitanihon Spinning Co., Ltd. engages in the production and sale of synthetic fiber spun yarns in Japan. It offers its products for clothing; and industrial materials, such as high-function health underwear, and car-related and safety-protected garments. The company was founded in 1948 and is headquartered in Hakusan, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Hakusan",
        "zipcode": "924-0051",
        "website": "http://www.ktbo.co.jp",
        "market_cap": "Mid Cap"
    },
    "3501.T": {
        "short_name": "SUMINOE TEXTILE CO",
        "long_name": "Suminoe Textile Co., Ltd.",
        "summary": "Suminoe Textile Co., Ltd. manufactures and sells interior fittings, automotive textile and traffic facilities, and functional materials in Japan, North and Central America, Asia, and internationally. The company offers curtains, carpet tiles, rugs and mats, and wall papers for use in various buildings; seat covering and ceiling materials, floor carpets, and car mats for automobile manufacturers; and cushion materials for use in public transportation vehicles comprising trains, buses, ships, and aircraft. It also provides fiber materials for interior products and automotive textiles, as well as dust control mats and brushes for house cleaning, etc.; electric carpets for home appliance manufacturers; air-filter products; stationary deodorizers for home use; and flooring material for public facilities, etc. In addition, the company offers art and craft textiles, including plush hand-woven curtains, hand-woven carpets, and hooked rugs, as well as brocades and flags; and processes silicon wafers for solar cells. Suminoe Textile Co., Ltd. was founded in 1883 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "542-8504",
        "website": "http://www.suminoe.jp",
        "market_cap": "Large Cap"
    },
    "3524.T": {
        "short_name": "NITTO SEIMO CO",
        "long_name": "Nitto Seimo Co., Ltd.",
        "summary": "Nitto Seimo Co., Ltd. manufactures and sells knotless nets for fishery and onshore uses primarily in Japan. The company provides trap nets, purse seine nets, fish farming nets, trawl nets, and laver cultivation nets; onshore-related products, including animal damage protection nets and ball protection nets; ropes; and Moji and knotted nets. It also offers hydraulic equipment; labor saving equipment for fishing operations and gear treatment; sherbet ice makers; and fishing equipment. In addition, the company imports and sells fishing materials, including floats and hardware for purse seine nets and nylon tire cords; onshore materials, such as stainless steel wires and polyethylene knotted nettings; and agricultural materials comprising binding. It also exports its fishing gears to various countries that include Asian countries, Chile, New Zealand, Norway, Spain, the United States, and Canada. The company was founded in 1910 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0004",
        "website": "http://www.nittoseimo.co.jp",
        "market_cap": "Mid Cap"
    },
    "3569.T": {
        "short_name": "SEIREN CO LTD",
        "long_name": "Seiren Co.,Ltd.",
        "summary": "Seiren Co.,Ltd. plans, manufactures, and markets textile and chemical products, industrial machines, and electronic parts in Japan and internationally. The company offers a digital production system that integrates planning, manufacturing, and sales in the fields of textiles and non-textiles; and automotive products, such as upholstery, airbag, and custom-ordered seat materials. It also provides sports and fashion products, including sportswear and innerwear, fashionable apparel, and SPA apparel; and electronics merchandise and materials comprising conductive fabrics, conductive pattern films, mesh materials, antistatic non-dusting fabrics, antistatic fibers, and wiping cloths for super clean rooms. In addition, the company offers medical products, such as Sericin, a natural protein; and deodorizing products for use in underwear, socks, and nursing garments under the DEOEST and Fast-Acting Deodorizer brand names. Further, it provides environment and life materials, including housing materials, such as moisture-permeable waterproof sheet materials for use as a substrate for exterior walls and as advertising sheets for construction scaffolding; interior items that comprise office chair covers and window shade substrate fabrics; nursing related goods, such as bedcovers and others; special apparel; fast-acting deodorizers; light shielding materials for photographic films; base materials for wigs; and uniforms for industrial use. The company was formerly known as Fukui Seiren Kako Co., Ltd. and changed its name to Seiren Co.,Ltd. in 1973. Seiren Co.,Ltd. was founded in 1889 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0062",
        "website": "http://www.seiren.com",
        "market_cap": "Large Cap"
    },
    "3571.T": {
        "short_name": "SOTOH CO LTD",
        "long_name": "Sotoh Co., Ltd.",
        "summary": "Sotoh Co., Ltd. engages in dyeing woolen, composite, and knitted fabrics in Japan. It offers chemical dyeing, hair knitting, and textile dyeing and processing services; and manufactures and sells textiles. The company was incorporated in 1923 and is headquartered in Ichinomiya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Ichinomiya",
        "zipcode": "494-8501",
        "website": "http://www.sotoh.co.jp",
        "market_cap": "Large Cap"
    },
    "3577.T": {
        "short_name": "TOKAI SENKO KK",
        "long_name": "Tokai Senko K.K.",
        "summary": "Tokai Senko K.K. engages in textile designing, printing, dyeing, and finishing activities. The company also develops and sells industrial machineries. Tokai Senko K.K. was founded in 1941 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "450-6432",
        "website": "http://www.tokai-senko.co.jp",
        "market_cap": "Mid Cap"
    },
    "3578.T": {
        "short_name": "SOKO SEIREN CO",
        "long_name": "Soko Seiren Co.,Ltd.",
        "summary": "Soko Seiren Co.,Ltd. manufactures and sells various synthetic and synthetic woven knitted fabrics. The company is also involved in scouring, dyeing, printing, and processing of various textile products; storage and packaging of woven and knitted fabrics; and transportation and collection of industrial waste. In addition, it manufactures and sells various dyeing and finishing machines; dyeing related equipment; and chemical products, as well as provides cellulosic fibers, knitted and brushed fabrics, and car seats. The company was incorporated in 1914 and is headquartered in Kanazawa, Japan. Soko Seiren Co.,Ltd. operates as a subsidiary of Marui Orimono Co., Ltd.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kanazawa",
        "zipcode": "920-0363",
        "website": "http://www.soko.co.jp",
        "market_cap": "Small Cap"
    },
    "3580.T": {
        "short_name": "KOMATSU MATERE CO LTD",
        "long_name": "KOMATSU MATERE Co.,Ltd.",
        "summary": "KOMATSU MATERE Co., Ltd. manufactures and sells various fabrics in Japan and internationally. The company offers fashion and functional fabrics, eco architecture products, as well as product dyeing services; and CABKOMA, a thermoplastic carbon fiber composite. It provides products for various applications, including coats, blousons, jackets, shirts, blouses, T-shirts, cut and sewn, tops, one-pieces, skirts, pants, and formal wear; outdoor wear and shoes, outdoor gloves, skiing and snowboarding clothing, warm-up wear, jackets, windbreakers, training wear, sauna suits, golf gloves and raincoats, climbing wear, swimwear, fishing and marine wear, and riders' wear; and gloves, bags, shoes, hats, headphone covers, nonflammable garments, barber cloth, pouches, and partitions. The company also offers its products for use in bed sheet covers for nursing care, adult diapers, baby sheets, corsets, and adhesive plasters; electromagnetic shields, wave absorbers, and organic EL sealants; car seats and car seat covers, car mats, and car ceiling materials; and bedding, curtains, sofas, chair upholstery, cushions, and wallpaper products, as well as ecological products, which comprise adjuvant for greening, ceramics for roof and wall greening, and water purification agents. In addition, it develops and manufactures resins, chemicals, etc.; designs, executes, and manages construction works; and develops and produces materials for automobile interiors and special industrial materials. Further, the company engages in dyeing of polyester and nylon fabric, production of compound membrane fabric, and fabric coating activities; storage of various woven and knitted fabrics, and gray fabrics, and manufactured goods; and provides distribution services. The company was formerly known as KOMATSU SEIREN Co.,Ltd. and changed its name to KOMATSU MATERE Co., Ltd. in October 2018. KOMATSU MATERE Co., Ltd. was founded in 1943 and is headquartered in Nomi, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nomi",
        "zipcode": null,
        "website": "http://www.komatsumatere.co.jp",
        "market_cap": "Large Cap"
    },
    "3600.T": {
        "short_name": "FUJIX LTD",
        "long_name": "FUJIX Ltd.",
        "summary": "FUJIX Ltd. manufactures, distributes, and trades in various sewing and embroidery thread in Japan and internationally. The company offers industrial sewing and embroidery threads comprising decorative, machine embroidery, special use, and other threads. It also provides home-use sewing threads, such as synthetic fiber sewing, cotton sewing, silk sewing, lock sewing, special use, decorative, temari, patchwork, and other threads. The company was founded in 1921 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "603-8322",
        "website": "http://www.fjx.co.jp",
        "market_cap": "Mid Cap"
    },
    "4235.T": {
        "short_name": "ULTRAFABRICS HOLDINGS CO LTD",
        "long_name": "Ultrafabrics Holdings Co.,Ltd.",
        "summary": "Ultrafabrics Holdings Co.,Ltd. engages in the manufacture and sale of synthetic leather in Japan. The company was formerly known as Daiichi Kasei Co.,Ltd. and changed its name to Ultrafabrics Holdings Co.,Ltd. in October 2017. Ultrafabrics Holdings Co.,Ltd. was founded in 1966 and is headquartered in Hachioji, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Hachioji",
        "zipcode": "192-0046",
        "website": "http://www.ultrafabricshd.co.jp",
        "market_cap": "Mid Cap"
    },
    "5AZ.SG": {
        "short_name": "AZEARTH Corp. Registered Shares",
        "long_name": "AZEARTH Corporation",
        "summary": "AZEARTH Corporation manufactures and sells chemical protective garments and environmental equipment in Japan and internationally. It provides polystyrene foam for tatami matting and flooring, insulation boards, threads, edges, and machines, as well as other types of tatami materials. The company also engages in the laying and construction work on the section that lies beneath tatami. In addition, it offers garment materials, such as inner linings, interlining clothes, pocket clothes, and quarter lining belts; and other textile materials, as well as provides contract cutting manufacturing services. AZEARTH Corporation was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "111-8623",
        "website": "http://www.azearth.co.jp",
        "market_cap": "Small Cap"
    },
    "6HK.F": {
        "short_name": "TORAY INDUSTRIES ADR/2",
        "long_name": "Toray Industries, Inc.",
        "summary": "Toray Industries, Inc. manufactures, processes, and sells fibers and textiles, performance chemicals, carbon fiber composite materials, environment and engineering products, and life science products in Japan, China, North America, Europe, and internationally. The company offers filament yarns, staple fibers, and spun yarns, as well as woven and knitted fabrics of nylon, polyester, acrylics, and others; non-woven fabrics; ultra-microfiber non-woven fabric with suede-texture; and apparel products. It also provides nylon, ABS, PBT, PPS, and other resins and molded products; polyolefin foam products; polyester, polyethylene, polypropylene, and other films; processed film products; raw materials for synthetic fibers and plastics; fine chemicals; electronic and information materials; and graphic materials. In addition, the company offers carbon fibers, carbon fiber composite materials, and molded products; analysis, physical evaluation, research, and other services; and pharmaceuticals, medical devices, etc. Further, it provides engineering services; condominiums; industrial equipment and machinery; IT-related equipment; water treatment membranes and related equipment; and materials for housing, building, and civil engineering applications. The company was formerly known as Toyo Rayon Co., Ltd. and changed its name to Toray Industries, Inc. in 1970. Toray Industries, Inc. was founded in 1926 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8666",
        "website": "http://www.toray.co.jp",
        "market_cap": "Mid Cap"
    },
    "7460.T": {
        "short_name": "YAGI & CO",
        "long_name": "Yagi & Co.,Ltd.",
        "summary": "Yagi & Co.,Ltd. operates as a fiber trading company in Japan. The company offers cotton/synthetic yarn and other fiber raw materials; sportswear; nighties/innerwear; and bedding, interior products, and industrial fiber materials. It also imports, exports, and sells fiber and related products, fiber product raw materials, fabrics, and secondary fiber products; and plans and sells apparel fabrics and products. In addition, the company manufactures and sells raschel knits, powder puffs and outerwear, twisted yarns and textiles, towels and bath towels, curtains, rugs, sheets, skincare products, menswear, ladieswear, fashion accessories, and clothing products. Further, it offers apparel mending, branding and sales promotion, real estate rental, healthcare, and digital marketing support services. The company was founded in 1893 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "540-8660",
        "website": "http://www.yaginet.co.jp",
        "market_cap": "Large Cap"
    },
    "7519.T": {
        "short_name": "GOYO INTEX CO LTD",
        "long_name": "Goyo Intex Co., Ltd.",
        "summary": "Goyo Intex Co., Ltd. engages in trading interior textiles in Japan. It primarily offers curtain accessories and accessories to produce fashionable window sides. The company was founded in 1979 and is headquartered in Komaki, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Komaki",
        "zipcode": "485-0058",
        "website": "http://www.goyointex.co.jp",
        "market_cap": "Small Cap"
    },
    "7856.T": {
        "short_name": "HAGIHARA INDUSTRIES",
        "long_name": "Hagihara Industries Inc.",
        "summary": "Hagihara Industries Inc. manufactures and sells flat yarns and relevant machinery in Japan. Its Plastics Business division offers PE tarpaulin, blue sheet, insulation fabrics, transparent fabrics, flame retardant fabrics, mesh products, soundproof clothing, water tank lining, heavy duty shelter fabric, radon and methane prevent fabric, ground barrier clothing, sandbags, adhesive tapes, meltac clothing, and monofilaments and yarns. The company's Engineering Products division offers duplex, sectional drive, narrow width, paper, and other slitter rewinders, as well as slitter rewinders with laminating units; inspection rewinders; yarn winders, such as automatic yarn changeover, take-up, traverse, and roving winders; and plastic recycling machines and water ring type hot cut pelletizers. Hagihara Industries Inc. was founded in 1962 and is headquartered in Kurashiki, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kurashiki",
        "zipcode": null,
        "website": "http://www.hagihara.co.jp",
        "market_cap": "Large Cap"
    },
    "8101.T": {
        "short_name": "GSI CREOS CORPORATION",
        "long_name": "GSI Creos Corporation",
        "summary": "GSI Creos Corporation provides textile, industrial, and nanotechnology products worldwide. It sells functional materials used in innerwear's, stockings, sweaters, etc.; deals in synthetic and natural fibers to manufacture printed and jacquard fabrics, as well as textiles used in ladies' and men's wear, outdoor sportswear, etc.; and designs, manufactures, and markets men's and ladies' wear, innerwear, legwear, outerwear, etc. under the Mashu Kashu brand. The company also imports and exports raw materials for specialty coatings, paint and coatings, and personal care products, as well as other products comprising packaging films, industrial films and functional films etc.; supplies cutting-edge semiconductor equipment and materials, and composite machinery and materials, etc.; designs, manufactures, and sells hobby materials under GSI Creos brand. In addition, it develops applications for nano carbons in a range of products in various fields, such as paints and coating materials, fuel cells, and composite materials. The company was formerly known as Gunze Sangyo, Inc. and changed its name to GSI Creos Corporation in 2001. GSI Creos Corporation was founded in 1927 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0074",
        "website": "http://www.gsi.co.jp",
        "market_cap": "Large Cap"
    },
    "8123.T": {
        "short_name": "T KAWABE & CO",
        "long_name": "T.Kawabe & Co., Ltd.",
        "summary": "T.Kawabe & Co., Ltd. manufactures, sells, imports, and exports handkerchiefs, scarves, mufflers, towels, and fabric products in Japan. The company also processes, imports, exports, and sells chemical textile and general textile products, textile fabric, clothing accessories, upholstery, furniture, and bedding products. In addition, it is involved in clothing design, and planning and consulting of interior decoration; sale, lease, and intermediation of the real estate properties; and manufacture and sale of cosmetics, perfumes, soaps, and pharmaceutical and non-pharmaceutical products. The company was founded in 1923 and is headquartered in Tokyo, Japan. As of January 25, 2021, T.Kawabe & Co., Ltd. is subsidiary of ICHIHIRO CO.,LTD.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-8403",
        "website": "http://www.kawabe.co.jp",
        "market_cap": "Small Cap"
    },
    "TOR1.F": {
        "short_name": "TORAY IND.",
        "long_name": "Toray Industries, Inc.",
        "summary": "Toray Industries, Inc. manufactures, processes, and sells fibers and textiles, performance chemicals, carbon fiber composite materials, environment and engineering products, and life science products in Japan, China, North America, Europe, and internationally. The company offers filament yarns, staple fibers, and spun yarns, as well as woven and knitted fabrics of nylon, polyester, acrylics, and others; non-woven fabrics; ultra-microfiber non-woven fabric with suede-texture; and apparel products. It also provides nylon, ABS, PBT, PPS, and other resins and molded products; polyolefin foam products; polyester, polyethylene, polypropylene, and other films; processed film products; raw materials for synthetic fibers and plastics; fine chemicals; electronic and information materials; and graphic materials. In addition, the company offers carbon fibers, carbon fiber composite materials, and molded products; analysis, physical evaluation, research, and other services; and pharmaceuticals, medical devices, etc. Further, it provides engineering services; condominiums; industrial equipment and machinery; IT-related equipment; water treatment membranes and related equipment; and materials for housing, building, and civil engineering applications. The company was formerly known as Toyo Rayon Co., Ltd. and changed its name to Toray Industries, Inc. in 1970. Toray Industries, Inc. was founded in 1926 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8666",
        "website": "http://www.toray.co.jp",
        "market_cap": "Mid Cap"
    },
    "TRYIF": {
        "short_name": "TORAY INDUSTRIES INC",
        "long_name": "Toray Industries, Inc.",
        "summary": "Toray Industries, Inc. manufactures, processes, and sells fibers and textiles, performance chemicals, carbon fiber composite materials, environment and engineering products, and life science products in Japan, China, North America, Europe, and internationally. The company offers filament yarns, staple fibers, and spun yarns, as well as woven and knitted fabrics of nylon, polyester, acrylics, and others; non-woven fabrics; ultra-microfiber non-woven fabric with suede-texture; and apparel products. It also provides nylon, ABS, PBT, PPS, and other resins and molded products; polyolefin foam products; polyester, polyethylene, polypropylene, and other films; processed film products; raw materials for synthetic fibers and plastics; fine chemicals; electronic and information materials; and graphic materials. In addition, the company offers carbon fibers, carbon fiber composite materials, and molded products; analysis, physical evaluation, research, and other services; and pharmaceuticals, medical devices, etc. Further, it provides engineering services; condominiums; industrial equipment and machinery; IT-related equipment; water treatment membranes and related equipment; and materials for housing, building, and civil engineering applications. The company was formerly known as Toyo Rayon Co., Ltd. and changed its name to Toray Industries, Inc. in 1970. Toray Industries, Inc. was founded in 1926 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8666",
        "website": "http://www.toray.co.jp",
        "market_cap": "Large Cap"
    },
    "TRYIY": {
        "short_name": "TORAY INDUSTRIES INC",
        "long_name": "Toray Industries, Inc.",
        "summary": "Toray Industries, Inc. manufactures, processes, and sells fibers and textiles, performance chemicals, carbon fiber composite materials, environment and engineering products, and life science products in Japan, China, North America, Europe, and internationally. The company offers filament yarns, staple fibers, and spun yarns, as well as woven and knitted fabrics of nylon, polyester, acrylics, and others; non-woven fabrics; ultra-microfiber non-woven fabric with suede-texture; and apparel products. It also provides nylon, ABS, PBT, PPS, and other resins and molded products; polyolefin foam products; polyester, polyethylene, polypropylene, and other films; processed film products; raw materials for synthetic fibers and plastics; fine chemicals; electronic and information materials; and graphic materials. In addition, the company offers carbon fibers, carbon fiber composite materials, and molded products; analysis, physical evaluation, research, and other services; and pharmaceuticals, medical devices, etc. Further, it provides engineering services; condominiums; industrial equipment and machinery; IT-related equipment; water treatment membranes and related equipment; and materials for housing, building, and civil engineering applications. The company was formerly known as Toyo Rayon Co., Ltd. and changed its name to Toray Industries, Inc. in 1970. Toray Industries, Inc. was founded in 1926 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8666",
        "website": "http://www.toray.co.jp",
        "market_cap": "Large Cap"
    }
}