{
  "2743.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Utilities - Renewable",
    "long_name": "Pixel Companyz Inc.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Utilities",
    "short_name": "PIXEL COMPANYZ INC",
    "state": null,
    "summary": "Pixel Companyz Inc. engages in the generation and sale of solar power in Japan. The company also develops, constructs, and sells solar power facilities, as well as owns, develops, and sells real estate properties. In addition, it develops, produces, and sells casino gaming machines; and develops and builds systems for the financial industry, as well as provides host, server, client system consultation, and system development services. The company was formerly known as Hybrid Service Co., Ltd. and changed its name to Pixel Companyz Inc. in October 2015. Pixel Companyz Inc. was founded in 1986 and is based in Tokyo, Japan.",
    "website": "http://www.pixel-cz.co.jp",
    "zipcode": "106-0032"
  },
  "59K.F": {
    "city": "Hiroshima",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Utilities - Renewable",
    "long_name": "The Chugoku Electric Power Co., Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "CHUGOKU EL. PWR",
    "state": null,
    "summary": "The Chugoku Electric Power Co., Inc. engages in generation, transmission, and distribution of electric power in Japan. The company operates through three segments: Electric Power, Comprehensive Energy Supply, and Information and Telecommunications. It generates power through hydroelectric, thermal, nuclear, renewable, biomass, coal, and other energy sources. The company also provides energy utilization services, such as the sale of liquefied natural gas and other fuels, and electricity and heat; electrical communications and data processing services; and environmental harmony creation, business/lifestyle support, electric power business support, and other services, as well as consulting services. As of March 31, 2020, it operated 92 hydroelectric power stations with generating capacity of 2,905 MW; 9 thermal power stations (steam) with generating capacity of 7,765 MW; 3 thermal power stations (internal combustion) with generating capacity of 36 MW; 1 nuclear power station with generating capacity of 820 MW; and 2 photovoltaic power stations with generating capacity of 6 MW. The company was incorporated in 1951 and is headquartered in Hiroshima, Japan.",
    "website": "http://www.energia.co.jp",
    "zipcode": "730-8701"
  },
  "5IE.F": {
    "city": "Sapporo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Utilities - Renewable",
    "long_name": "Hokkaido Electric Power Company, Incorporated",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "HOKKAIDO EL. PWR",
    "state": null,
    "summary": "Hokkaido Electric Power Company, Incorporated generates, transmits, and distributes electricity in Japan. The company undertakes electrical and telecommunication, civil engineering and construction, piping, air-conditioning and water supply/drainage facility, and disaster prevention equipment works; manufactures and sells electricity meters; and inspects and installs electric meters. It also engages in the management of buildings; environmental conservation business; sale of fuel, equipment, and materials; public bathhouse, cleaning/security service, and utility pole advertising businesses; provision of consulting services in the areas of construction, civil engineering, electricity, environment, energy, and repair of housing appliances; construction, maintenance, operation, and repair of power generation facilities and various plants; sale of electric power generated by thermal, hydroelectric, photovoltaic, and wind power; unloading, storage, and delivery of imported coal; and marine transport agency and customs clearance activities. In addition, the company provides Ethernet communications network and Internet connection services; installation, maintenance, supervision, and consulting of information communication networks; Internet data center and other information processing related services; and sells network-related machinery and equipment, information processing equipment, and software. Further, it is involved in the consultation, development, operation, and management of education-related information processing systems; leasing of LNG receiving facilities; and sale of corporate merchandise, gift products, sundries, food, etc. Additionally, the company engages in design, printing, and bookbinding operations; the production of closed captions; and the provision of document management, confidential-document destruction, and recycling services. The company was founded in 1951 and is headquartered in Sapporo, Japan.",
    "website": "http://www.hepco.co.jp",
    "zipcode": "060-8677"
  },
  "6HO.F": {
    "city": "Toyama",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Utilities - Renewable",
    "long_name": "Hokuriku Electric Power Company",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "HOKURIKU EL. PWR",
    "state": null,
    "summary": "Hokuriku Electric Power Company supplies electricity through integrated power generation, transmission, and distribution systems in Japan. The company generates electricity through hydroelectric, thermal, and nuclear sources. It is also involved in the sale of LNG; Maintenance of electric power facilities, operation of power-related facilities; maintenance of hydroelectric power plant and transformer equipment; construction of thermal and nuclear power plant equipment; research, design, and supervision of civil engineering and construction projects; electrical work; energy solution business; development and maintenance of software; wide-area Ethernet service and corporate Internet connectivity; data center business; leasing of communication line and data transmission line services; wired TV broadcasting; environmental survey; environmental research, design, and execution of environmental greening projects; and recycling and storage of confidential documents and archives; sale of paper products. In addition, the company engages in the real estate leasing and management, temporary staffing, and equipment leasing activities; provision of nursing care/social welfare services, and telephone pole advertising and travel services; manufacture and sale of concrete poles and piles; manufacture, repair, and testing of power meters and other instrumentation; manufacture and sale of distribution switches, transformers, distribution boards, and other equipment; and operation of the Hyakusen Yokocho online store. Hokuriku Electric Power Company was founded in 1951 and is headquartered in Toyama, Japan.",
    "website": "http://www.rikuden.co.jp",
    "zipcode": "930-8686"
  },
  "9501.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Utilities - Renewable",
    "long_name": "Tokyo Electric Power Company Holdings, Incorporated",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "TOKYO ELEC POWER CO HLDGS INC",
    "state": null,
    "summary": "Tokyo Electric Power Company Holdings, Incorporated generates, transmits, distributes, and retails electric power in Japan and internationally. The company operates a portfolio of thermal, nuclear, solar, wind, hydro, and geothermal power plants. It is also involved in the gas sales business; and provision of consulting services for electricity companies. The company was formerly known as Tokyo Electric Power Company, Incorporated and changed its name to Tokyo Electric Power Company Holdings, Incorporated in April 2016. The company was founded in 1951 and is headquartered in Tokyo, Japan. Tokyo Electric Power Company Holdings, Incorporated is a subsidiary of Nuclear Damage Compensation and Decommissioning Facilitation Corporation.",
    "website": "http://www.tepco.co.jp/index-j.html",
    "zipcode": "100-8560"
  },
  "9503.T": {
    "city": "Osaka",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Utilities - Renewable",
    "long_name": "The Kansai Electric Power Company, Incorporated",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "KANSAI ELECTRIC POWER CO INC",
    "state": null,
    "summary": "The Kansai Electric Power Company, Incorporated engages in electric power, gas supply, heat supply, and telecommunication businesses in Japan. The company operates through Electric Power, Gas/Other Energies, IT/Communications, and Real Estate segments. The company generates power from thermal, hydropower, wind, biomass, and nuclear power generation facilities. It also offers IT services for households and business firms, including optical fiber internet, optical fiber telephone, and optical fiber television; real estate services, such as leasing, condominium sales, property management, leisure, etc.; and specific services, such as home security, healthcare, etc. for individuals, and call center and staffing services, etc. for businesses. The company serves residential, commercial, and industrial customers. The Kansai Electric Power Company, Incorporated was founded in 1951 and is headquartered in Osaka, Japan.",
    "website": "http://www.kepco.co.jp",
    "zipcode": "530-8270"
  },
  "9504.T": {
    "city": "Hiroshima",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Utilities - Renewable",
    "long_name": "The Chugoku Electric Power Co., Inc.",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "CHUGOKU ELECTRIC POWER CO INC",
    "state": null,
    "summary": "The Chugoku Electric Power Co., Inc. engages in generation, transmission, and distribution of electric power in Japan. The company operates through three segments: Electric Power, Comprehensive Energy Supply, and Information and Telecommunications. It generates power through hydroelectric, thermal, nuclear, renewable, biomass, coal, and other energy sources. The company also provides energy utilization services, such as the sale of liquefied natural gas and other fuels, and electricity and heat; electrical communications and data processing services; and environmental harmony creation, business/lifestyle support, electric power business support, and other services, as well as consulting services. As of March 31, 2020, it operated 92 hydroelectric power stations with generating capacity of 2,905 MW; 9 thermal power stations (steam) with generating capacity of 7,765 MW; 3 thermal power stations (internal combustion) with generating capacity of 36 MW; 1 nuclear power station with generating capacity of 820 MW; and 2 photovoltaic power stations with generating capacity of 6 MW. The company was incorporated in 1951 and is headquartered in Hiroshima, Japan.",
    "website": "http://www.energia.co.jp",
    "zipcode": "730-8701"
  },
  "9505.T": {
    "city": "Toyama",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Utilities - Renewable",
    "long_name": "Hokuriku Electric Power Company",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "HOKURIKU ELECTRIC POWER CO",
    "state": null,
    "summary": "Hokuriku Electric Power Company supplies electricity through integrated power generation, transmission, and distribution systems in Japan. The company generates electricity through hydroelectric, thermal, and nuclear sources. It is also involved in the sale of LNG; Maintenance of electric power facilities, operation of power-related facilities; maintenance of hydroelectric power plant and transformer equipment; construction of thermal and nuclear power plant equipment; research, design, and supervision of civil engineering and construction projects; electrical work; energy solution business; development and maintenance of software; wide-area Ethernet service and corporate Internet connectivity; data center business; leasing of communication line and data transmission line services; wired TV broadcasting; environmental survey; environmental research, design, and execution of environmental greening projects; and recycling and storage of confidential documents and archives; sale of paper products. In addition, the company engages in the real estate leasing and management, temporary staffing, and equipment leasing activities; provision of nursing care/social welfare services, and telephone pole advertising and travel services; manufacture and sale of concrete poles and piles; manufacture, repair, and testing of power meters and other instrumentation; manufacture and sale of distribution switches, transformers, distribution boards, and other equipment; and operation of the Hyakusen Yokocho online store. Hokuriku Electric Power Company was founded in 1951 and is headquartered in Toyama, Japan.",
    "website": "http://www.rikuden.co.jp",
    "zipcode": "930-8686"
  },
  "9506.T": {
    "city": "Sendai",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Utilities - Renewable",
    "long_name": "Tohoku Electric Power Company, Incorporated",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "TOHOKU ELECTRIC POWER CO INC",
    "state": null,
    "summary": "Tohoku Electric Power Company, Incorporated, an energy service conglomerate, generates, transmits, and distributes electricity to residential customers in Japan and internationally. It operates in two segments, Electric Power Business and Construction Business. The company generates and supplies hydroelectric, thermal, geothermal, solar, and nuclear electricity. It is also involved in the construction of electrical, and telecommunication facilities and buildings; civil engineering operations; design and manufacture of electricity supply facilities; and business related to the research, survey, and analysis concerning environment preservation. Tohoku Electric Power Company, Incorporated was founded in 1951 and is headquartered in Sendai, Japan.",
    "website": "http://www.tohoku-epco.co.jp",
    "zipcode": "980-8550"
  },
  "9507.T": {
    "city": "Takamatsu",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Utilities - Renewable",
    "long_name": "Shikoku Electric Power Company, Incorporated",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "SHIKOKU ELECTRIC POWER CO INC",
    "state": null,
    "summary": "Shikoku Electric Power Company, Incorporated generates, transmits, distributes, and sells electricity in Japan and internationally. The company operates through Electric Power Business, Telecommunications Business, Construction and Engineering Business, Energy Business, and Other Business segments. It generates electricity through nuclear, thermal, hydro, solar, wind, and biomass sources. The company also provides fiber optic internet, cost mobile, and data center and cloud-related services; and supplies gas. In addition, it offers nursing care facilities and lifestyle support services. The company operates electric power generating facilities with a total capacity of 5,435 MW; 209 substations; transmission lines of 3,391 km; and distribution lines of 46,125 km. It serves 2.1 million industrial, commercial, and residential customers. Shikoku Electric Power Company, Incorporated was founded in 1951 and is headquartered in Takamatsu, Japan.",
    "website": "http://www.yonden.co.jp",
    "zipcode": "760-8573"
  },
  "9509.T": {
    "city": "Sapporo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Utilities - Renewable",
    "long_name": "Hokkaido Electric Power Company, Incorporated",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "HOKKAIDO ELECTRIC POWER CO INC",
    "state": null,
    "summary": "Hokkaido Electric Power Company, Incorporated generates, transmits, and distributes electricity in Japan. The company undertakes electrical and telecommunication, civil engineering and construction, piping, air-conditioning and water supply/drainage facility, and disaster prevention equipment works; manufactures and sells electricity meters; and inspects and installs electric meters. It also engages in the management of buildings; environmental conservation business; sale of fuel, equipment, and materials; public bathhouse, cleaning/security service, and utility pole advertising businesses; provision of consulting services in the areas of construction, civil engineering, electricity, environment, energy, and repair of housing appliances; construction, maintenance, operation, and repair of power generation facilities and various plants; sale of electric power generated by thermal, hydroelectric, photovoltaic, and wind power; unloading, storage, and delivery of imported coal; and marine transport agency and customs clearance activities. In addition, the company provides Ethernet communications network and Internet connection services; installation, maintenance, supervision, and consulting of information communication networks; Internet data center and other information processing related services; and sells network-related machinery and equipment, information processing equipment, and software. Further, it is involved in the consultation, development, operation, and management of education-related information processing systems; leasing of LNG receiving facilities; and sale of corporate merchandise, gift products, sundries, food, etc. Additionally, the company engages in design, printing, and bookbinding operations; the production of closed captions; and the provision of document management, confidential-document destruction, and recycling services. The company was founded in 1951 and is headquartered in Sapporo, Japan.",
    "website": "http://www.hepco.co.jp",
    "zipcode": "060-8677"
  },
  "9511.T": {
    "city": "Urasoe",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Utilities - Renewable",
    "long_name": "The Okinawa Electric Power Company, Incorporated",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "OKINAWA ELECTRIC POWER COMPANY ",
    "state": null,
    "summary": "The Okinawa Electric Power Company, Incorporated engages in the generation, transmission, and distribution of electricity in Okinawa Prefecture, Japan. The company generates electricity from thermal sources. It operates approximately 140 substations, as well as approximately 11,078 km distribution line networks. The company is also involved in the civil engineering, construction, electrical work, piping, electric telecommunication work, electric power system construction work, and inspection and maintenance activities; environmental survey, odor measurement, soil quality, examination, and land survey activities; supervision of construction; internet data center, call center, and aquaculture business; and landscaping projects. It studies and designs electric power facilities; installs air conditioning, sanitation, electric water-heating equipment, and EcoCute and induction heaters; sells and installs LED light fixtures; constructs internal combustion power generation equipment; sells and maintains electrical equipment; operates non-life insurance and advertising agencies; leases and maintains vehicles and properties; operates and installs electrical machinery and equipment, facilities, etc.; operations repair and consignment works; sells components for electrical facilities; offers computer system; and sells and leases computer and peripheral equipment. The company also buys, manages, sells, and leases real estate; plans, designs, and surveys renewable energy systems; constructs and maintains renewable energy and tiltable wind turbine facilities; sells natural gas and LNG; and installs, operates, and maintains power generation systems. It offers Internet solutions, energy, energy saving, management consultant, and ISO certification support training services; and sells, leases, installs, operates, and maintains equipment. The company was founded in 1972 and is based in Urasoe, Japan.",
    "website": "http://www.okiden.co.jp",
    "zipcode": "902-2602"
  },
  "9519.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Utilities - Renewable",
    "long_name": "RENOVA, Inc.",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "RENOVA INC",
    "state": null,
    "summary": "RENOVA, Inc. operates in the renewable energy industry in Japan. It operates through Renewable Energy Power Generation Business; and Renewable Energy Development and Operation Business segments. The Renewable Energy Power Generation Business segment generates and sells electricity from renewable energy power plants. The Renewable Energy Development and Operation Business segment develops and assists in the operation of renewable energy power plants. The company generates electricity through solar PV, biomass, wind, and geothermal power plants. RENOVA, Inc. was founded in 2000 and is based in Tokyo, Japan.",
    "website": "http://www.renovainc.jp",
    "zipcode": "104-0031"
  },
  "EDRWY": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Utilities - Renewable",
    "long_name": "Electric Power Development Co., Ltd.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "ELECTRIC POWER DEVELOPMENT",
    "state": null,
    "summary": "Electric Power Development Co., Ltd. engages in the wholesale supply of hydroelectric and thermal power in Japan. It also generates and transmits electricity. The company owns and operates thermal power generation facilities with a total capacity of 8,849 MW; 60 hydroelectric power plants with a total capacity of 8,571 MW; 21 wind power facilities with a total capacity of 429 MW; and approximately 2,400 kilometers of power transmission lines, and 9 substations and converter stations. It also owns and operates power generation facilities with a total capacity of 6,308 MW that are located in Thailand, the United States, and China. In addition, the company is involved in unloading and transporting coal to thermal power plants; sale of fly ash; shipping of coal for thermal power plants; research and planning of environmental conservation; surveying and compensation of construction sites; provision of civil engineering, construction management, construction, facility maintenance, and business process outsourcing services; operation of welfare facilities; development of computer software; and marine transportation of ash and fly ash. Further, it constructs and maintains electronic and communication facilities; imports, sells, and transports coal; invests in coal mines; operates wood pellet manufacturing facilities and nuclear power plants; manufactures, sells, and markets activated coke; produces fertilizers using ash; operates and maintains telecommunication facilities and waste-fueled power generation plants; constructs and operates sewage sludge-based fuel manufacturing facility; procures forest offcut; and provides engineering services for atmospheric and water pollutant removal equipment. Additionally, the company offers consulting services, including technical cooperation related to electric power development and environmental preservation. Electric Power Development Co., Ltd. was founded in 1952 and is headquartered in Tokyo, Japan.",
    "website": "http://www.jpower.co.jp",
    "zipcode": "104-8165"
  },
  "EPWDF": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Utilities - Renewable",
    "long_name": "Electric Power Development Co., Ltd.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "ELECTRIC POWER DEVELOPMENT",
    "state": null,
    "summary": "Electric Power Development Co., Ltd. engages in the wholesale supply of hydroelectric and thermal power in Japan. It also generates and transmits electricity. The company owns and operates thermal power generation facilities with a total capacity of 8,849 MW; 60 hydroelectric power plants with a total capacity of 8,571 MW; 21 wind power facilities with a total capacity of 429 MW; and approximately 2,400 kilometers of power transmission lines, and 9 substations and converter stations. It also owns and operates power generation facilities with a total capacity of 6,308 MW that are located in Thailand, the United States, and China. In addition, the company is involved in unloading and transporting coal to thermal power plants; sale of fly ash; shipping of coal for thermal power plants; research and planning of environmental conservation; surveying and compensation of construction sites; provision of civil engineering, construction management, construction, facility maintenance, and business process outsourcing services; operation of welfare facilities; development of computer software; and marine transportation of ash and fly ash. Further, it constructs and maintains electronic and communication facilities; imports, sells, and transports coal; invests in coal mines; operates wood pellet manufacturing facilities and nuclear power plants; manufactures, sells, and markets activated coke; produces fertilizers using ash; operates and maintains telecommunication facilities and waste-fueled power generation plants; constructs and operates sewage sludge-based fuel manufacturing facility; procures forest offcut; and provides engineering services for atmospheric and water pollutant removal equipment. Additionally, the company offers consulting services, including technical cooperation related to electric power development and environmental preservation. Electric Power Development Co., Ltd. was founded in 1952 and is headquartered in Tokyo, Japan.",
    "website": "http://www.jpower.co.jp",
    "zipcode": "104-8165"
  },
  "FJG.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Utilities - Renewable",
    "long_name": "Electric Power Development Co., Ltd.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "ELECTRIC POWER DEV.CO.LTD",
    "state": null,
    "summary": "Electric Power Development Co., Ltd. engages in the wholesale supply of hydroelectric and thermal power in Japan. It also generates and transmits electricity. The company owns and operates thermal power generation facilities with a total capacity of 8,849 MW; 60 hydroelectric power plants with a total capacity of 8,571 MW; 21 wind power facilities with a total capacity of 429 MW; and approximately 2,400 kilometers of power transmission lines, and 9 substations and converter stations. It also owns and operates power generation facilities with a total capacity of 6,308 MW that are located in Thailand, the United States, and China. In addition, the company is involved in unloading and transporting coal to thermal power plants; sale of fly ash; shipping of coal for thermal power plants; research and planning of environmental conservation; surveying and compensation of construction sites; provision of civil engineering, construction management, construction, facility maintenance, and business process outsourcing services; operation of welfare facilities; development of computer software; and marine transportation of ash and fly ash. Further, it constructs and maintains electronic and communication facilities; imports, sells, and transports coal; invests in coal mines; operates wood pellet manufacturing facilities and nuclear power plants; manufactures, sells, and markets activated coke; produces fertilizers using ash; operates and maintains telecommunication facilities and waste-fueled power generation plants; constructs and operates sewage sludge-based fuel manufacturing facility; procures forest offcut; and provides engineering services for atmospheric and water pollutant removal equipment. Additionally, the company offers consulting services, including technical cooperation related to electric power development and environmental preservation. Electric Power Development Co., Ltd. was founded in 1952 and is headquartered in Tokyo, Japan.",
    "website": "http://www.jpower.co.jp",
    "zipcode": "104-8165"
  },
  "KAEPF": {
    "city": "Osaka",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Utilities - Renewable",
    "long_name": "The Kansai Electric Power Company, Incorporated",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "KANSAI ELECTRIC POWER CO INC",
    "state": null,
    "summary": "The Kansai Electric Power Company, Incorporated engages in electric power, gas supply, heat supply, and telecommunication businesses in Japan. The company operates through Electric Power, Gas/Other Energies, IT/Communications, and Real Estate segments. The company generates power from thermal, hydropower, wind, biomass, and nuclear power generation facilities. It also offers IT services for households and business firms, including optical fiber internet, optical fiber telephone, and optical fiber television; real estate services, such as leasing, condominium sales, property management, leisure, etc.; and specific services, such as home security, healthcare, etc. for individuals, and call center and staffing services, etc. for businesses. The company serves residential, commercial, and industrial customers. The Kansai Electric Power Company, Incorporated was founded in 1951 and is headquartered in Osaka, Japan.",
    "website": "http://www.kepco.co.jp",
    "zipcode": "530-8270"
  },
  "KAEPY": {
    "city": "Osaka",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Utilities - Renewable",
    "long_name": "The Kansai Electric Power Company, Incorporated",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "KANSAI ELECTRIC POWER CO INC",
    "state": null,
    "summary": "The Kansai Electric Power Company, Incorporated engages in electric power, gas supply, heat supply, and telecommunication businesses in Japan. The company operates through Electric Power, Gas/Other Energies, IT/Communications, and Real Estate segments. The company generates power from thermal, hydropower, wind, biomass, and nuclear power generation facilities. It also offers IT services for households and business firms, including optical fiber internet, optical fiber telephone, and optical fiber television; real estate services, such as leasing, condominium sales, property management, leisure, etc.; and specific services, such as home security, healthcare, etc. for individuals, and call center and staffing services, etc. for businesses. The company serves residential, commercial, and industrial customers. The Kansai Electric Power Company, Incorporated was founded in 1951 and is headquartered in Osaka, Japan.",
    "website": "http://www.kepco.co.jp",
    "zipcode": "530-8270"
  },
  "KPO.F": {
    "city": "Osaka",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Utilities - Renewable",
    "long_name": "The Kansai Electric Power Company, Incorporated",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "KANSAI EL. PWR",
    "state": null,
    "summary": "The Kansai Electric Power Company, Incorporated engages in electric power, gas supply, heat supply, and telecommunication businesses in Japan. The company operates through Electric Power, Gas/Other Energies, IT/Communications, and Real Estate segments. The company generates power from thermal, hydropower, wind, biomass, and nuclear power generation facilities. It also offers IT services for households and business firms, including optical fiber internet, optical fiber telephone, and optical fiber television; real estate services, such as leasing, condominium sales, property management, leisure, etc.; and specific services, such as home security, healthcare, etc. for individuals, and call center and staffing services, etc. for businesses. The company serves residential, commercial, and industrial customers. The Kansai Electric Power Company, Incorporated was founded in 1951 and is headquartered in Osaka, Japan.",
    "website": "http://www.kepco.co.jp",
    "zipcode": "530-8270"
  },
  "TKECF": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Utilities - Renewable",
    "long_name": "Tokyo Electric Power Company Holdings, Incorporated",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "TOKYO ELEC POWER CO HLDGS INC",
    "state": null,
    "summary": "Tokyo Electric Power Company Holdings, Incorporated generates, transmits, distributes, and retails electric power in Japan and internationally. The company operates a portfolio of thermal, nuclear, solar, wind, hydro, and geothermal power plants. It is also involved in the gas sales business; and provision of consulting services for electricity companies. The company was formerly known as Tokyo Electric Power Company, Incorporated and changed its name to Tokyo Electric Power Company Holdings, Incorporated in April 2016. The company was founded in 1951 and is headquartered in Tokyo, Japan. Tokyo Electric Power Company Holdings, Incorporated is a subsidiary of Nuclear Damage Compensation and Decommissioning Facilitation Corporation.",
    "website": "http://www.tepco.co.jp/index-j.html",
    "zipcode": "100-8560"
  },
  "TKECY": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Utilities - Renewable",
    "long_name": "Tokyo Electric Power Company Holdings, Incorporated",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "TOKYO ELEC POWER CO HLDGS INC",
    "state": null,
    "summary": "Tokyo Electric Power Company Holdings, Incorporated generates, transmits, distributes, and retails electric power in Japan and internationally. The company operates a portfolio of thermal, nuclear, solar, wind, hydro, and geothermal power plants. It is also involved in the gas sales business; and provision of consulting services for electricity companies. The company was formerly known as Tokyo Electric Power Company, Incorporated and changed its name to Tokyo Electric Power Company Holdings, Incorporated in April 2016. The company was founded in 1951 and is headquartered in Tokyo, Japan. Tokyo Electric Power Company Holdings, Incorporated is a subsidiary of Nuclear Damage Compensation and Decommissioning Facilitation Corporation.",
    "website": "http://www.tepco.co.jp/index-j.html",
    "zipcode": "100-8560"
  },
  "TKT.F": {
    "city": "Sendai",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Utilities - Renewable",
    "long_name": "Tohoku Electric Power Company, Incorporated",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "TOHOKU EL. PWR CO.",
    "state": null,
    "summary": "Tohoku Electric Power Company, Incorporated, an energy service conglomerate, generates, transmits, and distributes electricity to residential customers in Japan and internationally. It operates in two segments, Electric Power Business and Construction Business. The company generates and supplies hydroelectric, thermal, geothermal, solar, and nuclear electricity. It is also involved in the construction of electrical, and telecommunication facilities and buildings; civil engineering operations; design and manufacture of electricity supply facilities; and business related to the research, survey, and analysis concerning environment preservation. Tohoku Electric Power Company, Incorporated was founded in 1951 and is headquartered in Sendai, Japan.",
    "website": "http://www.tohoku-epco.co.jp",
    "zipcode": "980-8550"
  },
  "TPO.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Utilities - Renewable",
    "long_name": "Tokyo Electric Power Company Holdings, Incorporated",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "TOKYO ELECTR.POW.CO.HLDGS",
    "state": null,
    "summary": "Tokyo Electric Power Company Holdings, Incorporated generates, transmits, distributes, and retails electric power in Japan and internationally. The company operates a portfolio of thermal, nuclear, solar, wind, hydro, and geothermal power plants. It is also involved in the gas sales business; and provision of consulting services for electricity companies. The company was formerly known as Tokyo Electric Power Company, Incorporated and changed its name to Tokyo Electric Power Company Holdings, Incorporated in April 2016. The company was founded in 1951 and is headquartered in Tokyo, Japan. Tokyo Electric Power Company Holdings, Incorporated is a subsidiary of Nuclear Damage Compensation and Decommissioning Facilitation Corporation.",
    "website": "http://www.tepco.co.jp/index-j.html",
    "zipcode": "100-8560"
  }
}
