{
  "1712.T": {
    "city": "Nagoya",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Waste Management",
    "long_name": "Daiseki Eco. Solution Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "DAISEKI ECO. SOLUTION CO LTD",
    "state": null,
    "summary": "Daiseki Eco. Solution Co., Ltd. provides soil contamination solutions in Japan. The company offers consulting, testing, analysis, remediation, and various other solutions to customers facing soil contamination problems. Its services include soil contamination surveys, contaminated soil remediation, industrial waste collection and processing, and environmental analysis and consulting, as well as plasterboard recycling services. The company was incorporated in 1996 and is headquartered in Nagoya, Japan. Daiseki Eco. Solution Co., Ltd. is a subsidiary of Daiseki Co.,Ltd.",
    "website": "http://www.daiseki-eco.co.jp",
    "zipcode": "467-0852"
  },
  "2151.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Waste Management",
    "long_name": "Takeei Corporation",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "TAKEEI CORPORATION",
    "state": null,
    "summary": "Takeei Corporation engages in the environment management activities in Japan. The company provides environmental consulting services; issues measurement certificates; and analyzes water and drinking water, atmosphere, and asbestos, as well as measures noise and vibration, working environment, and inspect radioactive substances. It is also involved in the collection and transportation of waste; intermediary processing and recycling; and final disposal and reuse of landfill site. In addition, the company offers environmental engineering services; and engages in generating and selling biomass power. Takeei Corporation was founded in 1977 and is headquartered in Tokyo, Japan.",
    "website": "http://www.takeei.co.jp",
    "zipcode": "105-0011"
  },
  "2195.T": {
    "city": "Kyoto",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Waste Management",
    "long_name": "Amita Holdings Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "AMITA HOLDINGS CO LTD",
    "state": null,
    "summary": "Amita Holdings Co.,Ltd., together with its subsidiaries, provides recycling solutions in Japan and internationally. It offers recycled silicon carbide and powder; glycol recovered from industrial waste; molasses; alumina ball; zinc oxide; spent catalyst; and ferrous sulfate products. The company also produces and supplies alternative fuels and materials to material industries; and consulting services to enforce segregation of industrial waste, waste management, and compliance with environmental laws, as well as conservation of marine resources. Amita Holdings Co.,Ltd. was founded in 2010 and is headquartered in Kyoto, Japan.",
    "website": "http://www.amita-net.co.jp",
    "zipcode": "604-0847"
  },
  "2325.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Waste Management",
    "long_name": "NJS Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "NJS CO. LTD",
    "state": null,
    "summary": "NJS Co., Ltd. engages in the water supply and sewerage systems, storm water drainage system and river environmental conservation, solid waste management and environment systems development, and asset and risk management activities. The company is involved in the water and industrial water supply, sewerage, river, and agricultural drainage and waste water treatment; financial management consultancy of water supply and sewerage; the survey, planning, design, and supervision of sewage and waste treatment facilities; and seismic diagnosis businesses. It also provides consulting services for water quality management and maintenance of water and sewage treatment plants, pumping stations, etc.; asset management services for social infrastructure; and disaster prevention investigation, countermeasures, and planning for inundation, earthquakes, etc. In addition, the company develops systems, including GIS information systems for pipelines, rivers, purified water tanks, etc.; facility information systems for water and sewage treatment plants, pumping stations, and tunnels; ASPs; and account processing systems, bill and collection systems, and others. Further, it is involved in the planning, design, and supervision of buildings and seismic diagnostic activities; administration of water supply and sewerage projects; and consulting activities. Additionally, the company undertakes environmental basic planning and impact assessment works; investigation, analysis, and contamination analysis services of rivers, wetlands, lakes, and sea areas; and surveying and geological survey works. The company was formerly known as Nippon Jogesuido Sekkei Co., Ltd. and changed its name to NJS Co., Ltd. in April 2015. NJS Co., Ltd. was founded in 1951 and is headquartered in Tokyo, Japan.",
    "website": "http://www.njs.co.jp",
    "zipcode": "105-0023"
  },
  "4245.T": {
    "city": "Matsuyama",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Waste Management",
    "long_name": "Daiki Axis Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "DAIKI AXIS CO LTD",
    "state": null,
    "summary": "Daiki Axis Co., Ltd. designs, constructs, and maintains various wastewater treatment equipment in Japan and internationally. It offers industrial wastewater treatment, wastewater recycling and rainwater treatment, and water purification systems, as well as compact grease traps. The company is also involved in the design, manufacture, construction, and distribution of products using synthetic resins and other materials; distribution and installation of various construction materials and household equipment; refining and distribution of biodiesel fuel, as well as sale of purification plants; production and distribution of drinking water; and generation and sale of solar power. Daiki Axis Co., Ltd. was founded in 1958 and is headquartered in Matsuyama, Japan.",
    "website": "http://www.daiki-axis.com",
    "zipcode": "791-8022"
  },
  "4651.T": {
    "city": "Fukuoka City",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Waste Management",
    "long_name": "Sanix Incorporated",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "SANIX INC",
    "state": null,
    "summary": "Sanix Incorporated engages in the sanitation business primarily in Japan. It operates through Solar Engineering, Home Sanitation, Establishment Sanitation, Environmental Resources Development, and Energy Business divisions. The company manufactures, sells, constructs, and maintains photovoltaic solar systems and components for commercial and residential use. It also provides home sanitation solutions comprising termite eradication, underfloor/loft ventilation system, underfloor base reinforcement, house reinforcement system, and residential homes renovation. In addition, the company offers establishment sanitation solutions, such as water supply and drainage facility conservation and management; building and condominium maintenance; and pest control services. Further, it engages in the industrial waste disposal and recycling business; converts waste plastics into fuel for generation of electricity; and purifies commercial and industrial organic waste liquid; and electricity retailing business. Sanix Incorporated was founded in 1975 and is headquartered in Fukuoka City, Japan.",
    "website": "http://sanix.jp/lang_en/",
    "zipcode": "812-0013"
  },
  "5690.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Waste Management",
    "long_name": "Rever Holdings Corporation",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "REVER HOLDINGS CORPORATION",
    "state": null,
    "summary": "Rever Holdings Corporation, through its subsidiaries, offers metal recycling services in Japan. It engages in the processing of ferrous and non-ferrous scrap metal and the recycling of industrial waste, end of life vehicles, scrapped vending machines, home appliances, etc. The company also provides industrial waste treatment services; and sells used parts collected from end of life vehicles for commercial and private use. In addition, it transports waste through a fleet of approximately 100 vehicles; offers general cargo transportation and first-class forwarding services; and provides substrate treatment and paper recycling services, including confidential documents, etc. The company was founded in 2007 and is based in Tokyo, Japan.",
    "website": "http://www.re-ver.co.jp",
    "zipcode": null
  },
  "5698.T": {
    "city": "Fujinomiya",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Waste Management",
    "long_name": "Envipro Holdings Inc.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "ENVIPRO HOLDINGS INC",
    "state": null,
    "summary": "Envipro Holdings Inc., through its subsidiaries, engages in the recycling of scrap metals and industrial waste discharged from factories and demolition properties in Japan and internationally. The company recycles and sells iron scrap, nonferrous metals, plastics, rubber, and other recycling resources; lithium-ion rechargeable batteries; and used automobiles, heavy machinery, engines, and other automobile parts. The company also offers logistics services; woody biomass fuels; and environmental management consulting services. The company was founded in 1950 and is headquartered in Fujinomiya, Japan.",
    "website": "http://www.envipro.jp",
    "zipcode": "418-0075"
  },
  "5699.T": {
    "city": "Tatsuno",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Waste Management",
    "long_name": "IBOKIN Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "IBOKIN CO LTD",
    "state": null,
    "summary": "IBOKIN Co.,Ltd., a recycling company, provides demolition, environment, metal, and automobile recycling services in Japan. The company also engages in ferrous and non-ferrous materials recycling; industrial waste disposal business; and generation and separation of waste. In addition, it offers dismantling, removal, collection, transportation, intermediate treatment, and final disposal services. Further, the company is also engaged in plastic pellets manufacturing; and buying, selling, and lending of highly managed medical equipment. The company was founded in 1984 and is headquartered in Tatsuno, Japan.",
    "website": "http://www.ibokin.co.jp",
    "zipcode": null
  },
  "6299.T": {
    "city": "Kobe",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Waste Management",
    "long_name": "Kobelco Eco-Solutions Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "KOBELCO ECO-SOLUTIONS CO LTD",
    "state": null,
    "summary": "Kobelco Eco-Solutions Co., Ltd. provides general environmental solutions in Japan. The company is involved in the designing, manufacturing, and selling of water treatment equipment and facilities for industrial water, city water, and sewage; treatment facilities for ultrapure water, pure water, industrial water, and wastewater; biomass recycling systems for organic waste, such as sewage sludge and food; and cooling towers, including industrial/air conditioning cooling towers. It also designs, manufactures, sells, and repairs equipment and facilities, such as municipal waste incineration/melting facilities; PCB waste treatment facilities; and wood biomass-fired power plants. In addition, the company designs, manufactures, sells, and repairs process equipment, including glasslined reactors, polymerizers, reactors, evaporators, and mixers/dryers; and high-purity hydrogen/oxygen generators. Further, it is involved in the technological development and environmental analysis service activities. The company was founded in 1954 and is headquartered in Kobe, Japan. Kobelco Eco-Solutions Co., Ltd. is a subsidiary of Kobe Steel, Ltd.",
    "website": "http://www.kobelco-eco.co.jp",
    "zipcode": "651-0072"
  },
  "6331.T": {
    "city": "Kawasaki",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Waste Management",
    "long_name": "Mitsubishi Kakoki Kaisha, Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "MITSUBISHI KAKOKI KAISHA",
    "state": null,
    "summary": "Mitsubishi Kakoki Kaisha, Ltd. engages in the engineering and construction of various industrial and chemical plants and environmental control facilities in Japan, Asia, and internationally. The company operates through Engineering and Machinery segments. The Engineering segment constructs city gas and petroleum plants, hydrogen generation plants, sewage treatment equipment, industrial effluent treatment equipment, water treatment and related products, as well as various chemical engineering plants. The Machinery segment offers oil purifiers, separator and filtration machinery, sea water screening facilities, and mixers and related products. It also manufactures and sells of industrial machineries and equipment, including centrifugal separators, filtration systems, screens, mixers and cleaners. The company was formerly known as Kakoki Seisaku, Ltd. and changed its name to Mitsubishi Kakoki Kaisha, Ltd. in 1938. Mitsubishi Kakoki Kaisha, Ltd. was founded in 1935 and is headquartered in Kawasaki, Japan.",
    "website": "http://www.kakoki.co.jp",
    "zipcode": "210-8560"
  },
  "6403.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Waste Management",
    "long_name": "Suido Kiko Kaisha, Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "SUIDO KIKO KAISHA",
    "state": null,
    "summary": "Suido Kiko Kaisha, Ltd. operates as a water treatment engineering company in the fields of sewage and industrial wastewater treatment in Japan and internationally. It offers various water treatment devices, such as water generators and purifiers, indicator controllers, automatic valves, and digital residual chlorine measurement devices. The company engages in the design and construction of water treatment, industrial water supply, sewerage and small scale sewage treatment, industrial water and wastewater treatment, rural community water and sewerage, sludge reclamation, and sanitary landfill leachate treatment plants; design, manufacture, and sale of water treatment facility equipment and devices; operation, maintenance, and management of water treatment plants and facilities; and production and sale of industrial and chemical agents. It also provides water quality inspection analysis, as well as worker dispatching services. The company was founded in 1936 and is headquartered in Tokyo, Japan. Suido Kiko Kaisha, Ltd. is a subsidiary of Toray Industries, Inc.",
    "website": "http://www.suiki.co.jp",
    "zipcode": "156-0054"
  },
  "6531.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Waste Management",
    "long_name": "Refinverse,Inc.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "REFINVERSE INC",
    "state": null,
    "summary": "Refinverse,Inc. engages in recycling business in Japan. It extracts synthetic resin material from used tile carpets. The company also focuses on refining and recycling chemical materials from various wastes. Refinverse,Inc. was founded in 2003 and is headquartered in Tokyo, Japan.",
    "website": "http://www.r-inverse.com",
    "zipcode": "103-0013"
  },
  "6564.T": {
    "city": "Hamamatsu",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Waste Management",
    "long_name": "Midac Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "MIDAC CO LTD",
    "state": null,
    "summary": "Midac Co.,Ltd. engages in the collection, transportation, and disposal of industrial waste and specially controlled industrial waste in Japan. It also collects and transports general business waste, and general household waste and consignment from local governments; and sells industrial, special managed industrial, and general wastes, as well as offers recycling services. The company was founded in 1945 and is headquartered in Hamamatsu, Japan.",
    "website": "http://www.midac.jp",
    "zipcode": "431-3122"
  },
  "6566.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Waste Management",
    "long_name": "Kaname Kogyo Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "KANAME KOGYO CO LTD",
    "state": null,
    "summary": "Kaname Kogyo Co.,Ltd. provides waste management services. It engages in the collection, transportation, and disposal of general and industrial waste; and collection and transportation of used papers, bottles, cans, confidential documents, medical wastes, Styrofoams, etc. In addition, it is involved in the recycling activities; sale of recycled resources; administrative contract activities; and processing of administrative consigned resources. As of March 31, 2020, the company had 315 units of collection and transportation vehicles. Kaname Kogyo Co.,Ltd. was founded in 1973 and is headquartered in Tokyo, Japan.",
    "website": "http://www.kaname-k.co.jp",
    "zipcode": "171-0014"
  },
  "893.F": {
    "city": "Kawasaki",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Waste Management",
    "long_name": "Mitsubishi Kakoki Kaisha, Ltd.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "MITSUBISHI KAKOKI",
    "state": null,
    "summary": "Mitsubishi Kakoki Kaisha, Ltd. engages in the engineering and construction of various industrial and chemical plants and environmental control facilities in Japan, Asia, and internationally. The company operates through Engineering and Machinery segments. The Engineering segment constructs city gas and petroleum plants, hydrogen generation plants, sewage treatment equipment, industrial effluent treatment equipment, water treatment and related products, as well as various chemical engineering plants. The Machinery segment offers oil purifiers, separator and filtration machinery, sea water screening facilities, and mixers and related products. It also manufactures and sells of industrial machineries and equipment, including centrifugal separators, filtration systems, screens, mixers and cleaners. The company was formerly known as Kakoki Seisaku, Ltd. and changed its name to Mitsubishi Kakoki Kaisha, Ltd. in 1938. Mitsubishi Kakoki Kaisha, Ltd. was founded in 1935 and is headquartered in Kawasaki, Japan.",
    "website": "http://www.kakoki.co.jp",
    "zipcode": "210-8560"
  },
  "9793.T": {
    "city": "Nagoya",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Waste Management",
    "long_name": "Daiseki Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "DAISEKI CO LTD",
    "state": null,
    "summary": "Daiseki Co.,Ltd. engages industrial waste treatment and resource recycling activities in Japan. The company is involved in the treatment and recycling of waste oil and sludge, as well as collection, transportation, treatment, and recycling of industrial waste. It also develops, produces, and sells Pane-roll and Daiseki Coat concrete release agents; Daiseki Pla-coat plastic release agents; and Daiseki Proof rustpoofing agents. In addition, the company offers industrial lubricating oil for press machines and sharpeners, as well as fuel oils, and industrial and automotive lubricants; and environmental research and analysis services for industrial waste, such as waste oil, waste acid, waste alkali, sludge, and other waste. Further, it engages in the research and restoration of polluted soil, etc.; refining of lubricating oil; sale of petrol products; refinement of lead; recycling used automotive and industrial batteries; washing and treatment of tanks; and recycling of waste plasterboard. The company was founded in 1945 and is headquartered in Nagoya, Japan.",
    "website": "http://www.daiseki.co.jp",
    "zipcode": "455-8505"
  },
  "A19.F": {
    "city": "Kobe",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Waste Management",
    "long_name": "Asahi Holdings, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "ASAHI HOLDINGS INC.",
    "state": null,
    "summary": "Asahi Holdings, Inc. engages in the recycling and sale of precious and rare metals in Japan, rest of Asia, and North America. The company operates through three segments: Precious Metals, Environmental Preservation, and Life and Health. It collects and recycles various metals, including gold, silver, palladium, and platinum used in a range of industry fields, such as E-scrap, dentistry, jewelry, plating treatment, precision cleaning, photography, catalysts, and liquid crystal display. The company also refines and processes precious metals, such as gold and silver; and recycles waste oil and sludge, wood waste, fire-proof bricks, glass products, waste acids and reagents, alkalis, and sludge. In addition, it manufactures and sells massage chairs, small massagers, alkaline water ionizers, hearing aids, home-use treatment equipment, and fitness equipment, as well as designs and installs air-conditioning systems, as well as constructs facilities for fire-prevention and sanitation. The company was founded in 1952 and is headquartered in Kobe, Japan.",
    "website": "http://www.asahiholdings.com",
    "zipcode": "650-0001"
  },
  "DSKIF": {
    "city": "Nagoya",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Waste Management",
    "long_name": "Daiseki Co.,Ltd.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "DAISEKI CO LTD",
    "state": null,
    "summary": "Daiseki Co.,Ltd. engages industrial waste treatment and resource recycling activities in Japan. The company is involved in the treatment and recycling of waste oil and sludge, as well as collection, transportation, treatment, and recycling of industrial waste. It also develops, produces, and sells Pane-roll and Daiseki Coat concrete release agents; Daiseki Pla-coat plastic release agents; and Daiseki Proof rustpoofing agents. In addition, the company offers industrial lubricating oil for press machines and sharpeners, as well as fuel oils, and industrial and automotive lubricants; and environmental research and analysis services for industrial waste, such as waste oil, waste acid, waste alkali, sludge, and other waste. Further, it engages in the research and restoration of polluted soil, etc.; refining of lubricating oil; sale of petrol products; refinement of lead; recycling used automotive and industrial batteries; washing and treatment of tanks; and recycling of waste plasterboard. The company was founded in 1945 and is headquartered in Nagoya, Japan.",
    "website": "http://www.daiseki.co.jp",
    "zipcode": "455-8505"
  },
  "E8V.F": {
    "city": "Fujinomiya",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Waste Management",
    "long_name": "Envipro Holdings Inc.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "ENVIPRO HOLDINGS INC.",
    "state": null,
    "summary": "Envipro Holdings Inc., through its subsidiaries, engages in the recycling of scrap metals and industrial waste discharged from factories and demolition properties in Japan and internationally. The company recycles and sells iron scrap, nonferrous metals, plastics, rubber, and other recycling resources; lithium-ion rechargeable batteries; and used automobiles, heavy machinery, engines, and other automobile parts. The company also offers logistics services; woody biomass fuels; and environmental management consulting services. The company was founded in 1950 and is headquartered in Fujinomiya, Japan.",
    "website": "http://www.envipro.jp",
    "zipcode": "418-0075"
  },
  "NX8.MU": {
    "city": "Fukuoka City",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "MUN",
    "industry": "Waste Management",
    "long_name": "Sanix Incorporated",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "SANIX INC.",
    "state": null,
    "summary": "Sanix Incorporated engages in the sanitation business primarily in Japan. It operates through Solar Engineering, Home Sanitation, Establishment Sanitation, Environmental Resources Development, and Energy Business divisions. The company manufactures, sells, constructs, and maintains photovoltaic solar systems and components for commercial and residential use. It also provides home sanitation solutions comprising termite eradication, underfloor/loft ventilation system, underfloor base reinforcement, house reinforcement system, and residential homes renovation. In addition, the company offers establishment sanitation solutions, such as water supply and drainage facility conservation and management; building and condominium maintenance; and pest control services. Further, it engages in the industrial waste disposal and recycling business; converts waste plastics into fuel for generation of electricity; and purifies commercial and industrial organic waste liquid; and electricity retailing business. Sanix Incorporated was founded in 1975 and is headquartered in Fukuoka City, Japan.",
    "website": "http://sanix.jp/lang_en/",
    "zipcode": "812-0013"
  },
  "TC6.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Waste Management",
    "long_name": "Takeei Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "TAKEEI CORP.",
    "state": null,
    "summary": "Takeei Corporation engages in the environment management activities in Japan. The company provides environmental consulting services; issues measurement certificates; and analyzes water and drinking water, atmosphere, and asbestos, as well as measures noise and vibration, working environment, and inspect radioactive substances. It is also involved in the collection and transportation of waste; intermediary processing and recycling; and final disposal and reuse of landfill site. In addition, the company offers environmental engineering services; and engages in generating and selling biomass power. Takeei Corporation was founded in 1977 and is headquartered in Tokyo, Japan.",
    "website": "http://www.takeei.co.jp",
    "zipcode": "105-0011"
  }
}
