{
    "AMG1L.VS": {
        "short_name": "Amber Grid",
        "long_name": "AB Amber Grid",
        "summary": "AB Amber Grid operates as a natural gas transmission system company in the Republic of Lithuania. The company is involved in the transmission of natural gas through high pressure pipelines to system users. It also operates, maintains, and develops natural gas transmission system that includes gas transmission pipelines, gas compressor stations, gas metering and distribution stations, and cathodic protection installations, as well as data transmission and telecommunications systems. The company's natural gas transmission system consists of 2,115 km of gas transmission pipelines, 65 gas distribution stations, 3 gas metering stations, and 2 gas compressor stations. It serves companies operating in the sectors of electricity, district heating, and industry; and medium-sized local businesses, as well as natural gas suppliers receiving natural gas transmission services. The company was founded in 2013 and is based in Vilnius, the Republic of Lithuania. AB Amber Grid is a subsidiary of UAB EPSO-G.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "03116",
        "website": "http://www.ambergrid.lt",
        "full_time_employees": 328
    },
    "APG1L.VS": {
        "short_name": "Apranga",
        "long_name": "APB Apranga",
        "summary": "APB Apranga, together with its subsidiaries, engages in the retail trade of apparel in the Baltic States. It operates a chain of 186 stores in Lithuania, Latvia, and Estonia. The company was founded in 1945 and is based in Vilnius, Lithuania. APB Apranga is a subsidiary of UAB MG Baltic investment.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "14311",
        "website": "http://aprangagroup.lt",
        "full_time_employees": 1807
    },
    "AUG1L.VS": {
        "short_name": "AUGA group",
        "long_name": "Auga Group AB",
        "summary": "Auga Group AB, together with its subsidiaries, operates an organic food production company in Lithuania. It operates through Crop-Growing, Mushroom Growing, Dairy, and End-Consumer Packaged Goods segments. The company is involved in the mushroom growing; organic milk production, and cattle raising and sale activities; and growing of various crops such as organic wheat, legumes, rapeseed, sugar beets, oat, and barley as well as other crops, including grasses and corn for feed. It also offers ready-to-eat soups, preserved mushrooms, packaged vegetables, bottled milk, milk-shakes, eggs, poultry, flour, and other products. The company provides human resource management, trade and logistics, IT system development, machinery leasing, land rental, and agricultural services. The company manages approximately 39,000 hectares of organically certified arable land, as well as uses proprietary and contracted manufacturing to produce a range of organic food products for the end consumer, as well as organic commodities purchasers. It also exports its products to Scandinavian and Baltic countries, Poland, Germany, and France, as well as in the United States, the United Arab Emirates, and Japan. The company was founded in 2003 and is headquartered in Vilnius, Lithuania. Auga Group AB is a subsidiary of Baltic Champs Group, UAB.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "08130",
        "website": "http://www.auga.lt",
        "full_time_employees": 1250
    },
    "GRG1L.VS": {
        "short_name": "Grigeo",
        "long_name": "Grigeo AB",
        "summary": "Grigeo AB produces and sells toilet papers, paper towels, paper napkins, corrugated cardboards, hardboards, and products from corrugated cardboards in Lithuania. The company operates through three segments: Paper and Paper Products; Wood Fibre Boards and Wood Processing; and Raw Material for Corrugated Cardboard and Related Production. It is also involved in the manufacture of raw materials for the production of corrugated cardboards; honeycomb cardboard paper and filler for use in the furniture, automotive, and construction industries, as well as for the manufacture of doors, wall panels, exhibition stands, and trays; and second-hand paper collection and preparation for recycling. In addition, the company engages in the building construction and real estate development activities. It also exports its products to Poland, Sweden, the United Kingdom, Finland, and internationally. The company was formerly known as Grigeo GrigiÂ\u009akes AB and changed its name to Grigeo AB in April 2017. Grigeo AB was founded in 1823 and is based in Vilnius, Lithuania.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "27101",
        "website": "http://www.grigeo.lt",
        "full_time_employees": 859
    },
    "IGN1L.VS": {
        "short_name": "Ignitis Grupe",
        "long_name": "AB Ignitis grupe",
        "summary": "AB Ignitis grupe generates, distributes, trades, and supplies electricity and heat. It also produces renewable electricity; supplies liquefied natural gas via terminal; trades and distributes natural gas; and constructs, repairs, maintains electricity networks and related equipment, as well as connects customers to electricity networks. In addition, the company provides information technology, telecommunications, and other services; public procurement, accounting, and legal personnel administration services; and payment collection services. Further, it operates wind power plants; and produces metal structures, as well as involved in the rental, leasing, repairing, and maintenance services for vehicles. AB Ignitis grupe was incorporated in 2008 and is headquartered in Vilnius, Lithuania.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "09310",
        "website": "http://ignitisgrupe.lt",
        "full_time_employees": 3802
    },
    "IGV.F": {
        "short_name": "IGNITIS GRUPE  SP.GDR/1",
        "long_name": "AB Ignitis grupe",
        "summary": "AB Ignitis grupe generates, distributes, trades, and supplies electricity and heat. It also produces renewable electricity; supplies liquefied natural gas via terminal; trades and distributes natural gas; and constructs, repairs, maintains electricity networks and related equipment, as well as connects customers to electricity networks. In addition, the company provides information technology, telecommunications, and other services; public procurement, accounting, and legal personnel administration services; and payment collection services. Further, it operates wind power plants; and produces metal structures, as well as involved in the rental, leasing, repairing, and maintenance services for vehicles. AB Ignitis grupe was incorporated in 2008 and is headquartered in Vilnius, Lithuania.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "09310",
        "website": "http://ignitisgrupe.lt",
        "full_time_employees": 3802
    },
    "INC1L.VS": {
        "short_name": "INVL Technology",
        "long_name": "UTIB INVL Technology",
        "summary": "UTIB INVL Technology is a principal investment firm. The firm primarily invests as a cluster of IT businesses with a focus in three areas, such as business climate improvement and e-governance, IT services and software, and cyber security. The firm typically invests in Northern and Eastern Europe, countries of Sub-Saharan Africa and South and Southeast Asia. The company was formerly known as BAIP Grupe AB. UTIB INVL Technology was founded in 2015 and is based in Vilnius, Lithuania.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "01109",
        "website": "http://www.invltechnology.lt",
        "full_time_employees": null
    },
    "INL1L.VS": {
        "short_name": "INVL Baltic Farmland",
        "long_name": "INVL Baltic Farmland, AB",
        "summary": "INVL Baltic Farmland, AB, together with its subsidiaries, invests in and leases agricultural land for farmers and agricultural companies in Lithuania. It owns 465 land plots covering the land area of approximately 2988.14 hectares. The company is also involved in the financing activity. INVL Baltic Farmland, AB was incorporated in 2014 and is based in Vilnius, Lithuania.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "01109",
        "website": "http://invlbalticfarmland.com/lit/lt",
        "full_time_employees": 2
    },
    "INR1L.VS": {
        "short_name": "INVL Baltic Real Estate",
        "long_name": "Special Closed-Ended Type Real Estate Investment Company INVL BALTIC REAL ESTATE",
        "summary": "Public Joint - Stock Company INVL Baltic Real Estate is a real estate investment firm based in Vilnius, Lithuania. Public Joint - Stock Company INVL Baltic Real Estate operates independently of Invalda LT, AB as of April 29, 2014.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "01109",
        "website": "http://bre.invl.com",
        "full_time_employees": 9
    },
    "IU8.MU": {
        "short_name": "ZEMAITIJOS PIENAS EO-,29",
        "long_name": "AB Zemaitijos pienas",
        "summary": "AB Zemaitijos pienas produces and sells dairy products in Lithuania and internationally. The company's products include fermented cheese, pre-packaged cheese, processed cheese, cream, cream cheese, butter, dairy spreads, mixed spreads, milk fats, pasteurized cream, buttermilk, whey, and dried milk products. It also offers fresh dairy products, such as milk, cream, curd, yogurts, desserts, curd cheese, and glazed curd cheese. In addition, the company provides transportation and storage services. It offers its products under DÂ\u009eiugas, Magija, Piknik, Saulute, Germantas, Rambyno, Dobilas, Â\u008eemaitijos, Tiche, and Milk Powder brand names. The company was founded in 1924 and is based in TelÂ\u009aiai, Lithuania.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Lithuania",
        "state": null,
        "city": "TelÅ¡iai",
        "zipcode": "87101",
        "website": "http://www.zpienas.lt",
        "full_time_employees": 1242
    },
    "IVL1L.VS": {
        "short_name": "Invalda INVL",
        "long_name": "Invalda INVL, AB",
        "summary": "Invalda INVL, AB is a private equity firm specializing in investments in small and middle-market privately-held companies, industry consolidation, growth capital, acquisitions and buyouts in undervalued assets. The firm is industry agnostic and open to all sectors. It seeks to invest in Lithuania, Latvia, European Union, mainly in Western Europe and internationally. It seeks to exercise control or significant influence over target businesses. The firm prefers to exit its investment when the portfolio company has a liquidity event, such as a sale, recapitalization or listing in the stock exchange. Invalda INVL, AB was formerly known as Invalda LT. Invalda INVL, AB was founded in 1991 and is based in Vilnius, Lithuania.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "LT01109",
        "website": "http://www.invaldainvl.com",
        "full_time_employees": 442
    },
    "KNF1L.VS": {
        "short_name": "Klaipedos Nafta",
        "long_name": "AB Klaipedos nafta",
        "summary": "AB Klaipedos nafta engages in oil terminal, oil products transshipment, and other related activities primarily in Lithuania. It operates through LNGT, OT, and comLNG segments. The company also operates liquefied natural gas terminals. It transships oil products, including diesel fuel of various types, gasoline of various types, jet fuel, fuel oil of various types, technological fuel, vacuum gas oil, and crude oil products, as well as other products, such as ethanol, nonethylene glycol, and fatty acid methyl ester; reloads crude oil and oil products into trucks; and accumulates and stores crude oil and oil products. The company also engages in the collection of wastewaters from sea vessels; mooring; inspection of parameters of oil products; blending of heavy and light oil products; and supply of fuel and water to vessels. In addition, it stores and handles oil products; and adds bio-additives and marks substances to oil products. The company was founded in 1857 and is based in Klaipeda, Lithuania.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Klaipeda",
        "zipcode": "92276",
        "website": "http://www.kn.lt",
        "full_time_employees": 406
    },
    "KNR1L.VS": {
        "short_name": "Kauno Energija",
        "long_name": "AB Kauno Energija",
        "summary": "AB Kauno Energija generates and supplies heat to consumers in the cities of Kaunas and Jurbarkas in Kaunas district. The company also generates and distributes electric energy; and maintains engineering structures, such as collectors and manifolds, as well as heat unit equipment. In addition, it engages in the supervision of indoor heat and hot water supply systems; repair of heat units and other heating equipment; and provision of rental services premises. The company's total installed heat generation capacity includes approximately 682 MW of heat and approximately 691 MW of electricity. As of December 31, 2020, it supplied heat to 3,634 businesses and organizations, and 117,900 households. AB Kauno Energija was founded in 1963 and is headquartered in Kaunas, the Republic of Lithuania.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Kaunas",
        "zipcode": "47179",
        "website": "http://www.kaunoenergija.lt",
        "full_time_employees": 360
    },
    "LGD1L.VS": {
        "short_name": "LITGRID",
        "long_name": "Litgrid AB",
        "summary": "Litgrid AB, together with its subsidiaries, operates electricity transmission systems in Lithuania. The company's services include electricity transmission; trading in balancing, regulating, and reserving power; grid services to third parties; system balancing; public interest services; provision of certificates of origin; and connection to the transmission grid. It serves electricity transmission network users, and electricity producers and suppliers. The company was formerly known as LITGRID turtas AB and changed its name to Litgrid AB in March 2011. The company was incorporated in 2010 and is based in Vilnius, Lithuania. Litgrid AB is a subsidiary of EPSO-G UAB.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "05131",
        "website": "http://www.litgrid.eu",
        "full_time_employees": 310
    },
    "LNA1L.VS": {
        "short_name": "Linas Agro Group",
        "long_name": "AB Linas Agro Group",
        "summary": "AB Linas Agro Group, through its subsidiaries, engages in the production, handling, and merchandise of agricultural and food products in Lithuania, Scandinavian, rest of Europe, Africa, Asia, and CIS countries. The company operates through five segments: Grain and Feedstuff Handling and Merchandising; Products and Services for Farming; Agricultural Production; Food Products; and Other Products and Services. The Grain and Feedstuff Handling and Merchandising segment trades in wheat, rapeseed, barley, and other grains; oilseeds; suncake and sunmeal; and sugar beet pulp, soymeal, vegetable oils, rapecake, and other feedstuffs, as well as provides grain storage and logistics services. The Products and Services for Farming segment sells fertilizers, seeds, plant protection products, agricultural machinery and equipment, spare parts, and other equipment, as well as offers grain storage facilities to agricultural produce growers and grain storage companies. The Agricultural Production segment cultivates cereals, oilseed rape, sugar beet, and other crops; harvests, breeds, and sells livestock; and produces and sells milk, as well as engages in the beef cattle farming business. The Food Products segment is involved in the egg incubation, chicken hatching, broiler breeding, production of poultry and processed products, and slaughtering and sale of chicken. This segment offers its products under the Kekava and Bauska brand names. The Other Products and Services segment sells biofuels and other products and services. The company also rents and manages agricultural purposes land; and provides expedition and ship's agency, and management services. The company was founded in 1991 and is based in PaneveÂ\u009eys, Lithuania. AB Linas Agro Group is a subsidiary of Akola ApS.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "PaneveÅ¾ys",
        "zipcode": "35143",
        "website": "http://www.linasagrogroup.lt",
        "full_time_employees": 2129
    },
    "LNS1L.VS": {
        "short_name": "Linas",
        "long_name": "AB Linas",
        "summary": "AB Linas produces and sells linen textile products in Lithuania. It offers weaving preparation services, weaving services, yarn dyeing services, fabric finishing services, and sewing services. The company also exports its products to Great Britain, Latvia, Sweden, Japan, Spain, Finland, Germany, Belgium, the United States, Denmark, and internationally. AB Linas was founded in 1957 and is based in Panevezys, Lithuania.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Panevezys",
        "zipcode": "35114",
        "website": "http://www.linas.lt",
        "full_time_employees": 113
    },
    "NTU1L.VS": {
        "short_name": "Novaturas",
        "long_name": "Novaturas AB",
        "summary": "Novaturas AB engages in the tour operator and travel agency activities in the Baltic States. The company operates through Flight Package Tours, Sightseeing Tours by Plane, Sightseeing Tours by Coach, and Other segments. It offers summer and winter package holidays, as well as sightseeing tours by coach and aircraft to approximately 30 destinations worldwide. The company also sells flight tickets and hotel accommodations. It offers its products through retail travel agencies and internal sales channels, as well as an e-commerce platform. The company was founded in 1999 and is headquartered in Kaunas, Lithuania.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Kaunas",
        "zipcode": "44245",
        "website": "http://www.novaturasgroup.com",
        "full_time_employees": 168
    },
    "PTR1L.VS": {
        "short_name": "Panevezio Statybos Trestas",
        "long_name": "AB Panevezio Statybos Trestas",
        "summary": "AB Panevezio Statybos Trestas, together with its subsidiaries, designs and constructs buildings, structures, equipment, communications, and other facilities and networks in Lithuania and internationally. It operates through four segments: Construction, Steel Structures, Wooden Panel Houses, and Other Activity. The Construction segment engages in electrical installation works, renovation of buildings, installation of plumbing, sewage and fire protection systems, video surveillance systems, and security and fire alarm systems. The Steel Structures segment involved in designing and fabrication of steel structures for construction purposes, as well as supplies steel structures to various companies. The Wooden Panel Houses segment manufactures, constructs, and outfits wooden panel houses. The Other Activity segment engages in real estate development; wholesale trades of building materials; and production of aluminium constructions, concrete floor, and conditioning systems installation. The company undertakes industrial, public, cultural heritage, and residential projects. It engages in the indoor water supply. The company was founded in 1957 and is based in Panevezys, Lithuania.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Panevezys",
        "zipcode": "35173",
        "website": "http://www.pst.lt",
        "full_time_employees": 870
    },
    "PZV1L.VS": {
        "short_name": "Pieno Zvaigzdes",
        "long_name": "Pieno Zvaigzdes, AB",
        "summary": "Pieno Zvaigzdes, AB, a milk processing company, produces and sells dairy products in Lithuania. The company's products include milk, flavored milk drinks, mozzarella, yogurt, sour cream, butter, cheese, cheese sticks, cottage and cream cheese, cream cheese bars, farmer's cheese, desserts, kefir, processed cheese, and ice-cream; and cagliata cheese, skimmed milk powder, and whey powder. It sells its products to retail stores directly, as well as through distributors. The company also exports its products to Russia and Belarus, as well as to countries of the European Union, CIS, and Asia. Pieno Zvaigzdes, AB is headquartered in Vilnius, Lithuania.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "12127",
        "website": "http://pienozvaigzdes.lt",
        "full_time_employees": null
    },
    "RSU1L.VS": {
        "short_name": "Rokiskio Suris",
        "long_name": "Rokiskio Suris AB",
        "summary": "Rokiskio Suris AB produces and trades in fermented cheese, whey products, and skimmed milk powder in Lithuania. The company operates in two segments, Fresh Dairy Products, and Cheese and Other Dairy products. It also provides fresh milk products, such as milk, kefir products, sour milk, butter, curd, curd cheese, sour cream, glazed curd cheese bars, desserts, and fermented cheeses, as well as purchases raw milk. The company also exports its products to 49 countries worldwide. Rokiskio suris AB was founded in 1925 and is based in RokiÂ\u009akis, Lithuania.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Rokiskis",
        "zipcode": "42150",
        "website": "http://www.rokiskio.com",
        "full_time_employees": 1400
    },
    "SAB1L.VS": {
        "short_name": "Siauliu Bankas",
        "long_name": "AB Siauliu Bankas",
        "summary": "AB Siauliu Bankas provides commercial banking products and services to private and corporate customers in the Republic of Lithuania. Its banking products and services include various bank accounts; term deposits, accumulative deposits, and savings deposits; consumer credits, credit cards, real estate credit, mortgage loans, credits for farmers, and short-term and long-term credits, credits with structural instruments, trade finance, as well as multi-apartment house renovation loans; and payments, cash operations, and payment cards services. The company also provides e-banking, foreign exchange, factoring, and leasing services, as well as other banking services. In addition, it offers investment instruments and transactions, securities trading services, investment funds, life insurance, bonds, reports and recommendations to investors, debt securities quotes, pension accumulation funds, and currency risk management services. Further, the company is involved in the management of real estate properties; investment management business; landscaping services; and development of residential multi-apartments. As of December 31, 2020, it had 59 customer service outlets. The company was incorporated in 1992 and is headquartered in Siauliai, the Republic of Lithuania.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Å iauliai",
        "zipcode": "76348",
        "website": "http://www.sb.lt",
        "full_time_employees": 850
    },
    "SNG1L.VS": {
        "short_name": "Snaige",
        "long_name": "AB Snaige",
        "summary": "AB Snaige, together with its subsidiaries, produces and sells refrigerators and refrigerating equipment under the SNAIGE brand name primarily in Lithuania. The company offers combined refrigerators with separate external doors, single cooler refrigerators, and freezers; commercial refrigerators for businesses, hotels, and restaurants; spare parts for refrigerators, and tools and equipment; refrigerator-showcases; and wine refrigerators. It also exports its products to approximately 30 countries. The company was founded in 1963 and is headquartered in Alytus, Lithuania. AB Snaige is a subsidiary of Sekenora Holdings Limited.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Alytus",
        "zipcode": "62175",
        "website": "http://www.snaige.lt",
        "full_time_employees": 528
    },
    "TEL1L.VS": {
        "short_name": "Telia Lietuva",
        "long_name": "Telia Lietuva, AB",
        "summary": "Telia Lietuva, AB provides telecommunications, information technology (IT), and television (TV) services to business and residential customers in the Republic of Lithuania. It offers fixed and mobile telephony, fixed and mobile Internet access, Pay-TV, data communication, and network capacity, and customer care services, as well as sells equipment. The company also provides data solutions, including capacity transit, IP transit, leased lines and circuits, L2 Ethernet, international VPN MPLS, peering, and telehousing services. In addition, it offers data center, data networks and Internet connections, virtual server infrastructure, software solutions for the IT infrastructure deployment, IT service delivery, cloud computing, emergency recovery and business continuity, exchange server, SAP hosting, data storage, and data backup and recovery. The company was formerly known as Teo LT, AB and changed its name to Telia Lietuva, AB in February 2017. The company was incorporated in 1992 and is based in Vilnius, Lithuania. Telia Lietuva, AB is a subsidiary of Telia Company AB.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "03501",
        "website": "http://www.telia.lt",
        "full_time_employees": 1984
    },
    "TREN": {
        "short_name": "TREND INNOVATIONS HOLDING INC",
        "long_name": "Trend Innovations Holding Inc.",
        "summary": "Trend Innovations Holding, Inc. operates in the information technology based on artificial intelligence. It publishes Thy News application for processing news from various sources. The company was formerly known as FreeCook and changed its name to Trend Innovations Holding Inc. in July 2019. Trend Innovations Holding, Inc. was incorporated in 2017 and is based in Vilnius, Lithuania.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "01110",
        "website": "http://trendinnovationsholding.com",
        "full_time_employees": 1
    },
    "UD5.MU": {
        "short_name": "UTENOS TRIKO  EO 0,29",
        "long_name": "AB Utenos Trikotazas",
        "summary": "AB Utenos Trikotazas, together with its subsidiaries, produces and sells knit-wear and textile articles, and related goods under the UTENOS and ABOUT brand names. It operates through two segments, Production of Knitted Articles and Production of Working Clothes. The company is also involved in sewing clothes; and retail and wholesale trade of knit-wear and textile articles. It operates in Germany, Austria, Switzerland, Sweden, Norway, Denmark, Finland, Lithuania, and internationally. The company was founded in 1967 and is based in Utena, Lithuania. AB Utenos Trikotazas is a subsidiary of UAB Koncernas SBA.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Lithuania",
        "state": null,
        "city": "Utena",
        "zipcode": "28214",
        "website": "http://www.ut.lt",
        "full_time_employees": 1081
    },
    "UDW.MU": {
        "short_name": "AB VILKUSKIU PIEN.EO 0,29",
        "long_name": "AB Vilkyskiu pienine",
        "summary": "AB Vilkyskiu pienine, together with its subsidiaries, produces and sells various types of cheese in Lithuania, rest of the European Union, and internationally. It operates through three segments: Cheese, Cheese Products and Other; Dry Milk Products; and Fresh Milk Products. The company offers fermented, mozzarella, mould, smoked, melt, cottage, and other cheese products; and milk, sour creams, glazed curd bars, butter, kefir, yogurts, dry milk, and whey products. It also leases buildings. AB Vilkyskiu pienine was founded in 1993 and is headquartered in VilkyÂ\u009akiai, Lithuania.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilkyskiai",
        "zipcode": "99254",
        "website": "http://www.vilkyskiu.lt",
        "full_time_employees": 830
    },
    "UE3.MU": {
        "short_name": "VILNIAUS BALDAI EO 1,16",
        "long_name": "Vilniaus Baldai AB",
        "summary": "Vilniaus Baldai AB designs, produces, and sells flat-pack furniture in Lithuania and internationally. It is also involved in the packaging activities. The company was founded in 1883 and is based in Vilnius, Lithuania. Vilniaus Baldai AB is a subsidiary of Invalda Privatus Kapitalas AB.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "03154",
        "website": "http://www.vilniausbaldai.lt",
        "full_time_employees": 898
    },
    "UTR1L.VS": {
        "short_name": "Utenos Trikotazas",
        "long_name": "AB Utenos Trikotazas",
        "summary": "AB Utenos Trikotazas, together with its subsidiaries, produces and sells knit-wear and textile articles, and related goods under the UTENOS and ABOUT brand names. It operates through two segments, Production of Knitted Articles and Production of Working Clothes. The company is also involved in sewing clothes; and retail and wholesale trade of knit-wear and textile articles. It operates in Germany, Austria, Switzerland, Sweden, Norway, Denmark, Finland, Lithuania, and internationally. The company was founded in 1967 and is based in Utena, Lithuania. AB Utenos Trikotazas is a subsidiary of UAB Koncernas SBA.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Utena",
        "zipcode": "28214",
        "website": "http://www.ut.lt",
        "full_time_employees": 1081
    },
    "VBL1L.VS": {
        "short_name": "Vilniaus Baldai",
        "long_name": "Vilniaus Baldai AB",
        "summary": "Vilniaus Baldai AB designs, produces, and sells flat-pack furniture in Lithuania and internationally. It is also involved in the packaging activities. The company was founded in 1883 and is based in Vilnius, Lithuania. Vilniaus Baldai AB is a subsidiary of Invalda Privatus Kapitalas AB.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "03154",
        "website": "http://www.vilniausbaldai.lt",
        "full_time_employees": 898
    },
    "VLP1L.VS": {
        "short_name": "Vilkyskiu Pienine",
        "long_name": "AB Vilkyskiu pienine",
        "summary": "AB Vilkyskiu pienine, together with its subsidiaries, produces and sells various types of cheese in Lithuania, rest of the European Union, and internationally. It operates through three segments: Cheese, Cheese Products and Other; Dry Milk Products; and Fresh Milk Products. The company offers fermented, mozzarella, mould, smoked, melt, cottage, and other cheese products; and milk, sour creams, glazed curd bars, butter, kefir, yogurts, dry milk, and whey products. It also leases buildings. AB Vilkyskiu pienine was founded in 1993 and is headquartered in VilkyÂ\u009akiai, Lithuania.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilkyskiai",
        "zipcode": "99254",
        "website": "http://www.vilkyskiu.lt",
        "full_time_employees": 830
    },
    "W9Z.SG": {
        "short_name": "Auga Group AB Registered Shares",
        "long_name": "Auga Group AB",
        "summary": "Auga Group AB, together with its subsidiaries, operates an organic food production company in Lithuania. It operates through Crop-Growing, Mushroom Growing, Dairy, and End-Consumer Packaged Goods segments. The company is involved in the mushroom growing; organic milk production, and cattle raising and sale activities; and growing of various crops such as organic wheat, legumes, rapeseed, sugar beets, oat, and barley as well as other crops, including grasses and corn for feed. It also offers ready-to-eat soups, preserved mushrooms, packaged vegetables, bottled milk, milk-shakes, eggs, poultry, flour, and other products. The company provides human resource management, trade and logistics, IT system development, machinery leasing, land rental, and agricultural services. The company manages approximately 39,000 hectares of organically certified arable land, as well as uses proprietary and contracted manufacturing to produce a range of organic food products for the end consumer, as well as organic commodities purchasers. It also exports its products to Scandinavian and Baltic countries, Poland, Germany, and France, as well as in the United States, the United Arab Emirates, and Japan. The company was founded in 2003 and is headquartered in Vilnius, Lithuania. Auga Group AB is a subsidiary of Baltic Champs Group, UAB.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "08130",
        "website": "http://www.auga.lt",
        "full_time_employees": 1250
    },
    "WHX.F": {
        "short_name": "APRANGA AB  EO 0,29",
        "long_name": "APB Apranga",
        "summary": "APB Apranga, together with its subsidiaries, engages in the retail trade of apparel in the Baltic States. It operates a chain of 186 stores in Lithuania, Latvia, and Estonia. The company was founded in 1945 and is based in Vilnius, Lithuania. APB Apranga is a subsidiary of UAB MG Baltic investment.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "14311",
        "website": "http://aprangagroup.lt",
        "full_time_employees": 1807
    },
    "WHX.MU": {
        "short_name": "APRANGA AB  EO 0,29",
        "long_name": "APB Apranga",
        "summary": "APB Apranga, together with its subsidiaries, engages in the retail trade of apparel in the Baltic States. It operates a chain of 186 stores in Lithuania, Latvia, and Estonia. The company was founded in 1945 and is based in Vilnius, Lithuania. APB Apranga is a subsidiary of UAB MG Baltic investment.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "14311",
        "website": "http://aprangagroup.lt",
        "full_time_employees": 1807
    },
    "WM8.MU": {
        "short_name": "GRIGEO AB EO -,29",
        "long_name": "Grigeo AB",
        "summary": "Grigeo AB produces and sells toilet papers, paper towels, paper napkins, corrugated cardboards, hardboards, and products from corrugated cardboards in Lithuania. The company operates through three segments: Paper and Paper Products; Wood Fibre Boards and Wood Processing; and Raw Material for Corrugated Cardboard and Related Production. It is also involved in the manufacture of raw materials for the production of corrugated cardboards; honeycomb cardboard paper and filler for use in the furniture, automotive, and construction industries, as well as for the manufacture of doors, wall panels, exhibition stands, and trays; and second-hand paper collection and preparation for recycling. In addition, the company engages in the building construction and real estate development activities. It also exports its products to Poland, Sweden, the United Kingdom, Finland, and internationally. The company was formerly known as Grigeo GrigiÂ\u009akes AB and changed its name to Grigeo AB in April 2017. Grigeo AB was founded in 1823 and is based in Vilnius, Lithuania.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "27101",
        "website": "http://www.grigeo.lt",
        "full_time_employees": 859
    },
    "WM8.SG": {
        "short_name": "Grigeo AB Registered Shares EO ",
        "long_name": "Grigeo AB",
        "summary": "Grigeo AB produces and sells toilet papers, paper towels, paper napkins, corrugated cardboards, hardboards, and products from corrugated cardboards in Lithuania. The company operates through three segments: Paper and Paper Products; Wood Fibre Boards and Wood Processing; and Raw Material for Corrugated Cardboard and Related Production. It is also involved in the manufacture of raw materials for the production of corrugated cardboards; honeycomb cardboard paper and filler for use in the furniture, automotive, and construction industries, as well as for the manufacture of doors, wall panels, exhibition stands, and trays; and second-hand paper collection and preparation for recycling. In addition, the company engages in the building construction and real estate development activities. It also exports its products to Poland, Sweden, the United Kingdom, Finland, and internationally. The company was formerly known as Grigeo GrigiÂ\u009akes AB and changed its name to Grigeo AB in April 2017. Grigeo AB was founded in 1823 and is based in Vilnius, Lithuania.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "27101",
        "website": "http://www.grigeo.lt",
        "full_time_employees": 859
    },
    "WTK.SG": {
        "short_name": "Invalda INVL AB Registered Shar",
        "long_name": "Invalda INVL, AB",
        "summary": "Invalda INVL, AB is a private equity firm specializing in investments in small and middle-market privately-held companies, industry consolidation, growth capital, acquisitions and buyouts in undervalued assets. The firm is industry agnostic and open to all sectors. It seeks to invest in Lithuania, Latvia, European Union, mainly in Western Europe and internationally. It seeks to exercise control or significant influence over target businesses. The firm prefers to exit its investment when the portfolio company has a liquidity event, such as a sale, recapitalization or listing in the stock exchange. Invalda INVL, AB was formerly known as Invalda LT. Invalda INVL, AB was founded in 1991 and is based in Vilnius, Lithuania.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "LT01109",
        "website": "http://www.invaldainvl.com",
        "full_time_employees": 442
    },
    "WVJ.MU": {
        "short_name": "KAUNO ENERGIJA AB EO 1,74",
        "long_name": "AB Kauno Energija",
        "summary": "AB Kauno Energija generates and supplies heat to consumers in the cities of Kaunas and Jurbarkas in Kaunas district. The company also generates and distributes electric energy; and maintains engineering structures, such as collectors and manifolds, as well as heat unit equipment. In addition, it engages in the supervision of indoor heat and hot water supply systems; repair of heat units and other heating equipment; and provision of rental services premises. The company's total installed heat generation capacity includes approximately 682 MW of heat and approximately 691 MW of electricity. As of December 31, 2020, it supplied heat to 3,634 businesses and organizations, and 117,900 households. AB Kauno Energija was founded in 1963 and is headquartered in Kaunas, the Republic of Lithuania.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Lithuania",
        "state": null,
        "city": "Kaunas",
        "zipcode": "47179",
        "website": "http://www.kaunoenergija.lt",
        "full_time_employees": 360
    },
    "WVJ.SG": {
        "short_name": "Kauno Energija AB Registered Sh",
        "long_name": "AB Kauno Energija",
        "summary": "AB Kauno Energija generates and supplies heat to consumers in the cities of Kaunas and Jurbarkas in Kaunas district. The company also generates and distributes electric energy; and maintains engineering structures, such as collectors and manifolds, as well as heat unit equipment. In addition, it engages in the supervision of indoor heat and hot water supply systems; repair of heat units and other heating equipment; and provision of rental services premises. The company's total installed heat generation capacity includes approximately 682 MW of heat and approximately 691 MW of electricity. As of December 31, 2020, it supplied heat to 3,634 businesses and organizations, and 117,900 households. AB Kauno Energija was founded in 1963 and is headquartered in Kaunas, the Republic of Lithuania.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Lithuania",
        "state": null,
        "city": "Kaunas",
        "zipcode": "47179",
        "website": "http://www.kaunoenergija.lt",
        "full_time_employees": 360
    },
    "XIC.F": {
        "short_name": "KLAIPEDOS NAFTA AB EO0,29",
        "long_name": "AB Klaipedos nafta",
        "summary": "AB Klaipedos nafta engages in oil terminal, oil products transshipment, and other related activities primarily in Lithuania. It operates through LNGT, OT, and comLNG segments. The company also operates liquefied natural gas terminals. It transships oil products, including diesel fuel of various types, gasoline of various types, jet fuel, fuel oil of various types, technological fuel, vacuum gas oil, and crude oil products, as well as other products, such as ethanol, nonethylene glycol, and fatty acid methyl ester; reloads crude oil and oil products into trucks; and accumulates and stores crude oil and oil products. The company also engages in the collection of wastewaters from sea vessels; mooring; inspection of parameters of oil products; blending of heavy and light oil products; and supply of fuel and water to vessels. In addition, it stores and handles oil products; and adds bio-additives and marks substances to oil products. The company was founded in 1857 and is based in Klaipeda, Lithuania.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Lithuania",
        "state": null,
        "city": "Klaipeda",
        "zipcode": "92276",
        "website": "http://www.kn.lt",
        "full_time_employees": 406
    },
    "YCJ.MU": {
        "short_name": "LINAS AB  EO 0,29",
        "long_name": "AB Linas",
        "summary": "AB Linas produces and sells linen textile products in Lithuania. It offers weaving preparation services, weaving services, yarn dyeing services, fabric finishing services, and sewing services. The company also exports its products to Great Britain, Latvia, Sweden, Japan, Spain, Finland, Germany, Belgium, the United States, Denmark, and internationally. AB Linas was founded in 1957 and is based in Panevezys, Lithuania.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Lithuania",
        "state": null,
        "city": "Panevezys",
        "zipcode": "35114",
        "website": "http://www.linas.lt",
        "full_time_employees": 113
    },
    "YK3.SG": {
        "short_name": "Panevezio statybos trestas AB R",
        "long_name": "AB Panevezio Statybos Trestas",
        "summary": "AB Panevezio Statybos Trestas, together with its subsidiaries, designs and constructs buildings, structures, equipment, communications, and other facilities and networks in Lithuania and internationally. It operates through four segments: Construction, Steel Structures, Wooden Panel Houses, and Other Activity. The Construction segment engages in electrical installation works, renovation of buildings, installation of plumbing, sewage and fire protection systems, video surveillance systems, and security and fire alarm systems. The Steel Structures segment involved in designing and fabrication of steel structures for construction purposes, as well as supplies steel structures to various companies. The Wooden Panel Houses segment manufactures, constructs, and outfits wooden panel houses. The Other Activity segment engages in real estate development; wholesale trades of building materials; and production of aluminium constructions, concrete floor, and conditioning systems installation. The company undertakes industrial, public, cultural heritage, and residential projects. It engages in the indoor water supply. The company was founded in 1957 and is based in Panevezys, Lithuania.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Lithuania",
        "state": null,
        "city": "Panevezys",
        "zipcode": "35173",
        "website": "http://www.pst.lt",
        "full_time_employees": 870
    },
    "YOE.MU": {
        "short_name": "PIENO ZVAIGZDES AB EO0,29",
        "long_name": "Pieno Zvaigzdes, AB",
        "summary": "Pieno Zvaigzdes, AB, a milk processing company, produces and sells dairy products in Lithuania. The company's products include milk, flavored milk drinks, mozzarella, yogurt, sour cream, butter, cheese, cheese sticks, cottage and cream cheese, cream cheese bars, farmer's cheese, desserts, kefir, processed cheese, and ice-cream; and cagliata cheese, skimmed milk powder, and whey powder. It sells its products to retail stores directly, as well as through distributors. The company also exports its products to Russia and Belarus, as well as to countries of the European Union, CIS, and Asia. Pieno Zvaigzdes, AB is headquartered in Vilnius, Lithuania.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "12127",
        "website": "http://pienozvaigzdes.lt",
        "full_time_employees": null
    },
    "YTV.MU": {
        "short_name": "ROKISKIO SURIS PC EO 0,29",
        "long_name": "Rokiskio Suris AB",
        "summary": "Rokiskio Suris AB produces and trades in fermented cheese, whey products, and skimmed milk powder in Lithuania. The company operates in two segments, Fresh Dairy Products, and Cheese and Other Dairy products. It also provides fresh milk products, such as milk, kefir products, sour milk, butter, curd, curd cheese, sour cream, glazed curd cheese bars, desserts, and fermented cheeses, as well as purchases raw milk. The company also exports its products to 49 countries worldwide. Rokiskio suris AB was founded in 1925 and is based in RokiÂ\u009akis, Lithuania.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Lithuania",
        "state": null,
        "city": "Rokiskis",
        "zipcode": "42150",
        "website": "http://www.rokiskio.com",
        "full_time_employees": 1400
    },
    "ZH5.F": {
        "short_name": "BANK OF SIAULIAI  EO 0,29",
        "long_name": "AB Siauliu Bankas",
        "summary": "AB Siauliu Bankas provides commercial banking products and services to private and corporate customers in the Republic of Lithuania. Its banking products and services include various bank accounts; term deposits, accumulative deposits, and savings deposits; consumer credits, credit cards, real estate credit, mortgage loans, credits for farmers, and short-term and long-term credits, credits with structural instruments, trade finance, as well as multi-apartment house renovation loans; and payments, cash operations, and payment cards services. The company also provides e-banking, foreign exchange, factoring, and leasing services, as well as other banking services. In addition, it offers investment instruments and transactions, securities trading services, investment funds, life insurance, bonds, reports and recommendations to investors, debt securities quotes, pension accumulation funds, and currency risk management services. Further, the company is involved in the management of real estate properties; investment management business; landscaping services; and development of residential multi-apartments. As of December 31, 2020, it had 59 customer service outlets. The company was incorporated in 1992 and is headquartered in Siauliai, the Republic of Lithuania.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Lithuania",
        "state": null,
        "city": "Å iauliai",
        "zipcode": "76348",
        "website": "http://www.sb.lt",
        "full_time_employees": 850
    },
    "ZMP1L.VS": {
        "short_name": "Zemaitijos Pienas",
        "long_name": "AB Zemaitijos pienas",
        "summary": "AB Zemaitijos pienas produces and sells dairy products in Lithuania and internationally. The company's products include fermented cheese, pre-packaged cheese, processed cheese, cream, cream cheese, butter, dairy spreads, mixed spreads, milk fats, pasteurized cream, buttermilk, whey, and dried milk products. It also offers fresh dairy products, such as milk, cream, curd, yogurts, desserts, curd cheese, and glazed curd cheese. In addition, the company provides transportation and storage services. It offers its products under DÂ\u009eiugas, Magija, Piknik, Saulute, Germantas, Rambyno, Dobilas, Â\u008eemaitijos, Tiche, and Milk Powder brand names. The company was founded in 1924 and is based in TelÂ\u009aiai, Lithuania.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "TelÅ¡iai",
        "zipcode": "87101",
        "website": "http://www.zpienas.lt",
        "full_time_employees": 1242
    },
    "ZS4.SG": {
        "short_name": "Snaige AB Registered Shares EO ",
        "long_name": "AB Snaige",
        "summary": "AB Snaige, together with its subsidiaries, produces and sells refrigerators and refrigerating equipment under the SNAIGE brand name primarily in Lithuania. The company offers combined refrigerators with separate external doors, single cooler refrigerators, and freezers; commercial refrigerators for businesses, hotels, and restaurants; spare parts for refrigerators, and tools and equipment; refrigerator-showcases; and wine refrigerators. It also exports its products to approximately 30 countries. The company was founded in 1963 and is headquartered in Alytus, Lithuania. AB Snaige is a subsidiary of Sekenora Holdings Limited.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Lithuania",
        "state": null,
        "city": "Alytus",
        "zipcode": "62175",
        "website": "http://www.snaige.lt",
        "full_time_employees": 528
    },
    "ZWS.F": {
        "short_name": "TELIA LIETUVA EO -,29",
        "long_name": "Telia Lietuva, AB",
        "summary": "Telia Lietuva, AB provides telecommunications, information technology (IT), and television (TV) services to business and residential customers in the Republic of Lithuania. It offers fixed and mobile telephony, fixed and mobile Internet access, Pay-TV, data communication, and network capacity, and customer care services, as well as sells equipment. The company also provides data solutions, including capacity transit, IP transit, leased lines and circuits, L2 Ethernet, international VPN MPLS, peering, and telehousing services. In addition, it offers data center, data networks and Internet connections, virtual server infrastructure, software solutions for the IT infrastructure deployment, IT service delivery, cloud computing, emergency recovery and business continuity, exchange server, SAP hosting, data storage, and data backup and recovery. The company was formerly known as Teo LT, AB and changed its name to Telia Lietuva, AB in February 2017. The company was incorporated in 1992 and is based in Vilnius, Lithuania. Telia Lietuva, AB is a subsidiary of Telia Company AB.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "03501",
        "website": "http://www.telia.lt",
        "full_time_employees": 1984
    }
}