{
    "1712.TW": {
        "short_name": "SINON CORP",
        "long_name": "Sinon Corporation",
        "summary": "Sinon Corporation manufactures and sells crop protection and nutrient solutions in Taiwan and internationally. The company offers crop protection products, such as herbicides, insecticides, and fungicides; crop nutrition products, including fertilizers, plant hormones, seed treatments, synthetic fertilizers, organomineral fertilizers, organic fertilizers, organic seed treatments, inoculants, and natural plant hormones; and agrochemicals, seeds, and agricultural equipment, as well as provides technical field training and support, product application seminars, and financial services. It also provides products and services comprising bottle design, mold design and manufacturing, plastic vacuum molding, plastic injection molding, PET mold blowing, and plastic printing and labeling products and services, as well as formulation recipes for the beauty, healthcare, and household segments. In addition, the company engages in the phalaenopsis orchid nursery and distribution business. Further, it operates 41 supermarkets in Taiwan; and prepares and delivers meals to schools and companies. Additionally, the company manufactures and sells cement. The company was formerly known as Shinung Chemical Industry Co., Ltd. and changed its name to Sinon Corporation in 1979. Sinon Corporation was founded in 1955 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "43245",
        "website": "http://www.sinon.com.tw",
        "full_time_employees": null
    },
    "6508.TWO": {
        "short_name": "HUIKWANG CORPORATION",
        "long_name": "Huikwang Corporation",
        "summary": "Huikwang Corporation manufactures and sells agrochemical in Taiwan and China. It offers insecticides, fungicides, herbicides, miticides, surfactants, and attractants for use in crop protection. The company was founded in 1965 and is based in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "72152",
        "website": "http://www.huikwang.com",
        "full_time_employees": null
    }
}