{
    "2618.TW": {
        "short_name": "EVA AIRWAYS",
        "long_name": "EVA Airways Corp.",
        "summary": "EVA Airways Corp., together with its subsidiaries, engages in the aviation business in Taiwan, Asia, Europe, North America, and internationally. The company operates through Aviation Transportation, Maintenance, Catering, and Other segments. The Aviation Transportation segment is involved in the aviation transportation of passengers and cargo. The Maintenance segment maintains aircrafts, engines, and aircraft parts. The Catering segment is involved in providing catering services. The Other segment provides ground handling, travel agency, cargo distribution, investment, and flight training activities. The company also manufactures aircraft parts. As of December 31, 2019, it operated 84 aircraft, including 79 passenger jets and 5 freighters. EVA Airways Corp. was founded in 1989 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Airlines",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": null,
        "website": "http://www.evaair.com",
        "full_time_employees": null
    },
    "6757.TWO": {
        "short_name": "TTW",
        "long_name": "Tigerair Taiwan Co., Ltd.",
        "summary": "Tigerair Taiwan Co., Ltd. provides airline services. It offers international transportation services for passengers and cargo; and ground handling services. The company was founded in 2014 and is based in Taoyuan City, Taiwan. Tigerair Taiwan Co., Ltd. is a subsidiary of China Airlines Co., Ltd.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Airlines",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": null,
        "website": "http://www.tigerairtw.com/en/",
        "full_time_employees": 740
    }
}