{
    "5609.TWO": {
        "short_name": "DIMERCO EXPRESS CORPORATION",
        "long_name": "Dimerco Express Corporation",
        "summary": "Dimerco Express Corporation, together with its subsidiaries, engages in the international transportation and logistics business. The company offers air freight services, including scheduled consolidation, direct air carrier, airport-to-airport, and door-to-door delivery; ocean freight services; and sea/air and air/sea freight services. It also provides customs brokerage services, such as customs clearance services and professional solutions; and logistics and warehousing services comprising vendor managed inventory, raw materials distribution, finished goods distribution, reverse logistics, after sales logistics, distribution assortment, cross-docking, just-in-time, sequenced supply synchronized delivery management, and in-transit mixing product support services. In addition, the company offers cross-border trucking, domestic transportation, cargo insurance brokerage, and logistics supply chain management consultancy services. Further, it provides integrated value added services that include domestic and cross-border air and road freight, as well as logistics warehousing services, and regular and bonded logistics parks/centers under the China Plus name. The company serves the aerospace, auto components, cabling, communication equipment, computer and peripherals, electrical equipment, electronic equipment and instruments, machinery parts, metals and mining, paper and forest goods, construction materials, telecom parts, plastic products, semiconductors and semiconductor equipment, and tooling industries. The company was founded in 1971 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Airports & Air Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.dimerco.com",
        "market_cap": 16506000384
    }
}