{
    "4558.TWO": {
        "short_name": "Alformer",
        "long_name": "ALFORMER Industrial Co., Ltd.",
        "summary": "ALFORMER Industrial Co., Ltd. produces and processes aluminum products in Taiwan. Its products include aluminum and industrial extrusions, aluminum electrolysis (anode treatment), aluminum doors and windows, airtight windows, aluminum curtain walls, solar panels, frames and brackets, building materials, greenhouse project, CNC milling, and forging, as well as solar energy engineering products. The company was founded in 1989 and is based in Changhua City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua City",
        "zipcode": "521",
        "website": "http://www.alformer.com.tw",
        "market_cap": 1587600000
    },
    "6175.TWO": {
        "short_name": "LITON TECHNOLOGY CORP",
        "long_name": "Liton Technology Corp.",
        "summary": "Liton Technology Corp. manufactures and sells etched and formed aluminum foils in Taiwan, Mainland China, Europe, the Americas, Japan, Korea, India, and Southeast Asia. The company offers middle and high voltage formed aluminum foils; low voltage formed aluminum foils; and middle and high voltage etched aluminum foils. Its products are used in industries and products, such as aerospace, high-speed rail, MRT systems, solar and wind power, computers, mobile phones, automobiles, home appliances, and industrial products. The company was formerly known as Liton Electrics Corp. and changed its name to Liton Technology Corp. in April 1998. Liton Technology Corp. was founded in 1993 and is headquartered in Miaoli, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Miaoli",
        "zipcode": null,
        "website": "http://www.liton.com.tw",
        "market_cap": 5280417280
    },
    "8942.TWO": {
        "short_name": "XXENTRIA TECHNOLOGY MATERIALS C",
        "long_name": "Xxentria Technology Materials Co., Ltd.",
        "summary": "Xxentria Technology Materials Co., Ltd. manufactures and sells metal composite materials worldwide. The company develops products with metal and plastic components. It offers exterior facades cladding and interior furnishing for new buildings, as well as refurbishment; and lacquer coated solid aluminum panels, as well as anodized and PVD-coating materials for architectural applications. The company also provides solar receiver tubes and tube coatings; and reflective composites materials for solar thermal applications. In addition, it offers wall and door panels for truck and trailer bodies; galvanized steel composite panels; and high tensile aluminum composite panels for transportation applications. The company was founded in 1994 and is headquartered in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan",
        "zipcode": "711",
        "website": "http://www.xxentria-tech.com",
        "market_cap": 11835672576
    }
}