{
    "1419.TW": {
        "short_name": "SHINKONG TEXTILE CO. LTD.",
        "long_name": "Shinkong Textile Co.,Ltd.",
        "summary": "Shinkong Textile Co.,Ltd. operates as a natural fibers manufacturer. It offers digital print, dyed fabric, reflective yarn, flannel, and bi-stretch fabric services for synthetic fibers. The company also provides base layers, mid layers, and outer wear knits; and wool textile products. Shinkong Textile Co.,Ltd. was founded in 1955 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "1467.TW": {
        "short_name": "TEX-RAY INDUSTRIAL CO LTD",
        "long_name": "Tex-Ray Industrial Co., Ltd.",
        "summary": "Tex-Ray Industrial Co., Ltd. manufactures and retails yarns and fabrics. It also manufactures garments. The company was founded in 1978 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei City"
    },
    "1473.TW": {
        "short_name": "TAINAN ENTERPRISES",
        "long_name": "Tainan Enterprises Co.,Ltd",
        "summary": "Tainan Enterprises Co., Ltd. operates as a garment OEM manufacturer in Taiwan and internationally. Its principal products include pants, shirts, dresses, skirts, jackets, vests, and coats, as well as tops, shorts, and denim and active wear products. The company offers its products under the TONY WEAR, TONY JEANS, TW.DESIGN, Emely, Emely Sweetie, and RUE 58 brand names. It primarily serves casual apparel retailers. The company was founded in 1961 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "1477.TW": {
        "short_name": "MAKALOT INDUSTRIAL CO",
        "long_name": "Makalot Industrial Co., Ltd.",
        "summary": "Makalot Industrial Co., Ltd. engages in the design, manufacture, and sale of garments for men, women, and children in Taiwan. It offers fashion clothing; sports clothing; sleepwear, including long and short pants, T-shirts, dresses, shirts, inner pajamas, sports suits, jackets, etc.; and ready-to-wear clothing, active wear, loungewear, and gift sets. The company also provides material development, supplier search and management, style design, fashion trend provision, manufacturing, research and development, and logistics and distribution services. It also exports its products to the United States and internationally. The company was founded in 1990 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "2929.TW": {
        "short_name": "TOPBI INTERNATIONAL HOLDINGS LT",
        "long_name": "TOPBI International Holdings Limited",
        "summary": "TOPBI International Holdings Limited designs and sells children's clothing from 1 to 16 years old. The company offers shorts, trousers, shirts, t-shirts, cotton-padded jacket, wind-coat, etc. It has sales points in 16 provinces and 3 municipalities in China. The company was founded in 2002 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "4438.TW": {
        "short_name": "QUANG VIET ENTERPRISE CO LTD",
        "long_name": "Quang Viet Enterprise Co., Ltd.",
        "summary": "Quang Viet Enterprise Co., Ltd. manufactures and supplies garments for outdoor sports in Taiwan and internationally. The company was founded in 1996 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei City"
    }
}