{
    "2373.TW": {
        "short_name": "AURORA CORPORATION",
        "long_name": "Aurora Corporation",
        "summary": "Aurora Corporation provides office automation equipment, office furniture, communications, 3D printers, air purifiers, office cloud and electronic goods, etc. in Taiwan, China, and internationally. It also offers hardware services, as well as software and hardware integration solutions. The company was founded in 1965 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "2433.TW": {
        "short_name": "HUXEN CORPORATION",
        "long_name": "Huxen Corporation",
        "summary": "Huxen Corporation provides office products in Taiwan. The company offers photocopiers, multifunctional service machines, laser printers, digital printing machines, and 3D printing, as well as network communication products, including telephone exchange, peripheral goods, firewall commodity, and Internet goods. It also provides software systems comprising solutions, app application, and transaction machine cloud systems; video systems, such as commercial projectors and video conferencing systems; and cloud systems. In addition, the company offers cloud, file, 3D, and communication solutions. It also rents and repairs electronic and mechanical components; and sells wireless communication transmission equipment, as well as provides project contracting and installation services. The company was founded in 1984 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei City"
    },
    "2482.TW": {
        "short_name": "UNIFORM INDUSTRIAL",
        "long_name": "Uniform Industrial Corporation",
        "summary": "Uniform Industrial Corporation provides customized solutions for the payment industry in Taiwan and internationally. Its product portfolio includes magnetic stripes, smart chips, and decoder integrated circuits. The company offers secure card readers, contactless readers, MSR readers, hybrid card readers, check readers, unattended systems, decoder chips, countertop systems, and POS systems. Uniform Industrial Corporation was founded in 1983 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "8114.TW": {
        "short_name": "POSIFLEX TECHNOLOGIES INC",
        "long_name": "Posiflex Technology, Inc.",
        "summary": "Posiflex Technology, Inc. designs, manufactures, and sells industrial computers and peripheral equipment in Taiwan, the United States, Germany, Japan, India, China, Singapore, and Malaysia. The company operates through Domestic, USA, and Others segments. It provides mobile POS, POS terminal, all in one POS, infotainment terminal, digital signage, POS box, and kiosk products, as well as android platform. The company also offers POS monitors, line displays, POS printers, cash drawers, POS keyboards, barcode scanners, magnetic stripe card readers, attachments, MT accessories, signature pads, and IO boxes. In addition, it trades in electronic parts; and offers software and warranty services. The company serves customers in the retail, catering, large-scale shopping centers, chain stores, entertainment venues, logistics, medical institutions, and e-commerce businesses under the POSIFLEX brand name. Posiflex Technology, Inc. was founded in 1984 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    }
}