{
    "2373.TW": {
        "short_name": "AURORA CORPORATION",
        "long_name": "Aurora Corporation",
        "summary": "Aurora Corporation provides office automation equipment, office furniture, communications, 3D printers, office cloud, and electronic goods in Taiwan, China, and internationally. It also offers hardware services, as well as software and hardware integration solutions. The company was founded in 1965 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "110014",
        "website": "http://www.aurora.com.tw",
        "market_cap": "Large Cap"
    },
    "2427.TW": {
        "short_name": "MERCURIES DATA SYSTEM",
        "long_name": "Mercuries Data Systems Ltd.",
        "summary": "Mercuries Data Systems Ltd. engages in the system integration business with a focus on finance, transportation, telecommunications, education, and fire protection fields in Taiwan. The company offers train dispatching radio systems, coastal surveillance radar systems, next generation spectrum monitoring systems, police and freeway digital radio systems, dispatch systems, naval METOC office high performance numerical model forecast systems, and MRT automatic fare collection systems. It also provides an all-in-one field staff management software solution. Mercuries Data Systems Ltd. was founded in 1976 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.mds.com.tw",
        "market_cap": "Mid Cap"
    },
    "2433.TW": {
        "short_name": "HUXEN CORPORATION",
        "long_name": "Huxen Corporation",
        "summary": "Huxen Corporation provides office products in Taiwan. The company offers photocopiers, multifunctional service machines, laser printers, digital printing machines, and 3D printing, as well as network communication products, including telephone exchange, peripheral goods, firewall commodity, and Internet goods. It also provides software systems comprising solutions, app application, and transaction machine cloud systems; video systems, such as commercial projectors and video conferencing systems; cloud systems; and air purifiers. The company was founded in 1984 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.eosasc.com.tw",
        "market_cap": "Mid Cap"
    },
    "2482.TW": {
        "short_name": "UNIFORM INDUSTRIAL",
        "long_name": "Uniform Industrial Corporation",
        "summary": "Uniform Industrial Corporation provides various payment solutions worldwide. Its product portfolio includes magnetic stripes, smart chips, near field communication products, and decoder integrated circuits. The company provides classic readers, unattended systems, countertop systems, mobile payment solutions, contactless readers, hybrid card readers, peripherals, and POS solutions. It also develops payment platforms; and provides technical services, including product conceptualization, customer shipment (FCS), and post-FCS support. Uniform Industrial Corporation was founded in 1983 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "236",
        "website": "http://uicpayworld.com",
        "market_cap": "Small Cap"
    },
    "5258.TW": {
        "short_name": "CASTLES TECH CO LTD",
        "long_name": "Castles Technology Co., Ltd.",
        "summary": "Castles Technology Co., Ltd. manufactures and sells payment solutions for the financial, retail, hospitality, and transportation sectors. Its products include Android, mobile, and EFT POS solutions; and unattended terminals, PIN pads, and other products. The company was founded in 1993 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "231",
        "website": "http://www.castlestech.com",
        "market_cap": "Small Cap"
    },
    "5438.TWO": {
        "short_name": "TECO IMAGE",
        "long_name": "Teco Image Systems Co.,Ltd.",
        "summary": "Teco Image Systems Co., Ltd. provides OEM and ODM services to imaging and communication products industries worldwide. The company is involved in the design, development, and manufacture of multi-function printing devices, plain paper facsimiles, digital copiers, and color scanners. It also offers mechanical subsystems comprising control panels and automatic document feeders; optical subsystems, such as scan units; and electronic sub-systems, including printer controller cards, printer network cards, Internet fax cards, fax controllers, and copier controllers. The company was founded in 1956 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.tecoimage.com.tw",
        "market_cap": "Small Cap"
    },
    "6160.TWO": {
        "short_name": "CIPHERLAB CO. LTD.",
        "long_name": "Cipherlab Co.,Ltd.",
        "summary": "Cipherlab Co.,Ltd. designs, manufactures, markets, and sells automatic identification and data capture products under the CipherLab brand worldwide. The company offers windows/android and proprietary mobile computers; general purpose, business durable, and pocket sized barcode scanners; HF and UHF radio frequency identification readers; and software solutions comprising deployment and development tools, device management, browser and emulation, programming, and scanner software. It serves warehouse, transportation and logistics, field mobility, retail, manufacturing, and healthcare industries, as well as the government. The company was founded in 1988 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10669",
        "website": "http://www.cipherlab.com",
        "market_cap": "Small Cap"
    },
    "6593.TWO": {
        "short_name": "TAIWAN NAME PLATE CO LTD",
        "long_name": "Taiwan Name Plate Co., Ltd.",
        "summary": "Taiwan Name Plate Co., Ltd. manufactures and sells plastic cards, name plates, and membrane switches worldwide. The company offers contactless and sharped, contact only IC, and dual interface IC cards, as well as card personalization services. It also provides embossed metal dome membrane switches, capacitive touch keypads, and printed circuit boards. Taiwan Name Plate Co., Ltd. was founded in 1970 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "333",
        "website": "http://www.tnp.com.tw",
        "market_cap": "Small Cap"
    },
    "8114.TW": {
        "short_name": "POSIFLEX TECHNOLOGIES INC",
        "long_name": "Posiflex Technology, Inc.",
        "summary": "Posiflex Technology, Inc. designs, manufactures, and sells point of sale (POS) management systems and peripheral equipment in Taiwan, the United States, Germany, Japan, India, China, Singapore, and Malaysia. It provides mobile POS, POS terminal, all in one POS, infotainment terminal, digital signage, POS box, and kiosk products, as well as android platform. The company also offers POS monitors, line displays, POS printers, cash drawers, POS keyboards, barcode scanners, magnetic stripe card readers, attachments, MT accessories, and IO boxes. It serves customers in the retail, catering, large-scale shopping centers, chain stores, entertainment venues, logistics, medical institutions, and e-commerce businesses under the POSIFLEX brand name. The company was incorporated in 1984 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23679",
        "website": "http://www.posiflex.com.tw",
        "market_cap": "Mid Cap"
    },
    "8342.TWO": {
        "short_name": "I JANG INDUSTRIA CO LTD",
        "long_name": "I Jang Industrial Co.,Ltd.",
        "summary": "I Jang Industrial Co.,Ltd. manufactures and sells commercial storage equipment, and custom-made and household products worldwide. The company offers store display products, such as fruit, display, and flower racks; display, shopping basket, and mesh shop display stands; display tables; and wire rotary displays, as well as healthcare products comprising binder, shelves binder, and medical trolley carts; and shelving covers. It also provides moving storage rack systems, cylinder and cargo trolleys, warehouse cages, trolley and tool carts, and metal pallets for logistics and warehouses; and stainless steel trolleys and storage racks, working carts, stainless steel work tables, and storage racks for food services and restaurants. In addition, the company offers customized display stands, AGV pallets, and foldable display racks. Further, it provides home furniture products, such as wagons, heavy duty and corner shelving, slimline and other shelving, and magazine racks. The company was founded in 1987 and is based in Changhua City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "523",
        "website": "http://www.i-jang.com",
        "market_cap": "Small Cap"
    }
}