{
  "2820.TW": {
    "city": "Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Capital Markets",
    "long_name": "China Bills Finance Corporation",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "CHINA BILLS FINANCE CORP",
    "state": null,
    "summary": "China Bills Finance Corporation provides various financial services in Taiwan. The company engages in the certification and underwriting of short-term bills, bank debentures, and foreign currency bills; brokerage and trading of short-term bills, bank debentures, government bonds, and foreign bonds; guaranteeing short-term bills; and provision of financial consulting services to enterprises. It is also involved in the proprietary trading of corporate bonds; equity investments; and fixed income securities trading, as well as provision of inter-bank call loans. The company operates through a network of five branches located in Banqiao, Taoyuan, Taichung, Tainan, and Kaohsiung. China Bills Finance Corporation was incorporated in 1978 and is headquartered in Taipei City, Taiwan.",
    "website": "http://www.cbf.com.tw",
    "zipcode": "114"
  },
  "2855.TW": {
    "city": "Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Capital Markets",
    "long_name": "President Securities Corporation",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "PRESIDENT SECURITIES",
    "state": null,
    "summary": "President Securities Corporation, together with its subsidiaries, engages in the brokerage, proprietary trading, fixed income, reinvestment, wealth management, and shareholder services in the People's Republic of China. It is involved in various activities, including underwriting of securities; dealing or brokerage business of securities at the securities exchange markets and business premises; registration and transfer agency service for securities; margin loans and short sales business of securities; securities lending and borrowing business; futures introducing brokerage services; futures dealing; issuance of call warrants; new financial instrument transactions; and trust business. The company was founded in 1988 and is headquartered in Taipei City, Taiwan.",
    "website": "http://www.pscnet.com.tw",
    "zipcode": "105"
  },
  "2889.TW": {
    "city": "Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Capital Markets",
    "long_name": "IBF Financial Holdings Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "IBF FINANCIAL HOLDINGS CO LTD",
    "state": null,
    "summary": "IBF Financial Holdings Co., Ltd., through its subsidiaries, provides various financial products and services for individual and corporate clients. The company is involved in the certification and underwriting of short-term bills, financial debentures, and securities; brokerage and proprietary trading of short-term bills, as well as futures and securities brokerage transactions; guarantee and endorsement of short-term bills; and proprietary trading of government bonds, financial debentures, corporate and foreign currency bonds, securities, and equity-related futures. It also provides corporate finance, equity, securities investment, and futures investment advisory services; financial derivatives; investment trust services; convertible bond asset services; margin lending and short sales financing; stock affairs and interbank call loans agent services; wealth management services; capital, management expertise and consultative services to investees; and general investment and financial leasing services. In addition, the company engages in the procurement of leased property, as well as leased property residual value disposal and maintenance activities; offers leasing transactions counseling, and non-financing guarantee services; and invests in equity related commodities. IBF Financial Holdings Co., Ltd. was founded in 2002 and is based in Taipei City, Taiwan.",
    "website": "http://www.ibf.com.tw",
    "zipcode": "104"
  },
  "3158.TWO": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Capital Markets",
    "long_name": "SysJust Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "SysJust",
    "state": null,
    "summary": "SysJust Co., Ltd. operates as a financial technology company in Taiwan. It offers various platforms, including XQ Global Winner, XS strategy radar, and XQ mobile platform; WQ new VIP viewing room; MoneyDJ; Lok Fu Finance channel for data analysis and reading on smart phones, tablets, and computers; and database. The company was founded in 1999 and is headquartered in New Taipei City, Taiwan.",
    "website": "http://www.sysjust.com.tw",
    "zipcode": "23141"
  },
  "5820.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Capital Markets",
    "long_name": "JihSun Financial Holding Co.,Ltd.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "JIH SUN FINANCIAL HLDG CO",
    "state": null,
    "summary": "JihSun Financial Holding Co.,Ltd., together with its subsidiaries, operates as a financial holding company in Taiwan. It engages in securities brokerage, trading, underwriting, and margin purchases and short sales; and stock transaction agency and futures trading activities, as well as provides auxiliary services for futures trading and stock warrant issuance. The company also offers general deposits, loans and discounts, stocks, short term securities, financial bonds, and others, as well as government bond investment and collection, fund trust transaction, and employee investment trust services. In addition, it operates as a property and life insurance agent, as well as provides venture capital, securities investment research, and proprietary trading services. Further, the company is involved in the securities research and analysis, corporate and personal financial planning, and financing activities, as well as sale of mutual funds and other financial products. JihSun Financial Holding Co.,Ltd. was incorporated in 2002 and is based in Taipei City, Taiwan.",
    "website": "http://www.jsun.com",
    "zipcode": null
  },
  "6020.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Capital Markets",
    "long_name": "TaChan Securities Co.,Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "TACHAN SECURITIES CO",
    "state": null,
    "summary": "TaChan Securities Co.,Ltd. provides brokerage services in Taiwan. The company operates through three segments: Brokerage Department, Investment Banking Department, and Proprietary Trading Department. It offers securities lending/borrowing services, such as margin trading and short sale for the trading of securities, securities-backed lending, and unrestricted purpose loans; stock-related custody settlement, IPO subscription, bid auction, and securities borrowing and lending services; futures introducing brokerage services; and other securities investment consulting services, as well as undertakes the trading of securities, including online, mobile, and telephone order placements. The company also trades in securities comprising listed stocks, funds, and bonds for own account; manages derivatives consisting of call warrants, and securities-related futures and options; plans and counsels IPO process; guides and plans listing process of shares; plans and evaluates raising of capital and corporate financing strategy; invests and trades in emerging stocks; and promotes investment and venture capital business. In addition, it engages in the convertible bond asset swap business; trading of corporate and financial bonds, and bond transactions, and electronic bond trading systems; and reverse auction of government bonds on primary market. Further, the company provides securities investment consulting services, including accepting consignment to offer research and analysis opinions or suggestions on securities investment related matters; accepting discretionary investment; issuing securities-related products; and organizing securities-related seminars. The company was incorporated in 1988 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.tachan.com.tw",
    "zipcode": "10351"
  },
  "6021.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Capital Markets",
    "long_name": "Ta Ching Securities Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "TA CHING SECURITIES CO",
    "state": null,
    "summary": "Ta Ching Securities Co., Ltd. provides securities services in Taiwan. The company engages in the general brokerage of market securities and self-financing securities, stock index futures, options, and foreign securities; and securities trading business. It is also involved in the provision of securities underwriting and issuing, and financial advisory services; and futures business. In addition, the company offers bond buyout and selling services; and bond investment advisory services. Ta Ching Securities Co., Ltd. was founded in 1988 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.tcstock.com.tw",
    "zipcode": null
  }
}
