{
  "1310.TW": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Chemicals",
    "long_name": "Taiwan Styrene Monomer Corporation",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "TAIWAN STYRENE MONOMER",
    "state": null,
    "summary": "Taiwan Styrene Monomer Corporation, together with its subsidiaries, produces and sells styrene monomer, para-diethyl benzene, toluene, and ethyl benzene in Taiwan. The company's products are used in electrical appliances, machines, electronics, automobile, packaging, and other industries. It primarily serves the manufacturers of polystyrene, ABS resins, and synthetic rubber. The company also offers building cleaning and maintenance, sewage treatment, air conditioning equipment maintenance, civil and construction engineering, residential building, hotel, investment, and piping engineering services. In addition, it provides industrial plant development rental services; manufactures chemical and plastic raw materials; sells and distributes LCD monitors; manufactures electric components; and offers educational, information, software, and data storage consulting services. The company was founded in 1979 and is headquartered in Taipei City, Taiwan.",
    "website": "http://www.smct.com.tw",
    "zipcode": "100"
  },
  "1312A.TW": {
    "city": "Kaohsiung",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Chemicals",
    "long_name": "Grand Pacific Petrochemical Corporation",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "GRAND PACIFIC PETROCHEMICAL",
    "state": null,
    "summary": "Grand Pacific Petrochemical Corporation produces and sells petrochemical, synthetic resin & plastic, and other chemical products in Taiwan. Its product portfolio includes styrene monomer, an intermediate that is used primarily in the manufacturing of polystyrene (PS) resin, acrylonitrile-butadiene-styrene (ABS) resin, styrene butadiene rubber, and unsaturated polyester; and ABS resins, which are used in automobile interior parts, luggage, pipeline and valve materials, toys, and 3C products, as well as for plastic housing of IT products, such as PC monitors, modems, and scanners. The company's products also comprise PS resins that are used in the manufacturing of food containers, toys, plastic cards materials, and 3C products; and styrene acrylonitrile (SAN) resins used for the case of cassettes, battery, and disposable lighters, as well as blades for electric fans and air conditioner parts. In addition, it offers GPPC GRAMiD Polyamide 6,6, a highly-crystalline straight-chain polycondensation polymer used in electronic, instrumentation, machinery, automotive components, home appliances, oil pipe, precision engineering products, textile, etc., as well as in sporting goods, daily necessities, the production of medical equipment, etc. The company was formerly known as Delta Petrochemical Corporation and changed its name to Grand Pacific Petrochemical Corporation in 1984. Grand Pacific Petrochemical Corporation was founded in 1973 and is headquartered in Kaohsiung, Taiwan.",
    "website": "http://www.gppc.com.tw",
    "zipcode": "81567"
  },
  "1313.TW": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Chemicals",
    "long_name": "UPC Technology Corporation",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "UPC TECHNOLOGY CO",
    "state": null,
    "summary": "UPC Technology Corporation, together with its subsidiaries, manufactures and sells petrochemical products in Taiwan, China, Southeast Asia, Japan, the Middle East, New Zealand, Australia, the United States, and Canada. It offers acids, phthalic and malic anhydride, plasticizers, unsaturated polyester resins, polyols, fatty esters, and other specialty chemicals for industrial applications. The company also engages in logistics, road transportation, warehouse storage, bulk chemical jetty operation, and tank farm activities. In addition, it is involved in investment and trading, and real estate management activities. The company was formerly known as Union Petrochemical Corp. and changed its name to UPC Technology Corporation in 2001. UPC Technology Corporation was founded in 1976 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.upc.com.tw",
    "zipcode": "115"
  },
  "1326.TW": {
    "city": "Changhua",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Chemicals",
    "long_name": "Formosa Chemicals & Fibre Corporation",
    "market": "tw_market",
    "market_cap": "Large Cap",
    "sector": "Basic Materials",
    "short_name": "FORMOSA CHEMICAL & FIBRE CO",
    "state": null,
    "summary": "Formosa Chemicals & Fibre Corporation produces and sells petrochemical products, nylon fibers, and rayon staple fibers in Taiwan, China, and internationally. It offers various petrochemical products, including benzene, para-xylene, ortho-xylene, meta-xylene, styrene monomer, phenol, acetone, purified terephthalic acid, and purified isophthalic acid; and plastic products comprising polystyrene, acrylonitrile butadiene styrene (ABS) resin, polypropylene resin, polycarbonate (PC) resin, PC/ABS alloy, SAN resin, and ASA resin. The company also provides viscose rayon staple fiber, sodium sulphate, nylon 6 chip, filament of clothing and industry, and fireproof cloth products, as well as flame retardant, mosaic, compact, slub, recycle, modal, siro, multi-blended, and ring spun yarns. In addition, it is involved in the spinning, dyeing, printing, finishing, and manufacturing synthetic fibre, rug, and carpet; investment activities; cogeneration and power generation business; manufacturing and sale of cleaner and cosmetics; removal and disposal of waste; importing, exporting, and wholesale of food products; research and development, assembly, testing, and processing of various integrated circuits; providing employment services and temporary worker services; and import, trade, export processing, warehousing, design, and drawing of black, white, and colour graphs. Formosa Chemicals & Fibre Corporation was founded in 1965 and is headquartered in Changhua, Taiwan.",
    "website": "http://www.fcfc.com.tw",
    "zipcode": "500"
  },
  "1708.TW": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Chemicals",
    "long_name": "Sesoda Corporation",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "SESODA CORPN",
    "state": null,
    "summary": "Sesoda Corporation manufactures and markets sulfate of potash (SOP) in Taiwan. The company offers standard, soluble, low chloride, granular, and industrial grade SOP products; and hydrochloric acid for use in acid washing in metallurgy and printed circuit boards, as well as manufacturing chloride chemicals and food processing. It also provides liquid calcium chloride for use in fluoride removal before waste water emission in the electronic and optoelectronic industries. In addition, the company trades in soda ash, sugar, sodium bicarbonate, sodium chloride, mixed calcium phosphate, solid calcium chloride, ammonium bicarbonate, and pearl luster pigment products. Further, it provides bulk shipping services through 6 vessels. Sesoda Corporation was founded in 1957 and is headquartered in Taipei City, Taiwan.",
    "website": "http://www.sesoda.com.tw",
    "zipcode": null
  },
  "1709.TW": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Chemicals",
    "long_name": "Formosan Union Chemical Corp.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "FORMOSAN UNION CHEMICAL",
    "state": null,
    "summary": "Formosan Union Chemical Corp. produces and sells chemical products in Taiwan. The company offers alkyl benzene, which is used as a raw material for detergents; nonyl phenol that is used as a basic raw material for surfactants, rubbers, plastic anti-oxidant agents, etc., as well as specialty chemicals; and hydrogenated hydrocarbon resin, which is used as a raw material for the production of ethylene-vinyl acetate polymer EVA and thermal plastic rubber TPR series hot melt adhesives. It also provides FuSyn-22, a synthetic alkylate that is used as a primary base oil or blend stock for various synthetic automotive and industrial applications. The company was founded in 1973 and is based in Taipei, Taiwan.",
    "website": "http://www.fucc.com.tw",
    "zipcode": null
  },
  "1714.TW": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Chemicals",
    "long_name": "Ho Tung Chemical Corp.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "HO TUNG CHEMICAL CORP",
    "state": null,
    "summary": "Ho Tung Chemical Corp. develops, manufactures, markets, exports, and sells various chemical products in Taiwan, China, Southeast Asia, and internationally. The company offers normal paraffin; linear alkyl benzene sulfonate produced as intermediate in the production of surfactants for use in detergent; anionic surfactants, including linear alkylbenzene sulphonic acid, alcohol ether sulfates or sodium laureth sulphate; and cationic surfactants, such as palmityl tri-methyl ammonium chloride, stearyl tri-methyl ammonium chloride, and alkyl dimethyl benzyl ammonium chloride. It also provides non-ionic surfactants comprising fatty alcohols, fatty alcohol ethoxylates, and coconut diethanol amide; cocamidopropyl betaine and dodecyl dimethyl betaine; and de-aromatic solvents used in paints and coatings, consumer products, printing inks, and agricultural chemical applications. In addition, the company engages in the trading of oil; warehousing of petrol, diesel, and chemicals; loading and unloading at wharves; wholesale and trading of chemicals and fuels; development, leasing, construction, and rental of residence and buildings; manufacture and sale of cement and cement raw materials, PMMA light guide plate, and various commodities; and development of new energy and surfactant. The company was founded in 1980 and is headquartered in New Taipei City, Taiwan.",
    "website": "http://www.htgroup.com.tw",
    "zipcode": "248"
  },
  "1721.TW": {
    "city": "Taichung City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Chemicals",
    "long_name": "Sunko Ink Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "SUNKO INK CO",
    "state": null,
    "summary": "Sunko Ink Co., Ltd. manufactures and sells flame retardants, elastomers, agrochemicals, electronic chemicals, polymer additives, polyurethane resins and top coating materials, and curing agents. The company was founded in 1974 and is headquartered in Taichung City, Taiwan.",
    "website": "http://www.sunko.com.tw",
    "zipcode": "412"
  },
  "1735.TW": {
    "city": "Nantou City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Chemicals",
    "long_name": "Evermore Chemical Industry Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "EVERMORE CHEMICAL INDUSRY CO",
    "state": null,
    "summary": "Evermore Chemical Industry Co., Ltd. produces and sells synthetic leather polyurethane (PU) resins in China, Taiwan, and internationally. The company offers solvent based PU components, thermoplastic PU components, PU adhesives, aqueous based PU dispersion, polyurethane system polyester, poly isocyanates cross-linking agent hardners, polyester polyol components, and UV Monomer/Oligomer, etc. It serves various industries, such as footwear, synthetic leather, optical electronics, textiles, adhesives, coating, paints and ink, tube and hose, optical glass, etc. The company was founded in 1989 and is based in Nantou, Taiwan. Evermore Chemical Industry Co., Ltd. is a subsidiary of Aica Kogyo Company, Limited.",
    "website": "http://www.twemc.com",
    "zipcode": "54066"
  },
  "1773.TW": {
    "city": "Kaohsiung",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Chemicals",
    "long_name": "Shiny Chemical Industrial Company Limited",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "SHINY CHEMICAL INDUSTRIAL CO. L",
    "state": null,
    "summary": "Shiny Chemical Industrial Company Limited manufactures and sells electronic and industrial solvents in Taiwan. The company's electronic solvents include menthyl acetates, ether alcohol esters, other solvents, and customized products; and industrial solvents comprise menthyl acetates, ether ester products, and other solvents. It also provides fumalin and urea glue; and leases storage tanks. The company was founded in 1979 and is based in Kaohsiung, Taiwan.",
    "website": "http://www.shinychem.com.tw",
    "zipcode": "82841"
  },
  "1776.TW": {
    "city": "Hsinchu City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Chemicals",
    "long_name": "Headway Advanced Materials Inc.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "HEADWAY ADVANCED MATERIALS INC",
    "state": null,
    "summary": "Headway Advanced Materials Inc. manufactures and sells polyurethane resin and thermoplastic polyurethane pellet products in the Asia-Pacific region. The company provides products, such as solvent and water borne polyurethane, solvent free PU, polyisocynate hardner, polyol, thermoplastic polyurethane (TPU), and others. Its products are used in various applications, such as textile, leather, furniture, footwear, building materials, electronics, food packing, transportation, medical care, and other industries. Headway Advanced Materials, Inc. was founded in 1976 and is based in Hsinchu City, Taiwan.",
    "website": "http://www.headway.com.tw",
    "zipcode": "303"
  },
  "3678.TWO": {
    "city": "Zhubei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Chemicals",
    "long_name": "Ushine Photonics Corporation",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "Ushine",
    "state": null,
    "summary": "Ushine Photonics Corporation produces and supplies indium tin oxide (ITO) film products. The company offers ITO-films for resistive touch panels and projective capacitive touch panels; low resistivity TCO-films; optical clear adhesives; and anti-static protective films, as well as converting services. Its products are used in touch panels, flexible displays, flexible solar cells, and other products. The company was founded in 2001 and is based in Zhubei City, Taiwan.",
    "website": "http://www.ushine.com.tw",
    "zipcode": "302"
  },
  "6729.TWO": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Chemicals",
    "long_name": "Luminescence Technology Corp.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "Lumtec",
    "state": null,
    "summary": "Luminescence Technology Corp. manufactures and sells organic chemicals in North America, Europe, Asia, and Taiwan. Its product-range includes organic light emitting diode (OLED) material, OPV material, OTFT material, organic intermediates, boronic acid, and ITO patterned glass and components. The company offers patented materials, biomedical science, organic light emitting diode (OLED), thermally activated delayed fluorescence OLED, solution-processed OLED, organic photovoltaic, dye-sensitized solar cell, perovskite solar cells, organic thin-film transistor, flexible printed electronics, photonic and optical device, synthetic intermediates and reagents, and electrode/substrate and sealing. It offers organic optoelectronic materials in the markets of OLED, OPV, and OTFT have led luminescence technology. Luminescence Technology Corp. is headquartered in New Taipei City, Taiwan.",
    "website": "http://www.lumtec.com.tw",
    "zipcode": "22175"
  },
  "8435.TWO": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Chemicals",
    "long_name": "Zimmite Taiwan Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "ZIMMITE TAIWAN LTD",
    "state": null,
    "summary": "Zimmite Taiwan Ltd. engages in the industrial water treatment activities in Taiwan and China. It offers cooling water treatment agents, such as corrosion inhibitors, scale inhibitors, algaecides, biocides, rust removers, and cooling water all-in-one tablets; and boiler water treatment agents, including internal treatment additives, oxygen scavengers, neutralizing amines, and filming amines. The company also provides boiler fireside treatment additives comprising fuel oil additives and soot removers; and oil refinery and petrochemical process additives consisting of corrosion inhibitors, antifoulants, desalting agents, demulsifiersemulsion breakers, antifoamers/defoamers, metal passivating agents, polymerization inhibitors, and antioxidants. In addition, it offers wastewater treatment agents, including polymer flocculants, dewatering aids, heavy metal chelators, deodorants, and COD degradation agents; slow release tablets, such as cooling water treatment tablets, drain pan slime preventive tablets, and chlorine donors; and RO and scrubber chemicals. Further, the company provides environmental protection testing and technical services; water treatment technology supports; and oil mud dispersants, as well as sells water treatment raw materials. It primarily serves oil refineries and petrochemicals production plants, steel mills, power generation plants, office buildings, textile manufacturing processes, plastic manufacturing plants and processors, electronic manufacturing sector, and public facilities. Zimmite Taiwan Ltd. was founded in 1977 and is headquartered in New Taipei City, Taiwan.",
    "website": "http://www.zimmite.com",
    "zipcode": null
  },
  "8438.TWO": {
    "city": "Taoyuan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Chemicals",
    "long_name": "Amia Co.,Ltd",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "AMIA",
    "state": null,
    "summary": "Amia Co.,Ltd manufactures and sells copper sulfate in Taiwan. It also offers oxides and carbonates. The company also exports its products. Amia Co.,Ltd was founded in 1974 and is based in Taoyuan City, Taiwan.",
    "website": "http://www.persee.com.tw",
    "zipcode": "337"
  }
}
