{
    "1471.TW": {
        "short_name": "SOLYTECH ENTERPRISE CORPORATION",
        "long_name": "Solytech Enterprise Corporation",
        "summary": "Solytech Enterprise Corporation manufactures and sells switching power supplies and PC enclosures in Taiwan and internationally. It offers ODM services comprising gaming chairs; chassis, such as gaming, microATX, slim microATX, mini-ITX, ATX cases, and rackmount chassis; power cords and adapters for RV camp power, marine, and generator use. The company was founded in 1982 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "2301.TW": {
        "short_name": "LITE-ON TECHNOLOGY CORP",
        "long_name": "Lite-On Technology Corporation",
        "summary": "Lite-On Technology Corporation manufactures and markets computer software, hardware, peripherals, and components in Asia and internationally. It also offers monitors, multifunction and all-in-one printers, cameras, and Internet systems and image-processing equipment; information storage and processing equipment, electronic components, and office equipment; electronic coils, transformers, power suppliers, and electronic hardware parts; light-emitting diode products; electronic car products; and optical lens modules and optoelectronic components. In addition, it manufactures and sells medical equipment; photovoltaic devices, electronic components, telecommunications equipment, information technology equipment, semiconductor applications, general lighting, automotive electronics, and renewable energy products and systems; LED optical products; power supplies; image sensors and rectifiers; keyboards, display devices, printers, scanners, and computer cases; system products; mobile terminal equipment; mobile phone molds and assembly lines; power control and energy management products; plastic and computer peripheral products; optical disc drives; modules of automotive recorders; touch panels and rubber assembly products; maintenance equipment and precision instruments; and other electronic components. Further, the company engages in the wholesale, import and export, and installation of street and signal lights, scenery lights, and electronic components; and provision of technology consulting, market research and after-sales, energy technology, ODM, and automotive industry maintenance services. Additionally, it is involved in the electronic contract manufacturing; investment; solar energy engineering; and information outsourcing activities, as well as real estate management business. The company was founded in 1975 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "2312.TW": {
        "short_name": "KINPO ELECTRONICS",
        "long_name": "Kinpo Electronics, Inc.",
        "summary": "Kinpo Electronics, Inc. designs, manufactures, assembles, purchases, and sells consumer electronics, communication, computing, and data storage products worldwide. The company offers 3D printer product lines; storage products; network attached storage products; printer modules and fax machines; wireless and broadband products; set-top-boxes; all-in-one PC and motherboards; formatters, color laser MFPs, laser scan units, and laser printer controllers; and calculators, electronic keyboards, e-dictionaries, gaming mouse and BT joysticks, GPS and GPS modules, auto floor cleaners, photo printers, e-books and tablets, and pachinko displays. It also provides home automation, smartwatch and ring, and fingerprint sensor products; PCBAs for cameras and AV products; LED outdoor and indoor lighting products; PC, server, and storage power supplies, as well as AC/DC adapters, and DC/DC and AC/DC converters; smart grid enabling products and smart power meters; controllers for air condition systems and industrial HVAC boards; automotive body control boards and lightings; and bank teller vault protection systems and high voltage power distribution modules. In addition, the company offers surgical detection systems; green oak leaf, butterhead, green leaf, romaine, red oak leaf, coriander, ice plant, arugula, bughatti oak, and veredes oak; chassis for ATM and gaming machines; plastic parts for printers and plotters, automated chip assembly and medical product parts, and ink cartridges; and precision components. Kinpo Electronics, Inc. was founded in 1973 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "2323.TW": {
        "short_name": "CMC MAGNETICS CORP",
        "long_name": "CMC Magnetics Corporation",
        "summary": "CMC Magnetics Corporation manufactures and distributes optical discs for use in media, electronics, retail, cosmetics, food, liquor, toy, and publishing industries worldwide. It offers DVDs, CDs, and inkjet and thermal printable surface media products; custom packaging solutions, including original CD jewel boxes, CMC slim jewel cases, standard DVD boxes, slim DVD boxes, Blu Ray size DVD boxes, and cake boxes. The company also provides optical media products; and a range of packaging, printing, and sourcing services. In addition, the company engages in film production and distribution; lifestyle retail; property development; food and beverage business; internet service; car rental carrier; digital information supply and general advertising; and general investing business. Further, it manufactures and sells thin film solar cells and solar energy products; cloth dyeing and various textiles; and plastic boxes, cases, baskets, and similar products. The company was founded in 1978 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "2347.TW": {
        "short_name": "SYNNEX TECHNOLOGY INTERNATIONAL",
        "long_name": "Synnex Technology International Corporation",
        "summary": "Synnex Technology International Corporation distributes communication, information, computers and computer peripherals, electronic components, and consumer electronic products. It is also involved in the real estate investment; and assembly and sale of computers and computer peripherals. It also offers warehouse and logistics services; and maintenance and technical services. The company operates in Taiwan, China, Hong Kong, Australia, New Zealand, and Indonesia. Synnex Technology International Corporation was founded in 1988 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "2349.TW": {
        "short_name": "RITEK CORP",
        "long_name": "RITEK Corporation",
        "summary": "RITEK Corporation manufactures and markets optical storage media products worldwide. The company offers storage media product lines, including optical storage media comprising CDs, DVDs, and Blu-ray discs; electronic storage media, which include flash memory cards, USB flash drives, portable hard disc drives, solid state drives, and others. It also provides solar modules comprising mono and poly-crystalline solar modules; and integrating solar systems; OLED display panels, ITO glasses, and patterned sapphire substrate solutions; metal masks; and biological detection discs. RITEK Corporation was founded in 1988 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "2352.TW": {
        "short_name": "QISDA CORPORATION",
        "long_name": "Qisda Corporation",
        "summary": "Qisda Corporation provides ODM/OEM services for electronic products and hardware-software integration for consumer, commercial, industrial, and medical and lifestyle applications Taiwan, the Americas, Mainland China, Poland, Japan, Switzerland, and internationally. It operates through four segments: Brand, Material, Medical, and Design and Manufacturing Service. The company designs, engineers, and manufactures display products, such as LCD monitors, multifunction monitors, all-in-one PCs, broadcasting and medical monitors, graphic and security displays, sign pads, industrial monitors, digital signage displays, digital signage stations, AIO signage products, and interactive e-boards, as well as open frames for gaming/vertical markets. It also offers opto-mechatronics products comprising data, video, short throw, and interactive projectors, as well as IP cameras; imaging devices, including scanners, and multifunctional and color laser printers; mobile communications devices consisting of 4G cameras, projectors, smartphones, industrial and commercial tablets, and mobile POS products; and professional services, which include wireless design, integration, and carrier certification. In addition, the company provides automobile infotainment devices comprising audio/video/navigation systems, infotainment media boxes, automotive displays, automotive BT/WLAN/2G/3G/4G modules, and telemetic communication units; healthcare solutions, such as diagnostic ultrasound, telecare, hemodialyzer, CRRT machine, and IOS equipment; IA solutions, including receipt printers, label printers, currency detectors, POS terminals, and mobile POS and AGV products; and smart solutions and hardware equipment for smart retail, manufacturing, energy, enterprise, school, and healthcare domains. Qisda Corporation was founded in 1984 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "2353.TW": {
        "short_name": "ACER INC",
        "long_name": "Acer Incorporated",
        "summary": "Acer Incorporated researches, designs, markets, and services personal computers (PCs), information technology (IT) products, and tablet products in the United States, Mainland China, Taiwan, and internationally. The company offers notebook and desktop PCs, LCD monitors, projectors, servers, gaming products, gadgets, mixed reality devices, cloud services and edge-computing devices, e-business and services, and digital signage solutions. It also provides electronic information, insurance captive, cloud technology, professional seminars and courses, system development and integration, property development, software defined storage, online payment, technical, social networking, cyber security, data center, and real estate services; cloud ticketing systems and electronic books; intelligent transportation and electronic ticketing programs and services; and investment funds. In addition, the company repairs and maintains IT products; researches, designs, and develops Internet of Things platform; sells communication products; operates platform for client service and products sale; and develops Internet of Beings and cloud technology; integrates cloud technology, software, and hardware. Further, it researches, develops, and sells batteries and smart bicycle speedometers; sells commercial and cloud application software and services; and designs, develops, and sells computer software and hardware, as well as provides B2B virtual reality and advisory related services. Acer Incorporated was founded in 1976 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "2354.TW": {
        "short_name": "FOXCONN TECH CO",
        "long_name": "Foxconn Technology Co., Ltd.",
        "summary": "Foxconn Technology Co., Ltd. produces and sells metal casings, parts, and components. It offers hand-held device casings and related components of devices, including feature phones, smart phones, laptops, tablet computers, consumer electronics, and digital cameras. The company also produces and sells metal parts and related machine components for automobiles and electric vehicles; thermal modules for system products, such as desktop computers, laptops, tablet computers, servers, smart phones, and game consoles; MIM related products; and consumer electronics components, as well as assembles and sells consumer electronics. In addition, it offers portable computer enclosures, mobile phone enclosures, and 3C product enclosures, as well as alloy products. Further, the company is involved in the research, development, manufacture, and sale of computer thermal module, computer components, and aluminum magnesium cases; investment and reinvestment activities; processing electrical board components; and manufacture and marketing of optoelectronics and computer cables, LED lamps and displays, smart light poles and others, computer cases, new alloy material, precision molds, electronic components, and portable computers and its components. Additionally, it researches, develops, produces, and sells aluminum alloy materials, rail vehicle components, car accessories, electronic components, structured metal products, metal containers, automobile parts, power plugs, wall sockets, micro ribbon connectors for terminals, etc., as well as aluminum alloy parts for automobiles and electronics. The company was founded in 1979 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "2356.TW": {
        "short_name": "INVENTEC CORP",
        "long_name": "Inventec Corporation",
        "summary": "Inventec Corporation, together with its subsidiaries, develops, manufactures, processes, and trades in computers and related products in Taiwan, the United States, Japan, Hong Kong, Macao, Mainland China, and internationally. The company operates through Core Department and Solar Energy Department segments. It offers personal computing products, including notebook PC, desktop/AIO, and thin client. The company also provides enterprise system solutions, such as servers, blade servers, network switches, storage equipment, and rack solutions, as well as server management software; smart devices, which include smart hand-held products, portable automatic navigation devices, media players, video and imaging products, and wearable devices; solar battery products; networking solutions; electronic materials and products; and Business management services. In addition, it is also involved in the provision of wireless terminal products; assembly and sale of computer products; equipment leasing, storage, and technological development and sale of computers; provision of marketing promotion, customer information, telecommunication research; and house leasing businesses management services. Inventec Corporation was founded in 1975 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "2357.TW": {
        "short_name": "ASUSTEK COMPUTER INC",
        "long_name": "ASUSTeK Computer Inc.",
        "summary": "ASUSTeK Computer Inc. researches and develops, designs, manufactures, sells, and repairs computers, communications, and consumer electronic products (3C) in Taiwan, China, Singapore, the United States, Europe, and internationally. The company offers phones and accessories, such as power banks, and adapters and cables; gaming products; laptops and two-in-one personal computers (PCs); desktop, tower, mini, stick, and all-in-one PCs, as well as chrome devices; motherboards, single-board computers, and chassis and cooling products; monitors and projectors; headphones and headsets, and sound cards; mesh WiFi systems, wireless routers and adapters, and wired networking products; and graphic cards, as well as business wireless routers and gaming router home products. It also provides computer bags, keyboards and mice, and mouse pads; optical drives and storage products comprising internal and external Blu-rays, and external and internal DVDs; and servers, server motherboards, workstations, and workstation motherboards. Further, it offers Internet information services; maintenance and operating services for information hardware; services information technology and communication products; and leases real estate property. Additionally, the company provides ink-jet print heads and digital image output technology, high-speed analog circuits, integrated circuits, industrial and medical computers, interface cards, and medical robots; invests in computer peripheral, Internet service, and automotive electronics businesses; and researches, develops, sells, and consults information system software; provides marketing support and repair services for medical computers and peripherals. ASUSTeK Computer Inc. was founded in 1989 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "2362.TW": {
        "short_name": "CLEVO CO",
        "long_name": "Clevo Co.",
        "summary": "Clevo Co., an ODM/OEM manufacturer, provides hardware solutions for notebooks, tablets, and all-in-one PCs worldwide. It offers products for gaming, entertainment, mobility, and productivity applications. The company was founded in 1983 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "2364.TW": {
        "short_name": "TWINHEAD INTERNATIONAL CORP",
        "long_name": "Twinhead International Corp.",
        "summary": "Twinhead International Corp. provides rugged notebooks, rugged tablets, embedded solutions, and vehicle mount computers worldwide. It offers mobile computers; rugged tablet PCs; semi-rugged mobile computers; mobile thin clients; medical tablet PCs; and other customized mother boards/systems. The company also provides ODM, and partial or full customization services; project management services; manufacturing services comprising fully rugged product and special feature validations, flexible production system, supply chain management, and purchasing models; and certification application services. It serves government, military, health care, field sales/insurance, public safety, retail, hospitality, transportation/distribution, utilities/oil and gas, communication, agriculture, and field service industries. Twinhead International Corp. was founded in 1984 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "2365.TW": {
        "short_name": "KYE SYSTEM CORP",
        "long_name": "KYE Systems Corp.",
        "summary": "KYE Systems Corp. provides computer and mobile device peripherals. It offers mouse, keyboards, stylus, headphones, speakers, digital cameras, headsets, and e-sports peripherals. The company was founded in 1983 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "2376.TW": {
        "short_name": "GIGA-BYTE TECHNOLOGY CO",
        "long_name": "Giga-Byte Technology Co., Ltd.",
        "summary": "Giga-Byte Technology Co., Ltd., together with its subsidiaries, processes, manufactures, trades in, and sells computer peripherals and component parts in Taiwan, Europe, the United States, Canada, China, and internationally. It operates through Global Brand Business Group and Other Business Group segments. The company offers mother boards, graphic cards, laptops, desktop PCs and monitors, network storage products, and network devices and wireless communication products. It also provides PC peripherals, such as keyboards, mouse, gaming gears, speakers, headsets, external storage enclosures, TV tuner dongles, and USB chargers; and PC components comprising chassis, power supply products, solid state drives, and memory products, as well as thermal solutions. In addition, the company offers server mother boards, rack and tower servers, computing systems, high performing computing systems, ARM and storage servers, embedded computing products, and accessories; and notebooks, communication and ODM products, electronic components and parts, mold and industrial plastic products, and bicycle and parts. Further, it provides repair services for computer information products; engages in venture capital management and consulting business; and wholesales information software. Giga-Byte Technology Co., Ltd. was founded in 1986 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "2380.TW": {
        "short_name": "AVISION INC",
        "long_name": "Avision Inc.",
        "summary": "Avision Inc. designs, manufactures, and markets a variety of scanners and key components for multi-function products worldwide. The company offers document, flatbed, network, and intelligent/portable scanners, as well as multi-function peripherals and paper air series. Avision Inc. was founded in 1991 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "2385.TW": {
        "short_name": "CHICONY ELECTRONICS",
        "long_name": "Chicony Electronics Co., Ltd.",
        "summary": "Chicony Electronics Co., Ltd. manufactures and sells keyboards and other computer peripheral components in Taiwan and internationally. It offers input devices, including ergonomic, wired entry, wired multimedia, 2.4G wireless combo, Bluetooth, and smart card keyboards; mobile keyboards; and camera modules. The company also provides video image products, such as action cams, dash cams, outdoor IP cams, and zoom camcorders, as well as wearable cams and porch IP cams; and automotive electronic, such as image systems and LED lighting products. In addition, it manufactures sells switching power supplies and other electronic parts; researches, manufactures, and sells DSL bridges and routers; Internet solution for E-Commerce solution; production and sells automotive and motorcycle components, electric machine and device, lamps, and plastic products; researches and develops, manufactures, sells, and installs electric machinery, electric frequency device, and industry automation equipment, as well as offers aftersale and advisory services; manufactures and sells electrical machinery and components; and imports and exports goods. Chicony Electronics Co., Ltd. was founded in 1983 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "2387.TW": {
        "short_name": "SUNREX TECHNOLOGY",
        "long_name": "Sunrex Technology Corporation",
        "summary": "Sunrex Technology Corporation manufactures and sells laptop computer keyboards worldwide. It is also involved in the research and development of various human interface devices, including keyboards/mice for desktop computers, writing tablets, and presentation devices; and production of tablet computers and AIO-related peripheral products. In addition, the company offers wireless keyboard and mouse, HTPC multimedia keyboards, leather casing keyboards for tablet computers, touch controlled keyboards, gaming keyboards, and mice, as well as 3D air keyboards and mice. Sunrex Technology Corporation was founded in 1975 and is headquartered in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "2399.TW": {
        "short_name": "BIOSTAR MICROTEC INTL",
        "long_name": "Biostar Microtech International Corp.",
        "summary": "Biostar Microtech International Corp. engages in the design, manufacture, and sale of add-on cards, and multi-media and system products in Taiwan and internationally. The company offers motherboards, SSD and SOC products, mini PCs, keyboards/mice, VGA and IPC products, crypto mining motherboards and accessories, graphics cards, industrial computing systems, and IoT products, as well as healthcare solutions. It also provides accessories, such as cables, headsets, brackets, dongles, power cables, bridges, IO shields, and other products. The company was founded in 1986 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "2405.TW": {
        "short_name": "SHUTTLE INC",
        "long_name": "Shuttle Inc.",
        "summary": "Shuttle Inc. designs and manufactures small form factor computers and accessories worldwide. It offers XPC computers consisting of consumer and commercial products, including cube mini-towers, slim, nano, and all-in-one PCs, as well as digital signage media players, notebook computers, and tablets. The company also provides software development services for digital education and home automation applications; SMARTVILLE smart living solutions; original design manufacturer products, such as notebooks, 2-in-1 devices, tablets, etc.; and HOCA, a digital management system designed for in-home-care service for seniors. In addition, it operates EDUPAL, a paperless online learning platform that offers curriculum writing and assessments. Shuttle Inc. was founded in 1983 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "2406.TW": {
        "short_name": "GIGASTORAGE CORP",
        "long_name": "Gigastorage Corporation",
        "summary": "Gigastorage Corporation operates in the optoelectronics industry in Taiwan. It manufactures photovoltaic (PV) multi-crystalline wafers; and researches, develops, and manufactures PV ribbons, as well as provides PV modules. The company also develops low-temp die attach paste for use in the packaging process for the electronics; and energy industries, including LED, thin-film-base PV cells, T/P, passive component termination, etc. In addition, it offers biotech materials, such as blood glucose strip conductive Ag paste and carbon paste. Further, the company provides PV systems comprising system construction and electric power selling services that consist of evaluation, suggestion, design, application, bid tendering in Bureau of Energy, manufacturing, facility registration, etc. Additionally, it offers ground type solar power stations, as well as roof type solar power stations for private houses, public-owned buildings and factory buildings, and cottages. The company also provides PCB/BGA milling cutter and drill coating products, such as coated milling cutters and drills. Gigastorage Corporation was founded in 1997 and is based in Hukou, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hukou"
    },
    "2417.TW": {
        "short_name": "AVERMEDIA TECHNOLOGIES INC",
        "long_name": "AVerMedia Technologies, Inc.",
        "summary": "AVerMedia Technologies, Inc. designs, manufactures, and markets multimedia, Internet TV, and consumer electronic products worldwide. It provides PC, tablet, and mobile TV-viewing solutions, as well as high-definition video and real-time audio-visual products. The company also offers software development kit, frame grabber, video test equipment, audio and video doorbell, and encoder. In addition, it designs carrier boards, embedded systems, and application-ready platforms. The company's products are applied in gaming and live streaming, education, and business applications. AVerMedia Technologies, Inc. was founded in 1990 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "2465.TW": {
        "short_name": "LEADTEK RESEARCH",
        "long_name": "Leadtek Research Inc.",
        "summary": "Leadtek Research Inc. develops, manufactures, and sells graphics cards worldwide. The company offers virtual desktop systems, including zero and thin clients, management console, hardware accelerator, and remote workstation card; graphics cards; professional graphics; AI and performance computing, including development kits, virtualization, AI deep learning systems, and data center accelerator; and workstation and servers. It also provides computer and medical products; and global positioning system (GPS) products comprising GPS smart antennas and industrial OEM modules. The company was founded in 1986 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "2480.TW": {
        "short_name": "STARK TECHNOLOGY",
        "long_name": "Stark Technology, Inc.",
        "summary": "Stark Technology, Inc. provides system integration services for information and communication technology products in Taiwan. It offers systems integration services in the areas of infrastructure, peripheral, enterprise network, application software, and telecom, as well as professional, implementation, and consulting and maintenance services. The company also provides information security services, such as network and content security; and services for enterprise, hi-tech, FSI, telecom, and public sector industrial applications. It serves customers in financial services, education and research, high tech manufacturing, electronics, communications, transportation and automotive, healthcare and hospitality, and other industries, as well as to the government. The company was founded in 1993 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "3005.TW": {
        "short_name": "GETAC TECHNOLOGY CORPORATION",
        "long_name": "Getac Technology Corporation",
        "summary": "Getac Technology Corporation, together with its subsidiaries, engages in the research, development, manufacture, and sale of various information products in China, the United States, Europe, and internationally. The company provides notebooks, printer and its components, DVDs, cell phones, digital cameras, PCBs, personal computers, communication equipment, automobile electronic devices, precision punching dies, casting/forging raw parts for automobiles and motorcycles, and magnesium alloy castings, as well as wholesales and retails data management, software, electronic equipment, and mold related and e-communication products. It also offers various mechanical solutions, such as engineering design, prototyping and pilot run, tooling, and mass production and assembly services of plastic and metal stamping parts and modules; aluminum alloy and magnesium alloy automotive die-cast parts; and fasteners for aerospace and high-end industrial applications. In addition, the company provides repair and maintenance, and technical services for computers and related products; sells smart mobile surveillance solutions; and sells and repairs computers and its peripherals, commercial portable global positioning systems, electronic parts, mold equipment, and office equipment, as well as produces components for airplane and engine use. Further, it operates as an agency of domestic/foreign freight transport and import/export declaration, and import/export trade. Its products are used in military and industrial computer system applications. The company was formerly known as MiTAC Technology Corporation and changed its name to Getac Technology Corporation in 2009. Getac Technology Corporation was founded in 1989 and is headquartered in Hsinchu, Taiwan. Getac Technology Corporation operates as a subsidiary of MiTAC-SYNNEX Group.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "3013.TW": {
        "short_name": "CHENMING ELECTRONIC TECHNOLOGY ",
        "long_name": "Chenming Electronic Technology Corporation",
        "summary": "Chenming Electronic Technology Corporation, an OEM/ODM manufacturer, engages in the production and sale of computer and server chassis, mobile device components, and related components. The company also produces desktop, server, and notebook subsystems; and metal injection molding products. Its products are used for the assembly and protection of desktop PCs, handheld devices, and servers. The company was formerly known as Chenming Mold Ind. Corp. and changed its name to Chenming Electronic Technology Corporation in January 2020. Chenming Electronic Technology Corporation was founded in 1970 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "3021.TW": {
        "short_name": "WELLTEND TECHNOLOGY CORPORATION",
        "long_name": "Welltend Technology Corporation",
        "summary": "Welltend Technology Corporation manufactures and sells cables and connectors in Taiwan and internationally. The company also offers information system integration and consulting services. In addition, it provides life science and technology products, and life style shaping. Welltend Technology Corporation was founded in 1973 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "3046.TW": {
        "short_name": "AOPEN INC",
        "long_name": "Aopen Inc.",
        "summary": "Aopen Inc., a technology company, provides digital signage and artificial intelligence (AI) of things technologies worldwide. The company offers digital engines and chromebox products; eTILE series for commercial use; and Chromebase, a multi-media display, as well as media player, visual computing engine, and wall station products. It also provides various accessories, such as floor and table stands, wall mounts, and others; and meldCX platform that offers web-based application programming interface. The company's products are used in digital signage, kiosk and self-services, visitor sign in, point of sale, room and building control, smart vending, surveillance, and machine learning and AI applications. It serves retail, enterprise, healthcare, government, and hospitality sectors. The company was founded in 1996 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3231.TW": {
        "short_name": "WISTRON CORPORATION",
        "long_name": "Wistron Corporation",
        "summary": "Wistron Corporation, together with its subsidiaries, provides design, manufacturing, testing, and after-sales service for information and communication technology products. The company engages in the research, development, design, manufacture, testing, and sale of desktop computers, notebook computers, motherboards, servers, system platforms, high-speed and multi-function multiple-CPU computer systems, multi-media computers, network computers, consumer-type computers and special computers, microprocessors, CD-ROMs, PDAs, panel PCs, pocket computers and interface cards. The company also offers video and Internet telephones, video conferencing equipment, and telecommunication equipment; digital satellite TV receivers, set-top boxes, digital video decoders, and multi-media appliance products; digital cameras, CD-ROM drives, and DVD-ROM drives; wireless receiver products comprising mobile phones, wireless LAN cards, and Bluetooth communication modules; and LCD TVs and other electronic audio and visual products. In addition, it is designs and merchandises computer software and programs; recycles electronic waste; and offers in vitro diagnostic devices, physiological signal diagnostic devices, and medical date systems. Further, the company is involved in the manufacturing, processing, and selling of electronic products for automobiles; maintenance and cleaning of electronics products; and import and export trade operations. It operates in the United States, China, Europe, and internationally. The company was founded in 2001 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "3406.TW": {
        "short_name": "GENIUS ELECTRONIC OPTICAL CO.LT",
        "long_name": "Genius Electronic Optical Co., Ltd.",
        "summary": "Genius Electronic Optical Co., Ltd., an optical technology company, designs, develops, and supplies lenses in Taiwan. It offers mobile lenses; and VR/AR and automotive optics. The company was founded in 1989 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "3494.TW": {
        "short_name": "HITI DIGITAL INC.",
        "long_name": "HiTi Digital, Inc.",
        "summary": "HiTi Digital, Inc. designs, manufactures, and supplies digital photo products and services in Taiwan and internationally. The company offers industrial, commercial, and consumer photo printers; card printers; order station/operation console products; print kit/consumables; and printer accessories. It also provides professional image software designed for passport/ID photo format. The company was formerly known as Hi-Touch Imaging Technologies Co., Ltd. and changed its name to HiTi Digital, Inc. in 2007. HiTi Digital, Inc. was founded in 2001 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3515.TW": {
        "short_name": "ASROCK INCORPORATION",
        "long_name": "ASRock Inc.",
        "summary": "ASRock Inc. primarily manufactures and sells motherboards in Taiwan and internationally. It also offers graphics cards, networking products, mini and industrial PCs, and server/WS products. The company was founded in 2002 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "3535.TW": {
        "short_name": "FAVITE INC.",
        "long_name": "Favite, Inc.",
        "summary": "Favite Inc. develops and manufactures automatic optical inspection and measurement equipment. It offers FPD products, such as TFT arrays and cells, color filters, PDP, OLED, masks, LTPS, 3D lens, and touch panels; solar cells, including AOI; PCB products comprising BGA PCB AOI machines; semi-conductors consisting of automated OM stations, thick dielectric film thickness monitors, wafer AVI machines, and wafer 2D_3D bumping inspection systems; and epaper AOI and marking systems. The company also provides RFID inlays, reader modules, fixed and handheld reader, and antennas; UHF security and laundry labels, and metal tags; access control readers; and label OEM/ODM manufacturing services. Favite Inc. was founded in 2000 and is headquartered in Zhubei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Zhubei"
    },
    "3665.TW": {
        "short_name": "BIZLINK HOLDING INC",
        "long_name": "Bizlink Holding Inc.",
        "summary": "Bizlink Holding Inc. researches, designs, develops, manufactures, and sells various technological products and components for various technology industries in the United States, China, Germany and internationally. It operates through Computer Related Products, Fiber Optics, Home Appliances, and Others segments. The company provides adapters, high-speed cables, power whips and cables, connectors, modules, hubs and docks, and dongles; and cable storage, integration of electrical and mechanical parts, and over molding of fixings and mountings for cable harnesses, textile braided cable for harness systems, complex wire harnesses, and systems and customized solutions, as well as power cords, wire harness, and wires and cables. It also offers towline, micro coaxial, photoelectric hybrid, drag chain, phase, defibrillation, and USB extender cables, as well as optical fiber patchcord, thermistor detector, and medical raw wire for medical equipment; and transceivers, ultra-compact and high isolation WDM, coupler/PLC, optical switch/VOA, circulator/isolator/hybrid, high density module, and HDMI/DP/USB optical cables for optical fiber communications. In addition, the company provides cables for automation and semiconductor equipment, and subway projects, as well as wire harnesses for oil and gas equipment, and passenger aviation; and solar energy connectivity solutions, including junction boxes, DC branch cables, connectors, and PV cables. Further, it provides battery management system and TVSH harnesses, charging systems and accessories, main harnesses, and automotive wires. Additionally, it engages in the wholesale and retail of cable assemblies, power cords, and connectors, as well as computer peripheral products, electronic materials, fiber optical passive components, and fiber optical cables; and produces and sells fiberfill moldings, smart instrumentational sensors, connectors, and functional materials. The company was founded in 1996 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3706.TW": {
        "short_name": "MITAC HOLDINGS CORPORATION",
        "long_name": "MiTAC Holdings Corporation",
        "summary": "MiTAC Holdings Corporation, through its subsidiaries, designs, manufactures, and sells computers and ancillary equipment, and communication related products. The company offers computer frames, motherboards, interface cards, displays, power supplies, keyboards, and related metal stamping and plastic parts, as well as provides maintenance services for motherboards. It is also involved in the research, development, and manufacture of computer software, and provision of related technical advisory services; and research and development of calculators, servers, mobile phones, and PDA and GPS products, as well as provision of technical transfer and advisory services. In addition, the company sells electronic telecommunication products, and communication and software products, as well as offers related after-sale services; and assembles and sells computer peripherals, hardware/software, and related products. Further, it engages in the testing, maintenance, and display of computers, computer components, communication products, and consumer electronic products, as well as provision of related technical advisory and after-sale services; and general investment activities. Additionally, the company offers freight transport agency, export and import trading, and warehousing services; customer data processing, analysis, and integrated services; and business administration services. It operates in Taiwan, the United States, Europe, and internationally. MiTAC Holdings Corporation was founded in 1982 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "4916.TW": {
        "short_name": "PARPRO CORPORATION",
        "long_name": "Parpro Corporation",
        "summary": "Parpro Corporation provides design and manufacturing services for processor based embedded solutions to original equipment manufacturers in Europe and the United States. It offers switching platforms, multi-core processor cards and blades; embedded hardware system design services; schematic capture and PCB layout design services for hardware development solutions; mechanical design services; and firmware design services. The company also provides wire harness and cable assembly; sheet metal fabrication and finishing; precision machining; subsystem assembly and integration; and box build, kiosk, and rack services. It serves customers in the aerospace, gaming, telecommunication, and industrial markets. The company was formerly known as Pilot Electronics Corporation. Parpro Corporation was founded in 2001 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "4938.TW": {
        "short_name": "PEGATRON CORPORATION",
        "long_name": "Pegatron Corporation",
        "summary": "Pegatron Corporation, together with its subsidiaries, engages in designing, manufacturing, and selling computer, communication, and consumer electronic products worldwide. It offers computing products, such as notebooks, desktops, PCs, motherboards, rugged computers, and servers; consumer electronics, including tablets and game consoles, wearable devices, smart home devices, and automotive electronics; and communication products, which include cable modems, set-top boxes, smartphones, switches, and routers. The company also provides car electronics, such as car entertainment products, vehicle telematics, and advanced driver assistance systems; and smart electronics, including Internet of Things products, drones, robots, and virtual reality products. In addition, it offers computer peripherals, digital cameras, plastic and electronic components, precision equipment, LED and relevant lighting products, circuit boards and relevant products, spare parts for notebook computers, computers and application systems, office machinery, hardware, GPS, computer electronic devices, disk drives, calculators, power supply units, computer cases, digital automatic data processors, data storage and processing equipment, wires, cables, computer digital signal process systems and cards, computer data projectors, projection screens, and other related components. Further, the company provides management consulting services; trading electronic parts; and tooling molds for stainless steel computer cases, as well as installs and repairs electronic products. Additionally, it engages in office building leasing activities; investing activities; manufacturing and selling medical appliances; selling iron and aluminum products; travel agency activities; and the provision of logistics, surface processing, and after-sales services. Pegatron Corporation was founded in 2007 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "6116.TW": {
        "short_name": "HANNSTAR DISPLAY CORP",
        "long_name": "HannStar Display Corporation",
        "summary": "HannStar Display Corporation researches, develops, designs, manufactures, sells, and repairs thin film transistor (TFT)-liquid crystal display (LCD) products and touch panels under the HannsG and Hannspree brands. The company also offers flat-panel displays, and CCTV and related components. Its TFT-LCD products are used in notebook computer displays, desktop computer monitors, tablets, portable DVDs, digital photo frames, PND/car displays, mobiles, and wearable products. The company operates in Mainland China, Europe, Taiwan, and internationally. HannStar Display Corporation was founded in 1998 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "6166.TW": {
        "short_name": "ADLINK TECHNOLOGY INC",
        "long_name": "ADLINK Technology, Inc.",
        "summary": "ADLINK Technology, Inc. manufactures and sells hardware, software, and peripheral devices for industrial computers in Asia Pacific, Mainland China, America, and Europe. The company offers processor blades, switch blades, and platforms; AI training platforms; CompactPCI blades, switches, backplanes, enclosures and systems, peripherals and accessories, rear transition modules, power supplies, and intelligent railway platforms; computer-on-modules; multi-function DAQ, USB DAQ, digital I/O, digitizer, dynamic signal analyzer, GPIB, timer/counter, and test and measurement software and utility products; deep learning accelerators, edge AI platforms and servers, and AI machine vision devices; and embedded flash storage solutions. It also provides embedded graphics, EtherCAT solutions, extreme outdoor servers, industrial fieldbuses, industrial motherboards and SBCs, industrial PCs, fanless embedded PCs, and infotainment internet of things (IoT) devices; and medical panel computers and tablets, network security appliances, panel PCs and monitors, single board computers, and PXI/PXIe platforms, as well as motion control and machine vision products. In addition, the company offers railway systems, ROS2 solutions, rugged VITA 75 COTS computers, and video processing servers, as well as VPX and smart manufacturing solutions. Further, it provides graphics processing unit, IoT, and artificial intelligence and robotics solutions. The company serves intelligent systems, defense and aviation, industrial automation, infotainment, power/energy, healthcare, test and measurement, transportation, telecommunication, network security, smart manufacturing, retail, cities and environmental, and buildings industries. ADLINK Technology, Inc. was incorporated in 1995 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6172.TW": {
        "short_name": "BILLIONTON SYSTEMS INC",
        "long_name": "Billionton Systems Inc.",
        "summary": "Billionton Systems Inc. manufactures and sells wireless and communication products. It offers smart films/PET products; RFID products; USB hub and network cards; pen devices; Ethernet products; cables and rechargers; multimedia products, such as Bluetooth headphones, speakers, and modules. The company was founded in 1997 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "6197.TW": {
        "short_name": "JESS-LINK PRODUCTS CO",
        "long_name": "Jess-link Products Co., Ltd.",
        "summary": "Jess-link Products Co., Ltd. provides various interconnection products in the Americas, Europe, Japan, and other Asia Pacific regions. It offers HDMI, LVDS and memory card socket, POF, RJ45, storage, USB, and audio jack connectors; DC, HDD, LVDS, USB, HDMI, ODD, and waterproof cables; and high-speed interconnect products. The company also provides wireless and active accessories, such as barcode readers and multi-touch pads, as well as qwerty remotes for smart TVs, and slim ports for VGA and HDMI; wireless chargers with BT, as well as wireless charger cradles, dongles, Modular-Qi, and PAD-Qi; and powder adapters. In addition, it offers flat, flexible flat, and other cables; fiber optic products; and wireless and wired electronic devices and accessories, including secure communications products, as well as personal storage systems, such as NAS&DAS, etc. The company's products are used in cloud/data center, networking/communication, IT, mobile, consumer, and industrial/health care/security/automotive applications. Jess-link Products Co., Ltd. was founded in 1992 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6206.TW": {
        "short_name": "FLYTECH TECHNOLOGY CO",
        "long_name": "Flytech Technology Co., Ltd.",
        "summary": "Flytech Technology Co., Ltd. designs, manufactures, and sells computers and peripherals in Taiwan, Europe, Africa, the Americas, and Asia. It offers all-in-one point-of-sales (POS), panel PC, mobile POS, KIOSK, box PC, and POS monitors. The company also engages in the operating software design and data processing services; and integration of software and hardware services. In addition, it offers customized hardware design and manufacturing services, including product conceptualization, circuit board and mechanical design, BIOS and firmware, validation test, material procurement, manufacturing, shipment, and after sales services for computer based niche products. It serves hospitality, retail, medical, industrial, commercial, and payment industries. The company was founded in 1984 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "6277.TW": {
        "short_name": "ATEN INTERNATIONAL CO",
        "long_name": "Aten International Co., Ltd",
        "summary": "Aten International Co., Ltd engages in the development, manufacture, and sale of IT infrastructure access management solution, professional audio/video, green energy, and related products. The company's products comprise KVM products, including cable, desktop, cat 5, rack, secure, matrix, and LCD KVM switches; and KVM extenders, KVM modules and accessories, KVM over IP switches, computer sharing devices, management software/control centers, serial console servers, accessories, and remote control and monitoring solutions. It also offers professional audio/video products, such as control systems, presentation switches, networked AVs, video matrix switches, video switches and splitters, video extenders, converters, accessories, and software products, as well as energy intelligence power distribution unit (PDU)/UPS/rack products comprising metered-ready, metered, switched, outlet-metered, outlet-metered-switched, and basic PDU products; PDU accessories; professional online UPS; standing network rack; and energy and DCIM management software products. In addition, the company provides USB and thunderbolt products, which include content creation products, docking stations and switches, peripheral switches, USB converters and extenders, gamepad emulators, USB/FireWire hubs, and host controller cards; data communication products, such as auto switches and industry controls; and cables, including cat 5, daisy chain, DVI, HDMI, KVM, VGA, cat 6, and display port cables. The company was formerly known as HOZN Automation Co. Ltd. and changed its name to Aten International Co., Ltd in 1988. The company was founded in 1979 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6414.TW": {
        "short_name": "ENNOCONN CORPORATION",
        "long_name": "Ennoconn Corporation",
        "summary": "Ennoconn Corporation, together with its subsidiaries, engages in the manufacture and sale of data storage, processing equipment and industrial motherboard, network communication, and factory electromechanical system services in Taiwan. It offers industrial monitoring, retailing, gaming, home, city, transportation, medical, power grid, industrial network security, industrial and embedded computers, edge computing system, OEM, ODM, JPM, and global supply chain services. The company also provides hardware system solutions to various vertical market applications, including point-of-sales (POS), banking automation, kiosk, lottery, and industrial automation; and POS products, HMIs, and embedded box PCs, as well as electronic manufacturing services. In addition, it is involved in professional investment; provision of installation, debugging, and technical consultation services; and import and export trade businesses. Further, the company offers electronic components and information software services, as well as engages in the wholesale of electronic materials. Ennoconn Corporation was founded in 1999 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6579.TW": {
        "short_name": "AAEON TECHNOLOGY INC.",
        "long_name": "AAEON Technology Inc.",
        "summary": "AAEON Technology Inc. designs and manufactures advanced industrial and embedded computing platforms worldwide. The company offers embedded boards, such as embedded single board computers, computer-on-modules, industrial motherboards, smart display modules, and PICMG single board computers; and computing systems, including panel and fanless embedded box PCs, industrial touch displays, in-vehicle computers, machine vision and digital signage systems, turn-key chassis systems, and industrial chassis. It also provides rugged tablet computers and accessories; UP boards and systems; AT Edge solutions and modules; and network appliance and video surveillance products, such as desktop and rackmount network security appliances, networking motherboards, network interface modules, and in-vehicle NVR products. In addition, the company offers IoT gateway and note boards and systems. Its products are used in street light, traffic and parking, surveillance, access control, safety and security, retail, manufacturing, artificial intelligence computing platform, network, software defined wide area network, intelligent vending machine, vision system solution, and office/wellness sensor applications. The company was founded in 1992 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6669.TW": {
        "short_name": "WIWYNN CORPORATION",
        "long_name": "Wiwynn Corporation",
        "summary": "Wiwynn Corporation researches, designs, develops, tests, and sells computing and storage products, and rack solutions for cloud infrastructures and data centers in Taiwan, the United States, Europe, Asia, and internationally. The company offers integrated solutions to enterprises that want to build, distribute, or resell cloud services to their clients. Its products include servers, storage products, open rack accessories, computer accelerators, OCP network mezzanine cards, storage cards, and system software products. The company also provides computer and peripheral equipment, data storage media products, electric appliances and media products, and information software. In addition, the company offers management consulting services; information software services; and data processing services. It also exports its products. The company was founded in 2012 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "8163.TW": {
        "short_name": "DARFON ELECTRONICS CORP",
        "long_name": "Darfon Electronics Corp.",
        "summary": "Darfon Electronics Corp. provides eco-friendly technologies for IT peripherals, passive components, and green energy solutions. It offers human interface devices, including laptop keyboards, desktop keyboards, and IT accessories; wired headphones and wireless headsets, mice, and keyboard; and point stick, full cap printing, RGB backlight, and gaming switches and keyboards. The company also provides capacitor, inductor, bead, and common-mode choke products. In addition, it offers server storage BBUs, and e-bike and high-voltage automobile batteries; and micro-inverter solar power systems, hybrid solar power systems, and energy storage systems. Further, the company provides battery pack products, such as robot cleaners, multi-function cleaners, handheld cleaners, and portable TV and camera products; and outdoor lighting rugged and panel backlight drivers, as well as charger and power supplies, such as adapters and e-bike chargers. It has operations in Taiwan, Mainland China, Japan, Korea, the United States, the Czech Republic, the Netherlands, and Germany. The company was founded in 1997 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "8210.TW": {
        "short_name": "CHENBRO MICOM CO",
        "long_name": "Chenbro Micom Co., Ltd.",
        "summary": "Chenbro Micom Co., Ltd. engages in the design, manufacture, processing, and trading of computer peripherals and systems. It offers barebone servers; rackmount, tower server, and PC chassis; storage expansion kit; and OEM/JDM services. The company is also involved in the software design activities; and export and import of computer products and peripherals. It operates in the United States, China, Taiwan, and internationally. The company was founded in 1983 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    }
}