{
    "1471.TW": {
        "short_name": "SOLYTECH ENTERPRISE CORPORATION",
        "long_name": "Solytech Enterprise Corporation",
        "summary": "Solytech Enterprise Corporation manufactures and sells switching power supplies and PC enclosures in Taiwan and internationally. It offers chassis, such as gaming, microATX, slim microATX, mini-ITX, and ATX cases chassis, as well as rackmount chassis; air purification components; and power cords and adapters for RV camp power, marine shore, and generator use. The company also provides cooling products, such as fans; and electric adjustable desk converters and gaming chairs. Solytech Enterprise Corporation was founded in 1982 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "248",
        "website": "http://www.soly-tech.com",
        "market_cap": "Small Cap"
    },
    "2301.TW": {
        "short_name": "LITE-ON TECHNOLOGY CORP",
        "long_name": "Lite-On Technology Corporation",
        "summary": "Lite-On Technology Corporation manufactures and markets computer software, hardware, peripherals, and components in Asia and internationally. It also offers monitors, multifunction and all-in-one printers, cameras, and Internet systems and image-processing equipment; information storage and processing equipment, electronic components, and office equipment; electronic coils, transformers, power suppliers, and electronic hardware parts; light-emitting diode products; electronic car products; and optical lens modules and optoelectronic components. In addition, it manufactures and sells medical equipment; photovoltaic devices, electronic components, telecommunications equipment, information technology equipment, semiconductor applications, general lighting, automotive electronics, and renewable energy products and systems; LED optical products; power supplies; image sensors and rectifiers; keyboards, display devices, printers, scanners, and computer cases; system products; mobile terminal equipment; mobile phone molds and assembly lines; power control and energy management products; plastic and computer peripheral products; optical disc drives; modules of automotive recorders; touch panels and rubber assembly products; maintenance equipment and precision instruments; and other electronic components. Further, the company engages in the wholesale, import and export, and installation of street and signal lights, scenery lights, and electronic components; and provision of technology consulting, market research and after-sales, energy technology, ODM, and automotive industry maintenance services. Additionally, it is involved in the electronic contract manufacturing; investment; solar energy engineering; and information outsourcing activities, as well as real estate management business. The company was founded in 1975 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.liteon.com",
        "market_cap": "Large Cap"
    },
    "2305.TW": {
        "short_name": "MICROTEK INTERNATIONAL INC",
        "long_name": "Microtek International, Inc.",
        "summary": "Microtek International, Inc. produces and sells digital imaging solutions for business, medical, NDT, bio and science, and digital archiving applications in Taiwan and internationally. It offers entry-level and hi-speed flat, ADF, professional photo film, object, large-scale image and document, NDT, gel, and medical film scanners, as well as flatbed scanners, including scanners for books and bound materials. The company also provides X-Ray workstations and digitizers, dental workstations and digitizers, image management software, film digitizing systems, and digital cloud systems. In addition, it offers ScanWizrad Graph, a software for capturing images of large-scale; MiBio, a software for analyzing images designed for the bio-tech analysis and research; and ScanPotter, a document imaging software for Mac OS. Microtek International, Inc. was founded in 1980 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30075",
        "website": "http://www.microtek.com",
        "market_cap": "Small Cap"
    },
    "2312.TW": {
        "short_name": "KINPO ELECTRONICS",
        "long_name": "Kinpo Electronics, Inc.",
        "summary": "Kinpo Electronics, Inc. designs, manufactures, assembles, purchases, and sells consumer electronics, communication, computing, and data storage products worldwide. The company offers 3D printer product lines; storage products; network attached storage products; printer modules and fax machines; wireless and broadband products; set-top-boxes; all-in-one PC and motherboards; formatters, color laser MFPs, laser scan units, and laser printer controllers; and calculators, electronic keyboards, e-dictionaries, gaming mouse and BT joysticks, GPS and GPS modules, auto floor cleaners, photo printers, e-books and tablets, and pachinko displays. It also provides home automation, smartwatch and ring, and fingerprint sensor products; PCBAs for cameras and AV products; LED outdoor and indoor lighting products; PC, server, and storage power supplies, as well as AC/DC adapters, and DC/DC and AC/DC converters; smart grid enabling products and smart power meters; controllers for air condition systems and industrial HVAC boards; automotive body control boards and lightings; and bank teller vault protection systems and high voltage power distribution modules. In addition, the company offers surgical detection systems; green oak leaf, butterhead, green leaf, romaine, red oak leaf, coriander, ice plant, arugula, bughatti oak, and veredes oak; chassis for ATM and gaming machines; plastic parts for printers and plotters, automated chip assembly and medical product parts, and ink cartridges; and precision components. Kinpo Electronics, Inc. was founded in 1973 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "105",
        "website": "http://www.kinpo.com.tw",
        "market_cap": "Large Cap"
    },
    "2323.TW": {
        "short_name": "CMC MAGNETICS CORP",
        "long_name": "CMC Magnetics Corporation",
        "summary": "CMC Magnetics Corporation manufactures and distributes optical discs for use in media, electronics, retail, cosmetics, food, liquor, toy, and publishing industries worldwide. It offers DVDs, CDs, and inkjet and thermal printable surface media products; custom packaging solutions, including original CD jewel boxes, CMC slim jewel cases, standard DVD boxes, slim DVD boxes, Blu Ray size DVD boxes, and cake boxes. The company also provides optical media products; and a range of packaging, printing, and sourcing services. In addition, the company engages in film production and distribution; lifestyle retail; property development; food and beverage business; internet service; car rental carrier; digital information supply and general advertising; and general investing business. Further, it manufactures and sells thin film solar cells and solar energy products; cloth dyeing and various textiles; and plastic boxes, cases, baskets, and similar products. The company was founded in 1978 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10452",
        "website": "http://www.cmcdisc.com",
        "market_cap": "Large Cap"
    },
    "2324.TW": {
        "short_name": "COMPAL ELECTRONICS INC",
        "long_name": "Compal Electronics, Inc.",
        "summary": "Compal Electronics, Inc., together with its subsidiaries, engages in the manufacture and sale of notebook personal computers (PC), monitors, LCD TVs, mobile phones, and various components and peripherals in Taiwan, the United States, China, the Netherlands, the United Kingdom, India, Germany, and internationally. The company operates through Information Technology Product and Strategy Integrated Product Segments. It provides design, development, and manufacturing services for notebooks, ultra slim notebooks, 2 in 1 notebooks, AIO, 5g module and products, tablets, smartphones, wearable and hearable devices, display products, AR/VR devices, home devices, IoT vertical solutions, medical and healthcare products, auto electronics, and servers. The company also engages in the development, manufacture, and sale of information technology and mobile communication products; and research, development, manufacture, and sale of networking products. In addition, it is involved in manufacturing of lighting equipment; international trading; manufacture, wholesale, and retail of medical equipment; rental and leasing; provision of management consulting and biotechnology services; marketing of monitors and notebook PCs; and maintenance and warranty services for notebook PCs and mobile phones; investment; sale of optical disc drives; construction and investment in infrastructure in Ba-Thien industrial district; manufacture and sale of aluminum and magnesium alloy products; provision of training and education, business information consulting, financial and tax consulting, investment consulting, and investment management services; and retail and wholesale of animal medication products. The company was founded in 1984 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11492",
        "website": "http://www.compal.com",
        "market_cap": "Large Cap"
    },
    "2331.TW": {
        "short_name": "ELITEGROUP COMPUTER SYSTEMS",
        "long_name": "Elitegroup Computer Systems Co.,Ltd.",
        "summary": "Elitegroup Computer Systems Co.,Ltd. manufactures and supplies various computer products in Taiwan and internationally. It offers motherboards, such as Intel and AMD platform motherboards, and SoC solutions; tablet PCs; all in one, small form factor, LIVA, and PC on stick systems; IPC motherboards and systems; digital signage players and open pluggable specification products; and wireless access points. The company also provides IoT products, including gateways, solution ready platforms, Ai accelerator cards, virtual personal assistants, and smart logistics. In addition, it offers customized computer programming and hardware/software design services. The company was founded in 1987 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11493",
        "website": "http://www.ecs.com.tw",
        "market_cap": "Large Cap"
    },
    "2347.TW": {
        "short_name": "SYNNEX TECHNOLOGY INTERNATIONAL",
        "long_name": "Synnex Technology International Corporation",
        "summary": "Synnex Technology International Corporation, together with its subsidiaries, distributes information technology, communication, consumer product, and semiconductor products. It offers computers, consumer desktop and notebook, telecommunication devices, PC components and peripherals, supplies and accessories, software products, and professional graphics systems, as well as enterprise servers, networks, and storage solutions. The company operates in Taiwan, Mainland China, Hong Kong, Indonesia, Thailand, Vietnam, India, Australia, the United States, Canada, the Middle East, Africa, and internationally. Synnex Technology International Corporation was founded in 1988 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://www.synnex-grp.com",
        "market_cap": "Large Cap"
    },
    "2349.TW": {
        "short_name": "RITEK CORP",
        "long_name": "RITEK Corporation",
        "summary": "RITEK Corporation manufactures and markets optical storage media products worldwide. The company offers storage media product lines, including optical storage media comprising CDs, DVDs, and Blu-ray discs; electronic storage media, which include flash memory cards, USB flash drives, portable hard disc drives, solid state drives, and others. It also provides solar modules comprising mono and poly-crystalline solar modules; and integrating solar systems; OLED display panels, ITO glasses, and patterned sapphire substrate solutions; metal masks; and biological detection discs. RITEK Corporation was founded in 1988 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30351",
        "website": "http://www.ritek.com",
        "market_cap": "Mid Cap"
    },
    "2352.TW": {
        "short_name": "QISDA CORPORATION",
        "long_name": "Qisda Corporation",
        "summary": "Qisda Corporation provides ODM/OEM services for electronic products and hardware-software integration for consumer, commercial, industrial, and medical and lifestyle applications Taiwan, the Americas, Mainland China, Poland, Japan, Switzerland, and internationally. It operates through four segments: Brand, Material, Medical, and Design and Manufacturing Service. The company designs, engineers, and manufactures display products, such as LCD monitors, multifunction monitors, all-in-one PCs, broadcasting and medical monitors, graphic and security displays, sign pads, industrial monitors, digital signage displays, digital signage stations, AIO signage products, and interactive e-boards, as well as open frames for gaming/vertical markets. It also offers opto-mechatronics products comprising data, video, short throw, and interactive projectors, as well as IP cameras; imaging devices, including scanners, and multifunctional and color laser printers; mobile communications devices consisting of 4G cameras, projectors, smartphones, industrial and commercial tablets, and mobile POS products; and professional services, which include wireless design, integration, and carrier certification. In addition, the company provides automobile infotainment devices comprising audio/video/navigation systems, infotainment media boxes, automotive displays, automotive BT/WLAN/2G/3G/4G modules, and telemetic communication units; healthcare solutions, such as diagnostic ultrasound, telecare, hemodialyzer, CRRT machine, and IOS equipment; IA solutions, including receipt printers, label printers, currency detectors, POS terminals, and mobile POS and AGV products; and smart solutions and hardware equipment for smart retail, manufacturing, energy, enterprise, school, and healthcare domains. Qisda Corporation was founded in 1984 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "333",
        "website": "http://www.qisda.com",
        "market_cap": "Large Cap"
    },
    "2353.TW": {
        "short_name": "ACER INC",
        "long_name": "Acer Incorporated",
        "summary": "Acer Incorporated researches, designs, markets, and services personal computers (PCs), information technology (IT) products, and tablet products in the United States, Mainland China, Taiwan, and internationally. The company offers notebook and desktop PCs, LCD monitors, projectors, servers, gaming products, gadgets, mixed reality devices, cloud services and edge-computing devices, e-business and services, and digital signage solutions. It also provides electronic information, insurance captive, cloud technology, professional seminars and courses, system development and integration, property development, software defined storage, online payment, technical, social networking, cyber security, data center, and real estate services; cloud ticketing systems and electronic books; intelligent transportation and electronic ticketing programs and services; and investment funds. In addition, the company repairs and maintains IT products; researches, designs, and develops Internet of Things platform; sells communication products; operates platform for client service and products sale; and develops Internet of Beings and cloud technology; integrates cloud technology, software, and hardware. Further, it researches, develops, and sells batteries and smart bicycle speedometers; sells commercial and cloud application software and services; and designs, develops, and sells computer software and hardware, as well as provides B2B virtual reality and advisory related services. Acer Incorporated was founded in 1976 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "221",
        "website": "http://www.acer-group.com",
        "market_cap": "Large Cap"
    },
    "2354.TW": {
        "short_name": "FOXCONN TECH CO",
        "long_name": "Foxconn Technology Co., Ltd.",
        "summary": "Foxconn Technology Co., Ltd. produces and sells metal casings, parts, and components. It offers hand-held device casings and related components of devices, including feature phones, smart phones, laptops, tablet computers, consumer electronics, and digital cameras. The company also produces and sells metal parts and related machine components for automobiles and electric vehicles; thermal modules for system products, such as desktop computers, laptops, tablet computers, servers, smart phones, and game consoles; MIM related products; and consumer electronics components, as well as assembles and sells consumer electronics. In addition, it offers portable computer enclosures, mobile phone enclosures, and 3C product enclosures, as well as alloy products. Further, the company is involved in the research, development, manufacture, and sale of computer thermal module, computer components, and aluminum magnesium cases; investment and reinvestment activities; processing electrical board components; and manufacture and marketing of optoelectronics and computer cables, LED lamps and displays, smart light poles and others, computer cases, new alloy material, precision molds, electronic components, and portable computers and its components. Additionally, it researches, develops, produces, and sells aluminum alloy materials, rail vehicle components, car accessories, electronic components, structured metal products, metal containers, automobile parts, power plugs, wall sockets, micro ribbon connectors for terminals, etc., as well as aluminum alloy parts for automobiles and electronics. The company was founded in 1979 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "236",
        "website": "http://www.foxconntech.com.tw",
        "market_cap": "Large Cap"
    },
    "2356.TW": {
        "short_name": "INVENTEC CORP",
        "long_name": "Inventec Corporation",
        "summary": "Inventec Corporation, together with its subsidiaries, develops, manufactures, processes, and trades in computers and related products in Taiwan, the United States, Japan, Hong Kong, Macao, Mainland China, and internationally. The company operates through Core Department and Solar Energy Department segments. It offers personal computing products, including notebook PC, desktop/AIO, and thin client; enterprise system solutions, such as servers, blade servers, network switches, storage equipment, and rack solutions, as well as server management software; and networking solutions. The company also provides smart phones and related devices; industrial mobile systems; cloud services, and soft and hard integration solutions; solar cells; networking solutions; electronic materials and products; and business management services. In addition, it is also involved in the provision of wireless terminal products; assembly and sale of computer products; equipment leasing, storage, and technological development and sale of computers; marketing promotion and telecommunication research activities; and house leasing services. Inventec Corporation was incorporated in 1975 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11170",
        "website": "http://www.inventec.com",
        "market_cap": "Large Cap"
    },
    "2357.TW": {
        "short_name": "ASUSTEK COMPUTER INC",
        "long_name": "ASUSTeK Computer Inc.",
        "summary": "ASUSTeK Computer Inc. researches and develops, designs, manufactures, sells, and repairs computers, communications, and consumer electronic products (3C) in Taiwan, China, Singapore, the United States, Europe, and internationally. The company offers phones and accessories, such as power banks, and adapters and cables; gaming products; laptops and two-in-one personal computers (PCs); desktop, tower, mini, stick, and all-in-one PCs, as well as chrome devices; motherboards, single-board computers, and chassis and cooling products; monitors and projectors; headphones and headsets, and sound cards; mesh WiFi systems, wireless routers and adapters, and wired networking products; and graphic cards, as well as business wireless routers and gaming router home products. It also provides computer bags, keyboards and mice, and mouse pads; optical drives and storage products comprising internal and external Blu-rays, and external and internal DVDs; and servers, server motherboards, workstations, and workstation motherboards. Further, it offers Internet information services; maintenance and operating services for information hardware; services information technology and communication products; and leases real estate property. Additionally, the company provides ink-jet print heads and digital image output technology, high-speed analog circuits, integrated circuits, industrial and medical computers, interface cards, and medical robots; invests in computer peripheral, Internet service, and automotive electronics businesses; and researches, develops, sells, and consults information system software; provides marketing support and repair services for medical computers and peripherals. ASUSTeK Computer Inc. was founded in 1989 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "112",
        "website": "http://www.asus.com",
        "market_cap": "Large Cap"
    },
    "2362.TW": {
        "short_name": "CLEVO CO",
        "long_name": "Clevo Co.",
        "summary": "Clevo Co. operates as an ODM/OEM manufacturer worldwide. The company provides hardware solutions for notebooks, tablets, and all-in-one PCs. It offers products for gaming, entertainment, and mobility applications. The company was founded in 1983 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "241",
        "website": "http://www.clevo.com.tw",
        "market_cap": "Large Cap"
    },
    "2364.TW": {
        "short_name": "TWINHEAD INTERNATIONAL CORP",
        "long_name": "Twinhead International Corp.",
        "summary": "Twinhead International Corp. provides rugged notebooks, rugged tablets, embedded solutions, and vehicle mount computers worldwide. It offers mobile computers; rugged tablet PCs; semi-rugged mobile computers; mobile thin clients; medical tablet PCs; and other customized mother boards/systems. The company also provides ODM, and partial or full customization services; project management services; manufacturing services comprising fully rugged product and special feature validations, flexible production system, supply chain management, and purchasing models; and certification application services. It serves government, military, health care, field sales/insurance, public safety, retail, hospitality, transportation/distribution, utilities/oil and gas, communication, agriculture, and field service industries. The company was founded in 1984 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.twinhead.com.tw",
        "market_cap": "Small Cap"
    },
    "2365.TW": {
        "short_name": "KYE SYSTEM CORP",
        "long_name": "KYE Systems Corp.",
        "summary": "KYE Systems Corp. provides computer and mobile device peripherals. It offers mouse, mouse pads, keyboards, stylus, earphones, speakers, digital cameras, headsets, and gaming peripherals. The company was founded in 1983 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "241",
        "website": "http://tw.geniusnet.com",
        "market_cap": "Mid Cap"
    },
    "2380.TW": {
        "short_name": "AVISION INC",
        "long_name": "Avision Inc.",
        "summary": "Avision Inc. designs, manufactures, and markets a variety of scanners and components for multi-function products worldwide. The company offers document, flatbed, network, and intelligent/portable scanners, as well as multi-function peripherals and paper air series. Avision Inc. was founded in 1991 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.avision.com",
        "market_cap": "Mid Cap"
    },
    "2382.TW": {
        "short_name": "QUANTA COMPUTER",
        "long_name": "Quanta Computer Inc.",
        "summary": "Quanta Computer Inc., together with its subsidiaries, engages in manufacturing, processing, and selling laptop computers in the United States, Mainland China, the Netherlands, Japan, and internationally. The company offers notebook PCs; servers, including high level blade servers, rack servers, server motherboards, LAN cards, storage, networking switches, etc.; IoT products; HD encoding cameras; and industrial computers. It also designs and manufactures wireless communication products, including mobile phones, tablets, wearable products, smart speakers, and other smart home products; wireless devices and modules for system integrators and end uses, such as SiP modules for handheld devices, PCI-E modules for notebook computers, mini-PCI modules for embedded applications, and Card bus cards and USB dongles for end users; and multimedia products comprising home gateway, IP-STB, DMA, and audio products. In addition, the company designs, manufactures, and markets global positioning system (GPS) products, including GPS engine boards, GPS mouse, Bluetooth GPS, GPS data loggers, GPS speed camera detectors, personal navigation assistance, and Pico projectors, as well as wireless communications and software solutions. Further, the company offers datacenter products and services that include storage, network switches, integrated rack systems, and cloud solutions; and planning, installation, and implementation of factory automation, as well as engineering, integration, and optimization services. Quanta Computer Inc. was founded in 1988 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": null,
        "website": "http://www.quantatw.com",
        "market_cap": "Large Cap"
    },
    "2385.TW": {
        "short_name": "CHICONY ELECTRONICS",
        "long_name": "Chicony Electronics Co., Ltd.",
        "summary": "Chicony Electronics Co., Ltd. manufactures and sells keyboards and other computer peripheral components in Taiwan and internationally. It offers input devices, including ergonomic, wired entry, wired multimedia, 2.4G wireless combo, Bluetooth, and smart card keyboards; mobile keyboards; and camera modules. The company also provides video image products, such as action cams, dash cams, outdoor IP cams, and zoom camcorders, as well as wearable cams and porch IP cams; and automotive electronic, such as image systems and LED lighting products. In addition, it manufactures sells switching power supplies and other electronic parts; researches, manufactures, and sells DSL bridges and routers; Internet solution for E-Commerce solution; production and sells automotive and motorcycle components, electric machine and device, lamps, and plastic products; researches and develops, manufactures, sells, and installs electric machinery, electric frequency device, and industry automation equipment, as well as offers aftersale and advisory services; manufactures and sells electrical machinery and components; and imports and exports goods. Chicony Electronics Co., Ltd. was founded in 1983 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "24158",
        "website": "http://www.chicony.com.tw",
        "market_cap": "Large Cap"
    },
    "2387.TW": {
        "short_name": "SUNREX TECHNOLOGY",
        "long_name": "Sunrex Technology Corporation",
        "summary": "Sunrex Technology Corporation manufactures and sells laptop computer keyboards worldwide. It is also involved in the research and development of various human interface devices, including keyboards/mice for desktop computers, writing tablets, and presentation devices; and production of tablet computers and AIO-related peripheral products. In addition, the company offers wireless keyboard and mouse, HTPC multimedia keyboards, leather casing keyboards for tablet computers, touch controlled keyboards, gaming keyboards, and mice, as well as 3D air keyboards and mice. Sunrex Technology Corporation was founded in 1975 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "428",
        "website": "http://www.sunrex.com.tw",
        "market_cap": "Large Cap"
    },
    "2395.TW": {
        "short_name": "ADVANTECH CO LTD",
        "long_name": "Advantech Co., Ltd.",
        "summary": "Advantech Co., Ltd. manufactures and sells embedded computing modules, industrial automation products, and applied and industrial computers worldwide. The company operates through Industrial Internet of Thing Services, Embedded Board and Design-in Services, Allied Design Manufacture Services, Intelligent Services, and Global Customer Services segments. It offers computer on modules, digital signage players, edge AI and Internet of Things solutions, embedded PCs and single board computers, embedded software, fanless embedded computers, gaming platform solutions, industrial display systems, industrial flash and memory solutions, industrial and semi-industrial motherboards, and RISC computing platforms. The company also provides automation controllers, building automation systems, certified solutions, embedded automation computers, human machine interfaces, machine automation, panel PCs, power and energy, and remote I/O and wireless sensing modules, as well as WebAccess software and Edge SRP. In addition, it offers data acquisition and communication, modular IPC, and slot SBC and backplanes; industrial computer chassis, computer peripherals, motherboards, and servers and storage; transportation systems, and video platforms; and healthcare infotainment terminals, and intelligent power systems, as well as medical carts, computers, and tablets. Further, the company provides intelligent connectivity solutions; networks and communication solutions; intelligent logistics and retail solutions; applied computing platforms; investment and management services; and product design services, as well as produces and sells POS systems, electronic parts, LCD touch panels, USB cables, automation vehicles and related products. Advantech Co., Ltd. was founded in 1981 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114519",
        "website": "http://www.advantech.com",
        "market_cap": "Large Cap"
    },
    "2399.TW": {
        "short_name": "BIOSTAR MICROTEC INTL",
        "long_name": "Biostar Microtech International Corp.",
        "summary": "Biostar Microtech International Corp. engages in the design, manufacture, and sale of add-on cards, and multi-media and system products in Taiwan and internationally. The company offers motherboards, SSD and SOC products, mini PCs, keyboards/mouse, VGA and IPC products, crypto mining motherboards, and accessories. It also provides accessories, such as cables, headsets, brackets, dongles, power cables, bridges, IO shields, and other products. The company was founded in 1986 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "231",
        "website": "http://www.biostar.com.tw",
        "market_cap": "Mid Cap"
    },
    "2405.TW": {
        "short_name": "SHUTTLE INC",
        "long_name": "Shuttle Inc.",
        "summary": "Shuttle Inc. designs, manufactures, and sells small form factor computers and accessories worldwide. It offers XPC computers consisting of consumer and commercial products, including cube mini-towers, slim, nano, and all-in-one PCs; and facial recognition devices for access control, digital signage players, and PCs to drive kiosk applications, as well as digital signage media players, notebook computers, and tablets. The company also provides software development services for digital education and home automation applications; SMARTVILLE smart living solutions; original design manufacturer products, such as notebooks, netbooks, 2-in-1 devices, tablets, etc.; and HOCA, a digital management system designed for in-home-care service for seniors. In addition, it operates EDUPAL, a paperless online learning platform that offers curriculum writing and assessments. The company offers its products through a network of resellers, partners, and suppliers. Shuttle Inc. was founded in 1983 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.shuttle.com",
        "market_cap": "Mid Cap"
    },
    "2406.TW": {
        "short_name": "GIGASTORAGE CORP",
        "long_name": "Gigastorage Corporation",
        "summary": "Gigastorage Corporation operates in the optoelectronics industry in Taiwan. The company manufactures and sells photovoltaic (PV) multi-crystalline wafers; and researches, develops, and manufactures PV ribbons, as well as provides PV modules. It also develops low-temp die attach paste for use in the packaging process for the electronics; and energy industries, including LED, thin-film-base PV cells, T/P, passive component termination, etc. In addition, the company provides biotech materials, such as blood glucose strip conductive Ag paste and carbon paste. Further, it offers PV systems comprising system construction and electric power selling services that consist of evaluation, suggestion, design, application, bid tendering in Bureau of Energy, manufacturing, facility registration, etc. Additionally, the company provides ground type solar power stations, as well as roof type solar power stations for private houses, public-owned buildings and factory buildings, and cottages; and PCB/BGA milling cutter and drill coating products, such as coated milling cutters and drills. Gigastorage Corporation was founded in 1997 and is based in Hukou, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hukou",
        "zipcode": "30351",
        "website": "http://www.gigastorage.com.tw",
        "market_cap": "Mid Cap"
    },
    "2414.TW": {
        "short_name": "UNITECH COMPUTER CO LTD",
        "long_name": "Unitech Computer Co., Ltd.",
        "summary": "Unitech Computer Co., Ltd. provides information technology products in Taiwan. The company offers digital goods, computer host products, monitors, computer peripherals, printing equipment, consumable supplies, Internet goods, computers, monitoring equipment, network cameras, and computer assemblies, as well as enterprise solutions. The company was incorporated in 1979 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.unitech.com.tw",
        "market_cap": "Mid Cap"
    },
    "2417.TW": {
        "short_name": "AVERMEDIA TECHNOLOGIES INC",
        "long_name": "AVerMedia Technologies, Inc.",
        "summary": "AVerMedia Technologies, Inc. designs, manufactures, and markets multimedia, Internet TV, and consumer electronic products worldwide. It provides PC, tablet, and mobile TV-viewing solutions, as well as high-definition video and real-time audio-visual products. The company also offers software development kit, frame grabber, video test equipment, audio and video doorbell, and encoder. In addition, it designs carrier boards, embedded systems, and application-ready platforms. The company's products are applied in gaming and live streaming, education, and business applications. AVerMedia Technologies, Inc. was founded in 1990 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23585",
        "website": "http://www.avermedia.com",
        "market_cap": "Mid Cap"
    },
    "2425.TW": {
        "short_name": "CHAINTECH TECHNOLOGY CORPORATIO",
        "long_name": "Chaintech Technology Corporation",
        "summary": "Chaintech Technology Corporation operates in the mainboard and graphics card markets in Taiwan and China. The company provides graphics cards for NVIDIA and AMD chips; mainboards based on Intel and AMD chipsets; cases and power supplies under the Segotep brand; and tablets under the Colorfly brand. It also engages in the research and development, manufacture, and trading of electronic products, computer hardware, peripheral devices, display cards, and motherboards, as well as general investment business. The company offers its products and services through online distributors and e-commerce platforms, as well as through traditional channels. The company was formerly known as Walton Chaintech Corporation and changed its name to Chaintech Technology Corporation in 2013. Chaintech Technology Corporation was founded in 1986 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "231",
        "website": "http://www.chaintech.com.tw",
        "market_cap": "Mid Cap"
    },
    "2451.TW": {
        "short_name": "TRANSCEND INFORMATION INC",
        "long_name": "Transcend Information, Inc.",
        "summary": "Transcend Information, Inc. engages in the manufacturing, processing, and sale of computer software and hardware, peripheral equipment, and other computer components worldwide. The company provides solid state drives; dashcams and accessories; body cameras and accessories; external storage products, such as portable hard drives, desktop external hard drives; memory cards, such as SD and micro SD cards, and compact flash drives; USB flash drives; desktop, laptop, Macbooks, and server and workstation memory modules; multimedia products, including digital music players and DVD writers; and card readers and accessories, as well as apple solutions. In addition, the company provides embedded solutions, such as SATA, PATA, Half-Slim, and mSATA SSD products; PATA and USB flash modules; memory cards, such as SD, microSD, compact flash, CFast 2.0, and MMC cards; and DRAM module solutions, as well as customized logo printing and content preloading services. Its products are used in embedded, gaming, transportation, healthcare, server, automation, and military industries. Transcend Information, Inc. was founded in 1988 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.transcend-info.com",
        "market_cap": "Large Cap"
    },
    "2465.TW": {
        "short_name": "LEADTEK RESEARCH",
        "long_name": "Leadtek Research Inc.",
        "summary": "Leadtek Research Inc. develops, manufactures, and sells graphics cards worldwide. The company offers virtual desktop systems, including zero and thin clients, management console, hardware accelerator, and remote workstation card; graphics cards; professional graphics; AI and performance computing, including development kits, virtualization, AI deep learning systems, and data center accelerator; and workstation and servers. It also provides computer and medical products; global positioning system (GPS) products comprising GPS smart antennas and industrial OEM modules; and GPU docker management systems and AI software. The company was founded in 1986 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23511",
        "website": "http://www.leadtek.com",
        "market_cap": "Mid Cap"
    },
    "2480.TW": {
        "short_name": "STARK TECHNOLOGY",
        "long_name": "Stark Technology, Inc.",
        "summary": "Stark Technology, Inc. provides system integration services for information and communication technology products in Taiwan. It offers systems integration services in the areas of infrastructure, peripheral, enterprise network, application software, and telecom, as well as professional, implementation, and consulting and maintenance services. The company also provides information security services, such as network and content security; and services for enterprise, hi-tech, FSI, telecom, and public sector industrial applications. It serves customers in the financial services, education and research, high tech manufacturing, electronics, communications, transportation and automotive, healthcare and hospitality, and other industries, as well as to the government. Stark Technology, Inc. was founded in 1993 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30054",
        "website": "http://www.sti.com.tw",
        "market_cap": "Mid Cap"
    },
    "2495.TW": {
        "short_name": "INFORTREND TECHNOLOGY INC",
        "long_name": "Infortrend Technology, Inc.",
        "summary": "Infortrend Technology, Inc provides enterprise data storage solutions worldwide. The company offers EonStor CS, a shared storage solution to enterprises and businesses; EonStor GSa, a flash unified storage solution; EonStor GSc, a hybrid cloud storage appliance; EonStor GS, a unified storage integrating storage area network (SAN), network attached storage, and cloud services; EonStor GSe, a shared media storage for SMB; EonStor GSe Pro, a single controller storage solution; and M and E, and office shared storage solutions . It also provides EonStor DS, a SAN storage solution; EonServ, an integrated storage server solution; expansion enclosure for rackmount storage systems; and EonOne for GS and CS, a storage management tool. In addition, the company offers data services, including SSD Cache, a component that stores data so that future requests for the data can be served; automated storage tiering solutions; local/remote replication for data protections and backups; and Snapshot, which provides point-in-time copies of data for various applications, including backup, testing or development, information analysis, and data mining. Further, it offers thin provisioning technology to enhance storage utilization; intelligent drive recovery for RAID protections and data recoveries, and media scan; and network video recorders for surveillance deployment in offices. Additionally, the company provides storage solutions for virtualizations, hybrid cloud, artificial intelligence, private cloud, physical securities, backup and disaster recoveries, virtual desktop infrastructures, databases, and dockers, as well as high performance computing solutions. It serves security and surveillance, media and entertainments, education and academics, financial services, and healthcare industries, as well as the government and public sectors. The company was founded in 1993 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23544",
        "website": "http://www.infortrend.com/tw/Home",
        "market_cap": "Mid Cap"
    },
    "3005.TW": {
        "short_name": "GETAC TECHNOLOGY CORPORATION",
        "long_name": "Getac Technology Corporation",
        "summary": "Getac Technology Corporation, together with its subsidiaries, engages in the research, development, manufacture, and sale of various information products in China, the United States, Europe, and internationally. The company provides notebooks, printer and its components, DVDs, mobile phones, digital cameras, PCBs, personal computers, communication equipment, automobile electronic devices, precision dies, casting/forging raw parts for automobiles and motorcycles, and magnesium alloy castings, as well as engages in the wholesale and retail of data management, software, electronic equipment, and mold related and e-communication products. It also offers various mechanical solutions, such as engineering design, prototyping and pilot run, tooling, and mass production and assembly services of plastic and metal stamping parts and modules; aluminum alloy and magnesium alloy automotive die-cast parts; and fasteners for aerospace and high-end industrial applications. In addition, the company provides repair and maintenance, and technical services for computers and related products; and sells smart mobile monitoring solutions. Further, it operates as an agency of domestic/foreign freight transport and import/export declaration, and import/export trade. Its products are used in military and industrial computer system applications. The company was formerly known as MiTAC Technology Corporation and changed its name to Getac Technology Corporation in 2009. Getac Technology Corporation was incorporated in 1989 and is headquartered in Taipei, Taiwan. Getac Technology Corporation operates as a subsidiary of MiTAC-SYNNEX Group.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11568",
        "website": "http://www.getacgroup.com",
        "market_cap": "Large Cap"
    },
    "3013.TW": {
        "short_name": "CHENMING ELECTRONIC TECHNOLOGY ",
        "long_name": "Chenming Electronic Technology Corporation",
        "summary": "Chenming Electronic Technology Corporation, an OEM/ODM manufacturer, engages in the production and sale of computer and server chassis, mobile device components, and related components. The company also produces desktop, server, and notebook subsystems; and metal injection molding products. Its products are used for the assembly and protection of desktop PCs, handheld devices, and servers. The company was formerly known as Chenming Mold Ind. Corp. and changed its name to Chenming Electronic Technology Corporation in January 2020. Chenming Electronic Technology Corporation was founded in 1970 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.uneec.com",
        "market_cap": "Mid Cap"
    },
    "3021.TW": {
        "short_name": "WELLTEND TECHNOLOGY CORPORATION",
        "long_name": "Welltend Technology Corporation",
        "summary": "Welltend Technology Corporation produces and sells electronic components and wire connectors in Taiwan and internationally. Its products are used in automotive electronics, automation equipment, computers and servers, consumer electronics, and smart appliances. The company also offers information system integration and consulting services. In addition, it provides life science and technology products, and life style shaping products. The company was founded in 1973 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "110",
        "website": "http://www.welltend.com.tw",
        "market_cap": "Small Cap"
    },
    "3022.TW": {
        "short_name": "IEI INTEGRATION CORP",
        "long_name": "IEI Integration Corp.",
        "summary": "IEI Integration Corp. provides industrial computer products worldwide. It provides AIoT and edge computing products, DevCloud solutions, PUZZLE Dev. Kits, FLEX AIoT developer kits, TANK AIoT developer kits, AIoT edge insights solutions, embedded systems, AI training server systems, VPU, FPGA, and CPU accelerators, backplanes, and assistant robots; networking products comprising network appliances, including routers, VPN, switches, firewalls, UTMs, etc.; and storage servers, network modules, and industrial network switches. The company also offers embedded computers consisting of full size and half size single board computers; industrial motherboards and embedded boards; ETX/COM EXPRESS/Q7; PEMUX series backplanes; rackmount, embedded, and compact chassis; LCD converter boards; PCI/PCIe expansion cards; and wireless, mini-PCIe, and TPM modules. In addition, it provides embedded systems, including AI-powered box PCs, DIN-rail embedded systems, rugged box PCs, compact size embedded systems, medical box PCs, transportation embedded systems, digital signage embedded systems, and QTS gateways, as well as rackmount, embedded, and compact chassis; panel PC and monitor products, such as heavy and light industrial, RISC-based, healthcare, and transportation PCs; industrial monitors; and handheld devices. Further, the company offers power supply products, adapters, DC UPS modules, DC to DC modules, and peripherals, such as industrial compact flash cards, CPU coolers, cables and connectors, mounting kits and stands, drive bays, and e-window tool kits. Its products are used in computer-based applications, such as factory automation, computer telephony integration, networking appliances, security, and systems, as well as in various fields comprising the Internet of Things, national defense, police administration, transportation, communication base stations, and medical instruments. IEI Integration Corp. was founded in 1997 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "221",
        "website": "http://www.ieiworld.com",
        "market_cap": "Mid Cap"
    },
    "3032.TW": {
        "short_name": "COMPUCASE ENTERPRISE",
        "long_name": "Compucase Enterprise Co., Ltd.",
        "summary": "Compucase Enterprise Co., Ltd. designs and manufactures LED drivers, PC cases, power supplies, rackmount chassis, cabinets, LED luminaire, and LED panels worldwide. The company offers its products under the HEC brand to OEM customers, system integrators, industrial users, and retail customers. Compucase Enterprise Co., Ltd. was founded in 1979 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": null,
        "website": "http://www.hec-group.com.tw",
        "market_cap": "Mid Cap"
    },
    "3046.TW": {
        "short_name": "AOPEN INC",
        "long_name": "Aopen Inc.",
        "summary": "Aopen Inc. provides digital signage technologies in Taiwan. It offers embedded PCs, digital signage commercial PCs, medical PCs, digital signage media players, video wall controllers, chrome boxes, AOPEN intelligent control unit (AiCU), and panel computers; antimicrobial PCs; conference cameras; and mobile, palm-sized, capsule, and smart projectors. The company also provides gaming, consumer, and commercial monitors; gaming gadgets, such as gaming keyboard, mouse, RGB light stick, and display stand; and accessories, including wall mount, floor and table stand, card reader and scanner, screen protector, and WiFi/USB display solution. It serves retail, enterprises, industrial environments, healthcare, government, hospitality and leisure, QSR, finance/ banking, transportation, education, gaming, and entertainment industries. The company was founded in 1996 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "221",
        "website": "http://www.aopen.com",
        "market_cap": "Small Cap"
    },
    "3057.TW": {
        "short_name": "PROMISE TECHNOLOGY",
        "long_name": "Promise Technology, Inc.",
        "summary": "Promise Technology, Inc. develops storage solutions for the data center, surveillance, cloud, and rich media markets worldwide. The company offers VTrak storage appliances for multi-user collaboration to ingest, edit, stream, and process rich media; Vess storage appliances for IP video surveillance installations; and Apollo Cloud, a cloud to store and share photos and videos through phones, tablets, or laptops. It also provides Pegasus, a Thunderbolt 3 RAID storage solution for creative enthusiasts and professionals; and SANLink, a Thunderbolt bridge adapter, which eliminates bottlenecks through the introduction of fiber channel or 10 Gb Ethernet connectivity. In addition, the company offers solutions, including consumer/IoT, rich media, surveillance, and IT and ODM solutions, as well as professional services comprising warranties, onsite hardware replacement, technical training, and installation services. Promise Technology, Inc. was founded in 1988 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30075",
        "website": "http://www.promise.com",
        "market_cap": "Small Cap"
    },
    "3078.TWO": {
        "short_name": "CHANNEL WELL TECHNOLOGY CO.LTD",
        "long_name": "Channel Well Technology Co.,Ltd.",
        "summary": "Channel Well Technology Co.,Ltd. manufactures and sells power supply products worldwide. It offers PC and IPC power supply, industrial power supply, wireless charging transmitter and receiver, LED lighting driver/power, enclosed switching power, and open frame power products, as well as telecom power systems, wireless chargers/power banks, adapters, USB chargers, power cables/electronic wires, magnetic components, heat sinks, and electric vehicle chargers. The company was founded in 1993 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": null,
        "website": "http://www.cwt.com.tw",
        "market_cap": "Large Cap"
    },
    "3088.TWO": {
        "short_name": "AXIOMTEK CO",
        "long_name": "Axiomtek Co., Ltd.",
        "summary": "Axiomtek Co., Ltd. designs, manufactures, and sells PC-based industrial computer products and peripherals worldwide. The company offers industrial PCs, single board computers, system on modules, fanless and rugged embedded systems, intelligent transportation systems, industrial Internet of Things gateway, industrial EtherCAT master solution, touch panel computers, medical panel computers, digital signage solutions, and network appliances products. It also provides road application platform, digital electronic signage, transportation application platform, industrial Internet of Things gateway, touch tablets, etc. The company's products are used in industrial automation, outdoor information booths, renewable energy, traffic control, shipbuilding, medical care, and other application markets. In addition, it develops software packages for AMS smart remote monitoring programs and data collection used in smart factories, smart energy, green energy, and other industries; and cloud application server and network security application platform products for future big data cloud applications. Axiomtek Co., Ltd. was founded in 1990 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "221026",
        "website": "http://www.axiomtek.com.tw",
        "market_cap": "Mid Cap"
    },
    "3171.TWO": {
        "short_name": "XIN CHIO GLOBAL CO LTD",
        "long_name": "Xin Chio Global Co., Ltd.",
        "summary": "Xin Chio Global Co., Ltd. engages in the sale of packaging materials. It provides tapes, electronic packaging materials, buffer packaging materials, plastic bags, packaging machines, paper packaging products, and others. The company is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.xinchio.com",
        "market_cap": "Small Cap"
    },
    "3213.TWO": {
        "short_name": "CRETE SYSTEMS INC",
        "long_name": "Mildef Crete Inc.",
        "summary": "Mildef Crete Inc. develops, manufactures, and sells computer systems worldwide. It provides notebook, tablet, and handheld PCs. The company was founded in 1990 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.mildef.com.tw",
        "market_cap": "Mid Cap"
    },
    "3217.TWO": {
        "short_name": "ARGOSY RESEARCH",
        "long_name": "Argosy Research Inc.",
        "summary": "Argosy Research Inc. produces and sells electronic connectors and system products. The company's products include electronic connectors, such as USB3.1 type-C, DDR3/4/5, M.2(NGFF), mini PCIe, LVDS, RF coaxial, battery, FAKRA, etc.; antenna and nut metal stamping parts; and injection/molding parts. Argosy Research Inc. was founded in 1987 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.argosy.com.tw",
        "market_cap": "Mid Cap"
    },
    "3231.TW": {
        "short_name": "WISTRON CORPORATION",
        "long_name": "Wistron Corporation",
        "summary": "Wistron Corporation, together with its subsidiaries, provides design, manufacturing, testing, and after-sales service for information and communication technology products. The company engages in the research, development, design, manufacture, testing, and sale of desktop computers, notebook computers, motherboards, servers, system platforms, high-speed and multi-function multiple-CPU computer systems, multi-media computers, network computers, consumer-type computers and special computers, microprocessors, CD-ROMs, PDAs, panel PCs, pocket computers and interface cards. The company also offers video and Internet telephones, video conferencing equipment, and telecommunication equipment; digital satellite TV receivers, set-top boxes, digital video decoders, and multi-media appliance products; digital cameras, CD-ROM drives, and DVD-ROM drives; wireless receiver products comprising mobile phones, wireless LAN cards, and Bluetooth communication modules; and LCD TVs and other electronic audio and visual products. In addition, it is designs and merchandises computer software and programs; recycles electronic waste; and offers in vitro diagnostic devices, physiological signal diagnostic devices, and medical date systems. Further, the company is involved in the manufacturing, processing, and selling of electronic products for automobiles; maintenance and cleaning of electronics products; and import and export trade operations. It operates in the United States, China, Europe, and internationally. The company was founded in 2001 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11469",
        "website": "http://www.wistron.com",
        "market_cap": "Large Cap"
    },
    "3324.TWO": {
        "short_name": "AURAS TECHNOLOGY CO",
        "long_name": "Auras Technology Co., Ltd.",
        "summary": "Auras Technology Co., Ltd. engages in manufacturing, processing, and retailing electronic materials, computer heat dissipation modules, and other related products in China, Taiwan, Korea, Ireland, and internationally. The company offers coolers, heat sinks, cooling modules, heat pipes, fans, etc. primarily for applications in notebooks, desktops, servers, pads and workstations, mobiles, graphic cards, etc. It also provides server, motherboard, and graphics card cooling modules; all-in-one workstations and DVD player cooling modules; and cooling products for home appliances, such as DVD and Blu-ray players, as well as LED lighting applications. In addition, the company offers heat flow consulting services. Auras Technology Co., Ltd. was founded in 1998 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "24891",
        "website": "http://www.auras.com.tw",
        "market_cap": "Large Cap"
    },
    "3349.TWO": {
        "short_name": "DEXIN",
        "long_name": "Dexin Corporation",
        "summary": "Dexin Corporation manufactures and sells IT cordless solutions and high-level devices in Taiwan. The company offers audio and entertainment products, including Bluetooth headsets and speakers, gaming headsets, and audiophile headphones; and computer peripherals and consumer electronic devices, such as office and gaming mouse products, keyboards, and game controllers. It also provides industrial design, research and development, product engineering and manufacturing, and other custom and project design services. Dexin Corporation was founded in 1997 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.dexin.com.tw",
        "market_cap": "Small Cap"
    },
    "3406.TW": {
        "short_name": "GENIUS ELECTRONIC OPTICAL CO.LT",
        "long_name": "Genius Electronic Optical Co., Ltd",
        "summary": "Genius Electronic Optical Co.,Ltd, an optical technology company, designs, develops, and sells lenses in Taiwan. It offers mobile lenses; and VR/AR and automotive optics. The company was founded in 1989 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "428",
        "website": "http://www.gseo.com",
        "market_cap": "Large Cap"
    },
    "3434.TWO": {
        "short_name": "ACULA TECHNOLOGY CORP.",
        "long_name": "ACULA Technology Corp.",
        "summary": "ACULA Technology Corp. provides video solutions and services in Taiwan and internationally. It offers closed-circuit television (CCTV) monitors; combo DVR/NVR products; medical displays; IP monitors with POE; IP public view monitors with POE; industrial monitors-touch monitors/point of sale (POS); digital signage/public information display products; and high-brightness monitors. The company also provides OEM/ODM display products. It offers CCTV products for use in apartment complexes, airports, bars, casinos, daycares, schools, parks, fast food restaurants, hotels, night clubs, parking lots, office buildings, shopping malls, train/bus stations, and warehouses, as well as for home owners; and POS products for food service, hospitality, retail, and public markets. The company was founded in 1993 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "338024",
        "website": "http://www.acula.com",
        "market_cap": "Small Cap"
    },
    "3479.TWO": {
        "short_name": "AVALUE TECHNOLOGY INC",
        "long_name": "Avalue Technology Inc.",
        "summary": "Avalue Technology Inc. designs, manufactures, and sells embedded computing solutions in Taiwan and internationally. The company offers industrial and embedded motherboards; industrial PC/computers, such as embedded, transportation, rackmount, and ARM based systems; and panel PCs, including industrial, medical, and open frame panel PCs, as well as industrial touch monitors, audio and video extenders, peripherals and accessories, and panel and touch technologies. It also provides computer-on-module products for critical or industrial applications; point of sale (POS) terminals, which includes desktop and compact POS; medical tablets, and semi rugged tablet and accessories; device management software; E ink solutions, such as public display, healthcare IoT, and E ink technologies solutions; ODM services; and intelligent solutions. The company's products are used in healthcare, retail, gaming, manufacturing, and transportation applications. Avalue Technology Inc. was founded in 2000 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "235",
        "website": "http://www.avalue.com.tw",
        "market_cap": "Mid Cap"
    },
    "3494.TW": {
        "short_name": "HITI DIGITAL INC.",
        "long_name": "HiTi Digital, Inc.",
        "summary": "HiTi Digital, Inc. manufactures and supplies digital photo products and services in Taiwan and internationally. The company offers industrial, commercial, and consumer photo printers; card printers; order station/operation console products; print kit/consumables; and printer accessories. It also provides professional image software designed for passport/ID photo format. The company was formerly known as Hi-Touch Imaging Technologies Co., Ltd. and changed its name to HiTi Digital, Inc. in 2007. HiTi Digital, Inc. was founded in 2001 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "231",
        "website": "http://www.hiti.com",
        "market_cap": "Small Cap"
    },
    "3515.TW": {
        "short_name": "ASROCK INCORPORATION",
        "long_name": "ASROCK Incorporation",
        "summary": "ASROCK Incorporation primarily manufactures and sells motherboards in Taiwan and internationally. It also offers graphics cards, networking products, mini and industrial PCs, and server/WS products. The company was founded in 2002 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "112",
        "website": "http://www.asrock.com",
        "market_cap": "Large Cap"
    },
    "3521.TWO": {
        "short_name": "DATAVAN INTERNATIONAL CORP",
        "long_name": "DataVan International Corporation",
        "summary": "DataVan International Corporation provides POS solutions worldwide. The company offers POS terminals, embedded box PCs, touch monitors, touch systems, kiosks, and POS peripherals comprise cash drawers, thermal printers, and system attachments. It offers solutions for the retail and foodservice industries. The company was founded in 1986 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "235",
        "website": "http://www.datavan.com.tw",
        "market_cap": "Small Cap"
    },
    "3535.TW": {
        "short_name": "FAVITE INC.",
        "long_name": "Favite, Inc.",
        "summary": "Favite Inc. engages in the research, development, and manufacture of automatic optical detection and testing equipment. It offers panel display detection devices, semiconductor inspection equipment, PCB detection devices, automatic defect classification determination systems, and rate management systems for OLED displays, touch panels, cameras, and chromicity/film thickness/OD products, as well as automatic optical CD measurement equipment. Favite Inc. was founded in 2000 and is headquartered in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": "30267",
        "website": "http://www.favite.com",
        "market_cap": "Small Cap"
    },
    "3540.TWO": {
        "short_name": "THERMALTAKE TECHNOLOGY CO. LTD.",
        "long_name": "Thermaltake Technology Co., Ltd.",
        "summary": "Thermaltake Technology Co., Ltd. provides entertainment, e-sports, technology, and lifestyle products worldwide. It offers cases, power supplies, and coolers under the Thermaltake brand; keyboards, headsets, mice, and accessories under the Tt eSPORTS brand name; and mobile accessories under the LUXA2 brand. The company also operates an e-shopping site under the Tt Buy brand name. It serves its customers through distributors and retailers. The company was founded in 1999 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.thermaltakecorp.com",
        "market_cap": "Mid Cap"
    },
    "3564.TWO": {
        "short_name": "AEWIN TECHNOLOGIES CO. LTD.",
        "long_name": "AEWIN Technologies Co.,Ltd.",
        "summary": "AEWIN Technologies Co.,Ltd. provides network platform products and solutions in Taiwan and internationally. The company offers network appliances; general purpose and edge computing servers, and workstation products; network expansion modules; and other modules, as well as provides ODM/OEM services. Its products are used for network computing, software-defined wide area network, network functions virtualization infrastructure, multi-access edge computing/edge AI, and 5G/vRAN applications. The company was founded in 2000 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "22183",
        "website": "http://www.aewin.com",
        "market_cap": "Small Cap"
    },
    "3652.TWO": {
        "short_name": "UNITECH ELECTRONICS CO (TAIWAN)",
        "long_name": "Unitech Electronics Co., Ltd.",
        "summary": "Unitech Electronics Co., Ltd. manufactures and sells automatic identification and data capture technologies worldwide. It provides mobile computer products, such as rugged smartphones, touch computers, industrial PDAs, handheld terminals, enterprise tablets, healthcare mobile computers, wearable computers, touch computers, and mobile clinical assistant; barcode scanners that include linear imager, 2D imager, laser, wireless, pocket, ESD safe, healthcare, and wearable scanners, as well as pen and slot readers; and RFID products, such as reader modules, mobile readers, handheld readers, fixed readers, portable/pocket readers, and antennas. The company also offers intelligent integrated terminals that include IP based biometric terminal; and software solutions, such as MoboLink, a device and data exchange management software, as well as StageGO solutions, a barcode-based device staging solution. It serves its customers in the fields of retail, field services, governments, healthcare, hospitality, logistics and transportation, warehousing, and manufacturing. The company was founded in 1979 and is headquartered in New Taipei City, Taiwan. Unitech Electronics Co., Ltd. operates as a subsidiary of Unitech Computer Co., Ltd.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "231",
        "website": "http://www.ute.com",
        "market_cap": "Small Cap"
    },
    "3659.TWO": {
        "short_name": "Bison",
        "long_name": "Bison Electronics Inc.",
        "summary": "Bison Electronics Inc. engages in the manufacture and sale of camera modules and computer peripheral related products in Taiwan. Its products are used in imaging products, such as video camera modules for notebook computers, industrial handheld display products, home care, automotive image related products, etc. The company was founded in 2003 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.bisontech.com.tw",
        "market_cap": "Small Cap"
    },
    "3665.TW": {
        "short_name": "BIZLINK HOLDING INC",
        "long_name": "Bizlink Holding Inc.",
        "summary": "Bizlink Holding Inc. researches, designs, develops, manufactures, and sells various technological products and components for various technology industries in the United States, China, Germany and internationally. It operates through Computer Related Products, Fiber Optics, Home Appliances, and Others segments. The company provides adapters, high-speed cables, power whips and cables, connectors, modules, hubs and docks, and dongles; and cable storage, integration of electrical and mechanical parts, and over molding of fixings and mountings for cable harnesses, textile braided cable for harness systems, complex wire harnesses, and systems and customized solutions, as well as power cords, wire harness, and wires and cables. It also offers towline, micro coaxial, photoelectric hybrid, drag chain, phase, defibrillation, and USB extender cables, as well as optical fiber patchcord, thermistor detector, and medical raw wire for medical equipment; and transceivers, ultra-compact and high isolation WDM, coupler/PLC, optical switch/VOA, circulator/isolator/hybrid, high density module, and HDMI/DP/USB optical cables for optical fiber communications. In addition, the company provides cables for automation and semiconductor equipment, and subway projects, as well as wire harnesses for oil and gas equipment, and passenger aviation; and solar energy connectivity solutions, including junction boxes, DC branch cables, connectors, and PV cables. Further, it provides battery management system and TVSH harnesses, charging systems and accessories, main harnesses, and automotive wires. Additionally, it engages in the wholesale and retail of cable assemblies, power cords, and connectors, as well as computer peripheral products, electronic materials, fiber optical passive components, and fiber optical cables; and produces and sells fiberfill moldings, smart instrumentational sensors, connectors, and functional materials. The company was founded in 1996 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23553",
        "website": "http://www.bizlinktech.com",
        "market_cap": "Large Cap"
    },
    "3706.TW": {
        "short_name": "MITAC HOLDINGS CORPORATION",
        "long_name": "MiTAC Holdings Corporation",
        "summary": "MiTAC Holdings Corporation, through its subsidiaries, designs, manufactures, and sells computers and ancillary equipment, and communication related products. The company offers computer frames, motherboards, interface cards, displays, power supplies, keyboards, and related metal stamping and plastic parts, as well as provides maintenance services for motherboards. It is also involved in the research, development, and manufacture of computer software, and provision of related technical advisory services; and research and development of calculators, servers, mobile phones, and PDA and GPS products, as well as provision of technical transfer and advisory services. In addition, the company sells electronic telecommunication products, and communication and software products, as well as offers related after-sale services; and assembles and sells computer peripherals, hardware/software, and related products. Further, it engages in the testing, maintenance, and display of computers, computer components, communication products, and consumer electronic products, as well as provision of related technical advisory and after-sale services; and general investment activities. Additionally, the company offers freight transport agency, export and import trading, and warehousing services; customer data processing, analysis, and integrated services; and business administration services. It operates in Taiwan, the United States, Europe, and internationally. MiTAC Holdings Corporation was founded in 1982 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33383",
        "website": "http://www.mic-holdings.com.tw",
        "market_cap": "Large Cap"
    },
    "4915.TW": {
        "short_name": "PRIMAX ELECTRONICS LTD(NEW)",
        "long_name": "Primax Electronics Ltd.",
        "summary": "Primax Electronics Ltd., together with its subsidiaries, manufactures and sells mobile device components, computer peripherals, business equipment, and digital home products in Taiwan and internationally. The company offers mobile device components, such as camera and fingerprint modules, solutions for wireless charging, ultra-thin keyboard modules, and mobile camera systems; Bluetooth communications devices, such as Bluetooth headphones, audio transmitters, hands-free car headsets, identification card headphones, image viewers, digital pens, GPS receivers, etc.; and mobile device accessories comprising charging cradles, data cables, car chargers, hands-free car accessories, etc. It also provides PC peripherals, including computer input devices, gaming peripherals, ultra-thin Bluetooth tablet keyboards, and digital writing tablets/stylus; and business equipment consisting of scanners, printers/multifunction printers, shredders, and laminators. In addition, the company offers digital home products, such as smart TV remote controls, wireless portable storage devices, and Internet music boxes; audio products; and product development services comprising usability test and industrial design. Primax Electronics Ltd. was founded in 1984 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11492",
        "website": "http://www.primax.com.tw",
        "market_cap": "Large Cap"
    },
    "4916.TW": {
        "short_name": "PARPRO CORPORATION",
        "long_name": "Parpro Corporation",
        "summary": "Parpro Corporation provides design and manufacturing services for processor based embedded solutions to original equipment manufacturers in Europe and the United States. It offers switching platforms, multi-core processor cards and blades; embedded hardware system design services; schematic capture and PCB layout design services for hardware development solutions; mechanical design services; and firmware design services. The company also provides wire harness and cable assembly; sheet metal fabrication and finishing; precision machining; subsystem assembly and integration; and box build, kiosk, and rack services. It serves customers in the aerospace, gaming, telecommunication, and industrial markets. The company was formerly known as Pilot Electronics Corporation. Parpro Corporation was founded in 2001 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "32063",
        "website": "http://www.parpro.com.tw",
        "market_cap": "Small Cap"
    },
    "4924.TWO": {
        "short_name": "HTM INTERNATIONAL HOLDING LTD",
        "long_name": "HTM International Holding Ltd.",
        "summary": "HTM International Holding Ltd. engages in the production and sale of precision molds, computer notebook accessories, hi-fi systems accessories, office automation products, and home audio products and related parts. It offers PC components, including gas injection products; PC peripherals, such as portable hard disk covers and CD boxes; and speakers. The company also provides biomass energy products. It operates in Taiwan, Europe, the United States, Japan, and China. HTM International Holding Ltd. was founded in 1989 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.hsihou.com",
        "market_cap": "Small Cap"
    },
    "4938.TW": {
        "short_name": "PEGATRON CORPORATION",
        "long_name": "Pegatron Corporation",
        "summary": "Pegatron Corporation, together with its subsidiaries, engages in designing, manufacturing, and selling computer, communication, and consumer electronic products worldwide. It offers computing products, such as notebooks, desktops, PCs, motherboards, rugged computers, and servers; consumer electronics, including tablets and game consoles, wearable devices, smart home devices, and automotive electronics; and communication products, which include cable modems, set-top boxes, smartphones, switches, and routers. The company also provides car electronics, such as car entertainment products, vehicle telematics, and advanced driver assistance systems; and smart electronics, including Internet of Things products, drones, robots, and virtual reality products. In addition, it offers computer peripherals, digital cameras, plastic and electronic components, precision equipment, LED and relevant lighting products, circuit boards and relevant products, spare parts for notebook computers, computers and application systems, office machinery, hardware, GPS, computer electronic devices, disk drives, calculators, power supply units, computer cases, digital automatic data processors, data storage and processing equipment, wires, cables, computer digital signal process systems and cards, computer data projectors, projection screens, and other related components. Further, the company provides management consulting services; trading electronic parts; and tooling molds for stainless steel computer cases, as well as installs and repairs electronic products. Additionally, it engages in office building leasing activities; investing activities; manufacturing and selling medical appliances; selling iron and aluminum products; travel agency activities; and the provision of logistics, surface processing, and after-sales services. Pegatron Corporation was founded in 2007 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "112",
        "website": "http://www.pegatroncorp.com",
        "market_cap": "Large Cap"
    },
    "4987.TWO": {
        "short_name": "GODEX INTERNATIONA",
        "long_name": "Godex International Co., Ltd",
        "summary": "Godex International Co., Ltd, an engineering company, designs, manufactures, and sells barcode printing products worldwide. The company offers desktop, industrial, and mobile printers; scanners; label stands; and wax, wax/resin, resin, and near edge ribbons. It also provides label design and printing software under the GoRibbon, GoLabel, GoLabel PDF, and QLabel, GoAPP, and GoUtility names. The company's products are used in healthcare, retail, logistics and transportation, manufacturing, government, travel and leisure, and special material applications. It distributes its products through a network of value add resellers. The company was founded in 1993 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "235",
        "website": "http://www.godexintl.com",
        "market_cap": "Small Cap"
    },
    "5271.TWO": {
        "short_name": "HORNG TONG",
        "long_name": "Horng Tong Enterprise Co., Ltd.",
        "summary": "Horng Tong Enterprise Co., Ltd. engages in the research and development, design, manufacture, and sale of electronic connectors in Taiwan. The company offers connectors for mother boards, notebooks, and networks/antennas/RJs; AMOLED materials, sublimation machines, and cameras; and car electronics, including DVRs and AVMs, car chargers, wireless chargers, AVN and ADAS products, dash cam-mirrors, head-up displays, portable car chargers, ATL system products, and 8 in 1 control boxes. It also provides Internet of Things products, such as police devices and equipment, modems, wireless modules, emergency phones, smart crutches, and LTE Mifi products; and communication products. The company was founded in 1998 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "248",
        "website": "http://www.hometom.com.tw",
        "market_cap": "Small Cap"
    },
    "5289.TWO": {
        "short_name": "INNODISK CORPORATION",
        "long_name": "Innodisk Corporation",
        "summary": "Innodisk Corporation provides industrial embedded flash and DRAM storage products and technologies in Taiwan. The company offers flash storage products, such as solid state drives (SSDs); SATA Slim for hand-held devices, thin clients, and industrial applications; ServerDOM for server use; CFast, a small form factor for industrial and embedded applications; and mSATA, a compliant module for space-constricted applications. Its flash storage products also include Mini PCIeDOM for server boot applications; M.2 for ultra-thin or compact systems; SATADOM compact form factor suitable for 1U server applications; nanoSSDs; compact flash cards; embedded disk cards; SD and MicroSD cards; USB and EDC; and server boot cards. The company also provides embedded DRAM modules; server memory modules; wide temperature DRAM modules; and special customized DRAM modules. In addition, it offers embedded peripherals comprising AI accelerator cards, storage expansion cards, disk arrays, display cards, and communication modules, as well as flash storage products with various interfaces and form factors. The company's products are used in the aerospace and defense embedded systems, server applications, casino gaming, and in-vehicles, as well as automation, surveillance, networking, healthcare, and retail markets. Innodisk Corporation was founded in 2005 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "221",
        "website": "http://www.innodisk.com",
        "market_cap": "Large Cap"
    },
    "5386.TWO": {
        "short_name": "ALBATRON TECHNOLOGY CO LTD",
        "long_name": "Albatron Technology Co., Ltd",
        "summary": "Albatron Technology Co., Ltd provides IT solutions and technology equipment for industrial and application PCs in Taiwan. It offers motherboards, graphic cards, minicomputers, and laptops; micron products, including SSD, SSD M.2, RDIMM, UDIMM, SODIMM products; and peripherals and PC components. The company also provides embedded platform products, including embedded systems, ARM boards, and android panel kits; industrial MB products, such as mini-ITX, nano-ITX, and micro ATX products, as well as industrial barebones; gaming peripherals, including headsets; and WPS Office, an office software. In addition, it offers design-in, FAE technical support, manufacturing, and repairing services. The company was founded in 1984 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.albatron.com.tw",
        "market_cap": "Small Cap"
    },
    "6116.TW": {
        "short_name": "HANNSTAR DISPLAY CORP",
        "long_name": "HannStar Display Corporation",
        "summary": "HannStar Display Corporation researches, develops, designs, manufactures, sells, and repairs thin film transistor (TFT)-liquid crystal display (LCD) products and touch panels under the HannsG and Hannspree brands. The company also offers flat-panel displays, and CCTV and related components. Its TFT-LCD products are used in notebook computer displays, desktop computer monitors, tablets, portable DVDs, digital photo frames, PND/car displays, mobiles, and wearable products. The company operates in Mainland China, Europe, Taiwan, and internationally. HannStar Display Corporation was founded in 1998 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "110",
        "website": "http://www.hannstar.com",
        "market_cap": "Large Cap"
    },
    "6161.TWO": {
        "short_name": "JETWAY INFORMATION",
        "long_name": "Jetway Information Co., Ltd.",
        "summary": "Jetway Information Co., Ltd. designs, manufactures, and sells motherboards and other IT products worldwide. It also provides AIO products, graphic cards, IPC boards, barebones, and chassis products. The company was founded in 1986 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "231",
        "website": "http://www.jetway.com.tw",
        "market_cap": "Small Cap"
    },
    "6166.TW": {
        "short_name": "ADLINK TECHNOLOGY INC",
        "long_name": "ADLINK Technology, Inc.",
        "summary": "ADLINK Technology, Inc. manufactures and sells hardware, software, and peripheral devices for industrial computers in Asia Pacific, Mainland China, America, and Europe. The company offers processor blades, switch blades, and platforms; AI training platforms; CompactPCI blades, switches, backplanes, enclosures and systems, peripherals and accessories, rear transition modules, power supplies, and intelligent railway platforms; computer-on-modules; multi-function DAQ, USB DAQ, digital I/O, digitizer, dynamic signal analyzer, GPIB, timer/counter, and test and measurement software and utility products; deep learning accelerators, edge AI platforms and servers, and AI machine vision devices; and embedded flash storage solutions. It also provides embedded graphics, EtherCAT solutions, extreme outdoor servers, industrial fieldbuses, industrial motherboards and SBCs, industrial PCs, fanless embedded PCs, and infotainment internet of things (IoT) devices; and medical panel computers and tablets, network security appliances, panel PCs and monitors, single board computers, and PXI/PXIe platforms, as well as motion control and machine vision products. In addition, the company offers railway systems, ROS2 solutions, rugged VITA 75 COTS computers, and video processing servers, as well as VPX and smart manufacturing solutions. Further, it provides graphics processing unit, IoT, and artificial intelligence and robotics solutions. The company serves intelligent systems, defense and aviation, industrial automation, infotainment, power/energy, healthcare, test and measurement, transportation, telecommunication, network security, smart manufacturing, retail, cities and environmental, and buildings industries. ADLINK Technology, Inc. was incorporated in 1995 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "235",
        "website": "http://www.adlinktech.com",
        "market_cap": "Large Cap"
    },
    "6172.TW": {
        "short_name": "BILLIONTON SYSTEMS INC",
        "long_name": "Billionton Systems Inc.",
        "summary": "Billionton Systems Inc. manufactures and sells wireless and communication products. It offers smart film/PET products; RFID products; USB hub and network cards; memory cards; wireless LAN and Ethernet products; USB hub Ethernet adapters, cables, and rechargers; and multimedia products, such as Bluetooth headphones, speakers, and modules. The company was founded in 1997 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.billionton.com",
        "market_cap": "Small Cap"
    },
    "6188.TWO": {
        "short_name": "QUANTA STORAGE",
        "long_name": "Quanta Storage Inc.",
        "summary": "Quanta Storage Inc. designs, develops, manufactures, and sells optical storage products to computer manufacturers worldwide. The company offers storage and peripheral products, such as NAS, DAS, USB-C power delivery and mini docks, adapters, and Wi-Fi storage products. It also provides solid state drives and intelligent automation systems; and storage manufacturing services of storage devices and systems, computer peripherals, and IoT related products. In addition, the company offers project planning, product development, technical, design, engineering mechanism, electrical engineering, logistics management, and repair and maintenance services. Quanta Storage Inc. was founded in 1999 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan",
        "zipcode": "333",
        "website": "http://www.qsitw.com",
        "market_cap": "Large Cap"
    },
    "6197.TW": {
        "short_name": "JESS-LINK PRODUCTS CO",
        "long_name": "Jess-link Products Co., Ltd.",
        "summary": "Jess-link Products Co., Ltd. provides various electronic products in Taiwan and internationally. It offers connectors, such as EMI cages, high-speed connectors, I/O connectors, and magnetic and modular jacks and plugs; Cable Assemblies, including direct attach cables, high speed cable assemblies, fiber optic assemblies, FFC jumpers, ethernet LAN cables, I/O cable assemblies, LVDS, and industrial cables; active optical cables; and flexible flat, bulk flat, high speed, high temperature, and high power flat cables. The company also provides robot and controller solutions, machine vision and surveillance solutions, PLC solutions, and IPC solutions; IoT products consisting of IoT modules, homekit products, smart home products, and NBIoT devices; wireless chargers; remote controllers; and programmable IoT buttons, IoT scanners, streaming music players, wireless power, and MFi series products. In addition, it offers accessories, such as lightning hubs/dongles, type-c hubs/ dongles, convertors/adpators, fast chargers, and car chargers; automotive products, energy storage systems, and green energy products; and customized cable assembly services. The company's products are used in smart connection, datacenter/networking/telecom, Internet of Things (IoT), and new energy and vehicle industries. Jess-link Products Co., Ltd. was founded in 1992 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "235",
        "website": "http://www.jpcco.com",
        "market_cap": "Mid Cap"
    },
    "6199.TWO": {
        "short_name": "TIENPIN UNITED ENTERPRISE CO LT",
        "long_name": "TienPin United Enterprise CO., LTD.",
        "summary": "TienPin United Enterprise CO., LTD. operates as a flash storage manufacturer in Taiwan. The company designs, manufactures, and sells portable storage products. It offers flash card readers/writers and adapters, digital photo frames, digital signage products, LCD TV player modules, fingerprint devices, and flash drives. The company was formerly known as DataFab Systems Inc. and changed its name to TienPin United Enterprise CO., LTD. in July 2015. TienPin United Enterprise CO., LTD. is headquartered in Pingzhen, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Pingzhen",
        "zipcode": "32466",
        "website": "http://www.datafab.com",
        "market_cap": "Small Cap"
    },
    "6206.TW": {
        "short_name": "FLYTECH TECHNOLOGY CO",
        "long_name": "Flytech Technology Co., Ltd.",
        "summary": "Flytech Technology Co., Ltd. designs, manufactures, and sells computers and peripherals in Taiwan, Europe, Africa, the Americas, and Asia. It offers all-in-one point-of-sales (POS), panel PC, mobile POS, KIOSK, box PC, and POS monitors. The company also engages in the operating software design and data processing services; and integration of software and hardware services. In addition, it offers customized hardware design and manufacturing services, including product conceptualization, circuit board and mechanical design, BIOS and firmware, validation test, material procurement, manufacturing, shipment, and after sales services for computer based niche products. It serves hospitality, retail, medical, industrial, commercial, and payment industries. The company was founded in 1984 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11494",
        "website": "http://www.flytech.com",
        "market_cap": "Mid Cap"
    },
    "6245.TWO": {
        "short_name": "LANNER ELECTRONICS INC",
        "long_name": "Lanner Electronics Inc.",
        "summary": "Lanner Electronics Inc. provides design, engineering, and manufacturing services for advanced network appliances and rugged applied computing platforms for system integrators, service providers, and application developers worldwide. The company offers network appliances, such as modules and acceleration cards, white box hardware solutions, wide temperature network appliances, desktop network appliances, and rackmount network appliances; and telecom datacenter appliances consisting of cloud storage, HybridTCA, vCPE/uCPE, and video transport platforms, as well as modules and blades, and hyper-converged appliances. It also provides intelligent edge appliances, including DIN-Rail industrial gateway, edge AI appliance, embedded platform, intelligent video platform, rackmount industrial computer, rugged wireless gateway, vehicle gateway, and vehicle/rail computer; and extension modules comprising LTE radio modules. The company offers its products for use in various applications, such as network computing, telecommunication, transportation, power and energy, industrial automation, intelligent systems, software-defined wide area network, and edge AI applications. Lanner Electronics Inc. was founded in 1986 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "22184",
        "website": "http://www.lannerinc.com",
        "market_cap": "Mid Cap"
    },
    "6277.TW": {
        "short_name": "ATEN INTERNATIONAL CO",
        "long_name": "Aten International Co., Ltd",
        "summary": "Aten International Co., Ltd engages in the development, manufacture, and sale of IT infrastructure access management solution, professional audio/video, green energy, and related products. The company's products comprise KVM products, including cable, desktop, cat 5, rack, secure, matrix, and LCD KVM switches; and KVM extenders, KVM modules and accessories, KVM over IP switches, computer sharing devices, management software/control centers, serial console servers, accessories, and remote control and monitoring solutions. It also offers professional audio/video products, such as control systems, presentation switches, networked AVs, video matrix switches, video switches and splitters, video extenders, converters, accessories, and software products, as well as energy intelligence power distribution unit (PDU)/UPS/rack products comprising metered-ready, metered, switched, outlet-metered, outlet-metered-switched, and basic PDU products; PDU accessories; professional online UPS; standing network rack; and energy and DCIM management software products. In addition, the company provides USB and thunderbolt products, which include content creation products, docking stations and switches, peripheral switches, USB converters and extenders, gamepad emulators, USB/FireWire hubs, and host controller cards; data communication products, such as auto switches and industry controls; and cables, including cat 5, daisy chain, DVI, HDMI, KVM, VGA, cat 6, and display port cables. The company was formerly known as HOZN Automation Co. Ltd. and changed its name to Aten International Co., Ltd in 1988. The company was founded in 1979 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "221",
        "website": "http://www.aten.com",
        "market_cap": "Large Cap"
    },
    "6414.TW": {
        "short_name": "ENNOCONN CORPORATION",
        "long_name": "Ennoconn Corporation",
        "summary": "Ennoconn Corporation designs and develops industrial mother boards in Taiwan and internationally. It offers hardware system solutions to various vertical market applications, including point-of-sales (POS), banking automation, kiosk, lottery, and industrial automation. The company also provides motherboards, POS products, embedded box PCs, HMIs, and kiosk self-service terminal solutions; and design to order and electronic manufacturing services. In addition, it researches, develops, and sells hardware and software products; manufactures, wholesales, imports/exports, and services industrial computer and industrial systems; researches, develops, produces, and sells electronic materials for hardware and software products; and wholesales electronic materials, as well as provides installation, debugging, and technical consultation services. Further, the company is involved in the intelligent technology development and sale of hardware; wholesale and retail of telecommunications control of radio frequency equipment input and information software; research, design, and sale of mobile payment, electronic signature, and information security systems; sale of network storage equipment and maintenance services; and import and export trading activities. Additionally, it offers electronic parts, computer and peripheral devices, multimedia products, molds, servers, communication machinery and equipment, and spare parts, and after-sales services; and software services. The company was incorporated in 1999 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23586",
        "website": "http://www.ennoconn.com",
        "market_cap": "Large Cap"
    },
    "6485.TWO": {
        "short_name": "ASOLID TECHNOLOGY CO LTD",
        "long_name": "ASolid Technology Co., Ltd.",
        "summary": "ASolid Technology Co., Ltd. operates as a NAND flash controller provider in Taiwan. It offers SD/microSD controllers, USB flash drive controllers, eMMC controllers, and SSD and UFD controllers. The company was founded in 2008 and is based in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.asolid-tek.com",
        "market_cap": "Mid Cap"
    },
    "6570.TWO": {
        "short_name": "APLEX TECHNOLOGY INC",
        "long_name": "Aplex Technology Inc.",
        "summary": "Aplex Technology Inc. develops, manufactures, and sells industrial PC products worldwide. The company provides stainless steel panel, industrial panel, embedded box, marine panel, in-vehicle panel, and ATEx panel PC products. It also offers human-machine interfaces, ATEx displays, ATEx box pc products, industrial displays and boards, and machine vision systems, as well as accessories, including storage products, power adapters and modules, converter boards, and product stands. The company provides its products for use in smart factory, surveillance, control and communication, machine vision, food and beverage automation, kiosk and ticketing, ATEX oil and gas, smart warehousing and transportation, and healthcare applications. Aplex Technology Inc. was founded in 2004 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "235",
        "website": "http://www.aplex.com",
        "market_cap": "Small Cap"
    },
    "6579.TW": {
        "short_name": "AAEON TECHNOLOGY INC.",
        "long_name": "AAEON Technology Inc.",
        "summary": "AAEON Technology Inc. designs and manufactures advanced industrial and embedded computing platforms worldwide. The company offers embedded boards, such as embedded single board computers, computer-on-modules, industrial motherboards, smart display modules, and RISC and PICMG single board computers; and computing systems, including panel and fanless embedded box PCs, industrial touch displays, machine vision and digital signage systems, turn-key chassis solutions, multi-PoE and fanless appliances, and industrial chassis. It also provides rugged tablet computers and accessories; UP boards and systems; artificial intelligence (AI) Edge solutions and modules; and network appliances, such as desktop and rackmount network appliances, networking motherboards, and network interface modules. In addition, the company offers IoT gateway boards and systems. Its products are used in smart city, safety and security, smart retail and manufacturing, AI computing platform, network, software defined wide area network, intelligent vending machine, vision system solution, smart office/wellness sensor, and rugged tablet applications. The company was founded in 1992 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "231",
        "website": "http://www.aaeon.com",
        "market_cap": "Large Cap"
    },
    "6599.TWO": {
        "short_name": "Poindus",
        "long_name": "Poindus Systems Corp.",
        "summary": "Poindus Systems Corp. designs and manufactures POS terminal and touch display products worldwide. The company offers panel PCs, tablets, small and large size displays, box PCs, POS peripherals, and custom products. Its products are used in hospitality, retail, medical, and industrial applications. The company was founded in 2009 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.poindus.com",
        "market_cap": "Small Cap"
    },
    "6669.TW": {
        "short_name": "WIWYNN CORPORATION",
        "long_name": "Wiwynn Corporation",
        "summary": "Wiwynn Corporation researches, designs, develops, tests, and sells computing and storage products, and rack solutions for cloud infrastructures and data centers in Taiwan, the United States, Europe, Asia, and internationally. The company offers integrated solutions to enterprises that want to build, distribute, or resell cloud services to their clients. Its products include servers, storage products, open rack accessories, computer accelerators, OCP network mezzanine cards, storage cards, and system software products. The company also provides computer and peripheral equipment, data storage media products, electric appliances and media products, and information software. In addition, the company offers management consulting services; information software services; and data processing services. It also exports its products. The company was founded in 2012 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "22102",
        "website": "http://www.wiwynn.com",
        "market_cap": "Large Cap"
    },
    "6680.TWO": {
        "short_name": "SINTRONES TECHNOLOGY CORP",
        "long_name": "Sintrones Technology Corp.",
        "summary": "Sintrones Technology Corp. designs, develops, manufactures, and sells in-vehicle computing products in Taiwan and internationally. The company provides in-vehicle computing solutions, such as in-vehicle computers, CAN bus modules, GPS modules, in-vehicle displays, and video capture cards; embedded computing products, including fanless box computers and embedded boards; and AI GPU computers, as well as surveillance computers. Its products are used in the autonomous, smart factory, public transit, railway computer, fleet management, law enforcement, in-vehicle computer, outdoor video surveillance, wind energy, and military computer applications. The company is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "235",
        "website": "http://www.sintrones.com",
        "market_cap": "Small Cap"
    },
    "6805.TWO": {
        "short_name": "Fositek",
        "long_name": "Fositek Corp.",
        "summary": "Fositek Corp. designs, manufactures, and distributes consumer electronic components. The company produces connecting rotating shafts, cantilever brackets, and other components for computers, optics, appliances, and communications and medical equipment. It markets its products in Asia, the United States, and internationally. The company was founded in 1990 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "24892",
        "website": "http://www.fositek.com",
        "market_cap": "Large Cap"
    },
    "6825.TWO": {
        "short_name": "QBIC",
        "long_name": "Qbic Technology Co., Ltd.",
        "summary": "Qbic Technology Co., Ltd. develops and sells commercial and industrial grade devices in Taiwan. The company provides smart panel-PCs, embedded and fanless ARM box-PCs, fanless AI edge computers, embedded and fanless x86 box-PCs, single board computers, OQupancy manager devices, kiosks, and accessories It offers devices for facility management, embedded computing, retail and hospitality solution, interactive smart technology, and design and manufacturing. The company is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.qbictechnology.com",
        "market_cap": "Small Cap"
    },
    "8032.TWO": {
        "short_name": "KORYO ELECTRONICS CO",
        "long_name": "Koryo Electronics Co., Ltd.",
        "summary": "Koryo Electronics Co., Ltd. engages in the production, sale, and import/export of electronic parts and components, and computers and computer peripherals. It also imports/exports electric appliances and components, such as TV sets, video and radio cassette recorders, air conditioners, refrigerators, and microwave ovens; and acts as an agent for related products of Taiwan and international companies on sales, bids, and quotes. The company was founded in 1987 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "22101",
        "website": "http://www.koryo.com.tw",
        "market_cap": "Small Cap"
    },
    "8050.TWO": {
        "short_name": "IBASE TECHNOLOGY INC",
        "long_name": "IBASE Technology Inc.",
        "summary": "IBASE Technology Inc. designs, develops, manufactures, and sells industrial PCs in Taiwan and internationally. The company primarily offers industrial motherboards, embedded systems, panel PCs, digital signage players, and network appliances, as well as RISC computing products, such as ARM-based Freescale i.MX6 SBCs, SMARC modules and carrier boards, and SMARC development kits for various applications in industrial automation, smart retail, networking and communication, intelligent transportation, medical, gaming, healthcare, smart factory, and entertainment and hospitality markets. It also provides original and joint design manufacturing services, such as board/system specification design, software design, manufacturing, validation, and after services. The company was founded in 2000 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "115",
        "website": "http://www.ibase.com.tw",
        "market_cap": "Mid Cap"
    },
    "8054.TWO": {
        "short_name": "ALCOR MICRO CORP",
        "long_name": "Alcor Micro,Corp.",
        "summary": "Alcor Micro,Corp., a fabless IC design company, designs, develops, and markets integrated semiconductor chips and software solutions for the personal computer peripherals and consumer electronics worldwide. The company offers human interface input and output solutions, such as flash media reader, USB hub, camera, and other multimedia related controllers. It also provides mobile device, data link, USB flash disk, and SSD storage controllers, as well as SD card controllers. The company was founded in 1999 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "115",
        "website": "http://www.alcormicro.com",
        "market_cap": "Mid Cap"
    },
    "8071.TWO": {
        "short_name": "ABICO NETCOM CO LTD",
        "long_name": "ABICO NetCom Co.,Ltd.",
        "summary": "ABICO NetCom Co.,Ltd. operates as a pre-recorded disk manufacturing company. The company engages in the real estate investment business; film production/marketing/acting agent business; and investment businesses. It offers contact lenses; digital business machines, POS systems, and communication systems; sports related supplies; machines and printers; components and production molds; auto parts, modules, power tool machine gear packs, and residential appliances/ OA-related parts; mobile phones, digital cameras, 3C electronics products, metal and plastic chassis exterior parts, and internal components; and digital imaging products. The company was formerly known as ABICO-FS Co., Ltd. and changed its name to ABICO NetCom Co.,Ltd. in 2019. ABICO NetCom Co.,Ltd. was founded in 1993 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.fstdisc.com.tw",
        "market_cap": "Small Cap"
    },
    "8076.TWO": {
        "short_name": "FIRICH ENTERPRISES CO",
        "long_name": "Firich Enterprises Co., Ltd.",
        "summary": "Firich Enterprises Co., Ltd. engages in the design and manufacture of POS systems worldwide. The company offers XPOS and mobile POS products; POS and BOX systems; lite, fanless, and performance panel PCs; monitors; kiosks; and peripherals. It provides POS solutions for the hospitality and retail markets. The company was founded in 1995 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "221",
        "website": "http://www.fecpos.com",
        "market_cap": "Mid Cap"
    },
    "8087.TWO": {
        "short_name": "HOMENEMA TECHNOLOG",
        "long_name": "Homenema Technology Incorporation",
        "summary": "Homenema Technology Incorporation manufactures and sells professional pre-recorded optic discs in Taiwan. The company offers compact discs (CDs) consisting of audio and video CDs, as well as mixed mode, ROM, and card CDs; and digital versatile discs. It also provides packaging services. The company's products are used in digital music and videos, gaming, software, and business cards applications. Homenema Technology Incorporation was founded in 1997 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.homenema.com",
        "market_cap": "Small Cap"
    },
    "8088.TWO": {
        "short_name": "PANRAM INTERNATIONAL CORP",
        "long_name": "Panram International Corp.",
        "summary": "Panram International Corp. provides electronic manufacturing services in Taiwan. The company offers services, such as ODM and OEM services, as well as product design, raw material procurement, logistic management, transportation, product testing, and RMA services. Its products include DRAM modules; flash memory products, such as pen drives and fingerprint drives; I/O products; keyboards, touch panel control boards, and VGA cards; and embedded storage products, touch screen controllers, and card readers. The company also provides SSDs, SD/microSD cards and USB modules, FDM modules, conformal coatings, and anti-sulfur modules. Panram International Corp. was founded in 1994 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.panram.com.tw",
        "market_cap": "Small Cap"
    },
    "8093.TWO": {
        "short_name": "ENERMAX TECHNOLOGY CORP",
        "long_name": "Enermax Technology Corporation",
        "summary": "Enermax Technology Corporation manufactures and sells PC components and peripherals worldwide. It offers power supplies; cases comprising full, mid, and mini towers; fans; air and liquid coolers; peripherals, such as monitor stands, USB fans, air guides, headset holders, blackplane modules, mobile racks, card readers, HDD enclosures, keyboards, and notebook coolers; and audio products, including speakers and earphones. The company was founded in 1990 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "330",
        "website": "http://www.enermax.com.tw",
        "market_cap": "Small Cap"
    },
    "8119.TWO": {
        "short_name": "Clientron",
        "long_name": "Clientron Corp.",
        "summary": "Clientron Corp. provides integrated embedded solutions worldwide. It designs, manufactures, and supplies thin client solutions, POS systems, automotive electronics, and embedded computing solutions, as well as offers after sales services. The company was incorporated in 1983 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "221",
        "website": "http://www.clientron.com",
        "market_cap": "Small Cap"
    },
    "8163.TW": {
        "short_name": "DARFON ELECTRONICS CORP",
        "long_name": "Darfon Electronics Corp.",
        "summary": "Darfon Electronics Corp. provides eco-friendly technologies for IT peripherals, passive components, and green energy solutions. It offers human interface devices, including laptop keyboards, desktop keyboards, and IT accessories and gaming products; wired headphones and wireless headsets, mice, and keyboards; and point stick, full cap printing, RGB backlight, thin switches, and gaming switches. The company also provides capacitors, inductors, and bead products. In addition, it offers robot cleaners, server storage BBUs, and e-bike and high-voltage automobile batteries; and micro-inverter solar power systems and hybrid solar power systems. Further, the company provides battery pack products, such as vacuum cleaners, robot cleaners, multi-function cleaners, handheld cleaners, and portable TV and camera products; micro inverters, hybrid inverters and systems, and energy storage devices; and outdoor lighting rugged and panel backlight drivers, as well as charger and power supplies, such as e-bike chargers. It has operations in Taiwan, Mainland China, Japan, Korea, the United States, the Czech Republic, the Netherlands, and Germany. The company was incorporated in 1997 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "333",
        "website": "http://www.darfon.com.tw",
        "market_cap": "Large Cap"
    },
    "8210.TW": {
        "short_name": "CHENBRO MICOM CO",
        "long_name": "Chenbro Micom Co., Ltd.",
        "summary": "Chenbro Micom Co., Ltd. engages in the design, manufacture, processing, and trading of computer peripherals and systems. It offers barebone servers; rackmount, tower server, and PC chassis; storage expansion kit; and OEM/JDM services. The company is also involved in the software design activities; and export and import of computer products and peripherals. It operates in the United States, China, Taiwan, and internationally. The company was founded in 1983 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "235",
        "website": "http://www.chenbro.com",
        "market_cap": "Mid Cap"
    },
    "8234.TWO": {
        "short_name": "NEXCOM INTERNATIONAL CO",
        "long_name": "NEXCOM International Co., Ltd.",
        "summary": "NEXCOM International Co., Ltd. provides Internet of Things (IoT) automation solutions, intelligent platform and services, mobile computing solutions, network and communication solutions, intelligent digital security, and medical and healthcare informatics products worldwide. The company offers IoT automation solutions, such as industrial fanless computer, google cloud IoT ready solution, industrial wireless solution, industry firewall solution, IoT solution, industrial touch computer, machine automation, PC-based factory automation, and software solution; and smart system solutions, including AI accelerators, interactive signage solution packs, multimedia player application platforms, multimedia machine tablets, embedded computer, open frame tablets, TV wall digital electronic signage solutions, digital electronic signboard dedicated hardware platforms, point of sale terminals, and rack industrial computers. It also provides car computer suctions comprising AI edge telematics solutions, embedded add-on modules, mobile NVRs, car computers, car network equipment, car touch screen computers, rugged car displays, modular on-board computers, and railway computers. In addition, the company offers network communication solutions, including cyber security solutions, edge and cloud solutions, industrial gateway solutions, network peripheral solutions, and SoC capability and S/W services; and smart medical solutions, such as healthcare medical, IoT gateway, software package, and video conference system. Further, it provides intelligent monitoring solutions comprising 3D cameras, panoramic cameras, license plate recognition cameras, monitoring video platforms, and webcams; and smart system and movie and film solutions. NEXCOM International Co., Ltd. was founded in 1992 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23586",
        "website": "http://www.nexcom.com.tw",
        "market_cap": "Mid Cap"
    },
    "8299.TWO": {
        "short_name": "PHISON ELECTRONICS CORP",
        "long_name": "Phison Electronics Corp.",
        "summary": "Phison Electronics Corp. designs, manufactures, and sells flash memory controllers and peripheral system applications in Asia, the United States, Europe, Australia, and internationally. The company offers controllers and modules of SSD; controllers and modules of embedded flash used on portable applications; controllers and modules of USB; and controllers and modules of memory cards. It also designs, researches, develops, produces, sells, imports, and exports storage devices, integrated circuits, and systems and electronics hardware and software, as well as technical support services. In addition, the company manufactures and trades in electronic components. Further, it is involved in the investment activities. The company serves consumer, industrial, and enterprise markets. Phison Electronics Corp. was incorporated in 2000 and is headquartered in Miaoli, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Miaoli",
        "zipcode": "350",
        "website": "http://www.phison.com",
        "market_cap": "Large Cap"
    },
    "AC5G.F": {
        "short_name": "ACER GDR REG.S/5 TA 10",
        "long_name": "Acer Incorporated",
        "summary": "Acer Incorporated researches, designs, markets, and services personal computers (PCs), information technology (IT) products, and tablet products in the United States, Mainland China, Taiwan, and internationally. The company offers notebook and desktop PCs, LCD monitors, projectors, servers, gaming products, gadgets, mixed reality devices, cloud services and edge-computing devices, e-business and services, and digital signage solutions. It also provides electronic information, insurance captive, cloud technology, professional seminars and courses, system development and integration, property development, software defined storage, online payment, technical, social networking, cyber security, data center, and real estate services; cloud ticketing systems and electronic books; intelligent transportation and electronic ticketing programs and services; and investment funds. In addition, the company repairs and maintains IT products; researches, designs, and develops Internet of Things platform; sells communication products; operates platform for client service and products sale; and develops Internet of Beings and cloud technology; integrates cloud technology, software, and hardware. Further, it researches, develops, and sells batteries and smart bicycle speedometers; sells commercial and cloud application software and services; and designs, develops, and sells computer software and hardware, as well as provides B2B virtual reality and advisory related services. Acer Incorporated was founded in 1976 and is headquartered in New Taipei City, Taiwan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "221",
        "website": "http://www.acer-group.com",
        "market_cap": "Mid Cap"
    }
}