{
  "1558.TW": {
    "city": "Taichung",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Consumer Electronics",
    "long_name": "Zeng Hsing Industrial Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "ZENG HSING INDUSTRIAL CO",
    "state": null,
    "summary": "Zeng Hsing Industrial Co., Ltd., together with its subsidiaries, manufactures and sells household sewing machines, vacuum cleaners, aluminum alloy die-castings, and vacuum cleaner related parts in Taiwan. It provides mechanical, computerized, combo, and overlock series, as well as accessories. In addition, the company designs and manufactures floor care products. It also exports and import its products. The company was formerly known as Shin Shing Sewing Machines Co. and changed its name to Zeng Hsing Industrial Co., Ltd. in January 1975. Zeng Hsing Industrial Co., Ltd. was founded in 1968 and is headquartered in Taichung, Taiwan.",
    "website": "http://www.zenghsing.com.tw",
    "zipcode": "411"
  },
  "1604.TW": {
    "city": "Taoyuan",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Consumer Electronics",
    "long_name": "Sampo Corporation",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "SAMPO CORP",
    "state": null,
    "summary": "Sampo Corporation manufactures and sells electrical and electronic products in Taiwan. Its products include audio and video products, such as televisions and DVD players; air conditioning devices; refrigerators and freezers; home washing machines; electrical household appliances, including fans, heaters, microwave and electric ovens, electric stoves, dehumidifiers, kitchen conditioning products, drink products, health and beauty products, vacuum cleaners, and mosquito lamps; and digital signage products. The company also engages in the contracted wholesale and retail sale of electronic and electrical products, and automotive products, as well as the provision of maintenance, repair, and other services; management of warehousing operations; and import and export business. Sampo Corporation was founded in 1936 and is based in Taoyuan, Taiwan.",
    "website": "http://www.sampo.com.tw",
    "zipcode": "333"
  },
  "2439.TW": {
    "city": "Taichung",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Consumer Electronics",
    "long_name": "Merry Electronics Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "MERRY ELECTRONICS CO",
    "state": null,
    "summary": "Merry Electronics Co., Ltd. designs and manufactures electroacoustic, wireless, and battery products primarily in China, the United States, Switzerland, Denmark, Netherlands, and internationally. The company offers earphones, headsets, speakers, microphones, batteries, and assistive listening devices for use in various applications, including mobile communication, multimedia and entertainment, and medical and healthcare, as well as smart homes and accessories. It also provides professional services, including development, design, and manufacture of precision components and end products. The company was founded in 1975 and is headquartered in Taichung, Taiwan.",
    "website": "http://www.merry.com.tw",
    "zipcode": "40850"
  },
  "2477.TW": {
    "city": "Taoyuan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Consumer Electronics",
    "long_name": "Meiloon Industrial Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "MEILOON INDUSTRIAL CO",
    "state": null,
    "summary": "Meiloon Industrial Co., Ltd. operates as an ODM/OEM manufacturer for audio systems and loudspeakers worldwide. It offers studio monitor, wireless and portable, in-wall/in-ceiling, professional audio, car, and garden speakers, as well as home theater systems and other products. The company was founded in 1973 and is based in Taoyuan City, Taiwan.",
    "website": "http://www.meiloon.com.tw",
    "zipcode": null
  },
  "2488.TW": {
    "city": "Tainan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Consumer Electronics",
    "long_name": "Hanpin Electron Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "HANPIN ELECTRONIC",
    "state": null,
    "summary": "Hanpin Electron Co., Ltd. designs, manufactures, and sells electronic consumer products, professional audio products, and professional DJ equipment in Taiwan, China, Hong Kong, and Singapore. Its electronic consumer products include Hi-Fi turntables, 5 disc CD players, and CD players; professional audio products comprise power amplifiers, powered mixers, mixing consoles, equalizers, and public address systems; and professional DJ equipment consists of DJ turntables, CD/MP3 players, DJ mixers, SD/USB players, and MIDI controllers, as well as belt drive turntables, media players, and channel tabletop mixers. The company was founded in 1965 and is headquartered in Tainan City, Taiwan.",
    "website": "http://www.hanpin.com.tw",
    "zipcode": null
  },
  "2498.TW": {
    "city": "Taoyuan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Consumer Electronics",
    "long_name": "HTC Corporation",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "HTC CORPORATION",
    "state": null,
    "summary": "HTC Corporation, together with its subsidiaries, designs, manufactures, assembles, processes, and sells smart mobile and virtual reality devices in Taiwan and internationally. It offers PDA phones, smartphones, and handheld devices. The company also provides marketing, repair, and after sales services; and online/download media services, as well as human resources management services. In addition, it is involved in the general investing activities; design, research, and development of application software and graphics technology; design and management of cloud synchronization technology; and development and sale of digital education platform, as well as development of virtual reality contents. Further, the company provides app stores for virtual reality, where customers can explore, create, connect, and experience the content; and healthcare, 5G connectivity, blockchain, and artificial intelligence technologies. It provides its products through telecom service providers, distributors, and retailers; and retail stores, as well as through online. HTC Corporation was founded in 1997 and is headquartered in Taoyuan, Taiwan.",
    "website": "http://www.htc.com",
    "zipcode": "330"
  },
  "3067.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Consumer Electronics",
    "long_name": "Phonic Corporation",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "PHONIC CORPORATION",
    "state": null,
    "summary": "Phonic Corporation manufactures and sells professional audio products in the United States, Hong Kong, Guatemala, Turkey, Chile, and internationally. It offers speakers, including intelligent audio systems, mobile PA systems, studio monitors, line arrays, and PA speakers; analog, digital, and contractor amplifiers; analog, digital, and powered mixers; wireless/conference systems, microphones, and antenna AMP systems; test instruments; signal processors; and automatic audio and video equipment. The company was founded in 1972 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.phonic.com",
    "zipcode": "11070"
  },
  "3296.TW": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Consumer Electronics",
    "long_name": "Powertech Industrial Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "POWERTECH INDUSTRIAL CO",
    "state": null,
    "summary": "Powertech Industrial Co., Ltd., together with its subsidiaries, manufacture and sell electronic circuit power protection and smart home wireless remote control devices, wired and wireless communication equipment, and electronic modules and parts. It provides for IT surge protectors peripherals, such as computer, information, communication, consumer electronic, and precision electronic equipment products; power noise filters for audio and video devices that include audio, digital TV, home theater, and other related products; and IOT and smart home power safety systems to control the home power and security systems. The company also manufactures and sells power outlets, wires, cables and power cords, plastic covers, circuit board modules, and radios, as well as electrical appliances, power outlets, wires, cables, and computer peripherals; and provides after-sales services. In addition, it engages in the investment, and trading and leasing activities; and provision of management consultancy services. It serves in the United States, Asia, Europe, Australia, and internationally. Powertech Industrial Co., Ltd. was founded in 2000 and is headquartered in New Taipei City, Taiwan.",
    "website": "http://www.power-tech.com.tw",
    "zipcode": "23558"
  },
  "3541.TWO": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Consumer Electronics",
    "long_name": "Cypress Technology Co.,Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "CYPRESS TECHNOLOGY CO. LTD.",
    "state": null,
    "summary": "Cypress Technology Co.,Ltd. designs, manufactures, and sells AV and multimedia products. The company provides matrixes, splitters, switchers, extenders, scalers, video and audio products, control systems, and other products. Its products are primarily designed for signal management for home theater integration, AV signal distribution within mega stores, video production, video picture enhancement or signal format conversion, distribution, and switching. The company was founded in 1989 and is based in New Taipei City, Taiwan.",
    "website": "http://en.cypress.com.tw",
    "zipcode": "23585"
  },
  "4609.TWO": {
    "city": "Taoyuan",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Consumer Electronics",
    "long_name": "Airlux Electrical Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "AIRLUX ELECTRICAL CO",
    "state": null,
    "summary": "Airlux Electrical Co., Ltd. manufactures and sells electrical appliances in China and internationally. The company offers stand mixers, table blenders, hand blenders, cooking machines, and juice extractors, as well as electric blankets and food processors. Airlux Electrical Co., Ltd. was founded in 1976 and is headquartered in Taoyuan, Taiwan.",
    "website": "http://www.airlux.com.tw",
    "zipcode": "320"
  },
  "4930.TW": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Consumer Electronics",
    "long_name": "Star Comgistic Capital Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "STAR COMGISTIC CAPITAL CO. LTD.",
    "state": null,
    "summary": "Star Comgistic Capital Co., Ltd. manufactures and sells household appliances in Taiwan and internationally. It offers green energy products; grills, including table top grills, Panini makers, baking centers, hot pots, steak grills, multi cookers, foldable griddles, and healthy grills; food preparation products, such as blenders, mixers, food processors, and juice extractors; and home comfort products comprising dehumudifiers, heaters, fans, and vacuum cleaners. The company also provides outdoor grills; microwave and oven products; beverage products consisting of pump espresso makers, coffee makers, kettles, steam mixers, and automatic espresso makers; and garment care products, including steam irons, boil station irons, garment steamers, and LCD electronic irons, as well as frying pans and skip toasters. In addition, it designs and manufactures molds, feed and process non-ferrous metal composite materials, and new alloy materials; sells raw materials, molds, machinery equipment, and components, as well as semi-finished products; and is involved in the import, export, and wholesale of various small household electrical appliances. The company was founded in 2009 and is headquartered in Taipei City, Taiwan.",
    "website": "http://www.starcomgistic.com",
    "zipcode": null
  },
  "5283.TW": {
    "city": "Taoyuan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Consumer Electronics",
    "long_name": "Heran Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "HERAN CO LTD",
    "state": null,
    "summary": "Heran Co., Ltd. manufactures and sells home appliances in Taiwan. The company offers air conditioning products; audio-visual appliances, such as UHD LED products, full HD LED products, and LCD peripherals; refrigerators; and kitchen appliances, including dish washers, electric baking pans, microwave ovens, electric ovens, electric ceramic heaters, electric steamers, pressure cookers, quick cook pots, gourmet pots, gas fryer, and fruit and coffee machines. It also provides electric blankets, electric heaters, kerosene stoves, toilet seats, floor washing machines, electric fans, water-cooling fans, air cleaners, dehumidifiers, vacuum cleaners, mite removal machines, sweeping robots, automatic induction dryers, and LED table lamps; washing machines; freezers; commercial air conditioning products; and commercial LED display products. The company offers its products under the HERAN brand name. Heran Co., Ltd. was founded in 2002 and is based in Taoyuan, Taiwan.",
    "website": "http://www.heran.com.tw",
    "zipcode": null
  },
  "5371.TWO": {
    "city": "Hsinchu City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Consumer Electronics",
    "long_name": "Coretronic Corporation",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "CORETRONICS CORP",
    "state": null,
    "summary": "Coretronic Corporation engages in the research, development, production, and marketing of projectors, backlights, and flat panel display related products in Taiwan and internationally. The company operates through three segments: Energy-Saving Products, Image Products and Brand, and Optical Components. It provides automobile displays, tablets, notebooks, laptops, and liquid crystal displays (LCDs) and LCD TV backlight modules; panel modules, electronic whiteboard modules, and semi-systems; and system solutions for medical, educational, ATM, point of sales, and public digital splicing displays. The company also offers digital projectors and video image signals for large-screen image projections, as well as interactive modules, smart connectors, edge blending and image warping processors, and image signal processing boxes; and imaging product solutions for computer data and projection, digital signage, screen blending, interactive experience, and smart connection for video image signals. In addition, it provides electronic components; batteries; computers and its peripheral devices; electronic materials and appliances; lighting applications; optical devices; data storage and processing equipment; and wireless communications equipment. Further, the company engages in the intelligent cloud, IT information, intelligent applications, and platform development related businesses of new media, as well as offers intelligent exercise and medical care related software and hardware products. Additionally, it provides intelligent display products and system integration solutions; image processing products; near-infrared spectrum solutions; unmanned aerial vehicle and intelligent robotics; MEMS sensors and modules; and augmented reality and mixed reality wearable display solutions. The company was formerly known as Optoma Corporation and changed its name to Coretronic Corporation in December 2001. The company was incorporated in 1992 and is headquartered in Hsinchu City, Taiwan.",
    "website": "http://www.coretronic.com",
    "zipcode": null
  },
  "5489.TWO": {
    "city": "Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Consumer Electronics",
    "long_name": "DynaColor, Inc.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "DYNACOLOR INC",
    "state": null,
    "summary": "DynaColor, Inc. provides video surveillance products and automatic optical inspection systems in Taiwan. The company offers speed dome cameras, DVR products, NVR products, IP cameras, intelligent IP cameras, FA cameras and systems, and AI based surveillance systems. DynaColor, Inc. was founded in 1991 and is headquartered in Taipei City, Taiwan.",
    "website": "http://www.dynacolor.com.tw",
    "zipcode": "114"
  },
  "6201.TW": {
    "city": "Tainan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Consumer Electronics",
    "long_name": "Ya Horng Electronic Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "YA HORNG ELECTRONI",
    "state": null,
    "summary": "Ya Horng Electronic Co., Ltd. develops, manufactures, and sells audio products, household appliances, and healthcare products in Taiwan and internationally. It offers CD/MP3 players, auto mixers, amplifiers, turntables, and media controllers; appliances, such as blenders, juicers, food processors, desiccants, dehumidifiers, air purifiers, coffee makers, and kitchen masters; and health care products comprising blood pressure monitors, wearable ECGs, thermometers, and oral care products. The company was founded in 1972 and is headquartered in Tainan City, Taiwan.",
    "website": "http://www.yahorng.com",
    "zipcode": "745"
  },
  "6225.TW": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Consumer Electronics",
    "long_name": "AIPTEK International Inc.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "AIPTEK INTERNATIONAL INC",
    "state": null,
    "summary": "AIPTEK International Inc. provides digital cameras, driving recorders and micro projectors in Taiwan and internationally. The company was founded in 1986 and is based in Taipei City, Taiwan.",
    "website": "http://www.aiptek.com.tw",
    "zipcode": "30844"
  },
  "6247.TWO": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Consumer Electronics",
    "long_name": "Jazz Hipster Corporation",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "JAZZ HIPSTER CORP",
    "state": null,
    "summary": "Jazz Hipster Corporation researches, develops, manufactures, and sells audio speakers worldwide. It offers hi-fi and multi-room speakers; and earphone/mic products. The company markets its products under the JS brand. The company was founded in 1982 and is headquartered in New Taipei City, Taiwan.",
    "website": "http://www.jazzspeakers.com",
    "zipcode": "235"
  },
  "6743.TW": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Consumer Electronics",
    "long_name": "AMPACS Corporation",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "AMPACS CORPORATION",
    "state": null,
    "summary": "AMPACS Corporation engages in the design, manufacture, and sale of smart electronics. It offers audio and imaging products, such as console gaming headsets, smart IP-cameras, smart audio, hi-res audio, and Internet of Things devices, as well as smart ear buds, smart cables, speaker drivers, leather carrying cases, and phone cases. The company offers its products for smart phones, tablets, PCs, game consoles, and connected home entertainment systems. AMPACS Corporation was founded in 1998 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.ampacscorp.com",
    "zipcode": "11501"
  },
  "6784.TWO": {
    "city": "Zhubei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Consumer Electronics",
    "long_name": "Tsky Co.,Ltd",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "TSKY",
    "state": null,
    "summary": "Tsky Co., Ltd. engages in the design, development, manufacture, and sale of GPS watches and bands, and wearable devices that are used for golf, running, cycling, swimming, and track record. The company was founded in 2006 and is based in Zhubei City, Taiwan.",
    "website": "http://www.tsky.com.tw",
    "zipcode": "302"
  },
  "8201.TW": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Consumer Electronics",
    "long_name": "Inventec Besta Co.,Ltd",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "INVENTEC BESTA CO. LTD.",
    "state": null,
    "summary": "Inventec Besta Co.,Ltd engages in the design, research, development, manufacture, and sale of electronic and electrical dictionaries under the Besta brand. The company offers digital learning products, including computer and cloud dictionaries; digital life products, such as digital recorders, digital peripheries, driving recorders, power banks, tablets, and smart health products; and toddler learning products, including baby reading machines and picture books. It also engages in the cloud business, as well as investment management activities. Inventec Besta Co.,Ltd operates in Taiwan, Japan, China, Singapore, Malaysia, Mexico, and internationally. The company was founded in 1989 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.besta.com.tw",
    "zipcode": null
  },
  "HTJ.F": {
    "city": "Taoyuan City",
    "country": "Taiwan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Consumer Electronics",
    "long_name": "HTC Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "HTC CORP. GDR REG S/4",
    "state": null,
    "summary": "HTC Corporation, together with its subsidiaries, designs, manufactures, assembles, processes, and sells smart mobile and virtual reality devices in Taiwan and internationally. It offers PDA phones, smartphones, and handheld devices. The company also provides marketing, repair, and after sales services; and online/download media services, as well as human resources management services. In addition, it is involved in the general investing activities; design, research, and development of application software and graphics technology; design and management of cloud synchronization technology; and development and sale of digital education platform, as well as development of virtual reality contents. Further, the company provides app stores for virtual reality, where customers can explore, create, connect, and experience the content; and healthcare, 5G connectivity, blockchain, and artificial intelligence technologies. It provides its products through telecom service providers, distributors, and retailers; and retail stores, as well as through online. HTC Corporation was founded in 1997 and is headquartered in Taoyuan, Taiwan.",
    "website": "http://www.htc.com",
    "zipcode": "330"
  }
}
