{
    "6592.TW": {
        "short_name": "HOTAI FINANCE CO LTD",
        "long_name": "Hotai Finance Co., Ltd.",
        "summary": "Hotai Finance Co., Ltd., together with its subsidiaries, provides vehicle installment sales, and machinery and equipment leasing services in Taiwan and China. It also offers new and used car installment loans; installment loan for motorcycle and scooter; and refinance loans for car, motorcycle, and scooter. In addition, the company provides corporate financing/leasing products, such as medical, freight truck, and CNC machines leasing; installment loans for equipment and semi-finished products or materials; and factoring services. Further, it engages in passenger car leasing activities. The company was founded in 1999 and is headquartered in Taipei, Taiwan. Hotai Finance Co., Ltd. Is a subsidiary of Hotai Motor Co.,Ltd.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://www.hfcfinance.com.tw",
        "market_cap": "Large Cap"
    },
    "9941.TW": {
        "short_name": "YULON FINANCE CORPORATION",
        "long_name": "Yulon Finance Corporation",
        "summary": "Yulon Finance Corporation provides various financial services in Taiwan, China, and internationally. The company operates through Financing, Leasing, and Others segments. It offers vehicle and personal financing services, including new and used car, and motorcycle loan installments; auto mortgage loans; and auto leasing services, as well as installment plans for other products and services. The company also provides corporate financing services, such as installment plans for heavy vehicles and equipment leasing services. In addition, it offers used car sale intermediation services comprising auto auction and vehicle inspection; installment financing services for consumer goods; and advisory services, as well as acts as a business agent for secondhand vehicles. Further, the company provides temporary labor services; taxi transportation services; truck installment payment services; used vehicle authentication and evaluation services; and electric vehicles brokerage services. Additionally, it engages in the sale and brokerage of second hand vehicles; wholesale of cars and parts; wholesale and retail of information software and batteries; trading of cars; sale and maintenance of cars and parts; towing activities; and sale of automotive related products. Yulon Finance Corporation was founded in 1990 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10683",
        "website": "http://www.tac.com.tw",
        "market_cap": "Large Cap"
    },
    "9941A.TW": {
        "short_name": "YULON FINANCE CORPORATION",
        "long_name": "Yulon Finance Corporation",
        "summary": "Yulon Finance Corporation provides various financial services in Taiwan, China, and internationally. The company operates through Financing, Leasing, and Others segments. It offers vehicle and personal financing services, including new and used car, and motorcycle loan installments; auto mortgage loans; and auto leasing services, as well as installment plans for other products and services. The company also provides corporate financing services, such as installment plans for heavy vehicles and equipment leasing services. In addition, it offers used car sale intermediation services comprising auto auction and vehicle inspection; installment financing services for consumer goods; and advisory services, as well as acts as a business agent for secondhand vehicles. Further, the company provides temporary labor services; taxi transportation services; truck installment payment services; used vehicle authentication and evaluation services; and electric vehicles brokerage services. Additionally, it engages in the sale and brokerage of second hand vehicles; wholesale and retail of information software and batteries; trading of cars; sale and maintenance of cars and parts; towing activities; and sale of automotive related products. Yulon Finance Corporation was incorporated in 1990 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10683",
        "website": "http://www.tac.com.tw",
        "market_cap": "Large Cap"
    }
}