{
    "2903.TW": {
        "short_name": "FAR EASTERN DEPARTMENT STORES L",
        "long_name": "Far Eastern Department Stores, Ltd.",
        "summary": "Far Eastern Department Stores, Ltd., togethwer with its subsidiaries, operates department stores, supermarkets, and hypermarkets in Taiwan and Mainland China. The company's products portfolio includes, candies, cookies, cans, entertainment appliances, hardware, furniture, decoration items, hand-made products, stationery, library appliances, CD/DVD, camera appliances, children toys, shoes/hats/raining garments, medicine/medical equipment, cigarettes/wines, rice/corns, salts, clocks/watches/glasses, fresh foods, frozen vegetables, frozen meats/fishes, dry foods, and various flavouring soures; and gold and jewelries, tape recorders, and radar CD players, as well as silk, nylon, and cotton clothes. It also imports, exports, deals, and sells beverages; vendor machines and measurement devices; and vehicles and vehicles parts, as well as repairs vehicles, and wire and wireless telecom appliances. In addition, the company engages in the product distribution and classification, and storage business; construction, leasing, and sale of commercial and residential buildings; parking lots management activities; art gallery, works, and antiques business; and advertisement activities, as well as electronic and children's entertainment playground/facility businesses. Further, it operates restaurants, food courts, and beverage stores; film developer shops; gas stations; and hair salons and beauty services, as well as offers computer and telecom instrument services. The company operates with 10 branch stores. Far Eastern Department Stores, Ltd. was founded in 1967 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "220",
        "website": "http://www.feds.com.tw",
        "market_cap": "Large Cap"
    },
    "2910.TW": {
        "short_name": "TONLIN DEPARTMENT STORE CO",
        "long_name": "Tonlin Department Store Co.,Ltd.",
        "summary": "Tonlin Department Store Co., Ltd. operates department stores in Taiwan. The company offers fashion, beauty, and lifestyle products. It also operates cafes and restaurants. The company was founded in 1971 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.tonlin.com.tw",
        "market_cap": "Mid Cap"
    },
    "2926.TWO": {
        "short_name": "THE ESLITE SPECTRUM CORPORATION",
        "long_name": "The Eslite Spectrum Corporation",
        "summary": "The Eslite Spectrum Corporation operates department stores and shopping malls in Taiwan. It also provides real estate analysis, investment planning, and operation management services. The company engages in the engineering service, catering supplies, retail store and equipment businesses; operation of retail outlets; and supply of professional kitchen/laundry equipment, hotel supplies, exquisite cuisine, wine cellars, and catering stores. Further, it operates a hotel under the Songyan Â\u0091Eslite Travel' name. The company operates 43 stores. It provides its planning, design, sales, installation, and after sales services to international tourist hotels and fast food chain stores, coffee chain stores, Chinese and Western restaurants, clubs, sky kitchens, hospitals, and staff restaurants. The company was founded in 2005 and is based in Taipei, Taiwan. The Eslite Spectrum Corporation is a subsidiary of The Eslite Co., Ltd.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.eslitespectrum.com.tw",
        "market_cap": "Mid Cap"
    },
    "2942.TWO": {
        "short_name": "Jing Jan",
        "long_name": "Jing-Jan Retail Business Co., Ltd.",
        "summary": "Jing-Jan Retail Business Co., Ltd. owns and operates a shopping mall. The company is based in Taipei, Taiwan. Jing-Jan Retail Business Co., Ltd. is a subsidiary of Radium Life Technology Co., Ltd.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.qsquare.com.tw",
        "market_cap": "Mid Cap"
    },
    "5903.TWO": {
        "short_name": "TAIWAN FAMILYMART CO",
        "long_name": "Taiwan FamilyMart Co., Ltd.",
        "summary": "Taiwan FamilyMart Co., Ltd. operates various convenience stores in Taiwan and internationally. The company engages in the provision of warehouse tally services; electronic information services; system integrated services; sales and services of computer software and related equipment; logistics activities; manufacturing of food; and trucking, staffing, and packaging services. In addition, it wholesales and retails books and magazines, and household merchandise. As of December 31, 2019, the company operated 3,548 stores in Taiwan; and 2,801 stores in China. Taiwan FamilyMart Co., Ltd. was founded in 1988 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "107",
        "website": "http://www.family.com.tw",
        "market_cap": "Large Cap"
    },
    "5904.TWO": {
        "short_name": "POYA INTERNATIONAL CO LTD",
        "long_name": "POYA International Co., Ltd.",
        "summary": "POYA International Co., Ltd. operates personal beauty and daily merchandise stores in Taiwan. The company's stores offer makeup products and cosmetics, jewelries, daily goods, snacks, fashion hosieries, hardware products, underwear and pajamas, etc. As of April 30, 2020, it has operated 239 stores. The company was formerly known as POYA Department Store Co., Ltd. and changed its name to POYA International Co., Ltd. in June 2000. POYA International Co., Ltd. was founded in 1997 and is headquartered in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": null,
        "website": "http://www.poya.com.tw",
        "market_cap": "Large Cap"
    }
}