{
    "1784.TWO": {
        "short_name": "BIONET CORP",
        "long_name": "BIONET Corp.",
        "summary": "BIONET Corp. provides cord blood banking services in Taiwan and internationally. The company offers stem cell banking services, including stem cell storage, mesenchymal stem cell storage, dental stem cell storage, adipose stem cell, and PBSC + immune cells; and genetic testing services. It also provides stem anti-aging, rose stem rejuvenation, ultimate protection and repair, and ANIKINE series products. BIONET Corp. was founded in 1999 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "11494",
        "website": "http://www.bionetcorp.com",
        "market_cap": "Micro Cap"
    },
    "4160.TWO": {
        "short_name": "GENETICS GENERATION ADVANCEMENT",
        "long_name": "Genetics Generation Advancement Corp.",
        "summary": "Genetics Generation Advancement Corp. provides genetic testing and informatics services in Taiwan, Asia, Europe, and the Americas. The company offers pre-implantation stage, prenatal stage, newborn medical examination, health management, reproductive medicine, obstetrics and gynecology, neonatology and pediatrics, allergy/immunology/rheumatology, gastroenterology and hepatology, oncology, cardiology, and medical research testing services, as well as counseling services for clinicians and patients to identify genetic risks, genetic testing options, interpret the implications of the test results, and help patients make informed healthcare decisions. It also provides bioinformatics and computational life sciences, materials sciences, laboratory informatics, and enterprise quality management system services. The company was formerly known as Genesis Genetics Asia Corp. and changed its name to Genetics Generation Advancement Corp. in February 2016. Genetics Generation Advancement Corp. was founded in 2008 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11494",
        "website": "http://www.gga.asia",
        "market_cap": "Nano Cap"
    },
    "6615.TWO": {
        "short_name": "SOFIVA GENOMICS CO LTD",
        "long_name": "Sofiva Genomics Co.,Ltd.",
        "summary": "Sofiva Genomics Co.,Ltd. provides genetic testing services in Taiwan and internationally. The company offers prenatal services, including thalassemia carrier screening; tests for microdeletion syndromes and single-gene abnormalities; detection of common chromosome abnormalities, selected microdeletions syndromes, and selected skeletal dysplasia genetic mutations; multiple genetic diseases detection; folate metabolism genetic screening; and spinal muscular atrophy carrier screening. It also provides cancer services, such as cancer scans; real-time monitoring of tumor dynamics; hereditary cancer related genetic tests; and hereditary women's cancer tests for breast, colon, ovarian, and endometrial cancer, as well as human papillomavirus screening. In addition, the company offers rare diseases genetic testing services; and preimplantation genetic diagnosis and NGS-based preimplantation genetic screening services. Further, it provides new-born genetic testing services comprising baby scans; hereditary sensorineural hearing loss screening; congenital central hypoventilation syndrome screening; congenital cytomegalovirus infection screening test; and atopic dermatitis genetic screening. Additionally, the company offers biochemical and chromosome testing, as well as advisory and support services. It serves expectant parents, patients with genetic disorders, and their families. Sofiva Genomics Co.,Ltd. was founded in 2012 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10043",
        "website": "http://www.sofivagenomics.com.tw",
        "market_cap": "Nano Cap"
    },
    "6661.TWO": {
        "short_name": "WELGENE BIOTECH CO LTD",
        "long_name": "Welgene Biotech Co.,Ltd.",
        "summary": "Welgene Biotech Co.,Ltd. provides clinical testing services. The company offers research services, including sequencing, microarray, quantitative PCR verification, nucleic acid extraction/QC, LCM single cell experiment, and bioinformatics analysis services; and clinical application services, such as array-based genomic hybridization and non-invasive prenatal tests. It also provides reagents, consumable supplies, and instruments, as well as software services. The company was founded in 2003 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "115",
        "website": "http://www.welgene.com.tw",
        "market_cap": "Nano Cap"
    },
    "7595.TWO": {
        "short_name": "Pharmigene",
        "long_name": "Pharmigene, Inc.",
        "summary": "PharmiGene, Inc. develops, manufactures, and sells diagnostic tests worldwide. It primarily develops DNA genetic tests. The company was founded in 2005 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.pharmigene.com",
        "market_cap": "Nano Cap"
    }
}