{
    "1707.TW": {
        "short_name": "GRAPE KING BIO LTD",
        "long_name": "Grape King Bio Ltd",
        "summary": "Grape King Bio Ltd produces and sells pharmaceutical preparations, patent medicines, liquid tonics, drinks, and healthy foods in Taiwan, China, and internationally. It operates through Multi-Level Marketing, Distributors, and Original Equipment Manufacturer (OEM) segments. The company offers mushroom mycelium products, such as ganoderma lucidum, agaricus blazei, antrodia cinnamomea, cordyceps sinensis, and coriolus versicolor; probiotics, including enterococcus, bifidobacterium, lactobacillus, pediococcus, streptococcus, saccharomyces, and clostridium; and enzymes. It also provides OEM, original design manufacturing, formulation design, research and development, and raw material supply services. The company was founded in 1969 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "324",
        "website": "http://www.grapeking.com.tw",
        "market_cap": "Small Cap"
    },
    "1731.TW": {
        "short_name": "MAYWUFA CO",
        "long_name": "Maywufa Company Ltd.",
        "summary": "Maywufa Company Ltd. manufactures and sells hair and skin care products under the Maywufa brand in Taiwan. It offers hair color creams; health care products and food supplements; and mother and baby skin care products under the mustela brand. The company also provides pharmaceuticals and medical devices, such as PG2 Lyophilized injection for treatment of cancer-related fatigue; AmCad-UT Detection device, an ultrasound CAD for thyroid cancer detection; and Bio-Three tablets for the treatment of mild diarrhea, abdominal pain, and constipation. In addition, it sells and distributes pharmaceutical products; and operates and manages pharmacy chain under the Pharmacy Franchise name. Maywufa Company Ltd. was founded in 1976 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "105",
        "website": "http://www.maywufa.com.tw",
        "market_cap": "Small Cap"
    },
    "1789.TW": {
        "short_name": "SCINOPHARM TAIWAN LTD",
        "long_name": "ScinoPharm Taiwan, Ltd.",
        "summary": "ScinoPharm Taiwan, Ltd., together with its subsidiaries, researches and develops, produces, and sells CGMP active pharmaceutical ingredients (API) to pharmaceutical companies in Taiwan, the United States, Europe, India, rest of Asia, and internationally. The company offers custom synthesis services for biochemistry molecules, such as peptides and nucleic acids; generic API manufacturing services; and outsourcing services. It also provides CRAM services, such as chemistry skill, analytical and regulatory, chemical process development, clinical drug substance, and consulting services for the development and manufacturing of clinical, small-scale, and commercial-stage APIs and intermediates. In addition, the company develops peptide synthesis technologies. Further, it develops and manufactures western medicines and other chemical materials, albumin medicines, oligonucleotide medicines, injections, and new small molecule drugs, as well as provides biological technology services and technical services. The company has a strategic alliance with Baxter International Inc. to develop, manufacture, and commercialize of antiemetic drug in chemotherapy for cancer. ScinoPharm Taiwan, Ltd. was founded in 1997 and is headquartered in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "74144",
        "website": "http://www.scinopharm.com",
        "market_cap": "Small Cap"
    },
    "1795.TW": {
        "short_name": "LOTUS PHARMACEUTICAL CO",
        "long_name": "Lotus Pharmaceutical Co., Ltd.",
        "summary": "Lotus Pharmaceutical Co., Ltd. researches, develops, manufactures, and sells medicines in Taiwan, Korea, the United States, and internationally. Its product portfolio focuses on generics in the fields of oncology, cardiology, nephrology, and central nervous system disease. The company also sells and markets a portfolio of over-the-counter medicines. In addition, it engages in wholesale of cosmetics; retail of clinical machines; biotech technological services; and related consulting services. Lotus Pharmaceutical Co., Ltd. was founded in 1966 and is headquartered in Taipei City, Taiwan. Lotus Pharmaceutical Co., Ltd. is a subsidiary of Alvogen Emerging Markets Holdings Limited.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "110",
        "website": "http://www.lotuspharm.com.tw",
        "market_cap": "Small Cap"
    },
    "1796.TWO": {
        "short_name": "GENEFERM BIOTECHNOLOGY CO LTD",
        "long_name": "GeneFerm Biotechnology Co., Ltd.",
        "summary": "GeneFerm Biotechnology Co., Ltd. develops, manufactures, markets, and sells fermented products in Taiwan and internationally. The company offers a range of raw materials, such as fermented microbial, fungi, and fruits and vegetables products; probiotics; and herbal extracts and animal derived peptides and powders. It also provides ODM, as well as fermentation toll manufacturing services to companies for the development and manufacture of dietary supplements, functional foods, health food products, and various applications. The company was founded in 1999 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "11503",
        "website": "http://www.geneferm.com",
        "market_cap": "Small Cap"
    },
    "3054.TW": {
        "short_name": "LIWANLI INNOVATION CO LTD",
        "long_name": "LIWANLI Innovation Co., Ltd.",
        "summary": "LIWANLI Innovation Co., Ltd. operates in the biomedical science industry. The company provides products in the areas of nutrition and healthcare. It offers Vigoway and powder collection products for male, female, elderly, and children audience. The company was formerly known as Carry Technology International Co., Ltd. and changed its name to LIWANLI Innovation Co., Ltd. in 2015. LIWANLI Innovation Co., Ltd. was founded in 1991 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "235",
        "website": "http://www.liwanli.com.tw",
        "market_cap": "Small Cap"
    },
    "3705.TW": {
        "short_name": "YUNGSHIN GLOBAL HOLDING CORPORA",
        "long_name": "YungShin Global Holding Corporation",
        "summary": "YungShin Global Holding Corporation, through its subsidiaries, produces and sells pharmaceutical products. The company offers medicines and feed additives for swine, ruminants, poultry, pets, and aquatics; APIs, API intermediates, and specialty chemicals, as well as CRO and CMO services; herbal products; health foods; and beauty care products. It also operates EYES testing laboratories for food safety testing; and offers western medicines, agricultural products, chemical intermediates, and over-the-counter medicines. In addition, the company imports and exports pharmaceuticals, APIs, bio-products, and functional food materials; exports medicine-manufacturing machines and components, and medicine/food ingredients, as well as related materials, such as ampoules and vials; imports tablet-analysis equipment; and operates a nursing home for senior care. It operates in Taiwan, China, the United States, Japan, Malaysia, Hong Kong, Singapore, Thailand, Indonesia, Cambodia, and South Africa. The company was founded in 1952 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10541",
        "website": "http://www.yungshingroup.com",
        "market_cap": "Small Cap"
    },
    "4105.TWO": {
        "short_name": "TTY BIOPHARM COMPANY LIMITED",
        "long_name": "TTY Biopharm Company Limited",
        "summary": "TTY Biopharm Company Limited, a pharmaceutical company, develops and markets branded generics in Taiwan and internationally. It offers oncology drugs, such as Lipo-Dox, Lonsurf, UFUR, TS-1, Pexeda, Gemmis, Oxalip, Irino, Epicin, Tynen, Anazo, Folina, Folina inj, Thado, Andason, Ivic, Asadin, Leavdo, Painkyl, Megest, Episil, Otril, and Zobonic for anti-cancer therapies. The company also provides anti-infection drugs, including Brosym, Colimycin, Cubicin, Lipo-AB, Metacin, Cepiro, and FlucelvaxQuad. In addition, it offers healthcare related drugs, such as Algitab, Alginos, Bio-Cal Plus, and Sulfin for gastrointestinal, bone, and metabolic healthcare. The company also holds a license to develop and commercialize Remimazolam, an ultra-short-acting intravenous benzodiazepine sedative/anesthetic. The company was founded in 1960 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11503",
        "website": "http://eng.tty.com.tw",
        "market_cap": "Small Cap"
    },
    "4108.TW": {
        "short_name": "PHYTOHEALTH CORP.",
        "long_name": "PhytoHealth Corporation",
        "summary": "PhytoHealth Corporation researches and develops, manufactures, and sells pharmaceutical drugs, cosmetics, Class B drugs, and dietary supplements in Asia. Its products include PG2 Lyophilized injection for the treatment of cancer related fatigue; EnerCharge, which is used in enhancing physical strength, maintaining good spirits, and enhancing health maintenance activities; NatoCleanse capsules, which helps to reduce the risk of cardiovascular diseases; ReyeasCleanse health food capsules; and EnerCharge, an energy drink. The company also offers precision medical equipment and instruments; and computer-aided diagnosis development and authorization services. PhytoHealth Corporation was founded in 1998 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "105",
        "website": "http://www.phytohealth.com.tw",
        "market_cap": "Small Cap"
    },
    "4114.TWO": {
        "short_name": "SYNMOSA BIOPHARMA CORP",
        "long_name": "Synmosa Biopharma Corporation",
        "summary": "Synmosa Biopharma Corporation, a specialty pharmaceutical company, researches and develops, manufactures, markets, and distributes pharmaceutical and healthcare products under the Synmosa brand in Taiwan. It offers its products in various therapeutic areas, including cardiovascular, respiratory, urology, sex hormone, and oncology. The company provides its products in various forms, such as effervescent tablets, granules, nasal sprays, metered dosed inhalers, and other forms. It also offers contract manufacturing services. The company also exports its products to South Africa, China, Hong Kong, Thailand, Singapore, Malaysia, Vietnam, Myanmar, Cambodia, Peru, Costa Rica, and Nicaragua. Synmosa Biopharma Corporation was incorporated in 1980 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.synmosa.com.tw",
        "market_cap": "Small Cap"
    },
    "4117.TWO": {
        "short_name": "GBC",
        "long_name": "General Biologicals Corporation",
        "summary": "General Biologicals Corporation engages in manufacturing and selling in-vitro diagnostic devices and pharmaceuticals in Taiwan and internationally. It offers real-time PCR products, including IVD kits and genesis products for breast cancer; ELISA Products comprising KIWI products; RIA products for gastrin, hepatitis, and thyroid, as well as vitamin products; rapid tests consisting of blood glucose monitoring systems, and cardiac and tumor markers, as well as products related to drug abuse, fertility hormones, and infectious diseases; lab ware products; and raw materials that comprise antibodies and antigens. The company also provides protein drugs for oral candidiasis; and point of care products for liver fibrosis and breast cancer indications. In addition, it offers products for use in clinics and laboratories for preventives and cancer diagnosis, including skin and oral care, breast cancer and liver related, and advanced cancer diagnosis products, as well as healthcare and education services. General Biologicals Corporation was founded in 1984 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30076",
        "website": "http://www.gbc.com.tw",
        "market_cap": "Small Cap"
    },
    "4119.TW": {
        "short_name": "SCI PHARMTECH INC",
        "long_name": "SCI Pharmtech, Inc.",
        "summary": "SCI Pharmtech, Inc. develops, produces, and sells active pharmaceutical ingredients, intermediates, and custom products worldwide. Its active pharmaceutical ingredients include Articaine HCl, Atomoxetine HCl, Bisoprolol Fumarate, Brinzolamide, Clindamycin Palmitate HCl, Divalproex Sodium, Duloxetine HCl, Hydroxychloroquine sulfate, Loxoprofen Sodium, Methylphenidate HCl, Pentobarbital Sodium, Probucol, Propafenone HCl, Sodium Valproate, Thiopental, Valproic Acid, Adenine, Cannabidiol, and Dexmethylphenidate HCl. The company's intermediate products comprise Azetidin-3-ol hydrogenchloride, Diethyl Isobutyl Malonate, Diethyl dipropylmalonate, Diethyl ethyl(1-methylbutyl)malonate, Pyrogallolaldehyde, Benzhydrylamine, 1-Benzhydrylazetidin-3-ol, 1-(2-Hydroxyphenyl)-3-phenylpropan-1-one, N-Methyl-4-piperidinol, Ritalinic acid, d-Ritalinic acid HCl, (1R, 2S)-1 Phenyl-2-(pyrrolldin-1-yl)propan-1-ol HCl, and (1R, 2S)-1 Phenyl-2-(pyrrolldin-1-yl)propan-1-ol. Its intermediate products also consists of (S)-3-(methylmino)-1-(2-thi-enyl)propan-1-ol, (R)-3-(Methylamino)-1-phenylpropanol, (1S,4R)-1-methyl-4-(prop-1-en-2-yl)cyclohex-2-enol, Menthadienol, 5-pentylbenzene-1,3-diol Olivetol, Methyl 2,4-dihydroxy-6-pentylbenzoate, and Ethyl 2,4-dihydroxy-6-pentylbenzoate Ethyl Olivetolate. The company also provides custom manufacturing services. SCI Pharmtech, Inc. was founded in 1987 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33856",
        "website": "http://www.sci-pharmtech.com.tw",
        "market_cap": "Small Cap"
    },
    "4127.TWO": {
        "short_name": "TIEN LIANG BIOTECH CO LTD",
        "long_name": "Tien Liang BioTech Co., Ltd.",
        "summary": "Tien Liang BioTech Co., Ltd. produces and sells pharmaceutical products in Taiwan and internationally. The company pills for cough, lumbar bone soreness cloth, and stool and gastric problems, as well as liver, bladder, bone pain. It also provides hair removal and skin cream; pain coagulation gel and spray; alcohol, cranberry, and deep-sea oil capsules; pumpkin seed oil; soaps; and liqueur amine-based acid. Tien Liang BioTech Co., Ltd. was founded in 1960 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.tlb.com.tw",
        "market_cap": "Small Cap"
    },
    "4172.TWO": {
        "short_name": "InnoPharmax",
        "long_name": "InnoPharmax Inc.",
        "summary": "InnoPharmax Inc., a specialty pharmaceutical company, develops and commercializes products for the treatment of infectious diseases, immunology, oncology, and other specialties in Taiwan. The company offers anti-infection agents, including Bestnem, an imipenem and cilastatin sodium solution that is used intravenous in the treatment of various infections caused by susceptible organisms, such as lower respiratory tract, skin and skin structure, intra-abdominal, gynecologic, or bone and joint infections; and various complicated or uncomplicated urinary tract infections, septicemia, or endocarditis caused by susceptible organisms. It also provides gadopentetate dimeglumine, a contrast medium for magnetic resonance imaging (MRI) of the body after intravenous administration; and gadodiamide, a contrast medium for cranial and spinal MRI, as well as for general MRI of the body after intravenous administration. In addition, the company offers oncology agents comprising Innomustine for the treatment of hodgkin's disease, non-hodgkin's lymphoma, and plasmocytoma, as well as chronic lymphocytic leukemia and breast cancer; and immunological agents that include Cyclosporine A, an immuno-suppresant with a low aqueous solubility used for the inhibition of graft rejection in organ transplant recipients, as well as inpheno tablets. Further, it is developing oncology, cardiovascular, CNS, urology, and contrast agents, as well as agents for metabolic disorders and drugs for rare diseases. The company was founded in 2005 and is based in Taipei City, Taiwan. InnoPharmax Inc. is a subsidiary of Synmosa Biopharma Corporation.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "11492",
        "website": "http://www.innopharmax.com",
        "market_cap": "Small Cap"
    },
    "4191.TWO": {
        "short_name": "PHD",
        "long_name": "Pharmadax Inc.",
        "summary": "Pharmadax Inc. engages in the pharmaceutical research and development business in Taiwan, the Unites States, China, and internationally. It primarily focuses on the development of oral solid controlled-release technology pellets. The company offers Glyburide, Quetiapine Fumarate ER, and Metoprolol Succinate ER tablets, as well as contract development and/or contract manufacturing services for solid orals. It provides its products for a range of therapeutic areas, including schizophrenia, hypertension, diabetes, cold, Parkinson's disease, ADHD, chronic hepatitis, overactive bladder, and muscle relaxant. The company was founded in 2008 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23553",
        "website": "http://www.pharmadax.com",
        "market_cap": "Small Cap"
    },
    "4746.TW": {
        "short_name": "FORMOSA LABORATORIES INC",
        "long_name": "Formosa Laboratories, Inc.",
        "summary": "Formosa Laboratories, Inc. produces and sells active pharmaceutical ingredients (APIs) worldwide. The company offers APIs in the areas of anticancers, anti-inflammatory and analgesic agents, MRI enhancing agents, polymeric drugs, CNS agents, immunomodulators, respiratory agents, steroids, vitamin D derivatives, and antibiotics. It also provides contract development and manufacturing services; solutions for manufacturing antibody-drug conjugates; and injectable manufacturing services. The company was founded in 1995 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33842",
        "website": "http://www.formosalab.com",
        "market_cap": "Small Cap"
    },
    "6472.TWO": {
        "short_name": "BORA PHARMACEUTICALS CO LTD",
        "long_name": "Bora Pharmaceuticals Co., LTD.",
        "summary": "Bora Pharmaceuticals Co., LTD. engages in the research, development, production, marketing, sale, and distribution of pharmaceutical products worldwide. It manufactures and sells generic, brand, and over-the-counter (OTC) drugs. The company is involved in contract development and manufacturing; consumer healthcare and OTC; and prescription drugs businesses. It also provides clinical and commercial manufacturing services, including solvent manufacturing; solid and liquid dosage forms; extrusion spheronization; immediate and extended release; core, sugar-coated, and film-coated tablets; fixed-dose combination products; and granules, and liquids sachet/stick pack filling. In addition, the company offers pharmaceutical development services, such as liquid and solid dosage forms, and immediate and modified release, analytical method development and validation; packaging and serialization services, which include bottle and blister packaging, and sachets; and raw materials and finished products testing, and analytical techniques services, as well as method verification, validation, and transfer. Further, it provides OTC medicines, foods and vitamins supplements; and skincare products. Additionally, the company also offers market analysis, drug and regulatory related services, price development, GDP warehousing, distribution, packaging, marketing planning, and sales services. The company's sales and distribution network comprises medical centers, hospitals, clinics, pharmacies, drug stores, CVS, and specialty channels. Bora Pharmaceuticals Co., LTD. was founded in 2007 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.bora-corp.com",
        "market_cap": "Small Cap"
    },
    "6496.TWO": {
        "short_name": "EXCELSIOR BIOPHARMA INC",
        "long_name": "Excelsior Biopharma Inc.",
        "summary": "Excelsior Biopharma Inc. develops pharmaceutical products in Taiwan. The company offers prescription drugs, over-the-counter drugs, medical devices, healthcare food products, medical supplies, and skin products. It provides its products for the therapeutic areas, such as pediatrics, gastroenterology, neurology, cardiology, dermatology, medical toxicology, dentistry, obstetrics and gynecology, anesthesiology, orthopedics, neonatology, oncology, pulmonary medicine, nephology, and others, etc. The company also offers test kits under the Actim name to detect inflected C-reactive protein, influenza virus, colorectal cancer, acute pancreatitis, preterm birth, and early water-breaking. In addition, it provides oral care products, including oral cleansing toothpaste, mouthwash and gel; and health food and cosmetic products. Excelsior Biopharma Inc. also exports its products. The company was formerly known as Excelsior Enterprise Co., Ltd. Excelsior Biopharma Inc. was founded in 1988 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.excelsiorgroup.com.tw",
        "market_cap": "Small Cap"
    },
    "6576.TWO": {
        "short_name": "FORESEE PHARMACEUTICALS CO LTD",
        "long_name": "Foresee Pharmaceuticals Co., Ltd.",
        "summary": "Foresee Pharmaceuticals Co., Ltd., clinical-stage pharmaceutical company, engages in the development and commercialization of drugs in Taiwan and Europe. The company's stabilized injectable formulation pipeline includes FP-001, which completed Phase III clinical study for the treatment of advanced stage prostate cancer; FP-004 that is in preclinical stage to treat opioids use disorder; FP-011 and FP-014, a long-acting sustained release dosage form for the treatment of breast cancer/prostate cancer; FP-015, for the treatment of neurological diseases; and FP-002 for the treatment of acromegaly, as well as FP-008 for the treatment of diabetic retinopathy. Its new chemical entity pipeline products consists of FP-020 to treat alport syndrome; FP-025, a selective matrix metalloproteinase-12 inhibitor, which is in Phase II clinical trial for the treatment of asthama, chronic obstructive pulmonary diseases, and emphysema or sarcoidosis; and FP-045, a small molecule mitochondrial aldehyde dehydrogenase 2 that completed Phase I clinical study for the treatment of peripheral arterial disease, fanconi anemia, and cardiorenal metabolic diseases. The company's strategic partners include Pierre Fabre Medicament Production and ScinoPharm. Foresee Pharmaceuticals Co., Ltd. was founded in 2013 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "115",
        "website": "http://www.foreseepharma.com",
        "market_cap": "Small Cap"
    },
    "6620.TWO": {
        "short_name": "Handa Pharma",
        "long_name": "Handa Pharmaceuticals, Inc.",
        "summary": "Handa Pharmaceuticals, Inc., a specialty pharmaceutical company, focuses on the development of drugs for various diseases in the United States and China. It is developing various general delivery systems, including matrix system, reservoir system, matrix plus reservoir system, osmotic pump system, and colon delivery system. The company also develops modified release dosage forms, such as orally disintegrating tablets, modified release orally disintegrating tablets, modified release suspension systems, and ophthalmic modified release systems. In addition, it develops 505(b)2 and generic drugs. The company is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "74147",
        "website": "http://www.handapharma.com.tw",
        "market_cap": "Small Cap"
    },
    "6621.TWO": {
        "short_name": "UniPharma",
        "long_name": "UniPharma Co., Ltd.",
        "summary": "UniPharma Co., Ltd. engages in the brand drug development activities. The company offers adhesion reduction, neurology, cardiovascular, and anesthesia solutions; and antidotes, as well as medical devices and in vitro-diagnostic products. It also develops bio-markers for the diagnosis of neurological disease; and operates a laboratory for neurological bio-markers. The company was founded in 1998 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11494",
        "website": "http://www.uni-pharma.com",
        "market_cap": "Small Cap"
    },
    "6677.TWO": {
        "short_name": "Anxo",
        "long_name": "Anxo Pharmaceutical Co., Ltd.",
        "summary": "Anxo Pharmaceutical Co., Ltd., a specialty pharmaceutical company, develops, manufactures, and sells pharmaceutical products for medical professionals and patients in Taiwan and internationally. It offers prescription and over the counter drugs in various therapeutic areas, such as cardiovascular, metabolism, CNS, diabetic, gastroenterology, respiratory, anti-infection, dermatology, nephrology, urology, orthopedics, etc. The company was founded in 2003 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10489",
        "website": "http://www.anxo.com.tw",
        "market_cap": "Small Cap"
    },
    "6817.TWO": {
        "short_name": "WINSTON",
        "long_name": "Winston Medical Supply Co.,Ltd",
        "summary": "Winston Medical Supply Co.,Ltd. engages in the development, manufacture, and distribution of pharmaceuticals, nutrition supplements, and cosmeceutical products. It offers sterile ophthalmic preparations comprising gels, suspensions, solutions, and emulsions; hormone preparations, which primarily cover birth control and oral suspension for cancer related cachexia; external use preparations comprising ointments; and other oral preparations, which are in oral dosage forms, such as powders, troches, tables, film coated tablets, chewables, and capsules for the treatment of colds, gastrointestinal issues, or other indications. The company was founded in 1974 and is based in Tainan City, Taiwan. As of January 2014, Winston Medical Supply Co., Ltd. operates as a subsidiary of Medigen Biotechnology Corp.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "71072",
        "website": "http://www.winston.com.tw",
        "market_cap": "Small Cap"
    },
    "7561.TWO": {
        "short_name": "Bioray Biotech",
        "long_name": "Bioray Biotech Co., Ltd",
        "summary": "BioRay Biotech Co., Ltd. engages in the development and manufacture of biological agents. Its biological agents include functional probiotics, medicinal fungi, and immune cell preparations. The company was founded in 1994 is based in Pingtung, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Pingtung",
        "zipcode": "90846",
        "website": "http://www.bio-ray.com.tw",
        "market_cap": "Small Cap"
    },
    "8432.TWO": {
        "short_name": "TSH BIOPHARM CORPORATION LIMITE",
        "long_name": "TSH Biopharm Corporation Limited",
        "summary": "TSH Biopharm Corporation Limited develops and markets medicines for chronic diseases in Taiwan. It offers products for cardiovascular, central nervous, gastrointestinal, and others, as well as liquid-biopsy diagnosis. The company is headquartered in Taipei city, Taiwan. TSH Biopharm Corporation Limited is a subsidiary of TTY Biopharm Company Limited.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11503",
        "website": "http://www.tshbiopharm.com",
        "market_cap": "Small Cap"
    }
}