{
    "003019.SZ": {
        "short_name": "TES TOUCH EMBEDDED",
        "long_name": "TES Touch Embedded Solutions (Xiamen) Co., Ltd.",
        "summary": "TES Touch Embedded Solutions (Xiamen) Co., Ltd., a JDM/ODM company, engages in the research, development, design, manufacture, and sale of touchscreen products in Taiwan and internationally. The company's products include open frame monitors, touch display modules, desktop monitors, panel PCs/AiO systems, KIOSK/SCO, digital signage solutions, box PCs, and PCBA. It offers products for smart retail, digital signage, healthcare, financial, and embedded applications in industry, business, hospitality, medical, financial, retail point-of-sale, and other fields. The company was founded in 2015 and is headquartered in Taipei City, Taiwan.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "Taiwan",
        "city": "Taipei City"
    },
    "0FJ.F": {
        "short_name": "FOXCONN IN.T.DL-,01953125",
        "long_name": "FIT Hon Teng Limited",
        "summary": "FIT Hon Teng Limited engages in the design, development, production, and sale of interconnect solutions and related products in Taiwan, People's Republic of China, the United States, Hong Kong, Malaysia, Singapore, and internationally. The company offers cable components, including array of IO cables assemblies, as well as wire harness and power cords. It also provides connector components comprising backplane, high speed, input/output, and power connectors, as well as memory/edge cards, sockets, terminal blocks, and wire to board/board to board connectors; and active optical cables, embedded optical modules, transceiver modules, and acoustic products. In addition, the company offers radio frequency antenna cable and module assemblies; wireless charging products and components; and accessories, such as headsets, speaker systems, and power and cable accessories. It also engages in research, development, and manufacture of batteries; manufacturing of metal processing machinery and equipment; and sale of smart home products. The company offers its products under the e Belkin, Linksys, Wemo, and Phyn brand names. It serves communications infrastructure, computers and consumer electronics, mobile and wireless devices, automotive, and industrial and medical industries. The company was formerly known as New Wing International Holdings Limited and changed its name to FIT Hon Teng Limited in June 2013. The company was incorporated in 2013 and is headquartered in New Taipei City, Taiwan. Foxconn FIT Hon Teng Limited is a subsidiary of Foxconn (Far East) Limited.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "1582.TW": {
        "short_name": "SYNCMOLD ENTERPRISE CORP",
        "long_name": "Syncmold Enterprise Corp.",
        "summary": "Syncmold Enterprise Corp. manufactures and sells LCD/LED monitor stands and plastic molding products in Taiwan. The company offers stands and hinges; and injection and molding products. It designs and manufactures plastic molds and plastics injection; engages in the assembling of monitor, AIO, and TV stand products as well as manufactures metal stamping and metal die-casting products, and parts of monitor stands. The company was formerly known as Syncmold Ltd. and changed its name to Syncmold Enterprise Corp. in 1988. Syncmold Enterprise Corp. was founded in 1979 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "1815.TWO": {
        "short_name": "FULLTECH FIBER GLASS CORP",
        "long_name": "Fulltech Fiber Glass Corp.",
        "summary": "Fulltech Fiber Glass Corp. produces and sells fiber glass yarn and fabrics in Taiwan. It offers electronic grade fiber glass yarn for use in the manufacture of fiber glass fabric, printed circuit boards, desktop and laptop computers, cellular phones, PDAs, and projection cloths, as well as industrial grade fiber glass yarn for use in the manufacture of insulation tubes. The company was founded in 1999 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "2313.TW": {
        "short_name": "COMPEQ MANUFACTURING",
        "long_name": "Compeq Manufacturing Co., Ltd.",
        "summary": "Compeq Manufacturing Co., Ltd. manufactures and sells printed-circuit boards (PCBs) in Taiwan, the United States, Asia, and Europe. It provides regular multi-layered, high density interconnection, high layer count, flexible, and rigid-flex PCBs, as well as surface mount devices; and offers module assembly services. The company was founded in 1973 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "2316.TW": {
        "short_name": "WUS PRINTED CIRCUIT CO",
        "long_name": "WUS Printed Circuit Co., Ltd.",
        "summary": "WUS Printed Circuit Co., Ltd. manufactures and sells various printed circuit boards in Taiwan. The company offers multilayer and mobile phones boards. It also provides communication RF modules, embedded passives, and high-density microvia (HDI) products. Its products are used in add-on cards, motherboards, telecom products, radio base stations, mobile phones, digital cameras, notebooks, and other digital and entertainment products. The company was founded in 1972 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Kaohsiung"
    },
    "2317.TW": {
        "short_name": "HON HAI PRECISION INDUSTRY",
        "long_name": "Hon Hai Precision Industry Co., Ltd.",
        "summary": "Hon Hai Precision Industry Co., Ltd. provides technology solutions in Japan, Ireland, the United States, Europe, Singapore, China, Hong Kong, and internationally. The company manufactures, sells, and services connectors, cases, thermal modules, wired/wireless communication products, optical products, power supply modules, and assemblies for use in the information technology, communications, automotive equipment, precision molding, automobile, and consumer electronics industries. It also manufactures automobile wires/electronic devices and electronic components, as well as machinery and equipment; and provides services of planning, advisory, and business management, as well as software and electronic information application, logistics, export processing, construction, leasing, and information/software services. In addition, the company manufactures and sells application modules and network cables assemblies; develops educational technology; holds patent applications; manufactures and trades in portable cameras; and retails office machinery and equipment, and electronic appliances. Further, it is involved in the reinvestment in the businesses relating to robots, automatic equipment, molds, parts, and accessories and corresponding services; software development, repair and after-sale services, and rental services of robots; leasing services. Additionally, the company manufactures and sells computer and data processing equipment, WIFI cards and modules, CFTVs, DVRs, Bluetooth modules, set-top boxes, and optical network terminals. It is also involved in the data storage; manufacturing of wire or wireless communication; installation of computer and satellite TV channels; and provision of mobile phone services, as well as telecom-related business. The company was founded in 1974 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "2327.TW": {
        "short_name": "YAGEO CORP",
        "long_name": "Yageo Corporation",
        "summary": "Yageo Corporation manufactures and sells passive components worldwide. The company offers automotive, current sensing, sulfur resistant, thin film precision, thick film precision, thick film general purpose, array/network, high voltage, surge, lead free, MLV, Ni/Au termination, RF attenuator, and trimmable chip resistors; and MLCCs, such as general purpose, automotive, high voltage, high capacitance, array, low inductance, high-frequency, and soft termination capacitors. It also provides through-hole resistors comprising carbon film, metal film, metal glazed film, metal oxide film, zero and low ohmic, jumper wire, cement, aluminum housed, wire wound, and other resistors; and wireless components consisting of PCB/FPCB antennas, metal antennas, ceramic patch antennas, ceramic chip antennas, and active antennas that address WWAN, WLAN/BT/ISM, GNSS, and Sub-GHz/short-range technologies, LTCC filters, and X2Y. In addition, the company offers electrolytic capacitors, including miniature, screw terminal, surface mount, snap-in, and polymer capacitors; and inductors and coils, such as chip beads, multilayer chip inductors, wire wound chip inductors, and power inductors. Further, it provides circuit protection solutions, including overvoltage protection components, such as TVS, MOV, GDT, SPG, ESD, and TSS; and overcurrent protection components, such as PPTC and NTC. Additionally, Yageo Corporation offers logistics and electronic data interchange services, as well as operates an e-commerce portal. The company offers its products for various applications, including consumer electronics, computers and peripherals, telecommunications, industrial, automotive, and alternative energy applications. It serves EMS, ODM, and OEM customers, as well as distributors. Yageo Corporation was founded in 1977 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "2359.TW": {
        "short_name": "SOLOMON TECHNOLOGY CORP",
        "long_name": "Solomon Technology Corporation",
        "summary": "Solomon Technology Corporation operates as an electronic components sales agency primarily in the Asia-Pacific region and China. The company offers automation products, including software, signal conditioner, sensor and switching, relay and timer, button and signaling device, power, motion control, illumination control, energy monitoring, connection device, condition monitoring, security, industrial Ethernet and communication, motor control, I/O module, computer and operator interface, circuit and load protection, inverter and motor, and programmable controller products. It also provides intellectual automation products, such as industrial networking device data acquisition systems; machine vision products; system integration products comprising robot automatic wear belt machines, robot tracking synchronization system, glue dispensing machine, and pickÂ\u0096up and down trolley; industrial networking products; robotic arms and finger adaptive gripper products for robot applications. In addition, the company offers LCD products; various electronic components; and ODM, OEM, light control, trash can, hand dryer, and soap dispenser products, as well as accessories. Solomon Technology Corporation was founded in 1973 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "2367.TW": {
        "short_name": "UNITECH  PRINTED CIRCUIT BOARD ",
        "long_name": "Unitech Printed Circuit Board Corp.",
        "summary": "Unitech Printed Circuit Board Corp. operates in the printed circuit board (PCB) industry in Taiwan. The company produces and sells multilayer, high-density interconnection (HDI), and rigid-flex PCBs, including one to four level and any layer HDI, as well as impedance-controlled designs. Its products are used in smart devices, automobiles, and information/communication technology applications, such as smart phones, media tablets, smart wearable devices, feature phones, GPS, POS, networking and communication products, DSC systems, etc. The company was founded in 1984 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "2368.TW": {
        "short_name": "GOLD CIRCUIT ELECTRONICS CO",
        "long_name": "Gold Circuit Electronics Ltd.",
        "summary": "Gold Circuit Electronics Ltd. manufactures and sells computer-related products worldwide. It offers servers, workstations, notebook personal computers, desktop personal computers, etc. The company's products are used in telecommunication, networking, cell phones, high-current power supplies, storage, automotive, and other fields. Gold Circuit Electronics Ltd. was founded in 1981 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "2374.TW": {
        "short_name": "ABILITY ENTERPRISE CO LTD",
        "long_name": "Ability Enterprise Co., Ltd.",
        "summary": "Ability Enterprise Co., Ltd. operates as an ODM/OEM for optical and image input devices. The company offers consumer imaging products, such as digital still, sports, and wearable cameras; imaging system products comprising edge AI, AIoT, home, and 3D depth and machine vision cameras; and camera modules, including high-end camera modules, gesture recognition systems, and automotive camera systems. It serves customers primarily in the United States, Brazil, Europe, China, and Japan. The company was founded in 1965 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "2375.TW": {
        "short_name": "KAIMEI ELECTRONIC CORP",
        "long_name": "Kaimei Electronic Corp.",
        "summary": "Kaimei Electronic Corp. manufactures and sells capacitors and motor fans. Its products include conductive polymer aluminum solid, conductive polymer hybrid, and aluminum electrolytic capacitors; and DC fans, DC blowers, AC fans, and accessories. The company sells its products in approximately 60 countries worldwide. Kaimei Electronic Corp. was founded in 1978 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "2392.TW": {
        "short_name": "CHENG UEI PRECISION INDUSTRY CO",
        "long_name": "Cheng Uei Precision Industry Co., Ltd.",
        "summary": "Cheng Uei Precision Industry Co., Ltd. designs, manufactures, and sells connectors, cable assemblies, power management devices, and battery packs to communication devices, computers, and consumer electronics manufacturers worldwide. It provides FPCs; camera modules; plastic and metal parts, including adapter shells, connector parts, charger shells, USB storage, and double injection parts; and audio products, such as wired headsets and headphones, wireless headphones, speakers, and Bluetooth audio adapters. The company also offers power banks, adapters, and supply products, as well as batteries; wearable devices and sports sensors; Internet of Things; optical lens for mobile phone, NB, PC, projector, automobile, etc., as well as megapixel lens and lens modules; computer memory modules, flash memory storage devices, and peripherals; and power management services to the electricity industry. In addition, it provides OEM/ODM for image related products, including LCD monitors, MFPs, scanners, LCD projectors, and printing devices; and power supply cord sets, AC extension cords, traveler kits, and adaptor plugs. Further, the company offers accessories, including gaming controllers, docking stations, webcams, wireless mouses, automobile gadgets, remote controls, and card readers; battery modules, battery management systems, and automotive products; and USB, mini coaxial, thunderbolt, lightning, HDMI, mouse, and monitor cables, as well as dongles. It also engages in automotive electronic product manufacturing, including automotive electronics parts, automotive air-conditioning electronic sensors and automotive navigation systems OEM/ODM, and lithium-ion battery solutions for electric vehicles and hybrid electric vehicles, as well as operates as an Apple premium reseller. The company was founded in 1986 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "2402.TW": {
        "short_name": "ICHIA TECHNOLOGIES INC",
        "long_name": "Ichia Technologies, Inc.",
        "summary": "Ichia Technologies, Inc. manufactures and sells electronic components worldwide. The company offers single sided, double sided, and multi-layer FPC boards for applications in consumer, industrial, optical fiber communication, and automotive products; and plastic, silicon rubber, and plastic + silicon rubber modules for automotive parts, consumer products, and wearable devices. It also provides FPC and MVI total solutions, auto parts solutions, wearable device solutions, and waterproof products. The company was founded in 1983 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "2409.TW": {
        "short_name": "AU OPTRONICS CORPORATION",
        "long_name": "AU Optronics Corp.",
        "summary": "AU Optronics Corp. designs, develops, manufactures, assembles, and sells thin film transistor liquid crystal displays (TFT-LCDs) and other flat panel displays. The company operates in two segments, Display and Energy. The Display segment designs, develops, manufactures, assembles, and markets flat panel displays for use in televisions, monitors, mobile PCs and devices, automobiles, industrial PCs, automated teller machines, point of sale terminals, pachinko machines, medical equipment, etc. This segment serves original equipment manufacturing service providers; and brand companies. The Energy segment manufactures and sells solar materials, including ingots, solar wafers, and solar modules, as well as provides technical engineering and maintenance services for solar system projects. This segment sells its ingot and solar wafer products primarily to solar cell manufacturers; and solar modules to installers, solar system integrators, property developers, and other value-added resellers. The company also sells and leases content management system and hardware; plans, designs, and develops construction for environmental protection and related project management; and manufactures and sells TFT-LCD modules and panels, TV sets, backlight modules, automotive parts, precision plastic parts, and motorized treadmills. In addition, it develops and sells software and hardware for health care industry; provides software and hardware integration system and equipment relating to intelligent manufacturing, as well as related consulting services; and engages in venture capital investment activities. The company operates in the People's Republic of China, Taiwan, Japan, Singapore, and internationally. AU Optronics Corp. was founded in 1996 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "2428.TW": {
        "short_name": "THINKING ELECTRONIC INDL",
        "long_name": "Thinking Electronic Industrial Co., Ltd.",
        "summary": "Thinking Electronic Industrial Co., Ltd. manufactures and sells various protective circuit components. It offers over-voltage, over-temperature, and over-current protection components. The company's products portfolio includes negative temperature coefficient, ceramic positive temperature, and polymer positive temperature coefficient thermistors; zinc oxide varistors; temperature sensors; gas discharge tubes; ESD suppressors; TVS diodes; and spark gap protectors. Its products are used in automotive, power supply, security, telecom equipment, consumer electronics, renewable energy, smart home appliances, lighting, and medical industries. The company distributes its products in Asia, Europe, and the Americas. Thinking Electronic Industrial Co., Ltd. was founded in 1979 and is based in Kaohsiung City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Kaohsiung"
    },
    "2429.TW": {
        "short_name": "PAL WONN (TW)CO.LT",
        "long_name": "Abonmax Co., Ltd",
        "summary": "Abonmax Co., Ltd manufactures and sells double-sided and multi-layer circuit boards in Taiwan and internationally. It offers interactive whiteboards, flash drives and micro SD cards, and solid state drive products. The company was formerly known as Pal Wonn (Taiwan) Co., Ltd. and changed its name to Abonmax Co., Ltd in December 2017. Abonmax Co., Ltd was founded in 1978 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "2456.TW": {
        "short_name": "CHILISIN ELECTRONICS CORP",
        "long_name": "Chilisin Electronics Corp.",
        "summary": "Chilisin Electronics Corp. engages in the manufacture and sale of inductors worldwide. The company offers power inductors, EMI-common mode chokes, EMI-beads, RF-signal inductors, RF-LTCC components, RF-antennas, wireless power transfer products, LAN transformers, power modules, and resistors and current sensors. Its products are used in 5G, IoT, Wi-Fi 6E, automotive, server/datacenter, communication, mobile and tablet, industrial, computer/laptop, and consumer applications. The company was founded in 1972 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "2459.TW": {
        "short_name": "AUDIX CORP",
        "long_name": "Audix Corporation",
        "summary": "Audix Corporation manufactures and distributes electronic components. The company manufactures electronic components, such as relays, transformers, chokes, and couplers; precision molds and finished products, including precision pressing molds and products; precision coupler parts, plastic parts for electronics and electric appliances, and plastic parts for medical devices; and coupler assemblies. It also designs, develops, and manufactures automated production equipment for CCFL and electronics; and equipment and jigs for the assembly of automobile components, as well as offers electronic switches for automobiles. In addition, the company distributes electronic components of various brands to semiconductor and consumer electronic product manufacturers. Further, it offers services for safety verification and EMC authentication, as well as for the development of software/hardware products; anechoic chamber design and construction services; and chemistry examination services. The company operates in Taiwan, Hong Kong, China, and Japan. Audix Corporation was founded in 1980 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "2472.TW": {
        "short_name": "LELON ELECTRONICS",
        "long_name": "Lelon Electronics Corp.",
        "summary": "Lelon Electronics Corp. develops, manufactures, and markets electrolytic capacitors worldwide. Its electrolytic capacitors include aluminum electrolytic capacitors, such as radial, leaded, SMD, snap-in, and screw terminal; organic conductive polymer capacitors; conductive polymer hybrid capacitors; and flame retardants. The company also produces formed aluminum foils and automatic manufacturing equipment. Its products are used in automotive electronics, telecommunication, cloud computing, and power electronics application. The company was founded in 1976 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "2484.TW": {
        "short_name": "SIWARD CRYSTAL TECHNOLOGY CO",
        "long_name": "Siward Crystal Technology Co., Ltd",
        "summary": "Siward Crystal Technology Co., Ltd manufactures and sells crystal and oscillator solutions in Taiwan, Mainland China, Japan, Singapore, the United States, and Europe. The company offers tuning fork ceramic SMD products; crystal products, such as metal DIP and SMD, ceramic SMD, and glass weld SMD products; oscillator ceramic SMD products; automotive, TCXO, VCTCXO, and VCXO ceramic SMD products; and RFID PCB tag and inlay/label products. Its products are used in various applications, such as mobile communication, tablet PCs, GPS, computer clocks, DSC, AV machines, etc. Siward Crystal Technology Co., Ltd was founded in 1988 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "3008.TW": {
        "short_name": "LARGAN PRECISION CO",
        "long_name": "LARGAN Precision Co.,Ltd",
        "summary": "LARGAN Precision Co.,Ltd, together with its subsidiary, designs, manufactures, and sells photographic and optical equipment. The company offers optical lenses, which are used in perspective mirror, single and double binoculars, fax machines, microscope, scanners, multifunction printers, mobile phone lenses, drone camera lenses, mobile 3D structured light lenses, tablets, motion-controlled gaming systems, laptop computer lenses, smart TV lenses, IP camera lenses, and automobile lenses. It also engages in the die manufacturing; wholesale of precision instruments; and medical materials and equipment manufacturing. The company was founded in 1987 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "3023.TW": {
        "short_name": "SINBON ELECTRONICS CO LTD",
        "long_name": "SINBON Electronics Co., Ltd.",
        "summary": "SINBON Electronics Co., Ltd. manufactures and sells computer peripherals, connectors, wires, and other parts in Mainland China, the United States, Taiwan, and internationally. The company operates through Cable, Electronic, and Management operation segments. It offers PCMIA signal cables, computers and peripherals I/O cables, USB link cables, flat cables, barcode scanner I/O interface modules, LCD flex boards, and LCD ultra-thin co-axial signal cables; various types of connectors used in network communications, computer peripherals, and consumer electronic products; and sweep receivers, USB pen drives, and consumer electronic products. The company also provides power rectifiers; mobile phone link cables, mobile phone connectors, and wireless antennas; RFID; fiber optic connectors, as well as LED, LCM, and high-frequency co-axial cables; and parts of automotive, medical health, and industrial products. It serves medical health, automotive and aviation, green energy, and communication industries, as well as industrial applications. The company was founded in 1989 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3026.TW": {
        "short_name": "HOLY STONE ENTERPRISE",
        "long_name": "Holy Stone Enterprise Co.,Ltd.",
        "summary": "Holy Stone Enterprise Co.,Ltd. engages in the production and sale of multilayer ceramic capacitors (MLCCs) under the IHHEC brand name in Taiwan. The company offers MLCC solutions for PoE circuits, switching power supplies, battery management systems, automotive touchscreen LCD modules, LED lightings, termination MLCCs, trackpads, SAR P-sensors, RF filters, e-compasses, ambient lights/proximity sensors, and crystals and oscillators. It also distributes IC component and memory products, active components, peripheral components, electronics components, and power components. Holy Stone Enterprise Co.,Ltd. was founded in 1981 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "3037.TW": {
        "short_name": "UNIMICRON TECHNOLOGY",
        "long_name": "Unimicron Technology Corp.",
        "summary": "Unimicron Technology Corp. engages in the development, manufacturing, processing, and sale of printed circuit boards, electrical equipment, electronic products, and testing and burn-in systems for integrated circuit products worldwide. It also provides IC testing and pre-burning, conducting IC testing and burn-in processes, screening out defective ICs, and backend services for packaging and testing processes; and HDIs, FPCs, RFs, and IC carriers, as well as connectors, and TP and ECRM. The company was founded in 1990 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "3042.TW": {
        "short_name": "TXC CORPN",
        "long_name": "TXC Corporation",
        "summary": "TXC Corporation engages in the research, design, development, production, and sale of crystal and oscillators products in Taiwan and internationally. The company's products include crystals, oscillators, and sensors, as well as automotive crystals. Its products are used in various applications, including mobile communication, wearable devices, Internet of Things, server, storage, automotive, telecommunication, and medical devices. TXC Corporation was founded in 1983 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "3044.TW": {
        "short_name": "TRIPOD TECHNOLOGY CORP",
        "long_name": "Tripod Technology Corporation",
        "summary": "Tripod Technology Corporation processes, manufactures and sells printed circuit boards (PCBs) boards and other related components in Taiwan, China, Vietnam, Thailand, South Korea, Malaysia, and internationally. The company offers various PCBs for memory modules, TFT-LCDs, hard disk drives, notebook computers, and server/work stations, as well as handsets and automotive products; and other services. It also engages in the manufacture and wholesale of chemical materials and electronic parts; trading of PCBs and raw materials of electronic parts; manufacture of electronic cash registers; and wholesale, import, and export of electronic products. In addition, the company is also involved in the development, sale, and rental of commercial housing and own-built commercial housing; and investment activities. Further, it provides management services. Tripod Technology Corporation was founded in 1991 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "3049.TW": {
        "short_name": "HANNSTOUCH SOLUTION INCORPORATE",
        "long_name": "HannsTouch Solution Incorporated",
        "summary": "HannsTouch Solution Incorporated engages in the production and sale of touch panels in Taiwan. It offers touching solutions for AMOLED and LCD monitors, wearable devices, cellphones, tablets, laptops, one-piece forming PC and industrial monitors, etc.; and TFT backplane solutions for RFID, e-book, e-board, etc. The company was founded in 1999 and is based in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Tainan City"
    },
    "3051.TW": {
        "short_name": "OPTIMAX TECHNOLOGY CORPORATION",
        "long_name": "Optimax Technology Corporation",
        "summary": "Optimax Technology Corporation manufactures and sells polarizers for liquid crystal display (LCD) manufacturers. It offers polarizers for LCD TV, laptops, mobiles, PCs, automotive LCD displays, and sunglasses. The company was founded in 1987 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "3060.TW": {
        "short_name": "MIN AIK TECHNOLOGY",
        "long_name": "Min Aik Technology Co., Ltd.",
        "summary": "Min Aik Technology Co., Ltd. manufactures and sells ultra-clean and precision components for the hard disk drive industry in Taiwan and internationally. The company provides clean room assembly, tooling design fabrication, sheet metal precision stamping tumbling plating, plastic injection molding, and in-house automation design and fabrication solutions, as well as chemical lab facilities and QA system. It also offers OEM/ODM; contract design; measurement and analysis; and strategic integration services to companies in the computer, networking, communications, consumer, and medical industries. The company was incorporated in 1979 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "3066.TWO": {
        "short_name": "TAIWAN OASIS TECHNOLOGY CO",
        "long_name": "Taiwan Oasis Technology Co., Ltd.",
        "summary": "Taiwan Oasis Technology Co., Ltd. researches, develops, and produces light emitting diode (LED) and related components worldwide. The company offers digit LED, surface mount device (SMD) LED, dot matrix, and light bar display products; chip and PLCC type SMD LED products; LED lamps; and indoor lighting products, including light tubes. It also provides commercial lighting products, including spot lights, downlights, track lights, cabinet lights, and street lights; high power LED products; printed circuit board (PCB) products; and plastic molds and injections, and PCB and LED packaging products. The company sells is product under the Oasistek brand name. Taiwan Oasis Technology Co., Ltd. was founded in 1974 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3090.TW": {
        "short_name": "NICHIDENBO CORPORATION",
        "long_name": "Nichidenbo Corporation",
        "summary": "Nichidenbo Corporation supplies passive electronic components worldwide. The company offers aluminum electrolytic and solid, multilayer ceramic, electric double layer, and film capacitors; and metal oxide varistors. It also provides resistors, inductors, and switches; and power and RF inductors, power transformers, signal magnetic products, EMC coils, sensors, actuators, power and automatic modules, magnetic material products, ceramic products, and connection products, as well as components for medical equipment. The company was founded in 1993 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3117.TWO": {
        "short_name": "TECSTAR",
        "long_name": "Tecstar Technology Co., Ltd.",
        "summary": "Tecstar Technology Co., Ltd. engages in the production and sale of inductors in Taiwan. It offers multilayer chip beads and inductors, including multilayer ferrite chip beads, multilayer chip inductors, and multilayer common mode filters; SMD power inductors and EMI beads, such as SMD power inductors, SMD common mode chokes, and wound chip beads and inductors; and Ni-Zn soft ferrite cores that include EMI suppression ferrite cores and SMD power inductor cores. The company was founded in 1995 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "3144.TWO": {
        "short_name": "THINFLEX CORPORATION",
        "long_name": "ThinFlex Corporation",
        "summary": "ThinFlex Corporation manufactures and sells flexible copper clad laminates (FCCL) and related materials in Asia, Europe, and the Americas. The company offers thin, high heat resistant, high transmittance/transparency, and asymmetric FCCL; black/white/phosphate free coverlays; composite coverlays; high-shield nano materials; composite stiffener films; RCC materials; and polyimide related laminates. It serves IC packaging industry. The company was founded in 2000 and is headquartered in Kaohsiung, Taiwan. ThinFlex Corporation is a subsidiary of Arisawa Mfg. Co., Ltd.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Kaohsiung"
    },
    "3184.TWO": {
        "short_name": "MBTC",
        "long_name": "MicroBase Technology Corp.",
        "summary": "MicroBase Technology Corp. provides drug delivery systems to patients and healthcare professionals. It specializes in Laser LIGA, a non-silicon-based micromachining technology that is used in the manufacture and development of miniaturized devices and micron-scale parts. The company provides vibrating mesh nebulizers under the Pocket Air name for the home care and hospital sectors; and micro-infusion skin care products under the PharMatrix name. MicroBase Technology Corp. was founded in 1997 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "3191.TWO": {
        "short_name": "HOLD JINN ELECTRONICS CO",
        "long_name": "Hold Jinn Electronics Co.,Ltd.",
        "summary": "Hold Jinn Electronics Co.,Ltd. manufactures and sells electronic parts and materials. It offers SMD transformer wire racks, bakelite transformer wire racks, plastic transformer wire racks, plastic bakelite engineering products, intelligent parking equipment, artificial intelligence algorithms, and smart parking equipment, as well as integrated chip design services. The company also engages in the tourism business. Hold Jinn Electronics Co.,Ltd. was founded in 1980 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "3202.TWO": {
        "short_name": "HIGH TEK HARNESS ENTERPRISES CO",
        "long_name": "High-Tek Harness Enterprise Co., Ltd.",
        "summary": "High-Tek Harness Enterprise Co., Ltd. produces and sells various computer parts and communication equipment. The company offers electronic wires, coaxial cables, and wires. It also engages in the steel structure and engineering projects, and paper businesses. The company was founded in 1984 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "3206.TWO": {
        "short_name": "KINGSTATE ELECTRONICS CORP",
        "long_name": "Kingstate Electronics Corp.",
        "summary": "Kingstate Electronics Corp. manufactures and sells acoustic products in Taiwan and internationally. It offers various products, including piezo buzzers, magnetic buzzers, micro speakers, dynamic receivers, Bluetooth speakers, and electret condenser microphones; and audio products, such as earphones, wired and wireless headphones, Bluetooth headphones, sports headphones, gaming headphones, TWS products, wireless speakers, and PSAP products; speaker module/mic module products; and personal sound amplifiers, etc. The company also provides OEM/ODM smart devices, including personal safety and wireless alarms, VoIP systems, anti-lost devices, smart doorbells, and IP speakers. The company offers its products for use in telecommunications, consumer electronics, information technology, home appliances, automotive, security, medical, and industrial equipment related industries. Kingstate Electronics Corp. was founded in 1977 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3207.TWO": {
        "short_name": "YAO SHENG ELECTRONIC CO",
        "long_name": "Yao Sheng Electronic Co., Ltd.",
        "summary": "Yao Sheng Electronic Co., Ltd. designs, produces, and sells transformers and inductors in Taiwan and internationally. It offers low frequency, LLC, flyback, LED, and flat wire transformers; and standard reactors. The company also provides FT, T, UU, and ET series common mode chokes; iron, DR, and R core chokes, as well as PFC and high current chokes. Its products are used in LCD monitors and TVs, cell phones, personal computers, TVs, and information appliances. Yao Sheng Electronic Co., Ltd. was founded in 1992 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3229.TW": {
        "short_name": "CHEER TIME ENTERPRISE CO",
        "long_name": "Cheer Time Enterprise Co., Ltd",
        "summary": "Cheer Time Enterprise Co., Ltd manufactures and sells printed circuit boards in Taiwan. The company offers high density interconnect, teflon, ceramics, load board, aluminum single/double layer, and rigid-flex boards, as well as special process products, such as copper plated on board edges, wafer test boards, countersink/counterbore holes, plated castellated holes, and VIA IN/ON PAD. Its products are used in various industries, such as GPSs, LEDs, light bars, load boards (DUT boards), IP cams, industrial PCs, etc. The company was founded in 1987 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3230.TWO": {
        "short_name": "JIIN MING INDUSTRY CO",
        "long_name": "Jiin Ming Industry Co., Ltd.",
        "summary": "Jiin Ming Industry Co., Ltd. develops, manufactures, and sells products related to metal/plastic body parts and components. The company primarily offers parts and components of notebook computers, LCD monitors, LCD TVs, and other 3C products. Its products comprise LCD display components, including bezels, back covers, support brackets, and reflectors; notebook components, such as frames, bottoms, and shieldings; flat panel display components comprising bezels, middle frames, panel brackets, and covers; and 3C product components, including MP3 covers/components, heat spreaders, and multimedia products. The company was founded in 1987 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan"
    },
    "3276.TWO": {
        "short_name": "YEU HWAN TECHNOLOGY CORP",
        "long_name": "T-Flex Techvest PCB Co., Ltd.",
        "summary": "T-Flex Techvest PCB Co., Ltd. engages in the manufacture and sale of FPC and PCB products in worldwide. The company provides original equipment manufacturing services for inner and outer layer printed circuit board lamination; and PCB inner layer optical inspection. Its products are used in portable device, camera module, auto CCD, key pad, cell phone, and LCM module applications, as well as applied in mobile phone, communication, mother, TFT-LCD, high density interconnection boards; and computer peripheral and consumer products, which include note book. The company was founded in 1999 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "3285.TWO": {
        "short_name": "MICROTIPS TECHNOLOGY INC",
        "long_name": "Microtips Technology Inc.",
        "summary": "Microtips Technology Inc. designs, develops, manufactures, and sells LCD modules, PCB assemblies, and professional audio and video design and assembly products worldwide. The company offers character, graphic, and TFT LCD modules for industrial control, medical devices, telecommunication, and new emerging products. It also provides musical instruments, including sounds effects testing machines; sound amplifiers for professional recording studios and concerts; digital musical instruments for audio studios, pubs, and clubs; and digital audio processors, live sound recorders, multi-channel mixers, sound effects, machine DSP amps, etc. In addition, the company offers finger printer modules and diaper sensors; and wireless chargers and modules, such as wireless transmitters and receivers under the AirFuel, AirON, and WiChargi brands. Further, it provides custom designed resonators, and PRU and PTU modules for power and ID form factor applications comprising wearable devices, smartphones, handheld devices, tablets, laptops, vehicles, home appliances, etc. Additionally, the company offers ODM/OEM services for audio and video products; and engineering services that include product development, electrical and mechanical engineering, tooling design, prototype engineering, manufacturing process engineering, and quality engineering, as well as valued-added design, electronics manufacturing, and logistics services. Microtips Technology Inc. was founded in 1990 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3294.TWO": {
        "short_name": "MEGAFORCE COMPANY LIMITED",
        "long_name": "Megaforce Company Limited",
        "summary": "Megaforce Company Limited engages in the research and development of opto-mechatronics and plastic components in Taiwan, China, Mexico, and the United States. The company engages in precise plastic injection molding, micro-precision structure mold development, electronic assembly, and spray printing activities. It also offers dental electromechanical integration products, surgical systems, medical integration products through Internet of Things, and medical machinery products, as well as medical teaching courses. In addition, the company provides surface treatment, post process, and assembly services; and liquid silicone rubber molding and DFM products. The company's products are used in advanced computer gaming, high-end home entertainment equipment, vehicle components, medical appliances, and aerospace equipment, as well as in computer, communication, and consumer electronics products. The company was founded in 1991 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3305.TW": {
        "short_name": "SHENMAO TECHNOLOGY INC",
        "long_name": "Shenmao Technology Inc",
        "summary": "Shenmao Technology Inc. manufactures and sells solder materials for the electronic industry worldwide. It offers SMT assembly materials, including tin lead, lead-free, water soluble, package on package, low temperature, and halogen free solder pastes, as well as adhesives; and semiconductor packaging materials, such as BGA spheres and bumping solder pastes. The company also provides wave solder assembly products comprising solder bars, cored solder wires, lead free solder wires, and halogens free solder wires; liquid fluxes; solder preforms and ribbons; and PV ribbons. Shenmao Technology Inc. was founded in 1973 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "3310.TWO": {
        "short_name": "CHIALIN PRECISION INDUSTRIAL CO",
        "long_name": "Chialin Precision Industrial Co., Ltd.",
        "summary": "Chialin Precision Industrial Co., Ltd. designs, processes, manufactures, and sells stamping dies and other related parts, precision terminals, and hardware parts in Taiwan. The company's products include bandolier pins, mobile and computer connectors, lamp and piranha lead frames, SMD lead frames, and antennas, as well as other products, such as EMI spring finger and shielding case. It is also involved in the development and leasing of houses and buildings. The company was founded in 1988 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "3311.TW": {
        "short_name": "SILITECH TECHNOLOGY CORPORATION",
        "long_name": "Silitech Technology Corporation",
        "summary": "Silitech Technology Corporation engages in the manufacture and sale of modules and rubber (plastic) products in China, Malaysia, Taiwan, the United States, India, and internationally. It offers various products, including mobile keypads, cover glasses, modules, auto parts, lighting modules, and accessories. The company's products are used in wearable device, automotive component, communication supply, and toy product applications. Silitech Technology Corporation was founded in 2001 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3321.TW": {
        "short_name": "UNIFLEX TECHNOLOGY INC",
        "long_name": "Uniflex Technology Inc.",
        "summary": "Uniflex Technology Inc. designs, manufactures, and sells flexible printed circuit (FPC) boards in Taiwan. It offers single-sided, double-sided, double access, and multi-layer FPC boards for use in various applications, such as information technology, communication, consumer electronics, automotive, medical equipment, and industrial equipment. The company was founded in 1990 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "3322.TWO": {
        "short_name": "JOINSOON ELECTROINCS MFG CO",
        "long_name": "Joinsoon Electronics Manufacturing CO., LTD.",
        "summary": "Joinsoon Electronics Manufacturing CO., LTD. designs, manufactures, and sells interconnection products worldwide. The company offers precision components, including antennas, cables, and connectors, as well as noninvasive consumable cables, customized cable assemblies, fly-lights, infrared surveillance camera cable assemblies, and CDRW and multimedia cables. It also provides electronics products, such as storage, VoIP and HDMI series, and OEM and ODM products. In addition, the company offers healthcare management products comprising infrared ear and digital thermometers. Further, it provides product consultation and technical support services that include product design and development, procurement and sourcing, and manufacturing and engineering support, as well as design manufacturing services; and electronics manufacturing services. The company was founded in 1977 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3338.TW": {
        "short_name": "TAISOL ELECTRONICS CO",
        "long_name": "TaiSol Electronics Co., Ltd.",
        "summary": "TaiSol Electronics Co., Ltd. designs, manufactures, and sells thermal management, connectors, and mobile commerce solutions in Taiwan, China, Japan, and the United States. The company offers passive and active thermal management products, including cold forged, extruded, folded fin, die-cast, brazing, and heat pipe/vapor chamber heat sinks, as well as thermal solutions for PCs, laptops, tablets, smart mobile divides, etc. It also provides semiconductor thermal management solutions, such as DT, AIO, and NB thermal modules, as well as cooling solutions for server and cloud computing applications; light-emitting diode (LED) and laser diode cooling solutions, and LED downlight and stage light cooling solutions; and optical communication and telecom cooling solutions. In addition, the company offers industrial application cooling solutions; power inverter cooling solutions; industrial robots; and control rack heat exchangers, as well as heat pipe products, including multiple heat pipes, embedded heat pipes, high-power heat pipes, vapor chambers, and looped heat pipes. Further, it provides computer electrical and electronic connectors. TaiSol Electronics Co., Ltd. was founded in 1994 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "3354.TWO": {
        "short_name": "MICROCOSM TECHNOLOGY CO",
        "long_name": "Microcosm Technology Co., Ltd.",
        "summary": "Microcosm Technology Co., Ltd. develops, produces, and supplies upstream materials for the electronic industry. It offers PSPI-Brina, a high precision photosensitive developing type Polyimide material; liquid and film type colorless polyimide material for OLED display screens, and other colorless and flexible required electronic products; and high frequency series products. The company was founded in 1996 and is headquartered in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Tainan City"
    },
    "3362.TWO": {
        "short_name": "ABILITY OPTO-ELECTRONICS TECHNO",
        "long_name": "Ability Opto-Electronics Technology Co.,Ltd.",
        "summary": "Ability Opto-Electronics Technology Co.,Ltd. engages in the research and development, design, manufacture, and sale of professional optical lenses in Taiwan and internationally. The company offers various optical lens products, including scanners, projectors, digital cameras, digital video recorders, multi-function printers, cell phone cameras, laptops, tablets, IP-cameras, monitors, automotive lens, etc.; and CCM/NB products, as well as lens for automotive, digital surveillance, special, professional, and other applications. It also provides technical services of precision optical lens. The company was formerly known as SHIAN-JINN Precision Optical Co., Ltd and changed its name to Ability Opto-Electronics Technology Co.,Ltd. in 2001. Ability Opto-Electronics Technology Co.,Ltd. was founded in 1986 and is headquartered in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "3390.TWO": {
        "short_name": "SUNFLEX TECHNOLOGY CORP",
        "long_name": "Sunflex Tech Co., Ltd.",
        "summary": "Sunflex Tech Co., Ltd. manufactures and sells flexible printed circuit boards (FPCB) in Taiwan. The company offers rigid flex, multi-layer, double side, single side double access, and single side FPCBs. Its products are used in touch panels, liquid crystal modules, computer accessories, light bars, and automotive electronics. The company was founded in 1998 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "3416.TW": {
        "short_name": "WINMATE COMMUNICATION INC",
        "long_name": "WinMate Inc.",
        "summary": "WinMate Inc. manufactures and sells industrial displays and touch screen devices worldwide. The company offers rugged mobile solutions, including rugged mobile computers and tablets, and ultra-rugged tablets; rugged industrial systems, such as industrial panel PCs and application ready panel PCs, multi-touch HMI and chassis HMI, self-interactive KIOSK, and IP67; and rugged industrial displays, including USB type-C displays, power over ethernet touch monitors, multi touch displays, sunlight readable displays, temperature displays, rack LCD/1Uconsole drawers, healthcare grade 4K and multi touch monitors, and LCD scaler boards. Its rugged embedded computing products comprise IoT gateway, single board computers, EAC PRO, M-series and marine EAC box PC, 2U-rack IPC, and DIN rail, as well as ARM, fan less, standard, and full box PCs; vehicle mounted computers include FM07 series, M101BK, FM08, FM10, and FM10Q; and digital signage and bartype products consist of bartype panel PCs and bartype displays. In addition, the company offers healthcare solutions, such as healthcare grade 4K monitors, multi-touch monitors, and mobile solutions. It serves industrial IIoT and edge computing, healthcare, food, beverage and chemical, retail, oil and gas, automotive, warehouse and logistics, marine, military, field services, heavy duty, factory automation, transportation, smart-grid, and public safety industries. WinMate Inc. was founded in 1996 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3426.TWO": {
        "short_name": "TAI SHING ELECTRONICS COMPONENT",
        "long_name": "Tai Shing Electronics Components Corporation",
        "summary": "Tai Shing Electronics Components Corporation manufactures and sells solenoids and solenoid valves under the Sun-Magnet brand. It offers open, tubular, magnet, push pull, rotary, and flapper solenoids, as well as solenoid water, air, and oil valves. The company also provides pump, sensor, and auxiliary power modules; soap dispenser products and related accessories; modularized mechatronics; and electromagnetic suckers, as well as relays under the TTi brand. In addition, it offers solenoid ODM/OEM services. The company serves customers in the water technology, total solution/module, energy (environment), home application, industrial automation, automotive, healthcare devices, sewing machine, security, and IT industries. Tai Shing Electronics Components Corporation was incorporated in 1984 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3441.TWO": {
        "short_name": "UNIQUE OPTO-ELECTRONICS CO LTD",
        "long_name": "Unique Opto-Electronics Co.,Ltd.",
        "summary": "Unique Optical Industrial Co., Ltd. develops, manufactures, processes, and trades in various optical glasses, optical lenses, lens blanks, stubble blanks, and prism blanks in Taiwan and internationally. Its products are used in cameras, camcorders, telescopes, microscopes, condensers, projectors, fax machines, copiers, scanners, monitors, digital cameras, measuring instruments, military observation equipment, medical endoscopes, camera phones, and optical communication products. The company was founded in 1949 and is headquartered in Nantou, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Nantou City"
    },
    "3455.TWO": {
        "short_name": "UTECHZONE CO. LTD",
        "long_name": "Utechzone Co., Ltd.",
        "summary": "Utechzone Co., Ltd. develops, manufactures, and markets automatic optical inspection products in Taiwan. It offers PCB, FPD, and semiconductor inspection services. The company was founded in 1992 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3481.TW": {
        "short_name": "INNOLUX CORPORATION",
        "long_name": "Innolux Corporation",
        "summary": "Innolux Corporation, together with its subsidiaries, researches, designs, develops, manufactures, and sells TFT-LCD panels, modules, and monitors of liquid crystal displays (LCD), color filters, and low temperature poly-silicon TFT-LCDs. It offers TFT-LCD panel modules and open cells for LCDs, billboards, desktop monitors, and notebooks, as well as for small and medium size products that are used to manufacture tablet computers, portable audio players, GPS for automobiles, aviation, smart home, and mobile phones. The company also provides various touch panels, including glass/glass capacitive, glass/film/film capacitive, and one glass capacitive touch panels. In addition, it imports and exports LCD display and electronics parts, as well as provides products for medical, industrial, and educational purposes. Further, the company is involved in the research, development, testing, and maintenance activities; and distribution, general investment, and storage businesses. It operates in Taiwan, China, Hong Kong, Europe, the United States, and internationally. Innolux Corporation has a strategic collaboration with E Ink Holdings Inc. to focus on expanding electronic paper products in IoT and smart city applications. The company was formerly known as Chimei Innolux Corporation and changed its name to Innolux Corporation in December 2012. Innolux Corporation was founded in 2003 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "3511.TWO": {
        "short_name": "SIMULA TECHNOLOGY INC.",
        "long_name": "Simula Technology Inc.",
        "summary": "Simula Technology Inc. designs, manufactures, and sells connectors, cables, and accessories in Taiwan, China, Europe, the United States, Asia, and Europe. It offers audio and DC jacks; solutions for wearable devices, such as pogo pin and pad, magnetic pogo connections, and wireless charging magnets and coil modules; USB products; plugs, receptacles, and cable assemblies; fleet asset management interconnect solutions; and customized solutions. Its product applications include consumer electronics, fleet telematics, medical and healthcare, and industrial and outdoor applications. Simula Technology Inc. was founded in 1990 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "3520.TWO": {
        "short_name": "JHEN VEI ELECTRONIC CO LTD",
        "long_name": "Jhen Vei Electronic Co., Ltd.",
        "summary": "Jhen Vei Electronic Co., Ltd. engages in the manufacture and sale of a range of wires and cables. The company offers USB, DC, DP, DVI, VGA, audio, and RCA cables; and wire harness and internet safety products. Its products are used for transmitting power or signals on PC, notebook computers, tablets, smart phones, portable navigation devices, smart home devices, household appliances, vehicular equipment, industrial instrument, camcorders, TVs or stereos, speakers, and USB and other electronic devices. The company also provides network security services to communications, corporations, education, and gaming industries. Jhen Vei Electronic Co., Ltd. was founded in 1986 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3523.TWO": {
        "short_name": "EFUN TECHNOLOGIES CO LTD",
        "long_name": "EFUN Technology Co.,Ltd",
        "summary": "EFUN Technology Co.,Ltd develops, manufactures, and sells various optical products in Taiwan and internationally. The company's products include quantum- dot films, high-brightness 2D/3D home projection screens, ITO transparent conductive films, surface structure diffusion films, anti-fog films, anti-blue light films, anti- electromagnetic interference films, anti-reflective films, water blocking films, non-conductive vacuum metallization coatings, screen protectors, and nano silver antibacterial films, as well as anti-bacterial, anti-splash, and anti-epidemic protective gears. The company was founded in 2000 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Tainan City"
    },
    "3526.TWO": {
        "short_name": "ALLTOP TECHNOLOGY CO LTD",
        "long_name": "Alltop Technology Co., Ltd.",
        "summary": "As of February 26, 2021,  operates as a subsidiary of Pan Jit International Inc.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3533.TW": {
        "short_name": "LOTES CO LTD",
        "long_name": "Lotes Co., Ltd",
        "summary": "Lotes Co., Ltd designs, manufactures, and sells connectors and CPU sockets for notebook and personal computers, mobile electronic devices, etc. under the LOTES brand in Taiwan, Mainland China, and internationally. The company's products include slot/edge card connectors; I/O series connectors, such as SlimSAS, OcuLink, optical fiber connectors, audio jack, RJ45, display port, HDMI, SATA/SAS, USB, Gen Z connectors, and sim card connectors; USB, fan, wire harness, DC and other cables; and battery connectors and holders. It also offers automotive connectors; and other products comprising of RF, BTB, FPC, and power connectors, as well as SPI sockets. In addition, the company researches and develops, and manages electronic components and assemblies, calculator parts, molds, plastic raw materials, industrial robots, intelligent floor sweeping robots and components, and industrial cameras, as well as import and export of goods and technologies; provides electrical and audio -visual electronic products; and develops and produces optical communication measuring instruments and optical transceivers, and related technical services. Further, it engages in property development, home rental, landscaping, and interior decoration activities; reinvestment activities; and offers surface treatment for various hardware and plastic products. Lotes Co., Ltd was founded in 1986 and is headquartered in Keelung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Keelung"
    },
    "3536.TW": {
        "short_name": "SINTRONIC TECHNOLOGY INC.",
        "long_name": "Sintronic Technology Inc.",
        "summary": "Sintronic Technology Inc. engages in the research and development, manufacture, and sale of precision ceramics and UVC sterilization products worldwide. The company offers life medical products, such as medical face masks; UVC products, including sterilization tumblers, UVC LED water sterilizers, and UVC mini sterilizers; and precision ceramics for material applications. It serves customers in opto-electronics industry. The company was formerly known as MIT Advanced Technology Inc. and changed its name to Sintronic Technology Inc. in November 2004. Sintronic Technology Inc. was founded in 2000 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "3543.TW": {
        "short_name": "JOCHU TECHNOLOGY CO LTD",
        "long_name": "Jochu Technology Co., Ltd.",
        "summary": "Jochu Technology Co., Ltd. primarily develops and manufactures optronics metal components in Taiwan and internationally. It offers metal bezels and metal back covers. The company also undertakes metal works of household furniture; and provides assistive devices of movement for elderly and disabilities, exoskeletons for heavy workload personnel, and household health care products. Jochu Technology Co., Ltd. was founded in 2000 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "3548.TWO": {
        "short_name": "JARLLYTEC CO. LTD.",
        "long_name": "Jarllytec Co. , Ltd.",
        "summary": "Jarllytec Co., Ltd. researches, develops, manufactures, and sells various hinges in Taiwan, China, the United States, Thailand, and internationally. It offers hinges for NB, LCD, LCD TVs, cell phones, PDAs, office equipment, in-car handheld type products, 3C products, medical equipment, fiber optic connectors, fiber optic patchcords, RF connectors, fiber optic splitters, fiber optic attenuators, fiber optic terminators, and couplers/WDMs, as well as metal injection/MIM. The company was founded in 1992 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3563.TW": {
        "short_name": "MACHVISION INC.",
        "long_name": "Machvision Inc.",
        "summary": "Machvision Inc. develops and sells machine vision systems for semiconductor and printed circuit board (PCB) industry in Taiwan. The company provides drilling and routing measuring series products, including Hole-AOI systems that measure the position, diameter, and roughness of a drilled hole; and EZ3D system, which is designed to perform automatic and accurate dimensional measuring systems. It also offers IC substrate, HDI, and FPCB inspection and measuring series products, such as 3D AOI systems, solid measuring viewers, and LaserVia AOIM inspection systems; AFI, FPCB AVI, and Wafer AVI inspecting systems; and CSPAFI integrating AOI+AVI algorithm and fast-capturing-multi-illumination optical systems. In addition, the company provides wiring inspection series, which includes circuit AOI system for PCB/FPC, verification, and repair; ArtWork AOI products; and LineGauge systems for use in optical measurements and QC reporting applications. Machvision Inc. was founded in 1998 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "3593.TW": {
        "short_name": "LOGAH TECHNOLOGY CORP.",
        "long_name": "Logah Technology Corp.",
        "summary": "Logah Technology Corp. engages in the design, development, and manufacture of professional precision molds, precision plastic parts forming, spraying, printing, hot-melting, automatic pinning, electroplating, and assembly products in Taiwan. The company also offers two-color, nitrogen, in-mold, RHCM cold and hot high-gloss molding products. In addition, it provides plastic shell products, such as household appliances, outdoor sports equipment, LCD TVs, AIO computers, electroacoustic, Netcom, power supplies, car materials, etc.; and automotive interior and energy parts, speakers, tablets, vacuum cleaners, mobile phones, headphones, chargers, and power banks. Logah Technology Corp. was founded in 2003 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Kaohsiung"
    },
    "3597.TWO": {
        "short_name": "AVERTRONICS INC.",
        "long_name": "Avertronics Inc.",
        "summary": "Avertronics Inc. engages in the contract manufacturing of connectors and wire-harnesses in Taiwan and internationally. The company provides automotive wire harness modules, cables, and connectors; e-bike/e-scooter battery connectors; and renewable energy solutions, such as solar energy generator and storage products, and mobile solar lighting tower. It also offers fitness and flywheel wire harnesses, as well as electric scooter for seniors; and board to board modules, high power/high current wire harnesses, PCBA modules, sensor and protecting components, and breakers. In addition, the company provides SST temperature and automobile sensors, as well as electricity breaker for the robotics industry and Internet of Things. Avertronics Inc. was founded in 1986 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "3605.TW": {
        "short_name": "ACES ELECTRONIC CO. LTD.",
        "long_name": "ACES Electronics Co., Ltd.",
        "summary": "ACES Electronics Co., Ltd. researches, develops, manufactures, and sells electronic connectors Taiwan and internationally. It offers board to board, wire-to-board, FFC/FPC, card, pin header, mini and micro luck, RJ, power, SATA, SlimSAS, universal serial bus (USB), and USB type C connectors. The company also provides battery and high definition multimedia interface connectors; DC power jacks; and camera modules, device and harness, and EV products. Its products are used various applications, such as transportation, telecom/datacom, computer and peripherals, industrial, medical, smart home appliances, cloud computing and server, automotive, and consumer electronics. ACES Electronics Co., Ltd. was founded in 1996 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "3615.TWO": {
        "short_name": "AIMCORE TECHNOLOGY CO LTD",
        "long_name": "AimCore Technology Co., Ltd",
        "summary": "AimCore Technology Co., Ltd. operates as a sputtering company in Taiwan and internationally. It offers touch panel ITO glass, TN/STN LCD ITO glass, black matrix glass, and color filter top ITO glass for applications in LCD panels, touch panels, and organic ELD panels. The company was founded in 2000 and is based in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "3622.TW": {
        "short_name": "YOUNG FAST OPTOELECTRONICS CO. ",
        "long_name": "Young Fast Optoelectronics Co., Ltd.",
        "summary": "Young Fast Optoelectronics Co., Ltd. manufactures and sells touch panel sensor products in Taiwan and internationally. It provides resistive touch panels, which are used for various applications, such as mobile phones, PDAs, and GPS navigation devices; and flat-surface touch panels for next-generation smart phones and high-end mobile devices. The company also offers capacitive touch panels for high-end cellular phones, smart phones, mobile appliances, digital cameras, car navigation systems, and other consumer electronic devices, as well as industrial control touch panels and touch screen monitors. It provides support and services comprising preliminary feasibility evaluation, market channel planning, engineering drafting, cost estimation, and mass production scheduling. The company was formerly known as The Optoelectronics Division and changed its name to Young Fast Optoelectronics Co., Ltd. in January 2000. Young Fast Optoelectronics Co., Ltd. was founded in 1999 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "3623.TWO": {
        "short_name": "TRANSTOUCH TECHNOLOGY INC.",
        "long_name": "Transtouch Technology Inc.",
        "summary": "Transtouch Technology Inc. produces and sells touch panels in Taiwan and internationally. The company offers 4-wires and 5-wires resistive touch panels, multi-point resistive touch panels and capacitive touch panels. Its products are used in HMI and multifunction printers; POS and ATMs; military and aviation; automotive industry; medical and marine applications; and gaming devices. The company was founded in 2000 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "3630.TWO": {
        "short_name": "NEWMAX TECHNOLOGY CO LTD",
        "long_name": "Newmax Technology Co., Ltd.",
        "summary": "Newmax Technology Co., Ltd. engages in the manufacture, sale, and design of photographic/optical equipment, electronic parts/components, and electrical machinery/supplies in China, Taiwan, Japan, and Vietnam. It manufactures and sells optics mirror and plastic lens to optical equipment manufacturers and computer peripheral digital imaging manufacturers. The company was founded in 1999 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "3633.TWO": {
        "short_name": "ECC",
        "long_name": "Epoch Chemtronics Corp.",
        "summary": "Epoch Chemtronics Corp. manufactures and sells backlight modules in Taiwan. It offers LED products, including panel, down, integrated, task, shelf, and art panel lights. The company's products are used in a range of applications, such as GPS, smart phones, tablets, and industrial computers. It markets and sells its products under the Epoch Lighting brand name. The company was founded in 1997 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "3645.TW": {
        "short_name": "TAIMIDE TECH INC",
        "long_name": "Taimide Tech. Inc.",
        "summary": "Taimide Tech. Inc. engages in the manufacture and sale of polyimide films (PI) in Taiwan and China. The company provides a range of polyimide films for use in flexible printed circuit boards (FPCB), coverlays, stiffeners, composited PIs, 3L FCCLs, general industry, heat-resistant tapes, pressure sensitive tapes, rigid-flex PCBs, flexible displays, flexible electronics, LED light bars, barcodes, etc. Taimide Tech. Inc. was incorporated in 2000 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "3653.TW": {
        "short_name": "JENTECH PRECISION INDUSTRIAL CO",
        "long_name": "Jentech Precision Industrial Co., Ltd",
        "summary": "Jentech Precision Industrial Co., Ltd. manufactures and sells precision metal stampings, insert and injection moldings, and machining and assembly solution worldwide. The company's principal products include thermal heat spreaders, Semiconductor Leadframes, SMD LED Leadframes, EMI sheilding cases, RF coaxial connectors, TV tuner metal chassis, HDD and floppy drive components, and DPC thin-film ceramic substrate components. Its products are used in medical, consumer electronics, semiconductor, automotive, appliance, microelectronic, and other industries. Jentech Precision Industrial Co., Ltd. was founded in 1987 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "TÃ¡oyuÃ¡n"
    },
    "3666.TWO": {
        "short_name": "OPTIVISION TECHNOLOGY INC",
        "long_name": "Optivision Technology, Inc.",
        "summary": "Optivision Technology, Inc. designs and develops optical films in Taiwan. The company offers components of the backlight modules. Its products are used in LCD backlight modules of various sizes, such as TVs, VCDs, players, projectors, etc.; notebooks, monitors, digital cameras, PDAs, tablets, and other products; mobile phones, car navigation products, etc.; electronic watches, calculators, etc.; and industrial, medical, flight, and other instruments. The company was founded in 2004 and is based in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "3673.TW": {
        "short_name": "TPK HOLDING CO LTD",
        "long_name": "TPK Holding Co., Ltd.",
        "summary": "TPK Holding Co., Ltd., together with its subsidiaries, designs, develops, and markets touch solutions in Taiwan and internationally. It offers various types of structure products, such as glass-glass and glass-film-film, as well as single glass solution, including one glass, touch-on-lens, glass-films, etc. The company's products are used in various mobile and consumer electronics devices, such as smartphones, tablet PCs, notebook PCs, ultrabook PCs, and electronic book readers. It also provides touch panel (TP) solutions for other product domains, including gambling systems, industrial control systems, medical products, handheld game consoles, and touch remote controls. The company's products are used in various businesses, such as retailing, service, banking, airport service, game consoles, display systems, and auto industries. TPK Holding Co., Ltd. was founded in 2003 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "3675.TWO": {
        "short_name": "ERIS TECHNOLOGY CORP",
        "long_name": "Eris Technology Corporation",
        "summary": "Eris Technology Corporation manufactures, tests, and sells rectifier diodes, wafers, and light-emitting diodes in Taiwan, Asia, Europe, and the United States. The company offers a range of diodes, including schottky barrier, hyper fast, fast and super-fast recovery, high efficiency, general purpose, ultra-fast, and bridge rectifiers; and diodes for solar modules, transient voltage suppressors, zener diodes, current regulative diodes, small signal diodes, and ESD protection devices. It also provides soldering pads; and manufacturing services for various products using different manufacturing modes. In addition, the company wholesales electronic components. Its products have applications in networking products, LED lamps, solar junction boxes, LED drivers, smart phone chargers, automotive products, USBs, power supply products, and lithium batteries. The company offers its products primarily to original equipment companies. Eris Technology Corporation was founded in 1995 and is headquartered in New Taipei City, Taiwan. Eris Technology Corporation is a subsidiary of Diodes Incorporated.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3679.TW": {
        "short_name": "NISHOKU TECHNOLOGY",
        "long_name": "Nishoku Technology Inc.",
        "summary": "Nishoku Technology Inc. designs and manufactures single and double steel plastic injection molds in Taiwan, the United States, rest of Asia, Europe, and internationally. The company offers single injection molding products, such as display cases, VR glass, IPAD cover, overhead console, side mirror direction light, auto interior light, car handle, and walkie-talkie. It also provides double injection molding products, including wireless Bluetooth speakers, function key, control console, and phone keypad. In addition, the company offers tooling products and electronic parts. It serves consumer, computer, auto, and communication sectors. Nishoku Technology Inc. was founded in 1980 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3689.TWO": {
        "short_name": "UDE CORP",
        "long_name": "U.D.Electronic Corp.",
        "summary": "U.D. Electronic Corp. manufactures and sells electronic components worldwide. Its products include RJ45 ICM connectors, pure connectors, LAN filters, and I/O connectors, consumer cables, surge protection devices, audio modules and dongles, and USB to RJ45 dongles, as well as automotive electronics, such as common mode filters and USB connectors. The company offers its products under the UDEJack trademark for the telecommunications, data communications, computer, industrial, and medical markets. The company was incorporated in 2005 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "3710.TWO": {
        "short_name": "ACON HOLDING INC",
        "long_name": "ACON Holding Inc.",
        "summary": "ACON Holding Inc. designs, manufactures, and sells electronic components for IT, digital home applications, handheld devices, etc. The company was founded in 2017 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3714.TW": {
        "short_name": "ENNOSTAR INC",
        "long_name": "ENNOSTAR Inc.",
        "summary": "ENNOSTAR Inc. engages in the research and development, manufacture, and sale of compound semiconductors in Taiwan. The company's products include epitaxial and chip, package and modules, and special compound semiconductors. Its products are used in displays, professional lighting, automotive, and sensing applications. The company was formerly known as EPISTAR Corporation. ENNOSTAR Inc. was founded in 1996 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "4527.TWO": {
        "short_name": "KLUEN LING MACHINERY REFRIGERAT",
        "long_name": "Kuen Ling Machinery Refrigerating Co., Ltd.",
        "summary": "Kuen Ling Machinery Refrigerating Co., Ltd. manufactures and sells ice water mainframes and air-conditioning equipment in Taiwan and internationally. Its products include water cooled and air-cooled ice water, computer room box, hot and cold water, and condenser automatic cleaning machines; ice storage tanks; vacuum dryers; refrigeration and open screw compressor units; cooling fans and direct expansion air conditioners; and direct expansion inverter air conditioning units; and ice water cooler and condensers. The company also offers OEM and ODM services for air-conditioning equipment manufacturers. Its products are used in office buildings, commercial buildings, hospitals, and schools. The company was founded in 1988 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Kaohsiung"
    },
    "4555.TW": {
        "short_name": "TAIWAN CHELIC CORP LTD",
        "long_name": "TAIWAN CHELIC Co., Ltd.",
        "summary": "TAIWAN CHELIC Co., Ltd. manufactures and sells pneumatic and electric actuator automation components in Taiwan and internationally. The company provides air source units; control valves; miniature, standard, stopper, dual rod, compact, slide table, guide, rod less, clamp, and rotary cylinders; grippers; vacuum equipment; and fitting/auxiliary equipment. It also offers accessories for pressure switches and sensing components. The company's products are used in production facilities, inspection machines, packing machines, forming machines, repairmen equipment, and factory automation applications. The company was founded in 1986 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "4933.TWO": {
        "short_name": "UBRIGHT OPTRONICS CORPORATION",
        "long_name": "Ubright Optronics Corporation",
        "summary": "Ubright Optronics Corporation manufactures and sells optoelectronics LCD backlight module components for the display industry in Taiwan. It offers prism, multi function, and quantum dot films for backlight displays; polarizer protection and anti-glare films for LCD displays; 3D curve display protection films for OLED displays; anti-static protection, in process panel protection, hard coat, masking protection, and optical clear adhesive films for touch panels; anti-glare films for E paper products; and ceramic window films for windows. The company was founded in 2003 and is based in Taoyuan City, Taiwan. Ubright Optronics Corporation is a subsidiary of Shinkong Synthetic Fibers Corporation.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "4956.TW": {
        "short_name": "EPILEDS TECHNOLOGIES INC",
        "long_name": "Epileds Technologies, Inc.",
        "summary": "Epileds Technologies, Inc. researches and develops, designs, manufactures, and sells blue, green, red, and white light LED wafers and chips in Taiwan and internationally. The company offers AlGalnP LED Chips with wavelength ranging from 580 to 860nm; and InGaN LED chips with wavelength from 380 to 550nm. Its LED wafers and chips are used in various applications, including landscape lighting, plant lighting, white light illumination, CCTV, and vehicle lighting; indicators of consumer electronics, light source of fax machines and scanners, backlight source of LCD monitors, indoor or outdoor display boards, automotive lightings, traffic signals, and illuminators; and high voltage LED chip, UV, and other applications. Epileds Technologies, Inc. was founded in 2006 and is based in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Tainan City"
    },
    "4976.TW": {
        "short_name": "CALIN TECHNOLOGY CO LTD.",
        "long_name": "Calin Technology Co., Ltd.",
        "summary": "Calin Technology Co., Ltd. manufactures and sells high-precision optical lens and components. Its products include automotive camera, security camera, projector lens, digital camera lens, DSLR, industrial lenses, and medical endoscopy lens. The company also offers aspherical glass molding lens, glass grinding, and injection-optical lenses. In addition, it provides customized development and assembly services. The company was founded in 2002 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "4995.TWO": {
        "short_name": "LITEMAX ELECTRONICS INC",
        "long_name": "Litemax Electronics Inc.",
        "summary": "Litemax Electronics Inc., together with its subsidiaries, engages in the research, development, manufacture, and sale of LCD panels and monitors in Taiwan and internationally. The company offers industrial computing products, such as embedded box, rugged panel, modular panel transportation PCs, as well as boards and modules; industrial displays, including Spanpixel resizing and square LCDs, Durapixel sunlight readable LCDs, and Navpixel marine displays, as well as custom LCD displays; accessories comprising AD, power, HDMI daisy chain, intelligent thermal control, expansion, and AMIO boards; and AIoT solutions, such as smart display and kiosk module, and AI edge computing products. It serves the transportation, digital signage, industrial, point of sale/kiosk, rugged portable, gaming, marine, and healthcare industries. The company was founded in 2000 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "5220.TWO": {
        "short_name": "HIGGSTECINC",
        "long_name": "Higgstec Inc.",
        "summary": "Higgstec Inc. engages in the research and development, design, manufacture, sale, and service of various touch solutions. The company offers standard and custom 5-wire resistive, and projected capacitive touch solutions, as well as PCAP touch controllers, and 5-wire resistive touch controllers and panels. Its products and solutions are used in various fields, including aviation, marine, education, medical, military, gaming arcade, IPC, vehicle, POS, ATM, cash register, house appliances, office automation, smart home appliances, security monitoring systems, etc. The company was founded in 2002 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "5230.TWO": {
        "short_name": "LEDLINK OPTICS INC",
        "long_name": "Ledlink Optics, Inc.",
        "summary": "Ledlink Optics, Inc. designs, manufactures, and sells optics for lighting companies and other LED manufacturers in Taiwan and internationally. The company's products include multi-lens modules, single street lenses, multi street lenses, silicone lenses, wall washer lighting lenses, color mixing lenses, waterproof lenses, elliptical beam lenses, narrow beam lenses, high-bay lighting lenses, automotive optics, V-cut lenses, ultra-thin hybrid lenses, hybrid lenses, fresnel lenses, reflectors, stage lighting lenses, and indoor lighting lenses. Its products are used in residential, commercial, street, and architectural lighting applications. The company was founded in 2008 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "5233.TWO": {
        "short_name": "Amita",
        "long_name": "Amita Technologies Inc.",
        "summary": "Amita Technologies Inc. manufactures and sells lithium-ion polymer batteries in Taiwan. The company offers cells, soft packs, hard packs, energy storage systems, E bank products, camcorder series products, and accessories. Its batteries are used in data center UPS units, power banks, power tools, battery-powered vehicles, and energy storage systems for household appliances, commercial or industrial facilities, and smart grid. The company was founded in 2000 and is based in Taoyuan, Taiwan. Amita Technologies Inc. is a subsidiary of Energy Absolute Public Company Limited.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan"
    },
    "5244.TWO": {
        "short_name": "BRIGHTEK",
        "long_name": "Brightek Optoelectronic Co., Ltd.",
        "summary": "Brightek Optoelectronic Co., Ltd. develops, manufactures, and sells semiconductor package solutions. The company offers automotive application products, such as signal and lighting, and electronics; lighting products; and solutions for security monitoring and disinfection systems. The company was formerly known as Taiwan Brightek Optoelectronic Co., Ltd. and changed its name to Brightek Optoelectronic Co., Ltd. in 2009. Brightek Optoelectronic Co., Ltd. was founded in 2001 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "5248.TWO": {
        "short_name": "PIXON",
        "long_name": "Pixon Technologies Corporation",
        "summary": "Pixon Technologies Corporation manufactures and sells imaging and optical components for makers in communications, computers, and consumer electronics field in the United States, Taiwan, Asia, and internationally. The company develops optical, electronic circuit design and application software programming of linear micro lens array, linear light source, light pipe, and contact image sensor modules (CISM) products. It offers linear light guide, CIS modules, linear micro lens array, COB chip on board, and 3-in-1 modules. The company's products application includes document scanning and printing, fax, photocopiers, MFP multifunction printers, banknote counterfeit machines, lottery, electronic whiteboard, large format textile and paper printing and scanning, and other visual inspection. Pixon Technologies Corporation was founded in 1999 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "5251.TWO": {
        "short_name": "JSW PACIFIC CORPORATION",
        "long_name": "JSW Pacific Corporation",
        "summary": "JSW Pacific Corporation manufactures and sells wireless connectivity products in Taiwan. The company offers IP cameras, video doorbells, security lighting cameras, security home control products, and smart locks. It also provides hardware and software development services. The company was founded in 1992 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "5291.TWO": {
        "short_name": "EISO ENTERPRISE CO LTD",
        "long_name": "EISO Enterprise Co., Ltd.",
        "summary": "EISO Enterprise Co., Ltd. develops and sells PCB products. Its products are used in industrial computers, Internet communication products, cars, computer equipment, electron products, power boards, and others. The company also provides LED products for use in professional cycles; and renewable energy products. EISO Enterprise Co., Ltd. was founded in 1994 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "5315.TWO": {
        "short_name": "UNITED RADIANT TECHNOLOGY",
        "long_name": "United Radiant Technology Corporation",
        "summary": "United Radiant Technology Corporation manufactures and sells liquid crystal display panels and modules. The company's panels and modules include TN, WTN, STN, WSTN, FSTN, WFSTN, and TFT. It also offers LCM products, capacitive and resistive touch panels, heat dissipations, LED lighting products, electronic shelf labels, and automotive products. The company offers its products through a network of approximately 20 distributors worldwide. United Radiant Technology Corporation was founded in 1990 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "5321.TWO": {
        "short_name": "BEST FRIEND TECHNOLOGY CO. LTD.",
        "long_name": "Best Friend Technology Co., Ltd",
        "summary": "Best Friend Technology Co., Ltd manufactures and sells printed circuit boards (PCBs). It offers flex PCBs; and rigid PCBs, such as wireless WIFI, projector, light, and power system drive boards, as well as solar panels. The company was formerly known as Yeti Electronics Co., Ltd. and changed its name to Best Friend Technology Co., Ltd in June 2008. Best Friend Technology Co., Ltd was founded in 1983 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "5324.TWO": {
        "short_name": "SHIHLIN DEVELOPMENT COMPANY LIM",
        "long_name": "Shihlin Development Company Limited",
        "summary": "Shihlin Development Company Limited operates in real estate development business in Taiwan. It offers land development, building planning, engineering construction, and after sales services. The company is also involved in catering, hotel, leisure, and recreation business. The company was founded in 1973 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "5356.TWO": {
        "short_name": "SIRTEC INTERNATIONAL CO",
        "long_name": "Sirtec International Co.,Ltd.",
        "summary": "Sirtec International Co.,Ltd. designs, manufactures, and sells electronic product assemblies, and plastic injection and molding products in Taiwan. It offers communication products, including GPS receivers, broadband routers, and VO IPhones; computer peripheral products, such as laser toner cartridges, POS machines, and platform NAS; consumer products comprising LED TVs, HHDs, and Bluetooths; optoelectronic products, such as TFT-LCD drive cards, and LED light bars and lightings; automotive electronic products comprising head up displays, car video recorders, GPS models, and tire pressure detectors; and OEM products consisting of FPC processing, dispensers, blood glucose meters, and smart meters. The company also provides plastics products comprising cartridges, barcode scanners, car audio driver panels, modems, electronic assembly products, game controllers, health care and medical equipment, and electronic piano panels. In addition, it offers electronic plating, spray painting, printing, supersonic welding, and mold design and manufacturing services; and PCB assembly services. The company was founded in 1968 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "5381.TWO": {
        "short_name": "UNIPLUS ELECTRONICS",
        "long_name": "Uniplus Electronics Co., Ltd.",
        "summary": "Uniplus Electronics Co., Ltd. engages in the research and development, manufacture, processing, and trade of various printed circuit boards. The company offers laminated multilayer printed circuit boards, basic circuit boards, and copper foil base boards, as well as aluminum substrates and lubricated aluminum covers. Uniplus Electronics Co., Ltd. was founded in 1991 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "5383.TWO": {
        "short_name": "KENLY PRECISION",
        "long_name": "Kenly Precision Industrial Co., LTD.",
        "summary": "Kenly Precision Industrial Co., LTD. manufactures and sells precision machine tools in Taiwan. The company offers molding products, including stamping molds and insert molding molds, as well as machining of jigs, tools, and parts; and photoelectric components, such as LED open tooling product. It also provides semiconductor components comprising IC heat sinks, transistor frames, diode frames, and CU clips; and electronic components consisting of connector terminals, contacts of relays and switches, and slide of variable resistors. The company was founded in 1969 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "5392.TWO": {
        "short_name": "AVY PRECISION TECHNOLOGY INC.",
        "long_name": "AVY Precision Technology INC.",
        "summary": "AVY Precision Technology INC. designs, produces, and sells camera parts in Taiwan. The company offers metal parts for cameras and mobile phones; inner structure parts, including LCD frames and laser welding assemblies; and nameplate and appearance parts, such as decorative parts, stamping plates, and flash reflector covers. It also provides multi-function printers and mechanical parts of medical equipment; electronic and auto parts comprising power cord chucks, battery plugs, metal shrapnels for relay, and gold plated shrapnels; and metal stamping parts and plastic parts. In addition, the company engages in stamping, producing, and supplying micro-motors; and designing and manufacturing molds and stamping products. AVY Precision Technology INC. was founded in 1975 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "5469.TW": {
        "short_name": "HANNSTAR BOARD CORP",
        "long_name": "HannStar Board Corp.",
        "summary": "HannStar Board Corp. manufactures, fabricates, and sells print circuit boards in Taiwan. The company offers telecom, server, back plane, card, and NB products. Its products are used in computer and peripheral; cellular phones, networking equipment, and telecom systems; game consoles, set top boxes, televisions, and printers; and car control panels, automotive navigation systems, and digital products for official or entertaining services applications. The company was formerly known as Pacific Science and Technology Industrial Co., Ltd. and changed its name to HannStar Board Corp. in December 1998. HannStar Board Corp. was founded in 1989 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "5487.TWO": {
        "short_name": "TONTEK DESIGN TECHNOLOGY",
        "long_name": "Tontek Design Technology Ltd.",
        "summary": "Tontek Design Technology Ltd. designs, manufactures, and sells consumer electronics IC design products. The company offers multimedia series products, including TV game systems; 3C appliances series products, such as AD MCUs, LCD and LED drivers, infrared IR emissions, calculators, and energy-saving appliances; and health care series comprising R2F MCUs, indoor-outdoor thermometer, sports car meter, heart rate detection, and thermometer series. It also provides touch series, including capacitive touch MCUs and capacitive touch standard products; and green energy series, such as LED driver, PIR energy saving, PIC MICU, and PIR peripheral components. Tontek Design Technology Ltd. was founded in 1986 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "5493.TWO": {
        "short_name": "SAN LIEN TECHNOLOGY CORP",
        "long_name": "San Lien Technology Corp.",
        "summary": "San Lien Technology Corp. provides environment monitoring and micro vibration detection products, and system integration services in Taiwan and internationally. It offers sensor and recorder products, such as acceleration transducers, amplifiers, angle sensors, annular load cells, crackmeters, displacement transducers, inclinometer casings, load cells, network accelerometers, pressure transducers, cube visual and voice terminals, main control units, rebar strain gauges, solid load cells, spot-weldable strain gauges, strain gauges, switch boxes, tilt plates, tilt casts, tilt views, torque transducers, vibration sensors, vibration monitoring systems, weldable strain gauges, data loggers, and VW piezometers. The company was founded in 1967 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "6088.HK": {
        "short_name": "FIT HON TENG",
        "long_name": "FIT Hon Teng Limited",
        "summary": "FIT Hon Teng Limited engages in the design, development, production, and sale of interconnect solutions and related products in Taiwan, People's Republic of China, the United States, Hong Kong, Malaysia, Singapore, and internationally. The company offers cable components, including array of IO cables assemblies, as well as wire harness and power cords. It also provides connector components comprising backplane, high speed, input/output, and power connectors, as well as memory/edge cards, sockets, terminal blocks, and wire to board/board to board connectors; and active optical cables, embedded optical modules, transceiver modules, and acoustic products. In addition, the company offers radio frequency antenna cable and module assemblies; wireless charging products and components; and accessories, such as headsets, speaker systems, and power and cable accessories. It also engages in research, development, and manufacture of batteries; manufacturing of metal processing machinery and equipment; and sale of smart home products. The company offers its products under the e Belkin, Linksys, Wemo, and Phyn brand names. It serves communications infrastructure, computers and consumer electronics, mobile and wireless devices, automotive, and industrial and medical industries. The company was formerly known as New Wing International Holdings Limited and changed its name to FIT Hon Teng Limited in June 2013. The company was incorporated in 2013 and is headquartered in New Taipei City, Taiwan. Foxconn FIT Hon Teng Limited is a subsidiary of Foxconn (Far East) Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6108.TW": {
        "short_name": "APCB INC",
        "long_name": "APCB Inc.",
        "summary": "APCB Inc. produces and sells multi-layer PCB products for application in consumer electronic sector in Taiwan and internationally. The company provides camera module boards for use in security controls, notebooks, monitors, mobile phones, and tablets; TFT-LCD boards for LCDs, TVs, mobile phones, and backlight modules; and consumer electronic boards for use in projectors, type c modules, smart meters, mobile phones, notebooks, and games. It also offers RF module boards used in mobile phones, PCs, notebooks, and tablets; industrial control boards for PLC control panels, variable electrical appliances, electric control doors, servers, and power supply units; automotive boards for use in body control systems, dashboards, sensors boards, and head lamp; MCPCBs for LED thermal modules, LED packaging, and lighting; and memory module boards for use in SSD, USB, and moduleul. The company was founded in 1981 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "6120.TW": {
        "short_name": "DARWIN PRECISIONS CORPORATION",
        "long_name": "Darwin Precisions Corporation",
        "summary": "Darwin Precisions Corporation manufactures and sells backlight module technology in Taiwan. It provides optoelectronic products, including backlight and panel modules, NB display modules, touch module bounding, and SET machines; lighting application products, such as LED panel light, LED kitchen light, light guide plates, and application development products; and acrylic sheets, including optical grade acrylic boards, cover lens, Pika Pika, and PMMA. The company also offers precision metal stamping parts, such as backplane, frames, and covering cover; optical components consisting of LGP light guides; precision injection products, such as TV appearance, plastic front frame/back cover, and plastic frame; precision molds; and electronic paper applications. Its products are used in LCD TVs, personal monitors, notebook computers, and automotive displays. The company was formerly known as Forhouse Corporation and changed its name to Darwin Precisions Corporation in 2015. Darwin Precisions Corporation was founded in 1989 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "6124.TWO": {
        "short_name": "YEH-CHIANG TECHNOLOGY CO",
        "long_name": "Yeh-Chiang Technology Corp.",
        "summary": "Yeh-Chiang Technology Corp. produces and sells electronic components and materials worldwide. It operates through Heat Pipe, Lighting, and Semiconductor segments. The company's thermal components include heat pipes, vapor chambers, and loop heat pipes. Its electronic materials comprise BGA solder sphere, solder paste, and SMT and semiconductor flux products. The company also engages in the production and sale of raw alcohol, lighting equipment, semiconductor packaging wires, and solder balls; manufacture and sale of bioethanol; international trade activities; and environmental protection related business, as well as offers LED products. It serves original equipment manufacturers of computing systems and electronic devices; semiconductor companies; manufacturers using SMT processes; manufacturers requiring thermal solutions; thermal module design and manufacturing companies; and system houses that require cooling technologies. Yeh-Chiang Technology Corp. was founded in 1994 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "6126.TWO": {
        "short_name": "SINGATRON ENTERPRISE CO",
        "long_name": "Singatron Enterprise Co.,Ltd",
        "summary": "Singatron Enterprise Co.,Ltd develops, manufactures, and supplies electrical connectors for laptop industries in Taiwan and internationally. It offers waterproof connectors, such as circular, quick lock, M5/M8, M12, USB, USB charger, RJ45, cable gland, NMEA 2000, and LEV connectors; and consumer connectors, including DC power jack, audio jack, USB2.0/USB3.0, USB3.1 Type-C, RJ/transformer, HDMI, battery, and other connectors. The company also provides professional support services. Its products are used in consumer electronics, portable devices, networking, marine electronics, outdoor displays, outdoor lighting, and communications for outdoor solutions, as well as industrial automation and light electronic vehicles. Singatron Enterprise Co.,Ltd was founded in 1976 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "6141.TW": {
        "short_name": "PLOTECH CO LTD",
        "long_name": "Plotech Co.,Ltd",
        "summary": "Plotech Co.,Ltd manufactures and sells printed circuit boards (PCB's) in Taiwan and China. It offers PCB's of various layers for applications, such as automotive, telecommunication, Bluetooth, LCD displays, storage, connectors, scanners, industrial PC's, medical equipment, computers, wireless, power supply, dram modules, probe cards, load boards, burn-in board power supply, GPS, wireless, research and development prototypes, digital cameras and video, IA products, PDAs, cellular phones, etc. The company was founded in 1990 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "6153.TW": {
        "short_name": "CAREER TECHNOLOGY CO",
        "long_name": "Career Technology (Mfg.) Co., Ltd.",
        "summary": "Career Technology (Mfg.) Co., Ltd. manufactures and sells flexible printed circuits in Taiwan and internationally. The company provides single-sided, double-sided, double access, and multilayer flex circuits; air gap structures; and rigid-flex boards, as well as component assemblies. Its products are used in various applications, such as mobile phones, touch panels, tablet PCs, cameras, flat displays, notebooks, GPS, autotronics, ultrabooks, wearable devices, and virtual reality, as well as in medical instrument market segments. The company was founded in 1992 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6156.TWO": {
        "short_name": "SONG SHANG ELECTRONICS CO LTD",
        "long_name": "Song Shang Electronics Co.,Ltd.",
        "summary": "Song Shang Electronics Co., Ltd. manufactures and sells magnetic components, printed circuit boards, and wire products. Its magnetic components include coils, line filters, power chokes, and transformers primarily used in the production of transformers, filters, and inductors, as well as in adapter, LED TV, LCD TV, charger, game console, desktop, monitor, printer, lighting, and communication applications. The company's printed circuit boards are used in consumable electronic products, power supplies, machinery, instruments, and automobile industries, as well as other industries. It also offers wire products for LED TV and display, car audio, battery, power supply equipment, and home appliances. The company was formerly known as K-Bridge Electronics Co. Ltd. and changed its name to Song Shang Electronics Co., Ltd. in March 2011. Song Shang Electronics Co., Ltd. was founded in 1988 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6167.TWO": {
        "short_name": "POWERTIP TECH CORP",
        "long_name": "Powertip Technology Corporation",
        "summary": "Powertip Technology Corporation manufactures and sells small to mid-size full color TFT and monochrome displays, and touch panels worldwide. The company's offers embedded solutions, full viewing angle displays, EM touch products, TFT displays, TFT with projected capacitive touch panels, graphic and chip-on-glass LCD modules, character LCD modules, FS-LCDs, VATN/PBT LCD modules, resistive and capacitive touch panels, and evaluation boards; and surface mount technology, chip-on-board, chip-on-flex, tape automated bonding, and screen printing products. Its products are used in white goods and gas pumps/parking meters, as well as for industrial, medical, consumer, automotive, communications, and test and measurement applications. The company was founded in 1991 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "6185.TWO": {
        "short_name": "PLASTRON PRECISION CO",
        "long_name": "Plastron Precision Co., Ltd.",
        "summary": "Plastron Precision Co., Ltd. engages in the research and development, manufacture, and market of connectors in Taiwan and internationally. It offers board to board, header/socket, USB, memory card connectors, etc.; and serial ATA products, I/O connectors, and edge card connectors. The company was founded in 1988 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6191.TW": {
        "short_name": "GLOBAL BRANDS MANUFACTURE CO LT",
        "long_name": "Global Brands Manufacture Ltd.",
        "summary": "Global Brands Manufacture Ltd. engages in the PCB production and EMS businesses in Taiwan. The Company's printed circuit boards are used in desktop PCs, network and communication products, digital cameras, and other products. It also provides EMS services, including SMT assembly, tooling, and plastic and systems assembly. The company offers EMS for various products, including PCs; storage products, such as USB flash drives and HDDs; consumer electronics comprising TFT-LCDs; wireless communication products; gaming machines, and security and communication products; and automotive electronics. It supplies products to companies in the information, communication, automobile, and consumer electronics industries. The company was formerly known as Cyber Solutions Corporation and changed its name to Global Brands Manufacture Ltd. in 2003. Global Brands Manufacture Ltd. was founded in 1973 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "6194.TWO": {
        "short_name": "YUFO ELECTRONICS CO",
        "long_name": "Yufo Electronics Co., Ltd.",
        "summary": "Yufo Electronics Co., Ltd. primarily manufactures and sells printed circuit boards in Taiwan and internationally. It offers computer motherboards for use in personal computers, industrial computers, and medical equipment; and high frequency impedance control printed circuit boards for use in servers, communication base station, network communication equipment, and high-precision instruments. The company was founded in 1983 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "6196.TW": {
        "short_name": "MARKETECH INTERNATIONAL CORP",
        "long_name": "Marketech International Corp.",
        "summary": "Marketech International Corp., manufactures, sells, imports, and trades in a range of integrated circuits, semiconductors, electrical and computer equipment and materials, chemicals, gas, and components. The company also engages in design and manufacturing of customized equipment; factory affair and mechatronic system, including clean room, automatic supply system of gas and chemicals, monitor system, turn-key, and hook-up project services; contracting for semiconductor automatic supply system and electrical installing construction; design, manufacturing, and installation of automatic production equipment and related parts; trading, installation, and repair of various machinery equipment and peripherals; sales of cosmetics and daily necessities and panels; and production, development, and implementation of software, as well as installation of industrial machine and equipment and consulting and coding services. In addition, it is involved in research, trading, and consulting of information system software and hardware appliances; supply of electronic information; medical consulting services; design and manufacture of RF booster; management of IoT and 5G telecommunication instrument; production of scrubber bins for semiconductor manufacturers; and design, installation, debugging, and technology services of tunnel systems. Marketech International Corp. was incorporated in 1988 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "6205.TW": {
        "short_name": "CHANT SINCERE CO",
        "long_name": "Chant Sincere Co., Ltd.",
        "summary": "Chant Sincere Co., Ltd. engages in the design, manufacture, and sale of connectors and cables in Taiwan and internationally. The company's principal products include I/O connectors, board to board connectors, waterproof connectors, industrial connectors, automotive connectors, memory card connectors and adaptors, high-speed connectors and cables, and audio and video connectors and cables. Its products are used in various industries, such as computing, industrial and automation, telecommunication, automotive, waterproof, consumer, and medical industries. The company was founded in 1985 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6209.TW": {
        "short_name": "KINKO OPTICAL CO",
        "long_name": "Kinko Optical Co., Ltd.",
        "summary": "Kinko Optical Co., Ltd. designs, develops, produces, and sells optical components and lens worldwide. The company offers digital single-lens reflex camera, 3D sensing, mobile phone, projector, NB, surveillance, IP camera, security camera, automotive, panoramic camera, Internet of Things, industrial camera, telescope, and sports camera lenses. It also provides spherical and aspherical glass lens OEM, and lens ODM services. The company was founded in 1980 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "6210.TWO": {
        "short_name": "KINTECH ELECTRONICS CO",
        "long_name": "Kintech Electronics Co., Ltd.",
        "summary": "Kintech Electronics Co. Ltd. engages in manufacturing, processing, and trading of single-sided and multi-layer printed circuit boards and electronic components in Taiwan, the United States, Europe, Japan, China, and the Southeast Asia. It offers its products for consumer and other products, communication products, PC and peripheral, industrial equipment, and servers. The company was founded in 1984 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "6213.TW": {
        "short_name": "ITEQ CORP",
        "long_name": "ITEQ Corporation",
        "summary": "ITEQ Corporation manufactures and sells copper clad laminate materials used for fabrication of printed circuit boards in Taiwan and Asia. It offers mass lamination boards, copper clad laminates, prepreg products, and electronic components. The company's products are used in various application areas, such as computational and communications applications comprising servers, storage, and switches; radio frequency and microwave devices, consisting of 5G and mmWaves; automotive applications, including advanced driver assist systems; and high density interconnect solutions, which include smartphones. It also exports its products. The company was founded in 1997 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "6217.TWO": {
        "short_name": "CCP CONTACT PROBES CO",
        "long_name": "C.C.P. Contact Probes Co., Ltd.",
        "summary": "C.C.P. Contact Probes Co., Ltd., together with its subsidiaries, manufactures and sells spring loaded probes and connectors in Taiwan and internationally. The company offers testing solutions, including high frequency testing, Kelvin contact testing, memory testing, burn-in testing, fine pitch connector testing, IC and ICT test probe, ATE connecting, general final testing, panel testing, wafer level testing, battery probe, and high current IC testing solutions. It also provides pogo pin connectors, such as standard and non-standard, single pogo pin, waterproof, ball point, magnetic, high current and frequency, and ultra-small pin connectors, as well as screw pins; female and industrial connectors; and DAC network cables. The company was formerly known as CCP Contact Probes Enterprise Co., Ltd. and changed its name to C.C.P. Contact Probes Co., Ltd. in 1998. C.C.P. Contact Probes Co., Ltd. was founded in 1983 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6224.TW": {
        "short_name": "POLYTRONICS TECHNOLOGY CORP",
        "long_name": "Polytronics Technology Corporation",
        "summary": "Polytronics Technology Corp. engages in the research, development, manufacture, and sale of circuit protection and thermal management devices for high-density electronics systems. It provides EVERFUSE polymeric positive temperature coefficient products, including surface-mount devices for computers, portable electronics, game consoles, telephony and broadband products, mobile phones, industrial controls, batteries, and multimedia products; radial-leaded devices for AC/DC adapters, power supply products, USB hubs and accessories, computer accessories and related applications, medical equipment, industrial controls, and automotive and motor protection products; and battery device products for mobile phones, laptops and netbooks, PDAs, portable multimedia players, MP3s, and game consoles. The company also offers telecom products for xDSL, VoIP, MDF module, Ethernet, and telecom analog and digital line card applications, as well as for modem, telephone, and facsimile machines; thermal conductive boards for automotive lighting, power module, solar cell, IC packing, and LED applications; current limiting modules for note book, cell phone, security system, and automotive applications; surface mount fuses; transient voltage suppressor diodes; thyristor surge suppressor devices; electrostatic discharge protectors; metal oxide varistors and potentiometers; gas discharge tubes; thermal setable pads; thermal dissipation coating materials; thermal conductive inks; heat dispersing materials; and overvoltage protection element and related semi-finished goods, modules, and heat conductive substrates. In addition, it engages in the investments and general business operations; and production and sale of resistors, discrete semiconductor devices, and other resistive elements. The company operates in Taiwan, China, the United States, and internationally. Polytronics Technology Corp. was founded in 1997 and is based in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "6230.TW": {
        "short_name": "NIDEC CHAUN-CHOUNG TECHNOLOGY C",
        "long_name": "Nidec Chaun-Choung Technology Corporation",
        "summary": "Nidec Chaun-Choung Technology Corporation provides thermal management products worldwide. It offers server/DT, NB/tablet, and LED modules; thermal components, including vapor chambers and heat pipes; heatsinks; and thermal systems. The company was formerly known as Chaun-Choung Technology Corp. and changed its name to Nidec Chaun-Choung Technology Corporation in January 2021. Nidec Chaun-Choung Technology Corporation was incorporated in 1973 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6246.TWO": {
        "short_name": "TAIWAN THICK-FILM INDUSTRIES CO",
        "long_name": "Taiwan Thick-Film Ind. Corp",
        "summary": "Taiwan Thick-Film Ind. Corp manufactures and sells transformers, backlight modules, light emitting diode (LED) light bars, and light guide plates in Taiwan. It offers back light modules, such as in-vehicle and industrial control, tablet series, NB series, and monitors; LCM assemblies; LED light bars for consumer electronics, industrial control, medical, military, automotive, and other applications; and automotive/new energy automotive electronics that include vehicle charging station main boards, vehicle charging indicator main boards, car door lock main boards, automotive control switches, anti-pinch window lift monitor main boards, and vehicle indicator light switches. The company also provides cultural and creative business unit that provides brand licensing, product image design, cross-industry alliances and strategic alliances, creative products, 3C-related products, daily necessities, and auto supplies. Taiwan Thick-Film Ind. Corp was founded in 1982 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6269.TW": {
        "short_name": "FLEXIUM INTERCONNECT INC",
        "long_name": "Flexium Interconnect, Inc.",
        "summary": "Flexium Interconnect, Inc., together with its subsidiaries, engages in the design, development, manufacture, and sale of flexible printed circuit (FPC) boards in Taiwan, China, rest of Asia, Europe, and America. It provides single-sided, double-sided, multilayer, and rigid-flex FPC boards. The company also manufactures build-up copper clad laminate; researches and develops, manufactures, processes, trades, and repairs build-up printed circuit boards (PCB), flexible PCB, related semi-finished goods and parts, parts for semi-finished goods of polyimide film base copper clad laminate, and molds, tools, and clamping apparatuses; and sells raw materials. Its products are used in computers, LCD screens, consumer-type electronic products and equipment, and items related to the automobile GPS screens. Flexium Interconnect, Inc. was incorporated in 1997 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Kaohsiung"
    },
    "6272.TWO": {
        "short_name": "WIESON",
        "long_name": "Wieson Technologies Co., Ltd.",
        "summary": "Wieson Technologies Co., Ltd. manufactures and sells interconnect components and wireless components. It offers I/O connectors, board mount connectors, card and socket connecters, connecters and cables, cable assemblies, optical fiber components, wires, wireless modules, automotive electronics, and LED lighting products, as well as antennas. The company was founded in 1990 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6284.TWO": {
        "short_name": "INPAQ TECHNOLOGY CO",
        "long_name": "INPAQ Technology Co., Ltd.",
        "summary": "INPAQ Technology Co., Ltd. provides circuit protection components and antenna products for computing, communication, consumer electronics, and automotive electronics primarily in Taiwan, China, Korea, and North America. It offers RF antennas, such as patch, active, chip, dipole, NFC, RFID, and customized antennas, as well as automotive, wireless power charger, module system, and LTC technology products. The company also provides SMD metal oxide varistor, ESD, transient voltage suppressor, and multilayer varistor; chip ferrite bead and common mode filter; and power, general circuits, and high frequency inductors. Its products are used in phones, tablets, NBs, TVs, and set top boxes, as well as automotive and network applications. INPAQ Technology Co., Ltd. was founded in 1998 and is headquartered in Miaoli, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Miaoli"
    },
    "6288.TW": {
        "short_name": "EXCELLENCE OPTOELECTRONIC INC",
        "long_name": "Excellence Optoelectronics Inc.",
        "summary": "Excellence Optoelectronics Inc. design, development, and testing of automotive LED component packaging in Taiwan, China, United States, Germany, Spain, and internationally. The company offers LED lamps with AlInGaP and InGaN chip materials. It also provides LED street lighting, high/low bay, shoe box, wall pack, and patio light products; LED light modules; LED components for lighting; LED traffic signals, such as ball signals, arrow signals, pedestrian signals, vehicle countdown, bicycle signals, and tram way signals; and automotive light modules for ODM/OEM services. In addition, the company engages in design, manufacturing, construction, and installation of public works and lighting systems. The company was founded in 1995 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "6289.TW": {
        "short_name": "ARIMA OPTOELECTRONICS CORPORATI",
        "long_name": "Arima Optoelectronics Corp.",
        "summary": "Arima Optoelectronics Corp. operates in the optoelectronics market. It offers UHB LED and LD dice, and epitaxial wafer products to LED manufacturers in Taiwan and internationally. The company was founded in 1998 and is based in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "6294.TWO": {
        "short_name": "TEKOM TECHNOLOGIES INC",
        "long_name": "Tekom Technologies, Inc",
        "summary": "Tekom Technologies, Inc provides tutoring services in Taiwan. It offers national examination, correspondence, double-effect, and travel teaching products and services. The company is based in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Tainan"
    },
    "6405.TW": {
        "short_name": "ONANO INDUSTRIAL CORP",
        "long_name": "Onano Industrial Corp.",
        "summary": "Onano Industrial Corp. provides opto-electronic glass slimming solutions in Taiwan. The company provides slimming, polishing, and film coating services for TFT-LCD, OLED, solar cell glass, etc.; PV panel slimming; anti-glare treatment; opto-electronic coating; and OGS strengthening products. Its products are used in various applications, including smart phones, tablets, ultra-thin laptops, consumer electronics, LCD displays, etc. The company was founded in 2004 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "6432.TWO": {
        "short_name": "ARLITECH ELECTRONIC CORP",
        "long_name": "Arlitech Electronic Corp.",
        "summary": "Arlitech Electronic Corp. supplies inductors for LCD panel industry in Taiwan. It offers high current power, SMD power, DIP power, and RF inductors, as well as automotive grade and EMI suppression filters. The company also provides business items; cooling materials, such as graphene papers, thermal conductivity die-casting aluminum alloy, and graphene coating; and thermal solution designs. Its products are used in the display panel, network, industrial, entertainment, storage device, and computer applications. The company was incorporated in 2001 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6442.TW": {
        "short_name": "EZCONN CORPORATION",
        "long_name": "EZconn Corporation",
        "summary": "EZconn Corporation, together with its subsidiaries, manufactures and sells precision metal and optical fiber components of various electronic products in Taiwan, Asia, the United States, and Europe. The company offers RF coaxial connectors, precision adaptors, jumpers, surge arrestors, filters, amplifiers, and dipolar antennas, as well as CATV connector / components, shielding can for STB/ cable modem, microwave connector / dipole antenna, base station connector / arrester, LAB adaptor, and automotive connection system products for use in lightning protectors, antennas, filters, RF connectors, and POE home terminal AV/data MoCA filters. It also provides equipment distribution products, including OSA, passive, advanced, and other fiber optics products for access, metro-core/long haul, and transceiver applications; and ODM services. EZconn Corporation was founded in 1971 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "6449.TW": {
        "short_name": "APAQ TECHNOLOGY CO LTD",
        "long_name": "Apaq Technology Co., Ltd.",
        "summary": "Apaq Technology Co., Ltd. researches, develops, manufactures, and sells electronic components in China, Taiwan, and internationally. It offers aluminum solid capacitors, aluminum liquid electrolytic capacitors, and general electronic components; and coiled and chip-type conductive polymer solid state capacitors. The company was founded in 2005 and is headquartered in Miaoli, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Miaoli"
    },
    "6474.TWO": {
        "short_name": "WFE",
        "long_name": "WFE Technology Corp.",
        "summary": "WFE Technology Corp. manufactures and sells electrical products primarily in Taiwan. It offers power integration products; and circuit protection products, CO and outside plant products, connectors, diodes, encoders, LED shunt protectors, magnetic products, microelectronic modules, position sensors, potentiometers, resistive products, switches, transistors and thyristors, trimpot trimming potentiometers, pro audio products, and automotive products. The company also provides quartz oscillators and microchips. The company was founded in 1992 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung City"
    },
    "6475.TWO": {
        "short_name": "ASSEM TECHNOLO",
        "long_name": "Assem Technology Co., Ltd",
        "summary": "Assem Technology Co., Ltd engages in the development, manufacture, and sale of board-to-board and flexible printed circuit board connectors in Taiwan. It also offers board to board battery and USB type C connectors. The company was founded in 2001 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6498.TWO": {
        "short_name": "PTIC",
        "long_name": "Powertip Image Corp",
        "summary": "Powertip Image Corp engages in the manufacture of electronic components and optical instruments Taiwan and China. The company offers cellphone, NB, optical touch panel, LED illumination, and optical fiber lenses. It also provides PC and Web camera lenses. Powertip Image Corp was founded in 2003 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "6510.TWO": {
        "short_name": "CHUNGHWA PRECISION TEST TECH CO",
        "long_name": "Chunghwa Precision Test Tech. Co., Ltd.",
        "summary": "Chunghwa Precision Test Tech. Co., Ltd., together with its subsidiaries, engages in the testing of semiconductor components in Taiwan, China, and internationally. It also produces printed circuit boards (PCB); and markets electronic products. The company offers interposers that convert signal wiring of probe PCB and allow the probe head to receive the signal; vertical probe cards for use in test interface before wafer dicing and IC packaging; and direct docking products for use in wafer testing. It also provides load board PCBs to test yield rate after dicing, mounting, welding, and wrapped with plastics, ceramics, and metals. The company was founded in 2005 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "6512.TWO": {
        "short_name": "GOMAX ELECTRONICS INC",
        "long_name": "GoMax Electronics Co., Ltd.",
        "summary": "GoMax Electronics, Inc. engages in the design, development, manufacture, and sale of audio and video systems in Taiwan. It offers SDI, DVI, converter, audio, HDMI, display port, and wall plate series products; and live streaming, optical extender, A/V over IP, video processor, pattern generator, and tool kit products, as well as legacy products. The company was founded in 2006 and is based in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Zhubei"
    },
    "6560.TWO": {
        "short_name": "APPRO PHOTOELECTRON INC",
        "long_name": "Appro Photoelectron Inc.",
        "summary": "Appro Photoelectron Inc. operates as a design house for image products to enable customers to develop products in Taiwan. It offers camera module solutions, body worn cameras, and car DVR solutions; and image related products. The company also provides system integration and design, and FAE technical support services. The company was founded in 1999 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6577.TWO": {
        "short_name": "PROMATE SOLUTIONS CORPORATION",
        "long_name": "Promate Solutions Corporation",
        "summary": "Promate Solutions Corporation designs, develops, and sells technologies for TFT LCD displays worldwide. The company offers embedded panels, panel PCs, industrial displays, and LCD products. It serves medical, automotive, vending, and marine markets. The company was founded in 1986 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "6597.TWO": {
        "short_name": "Ecocera",
        "long_name": "Ecocera Optronics Co., Ltd.",
        "summary": "Ecocera Optronics Co., Ltd. manufactures and sells ceramics circuit boards in Taiwan. It offers direct plating copper products consisting high-power LED thermal dissipation substrates, LED thermal dissipation modules, concentrating type solar cell substrates, passive components, high power electronic components, etc. The company also provides direct bonded copper and high performance copper products. Its products are used in LED lighting, automotive lighting, mobile phone LED flash, UV, display, and other applications. The company was founded in 2011 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan"
    },
    "6609.TWO": {
        "short_name": "TAIWAN TAKISAWA TECHNOLOGY CO",
        "long_name": "Taiwan Takisawa Technology Co., Ltd.",
        "summary": "Taiwan Takisawa Technology Co., Ltd. manufactures and sells precision machine tools and printed circuit board drillers in Asia, Europe, the Americas, and internationally. The company offers machine tools, such as small and medium CNC lathes, and non-CNC high speed precision lathes for bicycle, motorcycle, and automobile industries, as well as parts processing plants supplying the aeronautic industry. It also provides horizontal, vertical, dual spindle, and extra heavy duty CNC lathes; high-speed precision drilling machines; and equipment sales and maintenance services. The company was founded in 1971 and is headquartered in Taoyuan City, Taiwan. Taiwan Takisawa Technology Co., Ltd. is a subsidiary of Takisawa Machine Tool Co., Ltd.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "6651.TWO": {
        "short_name": "CYSTECH ELECTRONICS CORP",
        "long_name": "Cystech Electronics Corp.",
        "summary": "Cystech Electronics Corp. designs, develops, manufactures, and supplies power devices for the computing, consumer electronics, communication, and industrial markets worldwide. The company offers MOSFET and SCR products, bipolar and digital transistors, and AECQ transistors. It also provides universal high brightness LED drivers; PWM integrated circuits (IC); DC to DC ICs; and dual operational amplifier and voltage references, regulators, CMos regulators, and quadruple operational comparators. In addition, the company offers switching control, fast, zener, switching, and schottky diodes; general purpose, glass passivated, snubber damping, and high efficiency rectifiers; and bridge and TVS products. Cystech Electronics Corp. is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6673.TWO": {
        "short_name": "IFTC",
        "long_name": "Innovision FlexTech Corporation",
        "summary": "Innovision FlexTech Corporation manufactures and sells projection screens. It offers ultra-short throw front projection, telephoto, and rear projection screens. The company is based in Kaohsiung, Taiwan. Innovision FlexTech Corporation is a subsidiary of Arisawa Mfg. Co., Ltd.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Kaohsiung"
    },
    "6698.TW": {
        "short_name": "FINEMAT APPLIED MATERIALS CO LT",
        "long_name": "FineMat Applied Materials Co., Ltd.",
        "summary": "FineMat Applied Materials Co., Ltd. develops and manufactures high-precision metal masks based on precision etching technology in Taiwan. It offers high-precision metal mask for display; flexible OLED display metal mask fabrication and Web services; OLED and semiconductor recycle and cleaning services; and products for various types of precision etching applications, as well as full-size precision frame manufacturing services. The company also provides design consulting, mask etching, frame preparation, spot welding, and cleaning and regeneration services. It offers its products for the OLED display panel industry; and products to biomedical equipment and optical lens masks. The company was formerly known as Yiqiang Technology Co., Ltd. and changed its name to FineMat Applied Materials Co., Ltd. in 2012. FineMat Applied Materials Co., Ltd. was founded in 2007 and is based in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Tainan City"
    },
    "6717.TWO": {
        "short_name": "SDT",
        "long_name": "SmartDisplayer Technology Co., Ltd.",
        "summary": "SmartDisplayer Technology Co., Ltd. develops, manufactures, and sells smart display cards in Taiwan and internationally. The company provides all-in-one cards; crypto currency cards; OATH card-type OTP tokens; and EMV display cards. It also offers IC, segmented e-paper, module, and firmware design; semiconductor and graphic e-paper integration; emulation kit; and credit card personalization services, as well as various OTP seed perso solutions. The company was founded in 1996 and is headquartered in Keelung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Keelung"
    },
    "6732.TWO": {
        "short_name": "SENSORTEK TECHNOLOGY CORP",
        "long_name": "Sensortek Technology Corp.",
        "summary": "Sensortek Technology Corp. provides a range of sensor chips. Its principal products include ambient light sensors, proximity sensors, and MEMS accelerometers that are used in various applications, such as mobile phones, smart phones, tablets, laptops, digital cameras, and consumer electronics. The company is based in Jhubei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Jhubei City"
    },
    "6761.TWO": {
        "short_name": "Wendell",
        "long_name": "Wendell Industrial Co., Ltd",
        "summary": "Wendell Industrial Co., Ltd provides circuit protection component in South Korea, Japan, Singapore, and China. Its products are used in mobile phones, desktop computers, notebook computers, tablet computers, digital cameras, navigation systems, surveillance systems, industrial computers, medical equipment, communication equipment, Netcom products, wind power generation system, LED lighting system, and others. The company was founded in 1979 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6775.TWO": {
        "short_name": "ENTIRE TECH",
        "long_name": "Entire Technology Co., Ltd.",
        "summary": "Entire Technology Co.,Ltd. operates in the optoelectronics material technology industry in Taiwan. The company offers light guide and diffuser plates for various applications, including TV screens, commercial displays, computer monitors, notebooks, tablets, SATNAV, POS terminals, industrial computers, gaming machines, and advertising signs, as well as LED backlight modules car displays, edge-lit LED panels, emergency lights, commercial advertising lights, illumination components, and equipment lightings; composite plates for 5G applications and consumer electronics cases; polycarbonate composites injections for backlight module plastic frames, which are used in electronic, machinery, and automobile industries; and composite materials and optical films for used in smartphones or in-car displays. Entire Technology Co.,Ltd. was founded in 2003 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "6792.TWO": {
        "short_name": "Unictron",
        "long_name": "Unictron Technologies Corporation",
        "summary": "Unictron Technologies Corp. engages in the development, manufacture, and sale of antennas and piezoelectric ceramic elements for use in various electronic devices in Taiwan and internationally. The company provides antennas, such as chip, patch, and custom-made antennas; and piezoelectric ceramic elements, including automobile parking sensors, ultrasonic transducers, weaving machine actuators, and touch panel sensors. It also offers over-voltage and over-current circuit protection components comprising spark gaps, gas tubes, thyristors, transient voltage suppressors, ZnO-based varistors, PPTC resettable fuses, and other fuses. The company was founded in 1988 and is headquartered in Hsin-Chu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsin-Chu"
    },
    "6813.TWO": {
        "short_name": "GeneTouch",
        "long_name": "GeneTouch Corp., Ltd",
        "summary": "GeneTouch Corp., Ltd. designs and manufactures touch technology products. The company offers infrared touch, PCAP touch, and digital signage products, as well as wireless presentation solutions and accessories. It also provides electronics manufacturing service FOR OEM/ODM customers. GeneTouch Corp., Ltd. Was founded in 2009 is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "6818.TWO": {
        "short_name": "AWAN",
        "long_name": "Advanced Wireless & Antenna Inc.",
        "summary": "Advanced Wireless & Antenna Inc. manufactures and sells computer and communication connectors in Taiwan and internationally. It offers Wi-Fi, NFC, networking, and 3D antennas; and NFC modules with antennas, as well as Netcom antennas. Its products are used in computer, electronic communication, telecommunications, automotive, medical, and Internet of Things and other related markets. The company was founded in 2000 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6821.TWO": {
        "short_name": "LKM",
        "long_name": "LinkCom Manufacturing Co.,LTD.",
        "summary": "LinkCom Manufacturing Co., Ltd. designs, produces, and sells magnetic components, intelligent power supplies, and intelligent lighting control solutions worldwide. Its products are used in 5G, electric car, IoT, ehealth, network communication, and industrial control applications. The company was founded in 1988 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "7419.TWO": {
        "short_name": "MTC",
        "long_name": "Mortech Corporation",
        "summary": "Mortech Corporation develops and provides polyimide films in Taiwan. Its products include PIF, PIN, PIB/PMB, PIA/PAB, and PIT type polyimide films. The company was founded in 2004 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "7556.TWO": {
        "short_name": "YEEDEX ELECTRONIC CORP",
        "long_name": "Yeedex Electronic Corporation",
        "summary": "Yeedex Electronic Corporation provides parts, materials, and sub-systems for semiconductor process equipment in Taiwan and China. The company offers fine ceramic parts and materials; perfluoroelastomer seals; precision vacuum chucks; refurbish and repair precious parts, including ESC, heaters, vacuum chucks, ceramic coatings, anodizing products, etc.; plasma coated chamber parts; quartz and others parts; tungsten carbide blades; and heat resistant phosphor plates. It also serves flat display panel, passive electronic component, LED, solar cell, automobile, medical, and special material industries. The company also exports its products to other Asian and American countries. Yeedex Electronic Corporation was founded in 1999 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "8039.TW": {
        "short_name": "TAIFLEX SCIENTIFIC CO",
        "long_name": "Taiflex Scientific Co., Ltd.",
        "summary": "Taiflex Scientific Co., Ltd. engages in the manufacture, wholesale, and retail of electronic materials and components in Taiwan. The company offers polymer film based copper clad laminates, cover layers, photovoltaic module back sheets, flexible copper-cladded laminates, optical film materials, bonding sheets, composited PI sheets, and PI type stiffeners. It provides electronic materials for applications in cell phones, music players, DSC/DVC, HDD, and tablets; and energy materials for solar powered cell phones, rooftop systems, and vehicles, as well as solar street lamps and utility scale applications. The company was founded in 1997 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Kaohsiung"
    },
    "8042.TWO": {
        "short_name": "TAIWAN CHINSAN ELECTRONIC INDUS",
        "long_name": "Taiwan Chinsan Electronic Industrial Co., Ltd.",
        "summary": "Taiwan Chinsan Electronic Industrial Co., Ltd. designs, manufactures, and distributes electrolytic capacitors. The company offers aluminum electrolytic capacitors, such as radial lead type, snap-in lug terminal type, and screw terminal type capacitors; and aluminum polymer capacitors comprising polymer radial lead type and polymer SMD type capacitors. Taiwan Chinsan Electronic Industrial Co., Ltd. was founded in 1970 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "8043.TWO": {
        "short_name": "HONEY HOPE HONESTY ENTERPRISE C",
        "long_name": "Honey Hope Honesty Enterprise Co.,Ltd",
        "summary": "Honey Hope Honesty Enterprise Co.,Ltd operates as a sales agent for electronic passive components in Taiwan and internationally. The company offers multilayer capacitors, chip inductors and capacitors, and other products. It serves PC, notebook, TFT-LCD, mobile phones, network equipment, communications equipment, wireless local area network, and information industry peripheral equipment manufacturers. Honey Hope Honesty Enterprise Co.,Ltd was founded in 1989 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "8046.TW": {
        "short_name": "NAN YA PRINTED CIRCUIT BOARD CO",
        "long_name": "Nan Ya Printed Circuit Board Corporation",
        "summary": "Nan Ya Printed Circuit Board Corporation manufactures and sells printed circuit boards (PCBs) and IC substrates in Taiwan. It offers conventional PCBs that are used in the motherboards of desktops and notebooks, and home electrical appliances; high density interconnection PCBs that are used in smartphones, game consoles, GPS, PDAs, automobile appliances, and MP3 players; and rigid-flex PCBs for use in high-end portable devices and notebooks. The company also provides flip chip substrates comprising pin/land grid arrays for microprocessors; and ball grid arrays for graphic microprocessors, northbridge chipsets, high-end ASIC chipsets, and set-top box chipsets. In addition, it offers wire bond substrates for MCP, southbridge chipsets, communication, and networking applications, as well as for use in memory, portable devices, handsets, consumer electronics, and PC peripheral device applications. The company was founded in 1984 and is headquartered in Taipei, Taiwan. Nan Ya Printed Circuit Board Corporation is a subsidiary of Nan Ya Plastics Corporation.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "8049.TWO": {
        "short_name": "AMPIRE CO",
        "long_name": "Ampire Co., Ltd.",
        "summary": "Ampire Co., Ltd. designs, manufactures, and sells liquid crystal display (LCD) modules and touch screens for industrial applications. The company offers large, medium, and small TN, STN, FSTN, TFT, and capacitive TP modules, as well as graphic, character, and open frame products. Its products are used in non-consumer application panels, such as white home appliances, HMI, card reader, industrial instrumentation, medical devices, automobile display panel, touch panel PC/Monitor, maritime information display panel, on-board entertainment panel, smart home control display panel, kiosks, and multi-functional office machines. The company was founded in 1998 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "8074.TWO": {
        "short_name": "AURONA INDUSTRIES INC",
        "long_name": "Aurona Industries, Inc.",
        "summary": "Aurona Industries, Inc. produces phenolic resin laminates of drilling backup boards, and insulating materials to print circuit board and mechanical industries. The company's product portfolio includes PCB drilling back-up/entry boards, routing back-up/entry boards, bakelites, diamond coating routers, medium-density fiberboards, aluminum lubrication entry boards, cushion craft papers, collets, and pressure brushes. It supplies its products to the high-end PCB and IC carrier fabricators, as well as for use in the PCB applications, including smart phone, flash memory chip, PBGA, flip chip drilling, etc. The company supplies its products to approximately 10 countries, such as Japan, Korea, China, Singapore, Malaysia, Thailand, Indonesia, Vietnam, Germany, and the United States. Aurona Industries, Inc. was founded in 1996 and is based in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Tainan City"
    },
    "8080.TWO": {
        "short_name": "TAIWAN OSTOR CORP",
        "long_name": "Taiwan Ostor Corporation",
        "summary": "Taiwan Ostor Corporation manufactures and sells electronic components. It offers electrolytic capacitors for use in the motherboard and power supply markets; solid capacitors; and Trusted Platform Module, a microcontroller installed on the motherboard of a PC or laptop designed to provide security-related functions and create cryptographic keys and digital certificates. The company also offers fingerprint solutions, interquip electronics, and multilayer ceramic capacitors. In addition, it provides medical crystal products, such as scintillator. Further, the company offers crystalline solar modules, photovoltaic (PV) ethylene-vinyl-acetate films, PV backsheets, PV module automatic equipment, and PV junction boxes, as well as conductive silver paste. Taiwan Ostor Corporation was founded in 1993 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "8103.TW": {
        "short_name": "CVILUX CORPORATION",
        "long_name": "CviLux Corporation",
        "summary": "CviLux Corporation manufactures and sells connectors, flat flexible cables (FFC), and wire harnesses in Taiwan and internationally. The company's connectors include board to board, CCFL, coaxial, combo D-sub, DVI, FFC/FPC, IEEE, LVDS, memory card, mini-DIN, power, serial ATA, telephone/modular jack, USB, wire to board crimp style, wire to board insulation displacement, and ribbon cable connectors, as well as application tooling and IC sockets. It also offers cable assemblies; PCBA turnkey solutions; LVDS cables; and fiber optics connectors and cables. The company's products are used in consumer electronics, computers, communication, and electro-optical industries. The company was founded in 1990 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "8104.TW": {
        "short_name": "RITDISPLAY CORPORATION",
        "long_name": "RiTdisplay Corporation",
        "summary": "RiTdisplay Corporation engages in the research and development, manufacture, and sale of organic light-emitting diodes in Taiwan and internationally. It also provides various flat-panel display products. The company was founded in 1997 and is based in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "8105.TW": {
        "short_name": "GIANTPLUS TECHNOLOGY CO",
        "long_name": "Giantplus Technology Co., Ltd.",
        "summary": "Giantplus Technology Co., Ltd., together with its subsidiaries, engages in the research, development, production, and sale of thin film transistor liquid crystal displays in China, Hong Kong, Macao, Taiwan, Europe, Japan, the United States, and internationally. The company's products include industrial displays, electronic labels, credit card machines, engineering drawing computers, handheld terminals, medical equipment meters, white goods, wearable devices, satellite navigation systems, automotive displays, game educational machines, anti-peeping screens, printers, and digital cameras. It serves industrial and automotive markets. The company was incorporated in 1997 and is headquartered in Toufen, Taiwan. Ltd. Giantplus Technology Co., Ltd. operates as a subsidiary of Toppan Printing Co., Ltd.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Toufen"
    },
    "8111.TWO": {
        "short_name": "LIGITEK ELECTRONICS CO",
        "long_name": "Ligitek Electronics Co.,Ltd",
        "summary": "Ligitek Electronics Co.,Ltd designs, develops, manufactures, and sells a range of optoelectronic components in Taiwan and internationally. The company offers LED products, such as through hole LEDs, PCB type surface-mount device (SMD), PLCC SMDs, leads type SMDs, invisible LED, automotive LED, ambient light sensors, smart LED, arrays, SMD type displays, LED displays, dot matrixes, and LED back lights. Its products are used in the LED lighting, mass transit and MRT system, automobile and motorcycle LED module, customized lighting, imaging lighting infrared module products and ODM, UV module group product and ODM, solar energy, and e-bike applications. The company was founded in 1989 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "8121.TWO": {
        "short_name": "ACME ELECTRONICS CORPORATION",
        "long_name": "Acme Electronics Corporation",
        "summary": "Acme Electronics Corporation produces and sells soft ferrite products in Taiwan. The company primarily offers Mn-Zn ferrite cores, Ni-Zn ferrite cores, and Mg-Zn ferrite cores for use in telecommunication, power conversion, and interference suppression applications. Its soft ferrite products comprise inductance passive electronic components, such as power transformers, loaded coils, and choke and demagnetization coils, which are used in various 3C devices, including power supplies, desktop monitors, notebooks, broadband network systems, telephone switching systems, relay stations, mobile phones, PDAs, LCD TVs, digital cameras, digital video cameras, video games handsets, scanners, etc. The company also provides sapphire ingots to sapphire wafer customers. Acme Electronics Corporation was founded in 1991 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "8147.TWO": {
        "short_name": "NEXTRONICS ENGINEERING CORP",
        "long_name": "Nextronics Engineering Corp.",
        "summary": "Nextronics Engineering Corp. provides connectors, and PICMG components and solutions for medical, aerospace, transportation, industrial, cloud/communication, and automation applications in Taiwan. The company offers high speed I/O, push pull circular, backplane signal, and combo power connectors; and embedded system connectors and components. It also provides terminal blocks, press-fit machine and tooling products, and customized-solutions, as well as Compact PCI, ATCA, and AMC and Micro TCA product solutions. The company was founded in 1986 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "8179.TWO": {
        "short_name": "SUBTRON",
        "long_name": "Subtron Technology Co., Ltd",
        "summary": "Subtron Technology Co., Ltd manufactures and sells IC carrier boards and soft boards in Taiwan. Its products primarily include system in package RF, LED lighting, optical communication module, sensor, 5G related, and PBGA/CSP/TFBGA products, as well as TAB, COF, EMV TAB, and INK products. The company was founded in 1998 and is based in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "8213.TW": {
        "short_name": "TAIWAN PCB TECHVEST CO",
        "long_name": "Taiwan Pcb Techvest Co., Ltd.",
        "summary": "Taiwan Pcb Techvest Co., Ltd., a professional manufacturing service company, manufactures and sells electronic components and printed circuit boards (PCBs). The company offers PCBs for notebooks, servers, memory modules, etc., as well as LCD products. Taiwan Pcb Techvest Co., Ltd. was founded in 1998 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "8215.TW": {
        "short_name": "BENQ MATERIALS CORPORATION",
        "long_name": "BenQ Materials Corporation",
        "summary": "BenQ Materials Corporation manufactures and sells material science products in Taiwan and internationally. Its product lines includes functional films, including polarizer films; optical films for touch panels; e-paper, a waterproof and surface treatment film for touch panel function; industrial tapes; and smart optical films. The company also provides healthcare products, including hydrocolloid dressings for moist wound management and silicone gel for scar prevention; clinical solution for rapid hemorrhage control of traumatic injury in the pre hospital setting; acne care products; and contact lenses. In addition, it offers separator, a component in liquid electrolyte batteries; and aluminum foil for lithium-ion battery of mobile devices or autos. The company was formerly known as Daxon Technology Inc. and changed its name to BenQ Materials Corporation in June 2010. BenQ Materials Corporation was founded in 1998 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "8291.TWO": {
        "short_name": "SHINEMORE TECHNOLOGY MATERIALS ",
        "long_name": "ShineMore Technology Materials Co., Ltd.",
        "summary": "ShineMore Technology Materials Co., Ltd. provides copper clad laminates and carbon and glass fiber composites. It offers FR-4 CCL, prepreg/bonding sheet, and metal CCL products. The company was founded in 1997 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "AU7A.F": {
        "short_name": "AU OPTRONICS CORP. ADR/10",
        "long_name": "AU Optronics Corp.",
        "summary": "AU Optronics Corp. designs, develops, manufactures, assembles, and sells thin film transistor liquid crystal displays (TFT-LCDs) and other flat panel displays. The company operates in two segments, Display and Energy. The Display segment designs, develops, manufactures, assembles, and markets flat panel displays for use in televisions, monitors, mobile PCs and devices, automobiles, industrial PCs, automated teller machines, point of sale terminals, pachinko machines, medical equipment, etc. This segment serves original equipment manufacturing service providers; and brand companies. The Energy segment manufactures and sells solar materials, including ingots, solar wafers, and solar modules, as well as provides technical engineering and maintenance services for solar system projects. This segment sells its ingot and solar wafer products primarily to solar cell manufacturers; and solar modules to installers, solar system integrators, property developers, and other value-added resellers. The company also sells and leases content management system and hardware; plans, designs, and develops construction for environmental protection and related project management; and manufactures and sells TFT-LCD modules and panels, TV sets, backlight modules, automotive parts, precision plastic parts, and motorized treadmills. In addition, it develops and sells software and hardware for health care industry; provides software and hardware integration system and equipment relating to intelligent manufacturing, as well as related consulting services; and engages in venture capital investment activities. The company operates in the People's Republic of China, Taiwan, Japan, Singapore, and internationally. AU Optronics Corp. was founded in 1996 and is headquartered in Hsinchu, Taiwan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "AUOTY": {
        "short_name": "AU OPTRONICS CORPORATION SPON A",
        "long_name": "AU Optronics Corp.",
        "summary": "AU Optronics Corp. designs, develops, manufactures, assembles, and sells thin film transistor liquid crystal displays (TFT-LCDs) and other flat panel displays. The company operates in two segments, Display and Energy. The Display segment designs, develops, manufactures, assembles, and markets flat panel displays for use in televisions, monitors, mobile PCs and devices, automobiles, industrial PCs, automated teller machines, point of sale terminals, pachinko machines, medical equipment, etc. This segment serves original equipment manufacturing service providers; and brand companies. The Energy segment manufactures and sells solar materials, including ingots, solar wafers, and solar modules, as well as provides technical engineering and maintenance services for solar system projects. This segment sells its ingot and solar wafer products primarily to solar cell manufacturers; and solar modules to installers, solar system integrators, property developers, and other value-added resellers. The company also sells and leases content management system and hardware; plans, designs, and develops construction for environmental protection and related project management; and manufactures and sells TFT-LCD modules and panels, TV sets, backlight modules, automotive parts, precision plastic parts, and motorized treadmills. In addition, it develops and sells software and hardware for health care industry; provides software and hardware integration system and equipment relating to intelligent manufacturing, as well as related consulting services; and engages in venture capital investment activities. The company operates in the People's Republic of China, Taiwan, Japan, Singapore, and internationally. AU Optronics Corp. was founded in 1996 and is headquartered in Hsinchu, Taiwan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "FITGF": {
        "short_name": "FIT HON TENG LTD",
        "long_name": "FIT Hon Teng Limited",
        "summary": "FIT Hon Teng Limited engages in the design, development, production, and sale of interconnect solutions and related products in Taiwan, People's Republic of China, the United States, Hong Kong, Malaysia, Singapore, and internationally. The company offers cable components, including array of IO cables assemblies, as well as wire harness and power cords. It also provides connector components comprising backplane, high speed, input/output, and power connectors, as well as memory/edge cards, sockets, terminal blocks, and wire to board/board to board connectors; and active optical cables, embedded optical modules, transceiver modules, and acoustic products. In addition, the company offers radio frequency antenna cable and module assemblies; wireless charging products and components; and accessories, such as headsets, speaker systems, and power and cable accessories. It also engages in research, development, and manufacture of batteries; manufacturing of metal processing machinery and equipment; and sale of smart home products. The company offers its products under the e Belkin, Linksys, Wemo, and Phyn brand names. It serves communications infrastructure, computers and consumer electronics, mobile and wireless devices, automotive, and industrial and medical industries. The company was formerly known as New Wing International Holdings Limited and changed its name to FIT Hon Teng Limited in June 2013. The company was incorporated in 2013 and is headquartered in New Taipei City, Taiwan. Foxconn FIT Hon Teng Limited is a subsidiary of Foxconn (Far East) Limited.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "HHP2.F": {
        "short_name": "HON HAI PR.IND.SP.GDR S/1",
        "long_name": "Hon Hai Precision Industry Co., Ltd.",
        "summary": "Hon Hai Precision Industry Co., Ltd. provides technology solutions in Japan, Ireland, the United States, Europe, Singapore, China, Hong Kong, and internationally. The company manufactures, sells, and services connectors, cases, thermal modules, wired/wireless communication products, optical products, power supply modules, and assemblies for use in the information technology, communications, automotive equipment, precision molding, automobile, and consumer electronics industries. It also manufactures automobile wires/electronic devices and electronic components, as well as machinery and equipment; and provides services of planning, advisory, and business management, as well as software and electronic information application, logistics, export processing, construction, leasing, and information/software services. In addition, the company manufactures and sells application modules and network cables assemblies; develops educational technology; holds patent applications; manufactures and trades in portable cameras; and retails office machinery and equipment, and electronic appliances. Further, it is involved in the reinvestment in the businesses relating to robots, automatic equipment, molds, parts, and accessories and corresponding services; software development, repair and after-sale services, and rental services of robots; leasing services. Additionally, the company manufactures and sells computer and data processing equipment, WIFI cards and modules, CFTVs, DVRs, Bluetooth modules, set-top boxes, and optical network terminals. It is also involved in the data storage; manufacturing of wire or wireless communication; installation of computer and satellite TV channels; and provision of mobile phone services, as well as telecom-related business. The company was founded in 1974 and is headquartered in New Taipei City, Taiwan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "HNHPF": {
        "short_name": "HON HAI PRECISION INDUSTRY",
        "long_name": "Hon Hai Precision Industry Co., Ltd.",
        "summary": "Hon Hai Precision Industry Co., Ltd. provides technology solutions in Japan, Ireland, the United States, Europe, Singapore, China, Hong Kong, and internationally. The company manufactures, sells, and services connectors, cases, thermal modules, wired/wireless communication products, optical products, power supply modules, and assemblies for use in the information technology, communications, automotive equipment, precision molding, automobile, and consumer electronics industries. It also manufactures automobile wires/electronic devices and electronic components, as well as machinery and equipment; and provides services of planning, advisory, and business management, as well as software and electronic information application, logistics, export processing, construction, leasing, and information/software services. In addition, the company manufactures and sells application modules and network cables assemblies; develops educational technology; holds patent applications; manufactures and trades in portable cameras; and retails office machinery and equipment, and electronic appliances. Further, it is involved in the reinvestment in the businesses relating to robots, automatic equipment, molds, parts, and accessories and corresponding services; software development, repair and after-sale services, and rental services of robots; leasing services. Additionally, the company manufactures and sells computer and data processing equipment, WIFI cards and modules, CFTVs, DVRs, Bluetooth modules, set-top boxes, and optical network terminals. It is also involved in the data storage; manufacturing of wire or wireless communication; installation of computer and satellite TV channels; and provision of mobile phone services, as well as telecom-related business. The company was founded in 1974 and is headquartered in New Taipei City, Taiwan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    }
}