{
    "2535.TW": {
        "short_name": "DA-CIN CONSTRUCTION CO",
        "long_name": "Da-Cin Construction Co.,Ltd.",
        "summary": "Da-Cin Construction Co.,Ltd. operates as a construction company in Taiwan and internationally. The company offers engineering, procurement, and construction services for roads, bridges, tunnels, and hillside development; and housing complexes, commercial office buildings, schools, hotels, hospitals, supermarkets, department stores, shopping centers, deep-excavation and high rises, and other construction works. It also provides engineering, procurement, and construction services for wafer factories, LCD panel factories, glass substrate and passive component factories, IC packaging factories, and other high-tech compounds; and MRT, underground railways, and other transportation construction. In addition, the company offers land cooperation, real estate sales, and new home after sales services. Da-Cin Construction Co.,Ltd. was founded in 1967 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei City"
    },
    "2543.TW": {
        "short_name": "HWANG CHANG GENERAL CONTRACTOR ",
        "long_name": "Hwang Chang General Contractor Co., Ltd",
        "summary": "Hwang Chang General Contractor Co., Ltd engages in construction activities in Taiwan. It undertakes the construction of public work and government contract turnkey, pumping station, baseball stadium, avenue, boulevard, road, highway, sewage treatment plant, underground station, expressway, sub-mountain diversion, and pipeline projects. The company was founded in 1981 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "2597.TW": {
        "short_name": "RUENTEX ENGINEERING & CONST. CO",
        "long_name": "Ruentex Engineering & Construction Co., Ltd.",
        "summary": "Ruentex Engineering & Construction Co., Ltd. engages in the civil and architectural construction contracting business in Taiwan and internationally. The company is involved in the design, planning, and construction and project management of various projects, including housings, villas, office buildings, high-tech plants, etc. It also manufactures and sells precast concrete products. The company was founded in 1975 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "5515.TW": {
        "short_name": "CHIEN KUO CONSTRUCTION CO",
        "long_name": "Chien Kuo Construction Co., Ltd.",
        "summary": "Chien Kuo Construction Co., Ltd., together with its subsidiaries, engages in the construction business in Taiwan and China. The company offers construction services for residential buildings, factory and office buildings, public facilities, and commercial buildings; undertakes the related electrical and mechanical engineering of air-conditioning, water and electricity, fire-fighting, intelligent building, etc.; and manages electromechanical projects. It also manufactures and sells commercial concrete; and participates in concrete supply and pumping for construction of roads, bridges, and residential projects. The company is also involved in the procurement, planning, installation, and consultation activities; and provision of cargo handling, international trade, and computer software technology development and consultation services. Chien Kuo Construction Co., Ltd. was founded in 1931 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "5519.TW": {
        "short_name": "LONGDA CONSTRUCTION & DEVELOPME",
        "long_name": "LongDa Construction & Development Corporation",
        "summary": "LongDa Construction & Development Corporation engages in the provision of construction services primarily in Taiwan. It also involves in the real estate development and leasing, and hotel business. The company was founded in 1982 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Kaohsiung"
    },
    "5521.TW": {
        "short_name": "KUNG SING ENGINEERING",
        "long_name": "Kung Sing Engineering Corporation",
        "summary": "Kung Sing Engineering Corporation, together with its subsidiaries, engages in the construction business in Taiwan. Its projects include roads, bridges, tunnels, residential buildings, airports, and railways, as well as marine works. The company was founded in 1941 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "8926.TW": {
        "short_name": "TAIWAN COGENERATION CORP",
        "long_name": "Taiwan Cogeneration Corporation",
        "summary": "Taiwan Cogeneration Corporation, together with its subsidiaries, operates cogeneration plants in Taiwan. The company invests in independent power plants (IPPs), cogeneration plants, and renewable energy power plants utilizing solar, wind, geothermal, and biomass energy. It also offers engineering planning, design, procurement, project development, installation, construction, financing, commissioning, operation, maintenance, and management for IPPs, cogeneration plants, and transmission projects. In addition, the company provides technical support and consulting services for power project investment, project development, construction execution, and power plant operation and maintenance. Taiwan Cogeneration Corporation was founded in 1992 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "9933.TW": {
        "short_name": "CTCI CORP",
        "long_name": "CTCI Corporation",
        "summary": "CTCI Corporation provides engineering, procurement, and construction services in Taiwan, Asia, the Middle East, and the Americas. It offers various services, such as project management; feasibility study and front-end engineering design; engineering; procurement; fabrication; construction; commissioning; intelligent solutions; automation and control; intelligent structure jacking and movement; ground freezing; and operations and maintenance services, as well as clean room, mechanical, electrical, and plumbing engineering solutions The company also provides stationery equipment that includes pressure vessels; piping pre-fabrication and heat exchangers; and other specialized non-pressure parts, such as pre-fabricated parts of package equipment, as well as assists with engineering works that include basic design, equipment sizing, engineering, and shop drawings; and performs equipment inspection/revamping, plant shut-down inspection, and plant maintenance works. In addition, it offers intelligent energy management system, an integrated software that monitors, analyzes, adjusts, and manages energy consumption. Further, the company provides chemical additives, such as antifouling agents, antipolymerization additives, and corrosion inhibitors for petrochemical plants; antifoam additives, antifouling additives, corrosion inhibitors, and emulsion breaking additives for refinery plants; and heavy metal chelate agents, heavy metal stabilizers, boiler water treatment additives, and active carbon products for incineration plants. It serves hydrocarbon, power, environmental, transportation, and industrial markets. CTCI Corporation was founded in 1979 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    }
}