{
    "6569.TWO": {
        "short_name": "ONYX HEALTHCARE INC",
        "long_name": "Onyx Healthcare Inc.",
        "summary": "Onyx Healthcare Inc., a professional medical IT company, provides medical PC solutions for the hospital/clinical IT market worldwide. It offers mobile cart computers, ubiquitous power solutions, remote management software, mobile medical tablets, surgical workstations, operating room solutions, fanless slim PPCs, medical AIO solutions, bedside infotainment, medical display solutions, MedPC box PCs, and medical slim mini-ITX MBs. The company also offers digital operation rooms, AI and robots, power management solutions, smart ward solutions, nurse stations, telecare and telemedicine, remote system management, and emergency medical services. In addition, it provides OEM/ODM services, such as planning, designing, validation, integration, production, after-sale, software, and design capability. The company was founded in 2010 and is headquartered in New Taipei City, Taiwan. Onyx Healthcare Inc. is a subsidiary of ASUS Group.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "8409.TWO": {
        "short_name": "EBM TECHNOLOGIES INCORPORATED",
        "long_name": "EBM Technologies Incorporated",
        "summary": "EBM Technologies Incorporated develops and markets software and integrity solutions to the health sector in Taiwan and internationally. The company offers Enterprise PACS (picture archiving and communication systems), including SoliPACS that unites various products of the radiology, mammography, and dental fields; SoliPACS Gateway, a DICOM gateway; SoliPACS Server, an interface between HIS and RIS patient data and PACS; SoliPACS Web Viewer, which enables radiologists and physicians to view DICOM-compliant images, compare them to examination results, utilize image enhancement tools, and select images for review; SoliPACS Report that offers a tool for generating customized reports; and Advanced Server Archive, a PACS storage system. It also provides MobiPACS applications, which allow clinicians to retrieve, view, and compare various medical images; MobiPACS Server to store, process, and retrieve image files for mobile devices; MobiPACS App, an in mobile medical image viewing app; MobiPACS Web Viewer for viewing images from Internet-enabled end devices; and MobiPACS Share, a cloud-based platform. In addition, the company offers MobiPACS Multi that supports doctors to connect various iPads/iPad Pros for image display; Vital-Sign On-the-Go, a patient monitoring solution; Rad@, which enables doctors and radiologists to view medical-grade images and diagnose; and Digital Pathology scanner. Further, it provides Telemed, which interlinks medical facilities; Electronic Medical Record, a digital version of the paper-based individual medical record for patients' medical history; Personal Health Record that offers electronic access to the individual's medical history; and eHealth solutions for retrieving and reviewing patient images, sign data, and ECG waveforms, as well as technical and after sales services. EBM Technologies Incorporated was founded in 1988 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    }
}