{
    "3114.TWO": {
        "short_name": "HOWTECH TECHNOLOGY",
        "long_name": "Howteh Technology Co., Ltd.",
        "summary": "Howteh Technology Co., Ltd. provides active and passive components, and equipment in Taiwan and internationally. The company offers connector, FFC, thunderbolt cable, MEMS, coaxial cable, conversion line, USB type C, audio amplifier, and LED controller products, as well as power management, radio frequency, and touch components. It also provides printed circuit boards and optoelectronic equipment. The company was founded in 1978 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.howteh.com.tw",
        "full_time_employees": null
    },
    "8374.TW": {
        "short_name": "ACE PILLAR CO LTD",
        "long_name": "Ace Pillar Co., Ltd.",
        "summary": "Ace Pillar Co., Ltd., an industrial automation company, distributes automatic mechatronics components in Taiwan and internationally. It offers automation controller and monitor systems, such as human machine interfaces, PLCs, magnesensors/laserscales, CCD cameras, CNC machine tool solutions, and fanless embedded systems; and automation drive control systems, including servo systems, linear servo and direct drive motors, PACs, and high-speed motion control systems. The company also provides inverters; automation mechanical transmission systems comprising couplings, harmonic reducers, precision bearings, planetary reducers, linear guideways, and ETP bushings; and pneumatic components, such as air-operated valves for chemical liquids, air conditioning units, solenoid valves, pneumatic cylinders, multi axis stages, and power pack with inverters. In addition, it offers technical services for the automation manufactures and customers. The company was founded in 1984 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.acepillar.com.tw",
        "full_time_employees": null
    }
}