{
  "6740.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Internet Retail",
    "long_name": "Mobix Corporation",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Mobix",
    "state": null,
    "summary": "Mobix Corporation operates mobile based e-commerce platform in Taiwan. The company was founded in 2016 and is based in Taipei, Taiwan. Mobix Corporation is a subsidiary of Kuobrothers Corp.",
    "website": "http://www.mobix.com.tw",
    "zipcode": "115"
  },
  "8044.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Internet Retail",
    "long_name": "PChome Online Inc.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PCHOME ONLINE INC.",
    "state": null,
    "summary": "PChome Online Inc. provides e-commerce and portal services in China and internationally. It operates through E-Commerce-Sales, Market Place, and Other segments. The company operates PChome 24h Shopping, PChome Shopping, and PChome Global Shopping Websites. It also operates portals that provide a range of network services, including news platforms, stock markets, email, Kaza personal blog, news, travel, car-buying, customized photo album, search channels, etc., as well as online adverting services, such as display advertising and display network. In addition, the company offers type II telecommunications, magazine publication, international trade and investment, online payment processing, travel agency, information, transportation and logistics, clothing sales, information processing, electronic information, and Internet services. PChome Online Inc. was founded in 1996 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.pchome.com.tw",
    "zipcode": "106"
  },
  "8454.TW": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Internet Retail",
    "long_name": "momo.com Inc.",
    "market": "tw_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MOMO COM INC",
    "state": null,
    "summary": "momo.com Inc. engages in the software design, TV and radio production, radio and TV program distribution, radio and TV advertising, issuing of magazine, and retailing businesses in Taiwan and internationally. It operates through two segments, Television and Magazine Department, and Internet Department. It also offers TV home shopping, online shopping, mail order service, travel service, and property and life insurance sales service. momo.com Inc. was founded in 2004 and is headquartered in Taipei City, Taiwan.",
    "website": "http://www.fmt.com.tw",
    "zipcode": "11493"
  },
  "8472.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Internet Retail",
    "long_name": "GOMAJI Corp., LTD",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GOMAJI CORP LTD",
    "state": null,
    "summary": "GOMAJI Corp., LTD provides e-commerce and advertising services in Taiwan. The company was founded in 1999 and is based in Taipei City, Taiwan.",
    "website": "http://www.gomaji.com",
    "zipcode": "106"
  },
  "8477.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Internet Retail",
    "long_name": "Kuobrothers Corp.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "KUOBROTHERS CORP",
    "state": null,
    "summary": "Kuobrothers Corp. operates B2C e-commerce business under the Living Bazaar name In Taiwan. The company provides online shopping platform for daily consumables, electric apparatuses, household commodities, storage and decoration devices, and delicacies. It also operates online trading platforms under the MobiX and MySport brand names. The company was founded in 2012 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.kuobrothers.com",
    "zipcode": null
  }
}
