{
    "2636.TW": {
        "short_name": "T3EX GLOBAL HOLDINGS CORP",
        "long_name": "T3EX Global Holdings Corp.",
        "summary": "T3EX Global Holdings Corp., an investment holding company, provides integrated logistics services in Taiwan, Hong Kong, China, Eastern Asia, and internationally. The company operates in two segments, Sea Export and Air Export. It offers international freight forwarding services, such as ocean freight and air freight services; and domestic logistics services, including sea and air freight import/export customs clearance, bonded area customs clearance and filing for re-import/re-export, logistics park of export and import transit operations, hazardous goods or tank container customs clearance, remote customs clearance and declaration, customs seal clearance operations, and inspection and quarantine. The company's domestic logistics services also comprise temporary warehousing for import and export goods, label replacement, sorting and repacking, pallet, warehouse space leasing, inventory management reports, and customized delivery services. It also provides warehousing and transportation; supply chain solutions; and e-commerce logistics solutions. The company was founded in 1987 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "2642.TW": {
        "short_name": "TAIWAN PELICAN EXPRESS CO LTD",
        "long_name": "Taiwan Pelican Express Co., Ltd.",
        "summary": "Taiwan Pelican Express Co., Ltd. provides trucking and door-to-door home delivery services in Taiwan. It offers C2C, B2C, and C2B home-delivery services. The company also provides warehousing and logistics, and tally and packaging services. It operates a fleet of 1,100 home delivery vehicles. The company was founded in 1999 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "2643.TWO": {
        "short_name": "SOONEST EXPRESS CO LTD",
        "long_name": "Soonest Express Co., Ltd.",
        "summary": "Soonest Express Co., Ltd. provides integrated logistics solutions in Taiwan and internationally. It offers air and ocean freight forwarding services; custom clearance services; transit/warehouse/transportation services; logistics management; international freight forwarding; cross-border e-commerce parcel delivery; and courier services. The company was founded in 1984 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "5601.TWO": {
        "short_name": "TAIWAN ALLIED CONTAINER TERMINA",
        "long_name": "Taiwan Allied Container Terminal Corp.",
        "summary": "Taiwan Allied Container Terminal Corp. engages in the container storage and warehouse rental activities. The company is involved in the concentration and decentralization of containers; container cargo unpacking, loading, and unloading; container maintenance and renovation; interlocking warehouses; and other businesses related to container terminals. It also constructs residential and commercial buildings, as well as offers tally packaging products and services. The company was founded in 1973 and is based in Keelung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Keelung"
    }
}