{
    "1598.TW": {
        "short_name": "DYACO INTERNATIONAL INC",
        "long_name": "Dyaco International Inc.",
        "summary": "Dyaco International Inc. designs, manufactures, and distributes fitness, physical therapy, and sports equipment worldwide. It provides cardiovascular equipment for the home, commercial, and medical facilities; and indoor cycling solutions. The company offers its fitness, medical and rehabilitation, and physical therapy equipment to home users, commercial fitness operators, and physical therapy facilities under the Spirit Fitness, Xterra, Johnny G, SOLE Fitness, Philips, UFC, and gym80 brands. Dyaco International Inc. was founded in 1990 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "4536.TW": {
        "short_name": "TOPKEY CORPORATION",
        "long_name": "Topkey Corporation",
        "summary": "Topkey Corporation designs, develops, and manufactures medical components, aviation seatbacks, and bike components in Taiwan. The company offers bicycle frame sets and other accessories; safety products, including helmets; and carbon composite rackets and tennis rackets. It also provides manufacture aircraft composite parts; and medical parts, such It as composite CT tables and accessories, as well as thermoplastic resin and fiber reinforced thermoplastic products. The company was founded in 1980 and is based in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung City"
    },
    "6670.TW": {
        "short_name": "FUSHENG PRECISION CO LTD",
        "long_name": "FuSheng Precision Co., Ltd.",
        "summary": "Fusheng Precision Co., Ltd. engages in the contract manufacturing of golf equipment primarily in Japan, the United States, and internationally. The company offers golf club heads, graphite shafts, and assembled clubs, as well as club head accessories; baseball bats; and precision casting parts for aerospace, automobile, and industrial uses. It also manufactures and sells medical equipment; sells titanium tableware and kitchenware; and researches, develops, and manufactures hardware, plastics, printing of packaging, and vacuum technology products. In addition, the company engages in the metal products import and export business; anodizing process; and vacuum coating processing. Fusheng Precision Co., Ltd. was founded in 1953 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "9921.TW": {
        "short_name": "GIANT MANUFACTURING CO",
        "long_name": "Giant Manufacturing Co., Ltd.",
        "summary": "Giant Manufacturing Co., Ltd. manufactures and sells bicycles, electric bicycles, and related parts worldwide. It operates through Bicycle, Materials, and Others segments. The company offers on-road, x-road, off-road, youth, rider gear, bike gear, and service gear bicycles. It markets its products through approximately 12,000 retail stores. The company was founded in 1972 and is headquartered in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "9943.TW": {
        "short_name": "HOLIDAY ENTERTAINMENT CO",
        "long_name": "Holiday Entertainment Co.,Ltd",
        "summary": "Holiday Entertainment Co., Ltd. provides karaokes and audiovisual equipment in Taiwan. The company operates through Audiovisual Equipment and Copyright Works businesses. It also engages in the management and consultancy for karaoke, as well as restaurant operations. In addition, the company distributes and sells audiovisual equipment and supplies, including boxes. As of December 31, 2013, it operated 52 branches. The company was founded in 1993 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei City"
    }
}