{
    "1565.TWO": {
        "short_name": "ST SHINE OPTICAL",
        "long_name": "St.Shine Optical Co.,Ltd.",
        "summary": "St.Shine Optical Co.,Ltd. designs, manufactures, markets, and supplies contact lens in Taiwan and internationally. It offers daily spherical, frequent replacement spherical, aberration control, toric frequent replacement, color, and silicone hydrogel soft contact lens, as well as lathe-cut, cast-molding, and RGP lenses. The company offers its products for myopic and hyperopic patients for the correction of astigmatism. The company was formerly known as First Optical Co., Ltd. and changed its name to St.Shine Optical Co.,Ltd. in 1986. St.Shine Optical Co.,Ltd. was founded in 1981 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "22146",
        "website": "http://www.stshine.com.tw",
        "market_cap": "Small Cap"
    },
    "1752.TWO": {
        "short_name": "NANG KUANG PHARMACEUTICAL CO",
        "long_name": "Nang Kuang Pharmaceutical Co., Ltd.",
        "summary": "Nang Kuang Pharmaceutical Co., Ltd. operates as a pharmaceutical company primarily in Taiwan. The company provides parenterals, aseptic parenterals, lyophilized injections, pre-filled syringes, and pre-mixed IV infusion bags, as well as tablets, capsules, topical products, and oral suspensions. It offers various products in the areas of cardiovascular system, gastrointestinal system, nervous system, alimentary and metabolism, blood, antineoplastic and immunomodulatory, musculo-skeletal system, respiratory system, dermatological, genito-urinary and sex hormone, systemic hormone, systemic antibacterial, and cosmetics, as well as hospital solution. Nang Kuang Pharmaceutical Co., Ltd. was founded in 1963 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "71243",
        "website": "http://www.nangkuang.com.tw",
        "market_cap": "Small Cap"
    },
    "1783.TW": {
        "short_name": "MAXIGEN BIOTECH INC",
        "long_name": "Maxigen Biotech Inc.",
        "summary": "Maxigen Biotech Inc. engages in the development, manufacture, and marketing of biomedical and skincare products in Taiwan and internationally. The company offers Formagraft, a bone graft substitute; Formasetin, a bone void filler; and intra-articular injections under the ArtiAid, ArtiAid Plus, and ArtiBest names for use in orthopedic area. It also provides Foramic, a bone substitute granule; MaxiBone, a calcium phosphate ceramic; and GingivAid, a collagen dental grafts for use in orthopedic and dental areas. In addition, the company offers FormaAid, a collagen membrane; and E-TECH DENTISTAR II sterilizer and disinfectant for use in dental area, as well as HealiAid, a collagen wound dressing product for use in dental and wound dressing area. Further, it provides ophthalmic viscoelastic device under the ViscAid, PreviscAid, and BiVisc names; and Formaderm, a dermal filler injection for use in plastic surgery. Additionally, the company offers skincare products, including face, neck, body, limbs, and other masks; and make up remover, cleansing, exfoliating, toner, essence, men's care, sunscreen, body care, hand/foot care, and special care products. Maxigen Biotech Inc. was founded in 1998 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "333",
        "website": "http://www.mbi.com.tw",
        "market_cap": "Small Cap"
    },
    "1786.TW": {
        "short_name": "SCIVISION BIOTECH INC",
        "long_name": "SciVision Biotech Inc.",
        "summary": "SciVision Biotech Inc. manufactures and sells hyaluronic acid products in Taiwan. It offers synovial fluid supplements, facial dermal implants, absorbable adhesion barriers, and intravesical instillation products. The company was founded in 2001 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "806011",
        "website": "http://www.scivision.com.tw",
        "market_cap": "Small Cap"
    },
    "4107.TWO": {
        "short_name": "BIOTEQUE CORP",
        "long_name": "Bioteque Corporation",
        "summary": "Bioteque Corporation manufactures and sells medical devices in Asia, South America, North America, and internationally. The company provides medical disposables for use in hemodialysis access, endovascular treatment, and other fields. It also offers dialysis products, including hemodialysis bloodlines, A.V.F. needles, and hemodialysis catheters; interventional radiology products, such as pigtail drainage catheter sets, introducer sets, connecting tubes, drainage bags, and radiopaque dilators; urology products comprising ureteral stent sets and urine collection bags; and IV administration products, such as PVC IV infusion bags, PVC bags, and twist-off ports. In addition, the company provides respiratory care products, such as closed suction catheters, and endotracheal tubes; vascular access products comprising angiographic catheters, PTA balloon dilatation catheters, sheath introducers, guidewires, high pressure connecting tubes, PTCA balloon dilatation catheter-rapid exchange products, manifolds, and Y connectors; and medical components, including dialyzer connectors and caps, recirculating connectors with cap, rotating luer lock connectors, pump and T connectors, injection sites, female luers, and luer lock and chamber caps. Bioteque Corporation was founded in 1991 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://www.bioteq.com.tw/en-global/",
        "market_cap": "Small Cap"
    },
    "4116.TWO": {
        "short_name": "BENQ MEDICAL TECHNOLOGY CORPORA",
        "long_name": "BenQ Medical Technology Corporation",
        "summary": "BenQ Medical Technology Corporation provides medical equipment, consumables, and solutions for various medical institutions and professionals worldwide. It offers operating tables, surgical lights, ultrasound systems, medical and protective masks, medical display monitors, and IQOR integrated systems. The company was formerly known as Trident Medical Corp. and changed its name to BenQ Medical Technology Corporation in June 2011. BenQ Medical Technology Corporation was founded in 1988 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.benqmedicaltech.com",
        "market_cap": "Small Cap"
    },
    "4126.TWO": {
        "short_name": "PACIFIC HOSPITAL SUPPLY CO",
        "long_name": "Pacific Hospital Supply Co., Ltd",
        "summary": "Pacific Hospital Supply Co., Ltd., together with its subsidiaries, manufactures, processes, and sells medical disposable products and equipment in Taiwan. The company's disposable medical devices include tubings, bags, bottles, closed wound drainage systems, surgical suction instruments, respiratory therapy products, and other products. It also provides medical gas systems, such as medical gas outlets, secondary equipment, accessories, and pipeline equipment, as well as pipeline system design and maintenance services. Pacific Hospital Supply Co., Ltd. offers its products for health care industry clients. The company also exports its products to approximately 80 countries and regions. Pacific Hospital Supply Co., Ltd. was founded in 1977 and is headquartered in Miaoli, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Miaoli",
        "zipcode": null,
        "website": "http://www.pahsco.com.tw",
        "market_cap": "Small Cap"
    },
    "4150.TWO": {
        "short_name": "UNICON",
        "long_name": "Unicon Optical Co., Ltd.",
        "summary": "Unicon Optical Co., Ltd. manufactures and sells contact lenses primarily for ODM/OEM market in Taiwan. The company offers disposable contact, coating design color, aspheric, and silicone lenses. It also exports its products to Japan, China, Germany, the Netherlands, Italy, Poland, Russia, Canada, India, South Africa, and Singapore. The company was founded in 1992 and is based in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu",
        "zipcode": "30075",
        "website": "http://www.unicon.com.tw",
        "market_cap": "Small Cap"
    },
    "4737.TW": {
        "short_name": "BIONIME CORPORATION",
        "long_name": "Bionime Corporation",
        "summary": "Bionime Corporation manufactures and sells medical instruments in Algeria, the United States, Switzerland, China, and internationally. It offers medical testing blood glucose management products for self-monitor and hospital/clinic use, as well as accessories, such as test strips and lancing devices. The company was founded in 2003 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "40242",
        "website": "http://www.bionime.com",
        "market_cap": "Small Cap"
    },
    "546.SI": {
        "short_name": "$ Medtecs Intl",
        "long_name": "Medtecs International Corporation Limited",
        "summary": "Medtecs International Corporation Limited, an integrated healthcare products and services provider, manufactures and distributes medical consumables for healthcare distributors, pharmaceutical companies, and hospital groups worldwide. It operates through Manufacturing, Hospital Services, and Distribution segments. The Manufacturing segment produces and sub-contracts a range of medical consumables, including patients' apparels, disposable surgical masks, boot covers and surgical gowns, underpads, adult diapers, crochet blankets, bed linens, and medical bandages. The Hospital Services segment provides laundry and leasing services, including hospital linen rental and laundry, management of hospital laundry facilities, hospital automation, and other non-core hospital functions for hospitals in Taiwan and the Philippines. The Distribution segment markets Medtecs-branded medical consumables to hospitals, pharmacies, and other end users in the Asia Pacific. This segment also supplies other branded medical supplies and equipment comprising wheel chairs, syringes, nebulizers, and blood pressure monitors. Medtecs International Corporation Limited also manufactures, leases, trades in, and sells woven and knitted fabrics, and other made-up articles of textile products; trades in hospital textiles and garments, pillow cases, bed sheets, gowns, and other apparel products; and provides garters and other garment products. It also engages in the subleasing activities; and manufacture and supply personal protective equipment. The company was founded in 1989 and is headquartered in Taipei, Taiwan.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "110",
        "website": "http://www.medtecs.com",
        "market_cap": "Small Cap"
    },
    "6491.TW": {
        "short_name": "PEGAVISION CORPORATION",
        "long_name": "Pegavision Corporation",
        "summary": "Pegavision Corporation manufactures and sells various soft contact lenses and medical optic devices under the Pegavision brand in Taiwan. The company was incorporated in 2009 and is based in Taoyuan City, Taiwan. Pegavision Corporation is a subsidiary of Pegatron Corp.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "333",
        "website": "http://www.pegavision.com",
        "market_cap": "Small Cap"
    },
    "6493.TWO": {
        "short_name": "TTBIO",
        "long_name": "Ttbio Corp.",
        "summary": "Ttbio Corp. manufactures and sells medical instruments under the TTBIO brand name in Taiwan and internationally. The company offers high and low speed hand piece products, dental spare parts, service rotors, maintenance units, and electric hand piece systems. It also provides precision machined parts and components to various industries, including medical, automotive, aerospace, computer components, security, maintenance parts, and custom machining. The company was founded in 2012 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "40755",
        "website": "http://www.ttbio.com",
        "market_cap": "Small Cap"
    },
    "6499.TWO": {
        "short_name": "MEDEON BIODESIGN INC",
        "long_name": "Medeon Biodesign, Inc.",
        "summary": "Medeon Biodesign, Inc. develops and markets medical device solutions in Taiwan. It focuses on developing devices for minimally invasive surgeries, such as Duett, a vascular graft system; ClickClean, a solution to view throughout laparoscopic surgeries; AbClose to prevent port site herniation caused by improper closure; Mercury to widen the narrowed prostatic urethra tissue creating an open urethral lumen for normal urinary flow; PUMA, a solution to treat orthopedic extremity injuries; and Cross-Seal, a large-bore closure device. The company was founded in 2012 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11170",
        "website": "http://www.medeonbio.com",
        "market_cap": "Small Cap"
    },
    "6527.TWO": {
        "short_name": "CRYSTALVUE MEDICAL CO LTD",
        "long_name": "Crystalvue Medical Corporation",
        "summary": "Crystalvue Medical Corporation designs, manufactures, and sells medical devices. Its products include OCT devices, fundus cameras, chin rest devices, digital microscope cameras, tonometers, nucleic acid extraction system, polymerase chain reaction system, gastrointestinal endoscopic disposable devices, etc. The company offers automated retina cameras; FundusVue, a diagnosis instrument for ophthalmologists to inspect and record the patients' retina; and TonoVue, a diagnosis instrument to measure IOP of the patient. Crystalvue Medical Corporation was founded in 2009 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33072",
        "website": "http://www.crystalvue.com.tw",
        "market_cap": "Small Cap"
    },
    "6612.TWO": {
        "short_name": "ICARES MEDICUS INC",
        "long_name": "ICARES Medicus, Inc.",
        "summary": "ICARES Medicus, Inc. engages in the research and development, manufacture, and sale of ophthalmic medical materials. The company provides nanomedical lubricious coatings and various surface treatments for implantable or interventional medical devices; intraocular lenses for the treatment of cataracts, myopia, hyperopia, presbyopia, or astigmatism; and nanomedical devices. It has operations in the United States, England, Japan, Taiwan, Spain, Hungary, China, and internationally. The company was founded in 2011 and is based in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": null,
        "website": "http://www.icaresmedicus.com",
        "market_cap": "Small Cap"
    },
    "6730.TWO": {
        "short_name": "LAGIS",
        "long_name": "Lagis Enterprise Co., Ltd.",
        "summary": "Lagis Enterprise Co., Ltd., a medical device development company, develops and markets medical devices for the laparoscopic and endoscopic surgical markets worldwide. Its products include trocars, single port surgery devices, and wound protectors; endo devices, such as hand instruments and advanced bipolar devices; specimen retrieval products; suction irrigation systems and irrigation pumps; training systems; and related accessories. The company was founded in 2004 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "43767",
        "website": "http://www.lagis.com.tw",
        "market_cap": "Small Cap"
    },
    "9103.TW": {
        "short_name": "MEDTECS INTERNATIONAL CORP",
        "long_name": "Medtecs International Corporation Limited",
        "summary": "Medtecs International Corporation Limited, an integrated healthcare products and services provider, manufactures and distributes medical consumables for healthcare distributors, pharmaceutical companies, and hospital groups worldwide. It operates through Manufacturing, Hospital Services, and Distribution segments. The Manufacturing segment produces and sub-contracts a range of medical consumables, including patients' apparels, disposable surgical masks, boot covers and surgical gowns, underpads, adult diapers, crochet blankets, bed linens, and medical bandages. The Hospital Services segment provides laundry and leasing services, including hospital linen rental and laundry, management of hospital laundry facilities, hospital automation, and other non-core hospital functions for hospitals in Taiwan and the Philippines. The Distribution segment markets Medtecs-branded medical consumables to hospitals, pharmacies, and other end users in the Asia Pacific. This segment also supplies other branded medical supplies and equipment comprising wheel chairs, syringes, nebulizers, and blood pressure monitors. Medtecs International Corporation Limited also manufactures, leases, trades in, and sells woven and knitted fabrics, and other made-up articles of textile products; trades in hospital textiles and garments, pillow cases, bed sheets, gowns, and other apparel products; and provides garters and other garment products. It also engages in the subleasing activities; and manufacture and supply personal protective equipment. The company was founded in 1989 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "110",
        "website": "http://www.medtecs.com",
        "market_cap": "Small Cap"
    }
}