{
    "1799.TWO": {
        "short_name": "EASYWELL BIOMEDICAL INC",
        "long_name": "Easywell Biomedicals, Inc.",
        "summary": "Easywell Biomedicals, Inc., a biopharmaceutical and medical device company, develops and commercializes medical devices, drug substances, and pharmaceutical dosage forms in Taiwan and internationally. The company offers pharmaceutical products, which include high-barrier generics for the treatment of anti-cough, anti-urinary incontinence, breast cancer in PMS women, anti-depression, prevention of pneumocystis pneumonia, epilepsy, chronic angina, and inflammatory lesions of rosacea; and 505(b)(2) drugs for the treatment of Parkinson's, urinary, and pneumonia diseases. It also provides medical devices, including digital clinical, infrared ear, and non-contact forehead infrared thermometers. The company was formerly known as Actherm Inc. and changed its name to Easywell Biomedicals, Inc. in July 2015. Easywell Biomedicals, Inc. was incorporated in 1998 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30076",
        "website": "http://www.easywellbio.com",
        "market_cap": "Micro Cap"
    },
    "3373.TWO": {
        "short_name": "RADIANT INNOVATION INC",
        "long_name": "Radiant Innovation Inc.",
        "summary": "Radiant Innovation Inc. designs and develops infrared technology products. It offers medical infrared thermometers, industrial use infrared thermometers, and CO2 monitors. The company also provides infrared ear and forehead thermometers, multi-function thermometers, disposable probe covers, and TMS products. Radiant Innovation Inc. was founded in 2000 and is based in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.radiantek.com.tw",
        "market_cap": "Micro Cap"
    },
    "4104.TW": {
        "short_name": "EXCELSIOR MEDICAL CO LTD",
        "long_name": "Excelsior Medical Co., Ltd.",
        "summary": "Excelsior Medical Co., Ltd. distributes medical related systems in Taiwan, China, Japan, Korea, Malaysia, and the Philippines. The company offers equipment for hemodialysis, regular drug used in the medical institution, surgical equipment, and medical assistant electronics; and cosmetic equipment. It also provides medical administration services for single department. The company was founded in 1988 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "235",
        "website": "http://www.excelsiormedical.com.tw",
        "market_cap": "Micro Cap"
    },
    "4121.TWO": {
        "short_name": "ROSSMAX INTERNATIONAL",
        "long_name": "Rossmax International Ltd.",
        "summary": "Rossmax International Ltd. develops and supplies healthcare products and solutions in Taiwan. The company offers activity monitor, a device for monitoring and tracking fitness-related metrics, such as distance walked or run, counting steps, and calories burned; body fat monitors that are used to measure body fat, body mass index, lean mass, muscle mass, and water ratio along with body weight; blood pressure monitors; sphygmomanometer, a device that measures blood pressure; stethoscope, an acoustic medical device for auscultation, or listening to the internal sounds; handheld pulse oximeter monitors to measure the amount of oxygen carried in the body; non-contact telephoto thermometers; and blood glucose monitoring system, a medical device for determining the approximate concentration of glucose in the blood. It also provides nebulizer, a drug delivery device used to administer medication; suction unit, a machine used to remove mucus and other bodily fluids; aero spacer, a device used to increase the ease of administering aerosolized medication; peak flow meter, a device used to monitor a person's ability to breathe out air; heating pad for therapy; and anti-decubitus mattresses. In addition, the company operates rossmax healthstyle app, which offers distributors the possibility to manage their store locations, product promotions, and local events; and health station for pharmacies, doctors, and public places. It provides healthcare products in the fields of cardiovascular, diabetes, respiratory, fever, and wound healing diseases. The company also exports its products. Rossmax International Ltd. was incorporated in 1988 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.rossmax.com",
        "market_cap": "Micro Cap"
    },
    "4129.TWO": {
        "short_name": "UNITED ORTHOPEDIC CORPORATION",
        "long_name": "United Orthopedic Corporation",
        "summary": "United Orthopedic Corporation engages in the research, development, manufacture, and sale of orthopedic implants and orthopedic surgical instruments. It offers orthopedic surgical equipment and its manufacturing equipment; and special metal and plastics materials, as well as education, service, and support for surgeons and hospital. The company's products portfolio includes artificial hip joints, including partial hip joints, joints for large trochanteric fracture, Moore hip prosthesis, and customized artificial hip joints for individual tumor patients; artificial knee joint, such as artificial knee replacement joint, revision knee replacement system, restricted artificial knee joints, and customized artificial knee joints for individual tumor patients; and spine products consisting of vertebral fixation devices. It Corporation also provides injury and other orthopedic products comprise orthopedic internal fixation, bone plates, bone nails, bone pins, and bone screws; and OEM products, such as orthopedic internal fixation. In addition, the imports and exports its products. It serves in Taiwan, Asia, the United States, Europe, Africa, and Australia. The company was founded in 1993 and is headquartered in New Taipei City, Taiwan. United Orthopedic Corporation is a subsidiary of Chi-Yi Investment Co. Ltd.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23452",
        "website": "http://www.uoc.com.tw",
        "market_cap": "Micro Cap"
    },
    "4129A.TWO": {
        "short_name": "UNITED ORTHOPEDIC CORPORATION",
        "long_name": "United Orthopedic Corporation",
        "summary": "United Orthopedic Corporation engages in the research, development, manufacture, and sale of orthopedic implants and orthopedic surgical instruments. It offers orthopedic surgical equipment and its manufacturing equipment; and special metal and plastics materials, as well as education, service, and support for surgeons and hospital. The company's products portfolio includes artificial hip joints, including partial hip joints, joints for large trochanteric fracture, Moore hip prosthesis, and customized artificial hip joints for individual tumor patients; artificial knee joint, such as artificial knee replacement joint, revision knee replacement system, restricted artificial knee joints, and customized artificial knee joints for individual tumor patients; and spine products consisting of vertebral fixation devices. It Corporation also provides injury and other orthopedic products comprise orthopedic internal fixation, bone plates, bone nails, bone pins, and bone screws; and OEM products, such as orthopedic internal fixation. In addition, the imports and exports its products. It serves in Taiwan, Asia, the United States, Europe, Africa, and Australia. The company was founded in 1993 and is headquartered in New Taipei City, Taiwan. United Orthopedic Corporation is a subsidiary of Chi-Yi Investment Co. Ltd.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23452",
        "website": "http://www.uoc.com.tw",
        "market_cap": null
    },
    "4161.TWO": {
        "short_name": "BIOPTIK TECH INC",
        "long_name": "Bioptik Technology Incorporation",
        "summary": "Bioptik Technology Incorporation researches, develops, produces, and sells medical devices and reagents in Taiwan and internationally. The company offers EasyMate blood glucose monitoring systems; blood glucose/cholesterol/uric acid monitoring systems and its strips; and hyaluronic acid skin care products. It also provides skin care products and dietary supplements, as well as biodiesel products. The company was founded in 1999 and is headquartered in Zhunan, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhunan",
        "zipcode": "35057",
        "website": "http://www.bioptik.com.tw",
        "market_cap": "Nano Cap"
    },
    "4188.TWO": {
        "short_name": "AMCAD BIOMED CORPORATION",
        "long_name": "AmCad BioMed Corporation",
        "summary": "AmCad BioMed Corporation develops computer-assisted detection and diagnosis (CAD) software devices primarily in Taiwan. Its products include AmCAD-UT Detection, a CAD device for ultrasound images of thyroid nodules; and AmCAD-UO, a solution for obstructive sleep apnea detection. The company is also developing AmCAD-CA, a software designed for analyzing digital cytological images; AmCAD-US, a software device for visualizing and quantifying statistical distributions of backscattered signals echoed by tissue compositions in the body from FDA-cleared ultrasound systems; and AmCAD-UV, a software device that is used for quantifying and classifying the ultrasonic color intensity data acquired from FDA-cleared ultrasound systems and displaying the noise-reduced color-coded pulsatile signals. The company was founded in 2008 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://amcad.com.tw",
        "market_cap": "Nano Cap"
    },
    "4735.TWO": {
        "short_name": "AVITA CORPORATION",
        "long_name": "AViTA Corporation",
        "summary": "AViTA Corporation manufactures and sells home healthcare products for clinical and personal use. It offers various OEM/ODM solutions. The company's products include non-contact thermometers, infrared/forehead thermometers, arm and wrist type blood pressure monitors, and electronic lice combs. AViTA Corporation was founded in 1996 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "24158",
        "website": "http://www.avita.com.tw",
        "market_cap": "Micro Cap"
    },
    "4736.TWO": {
        "short_name": "TAIDOC TECHNOLOGY CORPORATION",
        "long_name": "TaiDoc Technology Corporation",
        "summary": "TaiDoc Technology Corporation manufactures and markets medical devices worldwide. It offers diagnostics products, including blood glucose and multiple parameters monitoring systems, point of care testing devices, lancet and lancing devices, and vet health care products comprise blood glucose and calcium meters, non-contact forehead thermometers, and blood ketone meters; and medical devices, such as nebulizers, thermometers, blood pressure monitors, vital sign monitors, medical kiosk, pulse oximeters, and weight scale. The company also provides telehealth remote monitoring devices and smartphone applications; and Covid-19 antigen rapid test kits. In addition, it offers services for regulatory professionals, as well as in the areas of clinical suggestions, engineering resources, and manufacturing systems. The company was founded in 1998 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "24888",
        "website": "http://www.taidoc.com",
        "market_cap": "Small Cap"
    },
    "6572.TWO": {
        "short_name": "PlexBio",
        "long_name": "PlexBio Co., Ltd.",
        "summary": "PlexBio Co., Ltd. designs, develops, and manufactures multiplexing platforms and assays to enable genetic research and clinical cancer diagnostics. It offers IntelliPlex SARS-CoV-2/Flu Kit, an in vitro diagnostic device; IntelliPlex SARS-CoV-2 Detection Kit, an automated solution for testing during the coronavirus disease; IntelliPlex Lung Cancer Panel-cfDNA, a molecular assay for mutations; IntelliPlex Lung Cancer Panel Â\u0096 cfRNA, which detects various variants of the ALK, ROS1, RET, NTRK1, and MET genes using cell-free RNA derived from plasma of patients with NSCLC; IntelliPlex Lung Cancer Panel, which detects various DNA mutations; IntelliPlex BRAF V600 Mutation Kit, a single well solution for mutations; IntelliPlex EGFR Mutation Kit, a molecular assay for somatic mutations; IntelliPlex KRAS Mutation Plus Kit, a solution for clinically actionable mutations; IntelliPlex NRAS Mutation Kit, a single well mutation kit; IntelliPlex PIK3CA Mutation Kit, a PCR mutation kit; IntelliPlex ALK Rearrangement Kit, a single well solution for actionable ALK gene rearrangements; IntelliPlex RET/NTRK1 Rearrangement Kit, a single well RET and NTRK1 gene rearrangement kit; IntelliPlex ROS1 Rearrangement Kit, a molecular assay for clinical actionable gene rearrangements; IntelliPlex Food Testing Kit for Dairy, a single well solution for bacteria; and pCode Coupling Buffer Set, a solution for coupling process. The company also offers IntelliPlex 1000 pCode Processor, a hybridization, washing, incubation, and labeling solution; PlexBio 100 Fluorescent Analyzer, an optical imaging system; DigiPlex Thermocycler, an instrument for PCR amplification; pCode MicroDisc, a solution for multiplexing applications; PlexBio Magnetic Stand, a solution for paramagnetic pCode precipitation; pCode Coupling Buffer Set, a solution to-use buffers; and DeXipher software for data analysis and interpretation. PlexBio Co., Ltd. was founded in 2009 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11491",
        "website": "http://www.plexbio.com",
        "market_cap": "Micro Cap"
    },
    "6633.TWO": {
        "short_name": "Somnics",
        "long_name": "Somnics, Inc.",
        "summary": "Somnics, Inc., a medical device company, focuses on developing technologies for the treatment of obstructive sleep apnea (OSA). The company offers iNAP One and iNAP Lite sleep therapy systems, which utilize oral negative pressure technology to treat OSA, a sleep-related breathing disorder. Somnics, Inc. was founded in 2011 and is based in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": "30261",
        "website": "http://www.somnics.com",
        "market_cap": "Nano Cap"
    },
    "6649.TWO": {
        "short_name": "TAIWAN BIOMATERIAL CO LTD",
        "long_name": "Taiwan Biomaterial Co., Ltd.",
        "summary": "Taiwan Biomaterial Co., Ltd. develops and sells medical devices in Taiwan. The company provides Foamagen, an absorbable biomaterial for dura reconstruction after surgeries; stroke interventional treatment devices; and devices for the treatment of early degenerative arthritis, and tissue repair and regeneration. Taiwan Biomaterial Co., Ltd. is based in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": "302",
        "website": "http://www.twbm.com.tw",
        "market_cap": "Nano Cap"
    },
    "6734.TWO": {
        "short_name": "iXensor",
        "long_name": "iXensor Co., Ltd.",
        "summary": "iXensor Co., Ltd. develops, produces, and sells hardware and software systems for in-vitro diagnostic medical devices. The company's PixoTest technology uses the lighting and image sensing module of the smartphone to detect the color change reaction on the biochemical test strip. It offers PixoTest Blood Glucose Monitoring System and PixoTest POCT System for chronic diseases management; Eveline Smart Fertility System for women's health management; and systems for infectious disease management, as well as PixoHealth App, which measures, records, and uploads test readings to the cloud. The company was founded in 2012 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11492",
        "website": "http://www.ixensor.com",
        "market_cap": "Nano Cap"
    },
    "6747.TWO": {
        "short_name": "BRIGHTEN OPTIX CORPORATION",
        "long_name": "Brighten Optix Corporation",
        "summary": "Brighten Optix Corporation researches and develops, manufactures, and sells specialty contact lenses in Taiwan and the Asia Pacific region. The company offers its products under the Ortho-K myopia management lens, HiClear gas permeable (GP) lens, Briomoist lens care systems, SynergEyes hybrid lens, and Large Diameter GP lens. It also provides OEM/ODM collaboration services. The company is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "11167",
        "website": "http://www.brightenoptix.com.tw",
        "market_cap": "Micro Cap"
    },
    "6767.TWO": {
        "short_name": "WILTROM CO LTD",
        "long_name": "Wiltrom Co., Ltd.",
        "summary": "Wiltrom Co., Ltd. researches, develops, and produces a range of implantable medical devices. Its products include spinal fixation systems, interbody fusion systems, bone graft substitutes, vertebral body augmentation systems, and vertebroplasty bone cement. The company is based in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": "30261",
        "website": "http://www.wiltrom.com.tw",
        "market_cap": "Nano Cap"
    },
    "6796.TWO": {
        "short_name": "MiiS",
        "long_name": "Medimaging Integrated Solution Inc.",
        "summary": "Medimaging Integrated Solution Inc. provides digital and portable diagnostic solutions. It designs and manufactures digital hand-held diagnostic scopes, as well as auxiliary tools. The company was founded in 2010 and is based in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu",
        "zipcode": "30077",
        "website": "http://www.miis.com.tw",
        "market_cap": "Micro Cap"
    }
}