{
  "1517.TW": {
    "city": "Changhua",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Metal Fabrication",
    "long_name": "Leechi Machinery Industry Ltd. Co.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "LEE CHI ENTERPRISES CO",
    "state": null,
    "summary": "Leechi Machinery Industry Ltd. Co. manufactures and sells bicycle components in Taiwan and internationally. Its product portfolio includes disc brakes, brakes and levers, seat posts, stems, handle bars, part accessories, and other products. The company provides its products under the PROMAX brand. The company was formerly known as Leechi Enterprise Co. Ltd. Leechi Machinery Industry Ltd. Co. was founded in 1973 and is headquartered in Changhua City, Taiwan.",
    "website": "http://www.leechi.com.tw",
    "zipcode": "500"
  },
  "1586.TWO": {
    "city": "Changhua",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Metal Fabrication",
    "long_name": "China Fineblanking Technology Co.,Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "CHINA FINEBLANKING TECHNOLOGY C",
    "state": null,
    "summary": "China Fineblanking Technology Co.,Ltd. develops and sells fine blanking products in China, Taiwan, and Malaysia. The company offers HDD VCM, gearbox parking and shifting mechanisms, door locks, hydraulic pumps, powertrains, brake parts, seat parts, gear boxes and clutches, gear box parts, synchronize rings, bicycling cassettes, and other products. The company was founded in 1992 and is based in Changhua, Taiwan.",
    "website": "http://www.cftc-hc.com.tw",
    "zipcode": "51648"
  },
  "2474.TW": {
    "city": "Tainan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Metal Fabrication",
    "long_name": "Catcher Technology Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "CATCHER TECHNOLOGY",
    "state": null,
    "summary": "Catcher Technology Co., Ltd., together with its subsidiaries, manufactures and sells aluminum and magnesium extrusions, and stamping products and molds in Taiwan and China. It offers casing, internal components, molds, and thermal modules for electronic products. The company's products include upper case, lower case, keyboard cover, and monitor casings for notebook computers; casings for various server specifications and desktop computers; industrial computer casings and internal parts; and computer accessories, such as plugs and A/V connector casings. The company also produces customized thin and precision-oriented communication application products, such as phones and pad-like products, as well as communication accessories, such as earphones and camera heads; and consumer electronic products, such as digital still cameras, camcorders, MP3 products, and related accessories. In addition, it offers ventilation blades, air-power tools, automobiles, TVs and lightning equipment. Further, the company manufactures, sells, and develops varied metal products; and engages in the trading, leasing, and investing activities. The company was founded in 1984 and is headquartered in Tainan, Taiwan.",
    "website": "http://www.catcher.com.tw/",
    "zipcode": "710"
  },
  "3303.TWO": {
    "city": "Tainan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Metal Fabrication",
    "long_name": "Univacco Technology Inc.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "UNIVACCO TECHNOLOGY INC",
    "state": null,
    "summary": "Univacco Technology Inc. manufactures and sells stamping foil products and optoelectronics materials worldwide. The company offers various decorative and functional foils, which include hot stamping, cold, holographic, and digital foils. The company also provides optoelectronics materials, including clean and PET protective films, diffuser, SMD cover tapes, medical films, and OEM for coating. The company provides its products for wine, beer, and spirits label and packaging; food, drink, and confectionery packaging; tobacco/cigarette packaging; greeting cards and printed media; artificial leather book covers; persona care; cosmetics and perfumes; pharmaceuticals; and clothing and textile applications. It markets its products under the UNIVACCO brand. The company was formerly known as Tai Leng Industry Co., Ltd and changed its name to Univacco Technology Inc. in 2002. Univacco Technology Inc. was founded in 1990 and is headquartered in Tainan City, Taiwan.",
    "website": "http://www.univacco.com",
    "zipcode": "72154"
  },
  "3376.TW": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Metal Fabrication",
    "long_name": "Shin Zu Shing Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "SHIN ZU SHING CO",
    "state": null,
    "summary": "Shin Zu Shing Co., Ltd. manufactures and sells precision springs, stamped parts, and hinge assemblies in Taiwan. It also provides metal injection molding (MIM) and lathe products. The company offers its products for use in notebook and tablet PCs, LCD monitors, and MIM products, as well as communication, computer, and consumer products. The company was formerly known as Zu Shing Spring and Mechanical Co., Ltd. and changed its name to Shin Zu Shing Co., Ltd. in 1997. Shin Zu Shing Co., Ltd. was founded in 1965 and is headquartered in New Taipei City, Taiwan.",
    "website": "http://www.szs.com.tw",
    "zipcode": "23863"
  },
  "3631.TWO": {
    "city": "Taoyuan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Metal Fabrication",
    "long_name": "Chernan Metal Industrial Corp.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "CHERNAN METAL INDUSTRIAL CO LTD",
    "state": null,
    "summary": "Chernan Metal Industrial Corp. manufactures and sells tin and tin wire products in Taiwan. It also offers solder paste and flux products; copper and nickel; and germanium. The company was formerly known as Tunghui Tin Industry. Chernan Metal Industrial Corp. was founded in 1984 and is headquartered in Taoyuan City, Taiwan.",
    "website": "http://www.chernan.com",
    "zipcode": "333"
  },
  "3663.TWO": {
    "city": "Kaohsiung",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Metal Fabrication",
    "long_name": "ThinTech Materials Technology Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "THINTECH MATERIALS TECHN CO LTD",
    "state": null,
    "summary": "ThinTech Materials Technology Co., Ltd. designs, manufactures, and sell alloys and optoelectronics materials in Taiwan, Mainland China, Japan, Europe, and the North America. Its products include sputtering targets for flat panel display planar, optical data storage, decorative and functional coating, passive component, optical element, and semi-conductive; and thin film targets for solar cell applications. It also offers flat panel display rotary sputtering targets; alloy metal powders for vacuum induction gas atomization; nickel alloy c-hook for coil wire pickling; sputtering target bonding services; precious metal refining and sales services; analytical services; and metal powder for 3D printing, as well as acid and alkali-resistance alloy, and titanium for cooking/tableware. The company was founded in 2000 and is based in Kaohsiung City, Taiwan.",
    "website": "http://www.e-ttmc.com.tw",
    "zipcode": "82151"
  },
  "4530.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Metal Fabrication",
    "long_name": "Honyi International Company Limited",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "HONYI INTERNATIONAL COMPANY LTD",
    "state": null,
    "summary": "Honyi International Company Limited manufactures and sells plastic injection molds. The company offers precision thermoplastic injection molds for use in various applications, including automotive, home appliances, computer, consumers, communication, electronics, etc. It also provides various enclosure manufacturing services, such as tooling fabrication, injection molding, sheet metal stamping, secondary post-molding process, and final assembly services in automotive, home appliance, and information tech. applications. Honyi International Company Limited was founded in 1984 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.honyigroup.com",
    "zipcode": "10457"
  },
  "4553.TWO": {
    "city": "Taichung",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Metal Fabrication",
    "long_name": "ALFOT Technologies Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "ALFOT",
    "state": null,
    "summary": "ALFOT Technologies Co., Ltd. designs, manufactures, and sells OEM aluminum forging products primarily in Taiwan. The company offers automotive aluminum forging parts, including brackets, control arms, suspension arms, pistons, etc. for use in suspension and cushion systems in car chassis, as well as in engine systems; and motorcycle aluminum forging parts, such as connectors, handgrips, driving arms, pistons, etc. that are used in the body structure of motorcycles, steering systems, and engine systems. It also provides other aluminum forging parts comprising storz, check handgrip, bundle, spray gun, etc. for use in fire-fighting equipment, industrial equipment, machinery industry, hand tool industry, and bicycle industry. ALFOT Technologies Co., Ltd. was founded in 1983 and is based in Taichung, Taiwan.",
    "website": "http://www.alfot.com",
    "zipcode": "40850"
  },
  "4561.TWO": {
    "city": "Changhua",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Metal Fabrication",
    "long_name": "Kenturn Nano. Tec. Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "KENTURN NANOTECH CO LTD",
    "state": null,
    "summary": "Kenturn Nano. Tec. Co., Ltd. designs, manufactures, fabricates, and markets machine tool spindles in Taiwan. It offers CNC machining center, tapping center, and direct and gear drive spindles; turning center spindles, which includes belt drive-horizontal and vertical spindles; and CNC internal and external spindles. The company also provides square, ball nose, and corner radius end mills; special cutting tools; and spindle repair service. Its products are used in aerospace, automotive, locomotive, biotechnology, woodworking machines, shipbuilding, medical equipment, electronic semiconductor manufacturing, and IT industries under the KENTURN brand name. The company also exports its products. Kenturn Nano. Tec. Co., Ltd. was founded in 1983 and is based in Changhua, Taiwan.",
    "website": "http://www.kenturn.com.tw",
    "zipcode": "507001"
  },
  "4912.TW": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Metal Fabrication",
    "long_name": "Lemtech Holdings Co., Limited",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "LEMTECH HOLDINGS CO LIMITED",
    "state": null,
    "summary": "Lemtech Holdings Co., Limited manufactures and sells precision metal dies and metal stampings in Asia, Americas, and Europe. The company provides electronic product thermal modules, electronic product components, automotive components and building material components made by stamping and forming, as well as stamping die support for automotive and electronic product manufacturers; and stamping tools, heatsinks and thermal modules, slide rails, precision metal hinges, and mechanical assemblies. It serves automotive, cloud computing, smartphone, medical device, and industrial, as well as computing, consumer, and communication markets. The company was founded in 2003 and is based in New Taipei City, Taiwan.",
    "website": "http://www.lemtech.com",
    "zipcode": "1106"
  },
  "5009.TWO": {
    "city": "Tainan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Metal Fabrication",
    "long_name": "Gloria Material Technology Corp.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "GLORIA MATERIAL TECHNOLOGY CORP",
    "state": null,
    "summary": "Gloria Material Technology Corp. manufactures and sells alloy steel and valve-parts in Taiwan and internationally. The company's products include super and titanium alloys; and high cleaning steel, alloy tool steel, high speed steel, stainless steel, quenched-tempered steel, and mold material supply products. It also provides machined parts, such as actuators, blocks, boss products, load caps, and actuator blanks; compressor spacers, seals for gas turbine, turbine blades, and transmission shafts; and copper rod rollers, dummy bar heads, guide rolls, sendzimir rolls, and rolls for slab continuous cast. In addition, the company offers air compressor rotors, bolts, couplings, cryogenic BV shafts, HPBV shafts, locking pins, parts for vacuum equipment, pump shafts, pipe fittings, plugs, turbo charger parts, wheel rings, stems, and taper pins. It serves aerospace, energy, oil and gas, water, medical, and machinery and mold industries. Gloria Material Technology Corp. was founded in 1988 and is headquartered in Tainan City, Taiwan.",
    "website": "http://www.gmtc.com.tw",
    "zipcode": "736"
  },
  "5460.TWO": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Metal Fabrication",
    "long_name": "Mustang Industrial Corp.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "MUSTANG INDUSTRIAL",
    "state": null,
    "summary": "Mustang Industrial Corp. manufactures and sells progressive die molds and stamping products in Taiwan. The company provides shielding frame and cover assemblies for tuners; metal stamped frames and covers for signal shielding; and large size metal stamping products, including cover and chassis of set top box and satellite receivers, as well as heat spreaders for IC/chipsets and drawn parts in various shapes. It also offers middle size stamping parts, such as metal frames, brackets, and plates for LCD panels; small size stamping parts comprising springs and contacting fingers for EMC solution; and high precision stamping parts, including micro punching/blanking technology to replace chemical etching, as well as terminals, jumpers, contact springs, etc. Mustang Industrial Corp. was founded in 1972 and is based in New Taipei City, Taiwan.",
    "website": "http://www.mustang-group.com",
    "zipcode": "242"
  },
  "6235.TW": {
    "city": "Taoyuan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Metal Fabrication",
    "long_name": "Waffer Technology Corporation",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "WAFFER TECHNOLOGY CORP",
    "state": null,
    "summary": "Waffer Technology Corporation manufactures and sells light metal products. The company primarily engages in the provision of light-metal solution of magnesium and aluminum alloy, mold and tooling research and development, magnesium alloy injection and die-casting, CNC, and painting and assembly of vertical integration OEM/ODM processing. Its products include cosmetic and internal parts for notebooks; handheld scanners and mobile phone parts; camera, video cam, projector, and monitoring optical parts; and auto parts, as well as other products, such as wearable, tool, and sports products. The company also manufactures and processes automotive aluminum alloy die-cast tools, 3C product magnesium injection tools, and other light metal die-casting tools, as well as fixtures and gauges. It serves medical, industrial, telecommunications, construction, automotive, sporting goods, aeronautical, transportation, national defense, and other industries. The company was formerly known as Waffer Industrial Company, Limited and changed its name to Waffer Technology Corporation in 2000. Waffer Technology Corporation was founded in 1950 and is headquartered in Taoyuan City, Taiwan.",
    "website": "http://www.waffer.com.tw",
    "zipcode": "324"
  }
}
