{
    "1201.TW": {
        "short_name": "WEI CHUAN FOOD CORP",
        "long_name": "Wei Chuan Foods Corporation",
        "summary": "Wei Chuan Foods Corporation engages in the food business in Taiwan and internationally. The company offers tinned food, soy sauce, MSG gourmet powder, seasonings, juice, tetra pak sterilized milk, soy milk, rice milk, cooler drinks, fermented milk, gel, and pudding products. It also engages in the amusement business. The company was founded in 1953 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei City"
    },
    "1215.TW": {
        "short_name": "CHAROEN POKPHAND ENTERPRISES CO",
        "long_name": "Charoen Pokphand Enterprise(Taiwan) Co., Ltd.",
        "summary": "Charoen Pokphand Enterprise(Taiwan) Co., Ltd. engages in the agriculture, animal husbandry, and food businesses in Taiwan and internationally. It produces and sells feed for chicken, pigs, and ducks, as well as fresh and frozen chicken, pork, and meat products; and cooked and other related consumable food products. The company also imports and sells animal medicine; and provides husbandry management services for chickens to produce eggs and meat. In addition, it offers agricultural livestock products. The company was formerly known as Taiwan Pokphand Feed Co., Ltd. and changed its name to Charoen Pokphand Enterprise(Taiwan) Co., Ltd. in 1988. The company was founded in 1921 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "1216.TW": {
        "short_name": "UNI-PRESIDENT ENTERPRISES CORP",
        "long_name": "Uni-President Enterprises Corp.",
        "summary": "Uni-President Enterprises Corp. manufactures, processes, and sells soft drinks, foods, animal feeds, and flour in Taiwan, China, and internationally. The company provides edible oils, instant noodles, dairy products, tea beverages, coffee drinks, baking products, ice cream products, frozen prepared foods, meat products, healthy food products, sauce and seasoning, flour, animal and aquatic feeds, soft drinks, rice, juices, bottled water, dessert, and vegetables. It also offers tinplate and cans, PET bottles, containers, and glass products for packaging; information services; cosmetics; elevators; and cleaning instruments, as well as researches, manufactures, distributes, and sells, pharmaceutical products. In addition, the company engages in construction of buildings; wholesale and retail of food; advertising activities; management of professional baseball team; entertainment business; operation of shopping malls, department stores, international trades, etc.; construction, development, and operation of an MRT stations; car rental activities; tourist agency business; and manufacture of chemical materials, instruments, etc. Further, it is involved in sales and leasing of real estate properties; enterprise management consultancy business; delivery of magazines, etc.; personal and property insurance activities; arts and culture activities; operation of gymnasiums and spas, fast food and coffee chain restaurants, and electronic tickets and electronic related business; wholesale of medicines and medical appliances; and professional investment activities. Additionally, the company operates gas stations, retail channels and distribution centers, book stores, etc., as well as acts as a collection agent for government institutions. Uni-President Enterprises Corp. was founded in 1967 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Tainan City"
    },
    "1218.TW": {
        "short_name": "TAISUN ENTERPRISE CO. LTD.",
        "long_name": "Taisun Enterprise Co., Ltd.",
        "summary": "Taisun Enterprise Co., Ltd. operates in the food and beverage industry in Taiwan. It offers oil and soybean powder products, including selected soybeans, soybean powder, high protein soybean powder, salad oil, cooking oil series, flavoring oil series, sunflower seed oil series, olive oil, healthy good oil, HSF oil series, health food sunflower seed oil, and other blended oils. The company also provides Mesona tea, honey herbal jelly, mixed congee, other congee sweets, iced tea, guava green tea, and bottled water; and aqua feeds for milkfish, tilapia, ayu, bass, grouper, etc. The company offers its products under Cha Chi Chu, Bing Jeon, Taisun Pure Water, TAISUN Cheers, Twist Water, Taisun Fruit Water, Pure Water, Taisun Grass Jelly, Taisun Mesona Tea, Taisun Mixed Congee, Taisun Peanuts Soup, Taisun Other Dessert, Healthy Dessert, Big Straw, Taisun Cooking Oil, ChefOil, Taisun Omega 369 Blended Oil, Cha Street, BUFF, Customized Purpose Good Oil, Commercial Purpose Salad oil, and Commercial Purpose Bulk Vegetable Oil Brands. It also engages in the rental and construction activities. Taisun Enterprise Co., Ltd. was founded in 1950 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei City"
    },
    "1219.TW": {
        "short_name": "FWUSOW INDUSTRY CO LTD",
        "long_name": "Fwusow Industry Co., Ltd.",
        "summary": "Fwusow Industry Co., Ltd. manufactures and markets feeds, pet food products, cooking oils, and organic fertilizers in Taiwan. It offers canola, soybean, sunflower, and sesame oils; bonito products; and cereals. The company also provides dog and cat foods; and aquarium fish, Koi, bird, experimental animal, duck, pig, poultry, and other feeds. In addition, it offers organic, biotech, instant water soluble, liquid, and gardening fertilizers, as well as organic compound compost products and substrates. Further, the company engages in eco and contract farming activities. Fwusow Industry Co., Ltd. was founded in 1920 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "1225.TW": {
        "short_name": "FORMOSA OILSEED PROCESSING",
        "long_name": "Formosa Oilseed Processing Co., Ltd.",
        "summary": "Formosa Oilseed Processing Co., Ltd. produces and sells oil and feed products in Taiwan. It offers soybean and palm oil; soybean meat; and feed products, such as soybean, corn, wheat, and barley. The company was founded in 1988 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "1229.TW": {
        "short_name": "LIEN HWA INDUSTRIAL HOLDINGS CO",
        "long_name": "Lien Hwa Industrial Holdings Corporation",
        "summary": "Lien Hwa Industrial Holdings Corporation manufactures and sells flour and flour-based products in China, Taiwan, and internationally. It operates through 5 segments: Rental Business, Noodle Business, Noodle Business Overseas, Administrative Resource Center, and System Integration Service business. The company offers flour, wheat bran, wheat bran grain, wheat germ, wheat flour, gluten flour, patent flour, and durum flour for making bread, pastries, cookies, cakes, Chinese steamed buns, noodles, baozi, and many other flour-based foods, as well as wheat flavor flour, organic whole wheat flour, rice flour, and baking germs; prepared mixes, such as pancake mixes, DIY pizza flour, and other baking flour; and pasta. It also provides various integrated systems and outsourcing services to government agencies, educational units, financial institutions, and public/private enterprises; and acts as an agency to sell the cloud platforms and customer relationship software. In addition, it engages in the integration of computer, microprocessor, I/O equipment, and IC cards; transportation control and card; and RFID technology of the tag, antenna, reader gateway, and system integration for library and factory automation. Further, the company sells and rents land and houses; and manages and develops the real estate. Additionally, it is involved in the wholesaling and retailing business, restaurant business, and investment activities; provision of business management and information consulting services; sale, rental, and maintenance of telephone switching systems and data communication products; communication system project contracting; software research and development; software design; and technology development, promotion, transfer, consulting, and servicing. The company sells its products through distributors and chained stores. Lien Hwa Industrial Holdings Corporation was founded in 1951 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "1232.TW": {
        "short_name": "TTET UNION CORP",
        "long_name": "TTET Union Corporation",
        "summary": "TTET Union Corporation operates as a soybean crusher in Taiwan. The company engages in the manufacture, sale, processing, and import and export of a range of vegetable oils. It offers soybean, canola, palm olein, deep frying, and sunflower oils; and dehulled high-protein, dehulled full fat, regular, and full fat soybean meals, as well as soybean hull pellets and high-protein soybean flakes. The company also provides selected soybeans and deodorized distillates. In addition, it is involved in the cogeneration plant business; and wholesale and retail of oils, etc. The company also has operations in Japan, Korea, and internationally. TTET Union Corporation was founded in 1982 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Tainan City"
    },
    "1702.TW": {
        "short_name": "NAMCHOW HOLDINGS CO LTD",
        "long_name": "Namchow Holdings Co., Ltd.",
        "summary": "Namchow Holdings Co., Ltd. engages in manufacturing, selling, and processing of edible and non-edible oil, frozen dough, and dish and laundry liquid detergent products in Taiwan, China, Thailand, and internationally. The company manufactures and sales cleaners, including crystal soap, personal hygiene, and dish/vegetable cleaning products; frozen and instant noodles; ice creams; and cooked rice and leisure foods, such as rice crackers. It is also involved in manufacturing and distribution of baking products, including baking oils, fats, and frozen doughs; and the dining business. In addition, it offers management consulting services. The company was formerly known as Namchow Chemical Industrial Co., Ltd. and changed its name to Namchow Holdings Co., Ltd. in August 2017. Namchow Holdings Co., Ltd. was founded in 1952 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    }
}