{
    "1323.TW": {
        "short_name": "YONYU PLASTICS",
        "long_name": "Yonyu Plastics Co., Ltd.",
        "summary": "Yonyu Plastics Co., Ltd. manufactures and sells plastic packaging products worldwide. The company offers home and personal cleaning, pharmaceutical, and green packaging products, as well as cosmetic package materials; and other products comprising cable accessories and other injection/extrusion products. It also provides color matching and master batch compounding, mold design and fabrication, plastic molding, cosmetic ingredient developing and filling, product design, assembly, computer-aided raw color recipe design, injection, blow molding, and tube manufacturing services; and various decoration services, such as printing, hot stamping, labeling, metallization, UV coating, and automated assembly services. Yonyu Plastics Co., Ltd. was founded in 1964 and is based in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Tainan City"
    },
    "1909.TW": {
        "short_name": "LONGCHEN PAPER&PACKAGING CO LTD",
        "long_name": "Longchen Paper & Packaging Co., Ltd.",
        "summary": "Longchen Paper & Packaging Co., Ltd. engages in the manufacturing, processing and trading of paper raw materials in Taiwan and Mainland China. The company operates through Containerboard, Corrugated Container, Waste Paper, Paper Distribution, and Others segments. It manufactures, processes, and sells paper, paperboard, paper products, novel packaging materials, cartons and paper boxes, package printed, and cogeneration products. The company also manufactures, prints, processes, and trades in corrugated containers; manufactures and sells paper machines; procures and sells waste paper; distributes paper products; and trades in bulk materials. In addition, it engages in the recycling/renewal of energy and resources, including turnkey design, trial-run, and operation of cogeneration and incinerator systems; warehousing; and public waste water treatment activities. Further, the company is involved general investment; wholesale, import, and export of packaging materials, paper products, electronic products, and hardware; provision of consulting services, market information, and investment strategies for investors; and sewage treatment. Additionally, it offers prints for packaging and decoration, and color-printed paper cartons; and manufactures and sells cartons, pearl wool and foam, etc. The company was formerly known as Long Chen Paper Co., Ltd. and changed its name to Longchen Paper & Packaging Co., Ltd. in June 2019. Longchen Paper & Packaging Co., Ltd. was founded in 1978 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "3607.TW": {
        "short_name": "COXON PRECISE INDUSTRIAL CO. LT",
        "long_name": "Coxon Precise Industrial Co., Ltd.",
        "summary": "Coxon Precise Industrial Co., Ltd. manufactures and sells engineering plastic products in Taiwan and internationally. It is involved in the designing, mold manufacturing, injection molding, coating and printing, assembling, and optical lens processing activities. The company was founded in 1989 and is based in Zhongli, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Zhongli"
    },
    "9939.TW": {
        "short_name": "TAIWAN HON CHUAN ENTERPRISE",
        "long_name": "Taiwan Hon Chuan Enterprise Co., Ltd.",
        "summary": "Taiwan Hon Chuan Enterprise Co., Ltd. manufactures and sells beverage packaging materials for beverage manufacturers in Taiwan and internationally. The company offers aluminum, plastic, and metal lug caps; PET bottles/perform products, label products, and tobacco and liquor packaging products; caps, bottles, and labelling production equipment; and LDPE shrinkable films. It also provides hot fill beverage, aseptic beverage, and bottled water filling OEM services. The company was formerly known as Hon Chuan Metal Development Co., Ltd. and changed its name to Taiwan Hon Chuan Enterprise Co., Ltd. in 1999. Taiwan Hon Chuan Enterprise Co., Ltd. was founded in 1969 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    }
}