{
  "1438.TW": {
    "city": "Kaohsiung",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Real Estate - Diversified",
    "long_name": "SanDi Properties Co.,Ltd.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "SANDI PROPERTIES CO LTD",
    "state": null,
    "summary": "SanDi Properties Co.,Ltd. engages in the construction of commercial and industrial buildings. It also engages in residential rental and sale, real estate trading, and distribution of other department stores businesses. The company was formerly known as Yu Foong International Corporation. SanDi Properties Co.,Ltd. was founded in 1949 and is based in Kaohsiung, Taiwan.",
    "website": "http://www.sandirealestate.com.tw",
    "zipcode": "802"
  },
  "2520.TW": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Real Estate - Diversified",
    "long_name": "Kindom Development Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "KINDOM DEVELOPMENT CO LTD",
    "state": null,
    "summary": "Kindom Development Co., Ltd. engages in the real estate development business. The company develops residential properties; leases and sells commercial buildings; undertakes construction projects, such as corporate headquarters, civil workshops, medical buildings and residential buildings, as well as civil projects, including land preparation and rezoning, roads and bridges; and operates department stores and supermarkets. It also engages in the installation and engineering of electrical and fire safety equipment; and investment and operation of shopping malls, as well as non-store retailing business. In addition, the company offers business management and consulting; corporate marketing planning; conference; exhibition; parking lot operation and management services. Further, it is involved in the general investment activities. Kindom Development Co., Ltd. was founded in 1979 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.kindom.com.tw",
    "zipcode": "106"
  },
  "2545.TW": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Real Estate - Diversified",
    "long_name": "Huang Hsiang Construction Corporation",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "HUANG HSIANG CONSTRUCTION",
    "state": null,
    "summary": "Huang Hsiang Construction Corporation builds, sells, and rents public housing and commercial building in Taiwan. The company's product portfolio includes home, shops, offices, shopping malls, and parking spaces. It also imports/exports and sells building materials. The company was formerly known as Huang Ming Construction Corporation, LCC and changed its name to Huang Hsiang Construction Corporation in April 1996. Huang Hsiang Construction Corporation was founded in 1991 and is based in Taipei, Taiwan.",
    "website": "http://www.hhe.com.tw",
    "zipcode": "100"
  },
  "2547.TW": {
    "city": "Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Real Estate - Diversified",
    "long_name": "Radium Life Technology Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "RADIUM LIFE TECH CO",
    "state": null,
    "summary": "Radium Life Technology Co., Ltd. develops real estate projects in Taiwan. It develops and operates T9 BOT project, which consists of a bus terminal, four residential buildings, two office towers, a shopping center, a hotel, and a movie theatre; MEHAS project covering an area of 22,000 square meters; BOND 18 project; and E.A.T project. The company also engages in retail, luxury hotel, bus terminal management, property management, biotech and skin care, sewage treatment, renewable energy, property leasing, and elderly care businesses. Radium Life Technology Co., Ltd. was founded in 1980 and is based in Taipei City, Taiwan.",
    "website": "http://www.radium.com.tw",
    "zipcode": "103"
  },
  "5531.TW": {
    "city": "Taichung",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Real Estate - Diversified",
    "long_name": "Shining Building Business Co.,Ltd.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "SHINING BUILDING BUSINESS CO LT",
    "state": null,
    "summary": "Shining Building Business Co., Ltd. engages in the subcontract construction, leasing, and sale of commercial buildings and residential buildings in Taiwan. It also offers hotel management services. The company was founded in 1980 and is based in Taichung, Taiwan.",
    "website": "http://www.shininggroup.com.tw",
    "zipcode": null
  }
}
