{
    "2511.TW": {
        "short_name": "PRINCE HOUSING DEVELOPMENT CORP",
        "long_name": "Prince Housing & Development Corp.",
        "summary": "Prince Housing & Development Corp. engages in the construction business primarily in Taiwan. The company constructs, leases, and sells public housings, commercial buildings, and parking lots/parking towers, as well as tourism/recreation places, such as children's playgrounds, water parks, etc. It is also involved in the hotels and catering, plywood manufacturing, real estate management, real estate trading and leasing, apartment management, security, electricity and water pipe maintenance, and general investment activities, as well as offers integrate security and guard services. The company was founded in 1973 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "110",
        "website": "http://www.prince.com.tw",
        "market_cap": 19228639232
    },
    "2539.TW": {
        "short_name": "SAKURA DEVELOPMENT CO",
        "long_name": "Sakura Development Co.,Ltd",
        "summary": "Sakura Development Co.,Ltd engages in the sale and lease of residential properties with focus on the Zhongzhangtou area in Taiwan. The company was founded in 1976 and is based in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": null,
        "website": "http://www.sakurad.com.tw",
        "market_cap": 17648062464
    },
    "2542.TW": {
        "short_name": "HIGHWEALTH CONSTRUCTION CORP",
        "long_name": "Highwealth Construction Corp.",
        "summary": "Highwealth Construction Corp. engages in the construction of commercial buildings in Taiwan. The company operates through four segments: Developing, Constructing, Department Store, and Ecotechnology. The Developing segment develops new constructing or lease opportunities. The Constructing segment is involved in constructing buildings. The Department Store segment manages various shops within the store, supermarkets, and international import and export trade. The Ecotechnology segment provides services for clearing waste. Its apartment buildings include apartments, suites, and parking spaces; and office buildings comprise offices, storefronts, parking lots, and suites. The company is also involved in the construction, lease, and sale of residential and commercial buildings. In addition, it provides real estate broker agent and real estate commerce services; construction material wholesale services; and investment services. The company was founded in 1980 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10462",
        "website": "http://www.highwealth.com.tw",
        "market_cap": 54578417664
    },
    "2548.TW": {
        "short_name": "HUAKU DEVELOPMENT CO. LTD.",
        "long_name": "Huaku Development Co., Ltd.",
        "summary": "Huaku Development Co., Ltd. constructs, leases, and sells public housings and commercial buildings in Taiwan and China. The company also engages in the leasing and sale of general-purpose plants and warehouses; and contracting of civil and hydraulic engineering projects. The company was formerly known as Huaku Construction Co., Ltd. Huaku Development Co., Ltd. was founded in 1989 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.huaku.com.tw",
        "market_cap": 25782755328
    },
    "3056.TW": {
        "short_name": "ZONGTAI REAL ESTATE DEVELOPMENT",
        "long_name": "ZongTai Real Estate Development Co., Ltd.",
        "summary": "ZongTai Real Estate Development Co., Ltd. engages in the real estate development business in Taiwan. It is involved in the development of building, leisure, energy, government, and other projects. The company is based in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung City",
        "zipcode": null,
        "website": "http://www.zongtai.com.tw",
        "market_cap": 8141303296
    },
    "5206.TWO": {
        "short_name": "KUNYUE DEVELOPMENT CO. LTD.",
        "long_name": "Kunyue Development Co., Ltd.",
        "summary": "Kunyue Development Co., Ltd. provides real estate development and maintenance services. The company is involved in the land development, building construction, residential development, home sales, and customer service activities. It also offers structural, hydropower, waterproof, and intimate engineering services. The company was founded in 1975 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "407",
        "website": "http://www.kunyue.com.tw",
        "market_cap": 2744279808
    },
    "5522.TW": {
        "short_name": "FARGLORY LAND DEVELOPMENT CO. L",
        "long_name": "Farglory Land Development Co., Ltd.",
        "summary": "Farglory Land Development Co., Ltd. operates as a construction company in Taiwan. The company builds residential buildings and commercial buildings for sale and investment; undertakes public construction projects; and develops professional areas. The company was formerly known as Metropolitan Construction Co., Ltd. and changed its name to Farglory Land Development Co., Ltd. in December 2005. Farglory Land Development Co., Ltd. was founded in 1969 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.farglory-land.com.tw",
        "market_cap": 45098090496
    },
    "6171.TWO": {
        "short_name": "TAIWAN ARIES CO LTD",
        "long_name": "Taiwan Aries Co.,Ltd.",
        "summary": "Taiwan Aries Co.,Ltd. manufactures, processes, and trades in various electronic parts in Taiwan. It is also involved in residential and building development, rental, and sales; building materials wholesale and retail, landscape and interior design, import and export trading, real estate trading and leasing, and other businesses. The company was founded in 1984 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "407",
        "website": "http://www.aries-net.com.tw",
        "market_cap": 2000595584
    },
    "6186.TWO": {
        "short_name": "SHIN RUENN DEVELOPMENT CO LTD",
        "long_name": "Shin Ruenn development Co., LTD",
        "summary": "Shin Ruenn development Co., LTD. engages in the development and rental of housing and buildings. It is also involved in the sale, leasing, and purchase of real estate properties. The company was formerly known as Jinglay, Inc. and changed its name to Shin Ruenn development Co., LTD. in July 2011. Shin Ruenn development Co., LTD. was founded in 1998 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "105",
        "website": "http://www.shinruenn.com",
        "market_cap": 3744979200
    }
}