{
    "2360.TW": {
        "short_name": "CHROMA ATE INC",
        "long_name": "Chroma ATE Inc.",
        "summary": "Chroma ATE Inc. designs, assembles, calibrates, manufactures, sells, repairs, and maintains software/hardware for computers and peripherals, computerized automatic test systems, electronic test instruments, signal generators, power supplies, and telecom power supplies under the Chroma brand worldwide. The company provides video and color test solutions; flat panel display test solutions; electrical safety testing solutions; and LED/lighting and driver test solutions. It also offers photovoltaic/inverter test and automation solutions; automated optical inspection solutions; power electronics test solutions; battery test and automation solutions; passive component, electric vehicle, and semiconductor/IC test solutions; PXI test and measurement solutions; and intelligent manufacturing system solutions. In addition, the company provides photonics, and RF and wireless test solutions, as well as turnkey test and automation solutions. Further, it offers warranty, calibration and repair, instrument and test system calibration and repair, customer-site installation, product upgrade, training, technical support, and product support services, as well as replacement parts. The company's products are used in information technology, communication, aerospace, defense, and other industries. Chroma ATE Inc. was founded in 1984 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "3059.TW": {
        "short_name": "ALTEK CORP",
        "long_name": "Altek Corporation",
        "summary": "Altek Corporation engages in the development, manufacture, and sale of digital image technology application products. The company provides AI cameras and edge boxes, and PI cameras for home, banking and finance, hotel, retail, and industrial applications; imaging chips for image quality enhancement, face detection, etc.; and 3D sensing modules and solutions for robots, augmented reality/virtual reality devices, surveillance devices, and face payment systems. It offers automobile camera systems, including image assistance system/ mega pixel HD camera, IR camera, AVM, and ADAS for driver monitoring system; and medical imaging solutions, such as glucose meter, intelligent insulin delivery system, and disposable endoscope camera system. In addition, the company offers optical components; manufactures and sells digital still cameras and its accessories; research, development, manufacture, and sale of medical electronic equipment; wholesale, import, and export of digital cameras, digital video cameras, and related accessories; and research, design, and sales of imaging technologies, and electronic software and hardware. It operates in Asia, Europe, the United States, and Taiwan. The company was formerly known as Asia Imagination Corporation and changed its name to Altek Corporation in February 1997. Altek Corporation was founded in 1996 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    }
}