{
    "2390.TW": {
        "short_name": "EVERSPRING INDUSTRY",
        "long_name": "Everspring Industry Co., Ltd.",
        "summary": "Everspring Industry Co., Ltd. produces and sells burglar alarms, surveillance devices, home automation appliances, and LED and security lightings worldwide. The company offers smart home systems and alarm kits; and household control panel, a digital smart panel that utilizes a power line and single network cable to combine various household facilities, including access control, intercom, security, and scene control, as well as value-added services. It also provides household intercom, a touch screen for video communication and digital message transmission, as well as security services. Everspring Industry Co., Ltd. was founded in 1980 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23666",
        "website": "http://www.everspring.com",
        "market_cap": "Mid Cap"
    },
    "3356.TW": {
        "short_name": "GEOVISION INC",
        "long_name": "GeoVision Inc.",
        "summary": "GeoVision Inc., together with its subsidiaries, operates as a digital and networked video surveillance company worldwide. It offers IP cameras; and surveillance systems, including VMS, NVR, mini, Linux-based standalone, recording server, mobile, storage, control center systems, as well as accessories, such as remote controls, joysticks, keyboards, and touch displays. The company also provides video management software; access control products, which include software, IP control panels and kits, controllers, readers, and accessories; license plate recognition products, such as IP LPR, DSP LPR, and analog LPR cameras, as well as vehicle management software; decoder boxes and HD video encoders; digital signage products, such as signage players and slim-bezel signage displays; PoE switches, extenders, adapters, and accessories, as well as gigabit PoE switches; and capture cards and IO products. In addition, it offers technical support, specs consultation, RMA, and logistics services. The company provides its products for various fields of industries, such as retail, commercial, government, transportation, hospitals, gaming, and residence through distributors, system integrators, and installers. GeoVision Inc. was founded in 1998 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.geovision.com.tw",
        "market_cap": "Mid Cap"
    },
    "3454.TW": {
        "short_name": "VIVOTEK INC",
        "long_name": "Vivotek Inc.",
        "summary": "Vivotek Inc. provides security surveillance solutions worldwide. The company develops IP surveillance solutions that comprise network cameras, video servers and receivers, network video recorders, video management software, application software, and power over Ethernet switches, as well as offers cloud services. It also provides accessories comprising mounting kits, enclosures, covers, lens, power supply and box products, cables, joysticks, cabinets, cabinet accessories, storage products, water tanks, illuminators, and connectors. The company sells its products and services through distributors. Vivotek Inc. was founded in 2000 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23553",
        "website": "http://www.vivotek.com",
        "market_cap": "Mid Cap"
    },
    "5484.TW": {
        "short_name": "EVER FOCUS ELECTRONICS",
        "long_name": "EverFocus Electronics Corporation",
        "summary": "EverFocus Electronics Corporation engages in the research and development, manufacture, marketing, and service of CCTV surveillance systems, CCD cameras, and digital image processing equipment worldwide. The company offers Edge Computer, a smart surveillance system that provide real-time surveillance footage and access to traffic and road conditions; and multiple interface camera for industrial computers, including USB, RJ-45, etc. It also offers server systems; mobile app and management software that cover transportation, education, surveillance, retail, and medical health care; vehicle surveillance products; and accessories. The company was founded in 1995 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "222",
        "website": "http://www.everfocus.com.tw",
        "market_cap": "Small Cap"
    },
    "6419.TWO": {
        "short_name": "NUUO INC",
        "long_name": "NUUO Inc.",
        "summary": "NUUO Inc. provides surveillance solutions for recording, monitoring, and third party solution integration for IP and analog cameras in Taiwan and internationally. Its NUUO Crystal Family solutions, such as NUUO NuStation, a Linux enterprise solution; NUUO Titan Pro, a Linux-based VMS solution; NUUO Network Storage solution for surveillance applications; and NUUO Crystal, a VMS solution. The company's NUUO Mainconsole Family solutions include NUUO central management system to manage large scale installations and alarms; NUUO Mainconsole, a NUUO PC based video recording server; NUUO Hybrid Appliance solution to choose a pure DVR, pure NVR, or a hybrid system; NUUO NVRmini 2 and NUUO NVRmini 3 portable NVR solutions; NUUO intelligent video surveillance solution; NUUO IP Appliance solution that provides integration between older and newer types of cameras; NUUO Report Service, which visualizes the people counting data into various graphic types; NUUO NVRSolo_Plus, a Linux embedded standalone solution; and NUUO IVS, a video analytics solution. It also offers NUUO Point of Sale (POS) solution that connects surveillance video with transaction data from POS and ATM; NUUO Facial recognition solution that connects surveillance videos with NUUO Nuface software; NUUO license plate recognition (LPR) solution, which connects surveillance videos with third party LPR solutions; and NUUO Access Control solution that connects surveillance video with access control systems from third party partners. In addition, the company offers NUUO iViewer solution to remotely monitor live video from security cameras; NUUO software development kit; NUUO Temperature Monitoring Panel; NUUO thermal detection solution; IP cameras; VZIII, a retail analytics system; and accessories. It serves retail, transportation, industrial, educational, banking, hospitality, and home markets, as well as government. NUUO Inc. was founded in 2004 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "235",
        "website": "http://www.nuuo.com",
        "market_cap": "Small Cap"
    },
    "6556.TWO": {
        "short_name": "TOPVIEW OPTRONICS CORPORATION",
        "long_name": "Topview Optronics Corporation",
        "summary": "Topview Optronics Corporation designs, produces, markets, and sells surveillance cameras and peripherals worldwide. The company offers various IP cameras, as well as accessories, including pendant mount and wall mount brackets, corner mount and pole mount adaptors, parapet wall mounts, pendant and wall mount with junction boxes, and sun shields. It also provides after sales services. The company was founded in 1994 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33068",
        "website": "http://www.topviewcorp.com",
        "market_cap": "Small Cap"
    },
    "7402.TWO": {
        "short_name": "BRINNO INC",
        "long_name": "Brinno Incorporated",
        "summary": "Brinno Incorporated designs, develops, produces, and sells imaging devices. The company offers time lapse, construction, and outdoor security cameras; camera kits; and smart home security products, as well as time lapse accessories. It also provides contact tracing COVID-19 products; and Friday home smart locks. The company offers its products through distributors worldwide. Brinno Incorporated was founded in 2003 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11493",
        "website": "http://www.brinno.com",
        "market_cap": "Small Cap"
    },
    "8281.TWO": {
        "short_name": "Appro",
        "long_name": "Appro Technology Inc.",
        "summary": "Appro Technology Inc. engages in the design and development of a range of security and surveillance systems in Taiwan. The company offers cloud IP cameras, including Wi-Fi and IP cameras; professional IP cameras, such as box IP, fixed-dome, speed dome, bullet, and fisheye IP cameras; video servers; network video recorders; and accessories, such as racks and mounts. It also provides software solutions comprising AppPro APP and Central Management System 1030. The company was founded in 1993 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.approtech.com",
        "market_cap": "Small Cap"
    },
    "9917.TW": {
        "short_name": "TAIWAN SECOM CO",
        "long_name": "Taiwan Secom Co., Ltd.",
        "summary": "Taiwan Secom Co., Ltd. provides security services in Taiwan. It operates through four segments: Electronic System, Static Guard Service, Cash Delivery Service, and Logistics Service. The company manufactures, processes, and sells security-related equipment and parts, as well as offers corporate and building security guarding services; in-flight catering and related services; and cash delivery, logistic, air cargo transporting, building management, automated teller machine, custom broker, vehicle maintenance, educational and recreational, car parking lot, light controlling system, and technology support services. It also sells electric, telecommunication, fireproof, and other products; produces and sells instant foods; connects police-citizens; retails POS system; and rents automated external defibrillators and mini-storage, as well as rents and sells videos. In addition, the company manufactures and sells digital signage and monitors; wholesales and installs fire safety equipment; and retails and rents medical equipment. Further, it is involved in the provision of international trade, as well as acts as an insurance broker. The company was founded in 1977 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.secom.com.tw",
        "market_cap": "Large Cap"
    }
}