{
    "1813.TWO": {
        "short_name": "POLYLITE TAIWAN CO. LTD.",
        "long_name": "Polylite Taiwan Co., Ltd.",
        "summary": "Polylite Taiwan Co., Ltd. manufactures and distributes GIA polycarbonate lenses worldwide. Its products include FSV, SFSV, progressive, KID, and polarized lens. The company also offers dispending, fitting, and edging and finishing services. Polylite Taiwan Co., Ltd. was founded in 1993 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33759",
        "website": "http://www.gialens.com.tw",
        "market_cap": 874406272
    },
    "2303.TW": {
        "short_name": "UNITED MICRO ELECTRONICS",
        "long_name": "United Microelectronics Corporation",
        "summary": "United Microelectronics Corporation operates as a semiconductor wafer foundry in Taiwan, Singapore, China, Hong Kong, Japan, the United States, Europe, and internationally. The company operates through Wafer Fabrication and New Business segments. It provides circuit design, mask tooling, wafer fabrication, and assembly and testing services. The company also researches, develops, and manufactures products in the solar energy and LED industries. It serves fabless design companies and integrated device manufacturers. United Microelectronics Corporation was incorporated in 1980 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30078",
        "website": "http://www.umc.com",
        "market_cap": 634346078208
    },
    "2337.TW": {
        "short_name": "MACRONIX INTERNATIONAL",
        "long_name": "Macronix International Co., Ltd.",
        "summary": "Macronix International Co., Ltd., an investment holding company, engages in the design, manufacture, and supply of integrated circuits and memory chips in Taiwan, China, and internationally. The company provides a range of NOR flash, NAND flash, and ROM products. It also offers wafer foundry services to IC design and IDM companies. In addition, the company is involved in the development of integrated circuit system and software; and provision of after-sales services, as well as Combi-SIM IC and related services. It serves the consumer, communication, computing, automotive, networking, and other segment markets. Macronix International Co., Ltd. was founded in 1989 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": null,
        "website": "http://www.macronix.com",
        "market_cap": 81678827520
    },
    "2342.TW": {
        "short_name": "MOSEL VITELIC INC",
        "long_name": "Mosel Vitelic Inc.",
        "summary": "Mosel Vitelic Inc. manufactures and sells power semiconductor components and power management ICs in Taiwan. It primarily offers trench power metal oxide semiconductor field effect transistors, trench insulated gate bipolar transistors, analog ICs, and diodes that are used in computers, LCD screens and televisions, mobile phone batteries, machine tools, LED lighting, power supplies, and automotive electronics. The company was founded in 1987 and is based in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.mosel.com.tw",
        "market_cap": 5161252864
    },
    "2344.TW": {
        "short_name": "WINBOND ELECTRONIC CORP",
        "long_name": "Winbond Electronics Corporation",
        "summary": "Winbond Electronics Corporation, together with its subsidiaries, designs, develops, manufactures, and markets very large scale integration integrated circuits (ICs) for various microelectronic applications in Asia, the United States, Europe, and internationally. It operates through DRAM IC Product, Flash Memory product, and Logic IC Product segments. The company offers mobile dynamic random access memory (DRAM) devices, including pseudo static random access memory (SRAM), low power double-data-rate (DDR) synchronous dynamic random access memory (SDRAM), low power SDR SDRAM, and known good die (KGD) products, as well as low power DDR1, DD2, DDR3, and DD4/4X SDRAM products. It also provides specialty DRAM products, such as SDRAM, DDR SDRAM, DDR2 SDRAM, DDR3 SDRAM, and KGD products; code storage flash memory products comprising serial NOR, SPI and SLC NAND, and TrustME secure flash memory products, as well as parallel flash, serial flash, authentication flash, and KGD products; and logic IC products. The company's products are used in computing, communication, and consumer electronics; automotive and industrial electronics, and medical electronics; wearable devices; cell phones, tablets, low power mobile handheld devices, and Internet of things; and personal computers and their peripherals, mobile handheld devices and their peripheral modules, network communications products, and household appliance modules, etc. It markets its products through distributors and online. Further, it is involved in the research, development, design, sale, and after-sales service of semiconductors and 6 inch wafer products; electronic commerce and product marketing; provision of test, OEM, repair, software consultation, and computer software services; and wholesale business for computer, supplements, and software, as well as project sale. The company was founded in 1987 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "42881",
        "website": "http://www.winbond.com",
        "market_cap": 112435003392
    },
    "2379.TW": {
        "short_name": "REALTEK SEMICONDUCTOR CORP",
        "long_name": "Realtek Semiconductor Corp.",
        "summary": "Realtek Semiconductor Corp., together with its subsidiaries, engages in the research, development, production, and sale of various integrated circuits in Taiwan and internationally. The company provides communications network ICs, including broadband access controllers, gateway and network interface controllers, digital home centers, PHYceivers, switch controllers, wireless LAN ICs, and DTV demodulators, as well as Bluetooth, GNSS, and Internet of Things products. It also offers computer peripheral ICs, such as PC audio codecs, consumer audio codecs, card reader solutions, class-D audio amplifiers, PC camera controllers, and USB hubs; and multimedia ICs. The company was founded in 1987 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.realtek.com",
        "market_cap": 261980897280
    },
    "2393.TW": {
        "short_name": "EVERLIGHT ELECTRONICS CO",
        "long_name": "Everlight Electronics Co., Ltd.",
        "summary": "Everlight Electronics Co., Ltd. manufactures and markets optoelectronics components in Taiwan and internationally. The company's products include lighting components, such as visible and infrared LEDs; sensing components comprising photodides, optical ICs, and light sensing components; and LED light source, modules, and light engines. It offers visible LEDs, such as lighting, horticulture lighting, UV, flash, automotive, lamp, SMD, digital displays, and backlight LEDs; infrared LEDs comprising infrared LED and silicon detectors, infrared receiver modules, optic fiber devices, and optical switches; sensors, such as ambient light, proximity, and color sensors; and photo couplers, including photo transistors and darlington, schmitt triggers, high speed products, triac drivers, solid state relays, and IGBT gate drivers. The company's products are used for general, growth, and agriculture lighting, as well as UV appliance and module applications; automotive interior and exterior applications; home and others appliance, wearable and smart devices, gaming computer related, multimedia, e-cigarette, surveillance, and signage applications; and vehicle charging station, motor drive, bus interface, elevator control, power and gas meter, water meter, and medical equipment applications. Everlight Electronics Co., Ltd. was founded in 1983 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23860",
        "website": "http://www.everlight.com",
        "market_cap": 21460221952
    },
    "2401.TW": {
        "short_name": "SUNPLUS TECHNOLOGY",
        "long_name": "Sunplus Technology Company Limited",
        "summary": "Sunplus Technology Company Limited, together with its subsidiaries, researches, develops, designs, tests, and sells consumer integrated circuits (ICs) for multimedia audio/video, single-chip microcontrollers, and digital signal processors primarily in the Asia, Taiwan, and internationally. The company provides media player ICs for DVD player and portable DVD player; audio ICs for karoke, soundbar, and boom box, as well as party and DJ speaker; automotive ICs for application in infotainment, driver assistance, and display audio; and ultra-low power ECG sensor AFE IC, a wearable solutions for measuring electrocardiogram. It also offers Internet protocol (IP) solutions, such as high-speed I/O IP, high performance data conversion IP (ADC/DAC/AFE), and analog IP development for application in consumer, portable, and connected devices; and PLUS1 series ICs for industrial control, smart devices, smart vision, voice recognition, maker market, and high computing power demand applications. In addition, the company engages in management consulting; investments, system integration, market research survey, and information management and education services, as well as developing, manufacturing, and selling of computer software. Further, it is involved in building rental and property management activities. Sunplus Technology Company Limited was founded in 1990 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.sunplus.com",
        "market_cap": 19094716416
    },
    "2408.TW": {
        "short_name": "NANYA TECHNOLOGY CORPORATION",
        "long_name": "Nanya Technology Corporation",
        "summary": "Nanya Technology Corporation manufactures and sells dynamic random access memory (DRAM) and other memory products in Taiwan and internationally. The company's products have applications in mobile phones, servers, PC, consumer electronics, and automotive applications. Nanya Technology Corporation was founded in 1995 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "243",
        "website": "http://www.nanya.com",
        "market_cap": 242822201344
    },
    "2426.TW": {
        "short_name": "TYNTEK CORP",
        "long_name": "Tyntek Corporation",
        "summary": "Tyntek Corporation manufactures and sells LED chips. The company offers visible LED, ultra HB LED, infrared LED, InGaAs/InP, and GaP/GaP regulator chips; SI products, such as Si submount, Si resistor, Si zener diode, ambient sensor, Si photo-transistor, Si photo-diode, and other chips; and optical fiber communication device products, including InGaAs/InP PD and LED chips. It also provides LED, and indoor and outdoor lighting products, as well as car, truck, motorcycle, and bicycle lighting products; and professional blue LED manufacturing services. The company was founded in 1987 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu",
        "zipcode": "300",
        "website": "http://www.tyntek.com.tw",
        "market_cap": 7455400448
    },
    "2434.TW": {
        "short_name": "MOSPEC SEMICONDUCTOR CORP",
        "long_name": "Mospec Semiconductor Corp.",
        "summary": "Mospec Semiconductor Corp. produces and sells semiconductor products primarily in Taiwan. It offers solar cells, epitaxial silicon wafers, polished prime wafers, and wafer reclamation products, as well as surface mount devices. The company also provides discrete components, such as Schottky barrier rectifiers, transient voltage suppressor and small signal Schottky diodes, and mini dip bridges, as well as fast recovery, ultra-fast, and high efficiency rectifier diodes,; and power transistors, such as Darlington and switching transistors. In addition, it offers foundry services for silicon epitaxy, wafer fabrication, and semiconductor packaging. The company was founded in 1976 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "74442",
        "website": "http://www.mospec.com.tw",
        "market_cap": 1554000000
    },
    "2454.TW": {
        "short_name": "MEDIATEK INC",
        "long_name": "MediaTek Inc.",
        "summary": "MediaTek Inc. researches, develops, produces, and markets integrated circuits (ICs) worldwide. It provides multimedia, computer peripherals oriented, consumer-oriented, and other application ICs. The company offers products for smartphones, such as MediaTek Helio chipsets; octa-core and quad-core system-on-chips (SoC); 32-bit chipsets; and SOCs for Google Mobile Service Express. It also provides tablet chipsets that are used in enterprise systems; streaming and traditional audio products for connected audio systems, sound bars, and other applications; chipsets for ultra high definition 4K Blu-ray, Blu-ray and DVD players, and set top boxes; multi-core smart TV SoCs and chipset for digital TVs; and products for optical disk drives. In addition, the company offers home networking and broadband Wi-Fi products, which are used in PCs, broadband gateways, digital TVs, Blu-ray players, IPTV set-top boxes, and web cams; and automotive solutions, such as mmWave radar sensors, telematics solutions, vision advanced driver systems, and in-vehicle infotainment systems. Further, it provides chipsets for location intelligence, wearable products, smart home solutions, and machine to machine applications; and Narrow-Band Internet of Things (IoT), a 3GPP standardized cellular based low power wide area technology. Additionally, the company is involved in the provision of software and hardware design, development, test, maintenance and repair, and technological consultation services; import and export of its products; sale and delegation of patents and circuit layout rights for its products; and investment activity. It also provides research, marketing, management, and technology services. The company was founded in 1997 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30078",
        "website": "http://www.mediatek.com",
        "market_cap": 1550614790144
    },
    "2458.TW": {
        "short_name": "ELAN MICROELECTRONICS CORP",
        "long_name": "ELAN Microelectronics Corporation",
        "summary": "ELAN Microelectronics Corporation, a semiconductor company, produces and sells human interface solutions for notebook PCs, smartphones, tablets, and consumer electronics applications in Taiwan, China, Hong Kong, and the United States. The company offers fingerprint sensors, including biometric smart cards, pad and button modules, key cap fingerprint modules, biometric USB dongles, under display fingerprint sensors, and fingerprint sensor with coating/cover glass, as well as facial recognition solutions for PC and smartphone devices. It also provides microcontrollers for general purpose, touch key, PC peripheral, calculator, and telecommunication applications; pen and touch input solutions for laptops and mobiles; and pointstick and touchpad solutions. The company was founded in 1994 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30076",
        "website": "http://www.emc.com.tw",
        "market_cap": 61494259712
    },
    "3006.TW": {
        "short_name": "ELITE SEMICONDUCTOR MICROELECTR",
        "long_name": "Elite Semiconductor Microelectronics Tech Inc",
        "summary": "Elite Semiconductor Memory Technology Inc. designs, manufactures, and sells IC products in Taiwan. It provides memory IC products, including DRAM, flash, MCP, industrial grade, automotive grade, known good die, eMMC, and eMCP IC products; audio and power management mixed signal IC products; and wireless ASIC IC products. The company offers its products for use in various application, including industrial, automotive, consumer, PC peripherals, networking, wireless communications, audio, power, and IoT. Elite Semiconductor Memory Technology Inc. was founded in 1998 and is based in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.esmt.com.tw",
        "market_cap": 30419759104
    },
    "3034.TW": {
        "short_name": "NOVATEK MICROELECTRONICS",
        "long_name": "Novatek Microelectronics Corp.",
        "summary": "Novatek Microelectronics Corp., together with its subsidiaries, research, develop, manufacture, and sell integrated circuit chips for speech, communication, computer peripheral, LCD driver IC system, embedded MCU, DSP, and system applications. The company offers display driver ICs for LCD displays, televisions (TVs), notebook computers, desktop monitors, cameras, tablet PCs, automotive display screens, smart phones, and mobile phones; and system on chips products for digital and smart TVs, notebook computers, desktop monitors, set-top boxes, mobile phones, tablet PCs, camera modules, dashcam recording, IP cams, car backup camera modules, automotive safety assistance systems, and multimedia and mobile phone camera module applications. It is also involved in the trading and consulting of electronic spare parts; and provision of design, development, amendment, testing, and related consulting services for multimedia VLSI software. The company has operations in Taiwan, Asia, and internationally. Novatek Microelectronics Corp. was founded in 1997 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30076",
        "website": "http://www.novatek.com.tw",
        "market_cap": 299083661312
    },
    "3036.TW": {
        "short_name": "WT MICROELECTRONICS CO LTD",
        "long_name": "WT Microelectronics Co., Ltd.",
        "summary": "WT Microelectronics Co., Ltd., together with its subsidiaries, develops and sells electronic and communication components. Its products are used in various fields, including communication, computing, consumer electronics, industry and instrument, IOT, and automotive. The company is also involved in the investment, trading, and software services businesses. WT Microelectronics Co., Ltd. was founded in 1993 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "235",
        "website": "http://www.wtmec.com",
        "market_cap": 43124596736
    },
    "3073.TWO": {
        "short_name": "TEAMPHON ENERGY CO LTD.",
        "long_name": "Teamphon Energy Co., Ltd.",
        "summary": "Teamphon Energy Co., Ltd. operates as a professional consumer electronic IC application design company in Taiwan. It offers Wi-Fi cam solutions, baby monitors, and products for consumer applications, as well as supplies electronic components. The company also provides various products for game applications consisting of fit life, TV game, and gogo TV; and multimedia applications comprising car black box, mobile media player, MP3 player, TV box, PMP/learning aids, and boombox. It also markets its products in the United States, Japan, Europe, Mainland China, etc. Teamphon Energy Co., Ltd. was founded in 1991 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://www.kb-ent.com.tw",
        "market_cap": 374489984
    },
    "3094.TW": {
        "short_name": "DAVICOM SEMICONDUCTOR INC.",
        "long_name": "Davicom Semiconductor, Inc.",
        "summary": "Davicom Semiconductor, Inc. engages in the research, development, manufacture, and sale of communication network integrated circuits in Taiwan and internationally. The company offers ethernet, ethernet switch controller, industrial embedded transceiver, ethernet converter, dongle, and video decoder with safety monitoring. It also provides local area network chipsets for use in computer communications application on the network cards, hubs, and switches, as well as for use in local network resources to transfer and share; wide area network chipsets that are used as a remote access for data and video transmission; and video decoder chipsets, which are used for camera image signal decoding in closed-circuit television security monitoring systems, or DVR/NVR systems. In addition, the company offers electronic paper display products for low-power applications and equipment, such as financial smart cards, electronic shelf labels, wearing equipment, etc.; and microcontroller units for use in motor control, analogy digital signal, RFID, financial smart cards, electronic shelf labels, wearable equipment, etc. Further, it also provides wireless communication machinery and equipment. The company was founded in 1996 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": null,
        "website": "http://www.davicom.com.tw",
        "market_cap": 2737522944
    },
    "3122.TWO": {
        "short_name": "MEGAWIN TECHNOLOGY CO LTD",
        "long_name": "Megawin Technology Co., Ltd.",
        "summary": "Megawin Technology Co., Ltd., together with its subsidiaries, designs and sells ICs primarily in Taiwan. The company offers 8051 MCU and Cortex-M0 products; and USB products, including full speed MCUs, USB keyboards/mouses/joysticks, USB bridges, and charge ICs. It also provides firmware tool kits, such as ICE, writer, and ISP programmer. The company was incorporated in 1999 and is headquartered in Jhubei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Jhubei City",
        "zipcode": "30288",
        "website": "http://www.megawin.com.tw",
        "market_cap": 1503275008
    },
    "3141.TWO": {
        "short_name": "ULTRA CHIP INC",
        "long_name": "UltraChip Inc.",
        "summary": "UltraChip Inc. operates as a fabless IC company in the mobile multimedia IC industry. It researches and develops, manufactures, and sells LCD display driver ICs. The company offers professional display products for consumers, automotive, and industrial sectors. It also provides bistable display products comprising pure driver and Tcon, segment type driver, and single chip products; and motor products, such as BLDC control, motor driver, and high and low side driver ICs. The company offers its products for factory automation control, medical equipment, automotive devices, mobile devices, etc. It operates in Taiwan, China, the United States, Japan, and internationally. UltraChip Inc. was founded in 1999 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11492",
        "website": "http://www.ultrachip.com",
        "market_cap": 5756947968
    },
    "3169.TWO": {
        "short_name": "ASIX ELECTRONICS CORPORATION LT",
        "long_name": "ASIX Electronics Corporation",
        "summary": "ASIX Electronics Corporation, an IC Design company, supplies fabless semiconductors with focus on networking, communication, and connectivity applications. The company provides industrial, SuperSpeed USB, and Non-PCI/SPI embedded Ethernet ICs, as well as interface ICs; and RS-232/RS-485 UART transceivers and USB KVM Switch/Wi-Fi/Ethernet SoCs. It offers its products for smart factory, industrial automation, industrial IoT, smart home and office, PC and peripheral, interface connectivity, and USB KVM switch applications. ASIX Electronics Corporation was founded in 1995 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30078",
        "website": "http://www.asix.com.tw",
        "market_cap": 9296549888
    },
    "3189.TW": {
        "short_name": "KINSUS INTERCONNECT TECHNOLOGY ",
        "long_name": "Kinsus Interconnect Technology Corp.",
        "summary": "Kinsus Interconnect Technology Corp. primarily researches, develops, designs, manufactures, and sells electronic products in Taiwan and internationally. The company operates in two segments, IC Substrate and Printed Circuit Board (PCB). It offers plastic ball grid array, multi-chip-module ball grid array (BGA), chip scale package (CSP) mini-BGA, high dissipation cavity down, thermal enhanced BGA, flip chip, flip chip CSP, flip chip film chip on flex, core-less, all layer build up, embedded pattern and passive, high density copper bump, high band width package-on-package, core-less embedded passive, and radio frequency module substrates. The company also provides system in package, a carrier substrate that provides a platform for multiple chips or packages or passive components assembly; and PCBs and related products, and electronic components, as well as after sales services. In addition, the company is involved in the wholesale and retail-sale of electronic materials; sale of medical equipment; provision of consultation services for business operation and management; and investment and trading activities. Its products are used for modules in handset and wearable devices, microprocessors, controllers, graphic and application processors, ASIC, PC chipsets, connectivity, power management, memory, power amplifier, front end and WiFi connectivity modules, and field programmable gate array applications. The company primarily serves IC packaging, design, and system businesses, as well as manufacturers of electronic products. The company was founded in 2000 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "327",
        "website": "http://www.kinsus.com.tw",
        "market_cap": 53199593472
    },
    "3224.TWO": {
        "short_name": "METATECH (AP)",
        "long_name": "MetaTech (AP) Inc.",
        "summary": "MetaTech (AP) Inc. engages in the wholesale and retail of electronic products and equipment in Taiwan, Hong Kong, China, and Southeast Asia. The company offers semiconductor components and consumer products, communication products, and connectors. It also provides genetic testing products for the non-invasive tumors, lung cancer, and familial and colorectal cancer; and regenerative medicines. In addition, the company offers travel and reinvestment services. The company was founded in 1998 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "221",
        "website": "http://www.metatech.com.tw",
        "market_cap": 2442473472
    },
    "3227.TWO": {
        "short_name": "PIXART IMAGING",
        "long_name": "PixArt Imaging Inc.",
        "summary": "PixArt Imaging Inc. researches, designs, produces, and sells CMOS image sensors and related ICs in Taiwan, Hong Kong, China, Japan, and internationally. The company offers optical mouse sensor, optical track sensor, and finger navigation products; and multiple object tracking, optical motion tracking, gesture recognition, and ambient light and proximity sensing products, as well as CMOS camera SOC products. It also provides photoplethysmography sensors, computer vision, capacitive touch products, and customized ASIC sensors; wireless audio SOC/true wireless stereo IC products; Bluetooth low energy products; and RF chips. The company's products are used in computers and peripherals, smart homes, offices and classrooms, wearables and hearables, gaming controllers, automotive, surveillance and cameras, commercial and others, automation navigation, and health management. It is also involved in the investment and technical support activities. PixArt Imaging Inc. was founded in 1998 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.pixart.com.tw",
        "market_cap": 27390367744
    },
    "3228.TWO": {
        "short_name": "RDC SEMICONDUCTOR CO",
        "long_name": "RDC Semiconductor Co., Ltd.",
        "summary": "RDC Semiconductor Co., Ltd. designs and develops IC for high-end and low power bit microprocessors in Taiwan and internationally. The company offers Emkore DE and Emkore DS processor platforms for embedded commercial applications, such as digital electronic signage, automatic teller machines, smart vending machines, human-machine interfaces, thin computers, and terminal sales systems; and RDC IAD processor platform for mobile networking applications in consumer electronics, and embedded markets. It also provides RDC 32-bit microcontrollers for various applications, including industrial control, automation, NAT routers, home gateway and access points, industrial PCs, thin client applications, and others; RDC16-bit microcontrollers for general embedded market applications, such as industrial controls, control automation, terminals, signal generators, and projectors; and RDC NPU to equipment manufacturers. In addition, the company offers RDC ASIC that provides clients with comprehensive services and industrial application solutions; low power system-on-chip for programmable automation controller, embedded board solutions, data concentrator, and industrial automation control system applications; and multi-function I/O peripheral controllers and PCI express/PCI interfaces expansions. Further, it provides 8-bit MCU IP that is used for DSC, CF card, pattern recognition, LCD monitor controller, USB device controller, scanner controller, MP3 controller, modem controller, and voice recognition applications. The company was founded in 1997 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30078",
        "website": "http://www.rdc.com.tw",
        "market_cap": 26439270400
    },
    "3234.TWO": {
        "short_name": "TRUELIGHT CORPORATIION",
        "long_name": "TrueLight Corporation",
        "summary": "TrueLight Corporation designs, develops, and supplies optical components in Asia. The company offers high-bandwidth semiconductor lasers, photodiode components and submodules, optical engines and cables, vertical cavity surface emitting lasers light source for cloud\\data center, 5G mobile internet base station interconnections, and proximity/flood illumination/3D sensing applications in smartphones. It serves optical fiber transceiver, internet equipment, and smartphone module manufacturers. The company was founded in 1997 and is based in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30078",
        "website": "http://www.truelight.com.tw",
        "market_cap": 2554265088
    },
    "3260.TWO": {
        "short_name": "ADATA TECHNOLOGY CO. LTD.",
        "long_name": "ADATA Technology Co., Ltd.",
        "summary": "ADATA Technology Co., Ltd. designs, manufactures, and sells memory and storage solutions. It offers DRAM modules, solid state drives, USB flash drives, memory cards and readers, power banks, and cables and accessories; external storage products; and wireless, car, and wall chargers, as well as PC system and components, keyboard and mouse, audio products, and accessories. The company also provides industrial SSD cards, and disk on module/USB/embedded products for use in automation, point of sale, digital signage, network video recorder, kiosk, data centers, in-car systems, multifunction printers, casino gaming machines, and aerospace applications. In addition, it offers commercial and industrial lighting products; and powertrain products, such as axial flux motors, air-cooled motors, liquid-cooled motors, and motor controllers. ADATA Technology Co., Ltd. was founded in 2001 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "235",
        "website": "http://www.adata.com",
        "market_cap": 22560198656
    },
    "3288.TWO": {
        "short_name": "SILICON TOUCH TECHNOLOGY INC",
        "long_name": "Silicon Touch Technology Inc.",
        "summary": "Silicon Touch Technology Inc. designs, develops, produces, and sells analogue and digital ICs. The company offers motor, brushless fan motor, CD/DVD ROM motor, stepping motor, and LED display driving IC, as well as power and power supply monitoring, optoelectronic communication and image processing, and optoelectronic interface ICs. It provides its products in the Americas, Europe, Japan, Korea, South Africa, and China. The company was founded in 1996 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.siti.com.tw",
        "market_cap": 430540000
    },
    "3339.TWO": {
        "short_name": "TEKCORE CO",
        "long_name": "Tekcore Co., Ltd",
        "summary": "Tekcore Co., Ltd produces and sells LED wafers and chips in Taiwan. It offers standard LEDs, and power and flip chips. The company provides high brightness chips in green, blue, red, yellow, orange, and ultraviolet wavelengths. Its products are used in various applications, including large scale displays and billboards; optic fiber cables; indicator lights; LCD and projection backlighting; low light environments; miniaturized light sources; cell phones, cameras, and other small electronic displays; TV remotes and infrared mouses; signal lights; interior and exterior solid state lighting and other illuminations; and vehicle lights. The company was founded in 2000 and is based in Nantou City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Nantou City",
        "zipcode": "540",
        "website": "http://www.tekcore.com.tw",
        "market_cap": 1136126208
    },
    "3346.TW": {
        "short_name": "LASTER TECH CORPORATION LTD",
        "long_name": "Laster Tech Co., Ltd.",
        "summary": "Laster Tech Co., Ltd. engages in the manufacture and sale of LED lighting products in Taiwan and internationally. It offers automotive lighting products, including tail lights, brake lights, fog lights, turn signals, side markers, and day time running lamps; industrial, indoor, outdoor, and landscape lighting products; and chip products, such as Lumileds LED chips. The company was founded in 1999 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "235010",
        "website": "http://www.lastertech.com",
        "market_cap": 3826341632
    },
    "3360.TWO": {
        "short_name": "SUNNIC TECHNOLOGY & MERCHANDISE",
        "long_name": "Sunnic Technology & Merchandise Inc",
        "summary": "Sunnic Technology & Merchandise Inc. provides image processing and optoelectronic products in Taiwan. It offers products ranging from semiconductors, solutions and modules, and systems to factory automation equipment. The company also provides solutions for exterior, mechanism, software, hardware, and firmware designs, as well as one-stop shopping services. Its product research and development covers range of products and applications that include CCD and CMOS analog and digital HD smart cameras for image capture and blue-ray; H.264 IP set top box and IP smart TV box for image storage; HD smart displays and Internet TV for image display; and Wi-Fi, RF, and 3GPP for video conferencing and image transmission. The company was founded in 1985 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.sunnic.com",
        "market_cap": 1064958528
    },
    "3374.TWO": {
        "short_name": "XINTEC INC",
        "long_name": "Xintec Inc.",
        "summary": "Xintec Inc. operates as a three dimensional (3D) wafer level chip scale packaging company in Taiwan, the United States, Europe, and Asia. The company offers optical sensor chip-scale package technology for cellular phones, notebooks, gesture sensors, and laser intensity sensor for blue-ray and pico projectors; PPI and 3D Package technologies for use in integrated passive devices, power management IC and analogue IC, cellular phone RF IC, and capacitive couplers; and Micro-Electro-Mechanical Systems (MEMS) and sensor packaging for ink printer heads, motion sensors, temperature and humidity sensors, pressure sensors, identification sensors, pico-projector heads, silicon microphones, and bio sensors. It also provides design and modeling services for its technologies. Xintec Inc. was founded in 1998 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "32062",
        "website": "http://www.xintec.com.tw",
        "market_cap": 45317787648
    },
    "3413.TW": {
        "short_name": "FOXSEMICON INTEGRATED TECHNOLOG",
        "long_name": "Foxsemicon Integrated Technology Inc.",
        "summary": "Foxsemicon Integrated Technology Inc. provides design and contract manufacturing services for semiconductor and TFT-LCD equipment manufacturing, and integrated system equipment in Taiwan and internationally. The company's services and products include equipment components, modules, solar energy equipment, and total systems used in the semiconductor and TFT-LCD industries. Foxsemicon Integrated Technology Inc. was founded in 2001 and is based in Chu-Nan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Chu-Nan",
        "zipcode": "350",
        "website": "http://www.foxsemicon.com.tw",
        "market_cap": 19657947136
    },
    "3429.TWO": {
        "short_name": "Promaster",
        "long_name": "Promaster Technology Corp.",
        "summary": "Promaster Technology Corp. distributes general purpose, communication and multimedia products for communication and consumer markets. The company's products are used in desktop and server PCs, notebook PCs, smart phones, LCD TVs, PDA, graphic cards, and audio/video I/O products; networking products, such as LAN, ADSL router and cable modems, and telecom products; and wireless products, including cellular phones, wireless handheld devices, WLAN and Bluetooth, and GPS. The company was founded in 1995 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "231",
        "website": "http://www.pmaster.com.tw",
        "market_cap": 509673600
    },
    "3437.TW": {
        "short_name": "ADVANCED OPTOELECTRONIC TECHNOL",
        "long_name": "Advanced Optoelectronic Technology Inc.",
        "summary": "Advanced Optoelectronic Technology Inc. engages in the research and development of opto-semiconductor technologies, and commercialization of solid-state lighting solutions in Taiwan. It provides chip LEDs for use in cellular phone keypad backlights and various indicator lights; top LEDs for backlighting, automobile, camera flash, and other applications; side emitted LEDs for use in small size panels and slim type panels; and lighting fixtures and UV light chips. The company was founded in 1999 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "303",
        "website": "http://www.aot.com.tw",
        "market_cap": 4097935872
    },
    "3438.TWO": {
        "short_name": "ADVANCED ANALOG TECHNOLOGY INC",
        "long_name": "Advanced Analog Technology, Inc.",
        "summary": "Advanced Analog Technology, Inc. designs, develops, and sells power management ICs in Taiwan. It provides multifunctional PMICs, such as TFT LCDs, AMOLEDs, DSC/DVs, and portable devices; boost, buck, buck-boost, and inverting switching regulators; WLED drivers consisting of backlights and lighting products; and battery management products comprising battery chargers and battery protection products. The company also offers audio amps, GPMs, LDOs, level shifters, motor drivers, OP amps/buffers, RESETs, and photoflash products. Its products are used in DSC/DV/drive recorder, PND, and discrete and integrated LCD panel applications. Advanced Analog Technology, Inc. was founded in 1999 and is headquartered in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": "30288",
        "website": "http://www.aat-ic.com",
        "market_cap": 3792130304
    },
    "3443.TW": {
        "short_name": "GLOBAL UNICHIP CORP.",
        "long_name": "Global Unichip Corp.",
        "summary": "Global Unichip Corp. researches, develops, produces, tests, and sells embedded memory, logic, and analog components for various application ICs in Taiwan, China, Europe, Japan, Korea, and North America. The company offers designing, wafer manufacturing, packaging, and testing services for ASIC and wafer products; circuit design cell library and various intellectual properties (IPs) required in the process of product design; circuit layouts for mask making; and subcontract mask making, wafer manufacturing, dicing, and packaging to vendors, as well as conducts testing. It also integrates multiple design projects of various customers on single mask and by a wafer engineer run; and provides customization, consulting, designing, technical support, and IP licensing services, as well as provides cell libraries; and EDA tools. In addition, the company offers system on a chip (SoC) design services, such as technology design, design methodology, low power solution, and testability design services; SoC manufacturing services consisting of packaging, testing and product engineering, and quality and reliability, as well as supply chain management services; and IP portfolio, including synthesizable implementation IP, and hardened PHYs and verification IP for ASIC, FPGA, and SoC designs. Global Unichip Corp. was incorporated in 1998 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30078",
        "website": "http://www.globalunichip.com",
        "market_cap": 52130279424
    },
    "3527.TWO": {
        "short_name": "MACROBLOCK INC",
        "long_name": "Macroblock, Inc.",
        "summary": "Macroblock, Inc. supplies LED drivers for display, backlighting, and lighting applications worldwide. The company's products include display, local dimming backlight, RGB lighting, automotive lighting and display, DC/DC controller and DC/DC convertor, isolated and non-isolated AC/DC controller, and linear regulator LED driver ICs. It also provides Hawkeye solution platform, a LED display solution; and micro-LED solutions. In addition, the company offers IOT technology solutions, including facial recognition, business intelligence analytics, and content management system solutions for the shopping mall, retail, and supermarket sectors. Macroblock, Inc. was incorporated in 1999 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30072",
        "website": "http://www.mblock.com.tw",
        "market_cap": 4955617280
    },
    "3529.TWO": {
        "short_name": "EMEMORY TECHNOLOGY INC.",
        "long_name": "eMemory Technology Inc.",
        "summary": "eMemory Technology Inc. researches, develops, manufactures, and sells flash memory integrated circuits. It offers NeoBit, a programmable logic device that embeds into various CMOS processes, including logic, mixed-mode, bipolar-CMOS-DMOS (BCD), analog, radio frequency (RF), and high-voltage (HV); and NeoFuse, a small-form-factor logic non-volatile memory technology for use in IDs, production record, encryption code, and ROM replacement, as well as analog trimming, function selection, and parameter setting applications. It also used in set-top boxes, digital TV, CMOS imaging sensors, application processors, baseband processors, LCD drivers, and power management ICs. The company also provides NeoEE, a single-poly embedded memory device for application in users preference setting in IC cards, code storage in MCUs and RFICs, configuration settings in NFC controllers, fuse devices in memory redundancy designs, and parameter trimming for analog/RF/HV/BCD circuits; and NeoMTP, a single-poly embedded memory technology for USB type-C, wireless charger, touch panels, P-Gamma, MCUs, etc. In addition, it offers NeoPUF, a hardware security technology device for Internet of Things (IoT) applications; EcoBit, an embedded logic multiple-time programmable solution for passive RFID tags, lower power sensors, battery-saving mobile ICs, and other IoT chips; Green platform for code storage in microcontrollers or speech ICs; and MagnaChip EEPROM, an IP block device for code storage in microcontrollers, and RFICs, parameter trimming for analog/RF/HV circuits. It serves semiconductor foundries, integrated devices manufacturers, and fabless design houses in Taiwan and internationally. eMemory Technology Inc. was founded in 2000 and is headquartered in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": "30288",
        "website": "http://www.ememory.com.tw",
        "market_cap": 86805315584
    },
    "3530.TW": {
        "short_name": "SILICON OPTRONICS INC",
        "long_name": "Silicon Optronics, Inc.",
        "summary": "Silicon Optronics, Inc., together with its subsidiaries, operates as a complementary metal-oxide-semiconductor image sensor design company in Taiwan, Hong Kong, the United States, India, Korea, and the Philippines. The company offers area sensors, including raw or SOC sensors for applications in smart phones and tablets, PC cams and Webcams, digital still cameras, and security and surveillance systems; and linear sensors for use in document scanners, multifunction printers, barcode scanners, fax machines, counterfeit money scanners, and portable scanners. It also engages in the investment business. Silicon Optronics, Inc. was founded in 2004 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.soinc.com.tw",
        "market_cap": 13108020224
    },
    "3531.TWO": {
        "short_name": "SHIAN YIH ELECTRONIC INDUSTRY C",
        "long_name": "Shian Yih Electronic Industry Co.,Ltd",
        "summary": "Shian Yih Electronic Industry Co.,Ltd manufactures and sells light emitting diode (LED) back light modules. It provides small to medium size LED back light modules, motorcycle and vehicle LED headlight modules, light guide films, and plastic injection molding products, as well as LED packaging, design, and fabrication services. The company was founded in 1979 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": null,
        "website": "http://www.shianyih.com",
        "market_cap": 1388672512
    },
    "3545.TW": {
        "short_name": "FOCALTECH SYSTEMS CO LTD",
        "long_name": "FocalTech Systems Co., Ltd.",
        "summary": "FocalTech Systems Co., Ltd. provides LCD display driver solutions worldwide. The company offers IDC, fingerprint identification, display driver, and touch chips. It also provides human-machine interface solutions, including 2D/3D touch controller, super in- cell IDC, fingerprint sensor, and display driver for smart electronic devices. The company was incorporated in 2005 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30078",
        "website": "http://www.focaltech-systems.com",
        "market_cap": 50507575296
    },
    "3555.TWO": {
        "short_name": "IROC CO LTD",
        "long_name": "iROC Co., Ltd.",
        "summary": "iROC Co., Ltd. engages in the research and development, and sale of natural products in Japan. The company offers drinking water under the VACHI; skin care products under the QINGSKIN; and chicken essence under the DDDrops brand names. It serves customers through online shops and distributors. The company was formerly known as Skymedi Corporation. iROC Co., Ltd. was founded in 2003 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "235",
        "website": "http://www.iroc.com.tw",
        "market_cap": 1183814912
    },
    "3556.TWO": {
        "short_name": "EGALAX EMPIA TECHNOLOGY INC.",
        "long_name": "eGalax_eMPIA Technology Inc.",
        "summary": "eGalax_eMPIA Technology Inc. provides touch panel solutions. The company offers projected capacitive IC and controller solutions, resistive touch solutions, surface capacitive touch controllers, surface acoustic wave touch sensors and controllers, and accessories. It serves the industrial, commercial, gaming, medical, banking, military, transportation, and consumer electronic sectors. eGalax_eMPIA Technology Inc. was founded in 2000 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11492",
        "website": "http://www.eeti.com.tw",
        "market_cap": 3877378560
    },
    "3567.TWO": {
        "short_name": "ETREND HIGHTECH CORP",
        "long_name": "ETREND Hightech Corp.",
        "summary": "ETREND Hightech Corp. engages in testing and processing electronic components in Taiwan. It offers IC and wafer testing services. The company is based in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "302",
        "website": "http://www.etrendtech.com.tw",
        "market_cap": 1140854400
    },
    "3581.TWO": {
        "short_name": "ZEN VOCE CORPORATION",
        "long_name": "Zen Voce Corporation",
        "summary": "Zen Voce Corporation manufactures and sells optoelectronic and semiconductor dicing saws, and assembly and testing products. It engages in the design and manufacture of IC packaging machine and bumping; wafer cutting and cleaning machines; and board cutting and cleaning machines. The company also designs and manufactures test products, such as wafer test probe card PCBs; IC test HIFIX and CHANG kits; SOCKET IC test products; IC handlers; and SOCKET IC burn-in test products, as well as offers dicing and jig saws, tapes, and ball mount tooling products. It serves semiconductors, optoelectronics, microelectronics, and LCD equipment industries. The company was formerly known as Trutek Cooperation. Zen Voce Corporation was founded in 1999 and is based in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": null,
        "website": "http://www.zenvoce.com",
        "market_cap": 1188439808
    },
    "3583.TW": {
        "short_name": "SCIENTECH CORPORATION",
        "long_name": "Scientech Corporation",
        "summary": "Scientech Corporation supplies products and services for the semiconductor, flat panel display, LED, data storage, scientific instruments, and high-tech related industries. The company offers chemical analysis and biotechnology equipment; remote control system; camera lens; flat panel display; mask/reticle and semiconductor front-end process equipment; MEMS/compound semiconductor/LED products; semiconductor packaging and testing equipment; 3D printing equipment; and wet benches/single wafer wet process equipment, and temporary bonding/de-bonding/glass recycle tools. It also provides wafer reclaiming services; repair, overhaul, and calibration services; and used tools, such as refurbished metrology, Nikon stepper/scanner, TEL track, and ion implanter tools. The company was founded in 1979 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11491",
        "website": "http://www.scientech.com.tw",
        "market_cap": 4964270592
    },
    "3588.TW": {
        "short_name": "LEADTREND TECHNOLOGY CORPORATIO",
        "long_name": "Leadtrend Technology Corporation",
        "summary": "Leadtrend Technology Corporation operates as an IC fables company primarily in Taiwan. It offers AC-DC controllers, such as primary side regulator controllers, isolated green mode products, isolated high voltage green mode products, synchronous rectification drivers, and transition mode PFC controllers; USB type-c port controllers; and LED application products, including 3 in 1 flexible dimming processors, AC/DC LED lighting controllers/drivers, current ripple suppressors, and CC/CV secondary side controllers. The company also provides TV/monitor, USB PD/PPS, networking, and LED lighting solutions. Its products are used in technical articles, networking, notebooks, monitors/TVs, chargers, and LED lightings. The company was founded in 2002 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "302",
        "website": "http://www.leadtrend.com.tw",
        "market_cap": 4122896384
    },
    "3592.TWO": {
        "short_name": "Raydium",
        "long_name": "Raydium Semiconductor Corporation",
        "summary": "Raydium Semiconductor Corporation provides integrated circuit (IC) solutions in Taiwan and internationally. It offers driver IC, power IC, touch control IC, and power management and timing controller IC solutions for artificial intelligence, Internet of Things, smart TVs, professional gaming, computer information, automotive, and industrial control products, as well as mobile and wearable devices. The company was founded in 2003 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.rad-ic.com",
        "market_cap": 24701966336
    },
    "3627.TWO": {
        "short_name": "ALC",
        "long_name": "Arima Lasers Corporation",
        "summary": "Arima Lasers Corporation manufactures and sells laser diodes in Taiwan. The company's products are used in various applications, including optical disk drives, optical communication networks, laser mouse, laser display, photodynamic therapy, laser printers, bar code scanners, distance measurements, levelers, etc. It also offers laser modules; high power products; surface mount device of laser diode; and OEM services, such as die bonding, in process quality check, wire bonding, cap sealing, auto laser marking, and testing services. The company was founded in 2007 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "324",
        "website": "http://www.arimalasers.com/en",
        "market_cap": 704337472
    },
    "3661.TW": {
        "short_name": "ALCHIP TECHNOLOGIES LIMITD",
        "long_name": "Alchip Technologies, Limited",
        "summary": "Alchip Technologies, Limited, together with its subsidiaries, provides silicon design and manufacturing solutions for application specific integrated circuit and System on chip (SoC) companies. It offers SoC design, production, and IP solutions, as well as multi project wafer services. The company's products are primarily used in network, storage, and computing devices; HDTVs, mobile phones, digital cameras/video cameras, entertainment systems, portable media players, tablet PC master chips, and peripheral chips; and surveillance systems, entertainment machines, and medical equipment and instruments. It operates in China, Japan, the United States, Taiwan, Europe, and internationally. The company was founded in 2003 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.alchip.com",
        "market_cap": 33371602944
    },
    "3680.TWO": {
        "short_name": "GUDENG PRECISION INDUSTRIAL CO",
        "long_name": "Gudeng Precision Industrial Co., Ltd",
        "summary": "Gudeng Precision Industrial Co., Ltd provides technology services worldwide. The company offers mask handling solutions, such as ultraviolet reticle POD, reticle SMIF POD, and mask package; and wafer handling solutions, including front opening unified POD, multi-application carriers, FOUP, wafer cassettes, shipping boxes, and cassette boxes. It also provides equipment comprising mask cleaners and purge stations; and cleaning services, mask management and tracking systems, and mask accessories. The company was founded in 1998 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "236041",
        "website": "http://www.gudeng.com",
        "market_cap": 20987260928
    },
    "3707.TWO": {
        "short_name": "EPISIL HOLDINGS INC",
        "long_name": "Episil Holding Inc.",
        "summary": "Episil Holding Inc. engages in the epitaxial wafer foundry, power semiconductor, and analog integrated circuit businesses in Taiwan. The company was formerly known as Episil Technologies Inc. Episil Holding Inc. was founded in 1985 and is based in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": null,
        "website": "http://www.episil.com",
        "market_cap": 21884379136
    },
    "4919.TW": {
        "short_name": "NUVOTON TECHNOLOGY CORPORATION",
        "long_name": "Nuvoton Technology Corporation",
        "summary": "Nuvoton Technology Corporation, together with its subsidiaries, operates as a digital/analog/mixed signal semiconductor company in the United States, Europe, Asia, and internationally. It operates through General Integrated Circuit (IC) Product and Foundry Service segments. The company engages in the research, design, development, manufacture, and sale of logic ICs; and manufacture, testing, and OEM of 6-inch wafers. It also researches, designs, develops, manufactures, and sells microcontrollers; microprocessors; application specific SoCs devices; audio amplifiers, CODECs, converters, and enhancements; and ISD voice ICs, including ISD ChipCorder products and Voiceband CODECs. In addition, the company provides cloud computing products comprising embedded controllers, hardware monitors, I/O and security devices, iBMC products, and voltage level shifters; power management products, which consist of power switches and voltage regulators; and Internet of things (IoT) solutions. Further, it operates IoT for various IoT solutions; operates emWin platform for graphical user interface solution to create graphics for the embedded system; and offers professional semiconductor foundry services. Additionally, the company engages in the wholesale of computers, supplements, and software; and provides computer software services. Its products are used in automotive, computing, medical, portable devices, audio/video products, and consumer and industrial electronics, as well IoT security and smart home appliances. The company was founded in 2008 and is headquartered in Hsinchu, Taiwan. Nuvoton Technology Corporation is a subsidiary of Winbond Electronics Corporation.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.nuvoton.com",
        "market_cap": 31204845568
    },
    "4923.TWO": {
        "short_name": "Force Mos",
        "long_name": "Force MOS Technology Co., Ltd.",
        "summary": "Force MOS Technology Co., LTD. engages in the design, development, and sale of MOSFETs and analog ICs in Taiwan. It offers bipolar transistors; diodes and rectifiers; and power management products for light electric vehicles technology and brushless DC motor control applications. The company was founded in 2006 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "248",
        "website": "http://www.force-mos.com",
        "market_cap": 1256600064
    },
    "4925.TWO": {
        "short_name": "JMicron",
        "long_name": "JMicron Technology Corp.",
        "summary": "JMicron Technology Corp. operates as an IC design company in Taiwan and internationally. The company designs high-speed data and signal interfaces, such as 3.1 5Gbps, USB 3.2 10Gbps and USB 3.2 20Gbps to connect them to SATA/PCIe/UFS; PCIe interface to SATA interface; and SATA 1.5Gbps/SATA 3Gbps/SATA 6Gbps, and SATA port multiplier/port selector, as well as bridge controllers for SATA to PATA interface. It also provides external data storage products, such as single bay controllers for USB 2.0/USB 3.0/USB 3.1/USB 3.2 host interfaces; dual-/multi-bay bridge controllers for external multiple-bay HDDs, RAID, and SATA port multipliers and port selectors; storage device controllers; and universal flash storage products. In addition, the company offers hard disk drive duplicators and surveillance storage systems, and NAS devices with RAID functionality. JMicron Technology Corp. is based in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": null,
        "website": "http://www.jmicron.com",
        "market_cap": 10792189952
    },
    "4945.TWO": {
        "short_name": "SENTELIC CORP",
        "long_name": "Sentelic Corporation",
        "summary": "Sentelic Corporation operates as an IC design company in Taiwan, China, and Japan. The company offers mixed-signal, ASIC, firmware/software, and multi-media processing services; fan motor drive control IC's for servers, communication equipment, cloud data centers, and 5G base stations; and cooling fans for servers, telecommunication switching equipment, gaming graphics cards, and mining hardware. Sentelic Corporation was founded in 2000 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11493",
        "website": "http://www.sentelic.com",
        "market_cap": 1557470592
    },
    "4951.TWO": {
        "short_name": "Fintek",
        "long_name": "Feature Integration Technology Inc.",
        "summary": "Feature Integration Technology Inc. designs, markets, and commercializes ICs and controllers. It offers I/O controllers and I/F management products, such as eSPI/LPC/USB/PCIE I/F controllers; super hardware monitors + SIOs; hardware keyboard controllers; USB consumer IR receiver ICs for Windows Vista/Windows 7; power saving (EUP) SIOs and controllers; transceivers and buffers; SIOs with microcontrollers (uSIO); and bus controllers and transceivers. The company also provides environment sensors and glue logic ICs, including environment sensors and fan controllers, pure logic ICs, performance controllers, and real time clocks; power management and ACPI controllers, such as ACPI, switching, and multi-phase linear controllers; micro-processors; LED driver ICs; interface and connectivity products; and USB type-C and power delivery products, as well as USB fast charging products. It offers its IC products for various applications in personal computers, computer peripherals, digital consumer electronic products, and information appliance products. The company sells its products through professional IC distributors. Feature Integration Technology Inc. was founded in 2002 and is headquartered in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": "302",
        "website": "http://www.fintek.com.tw",
        "market_cap": 1241623168
    },
    "4952.TW": {
        "short_name": "GENERALPLUS TECHNOLOGY INC",
        "long_name": "Generalplus Technology Inc.",
        "summary": "Generalplus Technology Inc. researches, develops, and sells integrated circuits (ICs) worldwide. It offers speech/tone synthesizers, sound processors, controllers, and one battery speech synthesizers; LCD controllers and driver; multimedia processors; automobile video recorders; remote, motor, gTouch, and charger controls, as well as controllers for home applications; flash products; and motor drivers, audio amplifiers, linear regulators, ADC and microphone pre-amplifiers, I/O bus extenders, USB bridge and socket servers, touch applications, USB headset solutions, and three-axis accelerometers. The company was founded in 2004 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30077",
        "website": "http://www.generalplus.com",
        "market_cap": 5010976768
    },
    "4961.TW": {
        "short_name": "FITIPOWER INTEGRATED TECHNOLOGY",
        "long_name": "Fitipower Integrated Technology Inc.",
        "summary": "Fitipower Integrated Technology Inc. research, design, and development of LCD driver ICs and analogs, and digital and mixed-signal power management ICs in Taiwan. Its power management products comprise buck DC-DC, boost DC-DC, linear regulator, LCD power, power switch, WLED driver, reset IC, and motor driver, as well as other products, such as PMUs, ASICs, etc.; and display driver products include AV/tablet, DSC, NBMNT, TV, and gate products. The company's products are used for various applications consisting of LCD-TVs, notebooks, networking, portable devices, set-top boxes, CCTV/security, desktops, LED lighting, and TFT-LCD driver products. Fitipower Integrated Technology Inc. was founded in 1995 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30078",
        "website": "http://www.fitipower.com",
        "market_cap": 53273190400
    },
    "4968.TW": {
        "short_name": "RICHWAVE TECHNOLOGY CORPORATION",
        "long_name": "RichWave Technology Corporation",
        "summary": "RichWave Technology Corporation designs, develops, and sells radio frequency (RF) integrated circuits in Taiwan and internationally. The company offers a portfolio of RF front-end components for Wi-Fi, such as power amplifiers, low noise amplifiers, switches, and front-end modules; mobility switches, mobility and GPS LNA products, and power amplifiers; RF components, and Internet of Things (IoT) low noise amplifiers and switches; automotive front-end modules and switches; cable network switches; motion detection sensors; and GPS/WiFi SAW filters, cellular SAW filters, IoT SAW filters, and WiFi diplexers. It also provides single-chip broadcast IC tuners, as well as a line of wireless video/audio transmission chipsets for different ISM bands. The company's products are used in various applications, including networking, mobile, smart home, internet of things, wireless media, broadcasting, and automotive. RichWave Technology Corporation was founded in 2004 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.richwave.com.tw",
        "market_cap": 32986224640
    },
    "4979.TWO": {
        "short_name": "LUXNET CORPORATION",
        "long_name": "LuxNet Corporation",
        "summary": "LuxNet Corporation designs, develops, and manufactures optical semiconductor devices and packaged optical components in Taiwan. The company provides laser and photo diode chips, transmitters, receivers, and optical sub-assemblies. Its products are used in high speed voice video and data communications for networking, storage, and cable TV, as well as optical communication applications. The company was founded in 1999 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "32061",
        "website": "http://www.luxnetcorp.com.tw",
        "market_cap": 2268680448
    },
    "5236.TWO": {
        "short_name": "Sunplusit",
        "long_name": "Sunplus Innovation Technology Inc.",
        "summary": "Sunplus Innovation Technology Inc. researches, develops, manufactures, and markets microcontrollers and system-on-chips with embedded software solutions in Taiwan. It offers wired optical mice, wireless desktops, and MCU for HID and toy devices; and Web, NB, and IOT camera controllers. The company's products are used in human interface devices, PC external HDD/ODD drives, and PC/NB camera and industry control market segments. It also provides image data services for AI datasets, including data collection, labeling and tagging, verification, model training, 2D bounding box, line and polygonal annotation, semantic segmentation, landmark/key point annotation, other annotation services, product features tagging, queue monitoring, data transcription, emotion analysis, feedback entry, data entry-data capture, de-identification service, training, and system integration. The company is based in Hsinchu City, Taiwan. Sunplus Innovation Technology Inc. operates as a subsidiary of Sunplus Technology Company Limited.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.sunplusit.com",
        "market_cap": 8628025344
    },
    "5245.TWO": {
        "short_name": "WISECHIP SEMICONDUCTOR INC",
        "long_name": "WiseChip Semiconductor Inc.",
        "summary": "WiseChip Semiconductor Inc. researches, designs, develops, manufactures, and markets organic light emitting diodes (OLEDs) in Taiwan. Its principal products include OLED displays, full color displays, and monochrome displays; and bendable OLEDs, transparent OLEDs, matrix OLEDs, etc. used in consumer, PC peripheral, industrial, medical, automotive, and communication applications. The company was founded in 2005 and is based in Chu-Nan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Chu-Nan",
        "zipcode": "35053",
        "website": "http://www.wisechip.com.tw",
        "market_cap": 1772606080
    },
    "5262.TWO": {
        "short_name": "GST",
        "long_name": "Gigastone Corporation",
        "summary": "Gigastone Corporation manufactures and sells memory modules, wireless/networking modules and control ICs, and display modules in Taiwan and internationally. Its products include memory cards; card readers; power banks; cables; flash drives and readers; adapters, wireless charging pads, headsets, and travel routers; and WiFi smart batteries. The company was founded in 2010 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.gigastone.com",
        "market_cap": 490762464
    },
    "5269.TW": {
        "short_name": "ASMEDIA TECHNOLOGY INC",
        "long_name": "ASMedia Technology Inc.",
        "summary": "ASMedia Technology Inc. operates as a fabless IC design company. The company offers USB host and device controllers, including USB3.2 Gen1, USB 3.2 Gen2x1, USB 3.2 Gen2x2, and USB4 controllers; PCIe bridge and SATA controllers; and high speed signal switches. It serves motherboard vendors and branded OEMs worldwide. The company was founded in 2004 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "231",
        "website": "http://www.asmedia.com.tw",
        "market_cap": 99334856704
    },
    "5274.TWO": {
        "short_name": "ASPEED TECHNOLOGY INC",
        "long_name": "ASPEED Technology Inc.",
        "summary": "ASPEED Technology Inc. operates as a fabless integrated circuit design company in Taiwan, China, the United States, and internationally. It offers server management product lines; PC and AV extensions; desktop virtualization infrastructures; and Cupola360, a spherical image processor for 360-degree/180-degree cameras. The company was founded in 2004 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30069",
        "website": "http://www.aspeedtech.com",
        "market_cap": 75322523648
    },
    "5299.TWO": {
        "short_name": "EXCELLIANCE MOS CORP",
        "long_name": "Excelliance MOS Corporation",
        "summary": "Excelliance MOS Corporation operates as a power device and IC design company in Taiwan. The company is involved in the power semiconductor process development, as well as power device, IC, and system design activities. Its products include power MOSFETs, Schottky rectifiers, AC/DC and DC/DC power ICs, and LED drivers. The company's products are primarily used to the power system of electronic products, including personal computers, notebooks, pads, monitors, TVs, LED lighting, switching power, and other consumer electronics. Excelliance MOS Corporation was founded in 2008 and is headquartered in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": "30288",
        "website": "http://www.excelliancemos.com",
        "market_cap": 5459608064
    },
    "5302.TWO": {
        "short_name": "SYNTEK SEMICONDUCTOR CO LTD",
        "long_name": "Syntek Semiconductor Co., Ltd.",
        "summary": "Syntek Semiconductor Co., Ltd. operates as a fabless IC design company in Asia. It offers car DVRs/miniDVs, PC/NB camera controllers, and microcontrollers, as well as wireless solutions. The company also develops products for photo capturing and video recording applications. In addition, it offers wireless IP connected multimedia recording solutions; and system-on-chip solutions. The company was founded in 1983 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.stk.com.tw",
        "market_cap": 2478264064
    },
    "5314.TWO": {
        "short_name": "MYSON-CENTURY TECHNOLOGY INC",
        "long_name": "Myson Century, Inc.",
        "summary": "Myson Century, Inc. provides micro-controllers (MCU), automobile IT solutions, fiber solutions, and motor control solutions in Taiwan. The company also offers dual CMOS operational amplifiers, as well as ASIC design services. Its products are used in automobile, motor control and drive, embedded networking, and optical network applications. Myson Century, Inc. was incorporated in 1990 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.myson.com.tw",
        "market_cap": 390000000
    },
    "5344.TWO": {
        "short_name": "VATE TECHNOLOGY CO",
        "long_name": "Vate Technology Co., Ltd.",
        "summary": "Vate Technology Co., Ltd. provides integrated circuit (IC) testing services in Taiwan and China. The company offers IC testing services related to the service of wafer probing and final testing; BURN IN, a test service on electrical components and final products; and LED products. It also provides chip probing test, final test, SLT system module test, CMOS image sensor testing, and back end services, as well as sells LED panel light products. The company was founded in 1988 and is based in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.vate.com.tw",
        "market_cap": 1171843200
    },
    "5471.TW": {
        "short_name": "SONIX TECHNOLOGY CO",
        "long_name": "Sonix Technology Co.,Ltd.",
        "summary": "Sonix Technology Co.,Ltd. designs, develops, manufactures, and sells integrated circuits (ICs) in Taiwan and internationally. The company provides microcontrollers for use in computer peripherals, communication products, remote controllers, intelligent charging, home appliances, car alarm systems, security systems, electronic scales, thermometers, blood pressure monitors, tire gauges, and health equipment. It also offers voice controllers for interactive and educational electronic toys, handheld games, educational learning appliances, and other devices; and a range of video/image controllers. In addition, the company provides wireless video and audio solutions for remote control toys, baby monitors, and wireless home security systems; optical identification device chipsets for education, entertainment, and digital home appliances; multimedia network platforms for consumer Wi-Fi IP cameras makers; and USB controllers for audio. Sonix Technology Co.,Ltd. as founded in 1996 and is headquartered in Zhubei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": "302",
        "website": "http://www.sonix.com.tw",
        "market_cap": 15965102080
    },
    "6103.TWO": {
        "short_name": "AVID ELECTRONICS CORP",
        "long_name": "Avid Electronics Corp.",
        "summary": "Avid Electronics Corp. researches, develops, produces, and markets IC chip series products. The company offers audio-visual related IC products; analog IC products, such as power supply and lighting driver products; and wireless transmission system chips. It also provides external hard disk boxes, driving recorders, Bluetooth speakers, SD memory cards and flash drives, solid state hard disks, wireless charging equipment, air purification intelligent sweeping robots, LCD displays, and WIFI connection products. The company was founded in 1996 and is based in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30075",
        "website": "http://www.avid.com.tw",
        "market_cap": 773586752
    },
    "6104.TWO": {
        "short_name": "GENESYS LOGIC",
        "long_name": "Genesys Logic, Inc.",
        "summary": "Genesys Logic, Inc., a fabless IC design house, provides high-speed interface technologies. The company offers USB hub controllers; storage products, such as card reader controllers; repeater products comprising USB, PCI express, and DP redrivers; image and video products consisting of scanner controllers, fisheye image processors, and PC-cameras; silicon intellectual properties; and USB host charger controllers and other products, as well as provides support services. Its products are used in computing and display applications. The company was founded in 1997 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "231",
        "website": "http://www.genesyslogic.com",
        "market_cap": 5669520896
    },
    "6113.TWO": {
        "short_name": "ASEC INTERNATIONAL CORP",
        "long_name": "ASEC International Corporation",
        "summary": "ASEC International Corporation distributes semiconductor components in the Asia Pacific. Its products are used in PC; Internet; telecommunication; MCU; electronic products; multimedia software/hardware; and energy saving and carbon reduction products, including mobile TV, LCD TV, mobile phone, wireless broadband, internet, MP3, networking and telecom appliances, MPEG encoder/decoder, set-top box, CMOS sensor, adapter, HDTV, IP phone and various multimedia software, LED lighting, and green energy products. The company was formerly known as ASEC Company and changed its name to ASEC International Corporation in 1998. ASEC International Corporation was founded in 1986 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.asec.com.tw",
        "market_cap": 698157056
    },
    "6127.TWO": {
        "short_name": "LEATEC FINE CERAMICS CO",
        "long_name": "LEATEC Fine Ceramics Co., Ltd.",
        "summary": "LEATEC Fine Ceramics Co., Ltd. manufactures and sells chip alumina fine ceramic substrates in Taiwan. It develops high-voltage resistor, variable resistor, array, and chip resistor substrates, as well as chip array substrates. The company also offers fine ceramics, such as alumina, LED, aluminum nitride, laser machining ceramic, and lapping and polishing substrates, as well as ceramic cores and Zirconia toughened alumina; and green energy products, including junction boxes, compact combiner boxes, and tools and other products, as well as PV connectors, cables, and cable assemblies. In addition, it provides car-used electronic substrates comprising LED package, hybrid IC, and sensor substrates. The company was founded in 1991 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "324",
        "website": "http://www.leatec.com.tw",
        "market_cap": 2788463872
    },
    "6129.TWO": {
        "short_name": "PRINCETON TECHNOLOGY CORP",
        "long_name": "Princeton Technology Corporation",
        "summary": "Princeton Technology Corporation operates as a fabless IC design company in Taiwan. It provides IC technology for energy-saving solutions, including a series of energy-saving ballast driver ICs, LED lighting/backlight driver ICs, and brushless DC motor ICs for use in various indoor/outdoor lighting and motor control products. The company also offers display driver, multimedia audio controller, LED driver, motor driver, RF, encoder/decoder, remote control, GPS, I/O expander, power, and PFC controller ICs, as well as ASICs, microcontrollers, and automotive solutions. Its products are used in automotive dash-board and multimedia devices, portable audio players, digital TVs, home audio/video appliances, DSCs, DSLRs, monitoring cameras, and car security systems. The company was founded in 1986 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23145",
        "website": "http://www.princeton.com.tw",
        "market_cap": 7120145920
    },
    "6130.TWO": {
        "short_name": "XINGBAO INTERNATIONAL CO LTD",
        "long_name": "Singbao International Co. Ltd",
        "summary": "Singbao International Co. Ltd engages in the wholesale of Chinese medicines, western medicines, medical equipment, slimming products, and cosmetics in Taiwan and Asia. It is also involved in the research, development, production, and sale of wireless communication integrated circuits; and the operation of various beauty salons, as well as offers other services. The company was founded in 1994 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10571",
        "website": "http://www.genomeib.com",
        "market_cap": 566400000
    },
    "6138.TWO": {
        "short_name": "ANPEC ELECTRONICS CORP",
        "long_name": "Anpec Electronics Corporation",
        "summary": "Anpec Electronics Corporation designs power ICs, mixed signal ICs, and power discrete devices in Taiwan. Its primary products include power management ICs, audio amplifier ICs, LCD controller/driver ICs, hall effect ICs, and power MOSFETs. The company also provides switching regulators, lighting and display products, linear regulators, switches, LCD bias convertors, battery powered systems, DVR powered systems, audio products, analog to digital converters, battery management solutions, voltage supervisors, and motor drivers. Its products are used in various applications, including motherboards, VGA cards, notebooks, mobiles, PND systems, LCD TVs, LCD panels, fans, inverters, WLAN cards, and ATX power supply products, as well as in communication IC and micro-controller applications. The company was founded in 1997 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": null,
        "website": "http://www.anpec.com.tw",
        "market_cap": 10426224640
    },
    "6147.TWO": {
        "short_name": "CHIPBOND TECHNOLOGY CORP",
        "long_name": "Chipbond Technology Corporation",
        "summary": "Chipbond Technology Corporation, together with its subsidiaries, provides services for backend assembly processing of LCD driver integrated circuits (ICs) in Taiwan, the United States, and internationally. The company offers turnkey services, which comprise bumping manufacturing services, including gold, solder, and copper bumping services; redistribution layer services; wafer surface processing services, such as back side metal and dielectric layer coating process services; wafer grinding, dicing, and picking and placing services; package and testing services comprising driver and non-driver IC testing, driver IC package, and wafer level chip scale packaging services; final inspection and failure analysis services; and chip tray design and manufacturing services. It also invests in, develops, manufactures, and sells electronic components, as well as tape automated bonding, tape carrier, and others. Chipbond Technology Corporation was founded in 1997 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.chipbond.com.tw",
        "market_cap": 47409524736
    },
    "6168.TW": {
        "short_name": "HARVATEK CORP",
        "long_name": "Harvatek Corporation",
        "summary": "Harvatek Corporation designs, manufactures, tests, exports, and sells semiconductor chips and LEDs in Taiwan and internationally. The company provides visible LED products, such as PCB, lead frame, COX, lamp, and PLCC, as well as digital displays; infrared LED products, which include emitters, photo transistors, photo diodes, and interrupters; UVC LED products comprising water tank types, water flow types, and air puri products; and OD CSP modules/self-made equipment. Its products are used in home appliances, gaming accessories, optical touch screens, mobile devices, wearables, and security measures. The company serves OEM manufacturers, trade retailers, and design houses. Harvatek Corporation was founded in 1995 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30094",
        "website": "http://www.harvatek.com",
        "market_cap": 4658539008
    },
    "6173.TWO": {
        "short_name": "PROSPERITY DIELECTRICS CO",
        "long_name": "Prosperity Dielectrics Co., Ltd.",
        "summary": "Prosperity Dielectrics Co., Ltd. manufactures and exports ceramic dielectric powders and multilayer ceramic chip capacitors in Taiwan, the United States, Europe, and the Asia-Pacific. Its products include ceramic dielectric powders, disc type semi-conductive capacitor elements, multilayer ceramic chip capacitors, chip resistors, diodes, inductors, and coils. The company also provides SBL elements. Its products are used in power, communications, and consumer applications; and medical, military, and measurement equipment, as well as the automotive sector. Prosperity Dielectrics Co., Ltd. was founded in 1990 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33860",
        "website": "http://www.pdc.com.tw",
        "market_cap": 10528799744
    },
    "6198.TWO": {
        "short_name": "AVERLOGIC TECHNOLO",
        "long_name": "AverLogic Technologies, Corp.",
        "summary": "AverLogic Technologies, Corp., a fabless semiconductor company, provides application specific memory and video processing circuits worldwide. It offers video frame and line FIFOs, video surveillance controller ICs, LCD display controller ICs, video format conversion ICs, video decoder and ADC ICs, and H.264 video streaming SOCs. The company provides H.264 video streaming, video conversion, LCD display, multiple video display, video decoding, and FIFO memory solutions. It offers its products through a network of representatives and distributors. The company was founded in 1996 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.averlogic.com.tw",
        "market_cap": 285538496
    },
    "6202.TW": {
        "short_name": "HOLTEK SEMICONDUCTOR INC",
        "long_name": "Holtek Semiconductor Inc.",
        "summary": "Holtek Semiconductor Inc. researches, develops, produces, manufactures, and sells integrated circuits. The company provides a range of general purpose and specialized types of microcontrollers for use in the areas of voice, communication, computer peripheral, household appliance, medical equipment, automotive, security, etc.; and power management devices, LCD and LED drive/control chips, ultra-high resolution fingerprint identification sensors, various sensor modules, and other peripheral devices. It also offers MCU that are used for general purpose, LCD display, 1.8V~5.5V, USB, motor control, OPA, health and measurement, security and safety, touch, voice and music, battery and power management, and special purpose; and wireless and communication devices, display drivers, modules, EEPROM memory, and analog and video devices. The company was founded in 1998 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.holtek.com.tw",
        "market_cap": 19224279040
    },
    "6233.TWO": {
        "short_name": "PROLIFIC TECH INC",
        "long_name": "Prolific Technology Inc.",
        "summary": "Prolific Technology Inc. operates as an IC design company and ASIC design service provider for USB smart I/O, intelligent green energy saving, and mixed-mode hall sensor solutions. The company offers IC and SOC solutions for USB serial/parallel converters, USB storage products, brushless motor drivers, hall sensors, power meters, and MEMS motion sensing products. It sells its products in Taiwan, Mainland China, Japan, Korea, Canada, and the United States. The company was founded in 1997 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "115",
        "website": "http://www.prolific.com.tw",
        "market_cap": 2925667584
    },
    "6261.TWO": {
        "short_name": "YOUNGTEK ELECTRONICS CORPORATIO",
        "long_name": "Youngtek Electronics Corporation",
        "summary": "Youngtek Electronics Corporation provides semiconductor back-end foundry services in Taiwan. The company engages in wafer testing, wafer grinding and cutting and die picking, IC product testing, special substrate cutting, test program development, platform conversion, engineering support, and valet shipping; and AOI automatic optical inspection of LED dies and VCSEL components, die picking inspection, visual inspection, and other post-process OEM activities. It also offers IC sorting and bonding; WLCSP die sorting packaging; label flip-chip binding; and die and LED bonding machines. The company was founded in 1991 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": null,
        "website": "http://www.ytec.com.tw",
        "market_cap": 10228441088
    },
    "6291.TWO": {
        "short_name": "ANALOG INTEGRATIONS CORPORATION",
        "long_name": "Analog Integrations Corporation",
        "summary": "Analog Integrations Corporation, a fabless IC company, designs, manufactures, tests, and markets analog integrated circuits in Taiwan and internationally. The company offers power conversion products, including low and ultra-low dropout linear regulators, DDR regulators, and voltage references; DC/DC converters for high power and portable applications; and LED backlights and lighting solutions. It also provides power management products, such as USB and regulatory USB power switches, and bare-bone USB switches; supervisory products; and NiMH/NiCd battery chargers, Li-ion battery protection products, and high current drivers. Its products are used in 3C applications in the areas of LCD TV, DSC, mobile phone, MP3, PMP, etc. Analog Integrations Corporation was founded in 1992 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.analog.com.tw",
        "market_cap": 734400000
    },
    "6411.TWO": {
        "short_name": "AMAZING MICROELECTRONIC CORP",
        "long_name": "Amazing Microelectronic Corp.",
        "summary": "Amazing Microelectronic Corp. provides electrostatic discharge (ESD) protection related solutions in Taiwan. It offers ESD solutions for use in industrial, automotive, and LCM panel, as well as IPC, and DVR and medical electronics applications; and EMI filters for use in LCD/camera display, multimedia card/secure digital memory card, and keypad products of mobile phones and hand held portable devices. It also provides analog switches for video, LAN, Bus, and USB applications; HDMI re-drivers and switches; and RS485/RS232 interface IC solutions for industrial and medical process control, automobile electronics, monitoring system, and building automation networks. The company was incorporated in 2006 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "235",
        "website": "http://www.amazingic.com.tw",
        "market_cap": 11614383104
    },
    "6435.TWO": {
        "short_name": "SINOPOWER SEMICONDUCTOR INC",
        "long_name": "Sinopower Semiconductor, Inc.",
        "summary": "Sinopower Semiconductor, Inc. operates as a fabless IC design company in Taiwan. The company designs, markets, and sells power discrete devices, including MOSFET and IGBT; and high voltage power ICs. The company's products are used in various applications, such as computers comprising PCs and servers, as well as power suppliers, communication equipment, handheld devices, consumer products, industrials, etc. Sinopower Semiconductor, Inc. was founded in 2008 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30078",
        "website": "http://www.sinopowersemi.com",
        "market_cap": 3764368896
    },
    "6441.TWO": {
        "short_name": "IBASE GAMING INC",
        "long_name": "Ibase Gaming Inc.",
        "summary": "Ibase Gaming Inc. designs, develops, manufactures, and sells gaming systems worldwide. It offers gaming solutions for lottery terminals, kiosks, and casino slots. The company also provides OEM and turnkey ODM solutions for terminals, cabinets, class leading PC hardware, and gaming support peripherals. Ibase Gaming Inc. was founded in 2011 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "221",
        "website": "http://www.ibasegaming.com",
        "market_cap": 3477824512
    },
    "6457.TWO": {
        "short_name": "HYCON TECHNOLOGY CORPORATION",
        "long_name": "Hycon Technology Corporation",
        "summary": "Hycon Technology Corporation designs, produces, and sells mixed signal microcontroller units, and battery management and touch panel ICs in Taiwan and China. The company offers battery management ICs, such as single cell and multi-cell, and secondary protectors, as well as balance ICs and gas gauges; mixed signal microcontroller units, including microcontroller units, data converters, digital multi-function meters, AC impedance measurement, sensor signal conditioners, low-dropout voltage regulators, LCD controllers and drivers, and application specific standard parts; and capacitive touch ICs. Its products are used in no-switch electronic scale, blood pressure monitor, PIR detector, digital multi-meter, and touch panel applications. The company provides its products under the HYCON brand name. Hycon Technology Corporation was founded in 2007 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11164",
        "website": "http://www.hycontek.com",
        "market_cap": 4836510208
    },
    "6488.TWO": {
        "short_name": "GLOBALWAFERS CO LTD",
        "long_name": "GlobalWafers Co., Ltd.",
        "summary": "GlobalWafers Co., Ltd., together with its subsidiaries, researches, designs, develops, and manufactures, semiconductor ingots and wafers in Taiwan and internationally. It offers silicon wafer and ingots; and annealed, diffusion, epitaxial, compound, polished, and SOI wafers. The company was founded in 2011 and is based in Hsinchu, Taiwan. GlobalWafers Co., Ltd. operates as a subsidiary of Sino-American Silicon Products Inc.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30075",
        "website": "http://www.sas-globalwafers.com",
        "market_cap": 379961901056
    },
    "6494.TWO": {
        "short_name": "NYQUEST TECHNOLOGY CO LTD",
        "long_name": "Nyquest Technology Co., Ltd.",
        "summary": "Nyquest Technology Co., Ltd. researches, designs, and sells integrated circuits (ICs). The company provides voice synthesizer ICs, 4-bit microcontrollers with voice/MIDI products, 8-bit microcontrollers, motor drivers, and other products. It offers LED control and drive, speech, and multi-channel speech/melody ICs; 8-Bit OTP MCU for home appliances; 8-bit MCU with LCD drivers; audio power amplifier ICs, low power LCD driver IC, high power motor driver ICs, 4-bit MCU with touch-keys and LED controllers, and 4-Bit MCU with universal remote controllers; and 32-bit MCUs. In addition, the company provides hardware and software development tools. The company offers its products through agents in Taiwan, Japan, Mainland China, Europe, Hong Kong, and the United States. Nyquest Technology Co., Ltd. was founded in 2006 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30059",
        "website": "http://www.nyquest.com.tw",
        "market_cap": 4181700096
    },
    "6515.TW": {
        "short_name": "WINWAY TECHNOLOGY CO LTD",
        "long_name": "WinWay Technology Co., Ltd.",
        "summary": "WinWay Technology Co., Ltd. manufactures and supplies integrated circuit testing interfaces worldwide. Its products include high performance heat sinks, high performance test sockets, thermal control systems, changeover kits, direct docking probe cards, burn-in sockets, and contact element products. It also provides technical support services. The company serves semiconductor, opto-electronic, and IT industries. WinWay Technology Co., Ltd. was founded in 2001 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "81156",
        "website": "http://www.winwayglobal.com",
        "market_cap": 9782547456
    },
    "6531.TW": {
        "short_name": "AP MEMORY TECHNOLOGY CORPORATIO",
        "long_name": "AP Memory Technology Corporation",
        "summary": "AP Memory Technology Corporation operates as a fabless IC design and marketing company in Taiwan and internationally. It offers low power DRAM, PSRAM, and IoT RAM used in smart audio and video, waerables, Internet of Things, cellular and connectivity, automotive, AI, and IP service applications. The company was founded in 2011 and is headquartered in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": "30288",
        "website": "http://www.apmemory.com",
        "market_cap": 48674234368
    },
    "6533.TW": {
        "short_name": "ANDES TECHNOLOGY CORPORATION",
        "long_name": "Andes Technology Corporation",
        "summary": "Andes Technology Corporation engages in the research and developing, designing, manufacturing, and marketing of embedded processor intellectual property (IP), related hardware/software developing platform, and toolchains worldwide. The company offers AndeStar Architecture, a patented 32-bit/64-bit RISC-style CPU architecture; AndesCore, a series of 32-bit/64-bit CPUs for use in embedded applications; Andes Custom Extension that allows designers design their own CPU instructions on the already performance optimized AndesCore processors; and AndeShape Platform that contains three categories of products for system development with AndesCore processors. It also provides AndeSight IDE, an eclipse-based IDE that provides solutions to develop embedded applications; and AndeSoft SW Stack, which provides a set of software components, such as real-time operating system, Linux kernel and drivers, libraries, middleware, and application frameworks. The company offers RISC-V Solutions; network security solution; and replacement solutions for embedded applications, as well as licensing CPU IP and provides related services. Andes Technology Corporation was founded in 2005 is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.andestech.com",
        "market_cap": 19278252032
    },
    "6548.TWO": {
        "short_name": "CHANG WAH TECHNOLOGY CO LTD",
        "long_name": "Chang Wah Technology Co., Ltd.",
        "summary": "Chang Wah Technology Co., Ltd. manufactures and sells LED lead frame and molding compound materials in Taiwan. It offers LED and IC products, and premolds. The company was founded in 2009 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "811",
        "website": "http://www.cwtcglobal.com",
        "market_cap": 22796408832
    },
    "6552.TW": {
        "short_name": "JMC ELECTRONICS CO LTD",
        "long_name": "JMC Electronics Co., Ltd.",
        "summary": "JMC Electronics Co., Ltd. produces reel to reel chip on film that is applied to LCD in Taiwan. The company was formerly known as Sumiko Electronics Taiwan Co., Ltd. and changed its name to JMC Electronics Co., Ltd. in 2014. JMC Electronics Co., Ltd. was founded in 1973 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "811",
        "website": "http://www.jmct.com.tw",
        "market_cap": 4291100160
    },
    "6568.TWO": {
        "short_name": "RAFAEL MICROELECTRONICS INC",
        "long_name": "Rafael Microelectronics, Inc.",
        "summary": "Rafael Microelectronics, Inc. manufactures and sells radio frequency (RF) integrated circuits. It offers IoT connectivity products, terrestrial/cable/satellite set-top box receivers, satellite broadcast reception and distribution systems, optical communication systems, and TV receivers, as well as provides RF IP and design services. The company offers its products in Taiwan, Europe, North America, China, Korea and Japan. Rafael Microelectronics, Inc. was founded in 2006 and is headquartered in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": "30264",
        "website": "http://www.rafaelmicro.com",
        "market_cap": 3584775168
    },
    "6588.TWO": {
        "short_name": "EAST TENDER OPTOELECTRONICS(TW)",
        "long_name": "East Tender Optoelectronics Corporation",
        "summary": "East Tender Optoelectronics Corporation manufactures and sells optical thin film filters in Taiwan and internationally. It offers narrowband filter chips for use in the telecom industry applications, as well as custom narrowband filters for non telecom applications. The company also provides broadband filter chips, including banded skip filter chips, filter components for FTTx, CWDM filter components, and gain flattening filters; and customized products, such as coated WDM on pigtail for hi isolation application, IR-cut filters for digital still cameras and CCM applications, and R/G/B filters for digital lighting processing projectors. East Tender Optoelectronics Corporation was founded in 2000 and is based in Yilan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Yilan City",
        "zipcode": null,
        "website": "http://www.east-tender.com",
        "market_cap": 1377719936
    },
    "6594.TWO": {
        "short_name": "ALCORLINK CORP",
        "long_name": "Alcorlink Corp.",
        "summary": "Alcorlink Corp., a fabless IC design company, provides device controller and image application solutions primarily in Taiwan. It offers I/O product/image application/others, which include flash and smart card readers, USB cameras, intelligent storage solutions, hub controllers, and MFi products. The company was founded in 2015 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "115",
        "website": "http://www.alcorlink.com",
        "market_cap": 809122112
    },
    "6640.TWO": {
        "short_name": "GALLANT MICRO MACHINING CO LTD",
        "long_name": "Gallant Micro. Machining Co., LTD.",
        "summary": "Gallant Micro. Machining Co., LTD. designs, manufactures, and sells front-end and back-end packaging and inspection equipment for manufacturing semiconductors in Taiwan, Hong Kong, and China. Its principal products include semiconductor process equipment, semiconductor detecting equipment, laser application equipment, precision machineries, and precision molds. The company was founded in 1995 and is based in New Taipei City, Taiwan. Gallant Micro. Machining Co., LTD. operates as a subsidiary of Gallant Precision Machining Co., Ltd.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23679",
        "website": "http://www.gpmcorp.com.tw/en-global/about/index/28",
        "market_cap": 2433063680
    },
    "6642.TWO": {
        "short_name": "FUZETEC TECHNOLOGY CO LTD",
        "long_name": "Fuzetec Technology Co., Ltd.",
        "summary": "Fuzetec Technology Co., Ltd. designs, manufactures, and sells circuit protection solutions for electronic and electrical industries worldwide. The company offers radial leaded PPTC, surface mount polymer PTC, battery strap polymer PTC, and low Rho SMD polymer resettable fuses, as well as PPTC chips and discs. Its products are used in various applications, including telecommunications, networks, Smart phones, tablet and notebook PCs, computers and peripherals, automotives, instrumentation and industrial controls, power supplies, consumer electronics, primary and secondary batteries, etc. The company was founded in 1997 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "24890",
        "website": "http://www.fuzetec.com",
        "market_cap": 2040973952
    },
    "6643.TWO": {
        "short_name": "M31 TECHNOLOGY CORPORATION",
        "long_name": "M31 Technology Corporation",
        "summary": "M31 Technology Corporation operates as a professional silicon intellectual property (IP) provider. It offers standard cell library, general purpose I/O library, special I/O, high level ESD cell, memory compiler, high speed interface IP, Analog IP, and other solutions. The company was founded in 2011 and is headquartered in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": "302",
        "website": "http://www.m31tech.com",
        "market_cap": 12333925376
    },
    "6679.TWO": {
        "short_name": "ZILLTEK TECHNOLOGY CORP",
        "long_name": "Zilltek Technology Corp.",
        "summary": "Zilltek Technology Corp. operates as an analog and mixed signal IC design house in Taiwan. It designs and develops micro-electromechanical (MEMS) heterogeneous integrated circuits. The company offers analog, digital, and optics MEMS microphones; digital barometric pressure and temperature sensors; audio amplifiers; DC/DC converters; LDOs; and touch screen controllers. Its products are used in PCs, wearable devices, and TVs applications. The company was founded in 2005 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30078",
        "website": "http://www.zilltek.com",
        "market_cap": 14155953152
    },
    "6693.TWO": {
        "short_name": "inergy",
        "long_name": "Inergy Technology Inc.",
        "summary": "Inergy Technology Inc. engages in the development and sale of integrated power components that are optimized for system applications. It also provides integrated power modules for motor drives and ceiling fan air cleaners. The company was founded in 2007 and is headquartered in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": "30288",
        "website": "http://www.inergy.com.tw",
        "market_cap": 3299968000
    },
    "6695.TWO": {
        "short_name": "iCatchtek",
        "long_name": "iCatch Technology, Inc.",
        "summary": "iCatch Technology, Inc. designs and sells fabless IC. The company offers automotive grade sensing camera module image signal processor for use in ADAS front cameras, intelligent rear view cameras, blind spot detection, and driver monitoring systems; and an automotive grade SoC for use in digital video recorders, and camera and driver monitoring systems. It also provides SoC for consumer imaging devices for use in digital still, action, home security, body worn, trail, 3D sensing, surveillance, and VR cameras, as well as digital video recorders, factory automation, automated stores, and home appliances. The company was founded in 2009 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.icatchtek.com",
        "market_cap": 3329296384
    },
    "6716.TWO": {
        "short_name": "PADAUK TECHNOLOGY CO LTD",
        "long_name": "PADAUK Technology Co., Ltd.",
        "summary": "PADAUK Technology Co., Ltd. develops, manufactures, and sells microcontrollers. Its products are used in interactive smart toys, remote control appliances, smart household appliances, industrial grade chips, and high-efficiency brushless DC motors. The company was founded in 2005 and is based in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300042",
        "website": "http://www.padauk.com.tw",
        "market_cap": 3321806080
    },
    "6719.TWO": {
        "short_name": "uPI",
        "long_name": "uPI Semiconductor Corp.",
        "summary": "uPI Semiconductor Corp., an IC design company, designs and manufactures analog and mixed-signal power management solutions in electronic systems in Taiwan and internationally. It offers Power Management products, such as DC/DC buck controllers and converters, DC/DC boost converters, power device drivers, low dropout regulators, power switch ICs, LED driver ICs, charging ICs, and voltage and current consoles; Battery Management products, including PTIC and charger ICs; and low, medium, and high voltage power MOSFET products. The company also provides application and interface, ultra speed, tiny package speed, high surge, and high voltage TVS products; OP-amplifiers; bio sensors; and GaN solutions. uPI Semiconductor Corp. was founded in 2005 and is headquartered in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": "302",
        "website": "http://www.upi-semi.com",
        "market_cap": 16152527872
    },
    "6770.TWO": {
        "short_name": "PSMC",
        "long_name": "Powerchip Semiconductor Manufacturing Corp.",
        "summary": "Powerchip Semiconductor Manufacturing Corporation provides chip design and manufacturing services. It offers foundry, design, overhaul, manufacturing, and memory wafer testing services. The company was formerly known as Maxchip Electronics Corp and changed its name to Powerchip Semiconductor Manufacturing Corporation in September 2018. Powerchip Semiconductor Manufacturing Corporation was founded in 2008 and is headquartered in Hsinchu, Taiwan. Powerchip Semiconductor Manufacturing Corp. operates as a subsidiary of Powerchip Technology Corporation.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.powerchip.com",
        "market_cap": 214317957120
    },
    "6786.TWO": {
        "short_name": "iSTART",
        "long_name": "iSTART-TEK INC.",
        "summary": "Istart-Tek Inc. provides memory testing and repairing solutions for SoC designers worldwide. The company is based in Zhubei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei City",
        "zipcode": "30288",
        "website": "http://www.istart-tek.com",
        "market_cap": 4023851520
    },
    "6789.TWO": {
        "short_name": "VisEra",
        "long_name": "VisEra Technologies Company Ltd.",
        "summary": "VisEra Technologies Company Limited manufactures and sells electronic spare parts in Taiwan. It also researches, develops, designs, manufactures, sells, packages, and tests color filters. In addition, the company offers image sensor foundry solutions, which include CMOS image sensor that performs the role of an electronic film in digital photography equipment; and wafer level testing and wafer level optical thin film services. Its CMOS image sensor products are used in various areas, such as digital cameras, camera phones, web cameras, notebooks, security devices, automobiles, and miniature imaging devices used in medical applications. The company was founded in 2003 and is based in Hsinchu City, Taiwan. VisEra Technologies Company Limited is a subsidiary of Taiwan Semiconductor Manufacturing Company Limited.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30078",
        "website": "http://www.viseratech.com",
        "market_cap": 119227146240
    },
    "6LD1.F": {
        "short_name": "SEMILEDS CORP.  DL-,01",
        "long_name": "SemiLEDs Corporation",
        "summary": "SemiLEDs Corporation develops, manufactures, and sells light emitting diode (LED) chips, LED components, and LED modules and systems in the United States, Taiwan, the Netherlands, Germany, Japan, Ireland, and internationally. The company also sells enhanced vertical, LED product series in blue, white, green, and UV; LED chips to packagers or distributors; and lighting products primarily to original design manufacturers of lighting products and the end-users of lighting devices, as well as packages and sells its LED chips into LED components to distributors. Its products are used for general lighting applications, including commercial, industrial, and residential lighting; and specialty industrial applications, such as ultraviolet or UV, curing of polymers, LED light therapy in medical/cosmetic applications, counterfeit detection, LED lighting for horticulture applications, architectural lighting, and entertainment lighting. SemiLEDs Corporation was founded in 2005 and is headquartered in Chunan, Taiwan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Taiwan",
        "state": null,
        "city": "Chu-Nan",
        "zipcode": "350",
        "website": "http://www.semileds.com",
        "market_cap": 92777688
    },
    "8016.TW": {
        "short_name": "SITRONIX TECHNOLOGY CORP",
        "long_name": "Sitronix Technology Corporation",
        "summary": "Sitronix Technology Corporation, a fabless semiconductor company, offers display driver integrated circuits (ICs) and memory for entry-level mobile phones, industrial displays, and automotive systems. The company offers mobile display driver ICs, industrial display driver ICs, automotive display driver ICs, projected capacitive touch controller ICs, and medium-size TFT-LCD driver ICs, as well as alternator regulators. Sitronix Technology Corporation was incorporated in 1992 and is headquartered in Zhubei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": "302",
        "website": "http://www.sitronix.com.tw",
        "market_cap": 31475894272
    },
    "8091.TWO": {
        "short_name": "FEEDBACK TECHNOLOGY CORP",
        "long_name": "Feedback Technology Corp.",
        "summary": "Feedback Technology Corp. manufactures and sells components for semiconductor, LCD, LED, and vacuum industries in Taiwan. The company offers helium leak detectors, MV multi-traps, pureron gas filters, SiC coated susceptors, and silicon boat for vertical furnace; and high precision matching and surface treatment products; as well as provides repair and overhaul services. The company was founded in 1991 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30091",
        "website": "http://www.feedback.com.tw",
        "market_cap": 2868231424
    },
    "8096.TWO": {
        "short_name": "COASIA ELECTRONICS CORP",
        "long_name": "CoAsia Electronics Corp.",
        "summary": "CoAsia Electronics Corp. provides components for mobile multimedia in Taiwan and internationally. It offers CMOS, 3D, and automotive image sensors; processors, PMICs, and NFC components; memory solutions; mobile and IT AMOLEDs; and balanced membrane drivers, chip solutions, driver IC's, and battery protection circuit packages, as well as micro controller units for remote controllers, small home application, and LCD applications. The company was formerly known as CoAsia Microelectronics Corp. The company was founded in 1997 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "115",
        "website": "http://www.coasiaelec.com",
        "market_cap": 1780199936
    },
    "8150.TW": {
        "short_name": "CHIPMOS TECHNOLOGIES INC",
        "long_name": "ChipMOS TECHNOLOGIES INC.",
        "summary": "ChipMOS TECHNOLOGIES INC. researches, develops, manufactures, and sells high-integration and high-precision integrated circuits, and related assembly and testing services in Taiwan, Japan, Singapore, and internationally. The company operates through Testing; Assembly; Testing and Assembly for LCD, OLED and other Display Panel Driver Semiconductors; Bumping; and Other segments. It provides a range of back-end assembly and test services, including engineering test, wafer probing and final test of memory and logic/mixed-signal semiconductors, as well as leadframe-and organic substrate-based package assembly services for memory and logic/mixed-signal semiconductors; and gold bumping, reel to reel assembly, and test services for LCD and other flat-panel display driver semiconductors. The company's semiconductors are used in personal computers; graphics applications, such as game consoles; communications equipment; mobile products comprising cellular handsets, tablets, and consumer electronic products; and automotive/industry and display applications, such as display panels. ChipMOS TECHNOLOGIES INC. was incorporated in 1997 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": null,
        "website": "http://www.chipmos.com",
        "market_cap": 34980241408
    },
    "8271.TW": {
        "short_name": "APACER TECHNOLOGY INC",
        "long_name": "Apacer Technology Inc.",
        "summary": "Apacer Technology Inc. researches, designs, develops, manufactures, and markets industrial solid-state drives (SSD), consumer digital products, flash memory cards, and memory modules in Taiwan, Hong Kong, Japan, Mainland China, the Americas, and internationally. It offers industrial solutions, such as SSDs, memory modules, and storage devices for network communication, military, medical, vehicular, and other applications; custom water-cooled PC case, AIO CPU liquid cooler, gaming memory, and SSD products; gaming products and peripherals; and consumer products, including SSDs, memory modules, memory cards, USB flash drives, portable hard drives, and other computer and mobile peripherals, as well as designs, integrates, and implements IoT environment control systems; and optical equipment sales and OEM services. The company serves distributors, equipment manufacturers, and retailers. Apacer Technology Inc. was incorporated in 1997 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "236",
        "website": "http://www.apacer.com",
        "market_cap": 4621128192
    },
    "8277.TWO": {
        "short_name": "UNIFOSA CORP",
        "long_name": "Unifosa Corp.",
        "summary": "Unifosa Corp. operates as a memory modules ODM/OEM company in Taiwan. The company offers notebook and niche product memory modules, including DRAM and FLASH memories. It also provides storage products and polymer films, such as stretch hood, synthetic paper, PE and PP separators, multi-layer separator, and PE film products. The company was founded in 1994 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11492",
        "website": "http://www.unifosa.com.tw",
        "market_cap": 1264477440
    },
    "ASX": {
        "short_name": "ASE Technology Holding Co., Ltd",
        "long_name": "ASE Technology Holding Co., Ltd.",
        "summary": "ASE Technology Holding Co., Ltd. provides a range of semiconductors packaging and testing, and electronic manufacturing services in the United States, Taiwan, rest of Asia, Europe, and internationally. The company offers packaging services, including flip chip ball grid array (BGA), flip chip chip scale package (CSP), advanced chip scale packages, quad flat packages, low profile and thin quad flat packages, bump chip carrier and quad flat no-lead (QFN) packages, advanced QFN packages, plastic BGAs, and 3D chip packages; stacked die solutions in various package types; and copper and silver wire bonding solutions. It also provides advanced packages, such as flip chip BGA; heat-spreader FCBGA; flip-chip CSP; hybrid FCCSP; flip chip package in package and package on package (POP); advanced single sided substrate; high-bandwidth POP; fan-out wafer-level packaging; SESUB; and 2.5D silicon interposer. In addition, the company offers IC wire bonding packages; system-in-package products (SiP) and modules; and interconnect materials, as well as assembles automotive electronic products. Further, it provides a range of semiconductor testing services, including front-end engineering testing, wafer probing, logic/mixed-signal/RF module and SiP/MEMS/discrete final testing, and other test-related services, as well as drop shipment services. Additionally, the company develops, constructs, sells, leases, and manages real estate properties; produces substrates; offers information software, equipment leasing, financing, investment advisory, and warehousing management services; processes and sells computer and communication peripherals, electronic components, telecommunications equipment, and motherboards; and imports and exports goods and technology. ASE Technology Holding Co., Ltd. was incorporated in 1984 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "811",
        "website": "http://www.aseglobal.com",
        "market_cap": 16236947456
    },
    "CPIA.F": {
        "short_name": "CHIPMOS TECH.ADR 20 TA10",
        "long_name": "ChipMOS TECHNOLOGIES INC.",
        "summary": "ChipMOS TECHNOLOGIES INC. researches, develops, manufactures, and sells high integration and high precision integrated circuits, and related assembly and testing services. The company operates through Testing; Assembly; Testing and Assembly for Liquid Crystal Display and Other Flat-Panel Display Driver Semiconductors; and Bumping segments. It provides a range of back-end assembly and test services, including engineering test, wafer probing and final test of memory and logic/mixed-signal semiconductors, as well as leadframe-and organic substrate-based package assembly services for memory and logic/mixed-signal semiconductors; and gold bumping, reel to reel assembly, and test services for LCD and other flat-panel display driver semiconductors. The company's semiconductors are used in personal computers; graphics applications, such as game consoles; communications equipment; mobile products comprising cellular handsets, tablets, and consumer electronic products; and automotive/industry and display applications, such as display panels. It serves customers in Taiwan, Japan, Singapore, and internationally. The company was founded in 1997 and is headquartered in Hsinchu, Taiwan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": null,
        "website": "http://www.chipmos.com",
        "market_cap": 969494336
    },
    "H6Q.F": {
        "short_name": "HIMAX TECH.INC. ADR 1",
        "long_name": "Himax Technologies, Inc.",
        "summary": "Himax Technologies, Inc., a fabless semiconductor company, provides display imaging processing technologies in China, Taiwan, the Philippines, Korea, Japan, Europe, and the United States. The company operates through two segments, Driver IC and Non-Driver Products. It offers display driver integrated circuits (ICs) and timing controllers that are used in televisions, laptops, monitors, mobile phones, tablets, automotive, digital cameras, car navigation, virtual reality devices, and other consumer electronic devices. The company also designs and provides controllers for touch sensor displays; in-cell touch and display driver integration single-chip solutions; light-emitting diode driver and power management ICs; and liquid crystal on silicon micro-displays for augmented reality (AR) devices and head-up displays for automotive industry. In addition, it offers complementary metal oxide semiconductor image sensors and wafer level optics for AR devices, 3D sensing, machine vision, and ultra-low power smart sensing, which are used in various applications, such as mobile phone, tablet, laptop, TV, PC camera, automobile, security, medical devices, home appliance, and Internet of Things. The company markets its display drivers and display-related products to panel manufacturers, agents or distributors, module manufacturers, and assembly houses; and non-driver products to camera module manufacturers, optical engine manufacturers, and television system manufacturers. Himax Technologies, Inc. was founded in 2001 and is headquartered in Tainan City, Taiwan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "74148",
        "website": "http://www.himax.com.tw",
        "market_cap": 1992731392
    },
    "HIMX": {
        "short_name": "Himax Technologies, Inc.",
        "long_name": "Himax Technologies, Inc.",
        "summary": "Himax Technologies, Inc., a fabless semiconductor company, provides display imaging processing technologies in China, Taiwan, the Philippines, Korea, Japan, Europe, and the United States. The company operates through two segments, Driver IC and Non-Driver Products. It offers display driver integrated circuits (ICs) and timing controllers that are used in televisions, laptops, monitors, mobile phones, tablets, automotive, digital cameras, car navigation, virtual reality devices, and other consumer electronic devices. The company also designs and provides controllers for touch sensor displays; in-cell touch and display driver integration single-chip solutions; light-emitting diode driver and power management ICs; and liquid crystal on silicon micro-displays for augmented reality (AR) devices and head-up displays for automotive industry. In addition, it offers complementary metal oxide semiconductor image sensors and wafer level optics for AR devices, 3D sensing, machine vision, and ultra-low power smart sensing, which are used in various applications, such as mobile phone, tablet, laptop, TV, PC camera, automobile, security, medical devices, home appliance, and Internet of Things. The company markets its display drivers and display-related products to panel manufacturers, agents or distributors, module manufacturers, and assembly houses; and non-driver products to camera module manufacturers, optical engine manufacturers, and television system manufacturers. Himax Technologies, Inc. was founded in 2001 and is headquartered in Tainan City, Taiwan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "74148",
        "website": "http://www.himax.com.tw",
        "market_cap": 2238784256
    },
    "IMOS": {
        "short_name": "ChipMOS TECHNOLOGIES INC.",
        "long_name": "ChipMOS TECHNOLOGIES INC.",
        "summary": "ChipMOS TECHNOLOGIES INC. researches, develops, manufactures, and sells high integration and high precision integrated circuits, and related assembly and testing services. The company operates through Testing; Assembly; Testing and Assembly for Liquid Crystal Display and Other Flat-Panel Display Driver Semiconductors; and Bumping segments. It provides a range of back-end assembly and test services, including engineering test, wafer probing and final test of memory and logic/mixed-signal semiconductors, as well as leadframe-and organic substrate-based package assembly services for memory and logic/mixed-signal semiconductors; and gold bumping, reel to reel assembly, and test services for LCD and other flat-panel display driver semiconductors. The company's semiconductors are used in personal computers; graphics applications, such as game consoles; communications equipment; mobile products comprising cellular handsets, tablets, and consumer electronic products; and automotive/industry and display applications, such as display panels. It serves customers in Taiwan, Japan, Singapore, and internationally. The company was founded in 1997 and is headquartered in Hsinchu, Taiwan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": null,
        "website": "http://www.chipmos.com",
        "market_cap": 1139767808
    },
    "LEDS": {
        "short_name": "SemiLEDS Corporation",
        "long_name": "SemiLEDs Corporation",
        "summary": "SemiLEDs Corporation develops, manufactures, and sells light emitting diode (LED) chips, LED components, and LED modules and systems in the United States, Taiwan, the Netherlands, Germany, Japan, Ireland, and internationally. The company also sells enhanced vertical, LED product series in blue, white, green, and UV; LED chips to packagers or distributors; and lighting products primarily to original design manufacturers of lighting products and the end-users of lighting devices, as well as packages and sells its LED chips into LED components to distributors. Its products are used for general lighting applications, including commercial, industrial, and residential lighting; and specialty industrial applications, such as ultraviolet or UV, curing of polymers, LED light therapy in medical/cosmetic applications, counterfeit detection, LED lighting for horticulture applications, architectural lighting, and entertainment lighting. SemiLEDs Corporation was founded in 2005 and is headquartered in Chunan, Taiwan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Taiwan",
        "state": null,
        "city": "Chu-Nan",
        "zipcode": "350",
        "website": "http://www.semileds.com",
        "market_cap": 35303032
    },
    "TSFA.F": {
        "short_name": "TAIWAN SEMICON.MANU.ADR/5",
        "long_name": "Taiwan Semiconductor Manufacturing Company Limited",
        "summary": "Taiwan Semiconductor Manufacturing Company Limited manufactures and sells integrated circuits and semiconductors. It also offers customer service, account management, and engineering services. The company serves customers in computer, communications, consumer, and industrial and standard segments in North America, Europe, Japan, China, and South Korea. Taiwan Semiconductor Manufacturing Company Limited was founded in 1987 and is headquartered in HsinChu, Taiwan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300-78",
        "website": "http://www.tsmc.com",
        "market_cap": 464098623488
    },
    "TSFA.VI": {
        "short_name": "TAIWAN SEMICONDUCTOR-SP ADR",
        "long_name": "Taiwan Semiconductor Manufacturing Company Limited",
        "summary": "Taiwan Semiconductor Manufacturing Company Limited manufactures and sells integrated circuits and semiconductors. It also offers customer service, account management, and engineering services. The company serves customers in computer, communications, consumer, and industrial and standard segments in North America, Europe, Japan, China, and South Korea. Taiwan Semiconductor Manufacturing Company Limited was founded in 1987 and is headquartered in HsinChu, Taiwan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300-78",
        "website": "http://www.tsmc.com",
        "market_cap": 460300746752
    },
    "TSM.BA": {
        "short_name": "TAIWAN SEMICON MAN",
        "long_name": "Taiwan Semiconductor Manufacturing Company Limited",
        "summary": "Taiwan Semiconductor Manufacturing Company Limited manufactures and sells integrated circuits and semiconductors. It also offers customer service, account management, and engineering services. The company serves customers in computer, communications, consumer, and industrial and standard segments in North America, Europe, Japan, China, and South Korea. Taiwan Semiconductor Manufacturing Company Limited was founded in 1987 and is headquartered in HsinChu, Taiwan.",
        "currency": "ARS",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300-78",
        "website": "http://www.tsmc.com",
        "market_cap": 54825861513216
    },
    "TSM": {
        "short_name": "Taiwan Semiconductor Manufactur",
        "long_name": "Taiwan Semiconductor Manufacturing Company Limited",
        "summary": "Taiwan Semiconductor Manufacturing Company Limited manufactures and sells integrated circuits and semiconductors. It also offers customer service, account management, and engineering services. The company serves customers in computer, communications, consumer, and industrial and standard segments in North America, Europe, Japan, China, and South Korea. Taiwan Semiconductor Manufacturing Company Limited was founded in 1987 and is headquartered in HsinChu, Taiwan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300-78",
        "website": "http://www.tsmc.com",
        "market_cap": 535213277184
    },
    "TSMN.MX": {
        "short_name": "TAIWAN SEMICONDUCTOR MANUFACTUR",
        "long_name": "Taiwan Semiconductor Manufacturing Company Limited",
        "summary": "Taiwan Semiconductor Manufacturing Company Limited manufactures and sells integrated circuits and semiconductors. It also offers customer service, account management, and engineering services. The company serves customers in computer, communications, consumer, and industrial and standard segments in North America, Europe, Japan, China, and South Korea. Taiwan Semiconductor Manufacturing Company Limited was founded in 1987 and is headquartered in HsinChu, Taiwan.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300-78",
        "website": "http://www.tsmc.com",
        "market_cap": 10939284848640
    },
    "UMC": {
        "short_name": "United Microelectronics Corpora",
        "long_name": "United Microelectronics Corporation",
        "summary": "United Microelectronics Corporation operates as a semiconductor wafer foundry in Taiwan, Singapore, China, Hong Kong, Japan, the United States, Europe, and internationally. The company operates through Wafer Fabrication and New Business segments. It provides circuit design, mask tooling, wafer fabrication, and assembly and testing services. The company also researches, develops, and manufactures products in the solar energy and LED industries. It serves fabless design companies and integrated device manufacturers. United Microelectronics Corporation was incorporated in 1980 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30078",
        "website": "http://www.umc.com",
        "market_cap": 23210766336
    },
    "UMCB.F": {
        "short_name": "UTD MICROELECTR.ADR NEW/5",
        "long_name": "United Microelectronics Corporation",
        "summary": "United Microelectronics Corporation operates as a semiconductor wafer foundry in Taiwan, Singapore, China, Hong Kong, Japan, the United States, Europe, and internationally. The company operates through Wafer Fabrication and New Business segments. It provides circuit design, mask tooling, wafer fabrication, and assembly and testing services. The company also researches, develops, and manufactures products in the solar energy and LED industries. It serves fabless design companies and integrated device manufacturers. United Microelectronics Corporation was incorporated in 1980 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30078",
        "website": "http://www.umc.com",
        "market_cap": 19628685312
    }
}