{
    "3570.TWO": {
        "short_name": "OTSUKA INFORMATION TECHNOLOGY C",
        "long_name": "Otsuka Information Technology Corp.",
        "summary": "Otsuka Information Technology Corp. agency sales of 3D computer engineering drawing CAID/CAD/CAM/CAE/PDM design software, system application consulting, online guidance, talent training, and other services in Taiwan and China. The company develops HyperPDM, a product information management system; and information security system integration applications that protect design, research, and development data. It serves manufacturing, construction, media and entertainment, information security/cloud/big data/AI industries. The company was founded in 1986 and is headquartered in New Taipei City, Taiwan. Otsuka Information Technology Corp. is a subsidiary of Otsuka Corporation.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "3632.TWO": {
        "short_name": "PAPAGO INC",
        "long_name": "Papago Inc.",
        "summary": "Papago Inc. produces and sells vehicle communication devices in Taiwan and internationally. It offers driving recorders; GPS satellite navigation products, such as handheld navigation, car navigation, and car mounted android machine products; electronic rearview mirrors; wireless tire pressure detectors; electronic signage; smart life products; and face recognition solutions. The company offers its products online, as well as through retail stores. Papago Inc. was founded in 2001 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "5202.TWO": {
        "short_name": "NEWSOFT TECHNOLOGY CORP",
        "long_name": "NewSoft Technology Corporation",
        "summary": "NewSoft Technology Corporation provides personal, enterprise Web, and digital signage solutions worldwide. The company offers personal solutions, including digital document, digital recognition, digital images, and mobile application solutions; and enterprise Web solutions, such as customer and salary management, electronic authorization, project management, attendance, resource management, performance management, document management, and digital signage systems. It also provides custom development services, which include optical character recognition software development kits (OCR SDK); identity card recognition software development kits (IDR SDK); driver and network, and document imaging cloud applications; mobile and cloud application customization; and digital image editing and management services. The company sells its products through store outlets, online channels, hardware distributors, and enterprise and government contact windows. NewSoft Technology Corporation was founded in 1987 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "5203.TW": {
        "short_name": "CYBERLINK CORP",
        "long_name": "CyberLink Corp.",
        "summary": "CyberLink Corp. operates as a multimedia software and AI facial recognition technology company in Taiwan and internationally. It offers software for video and photo editing, multimedia playback, file conversion, online chat, and mobile; video editing software and plug-ins for creative control; movie and media players for home theaters, online streaming, and VR; and software solutions for desktop recording, webcam capture, and livestreaming. The company also provides multimedia software for the whole family; solutions for burning, backup, and media conversion needs; online meetings, presentations, and business chat tools for communication; and apps for video and photo editing, business, and chat. CyberLink Corp. was incorporated in 1990 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "5211.TWO": {
        "short_name": "PENPOWER TECHNOLOGY LTD",
        "long_name": "Penpower Technology LTD.",
        "summary": "Penpower Technology LTD., engages in research and development of devices with built-in intelligent human-machine interface technologies in Taiwan and internationally. The company provides handheld pen scanners and translators, pen scanners and translators for computers, and multilingual dictionary pens; wireless writing pads; embedded memory and digital memo writing pads; touch screen stylus; and business card management, voice, graphic design, and document management solutions. It also offers electronic signature solutions, as well as software services. Penpower Technology LTD. was founded in 1991 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hsinchu City"
    },
    "5403.TWO": {
        "short_name": "DIMERCO DATA SYSTEM CORP.",
        "long_name": "Dimerco Data System Corporation",
        "summary": "Dimerco Data System Corporation operates as a system integrator and service provider in Taiwan. It engages in the planning and integration of software systems, and installation and maintenance of hardware equipment. The company also provides software services for financial, securities, commercial, general, banking, asset management, trust, and bond applications. In addition, it offers co-location, backup rehearsal, and Dimerco data system's cloud services; and cross-platform solutions for operating platform, virtualization, heterogeneous platform, information security, monitoring and control, database services, and data backup to fulfill enterprises' service requirements of application systems. Dimerco Data System Corporation is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "6231.TWO": {
        "short_name": "INSYDE SOFTWARE CORP",
        "long_name": "Insyde Software Corp.",
        "summary": "Insyde Software Corp. provides system firmware and software engineering services for companies in the mobile, desktop, server, and embedded systems industries worldwide. It offers client, server, and Internet of Things (IoT)/embedded solutions; developer tools; Supervyse, a systems management software; BlinkBoot UEFI Boot Loader; and mobile applications. The company also provides engineering services in the areas of project planning, design, implementation and integration, acceptance and deployment, and maintenance and field updates; and UEFI training programs. It serves mobile computing, desktop, servers, and embedded/IoT markets. The company was founded in 1998 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "6590.TWO": {
        "short_name": "PROVISION INFORMATION CO LTD",
        "long_name": "Provision Information Co.,Ltd.",
        "summary": "Provision Information Co.,Ltd. provides payment, financial application, security, and outsourcing services to the financial industry. It offers payment solutions, such as ProIBRS, an interbank remittance system; ProATM, an ATM auto-transaction system; ProEPS FEDI, an enterprise payment system/financial EDI; ProEPS FXML, an enterprise payment system/financial XML; ProCMS, a card management system for IC cards and magnetic cards; ProIB/WebATM, an Internet banking/Web ATM; and real-time gross settlement mechanism. Its payment solutions also ProTGW-TSM, a mobile payment TSM gateway; ProTGW-HCE, a mobile payment HCE gateway; ProeACH, an eACH gateway for joined banks; and digital payment solutions consisting of ProePAY, a digital payment system, as well as payment gateways. The company also provides financial application solutions, including ProFEP, a platform for developing financial transactions; ProComm, an integrated communication server; ProFCS, a collection system for financial industry; ProMIPS, an encryption kit for file transmission; ProACS, an ATM controlled system; ProAMS, an ATM management system; and ProJCIC, a joint credit inquiry system. In addition, it offers information security products comprising ProHSM, a hardware security module (HSM); ProHSM KMC, a key management console; ProMonitor, a HSM monitoring system; ProHSM HRM, a HSM resource managers; ProHSM SUIP, a secure user interface program; and ProVA, a validation authority system. Further, the company provides outsourcing services, including on-site human resource services for various industries, platforms, and job roles. Provision Information Co.,Ltd. was founded in 2000 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "6738.TWO": {
        "short_name": "MAYO",
        "long_name": "MAYO Human Capital Inc.",
        "summary": "MAYO Human Capital Inc. provides human resources management solutions to various industries and enterprises. The company offers Apollo, a human resources solution that integrates functions, such as attendance punching, scheduling, leave, salary, recruitment, signing, organization, and management. It also provides STAYFUN, an employee benefits integration platform that allows the company to have choices for gifts and employee benefits. In addition, the company offers Cornerstone, an integrated cloud platform, which covers online learning modules, training goal setting, performance management and core talent data management, visual talent placement and analysis, enterprises implement talent management strategies, successor bench strength building, and perfect talent development system creation. Further, it provides customized internal training courses to companies related to professional staff-only human resource consultants; and personnel administration commission professional outsourcing services. MAYO Human Capital Inc. is headquartered in Hsinchu County, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Zhubei"
    },
    "6780.TWO": {
        "short_name": "Study123",
        "long_name": "Study King Co., Ltd.",
        "summary": "Study King Co., Ltd. provides digital learning content. It offers high school audio-visual interactive teaching materials. The company was founded in 2012 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6816.TWO": {
        "short_name": "METAEDGE",
        "long_name": "MetaEdge Corporation",
        "summary": "MetaEdge Corporation provides data warehousing and business intelligence (BI) consulting services to enterprise customers in China. Its solutions cover BI tools and software, and education and training related services. The company was founded in 2000 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "8284.TWO": {
        "short_name": "MITAKE INFORMATION CORPORATION",
        "long_name": "Mitake Information Corporation",
        "summary": "Mitake Information Corporation engages in the computer equipment installation, information software services, and electronic communication and information equipment trading business in Taiwan. The company was founded in 1991 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "8416.TWO": {
        "short_name": "SOLIDWIZARD TECHNOLOGY CO LTD",
        "long_name": "Solidwizard Technology Co., Ltd.",
        "summary": "Solidwizard Technology Co., Ltd. provides software, hardware, and consulting service solutions in Taiwan and China. The company offers CAID, CAD, RP, RE, CAE, CAM, and PDM solutions. It also provides subscription services; 3D CAD, product data management, simulation solution, technical communication, CAM, and education software products; 3D printer and scanner products; and collaborative robots. The company was founded in 1997 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    }
}