{
    "5607.TW": {
        "short_name": "FARGLORY FREE TRADE ZONE INVEST",
        "long_name": "Farglory Free Trade Zone Investment Holding Co., Ltd",
        "summary": "Farglory Free Trade Zone Investment Holding Co., Ltd operates free trade zone in Taiwan. The park provides enterprises various commercial services and facilities, including automated warehousing facilities; an economic and trading special operation zone which encompasses land, sea, and air transport; and an air cargo terminal, a forwarders building, an international logistics center, and an enterprise business center. The company was founded in 1991 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan"
    },
    "CRKT": {
        "short_name": "CIRMAKER TECHNOLOGY CORPORATION",
        "long_name": "Cirmaker Technology Corporation",
        "summary": "Cirmaker Technology Corporation engages in the manufacture, distribution, and assembling of various electronic parts and components for sale primarily in the Asian markets. It provides electronic terminals, electronic blocks and accessories, electronic panel control and locking components, power distribution blocks and accessories, electronic timer and relay sockets, optical fiber connectors and adapters, car audio components, DVD players, electronics, cooling fins and systems for laptop and personal computers, and electrical tools, and other devices. The company also manufactures LCD backlight components and produces voice over Internet Protocol telephones. Further, it distributes or resells crimping tools, switches, cable ties, meters, sirens, power cords, and terminal strips, as well as imports and exports computer chips and various electronic products. Cirmaker Technology Corporation sells its products through sales personnel and marketing agents. The company was organized in 1984 and is based in Taoyuan, Taiwan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Taiwan",
        "city": "Taoyuan"
    }
}