{
    "1301.TW": {
        "short_name": "FORMOSA PLASTIC",
        "long_name": "Formosa Plastics Corporation",
        "summary": "Formosa Plastics Corporation produces and sells intermediate raw materials for plastics in Taiwan, Mainland China, and internationally. Its plastic products include PVC resins, high density polyethylene resins, linear low density polyethylene resins, ethylene vinyl acetate copolymer resins, PE wax, polypropylene (PP), polyoxymethylene, and PP or PE-based masterbatches. The company also provides chemicals, such as liquid caustic soda, caustic soda solid, liquid chlorine, vinyl chloride monomers, ethylene dichloride, acrylonitrile, acetonitrile, methyl methacrylate, methacrylic acid, epichlorohydrin, methyl tertiary butyl ether, acrylic acid and esters, SAP chemicals, and n-butanol; and petrochemical products. In addition, it offers carbon fibers; electronic products comprising distributed control systems, WMS, real-time production management systems, SCS-2000, and laboratory information management systems; and other products, including processing aids, methyl methacrylate-butadiene-styrene, sodium hypochlorite, chlorinated solvents, hydrogen, lithium-ion battery electrolytes, lime, calcium carbonate, and hydrochloric acid. The company provides its products for use in various applications, such as household items, outdoor sports, mechanical engineering, building materials coatings, 3C appliances, civil farm animals, and other applications. Formosa Plastics Corporation was founded in 1954 and is headquartered in Kaohsiung City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "814",
        "website": "http://www.fpc.com.tw",
        "market_cap": "Large Cap"
    },
    "1303.TW": {
        "short_name": "NAN YA PLASTIC",
        "long_name": "Nan Ya Plastics Corporation",
        "summary": "Nan Ya Plastics Corporation manufactures and sells plastics products, plastic materials, petrochemicals, electronic materials, and polyester fiber products in Taiwan, China and Hong Kong, the United States, and internationally. It provides plastics products comprising PP synthetic papers, adhesives, optical films, outdoor and interior decoration materials, synthetic leather, TPU films, PU resins, fire rated doors, windows, plastic pallets, PVC cling films, PE stretch films, engineering and PVC compounds, unsaturated polyester, pipes and fittings, rigid sheets, A-PET sheets/rigid films, PVC sheets, PP sheets, and injection molding products, as well as decoration, window, and PET films. The company also offers electronic materials, including copper clad laminates, glass fabrics, liquid crystal display products, touch panels, copper foils, and PCB inks. In addition, it provides chemicals, such as phthalate plasticizers; phthalic anhydride; alcohols; glycols; curing agents; hydrogen peroxide; tetrahydrofuran; 1,4-butanediol; bisphenol-A; maleic anhydride; epoxidized soybean oil; stabilizer; liquefied gas; and epoxy resin. Further, the company provides fiber and textile products, such as draw textured yarns, spin drawn yarns, partially and fully oriented yarns, polyester staple fibers, PET resins, polyester films, polyester release films, and woven and knitting fabrics. Additionally, it offers machinery and switchgear products, including HV/LV switchgears, cast resin transformers, vacuum contactor switches, molds, rollers, and screws and barrels. The company was founded in 1958 and is headquartered in Kaohsiung City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "814",
        "website": "http://www.npc.com.tw",
        "market_cap": "Large Cap"
    },
    "1309.TW": {
        "short_name": "TAITA CHEMICAL",
        "long_name": "Taita Chemical Company, Limited",
        "summary": "Taita Chemical Company, Ltd. produces and sells styrenics in Taiwan. The company offers acrylonitrile-butadiene-styrene resin, a terpolymer plastic under the TAITALAC brand; general purpose and high impact polystyrene under the TAITAREX brand name for use in food containers, CD cases, stationary, toys, insulation boards, business machines, electric and electrical appliances, and consumer goods; and expandable polystyrene resins under the TAITACELL brand name. It also provides glass wool materials; and engages in cubic printing, a process for applying decorative pattern to 3-dimensional products in various applications, including auto parts, home electronic appliances, IT products, home decoration, sport goods, stationery and gifts, and others. The company exports its products worldwide. Taita Chemical Company, Ltd. was founded in 1960 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.ttc.com.tw",
        "market_cap": "Small Cap"
    },
    "1314.TW": {
        "short_name": "CHINA PETROCHEMICAL DEVELOPMENT",
        "long_name": "China Petrochemical Development Corporation",
        "summary": "China Petrochemical Development Corporation, together with its subsidiaries, produces and sells petrochemical intermediates and related engineering plastics, synthetic resins, chemical fiber, and other derivative products in Taiwan, rest of Asia, and internationally. It offers petroleum, alkali-chlorine, phosphoric acid, and derivative products; and storage, transportation, procurement, and sale of forging items, and related chemicals and chemicals materials. The company offers caprolactam for use as a raw material for making nylon 6 fibers and resins; acrylonitrile, a raw material for acrylic fibers and ABS plastics; nylon chips, including fiber nylon chips and engineering plastic grade nylon chips; ammonium sulfate, which is used as a ground or top fertilizer in agriculture; hydrogen cyanide, a transparent liquid for use as a raw material for manufacturing MMA; and refined sulfuric acid for various applications in the battery, electronic, telecommunication, and national defense related industries, as well as O-Phenylphenol, a raw material for downstream applications. Further, it is involved in the investment and development of real estate properties; petrochemical supporting facility construction; engineering and construction contracting business; biotechnology and pharmaceutical research, development, and marketing business; fertilizer storage, transport, purchase, and marketing business; trading of petrochemicals, electronic chemicals, industrial gases, and gas mixtures; and water treatment, plumbing, apparatus, and instrument installation work, refrigeration and air conditioning engineering, and tank car repair services, as well as provision of dicalcium phosphate and mechanical engineering services. Additionally, it commissions to build housing and commercial buildings, as well as plant rental business; manages land developments and playgrounds and other investment businesses. The company was incorporated in 1969 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "815",
        "website": "http://www.cpdc.com.tw",
        "market_cap": "Small Cap"
    },
    "1711.TW": {
        "short_name": "EVERLIGHT CHEMICAL",
        "long_name": "Everlight Chemical Industrial Corporation",
        "summary": "Everlight Chemical Industrial Corporation produces and sells chemical products in Taiwan, rest of Asia, the Americas, Europe, and internationally. The company offers dyes for use in textile, leather, ink jet printing, digital textile printing, anodized aluminum, paper, and solar energy applications; specialty chemicals that are used in coatings, adhesives, plastics, polyurethanes, elastomers, and cosmetics; toners, cartridges, and carriers and developers for printers and ceramic ware; and electronic chemicals for use in yellow lithography, rinsing imaging, and substrate flattening process, as well as semiconductor and substrate surface cleaning, electroplating, surface coating, and electronic assembly applications. It also provides prostaglandin and other material medicines; and technical consulting services. Everlight Chemical Industrial Corporation was founded in 1972 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "106",
        "website": "http://www.ecic.com",
        "market_cap": "Small Cap"
    },
    "1717.TW": {
        "short_name": "ETERNAL MATERIALS CO LTD",
        "long_name": "Eternal Materials Co., Ltd.",
        "summary": "Eternal Materials Co., Ltd. manufactures and sells resin, high performance, and electronic materials. The company offers resins materials, including polyester polyol, polyurethane, alkyd, solvent and water-based acrylic coating, amino, fluorocarbon, saturated and unsaturated polyester, other coatings, vinyl ester, and fire retardant resins, as well as acrylic resin for adhesives and overprinting; and optoelectronic materials, photovoltaic materials, epoxy system, structural adhesive, and polyester for polyurethane foam. It also provides UV monomers and oligomers, special coatings, silicone powders, additives, and 3D UV printing materials. In addition, the company offers printed circuit board materials, including dry film photoresists, dry film solder masks, UV inks, dry film photosensitive polyimides, paper phenolic copper clad laminates, and composite epoxy copper clad laminates; flat panel display and touch panel materials, such as dry film photoresists, liquid polyimide materials, prism films, and protective films; and vacuum laminators and toll coating services. Further, it provides biomedical materials, which includes biochemical and molecular diagnostics, recombinant proteins, and antibodies; liquid molding compound for WLP; solid capacitor materials; lithium battery materials; green process-less CTP plate photoresist; thermoplastic composites; and hydrophilic films. The company's products are used in energy, transportation, building and furniture, electronics, consumer products, packaging and printing, health care and medical, and metal machinery applications. It has operations in Taiwan, China, Japan, Vietnam, Thailand, the United States, India, Indonesia, Malaysia, Korea, and Italy. The company was formerly known as Eternal Chemical Co., Ltd. and changed its name to Eternal Materials Co., Ltd. in 2014. Eternal Materials Co., Ltd. was founded in 1964 and is headquartered in Kaohsiung City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "807",
        "website": "http://www.eternal-group.com",
        "market_cap": "Small Cap"
    },
    "1724.TW": {
        "short_name": "TNC INDUSTRIAL",
        "long_name": "T.N.C. Industrial Co., Ltd.",
        "summary": "T.N.C. Industrial Co., Ltd. manufactures and sells coating raw materials and electronic chemicals for industrial applications worldwide. It offers a range of coating chemicals, including nitrocellulose, pigment, resin, etc. The company's nitrocellulose is used in coating, lacquer, printing ink, and various decorative films, as well as for wooden furniture, athletic facilities, cosmetics, metal, and leather products; pigments are used to make color of the surfaces and materials; and resin and derivatives are used for the adhesion of coating. It also offers electronic chemicals, such as process chemicals and mixed acids for semiconductor; display; and diode, solar cell, and LED industries. T.N.C. Industrial Co., Ltd. was founded in 1954 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": null,
        "website": "http://www.tnc.com.tw",
        "market_cap": "Small Cap"
    },
    "1726.TW": {
        "short_name": "YUNG CHI PAINT & VARNISH MFG CO",
        "long_name": "Yung Chi Paint & Varnish Mfg.Co.,Ltd",
        "summary": "Yung Chi Paint & Varnish Mfg.Co.,Ltd manufactures and sells coatings and paints primarily in Taiwan. The company offers architecture coatings, including water and solvent-based cement mortar paints, water-based lastomeric coatings, dirt off exterior acrylic emulsion paints, water-based epoxy topcoats, solvent-based acrylic paints, exterior wall and clear coatings, wood coatings, waterproof paints, and other used architecture coatings. It also provides heavy duty coatings, such as ready-mixed, top-long, enamel, PU, epoxy, vinyl ester, chlorinated rubber, yung flon, polyurethane, and polysiloxane paints; and epoxy flooring coatings and anti-corrosive and zinc rich primers. In addition, the company offers marine paints that include supermarine products; anti-fouling, marine primers and paints, and rainbow paints; and fire-retardant coatings and spray-applied fire resistive materials. Further, it provides specialty coatings, which comprise galvanized steel emulsions, anti-midew, baking, and heat-resisting paints; varnishes, putty, traffic paints, black board paints, paint removers, hammer tone paints, paint oils, flash rust inhibitors, weldable anti-corrosive primers, gold paints, and flat paints. Additionally, the company offers coil coatings and maintenance paints; green water-based waterproof paints, green epoxy topcoats, and green water-based cement mortar paints; and water-based clear white-board paints, textured paints, and snow-flake decorative paints. It also provides paint pigments, synthetic resins, fire protection coatings, cement made products, and steel drums, as well as can, nuclear, and curtain wall coatings; and engages in the coating, anti-corrosive, lining coating, rust removal by water-jet, and wet sand blasting construction, as well as electrolytic protection activities. The company was founded in 1951 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "81264",
        "website": "http://www.rainbowpaint.com.tw",
        "market_cap": "Small Cap"
    },
    "1742.TWO": {
        "short_name": "TAIWAN WAX",
        "long_name": "Taiwan Wax Company,Ltd.",
        "summary": "Taiwan Wax Company,Ltd. manufactures and sells refined wax in Taiwan and internationally. The company offers refined paraffin wax, microcrystalline wax, and light/heavy foots oil wax. It also imports and sells aquatic products, such as king crab and salmon. The company was founded in 1987 and is based in Chiayi, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Chiayi",
        "zipcode": "62146",
        "website": "http://en.wax.com.tw",
        "market_cap": "Small Cap"
    },
    "2103.TW": {
        "short_name": "TSRC CORPORATION",
        "long_name": "TSRC Corporation",
        "summary": "TSRC Corporation manufactures and markets synthetic rubber and elastomers, and applied materials in Taiwan and internationally. Its products include ESBR rubber for use in automotive tires, shoe soles, conveyor belts, military caterpillar and tow trucks tracks, sports equipment, and toys; SSBR rubber for use in energy-saving, high performance, and all-season tires; BR rubber that is used in the production of plastic modification for HIPS and high-speed radial tires; and NBR rubber for use in oil hoses, oil seals, rollers, industrial gaskets, belts, shoe soles, rubber plastic foam sheets, and conveyor belts. The company also provides styrene-butadiene-styrene, styrene-isoprene-styrene, and styrene-ethylene/butylene-styrene copolymers, as well as T-BLEND applied materials for use in plastic modification, compounding, adhesive, packaging, medical, elastic film, shoe material, foaming material, labels, hygiene, wire and cable, flexography, gasket material, and soft touch material applications. The company was formerly known as Taiwan Synthetic Rubber Corporation and changed its name to TSRC Corporation in August 1999. TSRC Corporation was founded in 1973 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "106",
        "website": "http://www.tsrc.com.tw",
        "market_cap": "Small Cap"
    },
    "2104.TW": {
        "short_name": "INTERNATIONAL CSRC INVESTMENT H",
        "long_name": "International CSRC Investment Holdings Co., Ltd.",
        "summary": "International CSRC Investment Holdings Co., Ltd. produces and sells carbon black for tire and other rubber products worldwide. Its products are also used in applications, such as pigments, plastics, chemical fiber products, conductive materials, etc. The company also engages in the biotechnology and pharmaceutical research and development activities. In addition, it produces and sells lithium batteries; and provides investment services, investment consultation services, carbon black transportation services, and technology services. The company was formerly known as China Synthetic Rubber Corporation and changed its name to International CSRC Investment Holdings Co., Ltd. in October 2018. International CSRC Investment Holdings Co., Ltd. was founded in 1973 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://www.csrcgroup.com",
        "market_cap": "Small Cap"
    },
    "2107.TW": {
        "short_name": "FORMOSAN RUBBER GROUP",
        "long_name": "Formosan Rubber Group Inc.",
        "summary": "Formosan Rubber Group Inc., together with its subsidiaries, produces and markets rubber, plastic, plastic foam, and PVC resin sheets; and relevant materials in Taiwan and the United States. The company offers rubber, silicone rubber, laminated, PU coating, green plastic, and PVC products. Its products are used in various applications, including functional garments and fabrics, healthcare, industrial and safety products, inflatable products, and optical electronic materials, as well as for use in shoes, and bags and luggage products. The company is also involved in the development of residential and commercial buildings for renting and selling; real estate investment and rental, as well as sale of premises; and warehouse, logistics, and rental and leasing businesses. Formosan Rubber Group Inc. was founded in 1952 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.frg.com.tw",
        "market_cap": "Small Cap"
    },
    "2108.TW": {
        "short_name": "NANTEX INDUSTRY",
        "long_name": "NANTEX Industry Co., Ltd.",
        "summary": "NANTEX Industry Co., Ltd. produces and sells synthetic rubber latex, acrylonitrile-butadiene rubber, carbon masterbatch compounds, and thermoplastic elastomer products worldwide. Its NANTEX synthetic rubber latex products are used in making examination, medical, household, and industrial gloves, as well as in art papers, coated white board, carpet backings, shoe insoles, adhesives, plastic modification agents, construction materials, saturation in non-woven fabrics, and artificial leathers. The company's acrylonitrile-butadiene rubber products are used in industrial and automotive goods, belts, fuel hoses, O-rings, gaskets, shoe soles, insulation equipment, sporting goods, and printing rollers products, as well as electronic parts. Its DYNAPRENE thermal plastic elastomer products are used in automotive parts, construction materials, food industries, sporting goods, industrial products, 3C industries, medical equipment, and plastic modification agents; and carbon masterbatch compounds for use in O-rings, gaskets, fuel hoses, foam products, cables, rollers, shoe soles, and automotive parts. The company was formerly known as President Fine Chemical Industry Co. Ltd. and changed its name to NANTEX Industry Co., Ltd. in October 1991. NANTEX Industry Co., Ltd. was founded in 1979 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "832",
        "website": "http://www.nantex.com.tw",
        "market_cap": "Mid Cap"
    },
    "3149.TW": {
        "short_name": "G-TECH OPTOELECTRONICS CORP",
        "long_name": "G-TECH Optoelectronics Corporation",
        "summary": "G-TECH Optoelectronics Corporation engages in the optoelectronic glass processing business in Taiwan. The company offers 3D forming, low-E energy-saving, tempered paint, coated, and cover glass products, as well as easy clean and fog proof smart mirrors. It also provides surface processing services for architectural glass; and processing manufacturing services, such as tempering, shaping, laminating, and insulating. The company's products are used in consumer electronics and non-consumer electronics segments, such as architectures and automobiles. The company was formerly known as Positive Technology Glass Co., Ltd. and changed its name to G-TECH Optoelectronics Corporation in 2001. The company was founded in 1996 and is headquartered in Miaoli County, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Miaoli",
        "zipcode": "36647",
        "website": "http://www.gtoc.com.tw",
        "market_cap": "Small Cap"
    },
    "3388.TWO": {
        "short_name": "TOPCO TECHNOLOGIES CORP.",
        "long_name": "Topco Technologies Corp.",
        "summary": "Topco Technologies Corp. engages in the import and export of chemical material related commodities in Taiwan, Mainland China, and internationally. It offers silicone related products, including silicone fluid, defoaming and release agent, foam stabilizer, fiber treatment, paint additives, resin, coupling agent, oil, rubber, PSA, powder, and grease, as well as paper release agent, HTV, liquid injection molding system, RTV I, RTV II, sealant, MS-RTV, thermal pad and LED application material, and AF coating agent. The company also provides various adhesives, such as construction structural adhesives; EXELAST; surface treatment equipment; matsumoto microsphere; poreflon membrane; touch panel related materials; poly tetra fluoroethylene films; and other products. In addition, it offers environmental catalysts; micro-capsule foam materials; silicate and anti-static agents; cosmetic raw materials and finished products; gunze fluorine sleeves; UV curing glues; atmospheric plasma; VUV washing machines; and conductive polymers and thermal materials, as well as other trade products. The company was founded in 1981 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10690",
        "website": "http://www.topcocorp.com",
        "market_cap": "Small Cap"
    },
    "3430.TWO": {
        "short_name": "CHITEC",
        "long_name": "Chitec Technology Co., Ltd.",
        "summary": "Chitec Technology Co., Ltd. engages in the research and development of specialty chemicals for applications in electronics, medicine, automotive, construction, and other industries worldwide. It offers UV absorbers and light stabilizers under the Chiguard name; flame retardants under the Zuran name; antioxidants under the Revonox/Deox name; photoinitiators under the Chivacure/R-gen name; and anti-reversion agents, antiozoants, optical brighteners, and auxiliary thermal stabilizers under the Chitex name. The company was founded in 1998 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "106",
        "website": "http://www.chitec.com",
        "market_cap": "Small Cap"
    },
    "3508.TWO": {
        "short_name": "WAYS TECHNICAL CORP",
        "long_name": "Ways Technical Corp., Ltd.",
        "summary": "Ways Technical Corp., Ltd. engages in the various processing services and professional material development. It offers plastic, metal, and assembly center injection equipment and other products; tooling equipment; surface treatment injection molding; SMT products; and organic photovoltaics products. The company was founded in 2001 and is based in Dayuan, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Yangmei",
        "zipcode": "326",
        "website": "http://www.waystech.net",
        "market_cap": "Small Cap"
    },
    "3708.TW": {
        "short_name": "SWANCOR HOLDING CO LTD",
        "long_name": "Swancor Holding Co., LTD.",
        "summary": "Swancor Holding Co., LTD. produces and sells chemical products in Taiwan and internationally. The company offers vinyl ester and UP resins, including epoxy vinyl ester and unsaturated polyester resins, and epoxy adhesives; vinyl ester resins and epoxy systems for wind turbine blades; and epoxy composite resins, such as hand lay-up, filament winding, RTM/infusion, pultrusion, and solvent type epoxy resins, as well as carbon fiber and epoxy resins for prepreg. It also provides vinyl ester resins for marine applications; electrical insulating materials for use in large-scale casting application in the electronics and heavy electrical industries; and SMC/BMC resins and low profile additives. The company was founded in 1992 and is headquartered in Nantou City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Nantou City",
        "zipcode": "54066",
        "website": "http://www.swancor.com.tw",
        "market_cap": "Small Cap"
    },
    "4706.TWO": {
        "short_name": "TAH KONG CHEMICAL IND CORP",
        "long_name": "Tah Kong Chemical Industrial Corporation",
        "summary": "Tah Kong Chemical Industrial Corporation manufactures, processes, and sells paints, pigments and intermediates in Taiwan, Southeast Asia, Japan, China, the United States, and Australia. The company offers PVC, PU, and polyolefin processed pigments. It also provides aqueous pigment dispersions and UV curable products; and organic pigments, which are used in ink, plastic, rubber, fiber, paint, stationery, etc. In addition, the company offers functional masterbatch that includes non-halogen flame retardant TPU compound, TPU anti-blocking and lubricant masterbatch, TPU fogging agent masterbatch, black electric conductive PE masterbatch, TPA weather resistant PE functional masterbatch, and anti-microbial PE masterbatch. Tah Kong Chemical Industrial Corporation was founded in 1966 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "115",
        "website": "http://www.tkc.com.tw",
        "market_cap": "Small Cap"
    },
    "4716.TWO": {
        "short_name": "DAILY POLYMER CORP",
        "long_name": "Daily Polymer Corp.",
        "summary": "Daily Polymer Corp. manufactures and sells synthetic resins in Taiwan. It offers polymer materials, including solvent and water based resins for paints, unsaturated polyester resins, and paint additives; and UV curing pressure sensitive adhesives. The company also provides photo-electronic materials, such as liquid crystals and alignment materials; and conductive polymers. It also exports its products to Southeast and Middle Asia, India, Japan, Africa, and Hong Kong. Daily Polymer Corp. was founded in 1970 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "814",
        "website": "http://www.daily-polymer.com",
        "market_cap": "Small Cap"
    },
    "4721.TWO": {
        "short_name": "MECHEMA CHEMICALS INTL CORPN",
        "long_name": "Mechema Chemicals International Corp.",
        "summary": "Mechema Chemicals International Corp. supplies oxidation catalysts worldwide. The company supplies magnetic material cobalt lithium secondary batteries and materials; and specialty chemicals. It also provides PTA oxidation catalyst, CTA pretreatment, PTA M.L. recovery, and electromagnetic industry services. The company was founded in 1930 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "32849",
        "website": "http://www.mechema.com",
        "market_cap": "Small Cap"
    },
    "4722.TW": {
        "short_name": "QUALIPOLY CHEMICAL CORP",
        "long_name": "Qualipoly Chemical Corporation",
        "summary": "Qualipoly Chemical Corporation manufactures and supplies polyurethane resins, wire enamels, and insulating varnish. The company offers UV curable materials used in various applications, such as wood coatings, plastics and metal coatings, adhesives and lacquers for CD/DVD, over print varnishes, optical films, and additives for electronic/optical parts; and unsaturated polyester resins for use in FRPs, color pastes and gelcoats, fire retardants, castings, synthetic marbles, buttons, decorative panels, coatings and putties, SMC/BMCs, and ISO-type FRPs. It also provides coating resins comprising alkyd resins used in various applications, which include tinting colors, ink, white ready mixed paints, air-drying paints, baking paints, 2K and NC matted primers, acid-curing, marine primer, wrinkle finishes, paints on wood, plastic and glass, etc.; acrylic resins for use in baking paints on metal, acid-curing amino-alkyd paints on wood applications, etc.; and amino resins used in various applications consisting of paints on concrete, pints for road marking, printing inks, and coil pints, as well as varnishes/paints on paper, wood, plastic, and metal. In addition, the company offers foundry resins that are used as cement and adhesive, casting resin, coating, and impregnant; insulating varnishes used in the manufacture of transformers, and coil and enamel-insulated wires for insulating system in the electronic devices; and polyurethane rigid foam resins used to manufacture wood-imitation materials, soft floor, and fillers. Further, it provides PVAC and acrylic emulsion resins to manufacture tapes of general purpose, pressure sensitive adhesive, glues, and others; and fiber glass. The company markets its products in approximately 40 countries under the Qualipoly and QualiCure brand names. Qualipoly Chemical Corporation was founded in 1978 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "82841",
        "website": "http://www.qualipoly.com",
        "market_cap": "Small Cap"
    },
    "4738.TWO": {
        "short_name": "TFC",
        "long_name": "Tatung Fine Chemicals Co.",
        "summary": "Tatung Fine Chemicals Co. develops, manufactures, and sells nano-products in Taiwan. The company offers aqueous concentrated pigment dispersions for ink-jet inks and photo-catalyst paints. It also provides lithium iron phosphate, a cathode material for high power lithium ion batteries, as well as vanish, ink, TiO, and acrylic CED products. The company was formerly known as Tatung Coatings Company and changed its name to Tatung Fine Chemicals Co. in 2003. Tatung Fine Chemicals Co. was founded in 1970 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "328",
        "website": "http://www.twtfc.com",
        "market_cap": "Small Cap"
    },
    "4739.TW": {
        "short_name": "COREMAX CORPORATION",
        "long_name": "Coremax Corporation",
        "summary": "Coremax Corporation researches, develops, produces, manufactures, and sells metal-based specialty chemicals and electronic materials in Taiwan, China, and Thailand. It offers oxidation catalysts in liquid and crystalline forms; specialty chemicals for use in tires, pigments, paints, electronic, and traditional industries; battery materials that are used in the manufacturing of rechargeable lithium-ion batteries; and chemical and organic compound fertilizers. The company was formerly known as Coremax Taiwan Corporation and changed its name to Coremax Corporation in 2000. The company was founded in 1992 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "303035",
        "website": "http://www.coremaxcorp.com",
        "market_cap": "Small Cap"
    },
    "4741.TWO": {
        "short_name": "JETBEST CORPORATION",
        "long_name": "Jetbest Corporation",
        "summary": "Jetbest Corporation researches and develops, manufactures, and sells inkjet printing products in Taiwan. The company offers various inks, such as UV inks; and wide format inks, including eco solvent pigments, mild solvent pigments, water dyes and pigments, oil-based dyes and pigments. It also provides textile inks comprising dye sublimation and disperse inks, resin pigments, and reactive dyes; magic inks; desktop inks; nano and resin-free colorants; and bulk systems consisting of refilled cartridges. The company also distributes its products approximately in 80 countries. Jetbest Corporation was founded in 2004 and is based in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30093",
        "website": "http://www.jetbest.com",
        "market_cap": "Small Cap"
    },
    "4754.TWO": {
        "short_name": "INTERNATIONAL CARBIDE TECHCO LT",
        "long_name": "INternational CArbide Technology Co., Ltd.",
        "summary": "INternational CArbide Technology Co., Ltd. manufactures and sells firestop products in Taiwan. The company offers firestop system, such as fire barrier caulks, fire barrier silicone sealants, moldable firestop and firestop putty products, intumescent strips, fire barrier foams, firestop bricks, firestop sheets, mortar, fireproof blankets, and coated firestop boards/coatings. It also provides elastomeric fire caulks, putty pads, fireproof paints for wood, intumescent coating, high intumescent lamination, firestop tapes, smoke and acoustic sealants, and spray products, as well as fireproof protections for cable/electrical systems. The company was founded in 1998 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33842",
        "website": "http://www.incatech.com.tw",
        "market_cap": "Small Cap"
    },
    "4765.TWO": {
        "short_name": "PANCOLOUR",
        "long_name": "Pancolour Ink Co., Ltd.",
        "summary": "Pancolour Ink Co., Ltd. manufactures and sells UV curable inks, coatings, and adhesives in Taiwan. It offers UV curable printing inks for IC chips, optical discs, plastics, and paper products; UV curable adhesives for bonding needs of metal, glass, and other materials that are applied in handicraft and electronic industries; and UV curable coatings for use in plastic flexible tubes and paper spot varnish for screen print, etc. The company provides its products under the PANOVA, PANCURE, PANOLEN, and RADITHO names. Pancolour Ink Co., Ltd. was founded in 1997 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33383",
        "website": "http://www.pancolourink.com",
        "market_cap": "Small Cap"
    },
    "4766.TW": {
        "short_name": "NAN PAO RESINS CHEMICAL CO LTD",
        "long_name": "Nan Pao Resins Chemical Co., Ltd.",
        "summary": "Nan Pao Resins Chemical Co., Ltd. manufactures, wholesales, and retails synthetic resins and plastics, adhesives, resin coatings, dyes, and pigments in Taiwan, Mainland China, and Southeast Asia. It offers footwear adhesives, including cleaners, primers, hardeners, and shoe adhesives. The company also provides adhesives and specialties, such as textile, woodworking and furniture, construction, graphic arts, tape and label, paper converting, rigid packaging, leather coating, specialty, flexible package, construction and decoration, nonwoven, pressure sensitive, and other adhesives, as well as product assemblies. In addition, it offers hot melt adhesives; building and construction, flooring and concrete, heavy duty anti rust, industrial, eco green, functional, and indoor and outdoor powder coatings, as well as coatings for special applications; and construction materials comprising grouts, waterproof products, sealants, deadeners, and bituminous products. The company was founded in 1963 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "723",
        "website": "http://www.adhesivegluemaker.com",
        "market_cap": "Small Cap"
    },
    "4767.TWO": {
        "short_name": "CHERNG TAY TECHNOLOGY CO LTD",
        "long_name": "Cherng Tay Technology Co., Ltd.",
        "summary": "Cherng Tay Technology Co., Ltd. manufactures and sells adhesives in Taiwan and internationally. The company offers hot melt adhesive products for packaging, bookbinding, assembly, and footwear applications; waterproofing materials, including waterproofing membranes and glues; and reactive hot melt adhesives. Cherng Tay Technology Co., Ltd. was founded in 1983 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "821",
        "website": "http://www.chetay.com.tw",
        "market_cap": "Small Cap"
    },
    "4768.TWO": {
        "short_name": "INGENTEC",
        "long_name": "Ingentec Corporation",
        "summary": "Ingentec Corporation manufactures and supplies fine chemicals and high pressure gas containers to semiconductor front end, semiconductor package, and flat panel display processes. The company offers laser gas; silicon wafer related products, such as quartz crucibles, and polished and reclaim wafers; and specialty gas and wet chemical related products, including PSA argon gas recovery and purification systems, specialty gas, and texturing chemical. It also offers special materials and tools comprising chillers, LED metal clad substrates, mass flow meters and controllers, pigment, sputtering target materials, and thermal spray coatings powder; and solar cell related products, such as platelet calcined alumina, laser machine for PERC and boron dope, SiC powder, slurry recycle systems, solar quartz crucibles, and tungsten seed cables. The company was founded in 2010 and is headquartered in Zhunan, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhunan",
        "zipcode": "35059",
        "website": "http://www.ingenteccorp.com.tw",
        "market_cap": "Small Cap"
    },
    "5234.TW": {
        "short_name": "DAXIN MATERIALS CORPORATION",
        "long_name": "Daxin Materials Corporation",
        "summary": "Daxin Materials Corporation provides display and green energy related fine chemicals in Taiwan. It offers semiconductor materials comprising laser release layers, temporary bonding adhesives, and photosensitive dielectrics; display materials, such as LCD, touch panel, and OLED materials; green materials consisting of battery materials; and anhydride monomers. The company was founded in 2006 and is headquartered in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "40763",
        "website": "http://www.daxinmat.com",
        "market_cap": "Small Cap"
    },
    "5340.TWO": {
        "short_name": "BAOTEK INDUSTRIAL MATERIALS LTD",
        "long_name": "Baotek Industrial Materials Ltd.",
        "summary": "Baotek Industrial Materials Ltd. manufactures and sells fiberglass fabrics in primarily Taiwan, China, and internationally. It offers aerospace fiberglass fabric, a reinforcement material for airplanes' internal structure; high temperature filter bag used in power and steel plants, incinerators, and cement factories; fiberglass sun shade that are use in buildings, interior designs, construction, and furniture; PTFE fabrics for use in PTFE coating areas; and electronic fiberglass fabrics. The company was founded in 1992 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "326",
        "website": "http://www.baotek.com.tw",
        "market_cap": "Small Cap"
    },
    "6151.TWO": {
        "short_name": "GINAR TECHNOLOGY",
        "long_name": "Ginar Technology Co.,Ltd.",
        "summary": "Ginar Technology Co., Ltd. produces and sells performance materials in the field of engineering thermoplastics in Asia, the Americas, Europe, and internationally. It offers MAPEX polyamide engineering plastics, such as impact modified, mineral reinforced, glass fiber reinforced, and flame retardant polyamide 6, polyamide 66, and high temperature nylon compounds for automotive, electrical/electronic, and other industries; and mineral fiber, glass fiber, and impact modifier or flame retardant APLAX polypropylene engineering plastics. The company also provides impact modification and glass fiber reinforcement or flammability KAPEX polycarbonate engineering plastics; KAPEX PC/ABS alloys for cars instrument panels and dashboards, notebook covers, and cell phones; and KAPEX green products that contain r-PET and/or r-PC, which are from post-consumer recycled products for notebook PC, desktop PC, LED TV, monitor, and OA products. In addition, it offers flame retardant high performance nylon composite engineering plastics. The company's products are used for automotive and consumer electronics applications. Ginar Technology Co., Ltd. was founded in 1982 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33759",
        "website": "http://www.ginar.com.tw",
        "market_cap": "Small Cap"
    },
    "6434.TWO": {
        "short_name": "TacBright",
        "long_name": "TacBright Optronics Corp.",
        "summary": "TacBright Optronics Corporation researches, develops, manufactures, and sells triacetate cellulose (TAC) films. It offers TAC films for protective film in liquid crystal displays (LCDs), as well as for sunglasses, photographic equipment filters, anti-glare goggles, car navigation, other polarizing microscopes, special medical glasses, and other purposes. The company serves LCD polarizer manufacturers in Taiwan, South Korea, Japan, and Mainland China. TacBright Optronics Corporation was founded in 2006 and is based in Miaoli, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Miaoli",
        "zipcode": null,
        "website": "http://www.tacbright.com",
        "market_cap": "Small Cap"
    },
    "6495.TWO": {
        "short_name": "Nanoplus",
        "long_name": "Nanoplus Ltd.",
        "summary": "Nanoplus Ltd. engages in the production, purification, grading, and development of nano diamond powder. The company is also involved in the research and development, and production of thermal materials for thermal dissipation. In addition, it offers environmental wastewater treatment. Further, the company provides laser processing technology solutions. The company was founded in 2011 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "114",
        "website": "http://www.nanoplustech.com",
        "market_cap": "Small Cap"
    },
    "6509.TWO": {
        "short_name": "TAIWAN HOPAX CHEMS.MFG.CO",
        "long_name": "Taiwan Hopax Chems.Mfg.Co.,Ltd.",
        "summary": "Taiwan Hopax Chems.Mfg.Co.,Ltd. produces and sells diversified chemical products in the areas of specialty chemicals, fine chemicals, and repositionable self-adhesive products in Taiwan and internationally. The company offers papermaking chemicals, including dispersants, carbonless paper chemicals, paper coating chemicals, and wet end chemicals; water treatment chemicals, such as wastewater treating compounds, and chemicals for cooling water and boiler water; and combo packs, paper notes, cubes, line/assorted/pop-up notes, markers/index tabs/flags, clear notes, special and designing notes, and re-stick tape info boards/meeting pads. The company was founded in 1975 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "831",
        "website": "http://www.hopax.com.tw",
        "market_cap": "Small Cap"
    },
    "6582.TW": {
        "short_name": "SHIN FOONG SPECIALTY AND APPLIE",
        "long_name": "Shin Foong Specialty and Applied Materials Co., Ltd.",
        "summary": "Shin Foong Specialty and Applied Materials Co., Ltd. manufactures and sells synthetic SBR and NBR rubber latex products, and adhesives in Taiwan. Its products are used in various applications, such as paper coating, carpet backing, and paper and textile saturation; non-formaldehyde plywood adhesive, veneer fancy adhesive, middle density fiberboard adhesive, and wood lamination adhesive; emulsion resin for outdoor wall paint; and glove dipping. The company was formerly known as Shin Foong Chemical Industry Co., Ltd and changed its name to Shin Foong Specialty and Applied Materials Co., Ltd. in September 2016. Shin Foong Specialty and Applied Materials Co., Ltd. was founded in 1979 and is headquartered in Pingtung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Pingtung",
        "zipcode": "94048",
        "website": "http://www.shinfoong.com.tw",
        "market_cap": "Small Cap"
    },
    "6585.TWO": {
        "short_name": "DingZing",
        "long_name": "DingZing Advanced Materials Inc.",
        "summary": "DingZing Advanced Materials Inc. researches, develops, produces, and sells composite materials and technical films for various industries in Taiwan. Its products include Provecta series of advanced technical films that provide an alternative to rubber and traditional plastic; Advanta technical films for clothing applications; Orkesta series of composite materials with a layer of hot melt film designed to replace conventional materials, such as microfiber or genuine leather; Perfola air hoses and hydration tubes; Aldura transmission and conveyor belts; and DingZing DZ seals. The company's products are used in apparel, automotive, electronic, wearable, footwear, healthcare, optical, outdoor and sport goods, and furniture and bedding applications. DingZing Advanced Materials Inc. is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "81266",
        "website": "http://www.dingzing.com",
        "market_cap": "Small Cap"
    },
    "6737.TWO": {
        "short_name": "SOLIDYEAR",
        "long_name": "Solid Year Co., Ltd.",
        "summary": "Solid Year Co., Ltd. engages in the production of various single-shot and double-shot plastic injection finished products. Its products include computer keyboard, USB network camera, USB network camera module, driving recorder, hunting machine, projector, gamepad, automotive electronics, in-car multimedia audio and video system, smart rear-view mirror, head-up display, iPhone Computer electronic peripheral products, such as Car Box, infant network surveillance camera, etc. The company was founded in 1975 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.solidyear.com",
        "market_cap": "Small Cap"
    },
    "8354.TWO": {
        "short_name": "KOAN HAO TECHNOLOGY CO LTD",
        "long_name": "Koan Hao Technology Co., Ltd.",
        "summary": "Koan Hao Technology Co., Ltd. manufactures and sells self-adhesive labels in Taiwan. It offers release papers, including PE coated Kraft, glassine, clay coated Kraft, and super calandered Kraft paper; film release liners, such as PET, PP, and HDPE release liners; and adhesive tapes, such as surface protective films, adhesive transfer tapes, and film and non-woven tissue double sided adhesive tapes. The company also provides PSA label materials comprising paper, film, tamper evident, and re-sealable labels; and thermal and UV release film tapes, and PE laminated non-woven products, as well as contract coatings. It serves decorative, electronics and optoelectronics, automobiles, logistics, food and beverage, and consumer commodity industries. The company was formerly known as Koan Hao Enterprise Co., Ltd. and changed its name to Koan Hao Technology Co., Ltd. in 2013. Koan Hao Technology Co., Ltd. was founded in 1992 and is headquartered in Nantou City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Nantou City",
        "zipcode": "54066",
        "website": "http://www.koanhao.com",
        "market_cap": "Small Cap"
    },
    "8431.TWO": {
        "short_name": "SUPERIOR PLATING TECHNOLOGY CO ",
        "long_name": "Superior Plating Technology Co., Ltd.",
        "summary": "Superior Plating Technology Co., Ltd. operates as a surface treatment company in Taiwan. The company engages in the research and development of metal and plastic surface treatment technology and manufacturing services. It also provides plating services for the semiconductor lead frames, terminals, strips, and LED stents. In addition, the company provides plating services for HDD products, medical equipment, auto parts, connectors, and OA products; and anodizing services to 3C products and industrial products. Superior Plating Technology Co., Ltd. was founded in 1999 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.superior-sz.com",
        "market_cap": "Small Cap"
    },
    "8935.TWO": {
        "short_name": "PONTEX POLYBLEND CO",
        "long_name": "Pontex Polyblend Co.,Ltd",
        "summary": "Pontex Polyblend Co., Ltd. engages in footwear injection molding and engineering plastics compound materials businesses in Taiwan. It offers ABS, PC, nylon, PP, PBT, NPE, TPU, PLA, PBS, and r-PET plastic products for applications in the areas of 3C/electronic products, industrial equipment parts, auto/moto parts, household goods, sports/toy parts, and medical supplies. The company also provides sports equipment, such as baseball, football, soccer, and bicycle outsoles; and shoe components, including midsoles, shanks, and counters. In addition, it manufactures various women vamps injection products on an OEM basis for the CROCS' brand. Pontex Polyblend Co., Ltd. was founded in 1982 and is headquartered in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "42742",
        "website": "http://www.pontex.com",
        "market_cap": "Small Cap"
    }
}