{
    "1527.TW": {
        "short_name": "BASSO INDUSTRY",
        "long_name": "Basso Industry Corp.",
        "summary": "Basso Industry Corp. manufactures and sells pneumatic nailers and automotive air tools in the United States, Germany, Taiwan, Japan, Belgium, and internationally. The company offers pneumatic nailer, gas nailer, automotive air impact wrench, air ratchet wrench, intelligent industrial nailer, air saw and air hammer, air sander, air grinder, air carton closer, magnesium and aluminum alloy die-casting parts, and high-pressure pneumatic nailer and equipment. It also provides wire, finish, sheathing, and insulation staplers; headless pinners and other specialty products; corrugated, finish and concrete, angle finishing, angle framing, coil, collated joist hanger, anchor, palm, metal connector, and anchoring nailers; air drill and screw drivers; and OEM/ODM services. Basso Industry Corp. was founded in 1983 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "1541.TW": {
        "short_name": "CHANG TYPE INDUSTRIAL CO",
        "long_name": "CHANG TYPE Industrial Co., Ltd.",
        "summary": "CHANG TYPE Industrial Co., Ltd. researches, develops, manufactures, and sells power tools. It provides miter, radial arm, band, and scroll saws. The company's products are used in other power tools, lawn and gardening, consumer electronics, and fitness applications. It also offers motors and IC control boards. The company was founded in 1989 and is based in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "2049.TW": {
        "short_name": "HIWIN TECHNOLOGIES CORP",
        "long_name": "Hiwin Technologies Corp.",
        "summary": "Hiwin Technologies Corp. manufactures and sells motion control and systematic technology products worldwide. The company operates through Linear Guideways, Ballscrews, and Others segments. It offers ballscrews, linear guideways, end effectors, datorker robot reducers, bearings, and torque motor rotary tables, as well as single and multi-axis robots; and medical robots and equipment; and aerospace automation equipment parts, as well as computer numerical control milling machines. The company provides components, industrial robots, special machines, and after-sales services for machine tools, industrial machinery, bioscience, medical equipment, equipment of electronics industry, photo-electricity, semiconductor devices and automation, etc. It also engages in the research, development, design, and manufacture of solar cells, electronic components, electric power supplies, and electric transmission and power distribution machinery products, as well as gear cutting tools and machinery; provision of thread forming machinery; and sale of gear cutting tools and machinery. The company offers its products under the HIWIN brand name. Hiwin Technologies Corp. was founded in 1989 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "3004.TW": {
        "short_name": "NATIONAL AEROSPACE FASTENERS CO",
        "long_name": "National Aerospace Fasteners Corporation",
        "summary": "National Aerospace Fasteners Corporation manufactures and sells fastener products for the aerospace, electronics, and high-end industrial sectors in Taiwan and internationally. The company offers aero products, including bolts; nuts, such as hex nuts, 10 PT nuts, double hex nuts, spline nuts kits, shank nuts, gang channels, and anchor nuts; and CNC products comprising tubes, stampings, links, latches, and fittings, as well as other products consisting of adapters, brackets, bushings, clamps, flanges, guides, housings, inertial dampers, pins, fixing plates, retainers, seals, sleeves, spacers, weights, etc. that are used in aircraft engines and airframes. It also provides industrial products, such as blind rivet nuts, rivet studs, brass inserts, machining and customized parts, and high temperature resistant self-locking nuts used in automobiles, ships, public transportation vehicles, and various other industrial products. The company was founded in 1997 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "4999.TW": {
        "short_name": "SINHER TECHNOLOGY INC",
        "long_name": "Sinher Technology Inc.",
        "summary": "Sinher Technology Inc. engages in the research and development, manufacture, and sale of various hinge products in Taiwan. The company offers NB hinges, including auto locks, springs, band type hinges, centrals, shafts, and Zn with plate and bend type hinges. It also provides detachable, NB module, and tablet module hinges; AIO and LCD hinges, such as base design type, picture frame type, and multi rotation type hinges; and 3C hinges comprising projector and POS hinges, as well as car hinge and projector products. Sinher Technology Inc. was founded in 2002 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "5007.TW": {
        "short_name": "SAN SHING FASTECH CORP",
        "long_name": "San Shing Fastech Corp.",
        "summary": "San Shing Fastech Corp. manufactures and sells steel nuts worldwide. The company offers nut products, including weld, flange, clinch, slotted, locking, wheel, nylon insert, hot forming square and hot forming, and GEOMET coating, as well as auto parts, torque converter parts, customized fasteners, collar, sleeve and spacer, and nut with washer; and bolt products, such as knurled, weld, external 6-lobe, GEOMET coating, shoulder, clinch, special alloy, customized, internal serrated, internal 6-lobe, and double end bolts. It also provides washers, stamping washers and fasteners, and stamping parts and assembly parts; tooling products, which include segmented dies for nut and bolt, carbide six-lobe punch and dies, carbide hex punch, and hot forging and customized tooling; and machinery, such as nut and bolt formers, spindles an round nut tapping machines, optical nut and bolt sorting machines, bolt measurement systems, and nylon insert assembly machines. The company was formerly known as San Shing Hardware Works Co., Ltd. and changed its name to San Shing Fastech Corp. in July 2002. San Shing Fastech Corp. was founded in 1965 and is based in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Tainan"
    },
    "8021.TW": {
        "short_name": "TOPOINT TECHNOLOGY CO LTD",
        "long_name": "Topoint Technology Co., Ltd.",
        "summary": "Topoint Technology Co., Ltd., together with its subsidiaries, manufactures and sells micro-drills, numerically controlled drilling machines, and peripheral equipment for printed circuit boards in Taiwan, Mainland China, and internationally. The company offers products, such as drill bit, a product used in PCB mechanical drilling process; router bit, a material used for achieving necessary outlines; and slot drills used in cutting forces, as well as logarithmic cylindrical roller, a solution for conventional bearing manufactures. It also provides standard cutting tools used in industrial milling applications, which include stamping, and profile and face milling; and customized cutting tools for metal casing production and metal injection process. In addition, the company offers drilling services comprising mechanical and laser drilling, routing, and CCD routing services. Topoint Technology Co., Ltd. was founded in 1996 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    }
}