{
    "1527.TW": {
        "short_name": "BASSO INDUSTRY",
        "long_name": "Basso Industry Corp.",
        "summary": "Basso Industry Corp. manufactures and sells pneumatic nailers and automotive air tools in the United States, Germany, Taiwan, Japan, Belgium, and internationally. The company offers pneumatic nailer, gas nailer, automotive air impact wrench, air ratchet wrench, intelligent industrial nailer, air saw and air hammer, air sander, air grinder, air carton closer, magnesium and aluminum alloy die-casting parts, and high-pressure pneumatic nailer and equipment. It also provides wire, finish, sheathing, and insulation staplers; headless pinners and other specialty products; corrugated, finish and concrete, angle finishing, angle framing, coil, collated joist hanger, anchor, palm, metal connector, and anchoring nailers; air drill and screw drivers; and OEM/ODM services. Basso Industry Corp. was founded in 1983 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "40768",
        "website": "http://www.basso.com.tw",
        "market_cap": "Mid Cap"
    },
    "1541.TW": {
        "short_name": "CHANG TYPE INDUSTRIAL CO",
        "long_name": "CHANG TYPE Industrial Co., Ltd.",
        "summary": "CHANG TYPE Industrial Co., Ltd. researches, develops, manufactures, and sells power tools. It provides miter, radial arm, band, and scroll saws. The company's products are used in other power tools, lawn and gardening, consumer electronics, and fitness applications. It also offers motors and IC control boards. The company was founded in 1989 and is based in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": null,
        "website": "http://www.toty.com.tw",
        "market_cap": "Mid Cap"
    },
    "1570.TWO": {
        "short_name": "DE POAN PNEUMATIC CORP",
        "long_name": "De Poan Pneumatic Corp.",
        "summary": "De Poan Pneumatic Corp. manufactures and sells professional pneumatic tools worldwide. The company offers nailer products, including industrial and framing coil, cordless, framing, roofing, finishing, palm, and brad nailers; and staplers, cap tools, and pinners. It also provides air tools such as composite and aluminum wrench and air saw. The company was founded in 1983 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "24947",
        "website": "http://www.depoan.com",
        "market_cap": "Small Cap"
    },
    "1585.TWO": {
        "short_name": "TOPGREEN",
        "long_name": "TopGreen Technology Co., Ltd.",
        "summary": "TopGreen Technology Co., Ltd. manufactures and sells various cutting tools in Taiwan and internationally. Its products comprise composite rods, mechanical cutting tools, micro cutting tools, tapping tools, PCB tools, medical tools, diamond tools, aircraft cutting tools, special molding tools, blanks, custom tools, precision punch tools, etc. The company was founded in 2000 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "237",
        "website": "http://www.topgreentech.com",
        "market_cap": "Small Cap"
    },
    "2049.TW": {
        "short_name": "HIWIN TECHNOLOGIES CORP",
        "long_name": "Hiwin Technologies Corp.",
        "summary": "Hiwin Technologies Corp. manufactures and sells motion control and systematic technology products worldwide. The company operates through Linear Guideways, Ballscrews, and Others segments. It offers ballscrews, linear guideways, end effectors, datorker robot reducers, bearings, and torque motor rotary tables, as well as single and multi-axis robots; and medical robots and equipment; and aerospace automation equipment parts, as well as computer numerical control milling machines. The company provides components, industrial robots, special machines, and after-sales services for machine tools, industrial machinery, bioscience, medical equipment, equipment of electronics industry, photo-electricity, semiconductor devices and automation, etc. It also engages in the research, development, design, and manufacture of solar cells, electronic components, electric power supplies, and electric transmission and power distribution machinery products, as well as gear cutting tools and machinery; provision of thread forming machinery; and sale of gear cutting tools and machinery. The company offers its products under the HIWIN brand name. Hiwin Technologies Corp. was founded in 1989 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "40852",
        "website": "http://www.hiwin.com.tw",
        "market_cap": "Large Cap"
    },
    "2063.TWO": {
        "short_name": "SHEH KAI PRECISION CO LTD",
        "long_name": "Sheh Kai Precision Co., Ltd.",
        "summary": "Sheh Kai Precision Co., Ltd. manufactures and sells bi metal screws, screw anchors, and screws in Taiwan and internationally. It offers bi-metal window, concrete, self tapping, self drilling, and wing screws, as well as self piercing screws and side lap screws; hammer and diamond drill bits, and dust caps; and bi-metal concrete screw anchors, bi-metal concrete anchor stainless steel internal thread heads, galvanized concrete screw anchors, and galvanized concrete screw anchors internal thread heads. The company also provides wood screws, stainless steel self-tapping screw sharps/blue points, special fasteners, hex lag screws, double end hanger bolts, carriage bolts, and automotive fasteners. Its products are used in various applications, such as roof wall steel fastening, curtain wall window, and concrete anchor systems, as well as concrete anchor products. The company was formerly known as Sheh Kai Industrial Co., Ltd. and changed its name to Sheh Kai Precision Co., Ltd. in 2003. Sheh Kai Precision Co., Ltd. was founded in 1992 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "82059",
        "website": "http://www.shehkai.com.tw",
        "market_cap": "Small Cap"
    },
    "2065.TWO": {
        "short_name": "SHEH FUNG SCREWS CO LTD",
        "long_name": "Sheh Fung Screws Co., Ltd.",
        "summary": "Sheh Fung Screws Co., Ltd. manufactures and sells screws primarily in Taiwan. The company provides various screws, including self-drilling, timber construction, drywall, chipboard, self-tapping, decking, self-piercing screws, and other screws. It also offers hammer drill bits, customized fastener parts, kaitex coatings, and packing boxes. The company was founded in 1973 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "825",
        "website": "http://www.shehfung.com",
        "market_cap": "Mid Cap"
    },
    "2066.TWO": {
        "short_name": "SUMEEKO INDUSTRIES",
        "long_name": "Sumeeko Industries Co., Ltd.",
        "summary": "Sumeeko Industries Co., Ltd. manufactures, repairs, and sells automotive parts, hardware parts, mechanical parts, and screws. It offers power trains, suspensions, transmissions, exhausts, chassis, and interior parts for use in automobiles; appliances; and products for use in mechanism, construction, and other applications. The company was founded in 1988 and is based in Kaohsiung City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "831",
        "website": "http://www.sumeeko.com",
        "market_cap": "Small Cap"
    },
    "3004.TW": {
        "short_name": "NATIONAL AEROSPACE FASTENERS CO",
        "long_name": "National Aerospace Fasteners Corporation",
        "summary": "National Aerospace Fasteners Corporation manufactures and sells fastener products for the aerospace, electronics, and high-end industrial sectors in Taiwan and internationally. The company offers aero products, including bolts; nuts, such as hex nuts, 10 PT nuts, double hex nuts, spline nuts kits, shank nuts, gang channels, and anchor nuts; and CNC products comprising tubes, stampings, links, latches, and fittings, as well as other products consisting of adapters, brackets, bushings, clamps, flanges, guides, housings, inertial dampers, pins, fixing plates, retainers, seals, sleeves, spacers, weights, etc. that are used in aircraft engines and airframes. It also provides industrial products, such as blind rivet nuts, rivet studs, brass inserts, machining and customized parts, and high temperature resistant self-locking nuts used in automobiles, ships, public transportation vehicles, and various other industrial products. The company was founded in 1997 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "32466",
        "website": "http://www.nafco.com.tw",
        "market_cap": "Mid Cap"
    },
    "3178.TWO": {
        "short_name": "GONGIN PRECISION INDUSTRIAL CO",
        "long_name": "Gongin Precision Ind. Co., Ltd",
        "summary": "Gongin Precision Ind. Co., Ltd designs, manufactures, and sells IC assembly molds and tools in Taiwan. It offers auto mold chase, and MGP and conventional molds; and wafer fabrication equipment components, such as standard and critical/clean room module components, subsystem assembly and test components, and supply chain and system level assembly and testing components. The company also provides display equipment components, including electros, reactors, ground shields, frames, floating masks, chambers, nozzles, TCP/COF, and test fixtures. In addition, it offers landing gear actuators; engine components comprising combustion and transition liners, compressor vanes and retainer rings, hula seals, and other engine hot section sheet metal parts; motion control components, such as servo valve body/housing, servo valve components, relief valve-hydraulics, and actuators; and machined components for the aerospace industry. Further, the company provides micro turbine and combustion generator components, and micro turbine engines; and servo valves for industrial machinery, vehicles, and aviation applications. Gongin Precision Ind. Co., Ltd was founded in 1978 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "81453",
        "website": "http://www.gongin.com.tw",
        "market_cap": "Mid Cap"
    },
    "4163.TWO": {
        "short_name": "INTAI TECHNOLOGY CORP",
        "long_name": "INTAI Technology Corporation",
        "summary": "INTAI Technology Corporation manufactures and sells precision hardware products for the automotive, aerospace, precision hardware, medical device, and electronic communication industries in Taiwan and internationally. The company provides standard and customized precision fasteners. It also offers medical components for endoscopic minimally invasive surgery, breast biopsy device, and disposable and reusable device applications; and orthopedic implants, such as thoracolumbar sets, cervical sets, pedical screws, peek and titanium cages, trauma screws and plates, and surgical instruments. In addition, the company provides RF and microwave products. INTAI Technology Corporation was founded in 1988 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "408",
        "website": "http://www.intai.com.tw",
        "market_cap": "Mid Cap"
    },
    "4999.TW": {
        "short_name": "SINHER TECHNOLOGY INC",
        "long_name": "Sinher Technology Inc.",
        "summary": "Sinher Technology Inc. researches and develops, manufactures, and sells various hinge products in Taiwan. The company offers NB hinges, including auto locks, springs, band type hinges, centrals, shafts, and Zn with plate pipe and bend type hinges. It also provides detachable, NB module, and tablet module hinges; AIO and LCD hinges, such as base design type, picture frame type, and multi rotation type hinges; and 3C hinges comprising projector and POS hinges, as well as car hinge and projector products. The company was founded in 2002 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "22180",
        "website": "http://www.sinher.com.tw",
        "market_cap": "Mid Cap"
    },
    "5007.TW": {
        "short_name": "SAN SHING FASTECH CORP",
        "long_name": "San Shing Fastech Corp.",
        "summary": "San Shing Fastech Corp. manufactures and sells steel nuts worldwide. The company offers nut products, including weld, flange, clinch, slotted, locking, wheel, nylon insert, hot forming square and hot forming, and GEOMET coating, as well as auto parts, torque converter parts, customized fasteners, collar, sleeve and spacer, and nut with washer; and bolt products, such as knurled, weld, external 6-lobe, GEOMET coating, shoulder, clinch, special alloy, customized, internal serrated, internal 6-lobe, and double end bolts. It also provides washers, stamping washers and fasteners, and stamping parts and assembly parts; tooling products, which include segmented dies for nut and bolt, carbide six-lobe punch and dies, carbide hex punch, and hot forging and customized tooling; and machinery, such as nut and bolt formers, spindles an round nut tapping machines, optical nut and bolt sorting machines, bolt measurement systems, and nylon insert assembly machines. The company was formerly known as San Shing Hardware Works Co., Ltd. and changed its name to San Shing Fastech Corp. in July 2002. San Shing Fastech Corp. was founded in 1965 and is based in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan",
        "zipcode": "711",
        "website": "http://www.sanshing.com.tw",
        "market_cap": "Large Cap"
    },
    "5011.TWO": {
        "short_name": "OFCO INDUSTRIAL CORPORATION",
        "long_name": "OFCO Industrial Corporation",
        "summary": "OFCO Industrial Corporation engages in the manufacture and sale of fastener products in Taiwan. Its products include screws, nuts, bolts, and structural assemblies. The company was formerly known as Oriental Fastener Industry LTD. and changed its name to OFCO Industrial Corporation in 2004. OFCO Industrial Corporation was founded in 1984 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "825",
        "website": "http://www.ofco.com.tw",
        "market_cap": "Small Cap"
    },
    "5015.TWO": {
        "short_name": "RODEX FASTENERS CORP",
        "long_name": "Rodex Fasteners Corp.",
        "summary": "Rodex Fasteners Corp. manufactures and sells stainless steel wires and precision made screws worldwide. The company offers stainless steel wires, tapping screws, chipboard screws, machine screws, self-drilling screws, socket cap screws, socket set screws, stainless steel blind rivets, stainless steel thread cutting screws, triangular thread screws, wood screws, high-low thread screws, coarse thread screws, drywall screws, security screws, washer assembly of sems, screws for automatic line, electronic screws, JIS screws, special screws, hexagon nuts, and hexagon nylon lock nuts. Rodex Fasteners Corp. was founded in 1984 and is based in Chungli, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Chungli",
        "zipcode": "32062",
        "website": "http://www.rodex.com.tw",
        "market_cap": "Small Cap"
    },
    "6234.TWO": {
        "short_name": "TERA AUTOTECH CORP",
        "long_name": "Tera Autotech Corporation",
        "summary": "Tera Autotech Corporation manufactures and sells automation equipment in Taiwan. The company offers automatic storage and logistic equipment; whole plant automated logistic equipment; automatic re-grind machines, product inspection machines, RGV machines, and lock screw machines; CNC machines, welding equipment, and chamber processing machines; and measurement equipment. It also offers drill products, including standard, micro, large, UC, and slot drills, as well as router bits. The company was formerly known as Tera Automation Corporation and changed its name to Tera Autotech Corporation in 2001. Tera Autotech Corporation was founded in 1982 and is based in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "437",
        "website": "http://www.teraauto.com.tw",
        "market_cap": "Mid Cap"
    },
    "6705.TWO": {
        "short_name": "MARTAS",
        "long_name": "MARTAS Precision Slide Co., Ltd.",
        "summary": "MARTAS Precision Slide Co.,Ltd manufactures and sells ball bearing slides for various applications in Taiwan. Its products are used in server rails, cabinets, and cloud computing devices; tool cabinets, fire cabinets, ATM machines, ending machines, POS machines, and upright open showcases; and office furniture, computer desks, copy machines, and fax machines, as well as in kitchen cabinets, dish washers, ovens, and refrigerators. The company's products are also used for automotive applications, such as in sliding arm rests, under seat and glove box storage, and luggage compartments; and residential applications for living rooms, TV cabinets, bedrooms, closets, cupboards, and restaurants. MARTAS Precision Slide Co.,Ltd was founded in 1996 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23680",
        "website": "http://www.martas-online.com",
        "market_cap": "Small Cap"
    },
    "8021.TW": {
        "short_name": "TOPOINT TECHNOLOGY CO LTD",
        "long_name": "Topoint Technology Co., Ltd.",
        "summary": "Topoint Technology Co., Ltd., together with its subsidiaries, manufactures and sells micro-drills, numerically controlled drilling machines, and peripheral equipment for printed circuit boards in Taiwan, Mainland China, and internationally. The company offers products, such as drill bit, a product used in PCB mechanical drilling process; router bit, a material used for achieving necessary outlines; and slot drills used in cutting forces, as well as logarithmic cylindrical roller, a solution for conventional bearing manufactures. It also provides standard cutting tools used in industrial milling applications, which include stamping, and profile and face milling; and customized cutting tools for metal casing production and metal injection process. In addition, the company offers drilling services comprising mechanical and laser drilling, routing, and CCD routing services. Topoint Technology Co., Ltd. was founded in 1996 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "238",
        "website": "http://www.topoint.tw",
        "market_cap": "Mid Cap"
    },
    "8349.TWO": {
        "short_name": "QST INTERNATIONAL CORP",
        "long_name": "QST International Corp.",
        "summary": "QST International Corp. manufactures and sells automotive fasteners and metal parts worldwide. It provides proprietary fasteners, such as screws and induction hardened bolts; and auto fasteners, including weld bolts and weld studs, screws and washer assemblies, multi-die headed pins and rivets, and special screws per print, as well as internal, external, and non-fasteners. The company also offers third party testing and consulting services, as well as training services; and logistics services, including tailored services that consist of JIT, kanban, VMI, Bar Code, 2 Bin, in-house crib and products integration, localization, joint design, and value analysis and engineering to OEM assembly plants, as well as operates Halofast.com/VMI, a Web-based EDI platform to provide remote VMI service. QST International Corp. was founded in 1985 and is headquartered in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan",
        "zipcode": "701",
        "website": "http://www.qst.com.tw",
        "market_cap": "Mid Cap"
    },
    "8349A.TWO": {
        "short_name": "QST INTERNATIONAL CORP",
        "long_name": "QST International Corp.",
        "summary": "QST International Corp. manufactures and sells automotive fasteners and metal parts worldwide. It provides proprietary fasteners, such as screws and induction hardened bolts; and auto fasteners, including weld bolts and weld studs, screws and washer assemblies, multi-die headed pins and rivets, and special screws per print, as well as internal, external, and non-fasteners. The company also offers third party testing and consulting services, as well as training services; and logistics services, including tailored services that consist of JIT, kanban, VMI, Bar Code, 2 Bin, in-house crib and products integration, localization, joint design, and value analysis and engineering to OEM assembly plants, as well as operates Halofast.com/VMI, a Web-based EDI platform to provide remote VMI service. QST International Corp. was founded in 1985 and is headquartered in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan",
        "zipcode": "701",
        "website": "http://www.qst.com.tw",
        "market_cap": null
    },
    "8415.TWO": {
        "short_name": "BRIGHTON-BEST INTERNATION (TAIW",
        "long_name": "Brighton-Best International (Taiwan) Inc.",
        "summary": "Brighton-Best International (Taiwan) Inc. sells screws and nuts primarily in Taiwan, North America, and Oceania. It also engages in import, export, and sale of aluminum products; and investment activities. The company was founded in 2007 and is based in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "71752",
        "website": "http://www.brighton-best.com.tw",
        "market_cap": "Large Cap"
    }
}