{
    "2734.TWO": {
        "short_name": "EZFLY INTERNATIONAL TRAVEL AGEN",
        "long_name": "Ezfly International Travel Agent Co., Ltd.",
        "summary": "Ezfly International Travel Agent Co., Ltd. operates as an online travel agency in Taiwan. The company offers ticket purchase and booking services; and sells domestic air tickets, foreign individual air tickets, and foreign group air tickets. It also provides domestic and international reservation, group travel, mini tour, group and airline free travel, and themed tickets, as well as foreign dynamic packaging free travel, themed project travel, domestic high-speed rail holiday travel, domestic bus travel, various European and Japanese railway ticket, visa, and other travel products. The company offers its services through its ezfly.com website. The company was founded in 1988 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.ezfly.com",
        "market_cap": "Small Cap"
    },
    "2743.TWO": {
        "short_name": "RICHMOND INTL TRAVEL & TOURS CO",
        "long_name": "Richmond International Travel & Tours Co.,Ltd",
        "summary": "Richmond International Travel & Tours Co.,Ltd provides travel transportation services under the Shan Fu Tourism brand. It offers passenger services, such as passport visa, Wi-fi rental, translator/headset, and tourism encyclopedia; and professional services, such as outbound, inbound, and national tourism, as well as ticket ordering service. The company offers its products through an e-commerce platform. Richmond International Travel & Tours Co.,Ltd was founded in 1988 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://www.travel4u.com.tw",
        "market_cap": "Small Cap"
    },
    "2745.TWO": {
        "short_name": "LIFE TRAVEL & TOURIST SERVICE C",
        "long_name": "Life Travel & Tourist Service Co., Ltd.",
        "summary": "Life Travel & Tourist Service Co., Ltd. provides group tourism products and services to domestic and foreign tourists in Taiwan. The company was founded in 1988 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": null,
        "website": "http://www.lifetour.com.tw",
        "market_cap": "Small Cap"
    },
    "5706.TW": {
        "short_name": "PHOENIX TOURS INTL INC",
        "long_name": "Phoenix Tours International, Inc.",
        "summary": "Phoenix Tours International, Inc., together with its subsidiaries, provides travel agency services in Taiwan. The company offers foreign group travel, mini and free tour, cruise vacation, international tickets, domestic and international reservations, Taiwan tourism, rail service, online consultation, domestic and international group travel, as well as free travel, passport, and visas for various countries. It also provides Phoenix Portable Cloud App. The company was founded in 1957 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "104",
        "website": "http://www.travel.com.tw",
        "market_cap": "Mid Cap"
    }
}