{
    "2E2.F": {
        "short_name": "EXTERRAN CORP  DL-,01",
        "long_name": "Exterran Corporation",
        "summary": "Exterran Corporation, a systems and process company, provides various solutions in the oil, gas, water, and power markets worldwide. The company operates through three segments: Contract Operations, Aftermarket Services, and Product Sales. It offers compression, processing, and treating services through the operation of natural gas compression equipment, and crude oil and natural gas production and process equipment; and water treatment and power solutions. The company also sells parts and components; and provides operation, maintenance, overhaul, upgrade, startup and commissioning, and reconfiguration services. In addition, it designs, engineers, manufactures, sells, and installs natural gas compression packages and equipment, such as wellheads, gatherings, residue and high pressure natural gas compression equipment, cryogenic plants, mechanical refrigeration and dew point control plants, condensate stabilizers, water treatment equipment, integrated power generation, and skid-mounted production packages used in treating and processing of crude oil and natural gas. Further, the company sells custom-engineered and built-to-specification natural gas and oil processing and treating equipment; and skid-mounted natural gas compression equipment and pre-engineered compressor units. It serves integrated and national oil and natural gas companies, national energy companies, and independent oil and natural gas producers, as well as oil and natural gas processors, gatherers, and pipeline operators. Exterran Corporation was founded in 2007 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Houston"
    },
    "43C.F": {
        "short_name": "CACTUS INC. CL.A  DL-,01",
        "long_name": "Cactus, Inc.",
        "summary": "Cactus, Inc. designs, manufactures, sells, and rents a range of wellheads and pressure control equipment. The company's principal products include Cactus SafeDrill wellhead systems, Cactus SafeLink systems, frac stacks, zipper manifolds, and production trees. It also provides field services, such as 24-hour service crews to assist with the installation, maintenance, repair, and safe handling of the wellhead and pressure control equipment. The company sells or rents its products for onshore unconventional oil and gas wells that are utilized during the drilling, completion, and production phases of its customers' wells. It operates 14 service centers in the United States, as well as 3 service centers in Eastern Australia. Cactus, Inc. was founded in 2011 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Houston"
    },
    "54E.F": {
        "short_name": "ARCHROCK INC.  DL-,01",
        "long_name": "Archrock, Inc.",
        "summary": "Archrock, Inc. operates as a midstream energy infrastructure company in the United States. It operates in two segments, Contract Operations and Aftermarket Services. The company offers natural gas compression services to customers in the oil and natural gas industry. It also provides various aftermarket services, such as parts and components; and operation, maintenance, overhaul, and reconfiguration services to customers who own compression equipment. The company was formerly known as Exterran Holdings, Inc. and changed its name to Archrock, Inc. in November 2015. Archrock, Inc. was founded in 1990 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Houston"
    },
    "5M8.F": {
        "short_name": "MAMMOTH ENER.SVCS DL-,01",
        "long_name": "Mammoth Energy Services, Inc.",
        "summary": "Mammoth Energy Services, Inc. operates as an oilfield service company. The company operates in three segments: Infrastructure Services, Pressure Pumping Services, and Natural Sand Proppant Services. The Infrastructure Services segment offers a range of services on electric transmission and distribution, networks and substation facilities, including the construction, upgrade, maintenance, and repair of high voltage transmission lines, substations, and lower voltage overhead and underground distribution systems; storm repair and restoration services; and commercial services comprising installation, maintenance, and repair of commercial wiring. The Pressure Pumping Services segment provides high-pressure hydraulic fracturing services to enhance the production of oil and natural gas from formations having low permeability. The Natural Sand Proppant Services segment is involved in mining, processing, and selling proppant for hydraulic fracturing; buying processed sand from suppliers on the spot market and reselling that sand; and providing logistics solutions to facilitate delivery of frac sand products. The company also offers other energy services, including contract land and directional drilling, coil tubing, pressure control, flowback, cementing, acidizing, equipment rental, crude oil hauling, and remote accommodation services. It serves government-funded utilities, private and public investor owned utilities, co-operative utilities, independent oil and natural gas producers and land-based drilling contractors in North America. The company was founded in 2014 and is headquartered in Oklahoma City, Oklahoma.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Oklahoma City"
    },
    "68V.F": {
        "short_name": "BAKER HUGHES CO.",
        "long_name": "Baker Hughes Company",
        "summary": "Baker Hughes Company provides a portfolio of technologies and services worldwide. The company operates through four segments: Oilfield Services (OFS), Oilfield Equipment (OFE), Turbomachinery & Process Solutions (TPS), and Digital Solutions (DS). The OFS segment offers drilling, wireline, evaluation, completion, production, and intervention services; and drilling and completions fluids, completions tools and systems, wellbore intervention tools and services, artificial lift systems, pressure pumping systems, and oilfield and industrial chemicals for oil and natural gas, and oilfield service companies. The OFE segment designs and manufactures products and services, including pressure control equipment and services, subsea production systems and services, drilling equipment, and flexible pipeline systems; and onshore and offshore drilling and production systems, and equipment for floating production platforms, as well as provides services related to onshore and offshore drilling activities. The TPS segment provides equipment and related services for mechanical-drive, compression, and power-generation applications across the oil and gas industry. Its product portfolio includes drivers, compressors, and turnkey solutions; and pumps, valves, and compressed natural gas and small-scale liquefied natural gas solutions. This segment serves upstream, midstream, onshore and offshore, and industrial, as well as engineering, procurement, and construction companies. The DS segment provides sensor-based measurement, non-destructive testing and inspection, turbine, generator and plant controls, and condition monitoring, as well as pipeline integrity solutions for a range of industries, including oil and gas, power generation, aerospace, metals, and transportation. It serves through direct and indirect channels. The company was formerly known as Baker Hughes, a GE company and changed its name to Baker Hughes Company in October 2019. Baker Hughes Company is based in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Houston"
    },
    "9KG.F": {
        "short_name": "NEXTIER OILF.SOL. DL-,01",
        "long_name": "NexTier Oilfield Solutions Inc.",
        "summary": "NexTier Oilfield Solutions Inc., through its subsidiaries, provides well completion and production services in various active and demanding basins. The company's Completion Services segment offers hydraulic fracturing services to enhance production of oil and natural gas from formations with low permeability and restricted flow of hydrocarbons; wireline services; and perforating, pumpdown, pipe recovery, pressure pumping, and wellsite make-up and pressure testing services. As of December 31, 2019, it had approximately 45 hydraulic fracturing fleets, 118 wireline trucks, and 80 pumpdown units. The company's Well Construction and Intervention Services segment provides cementing services that incorporate custom engineered mixing and blending equipment to ensure precision and accuracy in providing annulus isolation and hydraulic seal, while protecting fresh water zones from our customers' zone of interest; and engineering software and technical guidance for remedial cementing applications, and acidizing to optimize the performance of its customers' wells. It also offers coiled tubing services to help customers in accomplishing various goals in their horizontal completion, workover, and well maintenance projects. As of December 31, 2019, this segment had approximately 25 coiled tubing units and 101 cementing units. The company serves integrated and large independent oil and natural gas exploration and production companies in the United States and internationally. NexTier Oilfield Solutions Inc. was founded in 1973 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Houston"
    },
    "ALYE": {
        "short_name": "ALY ENERGY SERVICES INC",
        "long_name": "Aly Energy Services, Inc.",
        "summary": "Aly Energy Services, Inc., together with its subsidiaries, provides oilfield services to oil and gas exploration and production companies primarily in Texas, Oklahoma, and New Mexico. The company offers solids control systems and surface rental equipment. Its surface rental equipment include capacity tanks with circulating systems, associated pumps, and ancillary equipment; and solid control equipment comprises centrifuges and auxiliary components that can be integrated into a closed loop mud system. The company also provides personnel to operate the equipment, as well as for the transportation of equipment, and rig-up and rig-down services. Aly Energy Services, Inc. was founded in 2012 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "AROC": {
        "short_name": "Archrock, Inc.",
        "long_name": "Archrock, Inc.",
        "summary": "Archrock, Inc. operates as a midstream energy infrastructure company in the United States. It operates in two segments, Contract Operations and Aftermarket Services. The company offers natural gas compression services to customers in the oil and natural gas industry. It also provides various aftermarket services, such as parts and components; and operation, maintenance, overhaul, and reconfiguration services to customers who own compression equipment. The company was formerly known as Exterran Holdings, Inc. and changed its name to Archrock, Inc. in November 2015. Archrock, Inc. was founded in 1990 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "B8D.F": {
        "short_name": "BOART LONGYEAR GROUP",
        "long_name": "Boart Longyear Limited",
        "summary": "Boart Longyear Limited, together with its subsidiaries, provides drilling services, and drilling equipment and performance tooling for mining and mineral drilling companies in North America, Latin America, the Asia Pacific, Europe, and Africa. The company operates in two segments, Global Drilling Services and Global Products. It offers surface and underground coring; reverse circulation, rotary, directional, sonic, production, and water supply drilling; and dewatering and pump services for a range of commodities, such as copper, gold, nickel, zinc, uranium, and other metals and minerals. The company also provides underground exploration rigs, top drive coring drill rigs, chuck drive drills, and multipurpose drilling equipment; and underground and surface exploration tooling, such as coring rods, casings, subs, diamond products, and wireline systems. In addition, it offers underground rigs/rock drills, and underground and surface top hammer tooling for operating mines; and non-mining sonic rigs and tooling, and multipurpose rigs. Further, the company provides TruShot, a magnetic survey tool; TruCore, a core orientation system; and parts and services comprising maintenance support, training, commissioning, upgrades, and rig and safety assessment. It also operates My Drill Store, an online Web store. The company was founded in 1890 and is headquartered in Salt Lake City, Utah.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Salt Lake City"
    },
    "BANM": {
        "short_name": "BANNER ENERGY SVCS CORP",
        "long_name": "Banner Energy Services Corp.",
        "summary": "Banner Energy Services Corp. does not have significant operations. It was previously engaged in providing equipment and services to the oil and gas industry. The company is based in Fayetteville, Arkansas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Fayetteville"
    },
    "BASX": {
        "short_name": "BASIC ENERGY SERVICES INC",
        "long_name": "Basic Energy Services, Inc.",
        "summary": "Basic Energy Services, Inc. provides wellsite services to oil and natural gas drilling and producing companies in the United States. Its Well Servicing segment provides services performed with a mobile well servicing rig and ancillary equipment, such as maintenance work involving removal, repair, and replacement of down-hole equipment; hoisting tools and equipment required by the operation into and out of the well, or removing equipment from the well bore; and plugging and abandonment services, as well as manufactures and sells workover rigs. As of December 31, 2019, this segment operated a fleet of 306 well servicing rigs. The company's Water Logistics segment provides oilfield fluid supply, transportation, storage, and midstream services, such as the operation of company-owned fresh water and brine source wells and of non-hazardous wastewater disposal wells; sale and transportation of fresh and brine water; transportation of fluids used in drilling, completion, workover, and flowback operations and of saltwater produced as a by-product; rental of portable fracturing tanks and test tanks; recycling and treatment of wastewater, including produced water and flowback; and preparation, construction, and maintenance of access roads, drilling locations, and production facilities. This segment owned and operated 762 fluid service trucks with an average fluid hauling capacity of up to 150 barrels; and owned 87 saltwater disposal wells. Its Completion & Remedial Services segment offers services, including rental and fishing tools; coiled tubing; snubbing services; thru-tubing; and underbalanced drilling in low pressure and fluid sensitive reservoirs. This segment operates 24 air compressor packages, 32 snubbing units, and 9 coiled tubing units. The company was formerly known as Sierra Well Service, Inc. and changed its name to Basic Energy Services, Inc. in 2000. Basic Energy Services, Inc. was founded in 1992 and is headquartered in Fort Worth, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Fort Worth"
    },
    "BKR": {
        "short_name": "Baker Hughes Company",
        "long_name": "Baker Hughes Company",
        "summary": "Baker Hughes Company provides a portfolio of technologies and services worldwide. The company operates through four segments: Oilfield Services (OFS), Oilfield Equipment (OFE), Turbomachinery & Process Solutions (TPS), and Digital Solutions (DS). The OFS segment offers drilling, wireline, evaluation, completion, production, and intervention services; and drilling and completions fluids, completions tools and systems, wellbore intervention tools and services, artificial lift systems, pressure pumping systems, and oilfield and industrial chemicals for oil and natural gas, and oilfield service companies. The OFE segment designs and manufactures products and services, including pressure control equipment and services, subsea production systems and services, drilling equipment, and flexible pipeline systems; and onshore and offshore drilling and production systems, and equipment for floating production platforms, as well as provides services related to onshore and offshore drilling activities. The TPS segment provides equipment and related services for mechanical-drive, compression, and power-generation applications across the oil and gas industry. Its product portfolio includes drivers, compressors, and turnkey solutions; and pumps, valves, and compressed natural gas and small-scale liquefied natural gas solutions. This segment serves upstream, midstream, onshore and offshore, and industrial, as well as engineering, procurement, and construction companies. The DS segment provides sensor-based measurement, non-destructive testing and inspection, turbine, generator and plant controls, and condition monitoring, as well as pipeline integrity solutions for a range of industries, including oil and gas, power generation, aerospace, metals, and transportation. It serves through direct and indirect channels. The company was formerly known as Baker Hughes, a GE company and changed its name to Baker Hughes Company in October 2019. Baker Hughes Company is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "BLFR": {
        "short_name": "BLUEFIRE EQUIPMENT CORPORATION",
        "long_name": "BlueFire Equipment Corporation",
        "summary": "BlueFire Equipment Corporation designs and manufactures drill bits for use in the exploration and production of oil and gas in the United States. It sells and leases polycrystalline diamond cutter (PDC) drill bits to drilling contractors and oil and gas companies, as well as provides repair and after sale services. The company was founded in 2008 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "BLY.AX": {
        "short_name": "BOART FPO",
        "long_name": "Boart Longyear Limited",
        "summary": "Boart Longyear Limited, together with its subsidiaries, provides drilling services, and drilling equipment and performance tooling for mining and mineral drilling companies in North America, Latin America, the Asia Pacific, Europe, and Africa. The company operates in two segments, Global Drilling Services and Global Products. It offers surface and underground coring; reverse circulation, rotary, directional, sonic, production, and water supply drilling; and dewatering and pump services for a range of commodities, such as copper, gold, nickel, zinc, uranium, and other metals and minerals. The company also provides underground exploration rigs, top drive coring drill rigs, chuck drive drills, and multipurpose drilling equipment; and underground and surface exploration tooling, such as coring rods, casings, subs, diamond products, and wireline systems. In addition, it offers underground rigs/rock drills, and underground and surface top hammer tooling for operating mines; and non-mining sonic rigs and tooling, and multipurpose rigs. Further, the company provides TruShot, a magnetic survey tool; TruCore, a core orientation system; and parts and services comprising maintenance support, training, commissioning, upgrades, and rig and safety assessment. It also operates My Drill Store, an online Web store. The company was founded in 1890 and is headquartered in Salt Lake City, Utah.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "United States",
        "city": "Salt Lake City"
    },
    "BMMCF": {
        "short_name": "KBRIDGE ENERGY CORPORATION",
        "long_name": "Kbridge Energy Corp.",
        "summary": "Kbridge Energy Corp. engages in the oil and gas production business in Canada. It also provides consulting services to the resource sector. The company was formerly known as Blue Marble Media Corp. and changed its name to Kbridge Energy Corp. in December 2011. Kbridge Energy Corp. was founded in 2002 and is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Las Vegas"
    },
    "BOARF": {
        "short_name": "BOART LONGYEAR LTD",
        "long_name": "Boart Longyear Limited",
        "summary": "Boart Longyear Limited, together with its subsidiaries, provides drilling services, and drilling equipment and performance tooling for mining and mineral drilling companies in North America, Latin America, the Asia Pacific, Europe, and Africa. The company operates in two segments, Global Drilling Services and Global Products. It offers surface and underground coring; reverse circulation, rotary, directional, sonic, production, and water supply drilling; and dewatering and pump services for a range of commodities, such as copper, gold, nickel, zinc, uranium, and other metals and minerals. The company also provides underground exploration rigs, top drive coring drill rigs, chuck drive drills, and multipurpose drilling equipment; and underground and surface exploration tooling, such as coring rods, casings, subs, diamond products, and wireline systems. In addition, it offers underground rigs/rock drills, and underground and surface top hammer tooling for operating mines; and non-mining sonic rigs and tooling, and multipurpose rigs. Further, the company provides TruShot, a magnetic survey tool; TruCore, a core orientation system; and parts and services comprising maintenance support, training, commissioning, upgrades, and rig and safety assessment. It also operates My Drill Store, an online Web store. The company was founded in 1890 and is headquartered in Salt Lake City, Utah.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Salt Lake City"
    },
    "BOOM": {
        "short_name": "DMC Global Inc.",
        "long_name": "DMC Global Inc.",
        "summary": "DMC Global Inc. engages in technical product and process businesses serving the energy, industrial, and infrastructure markets worldwide. The company operates in two segments, NobelClad and DynaEnergetics. The NobelClad segment produces and sells explosion-welded clad metal plates for use in the construction of heavy, corrosion resistant pressure vessels, and heat exchangers for oil and gas, chemical and petrochemical, alternative energy, hydrometallurgy, aluminum production, shipbuilding, power generation, and industrial refrigeration industries. It sells its products through direct sales personnel, program managers, and independent sales representatives. The DynaEnergetics segment designs, manufactures, markets, and sells perforating systems and associated hardware for the oil and gas industry. It sells its products through direct selling, distributors, and independent sales representatives. The company was formerly known as Dynamic Materials Corporation and changed its name to DMC Global Inc. in November 2016. DMC Global Inc. was founded in 1965 and is headquartered in Broomfield, Colorado.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Broomfield"
    },
    "BWTX": {
        "short_name": "BAKKEN WTR TRANSFER SVCS INC",
        "long_name": "Bakken Water Transfer Services, Inc.",
        "summary": "Bakken Water Transfer Services, Inc., through its subsidiaries, engages in discovering, developing, and distributing green products and services. It intends to develop and market energy saving diode for standard light bulbs; and hydrogen assist cell for internal combustion engines. The company was founded in 1989 and is headquartered in Minot, North Dakota.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Minot"
    },
    "CCLP": {
        "short_name": "CSI Compressco LP",
        "long_name": "CSI Compressco LP",
        "summary": "CSI Compressco LP provides compression services and equipment for natural gas and oil production, gathering, artificial lift, transmission, processing, and storage companies in the United States, Mexico, Canada, Argentina, and internationally. It fabricates and sells standard and custom-designed engineered compressor packages; and sells engine parts, compressor package parts, and other components manufactured by third-party suppliers, as well as provides aftermarket services, such as operations, maintenance, overhaul, and reconfiguration. The company offers GasJack and VJack electric powered low-horsepower compressor packages to provide production enhancement services for dry gas wells, liquid-loaded gas wells, and backside auto injection systems. It also provides medium-horsepower compressor packages to move natural gas from the wellhead through the field gathering system; and high-horsepower compressor packages for use in midstream applications, including natural gas gathering and centralized compression facilities. In addition, the company offers well monitoring and sand separation, as well as early production services. CSI Compressco GP Inc. serves as the general partner of CSI Compressco LP. The company was formerly known as Compressco Partners, L.P. and changed its name to CSI Compressco LP in December 2014. CSI Compressco LP was founded in 2008 and is headquartered in The Woodlands, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "The Woodlands"
    },
    "CDVIQ": {
        "short_name": "CAL DIVE INTERNATIONAL INC DEL",
        "long_name": "Cal Dive International, Inc.",
        "summary": "Cal Dive International, Inc. operates as a marine contractor that provides manned diving, pipelay and pipe burial, platform installation and salvage, and light well intervention services to the offshore oil and natural gas industry. It owns a fleet of dive support vessels and construction barges. The company has operations in the Gulf of Mexico Outer Continental Shelf, the Northeastern United States, Latin America, Southeast Asia, China, Australia, West Africa, the Middle East, and Europe. Cal Dive International, Inc. was founded in 1975 and is headquartered in Houston, Texas. On March 3, 2015, Cal Dive International, Inc., along with its affiliates, filed a voluntary petition for reorganization under Chapter 11 in the United States Bankruptcy Court for the District of Delaware.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "CELP": {
        "short_name": "Cypress Environmental Partners,",
        "long_name": "Cypress Environmental Partners, L.P.",
        "summary": "Cypress Environmental Partners, L.P. provides independent inspection, integrity, and support services in North America. The company operates in three segments: Pipeline Inspection Services (PIS), Pipeline & Process Services (PPS), and Water and Environmental Services (WES). The PIS segment offers inspection and integrity services on a various infrastructure assets, including midstream pipelines, gathering systems, and distribution systems. This segment also provides various services, such as nondestructive examination, in-line inspection support, pig tracking, survey, data gathering, and supervision of third-party contractors. The PPS segment offers hydrotesting, chemical cleaning, water transfer and recycling, pumping, pigging, flushing, filling, dehydration, caliper runs, ILI tool run support, nitrogen purging, and drying services, as well as test documentation and records retention services. The WES segment owns and operates nine water treatment facilities with ten environmental protection agency class II injection wells in the Bakken shale region of the Williston Basin in North Dakota. This segment offers treatment, recovery, separation, and disposal of waste byproducts generated during the lifecycle of an oil and natural gas well to protect the environment and drinking water. The company serves owners and operators of pipelines and other infrastructure, public utility or local distribution, pipeline construction, oil and natural gas exploration and production, and trucking companies, as well as third-party purchasers of residual oil. Cypress Environmental Partners GP, LLC operates as the general partner of the company. The company was formerly known as Cypress Energy Partners, L.P. and changed its name to Cypress Environmental Partners, L.P. in March 2020. Cypress Environmental Partners, L.P. was founded in 2003 and is headquartered in Tulsa, Oklahoma. Cypress Environmental Partners, L.P. is a subsidiary of Cypress Energy Holdings, LLC.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Tulsa"
    },
    "CHX": {
        "short_name": "ChampionX Corporation",
        "long_name": "ChampionX Corporation",
        "summary": "ChampionX Corporation provides chemistry solutions, and engineered equipment and technologies that help companies to drill for and produce oil and gas worldwide. It offers chemistry solutions to enhance production from flowing oil and gas wells, as well as for drilling and completion activities. The company also provides production and automation technologies, including artificial lift equipment and solutions, such as rod pumping systems, electric submersible pump systems, progressive cavity pumps, and drive systems and plunger lifts; and automation and digital products consisting of equipment and software for industrial internet of things solutions for downhole monitoring, wellsite productivity enhancement, and asset integrity management. In addition, it provides polycrystalline diamond cutters and bearings for drilling. ChampionX Corporation has collaboration agreement with Modumetal Inc. The company was formerly known as Apergy Corporation and changed its name to ChampionX Corporation in June 2020. ChampionX Corporation is based in The Woodlands, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "The Woodlands"
    },
    "CKH": {
        "short_name": "SEACOR Holdings Inc.",
        "long_name": "Seacor Holdings Inc.",
        "summary": "SEACOR Holdings Inc. engages in transportation and logistics, risk management consultancy, and other businesses in the United States and internationally. The company operates through Ocean Transportation & Logistics Services, Inland Transportation & Logistics Services, Witt O'Brien's, and Other segments. The Ocean Transportation & Logistics Services segment owns and operates a fleet of bulk transportation, port and infrastructure, and logistics assets. It operates carriers for the United States coastwise for trade of crude oil, petroleum, and chemical products; and dry bulk vessels. This segment provides deep-sea vessels docking, ocean towing, and oil terminal support and bunkering services; liner, short-sea, rail car, and project cargo transportation and logistics solutions; door-to-door solutions; and technical ship management services, as well as operates pure car/truck carriers. The Inland Transportation & Logistics Services segment offers river transportation equipment for moving agricultural and industrial commodities and containers, and petroleum products; and owns and operates multi-modal terminal locations. It also provides management services related to barge and towboat operations. The Witt O'Brien's segment provides crisis and emergency management services for the public and private sectors. It serves markets in the areas of critical national infrastructure, including government, energy, transportation, healthcare, and education. The Other segment designs, develops, and maintains alternative energy and power solutions; and offers liquefied natural gas and compressed natural gas fuel supply and logistics to commercial, industrial, agricultural, and transportation customers. This segment also engages in the selling, storage, and maintenance of aviation; agricultural commodity trading and logistics businesses; and trading and merchandising of sugar and other commodities. SEACOR Holdings Inc. was founded in 1989 and is based in Fort Lauderdale, Florida.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Fort Lauderdale"
    },
    "CPYJ": {
        "short_name": "CUSTOM DESIGNED COMPRESSOR SYST",
        "long_name": "Custom Designed Compressor Systems, Inc.",
        "summary": "Custom Designed Compressor Systems, Inc., also known as CDC Systems, Inc., engages in manufacturing, leasing, and selling natural gas compressors to the oil and gas industry. The company was founded in 2004 and is headquartered in Bloomfield, New Mexico.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Bloomfield"
    },
    "CTBG": {
        "short_name": "COIL TUBING TECHNOLOGY INC",
        "long_name": "Coil Tubing Technology, Inc.",
        "summary": "Coil Tubing Technology, Inc., a coil tubing company, focuses on the development, marketing, and rental of advanced tools and related technical solutions for use with coil tubing and jointed pipe in the bottom hole assembly for the exploration and production of hydrocarbons worldwide. The company's products include jar accelerator, extended reach, bi-directional jar, jet hammer, jet motor, spinning wash, bumper sub, vibrational agitation, and indexing tools. Its products are used in thru-tubing fishing, thru-tubing workover and intervention, pipeline clean out, and coil tubing lateral drillout operations. The company is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "CTNR": {
        "short_name": "CENTRAL NATURAL RESOURCES",
        "long_name": "Central Natural Resources, Inc.",
        "summary": "Central Natural Resources, Inc. explores and produces oil and gas properties. It holds on-shore properties, with producing properties located in Texas, Louisiana, and the Arkoma Basin. The company also holds steam and metallurgical coal deposits in western Arkansas, eastern Oklahoma, northeastern Oklahoma, and southeastern Kansas; and explores and produces coalbed methane in Sebastian County, Arkansas and LeFlore County, Oklahoma. In addition, it leases real estate properties; and mineral and timber interests in the mid-western and southern United States. Central Natural Resources, Inc. is based in Kansas City, Missouri.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Kansas City"
    },
    "DNOW": {
        "short_name": "NOW Inc.",
        "long_name": "NOW Inc.",
        "summary": "NOW Inc. distributes downstream energy and industrial products for petroleum refining, chemical processing, LNG terminals, power generation utilities, and industrial manufacturing operations in the United States, Canada, and internationally. The company offers its products under the DistributionNOW and DNOW brand names. It provides consumable maintenance, repair, and operating supplies; pipes, valves, fittings, flanges, gaskets, fasteners, electrical products, instrumentations, artificial lift, pumping solutions, valve actuation and modular process, and measurement and control equipment; and mill supplies, tools, safety supplies, and personal protective equipment, as well as applied products and applications, such as artificial lift systems, coatings, and miscellaneous expendable items. The company also offers machine, cutting, power, and hand tools; original equipment manufacturer equipment, including pumps, generator sets, air and gas compressors, dryers, and blowers and valves; modular oil and gas tank battery solutions; and application systems, work processes, parts integration, optimization solutions, and after-sales support. In addition, it provides supply chain and materials management solutions that include procurement, inventory, and warehouse management, as well as solutions for logistics, point of issue technology, project management, business process, and performance metrics reporting. The company serves customers in the upstream, midstream, and downstream sectors of the energy industry, including drilling contractors, well servicing companies, independent and national oil and gas companies, midstream operators, and refineries, as well as petrochemical, chemical, utilities, and other downstream energy processors; and industrial and manufacturing companies. NOW Inc. was incorporated in 2013 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "DNOW.MX": {
        "short_name": "NOW INC",
        "long_name": "NOW Inc.",
        "summary": "NOW Inc. distributes downstream energy and industrial products for petroleum refining, chemical processing, LNG terminals, power generation utilities, and industrial manufacturing operations in the United States, Canada, and internationally. The company offers its products under the DistributionNOW and DNOW brand names. It provides consumable maintenance, repair, and operating supplies; pipes, valves, fittings, flanges, gaskets, fasteners, electrical products, instrumentations, artificial lift, pumping solutions, valve actuation and modular process, and measurement and control equipment; and mill supplies, tools, safety supplies, and personal protective equipment, as well as applied products and applications, such as artificial lift systems, coatings, and miscellaneous expendable items. The company also offers machine, cutting, power, and hand tools; original equipment manufacturer equipment, including pumps, generator sets, air and gas compressors, dryers, and blowers and valves; modular oil and gas tank battery solutions; and application systems, work processes, parts integration, optimization solutions, and after-sales support. In addition, it provides supply chain and materials management solutions that include procurement, inventory, and warehouse management, as well as solutions for logistics, point of issue technology, project management, business process, and performance metrics reporting. The company serves customers in the upstream, midstream, and downstream sectors of the energy industry, including drilling contractors, well servicing companies, independent and national oil and gas companies, midstream operators, and refineries, as well as petrochemical, chemical, utilities, and other downstream energy processors; and industrial and manufacturing companies. NOW Inc. was incorporated in 2013 and is headquartered in Houston, Texas.",
        "currency": "MXN",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Houston"
    },
    "DPDW": {
        "short_name": "DEEP DOWN INC",
        "long_name": "Deep Down, Inc.",
        "summary": "Deep Down, Inc., an oilfield services company, provides deepwater and ultra-deepwater oil production distribution system support services and technologies to the energy and offshore industries in the United States and internationally. The company offers engineering and project management services, including the design, installation, and retrieval of subsea equipment and systems; connection and termination operations services; well-commissioning services; and construction support services. It also provides project management and engineering; spooling; testing and commissioning; storage management; and refurbishment and repurposing of recovered subsea equipment, as well as support services for offshore interventions. In addition, the company offers loose steel tube flying lead, umbilical hardware, and non-helical umbilical products, as well as riser isolation valves and subsea isolation valve services. Further, it provides installation aids, including flying lead installation systems, tensioners, lay chutes, buoyancy modules, clump weights, mud mats, pumping and testing skids, control booths, fluid drum carriers, under-rollers, carousels, running and parking deployment frames, termination shelters, pipe straighteners, subsea deployment basket system, horizontal drive units, and rapid deployment cartridges. The company serves oil and gas companies, subsea equipment manufacturers, subsea equipment installation contractors, offshore drilling contractors, engineering and construction companies, and other companies involved in maritime operations. Deep Down, Inc. was founded in 1997 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "DQU.F": {
        "short_name": "DRIL-QUIP INC.  DL-,01",
        "long_name": "Dril-Quip, Inc.",
        "summary": "Dril-Quip, Inc., together with its subsidiaries, designs, manufactures, sells, and services onshore and offshore drilling and production equipment for use in deepwater, harsh environment, and severe service applications worldwide. The company's principal products include subsea and surface wellheads, subsea and surface production trees, subsea control systems and manifolds, mudline hanger systems, specialty connectors and associated pipes, drilling and production riser systems, liner hangers, wellhead connectors, diverters, and safety valves, as well as downhole tools. It also provides technical advisory services, and rework and reconditioning services, as well as rental and purchase of running tools for use in the installation and retrieval of its products. The company's products are used to explore for oil and gas from offshore drilling rigs, such as floating rigs and jack-up rigs; and for drilling and production of oil and gas wells on offshore platforms, tension leg platforms, and Spars, as well as moored vessels, such as floating production, storage, and offloading monohull moored vessels. It sells its products directly through its sales personnel, independent sales agents, and representatives to integrated, independent, and foreign national oil and gas companies, as well as drilling contractors, and engineering and construction companies. Dril-Quip, Inc. was founded in 1981 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Houston"
    },
    "DRQ": {
        "short_name": "Dril-Quip, Inc.",
        "long_name": "Dril-Quip, Inc.",
        "summary": "Dril-Quip, Inc., together with its subsidiaries, designs, manufactures, sells, and services onshore and offshore drilling and production equipment for use in deepwater, harsh environment, and severe service applications worldwide. The company's principal products include subsea and surface wellheads, subsea and surface production trees, subsea control systems and manifolds, mudline hanger systems, specialty connectors and associated pipes, drilling and production riser systems, liner hangers, wellhead connectors, diverters, and safety valves, as well as downhole tools. It also provides technical advisory services, and rework and reconditioning services, as well as rental and purchase of running tools for use in the installation and retrieval of its products. The company's products are used to explore for oil and gas from offshore drilling rigs, such as floating rigs and jack-up rigs; and for drilling and production of oil and gas wells on offshore platforms, tension leg platforms, and Spars, as well as moored vessels, such as floating production, storage, and offloading monohull moored vessels. It sells its products directly through its sales personnel, independent sales agents, and representatives to integrated, independent, and foreign national oil and gas companies, as well as drilling contractors, and engineering and construction companies. Dril-Quip, Inc. was founded in 1981 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "DWSN": {
        "short_name": "Dawson Geophysical Company",
        "long_name": "Dawson Geophysical Company",
        "summary": "Dawson Geophysical Company provides onshore seismic data acquisition services in the United States and Canada. The company acquires and processes 2-D, 3-D, and multi-component seismic data for its clients, including oil and gas companies, and independent oil and gas operators, as well as providers of multi-client data libraries. Its seismic crews supply seismic data primarily to companies engaged in the exploration and development of oil and natural gas on land and in land-to-water transition areas. The company also serves the potash mining industry. Dawson Geophysical Company was founded in 1952 and is headquartered in Midland, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Midland"
    },
    "EESI": {
        "short_name": "ENCOMPASS ENERGY SERVICES INC",
        "long_name": "Encompass Energy Services, Inc.",
        "summary": "Encompass Energy Services, Inc. does not have significant operations. It intends to identify and act upon a business opportunity in the oil and gas or energy production-related industries in the United States. The company was formerly known as New Source Energy Group, Inc. and changed its name to Encompass Energy Services, Inc. in December 2011. Encompass Energy Services, Inc. was founded in 2008 and is based in Oklahoma City, Oklahoma.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Oklahoma City"
    },
    "ENGT": {
        "short_name": "ENERGY & TECHNOLOGY CORP",
        "long_name": "Energy & Technology, Corp.",
        "summary": "Energy & Technology, Corp. provides engineering, manufacturing, reclamation, sale, destructive, and non-destructive testing (NDT), storage, maintenance, and inspection services for pipes and equipment utilized in the energy industry. It offers engineering services to assist customers in the design, improvement, installation, and integration of NDT components and systems; provides NDT services comprising ultrasonic inspection, electromagnetic inspection, and others; and sells pipes and equipment used in the exploration, drilling, and production of oil and gas. The company also provides manufacturing and reclamation services, including full-length electromagnetic inspection for pipes and equipment utilized in the energy industry; full length ultrasonic inspection systems for new and used pipes, such as drill stem, tubing, casing, and line pipes; and various types of electromagnetic and ultrasonic inspection processes. In addition, it offers wet or dry magnetic particle inspection services; dye penetrant testing or ultrasonic testing of the end areas of plain end and threaded connections comprising drill collars and drilling rig inspection; mill systems and mill surveillance; and testing and consulting services. Energy & Technology, Corp. serves oil companies, steel mills, material suppliers, drilling companies, material rental companies, and engineering companies. The company was formerly known as Technical Industries & Energy Corp. and changed its name to Energy & Technology, Corp. in August 2009. The company was founded in 2006 and is headquartered in Lafayette, Louisiana. Energy & Technology, Corp. is a subsidiary of American Interest, LLC.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Lafayette"
    },
    "ENSV": {
        "short_name": "Enservco Corporation",
        "long_name": "Enservco Corporation",
        "summary": "Enservco Corporation, through its subsidiaries, provides well enhancement and fluid management services to the onshore oil and natural gas industry in the United States. It offers frac water heating, hot oiling, pressure testing, acidizing, bacteria and scale treatment, freshwater and saltwater hauling, fluid disposal, frac tank rental, well site construction, and other general oil field services. The company owns and operates a fleet of approximately 330 specialized trucks, trailers, frac tanks, and other well-site related equipment. It operates in the eastern United States region comprising the southern region of the Marcellus Shale formation and the Utica Shale formation in eastern Ohio; Rocky Mountain region consisting of western Colorado and southern Wyoming, central Wyoming, western North Dakota, and eastern Montana; and the Central United States region, including Eagle Ford Shale and Permian Basin in Texas. The company was incorporated in 1980 and is headquartered in Longmont, Colorado.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "city": "Longmont"
    },
    "EXTN": {
        "short_name": "Exterran Corporation",
        "long_name": "Exterran Corporation",
        "summary": "Exterran Corporation, a systems and process company, provides various solutions in the oil, gas, water, and power markets worldwide. The company operates through three segments: Contract Operations, Aftermarket Services, and Product Sales. It offers compression, processing, and treating services through the operation of natural gas compression equipment, and crude oil and natural gas production and process equipment; and water treatment and power solutions. The company also sells parts and components; and provides operation, maintenance, overhaul, upgrade, startup and commissioning, and reconfiguration services. In addition, it designs, engineers, manufactures, sells, and installs natural gas compression packages and equipment, such as wellheads, gatherings, residue and high pressure natural gas compression equipment, cryogenic plants, mechanical refrigeration and dew point control plants, condensate stabilizers, water treatment equipment, integrated power generation, and skid-mounted production packages used in treating and processing of crude oil and natural gas. Further, the company sells custom-engineered and built-to-specification natural gas and oil processing and treating equipment; and skid-mounted natural gas compression equipment and pre-engineered compressor units. It serves integrated and national oil and natural gas companies, national energy companies, and independent oil and natural gas producers, as well as oil and natural gas processors, gatherers, and pipeline operators. Exterran Corporation was founded in 2007 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "F2I.F": {
        "short_name": "FLOTEK INDS INC. DL-,0001",
        "long_name": "Flotek Industries, Inc.",
        "summary": "Flotek Industries, Inc. provides chemistry and services to the oil and gas industries in the United States and internationally. The company designs, develops, manufactures, packs, markets, distributes, and delivers reservoir-centric fluid systems, including specialty and conventional chemistries for use in oil and gas well drilling, cementing, completion, remediation, and stimulation activities, as well as use in enhanced and improved oil recovery markets under the Complex nano-Fluid, Pressure reducing Fluids, and MicroSolv brand names. It is also involved in the construction and management of automated material handling facilities; and management of loading facilities and blending operations for oilfield service companies. The company serves integrated oil and natural gas, oilfield service, independent oil and natural gas, pressure pumping service, international supply chain management, and national and state-owned oil companies. It sells its products directly through its sales force and contractual agency arrangements, as well as through third party agents. Flotek Industries, Inc. is based in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Houston"
    },
    "FET": {
        "short_name": "Forum Energy Technologies, Inc.",
        "long_name": "Forum Energy Technologies, Inc.",
        "summary": "Forum Energy Technologies, Inc. designs, manufactures, and distributes products to the oil and natural gas industry in the United States and internationally. The company operates through three segments: Drilling & Downhole, Completions, and Production. The Drilling & Downhole segment designs, manufactures, and supplies products and provide related services to the drilling, downhole, and subsea markets, and other markets, such as alternative energy, defense, and communications. This segment offers drilling technologies consisting of capital equipment and a line of products consumed in the drilling; downhole technologies, such as cementing and casing tools, and protection products for artificial lift equipment and cables; and subsea technologies, including robotic vehicles and other capital equipment, specialty components and tools, complementary subsea technical services and rental items, and products used in pipeline infrastructure. The Completions segment provides products and related services to the coiled tubing, stimulation, and intervention markets. This segment offers stimulation and intervention technologies, including hydraulic fracturing pumps, pump consumables, cooling systems, flow iron, wireline cable, and pressure control equipment as well as related recertification and refurbishment services; and coiled tubing products consisting of coiled tubing strings and line pipes. The Production segment designs, manufactures, and supplies products, and provides related equipment and services to the production and infrastructure markets. This segment supplies production equipment, including well site production and process equipment; and a range of industrial and process valves. The company was formerly known as Forum Oilfield Technologies, Inc. and changed its name to Forum Energy Technologies, Inc. in August 2010. Forum Energy Technologies, Inc. was incorporated in 2005 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "FLSS": {
        "short_name": "FORBES ENERGY SERVICES LTD",
        "long_name": "Forbes Energy Services Ltd.",
        "summary": "Forbes Energy Services, Ltd., an independent oilfield services contractor, provides a range of well site services for oil and natural gas drilling and producing companies to develop and enhance the production of oil and natural gas in the United States. It operates through three segments: Well Servicing, Coiled Tubing, and Fluid Logistics. The Well Servicing segment offers well maintenance services, including remedial repairs, and removal and replacement of downhole production equipment; well workovers, such as downhole repairs, re-completions, and re-perforations; completion and swabbing services; plugging and abandonment services; and pressure testing services of oil and natural gas production and scanning tubing for pitting and wall thickness. The Coiled Tubing segment provides various services, such as horizontal completions, well bore clean-outs and maintenance, nitrogen, thru-tubing, formation stimulation using acid and other chemicals, and other pre-and post-hydraulic fracturing well preparation services. The Fluid Logistics segment transports, stores, and disposes various drilling and produced fluids used in oil and natural gas production. This segment is involved in fluid hauling activities; the disposal of salt water, and incidental non-hazardous oil and natural gas wastes produced from oil and natural gas wells; rental of fluid storage tanks for use by oilfield operators to store various fluids at well sites; and sale and transportation of various chemicals and fluids used in drilling, completion, and workover operations for oil and natural gas wells. As of December 31, 2019, the company operated a fleet of 141 well servicing rigs comprising 134 workover rigs and 7 swabbing rigs; 103 fluid service vacuum trucks, trailers, and other hauling trucks; 11 disposal wells; 2,534 fluid storage tanks; and 14 coiled tubing units. Forbes Energy Services, Ltd. was founded in 2003 and is headquartered in Alice, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Alice"
    },
    "FOYJ": {
        "short_name": "FOY JOHNSTON INC",
        "long_name": "Foy-Johnston Inc.",
        "summary": "Foy-Johnston Inc., through its subsidiary, Cameroon Mines Ltd, engages in developing exploration and mining assets. It is developing strategic mining exploration and project opportunities in gold, precious gems, rare earth metals, and platinum group metals. The company has a portfolio of gold and diamond exploration tenements in various mineral regions of Cameroon and Central African Republic. Foy-Johnston Inc. is based in New York, New York.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "FSNR": {
        "short_name": "FREESTONE RESOURCES INC",
        "long_name": "Freestone Resources, Inc.",
        "summary": "Freestone Resources, Inc., an oil and gas technology development company, engages in the development and marketing of technologies and solvents for various sectors in the oil and gas industry. The company offers Petrozene solvent that is primarily used to dissolve paraffin buildup and used for pipelines, oil storage tanks, oil sludge build up, de-emulsification, and well treatment, as well as used as a corrosion inhibitor and as a catalyst in opening up formations thereby aiding in oil production. It also provides specialized off-the-road (OTR) tire repair services; offers disposal services for OTR tires; sells used OTR tires; and recycles OTR tires. Freestone Resources, Inc. is based in Ennis, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Ennis"
    },
    "FTK": {
        "short_name": "Flotek Industries, Inc.",
        "long_name": "Flotek Industries, Inc.",
        "summary": "Flotek Industries, Inc. provides chemistry and services to the oil and gas industries in the United States and internationally. The company designs, develops, manufactures, packs, markets, distributes, and delivers reservoir-centric fluid systems, including specialty and conventional chemistries for use in oil and gas well drilling, cementing, completion, remediation, and stimulation activities, as well as use in enhanced and improved oil recovery markets under the Complex nano-Fluid, Pressure reducing Fluids, and MicroSolv brand names. It is also involved in the construction and management of automated material handling facilities; and management of loading facilities and blending operations for oilfield service companies. The company serves integrated oil and natural gas, oilfield service, independent oil and natural gas, pressure pumping service, international supply chain management, and national and state-owned oil companies. It sells its products directly through its sales force and contractual agency arrangements, as well as through third party agents. Flotek Industries, Inc. is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "FTSI": {
        "short_name": "FTS International, Inc.",
        "long_name": "FTS International, Inc.",
        "summary": "FTS International, Inc. provides hydraulic fracturing services in North America. Its services enhance hydrocarbon flow from oil and natural gas wells drilled by exploration and production companies (E&P), in shale and other unconventional resource formations. It operates in five unconventional basins in the United States, including the Permian Basin, the SCOOP/STACK Formation, the Marcellus/Utica Shale, the Eagle Ford Shale, and the Haynesville Shale. As of December 31, 2019, it had approximately 1.4 million hydraulic horsepower across 28 fleets. The company serves E&P companies that specialize in unconventional oil and natural gas resources. FTS International, Inc. was founded in 2000 and is headquartered in Fort Worth, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "city": "Fort Worth"
    },
    "GEOS": {
        "short_name": "Geospace Technologies Corporati",
        "long_name": "Geospace Technologies Corporation",
        "summary": "Geospace Technologies Corporation designs and manufactures instruments and equipment used in the oil and gas industry to acquire seismic data in order to locate, characterize, and monitor hydrocarbon producing reservoirs. The company operates through three segments: Oil and Gas Markets, Adjacent Markets, and Emerging Markets. The Oil and Gas Markets segment offers wireless seismic data acquisition systems, reservoir characterization products and services, and traditional seismic exploration products, such as geophones, hydrophones, leader wires, connectors, cables, marine streamer retrieval and steering devices, and various other seismic products. The Adjacent Markets segment provides industrial products, including imaging equipment, water meter products, and offshore cables, as well as seismic sensors for vibration monitoring and geotechnical applications, such as mine safety and earthquake detection applications; and electronic pre-press products that employ direct thermal imaging and digital inkjet printing technologies targeted at the commercial and industrial graphics, textile, and flexographic printing industries. The Emerging Markets segment designs and sells products used for border and perimeter security surveillance, cross-border tunneling detection, and other products targeted at movement monitoring, intrusion detection, and situational awareness. This segment serves customers that include various agencies of the United States government, including the Department of Defense, Department of Energy, Department of Homeland Security, and other agencies. The company operates in Asia, Canada, Europe, the United States, and internationally. Geospace Technologies Corporation was founded in 1980 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "GIFI": {
        "short_name": "Gulf Island Fabrication, Inc.",
        "long_name": "Gulf Island Fabrication, Inc.",
        "summary": "Gulf Island Fabrication, Inc., together with its subsidiaries, operates as a fabricator of steel structures, modules, and marine vessels in the United States. It operates in three segments: Fabrication, Shipyard, and Services. The Fabrication segment fabricates modules and piping systems for onshore refining, petrochemical, LNG, and industrial facilities; foundations, secondary steel components, and support structures for alternative energy developments and coastal mooring facilities; offshore production platforms and associated structures; and other complex steel structures and components. The Shipyard segment fabricates new-build marine vessels, such as offshore support and multi-purpose service vessels, research and salvage vessels, tug boats, towboats, barges, drydocks, anchor handling vessels, and lift boats. It also performs steel repair, blasting, painting, electrical systems repair, and machinery and piping system repairs; and propeller, shaft, and rudder reconditioning services. In addition, this segment performs conversion projects to lengthen and modify vessels to permit their use for various type of activities. The Services segment provides welding, interconnect piping, and other services for offshore platforms; on-site construction and maintenance services on inland platforms and structures and industrial facilities; performs municipal and drainage projects, such as pump stations, levee reinforcement, bulkheads, and other public works; and fabricates skid units, modules, and piping systems. The company serves international energy producers; refining, petrochemical, liquefied natural gas, industrial, power, and marine operators; engineering, procurement, and construction companies; and various agencies of the U.S. government. The company was founded in 1985 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "GLFH": {
        "short_name": "GALENFEHA INC",
        "long_name": "Galenfeha, Inc.",
        "summary": "Galenfeha, Inc. engages in the water, utility, and sewage construction activities. The company was incorporated in 2013 and is headquartered in Fort Worth, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Fort Worth"
    },
    "GPTC": {
        "short_name": "GOLDEN PATRIOT CORP",
        "long_name": "Golden Patriot Corp.",
        "summary": "Golden Patriot, Corp. engages in the acquisition, exploration, and development of mineral properties, primarily uranium and gold prospects in the United States. The company has an option agreement to acquire 100% of the Lucky Boy Uranium Project in Gila County, Arizona, which consists of 14 BLM claims and an 80 acre State Lease contiguous to the claims. It also has interest in the Gold View Property located in the Cortez trend of Nevada that consists of approximately 1,450 acres containing 76 unpatented lode claims. The company, formerly known as Boundaries Capital, Inc., was founded in 1988. Golden Patriot is based in Great Neck, New York.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Great Neck"
    },
    "GWTI": {
        "short_name": "GREENWAY TECHNOLOGIES INC",
        "long_name": "Greenway Technologies, Inc.",
        "summary": "Greenway Technologies, Inc., through its subsidiaries, engages in the energy and mining businesses in the United States. The company researches, develops, and commercializes G-Reformer units, which converts natural gas into synthesis gas, which is used for the production of fuels includes gasoline, diesel, jet fuel, and methanol. The company was formerly known as UMED Holdings, Inc. and changed its name to Greenway Technologies, Inc. in June 2017. Greenway Technologies, Inc. is based in Arlington, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Arlington"
    },
    "HAL": {
        "short_name": "Halliburton Company",
        "long_name": "Halliburton Company",
        "summary": "Halliburton Company provides a range of services and products to oil and natural gas companies worldwide. The company's Completion and Production segment offers production enhancement services, including stimulation and sand control services; and cementing services, such as well bonding and casing, as well as provides casing equipment. It also provides completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, liner hanger and sand control systems, and service tools; production solutions comprising coiled tubing, hydraulic workover units, and downhole tools; and pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning. In addition, this segment offers oilfield completion, production, and downstream water and process treatment chemicals and services; and electrical submersible pumps, as well as artificial lift services. The company's Drilling and Evaluation segment provides drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; and drilling systems and services. It also offers wireline and perforating services, including open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. In addition, this segment provides integrated exploration, drilling, and production software, as well as related professional and data management services; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "HAL.F": {
        "short_name": "HALLIBURTON CO.  DL 2,50",
        "long_name": "Halliburton Company",
        "summary": "Halliburton Company provides a range of services and products to oil and natural gas companies worldwide. The company's Completion and Production segment offers production enhancement services, including stimulation and sand control services; and cementing services, such as well bonding and casing, as well as provides casing equipment. It also provides completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, liner hanger and sand control systems, and service tools; production solutions comprising coiled tubing, hydraulic workover units, and downhole tools; and pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning. In addition, this segment offers oilfield completion, production, and downstream water and process treatment chemicals and services; and electrical submersible pumps, as well as artificial lift services. The company's Drilling and Evaluation segment provides drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; and drilling systems and services. It also offers wireline and perforating services, including open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. In addition, this segment provides integrated exploration, drilling, and production software, as well as related professional and data management services; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Houston"
    },
    "HAL.MX": {
        "short_name": "HALLIBURTON CO",
        "long_name": "Halliburton Company",
        "summary": "Halliburton Company provides a range of services and products to oil and natural gas companies worldwide. The company's Completion and Production segment offers production enhancement services, including stimulation and sand control services; and cementing services, such as well bonding and casing, as well as provides casing equipment. It also provides completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, liner hanger and sand control systems, and service tools; production solutions comprising coiled tubing, hydraulic workover units, and downhole tools; and pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning. In addition, this segment offers oilfield completion, production, and downstream water and process treatment chemicals and services; and electrical submersible pumps, as well as artificial lift services. The company's Drilling and Evaluation segment provides drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; and drilling systems and services. It also offers wireline and perforating services, including open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. In addition, this segment provides integrated exploration, drilling, and production software, as well as related professional and data management services; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.",
        "currency": "MXN",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Houston"
    },
    "HAL.SN": {
        "short_name": "HALLIBURTON",
        "long_name": "Halliburton Company",
        "summary": "Halliburton Company provides a range of services and products to oil and natural gas companies worldwide. The company's Completion and Production segment offers production enhancement services, including stimulation and sand control services; and cementing services, such as well bonding and casing, as well as provides casing equipment. It also provides completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, liner hanger and sand control systems, and service tools; production solutions comprising coiled tubing, hydraulic workover units, and downhole tools; and pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning. In addition, this segment offers oilfield completion, production, and downstream water and process treatment chemicals and services; and electrical submersible pumps, as well as artificial lift services. The company's Drilling and Evaluation segment provides drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; and drilling systems and services. It also offers wireline and perforating services, including open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. In addition, this segment provides integrated exploration, drilling, and production software, as well as related professional and data management services; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "United States",
        "city": "Houston"
    },
    "HALI34.SA": {
        "short_name": "HALLIBURTON DRN",
        "long_name": "Halliburton Company",
        "summary": "Halliburton Company provides a range of services and products to oil and natural gas companies worldwide. The company's Completion and Production segment offers production enhancement services, including stimulation and sand control services; and cementing services, such as well bonding and casing, as well as provides casing equipment. It also provides completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, liner hanger and sand control systems, and service tools; production solutions comprising coiled tubing, hydraulic workover units, and downhole tools; and pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning. In addition, this segment offers oilfield completion, production, and downstream water and process treatment chemicals and services; and electrical submersible pumps, as well as artificial lift services. The company's Drilling and Evaluation segment provides drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; and drilling systems and services. It also offers wireline and perforating services, including open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. In addition, this segment provides integrated exploration, drilling, and production software, as well as related professional and data management services; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.",
        "currency": "BRL",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "Houston"
    },
    "HLX": {
        "short_name": "Helix Energy Solutions Group, I",
        "long_name": "Helix Energy Solutions Group, Inc.",
        "summary": "Helix Energy Solutions Group, Inc., an offshore energy services company, provides specialty services to the offshore energy industry primarily in Brazil, the Gulf of Mexico, North Sea, the Asia Pacific, and West Africa regions. The company operates through three segments: Well Intervention, Robotics, and Production Facilities. The company engineers, manages, and conducts well intervention operations comprising production enhancement and abandonment, and construction in water depths ranging from 200 to 10,000 feet; and offers remotely operated vehicles (ROVs), trenchers, and ROVDrills for offshore construction and well intervention services. It also offers intervention engineering; inspection, repair, and maintenance of production structures, trees, jumpers, risers, pipelines, and subsea equipment; and life of field support services. In addition, the company provides reclamation and remediation services; well plugging and abandonment services; pipeline abandonment services; and site inspections. Further, it engages in the installation of flowlines, control umbilicals, and manifold assemblies and risers; trenching and burial of pipelines; installation and tie-in of riser and manifold assembly; commissioning, testing, and inspection activities; and provision of cable and umbilical lay, and connection services. Additionally, the company offers oil and natural gas processing facilities and services to oil and gas companies; and fast response system. It serves independent oil and gas producers and suppliers, pipeline transmission companies, renewable energy companies, and offshore engineering and construction firms. The company was formerly known as Cal Dive International, Inc. and changed its name to Helix Energy Solutions Group, Inc. in March 2006. Helix Energy Solutions Group, Inc. was incorporated in 1979 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "IO": {
        "short_name": "Ion Geophysical Corporation",
        "long_name": "ION Geophysical Corporation",
        "summary": "ION Geophysical Corporation, together with its subsidiaries, provides a suite of services and products for seismic data acquisition and processing in Latin America, North America, Europe, the Asia Pacific, Africa, the Middle East, and internationally. The company operates in two segments: E&P Technology & Services and Operations Optimization. The E&P Technology & Services segment offers data processing and imaging services; and survey planning and design, data acquisition and management, subsurface imaging, and reservoir characterization, as well as technical, commercial, and strategic advisory services. The Operations Optimization segment provides survey design, and command and control software systems and related services for marine towed streamer and seabed operations; and in-field optimization, and equipment maintenance and training services. This segment also develops, manufactures, and repairs marine towed streamer positioning and data acquisition systems, ocean bottom data acquisition technologies, marine diverters, analog geophones, and land acquisition systems, which are deployed in marine robotics, defense, scientific, exploration and production, and other commercial applications. ION Geophysical Corporation markets and sells its services and products through direct sales force and third-party sales representatives. The company was formerly known as Input/Output, Inc. and changed its name to ION Geophysical Corporation in 2007. ION Geophysical Corporation was founded in 1968 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "IRIG": {
        "short_name": "INTEGRATED DRILLING EQUIP HLDGS",
        "long_name": "Integrated Drilling Equipment Holdings Corp.",
        "summary": "Integrated Drilling Equipment Holdings Corp. manufactures drilling rigs, rig control systems, and rig components; and provides rig refurbishment and reconfiguration services for contract drilling companies worldwide. It operates through two segments, Electrical Products and Services, and Drilling Products and Services. The Electrical Products and Services segment designs, manufactures, installs, and services rig electrical and control systems, such as silicon controlled rectifier units, variable frequency drive units, electrical cabling, lighting systems, closed circuit video systems, gas and fire detection systems, and communication systems. This segment also offers rig power systems, AC and DC drive systems and MCC, electrical rig up, engine generators, automation, controls/sensors, hydraulic power units, other rig related hydraulic solutions, system integration, hydraulic system design, testing, and rig up/support products and services. The Drilling Products and Services segment provides drilling rigs and components. This segment designs, manufactures, and services land-based drilling rigs, and rig subsystems and parts; offers drilling rig services comprising mechanical services, assembly testing, rig refurbishment and inspection, new rig fabrication, and completion of land rig packages; and fabricates mud tanks, masts and substructures, dog houses, and other drilling rig related products. Integrated Drilling Equipment Holdings Corp. is headquartered in Spring, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Spring"
    },
    "KEGX": {
        "short_name": "KEY ENERGY SERVICES INC",
        "long_name": "Key Energy Services, Inc.",
        "summary": "Key Energy Services, Inc. operates as an onshore rig-based well servicing contractor in the United States. It operates through Rig Services, Fishing and Rental Services, Coiled Tubing Services, and Fluid Management Services segments. The Rig Services segment is involved in the completion of newly drilled wells; workover and recompletion of existing oil and natural gas wells; well maintenance activities; and plugging and abandonment of wells at the end of their useful lives, as well as provision of specialty drilling services to oil and natural gas producers. The Fishing and Rental Services segment provides fishing services that involve recovering lost or stuck equipment in the wellbore utilizing fishing tools; and rents drill pipes, tubulars, handling tools, pressure-control equipment, pumps, power swivels, reversing units, and foam air units, as well as frac stack equipment to support hydraulic fracturing operations. The Coiled Tubing Services segment offers services for wellbore clean-outs, nitrogen jet lifts, through-tubing fishing, and formation stimulations; mills temporary isolation plugs that separate frac zones; and other pre-and post-hydraulic fracturing well preparation services. The Fluid Management Services segment offers transportation and well-site storage services for fluids utilized in drilling, completions, workover, and maintenance activities; and disposal services for fluids produced subsequent to well completion. It also operates a fleet of hot oilers for pumping heated fluids used to clear soluble restrictions in a wellbore. The company was formerly known as Key Energy Group, Inc. and changed its name to Key Energy Services, Inc. in December 1998. Key Energy Services, Inc. was founded in 1977 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "KLXE": {
        "short_name": "KLX Energy Services Holdings, I",
        "long_name": "KLX Energy Services Holdings, Inc.",
        "summary": "KLX Energy Services Holdings, Inc. provides completion, intervention, and production services and products to the onshore oil and gas producing regions of the United States. The company operates through three segments: Southwest, Rocky Mountains, and Northeast/Mid-Con. It offers a range of technical services, and related tools and equipment to companies engaged in the exploration and development of North American onshore conventional and unconventional oil and natural gas reserves. The company was incorporated in 2018 and is headquartered in Wellington, Florida.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Wellington"
    },
    "KX4A.F": {
        "short_name": "KLX ENERGY SERV.  DL-,01",
        "long_name": "KLX Energy Services Holdings, Inc.",
        "summary": "KLX Energy Services Holdings, Inc. provides completion, intervention, and production services and products to the onshore oil and gas producing regions of the United States. The company operates through three segments: Southwest, Rocky Mountains, and Northeast/Mid-Con. It offers a range of technical services, and related tools and equipment to companies engaged in the exploration and development of North American onshore conventional and unconventional oil and natural gas reserves. The company was incorporated in 2018 and is headquartered in Wellington, Florida.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Wellington"
    },
    "LBRT": {
        "short_name": "Liberty Oilfield Services Inc.",
        "long_name": "Liberty Oilfield Services Inc.",
        "summary": "Liberty Oilfield Services Inc. provides hydraulic fracturing services to onshore oil and natural gas exploration and production companies in North America. The company offers its services primarily in the Permian Basin, the Eagle Ford Shale, the Denver-Julesburg Basin, the Williston Basin, and the Powder River Basin. Liberty Oilfield Services Inc. was founded in 2011 and is headquartered in Denver, Colorado.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Denver"
    },
    "MARPS": {
        "short_name": "3273",
        "long_name": "Marine Petroleum Trust",
        "summary": "Marine Petroleum Trust, together with its subsidiary, Marine Petroleum Corporation, operates as a royalty trust in the United States. As of June 30, 2020, it had an overriding royalty interest in 59 oil and natural gas leases covering an aggregate of 217,056 gross acres located in the Central and Western areas of the Gulf of Mexico off the coasts of Louisiana and Texas. The company was founded in 1956 and is based in Dallas, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Dallas"
    },
    "MRC": {
        "short_name": "MRC Global Inc.",
        "long_name": "MRC Global Inc.",
        "summary": "MRC Global Inc., through its subsidiaries, distributes pipes, valves, fittings, and other infrastructure products and services to the energy industry in the United States, Canada, and internationally. The company supplies products across various markets, such as upstream, midstream, and downstream. It offers ball, butterfly, gate, globe, check, diaphragm, needle, and plug valves; and other products, such as lined corrosion resistant piping systems, control valves, valve automation products, top work components, and valve modification services, as well as measurement, steam, and instrumentation products. The company also provides carbon steel fittings and flanges comprising carbon weld fittings, flanges, and piping components; stainless steel, alloy, tubing, fittings, and flanges; and carbon line pipes. In addition, it offers natural gas distribution products, including risers, meters, polyethylene pipes and fittings, and various other components and industrial supplies; oilfield and industrial supplies and completion equipment, such as high density polyethylene pipes, fittings, and rods; and specialized production equipment comprising tanks and separators. Further, the company provides various services, such as product testing, manufacturer assessments, multiple daily deliveries, volume purchasing, inventory and zone store management and warehousing, technical support, training, just-in-time delivery, truck stocking, order consolidation, product tagging, and system interfaces; and various other services under the ValidTorque and FastTrack names. Its products are used in the construction, maintenance, repair, and overhaul of equipment used in extreme operating conditions, including high pressure, high/low temperature, and high corrosive and abrasive environments. The company was formerly known as McJunkin Red Man Holding Corporation and changed its name to MRC Global Inc. in January 2012. MRC Global Inc. was founded in 1921 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "MUH0.F": {
        "short_name": "NCS MULTISTAGE HLD.DL-,01",
        "long_name": "NCS Multistage Holdings, Inc.",
        "summary": "NCS Multistage Holdings, Inc. provides engineered products and support services for oil and natural gas well completions and field development strategies in the United States, Canada, and internationally. Its products include casing-installed sliding sleeves, downhole frac isolation assemblies, sand jet perforating products, spotfrac systems, ballshift sliding sleeves, airlock casing buoyancy systems, liner hanger systems, and spectrum tracer services. The company also provides advisory services to customers on completion designs and field development strategies. It offers its products and services primarily to exploration and production companies for use in onshore wells through technically-trained direct sales force, and operating partners or sales representatives. The company was formerly known as Pioneer Super Holdings, Inc. and changed its name to NCS Multistage Holdings, Inc. in December 2016. NCS Multistage Holdings, Inc. was founded in 2006 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Houston"
    },
    "NCSM": {
        "short_name": "NCS Multistage Holdings, Inc.",
        "long_name": "NCS Multistage Holdings, Inc.",
        "summary": "NCS Multistage Holdings, Inc. provides engineered products and support services for oil and natural gas well completions and field development strategies in the United States, Canada, and internationally. Its products include casing-installed sliding sleeves, downhole frac isolation assemblies, sand jet perforating products, spotfrac systems, ballshift sliding sleeves, airlock casing buoyancy systems, liner hanger systems, and spectrum tracer services. The company also provides advisory services to customers on completion designs and field development strategies. It offers its products and services primarily to exploration and production companies for use in onshore wells through technically-trained direct sales force, and operating partners or sales representatives. The company was formerly known as Pioneer Super Holdings, Inc. and changed its name to NCS Multistage Holdings, Inc. in December 2016. NCS Multistage Holdings, Inc. was founded in 2006 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "NEJ.F": {
        "short_name": "NINE ENERGY SVC  DL -,01",
        "long_name": "Nine Energy Service, Inc.",
        "summary": "Nine Energy Service, Inc. operates as an onshore completion services provider that targets unconventional oil and gas resource development across North American basins and internationally. It offers cementing services, which consist of blending high-grade cement and water with various solid and liquid additives to create a cement slurry that is pumped between the casing and the wellbore of the well. The company also provides a portfolio of completion tools, such as liner hangers and accessories, fracture isolation packers, frac sleeves, stage one prep tools, frac plugs, casing flotation tools, specialty open hole float equipment, disk subs, composite cement retainers, and centralizers that provide pinpoint frac sleeve system technologies. In addition, it offers wireline services consisting of plug-and-perf completions, which is a multistage well completion technique for cased-hole wells that consists of deploying perforating guns and isolation tools to a specified depth; and coiled tubing services, which perform wellbore intervention operations utilizing a continuous steel pipe that is transported to the wellsite wound on a large spool in lengths of up to 30,000 feet. Nine Energy Service, Inc. operates 47 wireline pumpdown units and 14 coiled tubing units. The company was formerly known as NSC-Tripoint, Inc. and changed its name to Nine Energy Service, Inc. in October 2011. Nine Energy Service, Inc. was incorporated in 2011 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Houston"
    },
    "NESR": {
        "short_name": "National Energy Services Reunit",
        "long_name": "National Energy Services Reunited Corp.",
        "summary": "National Energy Services Reunited Corp., through its subsidiaries, provides oilfield services to oil and gas companies in the Middle East, North Africa, and the Asia Pacific regions. It operates through two segments: Production Services; and Drilling and Evaluation Services. The Production Services segment offers coiled tubing services, including nitrogen lifting, fishing, milling, clean-out, scale removal, and other well applications; hydraulic fracturing services; stimulation and pumping services; nitrogen services; pipeline services, such as water filling and hydro testing, nitrogen purging, and de-gassing and pressure testing, as well as cutting/welding and cooling down piping/vessels systems; and primary and remedial cementing services. This segment also provides laboratory services; filtration services, as well as frac tanks and pumping units; artificial lift services; production assurance chemicals; and surface and subsurface safety systems, high-pressure packer systems, flow controls, service tools, expandable liner technology, vacuum insulated tubing technology, and engineering capabilities with manufacturing capacity and testing facilities, as well as sources, treats, and disposes water for oil and gas, municipal, and industrial use. Its Drilling and Evaluation Services segment provides drilling and workover rigs; rig services; fishing and remedial solutions; directional and turbines drilling services; drilling fluid systems and related technologies; wireline logging services; slickline services for removal of scale, wax and sand build-up, setting plugs, changing out gas lift valves, and fishing and other well applications; and well testing services to measure solids, gas, and oil and water produced from a well, as well as rents drilling tools. National Energy Services Reunited Corp. was founded in 2017 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "NEX": {
        "short_name": "NexTier Oilfield Solutions Inc.",
        "long_name": "NexTier Oilfield Solutions Inc.",
        "summary": "NexTier Oilfield Solutions Inc., through its subsidiaries, provides well completion and production services in various active and demanding basins. The company's Completion Services segment offers hydraulic fracturing services to enhance production of oil and natural gas from formations with low permeability and restricted flow of hydrocarbons; wireline services; and perforating, pumpdown, pipe recovery, pressure pumping, and wellsite make-up and pressure testing services. As of December 31, 2019, it had approximately 45 hydraulic fracturing fleets, 118 wireline trucks, and 80 pumpdown units. The company's Well Construction and Intervention Services segment provides cementing services that incorporate custom engineered mixing and blending equipment to ensure precision and accuracy in providing annulus isolation and hydraulic seal, while protecting fresh water zones from our customers' zone of interest; and engineering software and technical guidance for remedial cementing applications, and acidizing to optimize the performance of its customers' wells. It also offers coiled tubing services to help customers in accomplishing various goals in their horizontal completion, workover, and well maintenance projects. As of December 31, 2019, this segment had approximately 25 coiled tubing units and 101 cementing units. The company serves integrated and large independent oil and natural gas exploration and production companies in the United States and internationally. NexTier Oilfield Solutions Inc. was founded in 1973 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "NGS": {
        "short_name": "Natural Gas Services Group, Inc",
        "long_name": "Natural Gas Services Group, Inc.",
        "summary": "Natural Gas Services Group, Inc. provides natural gas compression services and equipment to the energy industry in the United States. It fabricates, manufactures, rents, and sells natural gas compressors and related equipment. The company primarily engages in the rental of compression units that provide small, medium, and large horsepower applications for unconventional oil and natural gas production. As of December 31, 2019, the company had 2,304 natural gas compression units in its rental fleet with 429,650 horsepower. The company also engages in the design, fabrication, and assembly of compressor components into compressor units for rental or sale; engineers and fabricates natural gas compressors; and designs and manufactures a line of reciprocating compressor frames, cylinders, and parts. In addition, it is involved in the design, fabrication, sale, installation, and service of flare stacks and related ignition and control devices for the onshore and offshore incineration of gas compounds, such as hydrogen sulfide, carbon dioxide, natural gas, and liquefied petroleum gases. Further, the company offers customer support services for its compressor and flare sales business; an exchange and rebuild program for small horsepower screw compressors; and maintains an inventory of new and used compressors. Its primary customers are exploration and production companies that utilize compressor units for artificial lift applications; E&P companies that focuses on natural gas-weighted production; and midstream companies. Natural Gas Services Group, Inc. was founded in 1998 and is headquartered in Midland, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Midland"
    },
    "NINE": {
        "short_name": "Nine Energy Service, Inc.",
        "long_name": "Nine Energy Service, Inc.",
        "summary": "Nine Energy Service, Inc. operates as an onshore completion services provider that targets unconventional oil and gas resource development across North American basins and internationally. It offers cementing services, which consist of blending high-grade cement and water with various solid and liquid additives to create a cement slurry that is pumped between the casing and the wellbore of the well. The company also provides a portfolio of completion tools, such as liner hangers and accessories, fracture isolation packers, frac sleeves, stage one prep tools, frac plugs, casing flotation tools, specialty open hole float equipment, disk subs, composite cement retainers, and centralizers that provide pinpoint frac sleeve system technologies. In addition, it offers wireline services consisting of plug-and-perf completions, which is a multistage well completion technique for cased-hole wells that consists of deploying perforating guns and isolation tools to a specified depth; and coiled tubing services, which perform wellbore intervention operations utilizing a continuous steel pipe that is transported to the wellsite wound on a large spool in lengths of up to 30,000 feet. Nine Energy Service, Inc. operates 47 wireline pumpdown units and 14 coiled tubing units. The company was formerly known as NSC-Tripoint, Inc. and changed its name to Nine Energy Service, Inc. in October 2011. Nine Energy Service, Inc. was incorporated in 2011 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "NNYR": {
        "short_name": "NORTHAMERICAN ENERGY GROUP CORP",
        "long_name": "Northamerican Energy Group Corporation",
        "summary": "Northamerican Energy Group Corporation engages in the identification, acquisition, and development of hydrocarbon, oil, and gas reserves. It has gas and oil production leases located in the Pecos Valley Field, southwest of Midland, Texas, and Permian Basin. The company, formerly known as Nuoasis Properties Inc. and changed its name to Northamerican Energy Group Corporation in May 2005. The company was founded in 1993 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "NOV": {
        "short_name": "NOV Inc.",
        "long_name": "NOV Inc.",
        "summary": "NOV Inc. designs, constructs, manufactures, and sells systems, components, and products for oil and gas drilling and production worldwide. It operates through three segments: Wellbore Technologies, Completion & Production Solutions, and Rig Technologies. The company offers various equipment and technologies used to perform drilling operations. It also provides solids control and waste management equipment and services; drilling fluids; portable power generation products; drill and wired pipes; drilling optimization and automation services; tubular inspection, repair, and coating services; instrumentation, and measuring and monitoring services; downhole and fishing tools; steerable technologies; and drill bits. The company offers equipment and technologies for hydraulic fracture stimulation, including pressure pumping trucks, blenders, sanders, hydration units, injection units, flowline, and manifolds; well intervention, such as coiled tubing units, coiled tubing, and wireline units, as well as blowout preventers and tools; onshore production comprising fluid processing systems, composite pipes, surface transfer and progressive cavity pumps, and artificial lift systems; offshore production that include fluid processing systems, floating production systems, and subsea production technologies; and connectors for conductor pipes. It also provides substructures, derricks, and masts; cranes; jacking systems; pipe lifting, racking, rotating, and assembly systems; mud pumps; blowout preventers; drives and generators; rig instrumentation and control systems; equipment components for offshore wind construction vessels; mooring, anchor, and deck handling machinery; and pipelay and construction systems. The company offers spare parts, repair, and rentals, as well as remote equipment monitoring services. The company was formerly known as National Oilwell Varco, Inc. and changed its name to NOV Inc. in January 2021. NOV Inc. was founded in 1862 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "NR": {
        "short_name": "Newpark Resources, Inc.",
        "long_name": "Newpark Resources, Inc.",
        "summary": "Newpark Resources, Inc. supplies products, rentals, and services primarily to the oil and natural gas exploration and production industry. The company operates through two segments, Fluids Systems; and Mats and Integrated Services. The Fluids Systems segment offers drilling and completion fluids products, technical services, and other minerals to customers in the North America, Europe, the Middle East, Africa, Latin America, and the Asia Pacific regions. The Mats and Integrated Services segment offers composite mat rental, construction, and related site services to customers in various markets, including oil and gas exploration and production, electrical transmission and distribution, pipeline, solar, petrochemical, and construction industries in North America and Europe. This segment also provides access road construction, site planning and preparation, environmental protection, fluids and spill containment, erosion control, and site restoration services. Newpark Resources, Inc. was founded in 1932 and is headquartered in The Woodlands, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "The Woodlands"
    },
    "NRT": {
        "short_name": "North European Oil Royality Tru",
        "long_name": "North European Oil Royalty Trust",
        "summary": "North European Oil Royalty Trust, a grantor trust, holds overriding royalty rights covering gas and oil production in various concessions or leases in the Federal Republic of Germany. It has rights under contracts with German exploration and development subsidiaries of ExxonMobil Corp. and the Royal Dutch/Shell Group of Companies. The company holds royalties for the sale of well gas, oil well gas, crude oil, condensate, and sulfur. North European Oil Royalty Trust is based in Keene, New Hampshire.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Keene"
    },
    "NWP.F": {
        "short_name": "NEWPARK RES  DL-,01",
        "long_name": "Newpark Resources, Inc.",
        "summary": "Newpark Resources, Inc. supplies products, rentals, and services primarily to the oil and natural gas exploration and production industry. The company operates through two segments, Fluids Systems; and Mats and Integrated Services. The Fluids Systems segment offers drilling and completion fluids products, technical services, and other minerals to customers in the North America, Europe, the Middle East, Africa, Latin America, and the Asia Pacific regions. The Mats and Integrated Services segment offers composite mat rental, construction, and related site services to customers in various markets, including oil and gas exploration and production, electrical transmission and distribution, pipeline, solar, petrochemical, and construction industries in North America and Europe. This segment also provides access road construction, site planning and preparation, environmental protection, fluids and spill containment, erosion control, and site restoration services. Newpark Resources, Inc. was founded in 1932 and is headquartered in The Woodlands, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "The Woodlands"
    },
    "OII": {
        "short_name": "Oceaneering International, Inc.",
        "long_name": "Oceaneering International, Inc.",
        "summary": "Oceaneering International, Inc. provides engineered services and products to the offshore oil and gas industry, as well as to defense, aerospace, and commercial theme park industries worldwide. The company's Remotely Operated Vehicles (ROVs) segment offers submersible vehicles for drill support, vessel-based inspection, maintenance and repair, installation and construction support, pipeline inspection and surveys, and subsea production facility operation and maintenance services. As of December 31, 2019, this segment owned 250 work-class ROVs. The company's Subsea Products segment constructs various specialty subsea hardware products, including subsea umbilicals utilizing steel tubes, thermoplastic hoses, and termination assemblies; tooling, ROV tooling, and subsea work packages; production control equipment; installation and workover control systems; clamp connectors; pipeline connector and repair systems; subsea and topside control valves; and subsea chemical injection valves, as well as offers riserless light well intervention services. Its Subsea Projects segment performs subsea oilfield hardware installation and inspection, maintenance, and repair services; serves shallow water projects; and performs subsea intervention and hardware installation services, such as subsea well tie-backs, pipeline/flow line tie-ins and repairs, pipeline crossing, and umbilical and other subsea equipment installations, and subsea intervention services. The company's Asset Integrity segment offers asset integrity services for the safety of customers' facilities onshore and offshore; third-party inspections to customers in the oil and gas, petrochemical, and power generation industries; and first-pass integrity evaluation and assessment, and nondestructive testing services. Its Advanced Technologies segment provides project management, engineering services, and equipment for applications in non-energy industries. The company was founded in 1964 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "OII.F": {
        "short_name": "OCEANEERG INTL INC.DL-,25",
        "long_name": "Oceaneering International, Inc.",
        "summary": "Oceaneering International, Inc. provides engineered services and products to the offshore oil and gas industry, as well as to defense, aerospace, and commercial theme park industries worldwide. The company's Remotely Operated Vehicles (ROVs) segment offers submersible vehicles for drill support, vessel-based inspection, maintenance and repair, installation and construction support, pipeline inspection and surveys, and subsea production facility operation and maintenance services. As of December 31, 2019, this segment owned 250 work-class ROVs. The company's Subsea Products segment constructs various specialty subsea hardware products, including subsea umbilicals utilizing steel tubes, thermoplastic hoses, and termination assemblies; tooling, ROV tooling, and subsea work packages; production control equipment; installation and workover control systems; clamp connectors; pipeline connector and repair systems; subsea and topside control valves; and subsea chemical injection valves, as well as offers riserless light well intervention services. Its Subsea Projects segment performs subsea oilfield hardware installation and inspection, maintenance, and repair services; serves shallow water projects; and performs subsea intervention and hardware installation services, such as subsea well tie-backs, pipeline/flow line tie-ins and repairs, pipeline crossing, and umbilical and other subsea equipment installations, and subsea intervention services. The company's Asset Integrity segment offers asset integrity services for the safety of customers' facilities onshore and offshore; third-party inspections to customers in the oil and gas, petrochemical, and power generation industries; and first-pass integrity evaluation and assessment, and nondestructive testing services. Its Advanced Technologies segment provides project management, engineering services, and equipment for applications in non-energy industries. The company was founded in 1964 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Houston"
    },
    "OIS": {
        "short_name": "Oil States International, Inc.",
        "long_name": "Oil States International, Inc.",
        "summary": "Oil States International, Inc., through its subsidiaries, provides oilfield products and services for the drilling, completion, subsea, production, and infrastructure sectors of the oil and gas industry worldwide. The company operates in three segments: Well Site Services, Downhole Technologies, and Offshore/Manufactured Products. The Well Site Services segment offers a range of equipment and services that are used to drill for, establish, and maintain the flow of oil and natural gas from a well throughout its lifecycle. It also provides services, including wireline support, frac stacks, isolations tools, extended reach tools, ball launchers, well testing and flowback operations, thru tubing activity, and sand control; and land drilling services. The Downhole Technologies segment provides oil and gas perforation systems, and downhole tools in support of completion, intervention, wireline, and well abandonment operations. This segment also designs, manufactures, and markets its consumable engineered products to oilfield service, and exploration and production companies. The Offshore/Manufactured Products segment designs, manufactures, and markets capital equipment utilized on floating production systems, subsea pipeline infrastructure, and offshore drilling rigs and vessels; and short-cycle and other products. Its products include flexible bearings, advanced connector systems, high-pressure riser systems, deepwater mooring systems, cranes, subsea pipeline products, and blow-out preventer stack integration products. This segment also provides short-cycle products, such as valves, elastomers, and other specialty products that are used in the land-based drilling and completion markets; and other products for use in industrial, military, and other applications. In addition, it offers specialty welding, fabrication, cladding and machining, offshore installation, and inspection and repair services. The company was incorporated in 1995 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "OYO.F": {
        "short_name": "GEOSPACE TECHS  DL-,01",
        "long_name": "Geospace Technologies Corporation",
        "summary": "Geospace Technologies Corporation designs and manufactures instruments and equipment used in the oil and gas industry to acquire seismic data in order to locate, characterize, and monitor hydrocarbon producing reservoirs. The company operates through three segments: Oil and Gas Markets, Adjacent Markets, and Emerging Markets. The Oil and Gas Markets segment offers wireless seismic data acquisition systems, reservoir characterization products and services, and traditional seismic exploration products, such as geophones, hydrophones, leader wires, connectors, cables, marine streamer retrieval and steering devices, and various other seismic products. The Adjacent Markets segment provides industrial products, including imaging equipment, water meter products, and offshore cables, as well as seismic sensors for vibration monitoring and geotechnical applications, such as mine safety and earthquake detection applications; and electronic pre-press products that employ direct thermal imaging and digital inkjet printing technologies targeted at the commercial and industrial graphics, textile, and flexographic printing industries. The Emerging Markets segment designs and sells products used for border and perimeter security surveillance, cross-border tunneling detection, and other products targeted at movement monitoring, intrusion detection, and situational awareness. This segment serves customers that include various agencies of the United States government, including the Department of Defense, Department of Energy, Department of Homeland Security, and other agencies. The company operates in Asia, Canada, Europe, the United States, and internationally. Geospace Technologies Corporation was founded in 1980 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Houston"
    },
    "PADB.F": {
        "short_name": "PARKER DRILLING DL NEW",
        "long_name": "Parker Drilling Company",
        "summary": "Parker Drilling Company provides contract drilling and drilling-related services, and rental tools and services to the energy industry. It operates through two business lines, Drilling Services and Rental Tools Services. The Drilling Services business line drills oil, natural gas, and geothermal wells with company-owned rigs and customer-owned rigs; and operates barge rigs for drilling oil and natural gas in the shallow waters in and along the inland waterways and coasts of Louisiana, Alabama, and Texas. This business line also provides project related services, such as engineering, procurement, project management, and commissioning of customer-owned drilling facility projects; drill wells and manages the logistical and technological challenges of operating in remote, harsh, and ecologically sensitive areas. The Rental Tools Services business line offers rental equipment, such as standard and heavy-weight drill pipes, tubing, drill collars, and others; pressure control equipment, including blow-out preventers; well construction services, such as tubular running services and downhole tools; well intervention services comprising whipstock, fishing products, and related services; and inspection and machine shop support services for exploration and production companies, drilling contractors, and service companies on land and offshore. The company serves independent and national oil and natural gas exploration and production companies, and integrated service providers in the United States, Russia and other Commonwealth of Independent States countries, Europe, the Middle East, Africa, Asia, Latin America, and other countries. Parker Drilling Company was founded in 1934 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Houston"
    },
    "PDER": {
        "short_name": "PARDEE RESOURCES COMPANY",
        "long_name": "Pardee Resources Company",
        "summary": "Pardee Resources Company, Inc. owns, acquires, develops, and manages land and natural resource properties in the Appalachian region, including West Virginia, Kentucky, and Virginia. It owns and leases low-sulfur coal properties, such as steam and metallurgical reserves; manages oil and gas assets; and operates hardwood timber and surface lands. The company was founded in 1979 and is based in Philadelphia, Pennsylvania with regional offices in Scott Depot and Webster Springs, West Virginia; and Sugar Land, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Philadelphia"
    },
    "PFIE": {
        "short_name": "Profire Energy, Inc.",
        "long_name": "Profire Energy, Inc.",
        "summary": "Profire Energy, Inc., an oilfield technology company, provides burner-management products and services for the oil and gas industry in North America. The company assists energy production companies in the production, and transportation of oil and natural gas. Its products include PF3100, a burner and combustion management system, which is designed to operate, monitor, control, and manage various complex heated appliances; and safety and monitoring devices, such as shut-down and temperature valves, pressure transmitters and switches, burners, pilots, flame arrestor housings, and other combustion related equipment. The company also sells and installs its systems in Europe, South America, Africa, the Middle East, and Asia. Profire Energy, Inc. is based in Lindon, Utah.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Lindon"
    },
    "PKDC": {
        "short_name": "PARKER DRILLING CO",
        "long_name": "Parker Drilling Company",
        "summary": "Parker Drilling Company provides contract drilling and drilling-related services, and rental tools and services to the energy industry. It operates through two business lines, Drilling Services and Rental Tools Services. The Drilling Services business line drills oil, natural gas, and geothermal wells with company-owned rigs and customer-owned rigs; and operates barge rigs for drilling oil and natural gas in the shallow waters in and along the inland waterways and coasts of Louisiana, Alabama, and Texas. This business line also provides project related services, such as engineering, procurement, project management, and commissioning of customer-owned drilling facility projects; drill wells and manages the logistical and technological challenges of operating in remote, harsh, and ecologically sensitive areas. The Rental Tools Services business line offers rental equipment, such as standard and heavy-weight drill pipes, tubing, drill collars, and others; pressure control equipment, including blow-out preventers; well construction services, such as tubular running services and downhole tools; well intervention services comprising whipstock, fishing products, and related services; and inspection and machine shop support services for exploration and production companies, drilling contractors, and service companies on land and offshore. The company serves independent and national oil and natural gas exploration and production companies, and integrated service providers in the United States, Russia and other Commonwealth of Independent States countries, Europe, the Middle East, Africa, Asia, Latin America, and other countries. Parker Drilling Company was founded in 1934 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "PRRY": {
        "short_name": "PLANET RESOURCE RECOVERY INC",
        "long_name": "Planet Resource Recovery, Inc.",
        "summary": "Planet Resource Recovery, Inc. develops, manufactures, and markets environmentally safe solutions. Its technologies include PetroLuxus family of products for the oil and gas, and environmental industry; and AquaLuxus for the water industry. The company was founded in 2005 and is based in Pearland, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Pearland"
    },
    "PTOG": {
        "short_name": "PETROTECH OIL & GAS INC",
        "long_name": "Petrotech Oil and Gas, Inc.",
        "summary": "Petrotech Oil and Gas, Inc. initiates, operates, and develops enhanced oil recovery opportunities within qualifying oil reservoirs in the United States. It offers work over and installation services; heavy equipment services; nitrogen, CO2, and gas mixture treatments; exhaust gas unit services; gas assisted gravity drainage services; and reservoir development plans. The company also operates as a construction and heavy equipment company that bids on various third party jobs for state and independent oil companies in the form of fee or joint ventures, including plugging of abandoned wells with state compliance agencies, as well as bids on road work for the state or independents. The company is based in Bedford, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Bedford"
    },
    "PUMP": {
        "short_name": "ProPetro Holding Corp.",
        "long_name": "ProPetro Holding Corp.",
        "summary": "ProPetro Holding Corp., an oilfield services company, provides pressure pumping and other related services. The company offers hydraulic fracturing services; and a suite of well completion and production services, including cementing, acidizing, coiled tubing, flowback, and drilling services. It serves the upstream oil and gas companies engaged in the exploration and production of North American unconventional oil and natural gas resources in the Permian Basin. As of December 31, 2019, the company's fleet comprised 24 hydraulic fracturing units with 1,469,000 hydraulic horsepower. ProPetro Holding Corp. was founded in 2007 and is headquartered in Midland, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Midland"
    },
    "QSEP": {
        "short_name": "QS ENERGY INC",
        "long_name": "QS Energy, Inc.",
        "summary": "QS Energy, Inc. develops and commercializes energy efficiency technologies in the United States and internationally. The company's energy efficiency technologies assist in meeting energy demands, enhancing the economics of oil extraction and transport, and reducing greenhouse gas emissions. Its intellectual properties include a portfolio of domestic and international patents and patents pending, which have been developed in conjunction with and licensed from Temple University of Philadelphia, Pennsylvania. The company's primary technology is Applied Oil Technology, a commercial-grade crude oil pipeline transportation flow-assurance product that reduces crude oil viscosity by applying a high intensity electrical field to crude oil while in transit. It serves upstream and midstream energy sectors. The company was formerly known as Save the World Air, Inc. and changed its name to QS Energy, Inc. in August 2015. QS Energy, Inc. was founded in 1998 and is headquartered in Tomball, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Tomball"
    },
    "RES": {
        "short_name": "RPC, Inc.",
        "long_name": "RPC, Inc.",
        "summary": "RPC, Inc., through its subsidiaries, provides a range of oilfield services and equipment for the oil and gas companies involved in the exploration, production, and development of oil and gas properties. The company operates through Technical Services and Support Services segments. The Technical Services offers pressure pumping, fracturing, acidizing, cementing, downhole tools, coiled tubing, snubbing, nitrogen, well control, wireline, pump down, and fishing services that are used in the completion, production, and maintenance of oil and gas wells. The Support Services segment provides a range of rental tools, including blowout preventors, high pressure manifolds and valves, hevi-wate drill pipes, tubing products, production related rental tools, pumps, diverters, drill pipes, drill collars, handling tools, Coflexip hoses, and Wear Knot drill pipes that are used for onshore and offshore oil and gas well drilling, completion, and workover activities. This segment also offers oilfield pipe inspection, and pipe management and storage services; and oilfield training and consulting services. It operates in the United States, Africa, Canada, Argentina, China, Mexico, Eastern Europe, Latin America, the Middle East, and internationally. RPC, Inc. was founded in 1984 and is headquartered in Atlanta, Georgia.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Atlanta"
    },
    "RLD.F": {
        "short_name": "RPC INC.  DL-,10",
        "long_name": "RPC, Inc.",
        "summary": "RPC, Inc., through its subsidiaries, provides a range of oilfield services and equipment for the oil and gas companies involved in the exploration, production, and development of oil and gas properties. The company operates through Technical Services and Support Services segments. The Technical Services offers pressure pumping, fracturing, acidizing, cementing, downhole tools, coiled tubing, snubbing, nitrogen, well control, wireline, pump down, and fishing services that are used in the completion, production, and maintenance of oil and gas wells. The Support Services segment provides a range of rental tools, including blowout preventors, high pressure manifolds and valves, hevi-wate drill pipes, tubing products, production related rental tools, pumps, diverters, drill pipes, drill collars, handling tools, Coflexip hoses, and Wear Knot drill pipes that are used for onshore and offshore oil and gas well drilling, completion, and workover activities. This segment also offers oilfield pipe inspection, and pipe management and storage services; and oilfield training and consulting services. It operates in the United States, Africa, Canada, Argentina, China, Mexico, Eastern Europe, Latin America, the Middle East, and internationally. RPC, Inc. was founded in 1984 and is headquartered in Atlanta, Georgia.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Atlanta"
    },
    "RNET": {
        "short_name": "RigNet, Inc.",
        "long_name": "RigNet, Inc.",
        "summary": "RigNet, Inc., a technology company, provides customized communications services, applications, and cybersecurity solutions in the United States and internationally. The company operates through three segments: Managed Communications Services, Applications and Internet-of-Things (Apps & IoT), and Systems Integration. The Managed Communications Services segment provides remote communication, telephony, and technology services for offshore and onshore drilling rigs and production facilities, support vessels, and other remote sites. This segment also sells communications equipment; and provides installation and maintenance services. The Apps & IoT segment offers applications over-the-top of the network layer, including Software as a Service offerings, such as a real-time machine learning and artificial intelligence data platform; Cyphre encryption; cybersecurity services; edge computing solution services that assist customers with collecting and standardizing the complex data produced by edge devices; applications for safety and workforce productivity; and other value-added services. This segment also provides private machine-to-machine IoT data networks, including supervisory control and data acquisition. The Systems Integration segment engages in the design, consulting, engineering, project management, procurement, testing, installation, commissioning, and maintenance of telecommunications systems. This segment also provides monitoring and maintenance for fire and gas detection systems; and programmable logic controller and automation control systems. RigNet, Inc. was founded in 2000 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "RNGR": {
        "short_name": "Ranger Energy Services, Inc.",
        "long_name": "Ranger Energy Services, Inc.",
        "summary": "Ranger Energy Services, Inc. provides onshore high specification well service rigs, wireline completion services, and complementary services to exploration and production companies in the United States. It operates through three segments: High Specification Rigs, Completion and Other Services, and Processing Solutions. The High Specification Rigs segment offers well service rigs and complementary equipment and services to facilitate operations throughout the lifecycle of a well. It also rents well service-related equipment consisting of fluid pumps, power swivels, well control packages, hydraulic catwalks, frac tanks, pipe racks, and pipe handling tools. This segment also has a fleet of 139 well service rigs. The Completion and Other Services segment provides wireline completion services necessary to bring a well on production and other ancillary services utilized in conjunction with rig services to maintain the production of a well. The Processing Solutions segment offers proprietary and modular equipment for the processing of natural gas. The company was founded in 2017 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "RVS1.F": {
        "short_name": "DAWSON GEOPHYS.  DL-,30",
        "long_name": "Dawson Geophysical Company",
        "summary": "Dawson Geophysical Company provides onshore seismic data acquisition services in the United States and Canada. The company acquires and processes 2-D, 3-D, and multi-component seismic data for its clients, including oil and gas companies, and independent oil and gas operators, as well as providers of multi-client data libraries. Its seismic crews supply seismic data primarily to companies engaged in the exploration and development of oil and natural gas on land and in land-to-water transition areas. The company also serves the potash mining industry. Dawson Geophysical Company was founded in 1952 and is headquartered in Midland, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Midland"
    },
    "SCL.F": {
        "short_name": "SCHLUMBERGER  DL-,01",
        "long_name": "Schlumberger Limited",
        "summary": "Schlumberger Limited supplies technology for reservoir characterization, drilling, production, and processing to the oil and gas industry worldwide. It operates in four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company offers reservoir interpretation and data processing services; open and cased-hole, and slickline services; exploration and production pressure and flow-rate measurement services; tubing-conveyed perforating services; integrated production systems; software, consulting, information management, and IT infrastructure services; reservoir characterization, field development planning, and production enhancement consulting services; and petro technical data services and training solutions. It designs, manufactures, and markets roller cone and fixed cutter drill bits; supplies drilling fluid systems, fluid systems and specialty equipment, production technology solutions, and engineered managed pressure and underbalanced drilling solutions; and offers environmental services and products; provides drilling and measurement, land drilling rigs, and related support services; and supplies well planning and drilling, engineering, supervision, logistics, procurement, and contracting services, as well as drilling rig management services. In addition, the company offers well services; coiled tubing equipment; hydraulic fracturing, multistage completions, perforating, coiled tubing equipment, and services; well completion services and equipment; artificial lift production equipment and optimization services; and production management services. Further, it provides integrated subsea production systems; drilling equipment and services; onshore and offshore platform wellhead systems and processing solutions; and valve and process systems. The company was formerly known as SocieÂ´teÂ´ de Prospection EÂ´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Houston"
    },
    "SDPI": {
        "short_name": "Superior Drilling Products, Inc",
        "long_name": "Superior Drilling Products, Inc.",
        "summary": "Superior Drilling Products, Inc., a drilling and completion tool technology company, innovates, designs, engineers, manufactures, sells, rents, and repairs drilling and completion tools in the United States, Canada, and the Middle East. Its drilling solutions include Drill-N-Ream, a dual-section wellbore conditioning tool; Strider, a drill string oscillation system; V-Stream, an advanced conditioning system; and dedicated reamer stingers. The company also manufactures and refurbishes polycrystalline diamond compact drill bits for an oil field services company. It serves oil and natural gas drilling industry. The company was formerly known as SD Company, Inc. and changed its name to Superior Drilling Products, Inc. in May 2014. Superior Drilling Products, Inc. was founded in 1993 and is headquartered in Vernal, Utah.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "city": "Vernal"
    },
    "SGUJ": {
        "short_name": "SAGUARO HOLDINGS CORPORATION",
        "long_name": "Saguaro Holdings Corp.",
        "summary": "Saguaro Holdings Corp., through its subsidiaries, operates in various business sectors. It is involved in the oil and gas discovery, remediation, and treatment activities. The company also has 75% net interests in the Sullivan Tract located in the east and northeast sections of the Maxine fields in Live Oak County, Texas. In addition, it operates social online e-commerce market place that offers consumers discounted products and services from local businesses and online retailers; and develops software platform that assists the elderly, their families, caregivers, and healthcare professionals to mitigate health care costs. Further, the company is involved in the online e-commerce retailing of sporting goods. Saguaro Holdings Corp. is based in Larkspur, California.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Larkspur"
    },
    "SKO.F": {
        "short_name": "SEACOR HOLDINGS  DL-,01",
        "long_name": "Seacor Holdings Inc.",
        "summary": "SEACOR Holdings Inc. engages in transportation and logistics, risk management consultancy, and other businesses in the United States and internationally. The company operates through Ocean Transportation & Logistics Services, Inland Transportation & Logistics Services, Witt O'Brien's, and Other segments. The Ocean Transportation & Logistics Services segment owns and operates a fleet of bulk transportation, port and infrastructure, and logistics assets. It operates carriers for the United States coastwise for trade of crude oil, petroleum, and chemical products; and dry bulk vessels. This segment provides deep-sea vessels docking, ocean towing, and oil terminal support and bunkering services; liner, short-sea, rail car, and project cargo transportation and logistics solutions; door-to-door solutions; and technical ship management services, as well as operates pure car/truck carriers. The Inland Transportation & Logistics Services segment offers river transportation equipment for moving agricultural and industrial commodities and containers, and petroleum products; and owns and operates multi-modal terminal locations. It also provides management services related to barge and towboat operations. The Witt O'Brien's segment provides crisis and emergency management services for the public and private sectors. It serves markets in the areas of critical national infrastructure, including government, energy, transportation, healthcare, and education. The Other segment designs, develops, and maintains alternative energy and power solutions; and offers liquefied natural gas and compressed natural gas fuel supply and logistics to commercial, industrial, agricultural, and transportation customers. This segment also engages in the selling, storage, and maintenance of aviation; agricultural commodity trading and logistics businesses; and trading and merchandising of sugar and other commodities. SEACOR Holdings Inc. was founded in 1989 and is based in Fort Lauderdale, Florida.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Fort Lauderdale"
    },
    "SKPO": {
        "short_name": "SKYE PETROLEUM INC",
        "long_name": "Skye Petroleum, Inc.",
        "summary": "Skye Petroleum, Inc. provides production chemical treatment services to oil companies in the United States. It offers production chemicals, which include solvents, dispersants, and wax inhibitors; cleaning compounds, such as degreasers; coiled tubing, including lubricants, scale control inhibitor products, viscosifiers, iron control agents, oxygen scavengers, H2S control scavengers, and corrosion inhibitors; and foamers. The company also offers surfactants, iron control additives, gel stabilizers, friction reducers, breakers, biocides, cross-linkers, and buffers for fracturing operations; and drilling and complexion fluid issues. It provides its technology for use in various applications, such as oil wells, flow lines, tanks, tubing, tank bottoms, and any surface, or sub-surface equipment to solve flow assurance issues related to paraffin, asphaltene, and sludge. The company was formerly known as National Equities Holdings, Inc. and changed its name to Skye Petroleum, Inc. in April 2010. The company was founded in 1987 and is based in Sugar Land, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Sugar Land"
    },
    "SLB": {
        "short_name": "Schlumberger N.V.",
        "long_name": "Schlumberger Limited",
        "summary": "Schlumberger Limited supplies technology for reservoir characterization, drilling, production, and processing to the oil and gas industry worldwide. It operates in four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company offers reservoir interpretation and data processing services; open and cased-hole, and slickline services; exploration and production pressure and flow-rate measurement services; tubing-conveyed perforating services; integrated production systems; software, consulting, information management, and IT infrastructure services; reservoir characterization, field development planning, and production enhancement consulting services; and petro technical data services and training solutions. It designs, manufactures, and markets roller cone and fixed cutter drill bits; supplies drilling fluid systems, fluid systems and specialty equipment, production technology solutions, and engineered managed pressure and underbalanced drilling solutions; and offers environmental services and products; provides drilling and measurement, land drilling rigs, and related support services; and supplies well planning and drilling, engineering, supervision, logistics, procurement, and contracting services, as well as drilling rig management services. In addition, the company offers well services; coiled tubing equipment; hydraulic fracturing, multistage completions, perforating, coiled tubing equipment, and services; well completion services and equipment; artificial lift production equipment and optimization services; and production management services. Further, it provides integrated subsea production systems; drilling equipment and services; onshore and offshore platform wellhead systems and processing solutions; and valve and process systems. The company was formerly known as SocieÂ´teÂ´ de Prospection EÂ´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "SLB.BA": {
        "short_name": "SCHLUMBERGER",
        "long_name": "Schlumberger Limited",
        "summary": "Schlumberger Limited supplies technology for reservoir characterization, drilling, production, and processing to the oil and gas industry worldwide. It operates in four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company offers reservoir interpretation and data processing services; open and cased-hole, and slickline services; exploration and production pressure and flow-rate measurement services; tubing-conveyed perforating services; integrated production systems; software, consulting, information management, and IT infrastructure services; reservoir characterization, field development planning, and production enhancement consulting services; and petro technical data services and training solutions. It designs, manufactures, and markets roller cone and fixed cutter drill bits; supplies drilling fluid systems, fluid systems and specialty equipment, production technology solutions, and engineered managed pressure and underbalanced drilling solutions; and offers environmental services and products; provides drilling and measurement, land drilling rigs, and related support services; and supplies well planning and drilling, engineering, supervision, logistics, procurement, and contracting services, as well as drilling rig management services. In addition, the company offers well services; coiled tubing equipment; hydraulic fracturing, multistage completions, perforating, coiled tubing equipment, and services; well completion services and equipment; artificial lift production equipment and optimization services; and production management services. Further, it provides integrated subsea production systems; drilling equipment and services; onshore and offshore platform wellhead systems and processing solutions; and valve and process systems. The company was formerly known as SocieÂ´teÂ´ de Prospection EÂ´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.",
        "currency": "ARS",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "city": "Houston"
    },
    "SLB.PA": {
        "short_name": "SCHLUMBERGER",
        "long_name": "Schlumberger Limited",
        "summary": "Schlumberger Limited supplies technology for reservoir characterization, drilling, production, and processing to the oil and gas industry worldwide. It operates in four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company offers reservoir interpretation and data processing services; open and cased-hole, and slickline services; exploration and production pressure and flow-rate measurement services; tubing-conveyed perforating services; integrated production systems; software, consulting, information management, and IT infrastructure services; reservoir characterization, field development planning, and production enhancement consulting services; and petro technical data services and training solutions. It designs, manufactures, and markets roller cone and fixed cutter drill bits; supplies drilling fluid systems, fluid systems and specialty equipment, production technology solutions, and engineered managed pressure and underbalanced drilling solutions; and offers environmental services and products; provides drilling and measurement, land drilling rigs, and related support services; and supplies well planning and drilling, engineering, supervision, logistics, procurement, and contracting services, as well as drilling rig management services. In addition, the company offers well services; coiled tubing equipment; hydraulic fracturing, multistage completions, perforating, coiled tubing equipment, and services; well completion services and equipment; artificial lift production equipment and optimization services; and production management services. Further, it provides integrated subsea production systems; drilling equipment and services; onshore and offshore platform wellhead systems and processing solutions; and valve and process systems. The company was formerly known as SocieÂ´teÂ´ de Prospection EÂ´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "United States",
        "city": "Houston"
    },
    "SLBG34.SA": {
        "short_name": "SCHLUMBERGERDRN",
        "long_name": "Schlumberger Limited",
        "summary": "Schlumberger Limited supplies technology for reservoir characterization, drilling, production, and processing to the oil and gas industry worldwide. It operates in four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company offers reservoir interpretation and data processing services; open and cased-hole, and slickline services; exploration and production pressure and flow-rate measurement services; tubing-conveyed perforating services; integrated production systems; software, consulting, information management, and IT infrastructure services; reservoir characterization, field development planning, and production enhancement consulting services; and petro technical data services and training solutions. It designs, manufactures, and markets roller cone and fixed cutter drill bits; supplies drilling fluid systems, fluid systems and specialty equipment, production technology solutions, and engineered managed pressure and underbalanced drilling solutions; and offers environmental services and products; provides drilling and measurement, land drilling rigs, and related support services; and supplies well planning and drilling, engineering, supervision, logistics, procurement, and contracting services, as well as drilling rig management services. In addition, the company offers well services; coiled tubing equipment; hydraulic fracturing, multistage completions, perforating, coiled tubing equipment, and services; well completion services and equipment; artificial lift production equipment and optimization services; and production management services. Further, it provides integrated subsea production systems; drilling equipment and services; onshore and offshore platform wellhead systems and processing solutions; and valve and process systems. The company was formerly known as SocieÂ´teÂ´ de Prospection EÂ´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.",
        "currency": "BRL",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "Houston"
    },
    "SLBN.MX": {
        "short_name": "SCHLUMBERGER LIMITED",
        "long_name": "Schlumberger Limited",
        "summary": "Schlumberger Limited supplies technology for reservoir characterization, drilling, production, and processing to the oil and gas industry worldwide. It operates in four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company offers reservoir interpretation and data processing services; open and cased-hole, and slickline services; exploration and production pressure and flow-rate measurement services; tubing-conveyed perforating services; integrated production systems; software, consulting, information management, and IT infrastructure services; reservoir characterization, field development planning, and production enhancement consulting services; and petro technical data services and training solutions. It designs, manufactures, and markets roller cone and fixed cutter drill bits; supplies drilling fluid systems, fluid systems and specialty equipment, production technology solutions, and engineered managed pressure and underbalanced drilling solutions; and offers environmental services and products; provides drilling and measurement, land drilling rigs, and related support services; and supplies well planning and drilling, engineering, supervision, logistics, procurement, and contracting services, as well as drilling rig management services. In addition, the company offers well services; coiled tubing equipment; hydraulic fracturing, multistage completions, perforating, coiled tubing equipment, and services; well completion services and equipment; artificial lift production equipment and optimization services; and production management services. Further, it provides integrated subsea production systems; drilling equipment and services; onshore and offshore platform wellhead systems and processing solutions; and valve and process systems. The company was formerly known as SocieÂ´teÂ´ de Prospection EÂ´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.",
        "currency": "MXN",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Houston"
    },
    "SLCA": {
        "short_name": "U.S. Silica Holdings, Inc.",
        "long_name": "U.S. Silica Holdings, Inc.",
        "summary": "U.S. Silica Holdings, Inc. produces and sells commercial silica in the United States. The company operates through two segments, Oil & Gas Proppants and Industrial & Specialty Products. It offers whole grain commercial silica products to be used as fracturing sand in connection with oil and natural gas recovery, as well as sells its whole grain silica products in various size distributions, grain shapes, and chemical purity levels for manufacturing glass products. The company also provides ground commercial silica products for use in plastics, rubber, polishes, cleansers, paints, glazes, textile fiberglass, and precision castings; fine ground silica for use in premium paints, specialty coatings, sealants, silicone rubber, and epoxies; and engineered performance materials made from diatomaceous earth (DE), clay, and perlite. In addition, it offers other industrial mineral products, such as aplite, a mineral used to produce container glass and insulation fiberglass; magnesium silicate, a adsorbent made from a mixture of silica and magnesium for preparative and analytical chromatography applications; and DE and clay aggregates used as an absorbent for automotive, industrial, and sports turf applications. Further, the company provides transportation, equipment rental, and contract labor services. U.S. Silica Holdings, Inc. serves oilfield services companies, and exploration and production companies that are engaged in hydraulic fracturing; and industrial and specialty products end markets. The company was formerly known as GGC USS Holdings, Inc. U.S. Silica Holdings, Inc. was incorporated in 2008 and is headquartered in Katy, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Katy"
    },
    "SMGI": {
        "short_name": "SMG INDUSTRIES INC",
        "long_name": "SMG Industries Inc.",
        "summary": "SMG Industries Inc., an oilfield service company, provides detergents, surfactants, and degreasers for the drilling rig operators, exploration and production companies, and distribution and supply companies in the United States. The company offers degreaser under the Miracle Blue name; aluminum brightener and descaler under the Luma Brite name; and emulsifier under the Wicked Green name that are used in oil remediation jobs. It also sells equipment and parts, such as industrial and oilfield pressure washers, compressors, heaters, water pumps and combination units, as well as spare parts for pressure washer water guns, hoses, and fittings. In addition, the company is also involved in the rental of rig wash equipment trailer units comprising pressure washers, heating equipment, water containment units, and related components to drilling rig operators, oil company operators, and other oilfield companies. Further, it provides drilling rig wash and mechanical repair services for drilling rig operator customers. The company was formerly known as SMG Indium Resources Ltd. and changed its name to SMG Industries Inc. in April 2018. SMG Industries Inc. was founded in 2008 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "SND": {
        "short_name": "Smart Sand, Inc.",
        "long_name": "Smart Sand, Inc.",
        "summary": "Smart Sand, Inc., integrated frac sand supply and services company, engages in the excavation, processing, and sale of sands or proppant for use in hydraulic fracturing operations in the oil and gas industry in the United States. It also operates SmartSystems, a wellsite proppant storage solution; and offers logistics services. The company sells its products primarily to oil and natural gas exploration and production companies, and oilfield service companies. As of February 26, 2020, it had approximately 316 million tons of proven recoverable sand reserves. The company was incorporated in 2011 and is headquartered in The Woodlands, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "The Woodlands"
    },
    "SOI": {
        "short_name": "Solaris Oilfield Infrastructure",
        "long_name": "Solaris Oilfield Infrastructure, Inc.",
        "summary": "Solaris Oilfield Infrastructure, Inc. designs, manufactures, and rents mobile proppant and chemical management systems to unload, store, and deliver proppant and chemicals at oil and natural gas well sites in the United States. Its systems are used to transfer large quantities of proppant and chemicals to the well sites. The company also provides trained personnel and last mile proppant logistics services; transloading and forward staging storage services; and real-time inventory management software under the Solaris Lens and Railtronix names. It serves oil and natural gas exploration and production, and oilfield service companies. Solaris Oilfield Infrastructure, Inc. was founded in 2014 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "SPNX": {
        "short_name": "Superior Energy Services, Inc.",
        "long_name": "Superior Energy Services, Inc.",
        "summary": "Superior Energy Services, Inc. provides oilfield services and equipment to oil and natural gas exploration and production companies in the United States and internationally. The company operates in four segments: Drilling Products and Services, Onshore Completion and Workover Services, Production Services, and Technical Solutions. The Drilling Products and Services segment rents downhole drilling tools, including tubulars, such as primary drill pipe strings, landing strings, completion tubulars, and associated accessories, as well as manufactures and rents bottom hole tools comprising stabilizers, non-magnetic drill collars, and hole openers; and surfaces, such as temporary onshore and offshore accommodation modules and accessories. The Onshore Completion and Workover Services segment offers fluid management services used to obtain, move, store, and dispose of fluids that are involved in the exploration, development, and production of oil and gas; and workover services consisting of installations, completions, and sidetracking of wells, as well as support for perforating operations. The Production Services segment provides intervention services, such as coiled tubing, cased hole and mechanical wireline, hydraulic workover and snubbing, pressure control, production testing and optimization, and remedial pumping services. The Technical Solutions segment offers well containment systems; completion tools and services, including sand control systems, well screens and filters, and surface-controlled sub surface safety valves; and well and sand control, and stimulation services. This segment also produces and sells oil and gas. Superior Energy Services, Inc. was founded in 1991 and is headquartered in Houston, Texas. On December 7, 2020, Superior Energy Services, Inc., along with its affiliates, filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the Southern District of Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "SSOF": {
        "short_name": "SIXTY SIX OILFIELD SERVICES INC",
        "long_name": "665 Energy, Inc.",
        "summary": "Sixty Six Oilfield Services, Inc. sells and rents heavy oil field equipment to the oil and gas industry in the United States and internationally. It sells new and used heavy-weight drill pipes, drill collars, pup joints, pony collars, handling tools, tubing, casing, blow-out preventers, engines, compressors, custom drilling rigs, and related equipment; and rents heavy drill pipes on short and long term basis. The company also offers refurbishment, testing, and certification services for used and refurbished equipment, and parts. Sixty Six Oilfield Services, Inc. was founded in 1959 and is based in Oklahoma City, Oklahoma with additional facilities in Germany and Dubai.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Oklahoma City"
    },
    "SYNE": {
        "short_name": "SYNTHESIS ENERGY SYSTEMS INC",
        "long_name": "Synthesis Energy Systems, Inc.",
        "summary": "Synthesis Energy Systems, Inc., an energy company, engages in licensing and commercializing SES gasification technology for the production of synthesis gas in China and internationally. Synthesis Energy Systems, Inc. was founded in 2003 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "TD9.F": {
        "short_name": "TIDEWATER INC.  DL-,10",
        "long_name": "Tidewater Inc.",
        "summary": "Tidewater Inc., together with its subsidiaries, provides offshore marine support and transportation services to the offshore energy industry through the operation of a fleet of marine service vessels worldwide. It provides services in support of offshore exploration, field development, and production, including towing of and anchor handling for mobile offshore drilling units; transporting supplies and personnel necessary to sustain drilling, workover, and production activities; offshore construction, and seismic and subsea support; and various specialized services, such as pipe and cable laying. The company operates and charters deepwater vessels, including platform supply and anchor handling tug supply vessels for use in transporting supplies and equipment from shore bases to deepwater and intermediate water depth offshore drilling rigs and production platforms; towing-supply vessels for use in intermediate and shallow waters; and crew boats, utility vessels, and offshore tugs to transport personnel and supplies from shore bases to offshore drilling rigs, platforms, and other installations. It also operates offshore tugs for use in towing floating drilling rigs and barges; and assisting in the docking of tankers, as well as in pipe and cable laying, and construction barges. The company serves oil and natural gas exploration, field development, and production companies; independent exploration and production companies; government-owned or government-controlled organizations, and other companies; drilling contractors; and other companies, such as offshore construction, diving, and well stimulation companies. As of December 31, 2019, it owned or chartered 217 vessels. Tidewater Inc. was founded in 1956 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Houston"
    },
    "TDW": {
        "short_name": "Tidewater Inc.",
        "long_name": "Tidewater Inc.",
        "summary": "Tidewater Inc., together with its subsidiaries, provides offshore marine support and transportation services to the offshore energy industry through the operation of a fleet of marine service vessels worldwide. It provides services in support of offshore exploration, field development, and production, including towing of and anchor handling for mobile offshore drilling units; transporting supplies and personnel necessary to sustain drilling, workover, and production activities; offshore construction, and seismic and subsea support; and various specialized services, such as pipe and cable laying. The company operates and charters deepwater vessels, including platform supply and anchor handling tug supply vessels for use in transporting supplies and equipment from shore bases to deepwater and intermediate water depth offshore drilling rigs and production platforms; towing-supply vessels for use in intermediate and shallow waters; and crew boats, utility vessels, and offshore tugs to transport personnel and supplies from shore bases to offshore drilling rigs, platforms, and other installations. It also operates offshore tugs for use in towing floating drilling rigs and barges; and assisting in the docking of tankers, as well as in pipe and cable laying, and construction barges. The company serves oil and natural gas exploration, field development, and production companies; independent exploration and production companies; government-owned or government-controlled organizations, and other companies; drilling contractors; and other companies, such as offshore construction, diving, and well stimulation companies. As of December 31, 2019, it owned or chartered 217 vessels. Tidewater Inc. was founded in 1956 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "TEGR": {
        "short_name": "TERRA ENERGY & RESOURCE TECHNOL",
        "long_name": "Terra Energy & Resource Technologies, Inc.",
        "summary": "Terra Energy & Resource Technologies, Inc., through its subsidiary, Terra Insight Services, Inc., operates as a natural resource exploration technology company worldwide. It provides mapping and analysis services for exploration, drilling, and mining companies related to natural resources. The company's technologies consist of Sub Terrain Prospecting technology, Naturally Adsorbed Gas Survey technology, Side View Seismic Locator technology, and Seismic Location of Emission Centers technology. Its technologies predict and locate commercially viable deposits of hydrocarbons, gold, diamonds, and other natural resources, as well as assess them for onshore or offshore geographic area. Terra Energy & Resource Technologies, Inc. was founded in 2005 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "TFLC.SG": {
        "short_name": "Deep Down Inc. Registered Share",
        "long_name": "Deep Down, Inc.",
        "summary": "Deep Down, Inc., an oilfield services company, provides deepwater and ultra-deepwater oil production distribution system support services and technologies to the energy and offshore industries in the United States and internationally. The company offers engineering and project management services, including the design, installation, and retrieval of subsea equipment and systems; connection and termination operations services; well-commissioning services; and construction support services. It also provides project management and engineering; spooling; testing and commissioning; storage management; and refurbishment and repurposing of recovered subsea equipment, as well as support services for offshore interventions. In addition, the company offers loose steel tube flying lead, umbilical hardware, and non-helical umbilical products, as well as riser isolation valves and subsea isolation valve services. Further, it provides installation aids, including flying lead installation systems, tensioners, lay chutes, buoyancy modules, clump weights, mud mats, pumping and testing skids, control booths, fluid drum carriers, under-rollers, carousels, running and parking deployment frames, termination shelters, pipe straighteners, subsea deployment basket system, horizontal drive units, and rapid deployment cartridges. The company serves oil and gas companies, subsea equipment manufacturers, subsea equipment installation contractors, offshore drilling contractors, engineering and construction companies, and other companies involved in maritime operations. Deep Down, Inc. was founded in 1997 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United States",
        "city": "Houston"
    },
    "TH": {
        "short_name": "Target Hospitality Corp.",
        "long_name": "Target Hospitality Corp.",
        "summary": "Target Hospitality Corp. operates as a specialty rental and hospitality services company in the United States. The company operates through three segments: Permian Basin, Bakken Basin, and Government. It owns a network of specialty rental accommodation units with approximately 13,800 beds across 25 sites. The company owns and operates 26 communities in the Permian and Bakken Basins. It serves investment grade oil and gas companies, energy infrastructure companies, and U.S. government and government contractors. The company is headquartered in The Woodlands, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "The Woodlands"
    },
    "TIRTZ": {
        "short_name": "TIDELANDS ROYALTY TRUST'B'",
        "long_name": "Tidelands Royalty Trust \"B\"",
        "summary": "Tidelands Royalty Trust 'B' engages in the administration and collection of oil and natural gas royalties in the United States. The company, through its wholly-owned subsidiary, Tidelands Royalty 'B' Corporation, holds title to interests in properties situated offshore of Louisiana. As of March 1, 2018, it had an overriding royalty interest in four oil and natural gas leases covering 17,188 gross acres in the Gulf of Mexico in the Sabine Pass and West Cameron areas. The company was founded in 1954 and is based in Dallas, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Dallas"
    },
    "TTI": {
        "short_name": "Tetra Technologies, Inc.",
        "long_name": "TETRA Technologies, Inc.",
        "summary": "TETRA Technologies, Inc., together with its subsidiaries, operates as a diversified oil and gas services company. The company's Completion Fluids & Products segment manufactures and markets clear brine fluids, additives, and associated products and services to the oil and gas industry for use in well drilling, completion, and workover operations in the United States, as well as in Latin America, Europe, Asia, the Middle East, and Africa. This segment also markets liquid and dry calcium chloride products. Its Water & Flowback Services segment provides water management services for onshore oil and gas operators. This segment also offers frac flowback, production well testing, offshore rig cooling, and other associated services in oil and gas producing regions in the United States and Mexico, as well as in various basins in Latin America, Africa, Europe, the Middle East, and Australia. The company's Compression segment engages in the fabrication and sale of standard, custom-designed, and engineered compressor packages; and sale of compressor package parts and components manufactured by third-party suppliers, as well as provision of services to support the needs of customers who own compression equipment. This segment provides compression services and equipment for natural gas and oil exploration and production, midstream, transmission, and storage companies operating throughout in onshore producing regions of the United States, as well as in Mexico, Canada, and Argentina. TETRA Technologies, Inc. was founded in 1981 and is headquartered in The Woodlands, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "The Woodlands"
    },
    "TUSK": {
        "short_name": "Mammoth Energy Services, Inc.",
        "long_name": "Mammoth Energy Services, Inc.",
        "summary": "Mammoth Energy Services, Inc. operates as an oilfield service company. The company operates in three segments: Infrastructure Services, Pressure Pumping Services, and Natural Sand Proppant Services. The Infrastructure Services segment offers a range of services on electric transmission and distribution, networks and substation facilities, including the construction, upgrade, maintenance, and repair of high voltage transmission lines, substations, and lower voltage overhead and underground distribution systems; storm repair and restoration services; and commercial services comprising installation, maintenance, and repair of commercial wiring. The Pressure Pumping Services segment provides high-pressure hydraulic fracturing services to enhance the production of oil and natural gas from formations having low permeability. The Natural Sand Proppant Services segment is involved in mining, processing, and selling proppant for hydraulic fracturing; buying processed sand from suppliers on the spot market and reselling that sand; and providing logistics solutions to facilitate delivery of frac sand products. The company also offers other energy services, including contract land and directional drilling, coil tubing, pressure control, flowback, cementing, acidizing, equipment rental, crude oil hauling, and remote accommodation services. It serves government-funded utilities, private and public investor owned utilities, co-operative utilities, independent oil and natural gas producers and land-based drilling contractors in North America. The company was founded in 2014 and is headquartered in Oklahoma City, Oklahoma.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Oklahoma City"
    },
    "TXGE": {
        "short_name": "TEXAS GULF ENERGY INC",
        "long_name": "Texas Gulf Energy, Incorporated",
        "summary": "Texas Gulf Energy, Inc. provides turnkey and specialty construction services to a range of industrial and energy sector clients in the United States. It is also involved in the management and execution of capital and turnaround projects; and the provision of project management personnel and other construction resources, such as project planners/schedulers, engineers, welders, fitters, and millwrights. In addition, the company provides turnarounds, retrofits, modifications, and expansions to existing facilities, as well as the construction of new facilities in the refinery, petrochemical, mining, and power industries. It serves engineering firms, general contractors, petrochemical and industrial gas companies, integrated oil companies, and independent petroleum refiners, as well as pipeline, terminal, and oil and gas marketing companies. The company is headquartered in La Porte, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "La Porte"
    },
    "USAC": {
        "short_name": "USA Compression Partners, LP",
        "long_name": "USA Compression Partners, LP",
        "summary": "USA Compression Partners, LP, together with its subsidiaries, provides compression services under fixed-term contracts to oil companies and independent producers, processors, gatherers, and transporters of natural gas and crude oil. The company also designs, engineers, owns, operates, and maintains natural gas compression packages. In addition, it provides compression services in shale plays primarily in the Utica, Marcellus, Permian Basin, Delaware Basin, Eagle Ford, Mississippi Lime, Granite Wash, Woodford, Barnett, Haynesville, Niobrara, and Fayetteville shales in the Unites States. The company was founded in 1998 and is headquartered in Austin, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Austin"
    },
    "USEI": {
        "short_name": "US ENERGY INITIATIVES",
        "long_name": "U.S. Energy Initiatives Corporation Inc.",
        "summary": "U.S. Energy Initiatives Corporation Inc., together with its subsidiaries, markets topical ointments, cannabis oils, tinctures, and vapor pens and accessories. The company was formerly known as Hybrid Fuel Systems, Inc. and changed its name to U.S. Energy Initiatives Corporation Inc. in June 2006. U.S. Energy Initiatives Corporation Inc. was founded in 1996 and is based in Santa Clarita, California.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Santa Clarita"
    },
    "VTOL": {
        "short_name": "Bristow Group, Inc.",
        "long_name": "Bristow Group Inc.",
        "summary": "Bristow Group Inc. provides aviation services to integrated, national, and independent offshore energy companies. It also offers commercial and public sector search and rescue services; and other ad hoc helicopter and fixed wing transportation services. As of November 30, 2020, the company had a fleet of 257 aircraft. It operates in Australia, Brazil, Canada, Chile, Colombia, Guyana, India, Mexico, Nigeria, Norway, Spain, Suriname, Trinidad, the United Kingdom, and the United States. The company is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "VYEY": {
        "short_name": "VICTORY OILFIELD TECH INC",
        "long_name": "Victory Oilfield Tech, Inc.",
        "summary": "Victory Oilfield Tech, Inc. operates as an oilfield technology products company in the United States. It offers patented oil and gas technology drilling products designed for oil and gas well drilling outcomes. The company also provides various hardbanding solutions to oilfield operators for drill pipe, weight pipe, tubing, and drill collars. Victory Oilfield Tech, Inc. was founded in 1982 and is based in Austin, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Austin"
    },
    "WFTLF": {
        "short_name": "WEATHERFORD INTL PLC",
        "long_name": "Weatherford International plc",
        "summary": "Weatherford International plc, an oilfield service company, provides equipment and services for the drilling, evaluation, completion, production, and intervention of oil and natural gas wells worldwide. The company operates in two segments, Western Hemisphere and Eastern Hemisphere. It offers artificial lift systems, including reciprocating rod, progressing cavity pumping, gas, hydraulic, plunger, and hybrid lift systems, as well as related automation and control systems; pressure pumping and reservoir stimulation services, such as acidizing, fracturing and fluid systems, cementing, and coiled-tubing intervention; and drill stem test tools, and surface well testing and multiphase flow measurement services. The company also provides safety, downhole reservoir monitoring, flow control, and multistage fracturing systems, as well as sand-control technologies, and production and isolation packers; liner hangers to suspend a casing string in high-temperature and high-pressure wells; cementing products, including plugs, float and stage equipment, and torque-and-drag reduction technology for zonal isolation; and pre-job planning and installation services. In addition, it offers directional drilling services, and logging and measurement services while drilling; services related to rotary-steerable systems, high-temperature and high-pressure sensors, drilling reamers, and circulation subs; managed pressure drilling, conventional mud-logging, drilling instrumentation, gas analysis, wellsite consultancy, and open hole and cased-hole logging services; intervention and remediation services; and reservoir solutions and software products. Further, the company provides equipment and drilling tools; tubular handling, management, and connection services; equipment rental services; and onshore contract drilling and related services through a fleet of land drilling and workover rigs. Weatherford International plc was incorporated in 1972 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "WHD": {
        "short_name": "Cactus, Inc. Class A Common Sto",
        "long_name": "Cactus, Inc.",
        "summary": "Cactus, Inc. designs, manufactures, sells, and rents a range of wellheads and pressure control equipment. The company's principal products include Cactus SafeDrill wellhead systems, Cactus SafeLink systems, frac stacks, zipper manifolds, and production trees. It also provides field services, such as 24-hour service crews to assist with the installation, maintenance, repair, and safe handling of the wellhead and pressure control equipment. The company sells or rents its products for onshore unconventional oil and gas wells that are utilized during the drilling, completion, and production phases of its customers' wells. It operates 14 service centers in the United States, as well as 3 service centers in Eastern Australia. Cactus, Inc. was founded in 2011 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "WOGI": {
        "short_name": "WORLD OIL GROUP INC",
        "long_name": "World Oil Group, Inc.",
        "summary": "Cyber Kiosk Solutions, Inc. provides oil drilling services. The company was incorporated in 2013 and is based in Debary, Florida.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Debary"
    },
    "WTTR": {
        "short_name": "Select Energy Services, Inc.",
        "long_name": "Select Energy Services, Inc.",
        "summary": "Select Energy Services, Inc., an oilfield services company, provides water management and chemical solutions to the onshore oil and natural gas industry in the United States. The company operates through three segments: Water Services, Water Infrastructure, and Oilfield Chemicals. The Water Services segment provides water-related services, including water transfer, flow back and well testing, water containment, fluids hauling, water monitoring, and water network automation; technology solutions comprising hydrographic mapping, water volume and quality monitoring, remote pit and tank monitoring, leak detection, asset and fuel tracking, and automated-equipment services, as well as various on-site rental equipment and workforce accommodation services. The Water Infrastructure segment develops, builds, and operates semi-permanent and permanent infrastructure solutions to support oil and gas well development. The Oilfield Chemicals segment develops, manufactures, and provides a suite of chemicals used in hydraulic fracturing, stimulation, cementing, production, pipelines, and well completions, including polymer slurries, cross linkers, friction reducers, biocides, scale inhibitors, corrosion inhibitors, buffers, breakers, and other chemical technologies to pressure pumping, and integrated and independent oil and gas producers. This segment also offers production chemical solutions for underperforming wells in order to enhance well performance and reduce production costs; and ancillary oilfield services comprising corrosion and scale monitoring, chemical inventory management, well failure analysis, and lab services. Select Energy Services, Inc. was founded in 2016 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "XREG": {
        "short_name": "XR ENERGY INC",
        "long_name": "XR Energy, Inc.",
        "summary": "XR Energy, Inc. offers energy consulting services to smaller sized middle market companies in the New York metropolitan area. The company was incorporated in 2009 and is based in Irving, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Irving"
    }
}