{"0KF2.F": {"short_name": "LILIS ENERGY  DL-,0001", "long_name": "Lilis Energy, Inc.", "summary": "Lilis Energy, Inc., an independent oil and natural gas company, engages in the acquisition, exploration, development, and production of oil and natural gas properties. Its total net acreage in the Delaware Basin is approximately 19,562 acres. The company's oil and natural gas properties are located in the Delaware Basin in Winkler, Loving, and Reeves counties, Texas; and Lea County, New Mexico. As of December 31, 2019, it had proved reserves of 12,521 million barrels of oil equivalent. The company was formerly known as Recovery Energy, Inc. and changed its name to Lilis Energy, Inc. in December 2013. Lilis Energy, Inc. was incorporated in 2007 and is headquartered in Fort Worth, Texas. On June 28, 2020, Lilis Energy, Inc. filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the Southern District of Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Fort Worth"}, "1P6.F": {"short_name": "BERRY CORP.  DL -,001", "long_name": "Berry Corporation", "summary": "Berry Corporation, an independent upstream energy company, engages in the development and production of conventional oil reserves located in the western United States. The company's properties are located in the San Joaquin and Ventura basins, California; Uinta basin, Utah; and Piceance basin, Colorado. As of December 31, 2019, it had a total of 3,541 net producing wells. The company was formerly known as Berry Petroleum Corporation and changed its name to Berry Corporation in February 2020. Berry Corporation was founded in 1909 and is headquartered in Dallas, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Dallas"}, "1TO.F": {"short_name": "TORCHL.ENERGY RES.DL-,001", "long_name": "Torchlight Energy Resources, Inc.", "summary": "Torchlight Energy Resources, Inc., through its subsidiaries, engages in the acquisition, exploration, exploitation, and/or development of oil and natural gas properties in the United States. As of December 31, 2019, it had interests in four oil and gas projects, including the Orogrande project in Hudspeth County, Texas; Hazel project in Sterling, Tom Green, and Irion Counties, Texas; Winkler project in Winkler County, Texas; and Hunton wells in partnership with Husky Ventures in central Oklahoma. The company was founded in 2010 and is headquartered in Plano, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Plano"}, "27Z1.F": {"short_name": "HIGHPOIN.RES.CORP DL-,001", "long_name": "HighPoint Resources Corporation", "summary": "HighPoint Resources Corporation, together with its subsidiaries, engages in the exploration, development, and production of oil, natural gas, and natural gas liquids in the United States. The company primarily holds interest in the Denver Julesburg Basin in Colorado's eastern plains and parts of southeastern Wyoming. HighPoint Resources Corporation is headquartered in Denver, Colorado.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Denver"}, "3RF.F": {"short_name": "SUNDANCE ENERGY INC.", "long_name": "Sundance Energy Inc.", "summary": "Sundance Energy Inc. operates as an onshore independent oil and natural gas company in North America. The company explores for, develops, and produces oil and natural gas. It focuses on operations on its 41,000 net acres in the Eagle Ford, Live Oak, Atascosa, La Salle, and McMullen counties, South Texas. Sundance Energy, Inc. is headquartered in Denver, Colorado.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Denver"}, "47Q.F": {"short_name": "OVINTIV INC.  DL-,01", "long_name": "Ovintiv Inc.", "summary": "Ovintiv Inc., together with its subsidiaries, engages in the exploration, development, production, and marketing of natural gas, oil, and natural gas liquids. The company's principal assets include Permian in west Texas and Anadarko in west-central Oklahoma; and Montney in northeast British Columbia and northwest Alberta. Its other upstream assets comprise Eagle Ford in south Texas, Bakken in North Dakota, and Uinta in central Utah; and Duvernay in west central Alberta, Wheatland in southern Alberta, Horn River in northeast British Columbia, and Deep Panuke in offshore Nova Scotia. The company was formerly known as Encana Corporation and changed its name to Ovintiv Inc. in January 2020. Ovintiv Inc. is based in Denver, Colorado.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Denver"}, "58L5.F": {"short_name": "CAMBER ENERGY INC. DL-,01", "long_name": "Camber Energy, Inc.", "summary": "Camber Energy, Inc., an independent oil and natural gas company, engages in the acquisition, development, and sale of crude oil, natural gas, and natural gas liquids (NGL) in the Cline shale and upper Wolfberry shale in Glasscock County, Texas. As of March 31, 2020, its total estimated proved reserves were 133,442 million barrels of oil equivalent comprising 54,850 barrels of crude oil reserves, 43,955 barrels of NGL reserves, and 207,823 million cubic feet of natural gas reserves. The company was formerly known as Lucas Energy Inc. and changed its name to Camber Energy, Inc. in January 2017. Camber Energy, Inc. was incorporated in 2003 and is based in Houston, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Houston"}, "58R.F": {"short_name": "HIGHPEAK ENERGY DL-,0001", "long_name": "HighPeak Energy, Inc.", "summary": "HighPeak Energy, Inc., an independent oil and natural gas company, engages in the acquisition, exploration, development, and production of oil, natural gas, and natural gas liquids reserves in the United States. Its primary assets are located in Howard County of the Midland Basin, Texas. The company was founded in 2019 and is headquartered in Fort Worth, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Fort Worth"}, "5AH.F": {"short_name": "PHX MINERALS A  DL-,01666", "long_name": "PHX Minerals Inc.", "summary": "PHX Minerals Inc. acquires, develops, and manages oil and natural gas properties in the United States. The company produces and sells natural gas, crude oil, and natural gas liquids. Its principal properties are located in Oklahoma, Arkansas, Texas, New Mexico, and North Dakota. As of September 30, 2020, the company owned perpetual ownership of 252,443 net mineral acres; leased 17,091 net acres; and held working interests and royalty interests in 6,510 producing oil and natural gas wells, as well as had 125 wells in the process of being drilled or completed. It sells its products to various purchasers, including pipeline and marketing companies. The company was formerly known as Panhandle Oil and Gas Inc. and changed its name to PHX Minerals Inc. in October 2020. PHX Minerals Inc. was founded in 1926 and is based in Oklahoma City, Oklahoma.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Oklahoma City"}, "7A6.F": {"short_name": "ANTERO RES CORP.  DL -,01", "long_name": "Antero Resources Corporation", "summary": "Antero Resources Corporation, an independent oil and natural gas company, acquires, explores for, develops, and produces natural gas, natural gas liquids, and oil properties in the United States. As of December 31, 2019, the company had approximately 451,000 net acres in the southwestern core of the Marcellus Shale; and 91,000 net acres in the core of the Utica Shale. It also owned and operated 324 miles of gas gathering pipelines in the Marcellus Shale; 17 compressor stations in the Marcellus Shale; 110 miles of low-pressure and high-pressure gathering pipelines in the Utica Shale; 8 miles of high-pressure pipelines; and 2 compressor stations in the Utica Shale. The company had estimated proved reserves of 18.9 trillion cubic feet of natural gas equivalent, including 11.5 trillion cubic feet of natural gas; 652 million barrels of assumed recovered ethane; 540 million barrels of primarily propane, isobutane, normal butane, and natural gasoline; and 42 million barrels of oil. The company was formerly known as Antero Resources Appalachian Corporation and changed its name to Antero Resources Corporation in June 2013. Antero Resources Corporation was founded in 2002 and is headquartered in Denver, Colorado.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Denver"}, "7T2.F": {"short_name": "TALOS ENERGY INC.  DL-,01", "long_name": "Talos Energy Inc.", "summary": "Talos Energy Inc., an independent exploration and production company, focuses on the exploration and production of oil and natural gas properties in the United States Gulf of Mexico and offshore Mexico. The company was founded in 2011 and is based in Houston, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Houston"}, "8LP1.F": {"short_name": "LAREDO PETROLE.INC.DL-,01", "long_name": "Laredo Petroleum, Inc.", "summary": "Laredo Petroleum, Inc., an independent energy company, engages in the acquisition, exploration, and development of oil and natural gas properties in the Permian Basin of West Texas, the United States. The company also engages in midstream and marketing infrastructure activities, including transportation and marketing of oil and natural gas, and handling of fresh, recycled, and produced water, as well as operates natural gas lift facilities. As of December 31, 2019, it had assembled 133,512 net acres in the Permian Basin; and had total proved reserves of 293,377 thousand barrels of oil equivalent. The company was formerly known as Laredo Petroleum Holdings, Inc. and changed its name to Laredo Petroleum, Inc. in December 2013. Laredo Petroleum, Inc. was founded in 2006 and is headquartered in Tulsa, Oklahoma.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Tulsa"}, "ADNY": {"short_name": "ADINO ENERGY CORPORATION", "long_name": "Adino Energy Corporation", "summary": "Adino Energy Corporation focuses on oil and gas exploration and production company. The company was formerly known as Consolidated Medical Management, Inc. and changed its name to Adino Energy Corporation in January 2008. Adino Energy Corporation was incorporated in 1981 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "AEGG": {"short_name": "AMERICAN ENERGY GROUP LTD", "long_name": "The American Energy Group, Ltd.", "summary": "The American Energy Group, Ltd. operates as an energy resource royalty company. The company holds 18% interest in the Yasin (2768-7) Block in Pakistan; and interests in two oil and gas leases in Galveston County, Texas. It also holds a 2.5% working interest in the Sanjawi Block No. 3068-2, Zone II that covers an area of 2,258 square kilometer located in Baluchistan Province; and Zamzama North Block No. 2667-8, Zone III that covers an area of 1,229 square kilometer located in Sindh Province. The company was formerly known as Belize-American Corp. Internationale and changed its name to The American Energy Group, Ltd. in November 1994. The American Energy Group, Ltd. was incorporated in 1987 and is headquartered in Westport, Connecticut.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Westport"}, "AERN": {"short_name": "AER ENERGY RESOURCES INC", "long_name": "AER Energy Resources, Inc", "summary": "AER Energy Resources, Inc., through its subsidiaries, engages in acquiring, managing, and operating oil and gas properties in North America. The company is also involved in the recycling of used motor oil; marketing of related fuel and energy products to users, suppliers, and recycler's; and real estate business. AER Energy Resources, Inc. was founded in 1989 and is based in Scottsdale, Arizona.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Scottsdale"}, "AGGI": {"short_name": "ALLIED ENERGY INC FLA", "long_name": "Allied Energy, Inc.", "summary": "Allied Energy, Inc. operates as an independent oil and gas exploration and development company. The company's oil and gas projects are located in the Rogers County, Oklahoma; Leon County, Texas; Morgan County, Colorado; and Washington/Athens County, Ohio. It has approximately 6,000 acres under lease, and 70 wells under development. The company was formerly known as Allied Energy Group, Inc. and changed its name to Allied Energy, Inc. in November 2007. Allied Energy, Inc. was founded in 2003 and is headquartered in Bowling Green, Kentucky.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Bowling Green"}, "AHC.DE": {"short_name": "HESS CORP.  DL 1", "long_name": "Hess Corporation", "summary": "Hess Corporation, an exploration and production company, explores, develops, produces, purchases, transports, and sells crude oil, natural gas liquids (NGLs), and natural gas. It operates through two segments, Exploration and Production, and Midstream. The company conducts production operations primarily in the United States, Denmark, the Malaysia/Thailand Joint Development Area, and Malaysia; and exploration activities primarily offshore Guyana, Suriname, Canada, and in the Gulf of Mexico. As of December 31, 2019, it had total proved reserves of 1,197 million barrels of oil equivalent. The company is also involved in the gathering, compressing, and processing of natural gas; fractionating NGLs; terminaling, loading, and transporting crude oil and NGLs through rail car; storing and terminaling propane, as well as providing water handling services primarily in the Bakken Shale plays in the Williston Basin area of North Dakota. The company was founded in 1920 and is headquartered in New York, New York.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "GER", "market": "de_market", "country": "United States", "city": "New York"}, "AHC.F": {"short_name": "HESS CORP.  DL 1", "long_name": "Hess Corporation", "summary": "Hess Corporation, an exploration and production company, explores, develops, produces, purchases, transports, and sells crude oil, natural gas liquids (NGLs), and natural gas. It operates through two segments, Exploration and Production, and Midstream. The company conducts production operations primarily in the United States, Denmark, the Malaysia/Thailand Joint Development Area, and Malaysia; and exploration activities primarily offshore Guyana, Suriname, Canada, and in the Gulf of Mexico. As of December 31, 2019, it had total proved reserves of 1,197 million barrels of oil equivalent. The company is also involved in the gathering, compressing, and processing of natural gas; fractionating NGLs; terminaling, loading, and transporting crude oil and NGLs through rail car; storing and terminaling propane, as well as providing water handling services primarily in the Bakken Shale plays in the Williston Basin area of North Dakota. The company was founded in 1920 and is headquartered in New York, New York.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "New York"}, "AKVA": {"short_name": "ARKANOVA ENERGY COMPANY", "long_name": "Arkanova Energy Corporation", "summary": "Arkanova Energy Corporation, a junior oil and gas producing company, engages in the acquisition, exploration, and development of oil and gas properties in the United States. The company holds property interests in two counties in the State of Montana. It also holds leasehold interests located in Pondera and Glacier counties, Montana. The company is headquartered in Austin, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Austin"}, "ALME": {"short_name": "ALAMO ENERGY CORPORATION", "long_name": "Alamo Energy Corp.", "summary": "Alamo Energy Corp. operates as an oil and gas company in the United States. The company explores for, produces, and develops oil and natural gas properties. It has a 50% working interest the Florence Valentine Lease and a working interest and net revenue interest in the Valentine #1 re-entry well located on approximately 115 acres in Ritchie County, West Virginia. Alamo Energy Corp. is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "ALOD": {"short_name": "ALLIED RESOURCES INC", "long_name": "Allied Resources, Inc.", "summary": "Allied Resources, Inc., an independent oil and natural gas producer, engages in the exploration, development, production, and sale of oil and gas in the United States. It owns varying interests in a total of 145 wells situated on acreage of approximately 3,400 acres in Ritchie and Calhoun counties, West Virginia; and 10 wells situated on acreage of approximately 2,510 acres in Goliad, Edwards, and Jackson counties, Texas. The company was formerly known as General Allied Oil and Gas Co and changed its name to Allied Resources, Inc. in August 1998. Allied Resources, Inc. was founded in 1979 and is based in Salt Lake City, Utah.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Salt Lake City"}, "ALTX": {"short_name": "ALTEX INDUSTRIES INC", "long_name": "Altex Industries, Inc.", "summary": "Altex Industries, Inc., through its subsidiary, Altex Oil Corporation, owns interests in productive onshore oil and gas properties located in Utah and Wyoming. As of September 30, 2020, it had 1,100 barrels of proved and developed oil reserves. The company was incorporated in 1985 and is based in Denver, Colorado.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Denver"}, "AMAZ": {"short_name": "AMAZING ENERGY OIL & GAS COMPAN", "long_name": "Amazing Energy Oil and Gas, Co.", "summary": "Amazing Energy Oil and Gas, Co., together with its subsidiaries, engages in the exploration, development, and production of oil and gas in the United States. As of July 31, 2019, the company had leasehold rights to approximately 70,000 acres in Pecos County, Texas, and 5,385 acres in Lea County, New Mexico with estimated net proved reserves of 499,666 barrels of oil equivalent. It also owned 26 oil and gas wells in the Permian Basin and 7 oil wells in Lea County, New Mexico. In addition, the company provides oilfield services to oil and gas well owners. Amazing Energy Oil and Gas, Co. is based in Fort Worth, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Fort Worth"}, "AMEN": {"short_name": "AMEN PROPERTIES INC", "long_name": "AMEN Properties, Inc.", "summary": "AMEN Properties, Inc. owns oil and gas royalty and working interests in various oil and gas properties in the United States. It holds interests in oil gas and gas royalties through its ownership of SFF Royalty, LLC; and 100% interests in SFF Production, LLC. The company was formerly known as Crosswalk.com, Inc. and changed its name to AMEN Properties, Inc. in October 2002. AMEN Properties, Inc. was incorporated in 1993 and is based in Richardson, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Richardson"}, "AMPY": {"short_name": "Amplify Energy Corp.", "long_name": "Amplify Energy Corp.", "summary": "Amplify Energy Corp. engages in the acquisition, development, exploitation, and production of oil and natural gas properties in the United States. The company's properties consist of operated and non-operated working interests in producing and undeveloped leasehold acreage, as well as working interests in identified producing wells located in Oklahoma, the Rockies, federal waters offshore Southern California, East Texas/North Louisiana, and South Texas. As of December 31, 2019, it had total estimated proved reserves of approximately 163.0 million barrels of oil equivalent; and 2,643 gross wells. Amplify Energy Corp. was founded in 2011 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Houston"}, "APA": {"short_name": "Apache Corporation", "long_name": "Apache Corporation", "summary": "Apache Corporation, an independent energy company, explores for, develops, and produces natural gas, crude oil, and natural gas liquids (NGLs). The company has operations in onshore assets located in the Permian and Midcontinent/Gulf Coast onshore regions; and offshore assets situated in the Gulf of Mexico region. It also holds onshore assets in Egypt's Western desert; and offshore assets in the North Sea region, including the United Kingdom. In addition, the company has an offshore exploration program in Suriname. As of December 31, 2019, it had total estimated proved reserves of 551 million barrels of crude oil, 186 million barrels of NGLs, and 1.6 trillion cubic feet of natural gas. Apache Corporation was founded in 1954 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Houston"}, "APA.DE": {"short_name": "APACHE CORP.  DL -,625", "long_name": "Apache Corporation", "summary": "Apache Corporation, an independent energy company, explores for, develops, and produces natural gas, crude oil, and natural gas liquids (NGLs). The company has operations in onshore assets located in the Permian and Midcontinent/Gulf Coast onshore regions; and offshore assets situated in the Gulf of Mexico region. It also holds onshore assets in Egypt's Western desert; and offshore assets in the North Sea region, including the United Kingdom. In addition, the company has an offshore exploration program in Suriname. As of December 31, 2019, it had total estimated proved reserves of 551 million barrels of crude oil, 186 million barrels of NGLs, and 1.6 trillion cubic feet of natural gas. Apache Corporation was founded in 1954 and is based in Houston, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "GER", "market": "de_market", "country": "United States", "city": "Houston"}, "APA.F": {"short_name": "APACHE CORP.  DL -,625", "long_name": "Apache Corporation", "summary": "Apache Corporation, an independent energy company, explores for, develops, and produces natural gas, crude oil, and natural gas liquids (NGLs). The company has operations in onshore assets located in the Permian and Midcontinent/Gulf Coast onshore regions; and offshore assets situated in the Gulf of Mexico region. It also holds onshore assets in Egypt's Western desert; and offshore assets in the North Sea region, including the United Kingdom. In addition, the company has an offshore exploration program in Suriname. As of December 31, 2019, it had total estimated proved reserves of 551 million barrels of crude oil, 186 million barrels of NGLs, and 1.6 trillion cubic feet of natural gas. Apache Corporation was founded in 1954 and is based in Houston, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Houston"}, "APA.MX": {"short_name": "APACHE CORP", "long_name": "Apache Corporation", "summary": "Apache Corporation, an independent energy company, explores for, develops, and produces natural gas, crude oil, and natural gas liquids (NGLs). The company has operations in onshore assets located in the Permian and Midcontinent/Gulf Coast onshore regions; and offshore assets situated in the Gulf of Mexico region. It also holds onshore assets in Egypt's Western desert; and offshore assets in the North Sea region, including the United Kingdom. In addition, the company has an offshore exploration program in Suriname. As of December 31, 2019, it had total estimated proved reserves of 551 million barrels of crude oil, 186 million barrels of NGLs, and 1.6 trillion cubic feet of natural gas. Apache Corporation was founded in 1954 and is based in Houston, Texas.", "currency": "MXN", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Houston"}, "APHE": {"short_name": "ALPHA ENERGY INC", "long_name": "Alpha Energy, Inc.", "summary": "Alpha Energy, Inc., an independent energy company, engages in the acquisition, exploration, development, and production of crude oil and natural gas in the United States. It has an option to acquire the Coral Project, which covers an area of 1,100 acres; and the Logan 2 Project that covers an area of 6,900 acres located in Cherokee Uplift, central Oklahoma. The company was founded in 2013 and is based in Houston, Texas. Alpha Energy, Inc. operates as a subsidiary of AEI Acquisition LLC.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "AR": {"short_name": "Antero Resources Corporation", "long_name": "Antero Resources Corporation", "summary": "Antero Resources Corporation, an independent oil and natural gas company, acquires, explores for, develops, and produces natural gas, natural gas liquids, and oil properties in the United States. As of December 31, 2019, the company had approximately 451,000 net acres in the southwestern core of the Marcellus Shale; and 91,000 net acres in the core of the Utica Shale. It also owned and operated 324 miles of gas gathering pipelines in the Marcellus Shale; 17 compressor stations in the Marcellus Shale; 110 miles of low-pressure and high-pressure gathering pipelines in the Utica Shale; 8 miles of high-pressure pipelines; and 2 compressor stations in the Utica Shale. The company had estimated proved reserves of 18.9 trillion cubic feet of natural gas equivalent, including 11.5 trillion cubic feet of natural gas; 652 million barrels of assumed recovered ethane; 540 million barrels of primarily propane, isobutane, normal butane, and natural gasoline; and 42 million barrels of oil. The company was formerly known as Antero Resources Appalachian Corporation and changed its name to Antero Resources Corporation in June 2013. Antero Resources Corporation was founded in 2002 and is headquartered in Denver, Colorado.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Denver"}, "ARET": {"short_name": "ARETE INDUSTRIES INC", "long_name": "Arête Industries, Inc.", "summary": "ArÃªte Industries, Inc., an independent oil and gas company, engages in the acquisition and development of oil and natural gas reserves in the United States. It has oil and natural gas properties in Wyoming, Kansas, Colorado, and Montana. The company was incorporated in 1987 and is based in Westminster, Colorado.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Westminster"}, "ATLS": {"short_name": "ATLAS ENERGY GROUP LLC", "long_name": "Atlas Energy Group, LLC", "summary": "Atlas Energy Group, LLC, through its subsidiaries, develops and produces natural gas, crude oil, and natural gas liquids in the United States. The company has interests in the Eagle Ford Shale in southern Texas; the Marble Falls play in the Fort Worth Basin in northern Texas; and the Mississippi Lime play in northwestern Oklahoma. It also focuses on investing in master limited partnership qualifying energy-related businesses and assets. The company was founded in 2011 and is based in Fort Worth, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Fort Worth"}, "ATPGQ": {"short_name": "ATP OIL & GAS CORP", "long_name": "ATP Oil & Gas Corp.", "summary": "ATP Oil & Gas Corp. engages in the acquisition, development, and production of oil and natural gas properties primarily in the Gulf of Mexico and the United Kingdom sector of the North Sea. The company also has interests in three deepwater licenses in the Mediterranean Sea off the coast of Israel. As of December 31, 2011, it had estimated net proved reserves of 118.9 million barrels of crude oil equivalent (MMBoe), of which approximately 75.9 MMBoe were in the Gulf of Mexico and 42.9 MMBoe were in the North Sea. The company's reserves comprised approximately 78.6 million barrels of crude oil or other liquid hydrocarbons and 241.5 billion cubic feet of natural gas. It also owned leasehold and other interests in 38 offshore blocks and 49 wells comprising 23 subsea wells in the Gulf of Mexico, as well as had interests in 13 blocks and 2 company-operated subsea wells in the North Sea. ATP Oil & Gas Corporation was founded in 1991 and is headquartered in Houston, Texas. On June 26, 2014, the voluntary petition of ATP Oil & Gas Corp. for reorganization under Chapter 11 was converted to Chapter 7. It had filed for Chapter 11 bankruptcy on August 17, 2012.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "AUNXF": {"short_name": "FREMONT PETROLEUM CORPORATION L", "long_name": "Fremont Petroleum Corporation Ltd", "summary": "Fremont Petroleum Corporation Ltd engages in the exploration and development of oil and gas assets in the United States. It holds 100% interest in the Pathfinder project covering an area of 15,282 acres in DJ Basin in Colorado. The company was formerly known as Austin Exploration Limited and changed its name to Fremont Petroleum Corporation Ltd in June 2017. Fremont Petroleum Corporation Ltd was founded in 2006 and is headquartered in Florence, Colorado.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Florence"}, "AXAS": {"short_name": "Abraxas Petroleum Corporation", "long_name": "Abraxas Petroleum Corporation", "summary": "Abraxas Petroleum Corporation, an independent energy company, engages in the acquisition, exploration, exploitation, development, and production of oil and gas properties in the United States. The company operates oil and gas assets in the Permian/Delaware Basin, the Rocky Mountain, and South Texas regions. As of December 31, 2019, its estimated net proved reserves were 56.4 million barrels of oil equivalent. The company was founded in 1977 and is based in San Antonio, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NCM", "market": "us_market", "country": "United States", "city": "San Antonio"}, "AXGC": {"short_name": "AXIS ENERGY CORP", "long_name": "Axis Energy Corporation", "summary": "Axis Energy Corporation engages in the acquisition and development of oil and gas properties. The company was founded in 1992 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "AXOA.F": {"short_name": "ABRAXAS PET. CORP. DL-,01", "long_name": "Abraxas Petroleum Corporation", "summary": "Abraxas Petroleum Corporation, an independent energy company, engages in the acquisition, exploration, exploitation, development, and production of oil and gas properties in the United States. The company operates oil and gas assets in the Permian/Delaware Basin, the Rocky Mountain, and South Texas regions. As of December 31, 2019, its estimated net proved reserves were 56.4 million barrels of oil equivalent. The company was founded in 1977 and is based in San Antonio, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "San Antonio"}, "AXPT": {"short_name": "AXIS PETROLEUM CO", "long_name": "Axis Petroleum Co.", "summary": "Axis Petroleum Co. engages in the production and sale of crude oil. The company is based in Signal Hill, California.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Signal Hill"}, "B2CN.F": {"short_name": "BONANZA CREEK NEW DL-,001", "long_name": "Bonanza Creek Energy, Inc.", "summary": "Bonanza Creek Energy, Inc., an exploration and production company, focuses on the extraction of onshore oil and related liquids-rich natural gas in the United States. Its primary oil and liquids-weighted assets are located in the Wattenberg Field in Colorado. As of December 31, 2019, the company had proved reserves of 121.9 million barrel of oil equivalent. Bonanza Creek Energy, Inc. was founded in 1999 and is headquartered in Denver, Colorado.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Denver"}, "BATL": {"short_name": "Battalion Oil Corporation", "long_name": "Battalion Oil Corporation", "summary": "Battalion Oil Corporation, an independent energy company, engages in the acquisition, production, exploration, and development of onshore oil and natural gas assets in the United States. As of December 31, 2019, the company held interests in 52,368 net acres in the Delaware Basin located in the counties of Pecos, Reeves, Ward, and Winkler, Texas. It also had estimated proved reserves of approximately 62.1 million barrels of oil equivalent comprising 39.2 million barrels of crude oil, 10.8 million barrels of natural gas liquids, and 72.3 billion cubic feet of natural gas. The company was formerly known as HalcÃ³n Resources Corporation and changed its name to Battalion Oil Corporation in January 2020. Battalion Oil Corporation was incorporated in 2004 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Houston"}, "BBLS": {"short_name": "PETROLIA ENERGY CORP", "long_name": "Petrolia Energy Corporation", "summary": "Petrolia Energy Corporation engages in the exploration, development, and production of oil and gas properties in the United States. The company holds a 100% working interests in the Minerva-Rockdale Field comprising approximately 50 square miles located in Austin, Texas; the Slick Unit Dutcher Sands oilfield consisting of approximately 2,600 acres located in Creek County, Oklahoma; and the Twin Lakes San Andres Unit covering an area of approximately 4,864 acres located in Chavez County, New Mexico. It holds a 25% interest in approximately 41,526 acres located in the Luseland, Hearts Hill, and Cuthbert fields, located in Southwest Saskatchewan and Eastern Alberta, Canada. The company was formerly known as Rockdale Resources Corporation and changed its name to Petrolia Energy Corporation in September 2016. Petrolia Energy Corporation was incorporated in 2002 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "BCEI": {"short_name": "Bonanza Creek Energy, Inc.", "long_name": "Bonanza Creek Energy, Inc.", "summary": "Bonanza Creek Energy, Inc., an exploration and production company, focuses on the extraction of onshore oil and related liquids-rich natural gas in the United States. Its primary oil and liquids-weighted assets are located in the Wattenberg Field in Colorado. As of December 31, 2019, the company had proved reserves of 121.9 million barrel of oil equivalent. Bonanza Creek Energy, Inc. was founded in 1999 and is headquartered in Denver, Colorado.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Denver"}, "BDGR": {"short_name": "BLACK DRAGON RESOURCE COS INC", "long_name": "Black Dragon Resource Companies, Inc.", "summary": "Black Dragon Resource Companies, Inc. engages in the acquisition, development, production, and sale of oil and natural gas, and oil and natural gas properties primarily in the United States. The company was formerly known as Black Dragon Resource, Inc. and changed its name to Black Dragon Resource Companies, Inc. in December 2004. Black Dragon Resource Companies, Inc. was founded in 1998 and is headquartered in Oil City, Louisiana.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Oil City"}, "BERI": {"short_name": "BLUE EARTH RESOURCES INC", "long_name": "Blue Earth Resources, Inc.", "summary": "Blue Earth Resources, Inc., through its subsidiary, PetroResources, Inc., engages in the acquisition and asset management of royalty and override royalty interests, and/or non-operating working interests in producing oil and gas properties in the United States. It holds minority interests in approximately 300 wells located in 8 states. The company was formerly known as Century Controls International, Inc. and changed its name to Blue Earth Resources, Inc. in September 2010. Blue Earth Resources, Inc. is based in Inver Grove Heights, Minnesota.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Inver Grove Heights"}, "BLMC": {"short_name": "BILOXI MARSH LDS CORP", "long_name": "Biloxi Marsh Lands Corporation", "summary": "Biloxi Marsh Lands Corporation engages in the exploration and development of oil and natural gas resources in Louisiana and Texas. The company's principal assets are surface and mineral rights to approximately 90,000 acres of marsh lands located in St. Bernard Parish, Louisiana. As of December 31, 2019, it had proved reserves of approximately 1.13 billion cubic feet of natural gas and approximately 60.0 thousand barrels of oil. The company was founded in 1936 and is based in Metairie, Louisiana.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Metairie"}, "BPIGF": {"short_name": "BPI ENERGY HOLDGINS INC", "long_name": "BPI Energy Holdings, Inc", "summary": "BPI Energy Holdings, Inc., through its subsidiary, BPI Energy, Inc., engages in the acquisition, exploration, development, production, and sale of coalbed methane (CBM) properties in the United States. It owns approximately 500,000 acres of CBM rights in the Illinois Basin. The company also has interests in Southern Illinois Basin project covering approximately 10,000 acres in the southern part of the Illinois Basin; the Northern Illinois Basin project covering 353,531 acres in Montgomery, Shelby, Christian, Fayette, and Macoupin Counties in Illinois; and the Western Illinois Basin project covering 135,948 acres in Clinton, Washington, Marion, and Perry Counties in Illinois. As of July 31, 2007, it had 16,274 million cubic feet of total estimated proved developed and undeveloped reserves. The company was founded in 1980 and is headquartered in Solon, Ohio.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Solon"}, "BRLL": {"short_name": "BARREL ENERGY INC", "long_name": "Barrel Energy, Inc.", "summary": "Barrel Energy, Inc. focuses on the cultivation and production of hemp in the United States. The Company holds a land of 602 acres on lease in central California to grow hemp for extracting CBD and the use of fiber in clothing and other materials. It also holds interest in capped oil and gas properties in Alberta, Canada. The company was founded in 2014 and is based in Las Vegas, Nevada.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Las Vegas"}, "BRN": {"short_name": "Barnwell Industries, Inc.", "long_name": "Barnwell Industries, Inc.", "summary": "Barnwell Industries, Inc. acquires, develops, produces, and sells oil and natural gas in Canada. The company operates through three segments: Oil and Natural Gas, Land Investment, and Contract Drilling. It also invests in land interests in Hawaii. In addition, the company owns and operates five water well drilling rigs, two pump rigs, and other ancillary drilling and pump equipment; drills water and water monitoring wells of various depths; installs and repairs water pumping systems; and distributes Floway pumps and equipment in Hawaii. Barnwell Industries, Inc. was founded in 1956 and is headquartered in Honolulu, Hawaii.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Honolulu"}, "BROE": {"short_name": "BARON ENERGY INC", "long_name": "Baron Energy, Inc.", "summary": "Baron Energy, Inc. operates as an independent oil and natural gas production company that engages in acquisition, operation, and exploitation of producing oil and gas properties in Texas. The company performs petroleum management and business development services for client companies that focuses on acquiring assets located in South Texas. Baron Energy, Inc. was formerly known as Nevwest Explorations Corp. and changed its name to Baron Energy, Inc. in September, 2008. The company was incorporated in 2007 and is based in San Marcos, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "San Marcos"}, "BRY": {"short_name": "Berry Corporation (bry)", "long_name": "Berry Corporation", "summary": "Berry Corporation, an independent upstream energy company, engages in the development and production of conventional oil reserves located in the western United States. The company's properties are located in the San Joaquin and Ventura basins, California; Uinta basin, Utah; and Piceance basin, Colorado. As of December 31, 2019, it had a total of 3,541 net producing wells. The company was formerly known as Berry Petroleum Corporation and changed its name to Berry Corporation in February 2020. Berry Corporation was founded in 1909 and is headquartered in Dallas, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Dallas"}, "BSM": {"short_name": "Black Stone Minerals, L.P.", "long_name": "Black Stone Minerals, L.P.", "summary": "Black Stone Minerals, L.P. owns and manages oil and natural gas mineral interests. The company owns mineral interests in approximately 16.8 million gross acres, nonparticipating royalty interests in 1.8 million gross acres, and overriding royalty interests in 1.7 million gross acres located in 41 states in the United States. As of December 31, 2019, the company had a total estimated proved oil and natural gas reserves of 68,543 barrels of oil equivalent. Black Stone Minerals, L.P. was founded in 1876 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Houston"}, "BWPC": {"short_name": "BLUE WATER PETROLEUM CORP", "long_name": "Blue Water Petroleum Corp.", "summary": "Blue Water Petroleum Corp., an exploration stage company, focuses on the acquisition, exploration, and development of oil and natural gas properties in the United States. It holds interests in the blue water project covering an area of 12,979 gross acres in Big Horn County, Montana. The company was formerly known as Degaro Innovations Corp. and changed its name to Blue Water Petroleum Corp. in July 2013. Blue Water Petroleum Corp. was founded in 2009 and is based in Cheyennec, Wyoming.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Cheyenne"}, "CANX": {"short_name": "CANNAWAKE CORPORATION", "long_name": "CannAwake Corporation", "summary": "CannAwake Corporation engages in the real estate development business in the western United States. CannAwake Corporation is based in Nipton, California.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Nipton"}, "CDEV": {"short_name": "Centennial Resource Development", "long_name": "Centennial Resource Development, Inc.", "summary": "Centennial Resource Development, Inc., an independent oil and natural gas company, focuses on the development of unconventional oil and associated liquids-rich natural gas reserves in the United States. The company's assets primarily focus on the Delaware Basin, a sub-basin of the Permian Basin. Its properties consist of acreage blocks primarily in Reeves County in West Texas and Lea County in New Mexico. As of December 31, 2019, it leased or acquired approximately 78,195 net acres; and owned 1,569 net mineral acres in the Delaware Basin. The company was formerly known as Silver Run Acquisition Corporation and changed its name to Centennial Resource Development, Inc. in October 2016. Centennial Resource Development, Inc. was incorporated in 2015 and is headquartered in Denver, Colorado.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Denver"}, "CDEV.MX": {"short_name": "CENTENNIAL RESOURCE DEVELOPMENT", "long_name": "Centennial Resource Development, Inc.", "summary": "Centennial Resource Development, Inc., an independent oil and natural gas company, focuses on the development of unconventional oil and associated liquids-rich natural gas reserves in the United States. The company's assets primarily focus on the Delaware Basin, a sub-basin of the Permian Basin. Its properties consist of acreage blocks primarily in Reeves County in West Texas and Lea County in New Mexico. As of December 31, 2019, it leased or acquired approximately 78,195 net acres; and owned 1,569 net mineral acres in the Delaware Basin. The company was formerly known as Silver Run Acquisition Corporation and changed its name to Centennial Resource Development, Inc. in October 2016. Centennial Resource Development, Inc. was incorporated in 2015 and is headquartered in Denver, Colorado.", "currency": "MXN", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Denver"}, "CDID": {"short_name": "QUAD ENERGY CORP", "long_name": "Quad Energy Corp.", "summary": "Quad Energy Corporation engages in the exploration, development, and production of oil and gas properties in the United States and Canada. The company was formerly known as Codido, Inc. and changed its name to Quad Energy Corporation in September 2010. Quad Energy Corporation was incorporated in 2004 and is headquartered in Orlando, Florida.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Orlando"}, "CE51.F": {"short_name": "CALLON PETROLEUM (DEL.)", "long_name": "Callon Petroleum Company", "summary": "Callon Petroleum Company, an independent oil and natural gas company, focuses on the acquisition, exploration, and development of oil and natural gas properties in Permian Basin in West Texas. As of December 31, 2019, its estimated net proved reserves totaled approximately 540 million barrel of oil equivalent, including 346.4 MMBbls oil, 757.1 Bcf of natural gas, and 67.5 MMBbls of natural gas liquids. The company was founded in 1950 and is headquartered in Houston, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Houston"}, "CEI": {"short_name": "Camber Energy, Inc.", "long_name": "Camber Energy, Inc.", "summary": "Camber Energy, Inc., an independent oil and natural gas company, engages in the acquisition, development, and sale of crude oil, natural gas, and natural gas liquids (NGL) in the Cline shale and upper Wolfberry shale in Glasscock County, Texas. As of March 31, 2020, its total estimated proved reserves were 133,442 million barrels of oil equivalent comprising 54,850 barrels of crude oil reserves, 43,955 barrels of NGL reserves, and 207,823 million cubic feet of natural gas reserves. The company was formerly known as Lucas Energy Inc. and changed its name to Camber Energy, Inc. in January 2017. Camber Energy, Inc. was incorporated in 2003 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Houston"}, "CETG": {"short_name": "CAPITAL CITY ENERGY GROUP INC", "long_name": "Capital City Energy Group, Inc.", "summary": "Capital City Energy Group, Inc., through its subsidiaries, operates in the upstream oil and gas exploration and production industry in the United States. The company owns interests in approximately 80 energy properties located in 12 various states. As of December 31, 2014, its net oil and gas production included 7,370 barrels of oil and 17,727 thousand cubic feet of natural gas. The company was founded in 2003 and is headquartered in Columbus, Ohio.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Columbus"}, "CGRA": {"short_name": "CGROWTH CAPITAL INC", "long_name": "CGrowth Capital, Inc.", "summary": "CGrowth Capital, Inc. operates as a holding company for businesses and assets focusing on mining, minerals, and exploration activities in the United States. The company provides capital, processing applications, and various services for land owners specific to the oil and gas exploration, as well as mining and metal processing. It also provides a range of services and solutions that are designed to assist land owners with monetizing undervalued assets by bringing commodities, such as gold and silver to market, as well as purchases secondary claims and assets in various locations for providing ore processing, drilling, and exploration support. The company was formerly known as Anchor Pacific Underwriters Inc. and changed its name to CGrowth Capital, Inc. in February 2010. CGrowth Capital, Inc. was founded in 1986 and is based in Silverdale, Washington.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Silverdale"}, "CHKR": {"short_name": "CHESAPEAKE GRANITE WASH TR", "long_name": "Chesapeake Granite Wash Trust", "summary": "Chesapeake Granite Wash Trust owns royalty interests in oil, natural gas liquids, and natural gas properties located in the Colony Granite Wash play in Washita County in the Anadarko Basin of Western Oklahoma. The company has royalty interests in 69 producing wells and 118 development wells, and in approximately 26,400 net acres of area. As of December 31, 2019, its reserve estimates for the royalty interests included 4,175 thousand barrels of oil equivalent of proved developed reserves. Chesapeake Granite Wash Trust was founded in 2011 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "CKX": {"short_name": "CKX Lands, Inc.", "long_name": "CKX Lands, Inc.", "summary": "CKX Lands, Inc. engages in the ownership and management of land in the United States. It operates through three segments: Oil and Gas, Surface, and Timber. The company leases its properties for minerals, such as oil and gas; raising and harvesting timber; and surface uses comprising agriculture, right of ways, and hunting. It owns approximately 13,972 net acres of land consisting of 10,522 net acres of timber lands; 2,361 net acres of agriculture lands; and 895 net acres of marsh lands, as well as 194 net acres of land that is located in metropolitan areas. The company was formerly known as Calcasieu Real Estate & Oil Co., Inc. and changed its name to CKX Lands, Inc. in May 2005. CKX Lands, Inc. was founded in 1930 and is based in Lake Charles, Louisiana.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Lake Charles"}, "CLMT": {"short_name": "Calumet Specialty Products Part", "long_name": "Calumet Specialty Products Partners, L.P.", "summary": "Calumet Specialty Products Partners, L.P. produces and sells specialty hydrocarbon products in North America and internationally. Its Specialty Products segment offers various lubricating oils, white mineral oils, solvents, petrolatums, waxes, synthetic lubricants, and other products, which are used primarily as raw material components for basic industrial, consumer, and automotive goods. The company's Fuel Products segment provides fuel and fuel-related products, including gasoline, diesel, jet fuel, asphalt, and heavy fuel oils, as well as resells purchased crude oil to third party customers. Calumet GP, LLC serves as the general partner for Calumet Specialty Products Partners, L.P. The company was founded in 1916 and is headquartered in Indianapolis, Indiana.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Indianapolis"}, "CLR": {"short_name": "Continental Resources, Inc.", "long_name": "Continental Resources, Inc.", "summary": "Continental Resources, Inc. explores for, develops, and produces crude oil and natural gas properties primarily in the north, south, and east regions of the United States. The company sells its crude oil and natural gas production to energy marketing companies, crude oil refining companies, and natural gas gathering and processing companies. As of December 31, 2019, its proved reserves were 1,619 million barrels of crude oil equivalent (MMBoe) with estimated proved developed reserves of 707 MMBoe. Continental Resources, Inc. was founded in 1967 and is based in Oklahoma City, Oklahoma.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Oklahoma City"}, "CNX": {"short_name": "CNX Resources Corporation", "long_name": "CNX Resources Corporation", "summary": "CNX Resources Corporation, an independent oil and gas company, explores for, develops, and produces natural gas properties primarily in the Appalachian Basin. The company operates through two divisions, Exploration and Production (E&P), and Midstream. The E&P division produces pipeline quality natural gas primarily to gas wholesalers. This division owns rights to extract natural gas in Pennsylvania, West Virginia, and Ohio from approximately 519,000 net Marcellus Shale acres; and 608,000 net acres of Utica Shale, as well as rights to extract natural gas from other shale and shallow oil and gas positions from approximately 981,700 in Illinois, Indiana, New York, Ohio, Pennsylvania, Virginia, and West Virginia. It also owns rights to extract coalbed methane (CBM) in Virginia from approximately 308,000 net CBM acres, as well as 2,122,000 net CBM acres in West Virginia, Pennsylvania, Ohio, Illinois, Indiana, and New Mexico. The Midstream division owns, operates, and develops natural gas gathering and other midstream energy assets in the Marcellus Shale and Utica Shale in Pennsylvania and West Virginia. The company also offers gas gathering and water delivery solutions to third-parties. The company was formerly known as CONSOL Energy Inc. and changed its name to CNX Resources Corporation in November 2017. CNX Resources Corporation was founded in 1860 and is headquartered in Canonsburg, Pennsylvania.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Canonsburg"}, "COG": {"short_name": "Cabot Oil & Gas Corporation", "long_name": "Cabot Oil & Gas Corporation", "summary": "Cabot Oil & Gas Corporation, an independent oil and gas company, explores for, exploits, develops, produces, and markets oil and gas properties in the United States. It primarily focuses on the Marcellus Shale with approximately 173,000 net acres in the dry gas window of the play located in Susquehanna County, Pennsylvania. The company sells its natural gas to industrial customers, local distribution companies, gas marketers, and power generation facilities through gathering systems and pipelines. As of December 31, 2019, it had proved reserves of approximately 12,903 billion cubic feet of gas; and 22 thousand barrels of oil or other liquid hydrocarbons. Cabot Oil & Gas Corporation was incorporated in 1989 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Houston"}, "COIL": {"short_name": "CITADEL EXPLORATION INC", "long_name": "Citadel Exploration, Inc.", "summary": "Citadel Exploration, Inc., an energy company, engages in the exploration and development of oil and natural gas properties in the San Joaquin Basin of California. It holds a 100% working interest in the Kern Bluff Oil Field covering an area of approximately 1,100 acres in Kern County, California. The company was founded in 2006 and is based in Newport Beach, California.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Newport Beach"}, "COP": {"short_name": "ConocoPhillips", "long_name": "ConocoPhillips", "summary": "ConocoPhillips explores for, produces, transports, and markets crude oil, bitumen, natural gas, liquefied natural gas (LNG), and natural gas liquids worldwide. The company primarily engages in the conventional and tight oil reservoirs, shale gas, heavy oil, LNG, oil sands, and other production operations. Its portfolio includes unconventional plays in North America; conventional assets in North America, Europe, Asia, and Australia; various LNG developments; oil sands assets in Canada; and an inventory of conventional and unconventional exploration prospects. The company was founded in 1917 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Houston"}, "COPH.VI": {"short_name": "CONOCOPHILLIPS", "long_name": "ConocoPhillips", "summary": "ConocoPhillips explores for, produces, transports, and markets crude oil, bitumen, natural gas, liquefied natural gas (LNG), and natural gas liquids worldwide. The company primarily engages in the conventional and tight oil reservoirs, shale gas, heavy oil, LNG, oil sands, and other production operations. Its portfolio includes unconventional plays in North America; conventional assets in North America, Europe, Asia, and Australia; various LNG developments; oil sands assets in Canada; and an inventory of conventional and unconventional exploration prospects. The company was founded in 1917 and is headquartered in Houston, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "VIE", "market": "at_market", "country": "United States", "city": "Houston"}, "COPH34.SA": {"short_name": "COPHILLIPS  DRN", "long_name": "ConocoPhillips", "summary": "ConocoPhillips explores for, produces, transports, and markets crude oil, bitumen, natural gas, liquefied natural gas (LNG), and natural gas liquids worldwide. The company primarily engages in the conventional and tight oil reservoirs, shale gas, heavy oil, LNG, oil sands, and other production operations. Its portfolio includes unconventional plays in North America; conventional assets in North America, Europe, Asia, and Australia; various LNG developments; oil sands assets in Canada; and an inventory of conventional and unconventional exploration prospects. The company was founded in 1917 and is headquartered in Houston, Texas.", "currency": "BRL", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "SAO", "market": "br_market", "country": "United States", "city": "Houston"}, "CPE": {"short_name": "Callon Petroleum Company", "long_name": "Callon Petroleum Company", "summary": "Callon Petroleum Company, an independent oil and natural gas company, focuses on the acquisition, exploration, and development of oil and natural gas properties in Permian Basin in West Texas. As of December 31, 2019, its estimated net proved reserves totaled approximately 540 million barrel of oil equivalent, including 346.4 MMBbls oil, 757.1 Bcf of natural gas, and 67.5 MMBbls of natural gas liquids. The company was founded in 1950 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Houston"}, "CPE.MX": {"short_name": "CALLON PETROLEUM CO", "long_name": "Callon Petroleum Company", "summary": "Callon Petroleum Company, an independent oil and natural gas company, focuses on the acquisition, exploration, and development of oil and natural gas properties in Permian Basin in West Texas. As of December 31, 2019, its estimated net proved reserves totaled approximately 540 million barrel of oil equivalent, including 346.4 MMBbls oil, 757.1 Bcf of natural gas, and 67.5 MMBbls of natural gas liquids. The company was founded in 1950 and is headquartered in Houston, Texas.", "currency": "MXN", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Houston"}, "CRBOD": {"short_name": "CARBON ENERGY CORPORATION", "long_name": "Carbon Energy Corporation", "summary": "Carbon Energy Corporation, an independent oil and natural gas company, engages in the acquisition, exploration, development, and production of oil, natural gas, and natural gas liquids properties in the United States. It focuses on conventional and unconventional reservoirs, including shale, tight sand, and coalbed methane located in the Appalachian, Illinois, and Ventura Basins. As of December 31, 2018, it owned working interests in 7,100 net wells and royalty interests in approximately 900 wells located in California, Illinois, Indiana, Kentucky, Ohio, Tennessee, Virginia, and West Virginia, as well as had leasehold positions in approximately 340,700 net developed acres and approximately 1,319,200 net undeveloped acres. The company was formerly known as Carbon Natural Gas Company and changed its name to Carbon Energy Corporation in June 2018. Carbon Energy Corporation was founded in 2007 and is based in Denver, Colorado.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Denver"}, "CRC": {"short_name": "California Resources Corporatio", "long_name": "California Resources Corporation", "summary": "California Resources Corporation operates as an independent oil and natural gas exploration and production company in the State of California. The company sells crude oil, natural gas, and natural gas liquids to marketers, California refineries, and other purchasers that have access to transportation and storage facilities. It holds interests in approximately 2.1 million net acres of mineral acreage. As of December 31, 2019, the company had net proved reserves of 644 million barrels of oil equivalent. It also engages in the generation and sale of electricity to the local utility, other third parties, and the grid. The company was founded in 2014 and is based in Santa Clarita, California.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Santa Clarita"}, "CRK": {"short_name": "Comstock Resources, Inc.", "long_name": "Comstock Resources, Inc.", "summary": "Comstock Resources, Inc., an independent energy company, engage in the acquisition, exploration for, development, and production of oil and natural gas properties, primarily in Texas, Louisiana, and North Dakota. As of December 31, 2019, the company had 5.3 trillion cubic feet of natural gas equivalent and 16.7 million barrels of oil equivalent of proved reserves. It also owns an interest in 2,800 producing oil and natural gas wells. The company was founded in 1983 and is headquartered in Frisco, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Frisco"}, "CRT": {"short_name": "Cross Timbers Royalty Trust", "long_name": "Cross Timbers Royalty Trust", "summary": "Cross Timbers Royalty Trust operates as an express trust in the United States. It holds 90% net profits interests in certain producing and nonproducing royalty and overriding royalty interest properties in Texas, Oklahoma, and New Mexico; and 75% net profits working interest in four properties in Texas and three properties in Oklahoma. The company was founded in 1991 and is based in Dallas, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Dallas"}, "CXO.MX": {"short_name": "CONCHO RESOURCES INC", "long_name": "Concho Resources Inc.", "summary": "As of January 15, 2021, Concho Resources Inc. was acquired by ConocoPhillips. Concho Resources Inc., an independent oil and natural gas company, engages in the acquisition, development, and exploration of oil and natural gas properties in the United States. The company's principal operating areas are located in the Permian Basin of West Texas and southeast New Mexico. As of December 31, 2019, its estimated proved reserves totaled 1.0 billion barrels of oil equivalent. The company was founded in 2006 and is headquartered in Midland, Texas.", "currency": "MXN", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Midland"}, "CYNS": {"short_name": "CYGNUS OIL AND GAS", "long_name": "Cygnus Oil & Gas Corp.", "summary": "Cygnus Oil and Gas Corporation, a development stage energy company, engages in the exploration, development and production of oil and gas in the United States and New Zealand. It has interests in 13 oil and gas projects. The company, formerly known as Touchstone Resources USA, Inc., was founded in 2001 and is based in Houston, Texas. On April 3, 2007, Cygnus Oil & Gas Corp filed a voluntary petition for reorganization under Chapter 11 in the US Bankruptcy Court for the Southern District of Texas, Houston. The plan was later approved as Chapter 11 liquidation on September 19, 2007.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "D1VN34.SA": {"short_name": "DEVON ENERGYDRN", "long_name": "Devon Energy Corporation", "summary": "Devon Energy Corporation, an independent energy company, primarily engages in the exploration, development, and production of oil, natural gas, and natural gas liquids in the United States. It operates approximately 3,955 gross wells. The company was founded in 1971 and is headquartered in Oklahoma City, Oklahoma.", "currency": "BRL", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "SAO", "market": "br_market", "country": "United States", "city": "Oklahoma City"}, "DBRM": {"short_name": "DAYBREAK OIL & GAS INC", "long_name": "Daybreak Oil and Gas, Inc.", "summary": "Daybreak Oil and Gas, Inc. operates as an independent crude oil and natural gas exploration, development, and production company in the United States. It holds interest in the East Slopes project located in the southeastern part of the San Joaquin Basin near Bakersfield, California. The company also holds 70% working interest in the Michigan Basin project covering 1,400 acres area. As of February 28, 2020, it had estimated proved reserves of 495,977 barrels of oil equivalent. The company was formerly known as Daybreak Mines, Inc. and changed its name to Daybreak Oil and Gas, Inc. in October 2005. Daybreak Oil and Gas, Inc. was founded in 1955 and is headquartered in Spokane Valley, Washington.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Spokane Valley"}, "DDRIQ": {"short_name": "DIVERSIFIED RESOURCES INC NEV", "long_name": "Diversified Resources Inc.", "summary": "Diversified Resources Inc. operates as an oil and gas exploration company in the United States. The company holds 100% interests in the Gracia Field that covers 4,600 acres of oil and gas leases located in Las Anima County; and oil and gas leases covering 920 acres in Denver/Julesburg basin. It also owns interests in the HorseshoeÂ\u0096Gallup field, which covers 10,100 acres of oil and gas leases, and 48 producing wells located in San Juan County, New Mexico. The company is based in Littleton, Colorado. On September 5, 2019, the voluntary petition of Diversified Resources Inc. for reorganization under Chapter 11 was converted to Chapter 7. It had filed for Chapter 11 bankruptcy on April 30, 2019.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Littleton"}, "DEN": {"short_name": "Denbury Inc.", "long_name": "Denbury Inc.", "summary": "Denbury Resources Inc. operates as an independent oil and natural gas company in the United States. It holds interests in various oil and natural gas properties located in Mississippi, Texas, and Louisiana in the Gulf Coast region; and in Montana, North Dakota, and Wyoming in the Rocky Mountain region. As of December 31, 2019, the company had 230.2 million barrels of oil equivalent of estimated proved oil and natural gas reserves. Denbury Resources Inc. was incorporated in 2003 and is headquartered in Plano, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Plano"}, "DENR": {"short_name": "DISCOVERY ENERGY CORP", "long_name": "Discovery Energy Corp.", "summary": "Discovery Energy Corp., an exploration stage company, engages in the exploration and development of oil and gas properties. It holds a 100% working interest in the petroleum exploration license 512 prospect covering an area of 584,651 gross acres located in South Australia. The company was formerly known as Santos Resource Corp. and changed its name to Discovery Energy Corp. in May 2012. Discovery Energy Corp. was founded in 2006 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "DGOC.L": {"short_name": "DIVERSIFIED GAS & OIL PLC ORD 1", "long_name": "Diversified Gas & Oil PLC", "summary": "Diversified Gas & Oil PLC operates as an independent owner and operator of producing natural gas and oil wells primarily in the Appalachian Basin of the United States. The company produces natural gas, natural gas liquids, and crude oil. It holds interests in approximately 8 million acres located in Tennessee, Kentucky, Virginia, West Virginia, Ohio, and Pennsylvania. The company was founded in 2001 and is headquartered in Birmingham, Alabama.", "currency": "GBp", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "LSE", "market": "gb_market", "country": "United States", "city": "Birmingham"}, "DGOCF": {"short_name": "DIVERSIFIED GAS & OIL PLC", "long_name": "Diversified Gas & Oil PLC", "summary": "Diversified Gas & Oil PLC operates as an independent owner and operator of producing natural gas and oil wells primarily in the Appalachian Basin of the United States. The company produces natural gas, natural gas liquids, and crude oil. It holds interests in approximately 8 million acres located in Tennessee, Kentucky, Virginia, West Virginia, Ohio, and Pennsylvania. The company was founded in 2001 and is headquartered in Birmingham, Alabama.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Birmingham"}, "DMLP": {"short_name": "Dorchester Minerals, L.P.", "long_name": "Dorchester Minerals, L.P.", "summary": "Dorchester Minerals, L.P. engages in the acquisition, ownership, and administration of producing and nonproducing natural gas and crude oil royalty, net profits, and leasehold interests in the United States. Its royalty properties consist of producing and nonproducing mineral, royalty, overriding royalty, net profits, and leasehold interests located in 592 counties and parishes in 27 states; and net profits interests represent net profits overriding royalty interests in various properties owned by the operating partnership. Dorchester Minerals Management LP serves as the general partner of Dorchester Minerals, L.P. The company was founded in 2003 and is based in Dallas, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Dallas"}, "DVN": {"short_name": "Devon Energy Corporation", "long_name": "Devon Energy Corporation", "summary": "Devon Energy Corporation, an independent energy company, primarily engages in the exploration, development, and production of oil, natural gas, and natural gas liquids in the United States. It operates approximately 3,955 gross wells. The company was founded in 1971 and is headquartered in Oklahoma City, Oklahoma.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Oklahoma City"}, "DVN.MX": {"short_name": "DEVON ENERGY CORP", "long_name": "Devon Energy Corporation", "summary": "Devon Energy Corporation, an independent energy company, primarily engages in the exploration, development, and production of oil, natural gas, and natural gas liquids in the United States. It operates approximately 3,955 gross wells. The company was founded in 1971 and is headquartered in Oklahoma City, Oklahoma.", "currency": "MXN", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Oklahoma City"}, "DYRFF": {"short_name": "DUNES EXPLORATION LTD", "long_name": "Dunes Exploration Ltd.", "summary": "Dunes Exploration Ltd. engages in the exploration and development of oil and gas properties in the United States. The company holds an option interest in Good Hope claims consisting of 97 mineral claims situated in Elko County, Nevada. It also has interest in Sentell Field covering an area of approximately 5,400 acres in Bossier and Caddo County, Louisiana. The company was formerly known as Dynamic Resources Corp. and changed its name to Dunes Exploration Ltd. in January 2011. Dunes Exploration Ltd. was incorporated in 1993 and is based in Las Vegas, Nevada.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Las Vegas"}, "E1OG34.SA": {"short_name": "EOG RESOURCEDRN", "long_name": "EOG Resources, Inc.", "summary": "EOG Resources, Inc., together with its subsidiaries, explores for, develops, produces, and markets crude oil, and natural gas and natural gas liquids. The company's principal producing areas are located in New Mexico, North Dakota, Texas, and Wyoming in the United States; and the Republic of Trinidad and Tobago, the People's Republic of China, and Canada. As of December 31, 2019, it had total estimated net proved reserves of 3,329 million barrels of oil equivalent, including 1,694 million barrels (MMBbl) crude oil and condensate reserves; 740 MMBbl of natural gas liquid reserves; and 5,370 billion cubic feet of natural gas reserves. The company was formerly known as Enron Oil & Gas Company. EOG Resources, Inc. was founded in 1985 and is headquartered in Houston, Texas.", "currency": "BRL", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "SAO", "market": "br_market", "country": "United States", "city": "Houston"}, "E8U.SG": {"short_name": "Enxnet Inc. Registered Shares D", "long_name": "EnXnet, Inc.", "summary": "EnXnet, Inc. engages in the exploitation, development, and production of natural gas and petroleum properties. As of March 31, 2019, it had unproved oil and gas properties covering an area of approximately 22,507 acres primarily in the Rocky Mountain region, Colorado. The company was founded in 1999 and is based in Tulsa, Oklahoma.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "STU", "market": "dr_market", "country": "United States", "city": "Tulsa"}, "ECCE": {"short_name": "EAGLE FORD OIL & GAS CORP", "long_name": "Eagle Ford Oil & Gas Corp.", "summary": "Eagle Ford Oil & Gas Corp., an independent oil and gas company, is engaged in the exploration, development, and production of oil and gas properties in the Texas and Louisiana-Gulf Coast Region. It has interests in various wells, including Vick 2 and Alexander 1 wells in Lee County, Texas; and East Pearsall well in Frio County, Texas. The company has a gas pipeline of approximately 13 miles in Jefferson and Harrison Counties, Ohio. Eagle Ford Oil & Gas Corp. is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "EFIR": {"short_name": "EGPI FIRECREEK INC", "long_name": "EGPI Firecreek, Inc.", "summary": "EGPI Firecreek, Inc., an independent oil and gas company, engages in the exploration, development, and exploitation of crude oil and natural gas properties primarily in the United States. The company focuses on the oil and gas projects located in the Permian Basin areas of Texas, and surrounding states and regions in the United States for activities related to oil and gas production, and related business and other opportunities. It holds 50% working interests and corresponding 32% net revenue interests in oil and gas leases and reserves located in Callahan, Stephens, and Shakelford counties in west central Texas; and 75% working interests in the J.B. Tubb Leasehold Estate/Amoco Crawar field located in the Ward County in Texas. The company also offers oilfield services for drill site preparation to clear and lay pipelines for operators; and services to maintain lease roads, set power poles, and clean up oilfield spills. In addition, it engages in the sale, design/build, integration, and installation of thermal solar systems for residential and commercial sites. The company was formerly known as Energy Producers Inc. and changed its name to EGPI Firecreek, Inc. in October 2004. The company is based in Paradise Valley, Arizona.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Paradise Valley"}, "EGY": {"short_name": "VAALCO Energy, Inc.", "long_name": "VAALCO Energy, Inc.", "summary": "VAALCO Energy, Inc., an independent energy company, acquires, explores for, develops, and produces crude oil and natural gas. The company holds Etame production sharing contract related to the Etame Marin block located offshore in the Republic of Gabon, West Africa. It also owns interests in an undeveloped block offshore Equatorial Guinea, West Africa. VAALCO Energy, Inc. was founded in 1985 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Houston"}, "EGY.L": {"short_name": "VAALCO ENERGY, INC. COMMON SHS ", "long_name": "VAALCO Energy, Inc.", "summary": "VAALCO Energy, Inc., an independent energy company, acquires, explores for, develops, and produces crude oil and natural gas. The company holds Etame production sharing contract related to the Etame Marin block located offshore in the Republic of Gabon, West Africa. It also owns interests in an undeveloped block offshore Equatorial Guinea, West Africa. VAALCO Energy, Inc. was founded in 1985 and is headquartered in Houston, Texas.", "currency": "GBp", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "LSE", "market": "gb_market", "country": "United States", "city": "Houston"}, "EMPR": {"short_name": "EMPIRE PETROLEUM CORPORATION", "long_name": "Empire Petroleum Corporation", "summary": "Empire Petroleum Corporation engages in the exploration and development of oil and gas properties in Louisiana, North Dakota, and Montana, the United States. The company was formerly known as Americomm Resources Corporation and changed its name to Empire Petroleum Corporation in August 2001. Empire Petroleum Corporation was founded in 1983 and is based in Tulsa, Oklahoma.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Tulsa"}, "ENY.F": {"short_name": "CIMAREX ENERGY  DL-,01", "long_name": "Cimarex Energy Co.", "summary": "Cimarex Energy Co. operates as an independent oil and gas exploration and production company primarily in Texas, Oklahoma, and New Mexico. As of December 31, 2019, it had a total proved reserves of 619.6 million barrels of oil equivalent, consisting of 1.53 trillion cubic feet of natural gas; 169.8 million barrels (MMBbls) of oil; and 194.5 MMBbls of natural gas liquids primarily located in the Permian Basin and Mid-Continent regions. The company also owned interests in 2,782 net productive oil and gas wells. Cimarex Energy Co. was founded in 2002 and is headquartered in Denver, Colorado.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Denver"}, "EO5.F": {"short_name": "EOG RESOURCES  DL-,01", "long_name": "EOG Resources, Inc.", "summary": "EOG Resources, Inc., together with its subsidiaries, explores for, develops, produces, and markets crude oil, and natural gas and natural gas liquids. The company's principal producing areas are located in New Mexico, North Dakota, Texas, and Wyoming in the United States; and the Republic of Trinidad and Tobago, the People's Republic of China, and Canada. As of December 31, 2019, it had total estimated net proved reserves of 3,329 million barrels of oil equivalent, including 1,694 million barrels (MMBbl) crude oil and condensate reserves; 740 MMBbl of natural gas liquid reserves; and 5,370 billion cubic feet of natural gas reserves. The company was formerly known as Enron Oil & Gas Company. EOG Resources, Inc. was founded in 1985 and is headquartered in Houston, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Houston"}, "EOG": {"short_name": "EOG Resources, Inc.", "long_name": "EOG Resources, Inc.", "summary": "EOG Resources, Inc., together with its subsidiaries, explores for, develops, produces, and markets crude oil, and natural gas and natural gas liquids. The company's principal producing areas are located in New Mexico, North Dakota, Texas, and Wyoming in the United States; and the Republic of Trinidad and Tobago, the People's Republic of China, and Canada. As of December 31, 2019, it had total estimated net proved reserves of 3,329 million barrels of oil equivalent, including 1,694 million barrels (MMBbl) crude oil and condensate reserves; 740 MMBbl of natural gas liquid reserves; and 5,370 billion cubic feet of natural gas reserves. The company was formerly known as Enron Oil & Gas Company. EOG Resources, Inc. was founded in 1985 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Houston"}, "EOGR.VI": {"short_name": "EOG RESOURCES INC", "long_name": "EOG Resources, Inc.", "summary": "EOG Resources, Inc., together with its subsidiaries, explores for, develops, produces, and markets crude oil, and natural gas and natural gas liquids. The company's principal producing areas are located in New Mexico, North Dakota, Texas, and Wyoming in the United States; and the Republic of Trinidad and Tobago, the People's Republic of China, and Canada. As of December 31, 2019, it had total estimated net proved reserves of 3,329 million barrels of oil equivalent, including 1,694 million barrels (MMBbl) crude oil and condensate reserves; 740 MMBbl of natural gas liquid reserves; and 5,370 billion cubic feet of natural gas reserves. The company was formerly known as Enron Oil & Gas Company. EOG Resources, Inc. was founded in 1985 and is headquartered in Houston, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "VIE", "market": "at_market", "country": "United States", "city": "Houston"}, "EPM": {"short_name": "Evolution Petroleum Corporation", "long_name": "Evolution Petroleum Corporation", "summary": "Evolution Petroleum Corporation, an oil and gas company, engages in the development, production, ownership, and management of oil and gas properties in the United States. The company primarily holds interests in a CO2 enhanced oil recovery project in Louisiana's Delhi field. Its Delhi Holt-Bryant Unit covers an area of 13,636 acres located in Northeast Louisiana. The company was founded in 2003 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Houston"}, "EPSN": {"short_name": "Epsilon Energy Ltd.", "long_name": "Epsilon Energy Ltd.", "summary": "Epsilon Energy Ltd., natural gas and oil company, engages in the acquisition, development, gathering, and production of oil and gas reserves in the United States. It operates through Upstream and Gathering System segments. The company primarily focuses on the Marcellus Shale comprising 4,130 net acres located in the Susquehanna County, Pennsylvania; and Anadarko basin comprising 8,594 net acres located in the Oklahoma. As of December 31, 2019, it had total estimated net proved reserves of 124,161 million cubic feet of natural gas reserves and 116,053 barrels of oil and other liquids. Epsilon Energy Ltd. was founded in 2005 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NGM", "market": "us_market", "country": "United States", "city": "Houston"}, "EQT": {"short_name": "EQT Corporation", "long_name": "EQT Corporation", "summary": "EQT Corporation operates as a natural gas production company in the United States. The company produces natural gas, natural gas liquids (NGLs), and crude oil. As of December 31, 2019, it had 17.5 trillion cubic feet of proved natural gas, NGLs, and crude oil reserves across approximately 1.3 million gross acres. The company was founded in 1925 and is headquartered in Pittsburgh, Pennsylvania.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Pittsburgh"}, "ERAO": {"short_name": "ENERGY REVENUE AMERICA INC", "long_name": "Energy Revenue America, Inc.", "summary": "Energy Revenue America, Inc. engages in the exploration, development, production, and marketing of natural gas. The company primarily focuses on coal bed methane unconventional natural gas projects. It transports and sells natural gas through a 65 mile pipeline with approximately 3,000 acres in the Cherokee basin and 3 compressors in Nowata County, Oklahoma. The company was formerly known as NavStar Technologies, Inc. and changed its name to Energy Revenue America, Inc. in August 2012. Energy Revenue America, Inc. was founded in 2010 and is headquartered in Dallas, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Dallas"}, "ERHE": {"short_name": "ERHC ENERGY INC", "long_name": "ERHC Energy Inc.", "summary": "ERHC Energy Inc. engages in the exploration and exploitation of oil and gas resources in Africa. Its principal assets include the rights to working interests in exploration acreage in the Republic of Kenya; the Republic of Chad; the Joint Development Zone between the Democratic Republic of Sao Tome and Principe; the Federal Republic of Nigeria; and the economic zone of Sao Tome. The company was founded in 1986 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "ERINQ": {"short_name": "ERIN ENERGY CORP", "long_name": "Erin Energy Corporation", "summary": "Erin Energy Corporation, an independent exploration and production company, engages in the acquisition and development of energy resources in Africa. Its asset portfolio consists of five licenses covering an area of approximately 6,000 square kilometers across offshore Nigeria, offshore Ghana, and offshore The Gambia. The company was formerly known as CAMAC Energy Inc. and changed its name to Erin Energy Corporation in April 2015. The company was founded in 2005 and is headquartered in Houston, Texas. Erin Energy Corporation is a subsidiary of CAMAC Energy Holdings Limited. On July 13, 2018, the voluntary petition of Erin Energy Corporation for reorganization under Chapter 11 was converted to Chapter 7. It had filed for Chapter 11 bankruptcy on April 25, 2018.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "ESSE": {"short_name": "EARTH SEARCH SCIENCES INC", "long_name": "Earth Search Sciences, Inc.", "summary": "Earth Search Sciences, Inc., through its subsidiary, General Synfuels International, Inc., focuses on the development of technology for the extraction of oil and gas from oil shale. The company is headquartered in Lakeside, Montana.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Lakeside"}, "ESTE": {"short_name": "Earthstone Energy, Inc.", "long_name": "Earthstone Energy, Inc.", "summary": "Earthstone Energy, Inc., an independent energy company, engages in the acquisition, exploration, development, and production of oil and natural gas properties in the United States. Its asset portfolio includes the Midland Basin of west Texas and the Eagle Ford trend of south Texas. As of December 31, 2019, the company operated 103 gross Eagle Ford wells; and 13 gross Austin Chalk wells, as well as had 94,336 thousand barrels of oil equivalent (MBOE) of total proved reserves comprised 31,521 MBOE of proved developed reserves and 62,815 MBOE of proved undeveloped reserves. Earthstone Energy, Inc. was founded in 1969 and is headquartered in The Woodlands, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "The Woodlands"}, "EXCE": {"short_name": "EXCO RESOURCES INC", "long_name": "EXCO Resources, Inc.", "summary": "EXCO Resources, Inc., an independent oil and natural gas company, engages in the acquisition, exploration, exploitation, development, and production of onshore oil and natural gas properties with a focus on shale resource plays in the United States. The company holds interests in approximately 96,600 net acres located in the Haynesville and Bossier shales of East Texas and North Louisiana; approximately 48,500 net acres located in the Eagle Ford shale of South Texas; and approximately 234,800 net acres of prospective area located in the Marcellus shale, as well as approximately 69,000 net acres of prospective area located in the Utica shale of the Appalachia region. As of December 31, 2018, it had proved reserves of approximately 660.6 billion cubic feet equivalent of oil and natural gas. The company was founded in 1955 and is based in Dallas, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Dallas"}, "EXNT": {"short_name": "ENXNET INC", "long_name": "EnXnet, Inc.", "summary": "EnXnet, Inc. engages in the exploitation, development, and production of natural gas and petroleum properties. As of March 31, 2019, it had unproved oil and gas properties covering an area of approximately 22,507 acres primarily in the Rocky Mountain region, Colorado. The company was founded in 1999 and is based in Tulsa, Oklahoma.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Tulsa"}, "FANG": {"short_name": "Diamondback Energy, Inc. - Comm", "long_name": "Diamondback Energy, Inc.", "summary": "Diamondback Energy, Inc., an independent oil and natural gas company, focuses on the acquisition, development, exploration, and exploitation of unconventional and onshore oil and natural gas reserves in the Permian Basin in West Texas. It primarily focuses on the development of the Spraberry and Wolfcamp formations of the Midland basin; and the Wolfcamp and Bone Spring formations of the Delaware basin, which are part of the Permian Basin in West Texas and New Mexico. As of December 31, 2019, the company's total acreage position was approximately 455,378 gross acres in the Permian Basin; and estimated proved oil and natural gas reserves were 1,127,575 thousand barrels of crude oil equivalent. It also held working interests in 2,656 gross producing wells, as well as royalty interests in 4,161 additional wells. In addition, the company owns mineral interests approximately 814,224 gross acres and 24,304 net royalty acres in the Permian Basin and Eagle Ford Shale; and owns, operates, develops, and acquires midstream infrastructure assets, such as 867 miles of crude oil gathering pipelines, natural gas gathering pipelines, and an integrated water system in the Midland and Delaware Basins of the Permian Basin. Diamondback Energy, Inc. was founded in 2007 and is headquartered in Midland, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Midland"}, "FDHC": {"short_name": "FIDELITY HOLDING CORP", "long_name": "Fidelity Holding Corp.", "summary": "Fidelity Holding Corp., a general holding company, focuses on opportunities in the oil and gas, and renewable energy sectors. The company, through its subsidiary, Rebel Resouces, Inc., engages in the production of heavy oil. It primarily focuses on proprietary thermal technology to extract additional heavy oil out of mature oil fields worldwide. The company was formerly known as Talisman Holdings, Inc. and changed its name to Fidelity Holding Corp. in August 2014. Fidelity Holding Corp. was founded in 1998 and is based in Rock Springs, Wyoming.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Rock Springs"}, "FLMN": {"short_name": "Falcon Minerals Corporation", "long_name": "Falcon Minerals Corporation", "summary": "Falcon Minerals Corporation acquires and owns mineral, royalty, and over-riding royalty interests in oil and natural gas properties in North America. It owns interests covering approximately 256,000 gross unit acres in the Eagle Ford Shale and Austin Chalk in Karnes, DeWitt, and Gonzales Counties in Texas, as well as approximately 75,000 gross unit acres in the Marcellus Shale across Pennsylvania, Ohio, and West Virginia. The company is based in New York, New York.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "New York"}, "FNRC": {"short_name": "1ST NRG CORP", "long_name": "1st NRG Corp.", "summary": "1st NRG Corp. explores, develops, produces, and sells natural gas properties in the United States. The company holds interests in the Clabaugh Ranch property comprising 42 producing wells, 1 permitted location, and 2,821 undeveloped acres located in the Powder River Basin in northeast Wyoming. It also holds interests in shale plays covering approximately 7,000 acres situated in Ohio. The company was founded in 1988 and is headquartered in Denver, Colorado.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Denver"}, "FPL.AX": {"short_name": "FREMONTPET FPO", "long_name": "Fremont Petroleum Corporation Ltd", "summary": "Fremont Petroleum Corporation Ltd engages in the exploration and development of oil and gas assets in the United States. It holds 100% interest in the Pathfinder project covering an area of 15,282 acres in DJ Basin in Colorado. The company was formerly known as Austin Exploration Limited and changed its name to Fremont Petroleum Corporation Ltd in June 2017. Fremont Petroleum Corporation Ltd was founded in 2006 and is headquartered in Florence, Colorado.", "currency": "AUD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "ASX", "market": "au_market", "country": "United States", "city": "Florence"}, "FPPP": {"short_name": "FIELDPOINT PETROLEUM CORP", "long_name": "FieldPoint Petroleum Corporation", "summary": "FieldPoint Petroleum Corporation engages in the acquisition, exploration, and production of oil and natural gas properties in the United States. Its principal properties include Block A-49, Spraberry Trend, and Serbin Field, Texas; Sulimar Field, New Mexico; West Allen Field, Oklahoma; and Longwood Field, Louisiana. The company is headquartered in Austin, Texas. On June 24, 2020, FieldPoint Petroleum Corporation filed a voluntary petition for Liquidation under Chapter 7 in the US Bankruptcy Court for the Western District of Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Austin"}, "FSEI": {"short_name": "FIRST SEISMIC CORP", "long_name": "First Seismic Corp.", "summary": "In May 2001, FIRST SEISMIC Corporation executed a letter of intent with Global Geo Services ASA, a Norwegian company (GGS), pursuant to which GGS proposed to acquire First Seismic. As of December 31, 1999, FIRST SEISMIC Corporation provided various geo-scientific and complementary services that were used to develop opportunities in the oil and gas business worldwide. It owned and brokered seismic data and a range of geo-scientific information primarily used by its customers in upstream oil and gas exploration and production efforts. The company used portions of this geological and seismic information to geo-technically identify and promote exploration projects to oil company investors. In addition, through its wholly owned subsidiary, the company also took an ownership position in some of the upstream oil and natural gas production opportunities. The company is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "FTXP": {"short_name": "FOOTHILLS EXPLORATION INC", "long_name": "Foothills Exploration, Inc.", "summary": "Foothills Exploration, Inc., an independent oil and gas exploration and production company, engages in the acquisition and development of oil and natural gas properties. Its primary focus is the U.S. Rocky Mountain region. The company holds approximately 34,000 acres in the Greater Green River and Wind River Basins of Wyoming and 7,800 acres in the Uinta Basin of Utah. Foothills Exploration, Inc. is based in Los Angeles, California.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Los Angeles"}, "FWDEQ": {"short_name": "FIELDWOOD ENERGY INC", "long_name": "Fieldwood Energy Inc", "summary": "On August 3, 2020, Fieldwood Energy Inc filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the Southern District of Texas. It is in joint administration with Fieldwood Energy LLC.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "GASE": {"short_name": "GASE ENERGY INC", "long_name": "GASE Energy, Inc.", "summary": "GASE Energy, Inc., an independent energy company, focuses on the exploration, development, and production of natural gas in Ukraine. The company has approximately 104,031 net acres for the exploration of natural gas properties in the Lisichansk-Toskovskay area located in the Dnieper-Donetsk Basin. As of December 31, 2013, it had estimated proved reserves of 713 million cubic meter of natural gas. The company operates two productive wells; owns two gas facilities; and owns 13.5 kilometers of gas pipelines. The company was formerly known as Great East Energy, Inc. and changed its name to GASE Energy, Inc. in June 2014. GASE Energy, Inc. is based in Warrenton, Virginia. GASE Energy, Inc. operates as a subsidiary of Bezerius Holdings Limited.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Warrenton"}, "GBR": {"short_name": "New Concept Energy, Inc", "long_name": "New Concept Energy, Inc.", "summary": "New Concept Energy, Inc., through its subsidiaries, owns and operates oil and gas wells, and mineral leases primarily in the United States. Its oil and gas wells, and mineral leases are located in Athens and Meigs counties in Ohio; and Calhoun, Jackson, and Roane counties in West Virginia. As of December 31, 2019, the company had 153 producing gas wells; 44 non-producing wells and related equipment; and mineral leases covering approximately 20,000 acres. The company was formerly known as CabelTel International Corporation and changed its name to New Concept Energy, Inc. in May 2008. The company was founded in 1978 and is based in Dallas, Texas. New Concept Energy, Inc. is a subsidiary of Realty Advisors, Inc.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Dallas"}, "GDP": {"short_name": "Goodrich Petroleum Corporation", "long_name": "Goodrich Petroleum Corporation", "summary": "Goodrich Petroleum Corporation, an independent oil and natural gas company, engages in the exploration, development, and production of oil and natural gas. It primarily holds interests in the Haynesville Shale Trend in northwest Louisiana and East Texas; Tuscaloosa Marine Shale Trend located in southwest Mississippi and southeast Louisiana; and the Eagle Ford Shale Trend situated in South Texas. The company owns interests in 176 producing oil and natural gas wells located in 37 fields in seven states of the United States. As of December 31, 2019, it had estimated proved reserves of approximately 517 billion cubic feet equivalent, which included 510 billion cubic feet of natural gas and 1.1 million barrels of crude oil or other liquid hydrocarbons of oil and condensate. The company was founded in 1995 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Houston"}, "GLRP": {"short_name": "GLEN ROSE PETROLEUM CORPORATION", "long_name": "Glen Rose Petroleum Corporation", "summary": "Glen Rose Petroleum Corporation, through its subsidiary, UHC Petroleum Corporation, produces and sells crude oil in Edwards County, Texas. Its petroleum leaseholds consist of the Wardlaw Lease, which covers an area of approximately 10,562 gross acres; and the Adamson Lease covering approximately 997 gross acres, as well as 85 wellbores. The company was formerly known as United Heritage Corporation and changed its name to Glen Rose Petroleum Corporation in May 2008. Glen Rose Petroleum Corporation was founded in 1981 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "GPORQ": {"short_name": "Gulfport Energy Corporation", "long_name": "Gulfport Energy Corporation", "summary": "Gulfport Energy Corporation engages in the exploration, development, acquisition, and production of natural gas, crude oil, and natural gas liquids (NGL) in the United States. Its principal properties include Utica Shale covering an area of approximately 205,000 net reservoir acres primarily located in Eastern Ohio; and SCOOP covering an area of approximately 76,000 net reservoir acres primarily located in Oklahoma. As of December 31, 2019, it had 4.5 trillion cubic feet of natural gas equivalent of proved reserves; proved undeveloped reserves of 10 MMbbl of oil; and 2,291 Bcf of natural gas and 32 MMbbl of NGL. The company was incorporated in 1997 and is headquartered in Oklahoma City, Oklahoma. On November 13, 2020, Gulfport Energy Corporation, along with its affiliates, filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the Southern District of Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Oklahoma City"}, "GRVE": {"short_name": "GROOVE BOTANICALS INC", "long_name": "Groove Botanicals, Inc.", "summary": "Groove Botanicals, Inc. provides consumer health products. It intends to develop cannabidiol skin care products. The company was formerly known as Avalon Oil & Gas, Inc. and changed its name to Groove Botanicals, Inc. in May 2018. Groove Botanicals, Inc. is based in Minneapolis, Minnesota.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Minneapolis"}, "GSPE": {"short_name": "GULFSLOPE ENERGY INC", "long_name": "GulfSlope Energy, Inc", "summary": "GulfSlope Energy, Inc., an independent oil and natural gas exploration company, focuses on the exploration and development of oil and natural gas properties in the Gulf of Mexico federal waters offshore Louisiana in the United States. It has leased 3 federal outer continental shelf blocks and licensed 2.2 million acres of three-dimensional seismic data in its area of concentration. The company was formerly known as Plan A Promotions, Inc. and changed its name to GulfSlope Energy, Inc. in April 2012. GulfSlope Energy, Inc. was founded in 2003 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "GULTU": {"short_name": "GULF COAST ULTRA DEEP ROYALTY T", "long_name": "Gulf Coast Ultra Deep Royalty Trust", "summary": "Gulf Coast Ultra Deep Royalty Trust operates as a statutory trust. It holds a 5% gross overriding royalty interest in the McMoRan Oil & Gas LLC Inboard Lower Tertiary/Cretaceous exploration prospects located in the shallow waters of the Gulf of Mexico and onshore in South Louisiana. The company is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "HDYNQ": {"short_name": "HYPERDYNAMICS CORP", "long_name": "Hyperdynamics Corporation", "summary": "Hyperdynamics Corporation, together with its subsidiaries, operates as an independent oil and gas exploration company. It engages in the acquisition, exploration, and development of oil and natural gas properties in the Republic of Guinea, Northwest Africa. The company owns a 100% interest in a concession that covers an area of approximately 5,000 square miles in offshore Guinea. Hyperdynamics Corporation was founded in 1983 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "HENC": {"short_name": "HERO TECHNOLOGIES INC", "long_name": "Hero Technologies Inc.", "summary": "Hero Technologies Inc., an exploration stage company, engages in the acquisition, exploration, and development of oil and gas properties in Australia. It holds a working interest in two petroleum exploration licenses (PELs), including a 48.5003% working interest in PEL 112 covering 1,086 square kilometers; and a 53.3336% working interest in PEL 444 covering 1,166 square kilometers located on the southwestern flank of the Cooper Basin in the state of South Australia. The company was formerly known as Holloman Energy Corporation and changed its name to Hero Technologies Inc. in July 2020. The company was incorporated in 2004 and is based in Houston, Texas. Hero Technologies Inc. is a subsidiary of Holloman Corporation.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "HENI": {"short_name": "HINTO ENERGY INC", "long_name": "HINTO Energy, Inc.", "summary": "Hinto Energy, Inc., together with its subsidiary, South Uintah Gas Properties, Inc. engages in the acquisition, exploration, and development of oil and gas properties in the rocky mountain region. The company's properties include the Natural Buttes field in Uintah County; the Greater Cisco Springs field in Grand County; the Mason Lakes and the Ragged Point fields in Musselshell County, Montana; and the Medina County field in Ohio. As of December 31, 2014, its proved undeveloped reserves include 41,515 Bbls of oil and 419,233 MScf of natural gas. The company was founded in 1997 and is based in Greenwood Village, Colorado. On August 16, 2017, an involuntary petition for liquidation under Chapter 7 was filed against Hinto Energy, Inc. in the U.S. Bankruptcy Court for the District of Colorado. On October 31, 2017, the involuntary petition was approved by the Court and the Chapter 7 petition was converted to Chapter 11 reorganization. On December 14, 2017, the the case was converted to liquidation under Chapter 7.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Greenwood Village"}, "HES": {"short_name": "Hess Corporation", "long_name": "Hess Corporation", "summary": "Hess Corporation, an exploration and production company, explores, develops, produces, purchases, transports, and sells crude oil, natural gas liquids (NGLs), and natural gas. It operates through two segments, Exploration and Production, and Midstream. The company conducts production operations primarily in the United States, Denmark, the Malaysia/Thailand Joint Development Area, and Malaysia; and exploration activities primarily offshore Guyana, Suriname, Canada, and in the Gulf of Mexico. As of December 31, 2019, it had total proved reserves of 1,197 million barrels of oil equivalent. The company is also involved in the gathering, compressing, and processing of natural gas; fractionating NGLs; terminaling, loading, and transporting crude oil and NGLs through rail car; storing and terminaling propane, as well as providing water handling services primarily in the Bakken Shale plays in the Williston Basin area of North Dakota. The company was founded in 1920 and is headquartered in New York, New York.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "New York"}, "HGJ1.F": {"short_name": "DENBURY INC.  DL-,001", "long_name": "Denbury Inc.", "summary": "Denbury Resources Inc. operates as an independent oil and natural gas company in the United States. It holds interests in various oil and natural gas properties located in Mississippi, Texas, and Louisiana in the Gulf Coast region; and in Montana, North Dakota, and Wyoming in the Rocky Mountain region. As of December 31, 2019, the company had 230.2 million barrels of oil equivalent of estimated proved oil and natural gas reserves. Denbury Resources Inc. was incorporated in 2003 and is headquartered in Plano, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Plano"}, "HGTXU": {"short_name": "HUGOTON ROYALTY TRUST", "long_name": "Hugoton Royalty Trust", "summary": "Hugoton Royalty Trust operates as an express trust in the United States. It holds 80% net profits interests in various natural gas producing working interest properties in Kansas, Oklahoma, and Wyoming under conveyances. Hugoton Royalty Trust was founded in 1998 and is based in Dallas, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Dallas"}, "HMLA": {"short_name": "HOMELAND RESOURCES LIMITED", "long_name": "Homeland Resources Ltd.", "summary": "Homeland Resources Ltd. operates as an independent oil and gas exploration company in Oklahoma. It holds a 5% working interest in the Washita Bend 3D exploration project located in Cleveland, Garvin, McCain, and Pottawatomie counties; and 2010-1 drilling program located in Garvin County. The company was founded in 2003 and is based in Las Vegas, Nevada.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Las Vegas"}, "HPK": {"short_name": "HighPeak Energy, Inc.", "long_name": "HighPeak Energy, Inc.", "summary": "HighPeak Energy, Inc., an independent oil and natural gas company, engages in the acquisition, exploration, development, and production of oil, natural gas, and natural gas liquids reserves in the United States. Its primary assets are located in Howard County of the Midland Basin, Texas. The company was founded in 2019 and is headquartered in Fort Worth, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NGM", "market": "us_market", "country": "United States", "city": "Fort Worth"}, "HPR": {"short_name": "HighPoint Resources Corporation", "long_name": "HighPoint Resources Corporation", "summary": "HighPoint Resources Corporation, together with its subsidiaries, engages in the exploration, development, and production of oil, natural gas, and natural gas liquids in the United States. The company primarily holds interest in the Denver Julesburg Basin in Colorado's eastern plains and parts of southeastern Wyoming. HighPoint Resources Corporation is headquartered in Denver, Colorado.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Denver"}, "HRST": {"short_name": "HARVEST OIL & GAS CORPORATION", "long_name": "Harvest Oil & Gas Corp.", "summary": "Harvest Oil & Gas Corp., an independent oil and natural gas company, engages in the development and production of oil and natural gas properties in the United States. Its assets primarily consist of producing and non-producing properties located in the Barnett Shale; the San Juan Basin; the Appalachian Basin, including the Utica Shale, Michigan; the Mid-Continent areas in Oklahoma, Texas; Arkansas; and Kansas and Louisiana, as well as the Permian Basin and the Monroe Field in Northern Louisiana. As of December 31, 2018, the company had estimated net proved reserves of 9.9 million barrels of oil; 476.7 billion cubic feet of natural gas; and 29.3 million barrels of natural gas liquids. Harvest Oil & Gas Corp. was founded in 2006 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "HUML": {"short_name": "HUMBLE ENERGY INC", "long_name": "Humble Energy, Inc.", "summary": "Humble Energy, Inc. engages in the oil and gas production and exploration activities. It also owns coal minerals. The company is based in Paron, Arkansas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Paron"}, "HUSA": {"short_name": "Houston American Energy Corpora", "long_name": "Houston American Energy Corp.", "summary": "Houston American Energy Corp., an independent energy company, acquires, explores for, develops, and produces natural gas, crude oil, and condensate. Its oil and gas properties are located primarily in the Texas Permian Basin, the onshore Texas and Louisiana Gulf Coast region, and in the South American country of Colombia. As of December 31, 2019, the company owned interests in 4 gross wells. Houston American Energy Corp. was incorporated in 2001 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Houston"}, "HXPN": {"short_name": "HARRIS EXPLORATION", "long_name": "Harris Exploration, Inc.", "summary": "Harris Exploration, Inc. operates as an investment and merchant bank holding company. The company, through its subsidiaries, focuses on the mining and extraction of gold deposits. Harris Exploration, Inc. is based in Las Vegas, Nevada.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Las Vegas"}, "HYBE": {"short_name": "HYBRID ENERGY HOLDINGS INC", "long_name": "Hybrid Energy Holdings, Inc.", "summary": "Hybrid Energy Holdings, Inc., through its subsidiaries, acquires and operates fuel production and other energy companies. It acquires companies with traditional and proven fuel production, photovoltaic (PV) and solar thermal technologies. Hybrid Energy Holdings, Inc. was formerly known as Comprehensive Healthcare Solutions, Inc. and changed its name to Hybrid Energy Holdings, Inc. in September 2009. Hybrid Energy Holdings, Inc. was incorporated in 1966 and is based in Reno, Nevada. Hybrid Energy Holdings, Inc. is in reorganization.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Reno"}, "IFNY": {"short_name": "INFINITY ENERGY RESOURCES INC", "long_name": "Infinity Energy Resources, Inc.", "summary": "Infinity Energy Resources, Inc. focuses on the acquisition, exploration, and development of oil and gas resources. It has an option to acquire oil and gas properties in central Kansas covering an area of approximately 11,000 acres. The company was founded in 1987 and is based in Overland Park, Kansas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Overland Park"}, "IPRC": {"short_name": "IMPERIAL RESOURCES INC", "long_name": "Imperial Resources, Inc.", "summary": "Imperial Resources, Inc., through its subsidiary, Imperial Oil & Gas, Inc. focuses on the development of oil and gas properties in continental North America. It holds 14.9% working interest in the Cochran #1 well, which is located in the Colorado County, Texas. The company was founded in 2007 and is based in Lago Vista, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Lago Vista"}, "IXOG": {"short_name": "INDEX OIL & GAS INC", "long_name": "Index Oil and Gas Inc.", "summary": "Index Oil and Gas Inc., through its subsidiaries, engages in the acquisition, exploration, appraisal, development, production, and sale of oil and gas properties, primarily in Kansas, Louisiana, and Texas. As of March 31, 2009, the company's estimated total proved oil and gas reserves were approximately 87.703 thousands of barrels of oil equivalent, including 20.967 thousand barrels of oil and 400.414 million cubic feet of natural gas. Index Oil and Gas Inc. was founded in 2003 and is based in Houston, Texas. On November 17, 2010, Index Oil and Gas, Inc. filed a voluntary petition for liquidation under Chapter 7 in the U.S. Bankruptcy Court for the Southern District of Texas. Index Oil & Gas, Inc. is in liquidation.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "JUE.F": {"short_name": "FREMONT PETROLEUM CORP.", "long_name": "Fremont Petroleum Corporation Ltd", "summary": "Fremont Petroleum Corporation Ltd engages in the exploration and development of oil and gas assets in the United States. It holds 100% interest in the Pathfinder project covering an area of 15,282 acres in DJ Basin in Colorado. The company was formerly known as Austin Exploration Limited and changed its name to Fremont Petroleum Corporation Ltd in June 2017. Fremont Petroleum Corporation Ltd was founded in 2006 and is headquartered in Florence, Colorado.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Florence"}, "KEI.TO": {"short_name": "KOLIBRI GLOBAL ENERGY INC", "long_name": "Kolibri Global Energy Inc.", "summary": "Kolibri Global Energy Inc. engages in the exploration, development, production, and marketing of oil and gas. The company produces crude oil, natural gas, and natural gas liquids. It primarily holds an interest in approximately 17,391 net acres of shale oil acreage in the Caney/Upper Sycamore formations of the Tishomingo Field, Oklahoma. As of December 31, 2019, the company's total proved reserves were 33.4 million barrels of oil equivalent. The company was formerly known as BNK Petroleum Inc. and changed its name to Kolibri Global Energy Inc. in November 2020. Kolibri Global Energy Inc. was incorporated in 2008 and is headquartered in Camarillo, California.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "TOR", "market": "ca_market", "country": "United States", "city": "Camarillo"}, "KFG.V": {"short_name": "KFG Resources Ltd.", "long_name": "KFG Resources Ltd.", "summary": "KFG Resources Ltd., through its subsidiary, KFG Petroleum Corporation, engages in the exploration and production of crude oil and natural gas in the United States. The company develops onshore oil and gas reserves located in Adams, Jefferson, and Wilkinson Counties, Mississippi. KFG Resources Ltd. was incorporated in 1994 and is headquartered in Natchez, Mississippi.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "VAN", "market": "ca_market", "country": "United States", "city": "Natchez"}, "KGEIF": {"short_name": "KOLIBRI GLOBAL ENERGY INC", "long_name": "Kolibri Global Energy Inc.", "summary": "Kolibri Global Energy Inc. engages in the exploration, development, production, and marketing of oil and gas. The company produces crude oil, natural gas, and natural gas liquids. It primarily holds an interest in approximately 17,391 net acres of shale oil acreage in the Caney/Upper Sycamore formations of the Tishomingo Field, Oklahoma. As of December 31, 2019, the company's total proved reserves were 33.4 million barrels of oil equivalent. The company was formerly known as BNK Petroleum Inc. and changed its name to Kolibri Global Energy Inc. in November 2020. Kolibri Global Energy Inc. was incorporated in 2008 and is headquartered in Camarillo, California.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Camarillo"}, "KOS": {"short_name": "Kosmos Energy Ltd.", "long_name": "Kosmos Energy Ltd.", "summary": "Kosmos Energy Ltd., a deepwater independent oil and gas exploration and production company, focuses along the Atlantic Margins. The company's primary assets include production offshore Ghana, Equatorial Guinea, and U.S. Gulf of Mexico, as well as a gas development offshore Mauritania and Senegal. It also maintains an exploration program balanced between proven basin infrastructure-led exploration, emerging basins, and frontier basins. The company was founded in 2003 and is headquartered in Dallas, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Dallas"}, "KOS.L": {"short_name": "KOSMOS ENERGY LTD COM SHS USD0.", "long_name": "Kosmos Energy Ltd.", "summary": "Kosmos Energy Ltd., a deepwater independent oil and gas exploration and production company, focuses along the Atlantic Margins. The company's primary assets include production offshore Ghana, Equatorial Guinea, and U.S. Gulf of Mexico, as well as a gas development offshore Mauritania and Senegal. It also maintains an exploration program balanced between proven basin infrastructure-led exploration, emerging basins, and frontier basins. The company was founded in 2003 and is headquartered in Dallas, Texas.", "currency": "GBp", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "LSE", "market": "gb_market", "country": "United States", "city": "Dallas"}, "KOS1.F": {"short_name": "KOSMOS ENERGY LTD  DL-,01", "long_name": "Kosmos Energy Ltd.", "summary": "Kosmos Energy Ltd., a deepwater independent oil and gas exploration and production company, focuses along the Atlantic Margins. The company's primary assets include production offshore Ghana, Equatorial Guinea, and U.S. Gulf of Mexico, as well as a gas development offshore Mauritania and Senegal. It also maintains an exploration program balanced between proven basin infrastructure-led exploration, emerging basins, and frontier basins. The company was founded in 2003 and is headquartered in Dallas, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Dallas"}, "KRP": {"short_name": "Kimbell Royalty Partners", "long_name": "Kimbell Royalty Partners, LP", "summary": "Kimbell Royalty Partners, LP acquires and owns mineral and royalty interests in oil and natural gas properties in the United States. As of December 31, 2019, the company owned mineral and royalty interests in approximately 8.9 million gross acres and overriding royalty interests in approximately 4.6 million gross acres. Its mineral and royalty interests are located in 28 states and include ownership in approximately 94,000 gross producing wells, including approximately 40,000 wells in the Permian Basin. Kimbell Royalty GP, LLC serves as the general partner of the company. Kimbell Royalty Partners, LP was founded in 2013 and is based in Fort Worth, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Fort Worth"}, "KUB.V": {"short_name": "CUB ENERGY INC", "long_name": "Cub Energy Inc.", "summary": "CUB Energy Inc., an upstream oil and gas company, engages in the exploration and development of onshore oil and gas properties. As of December 31, 2019, it had nine licenses with approximately 142,000 net acres in Ukraine. The company is headquartered in Houston, Texas.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "VAN", "market": "ca_market", "country": "United States", "city": "Houston"}, "LBYE": {"short_name": "LIBERTY ENERGY CORPORATION", "long_name": "Liberty Energy Corp.", "summary": "Liberty Energy Corp. engages in the exploration and development of oil and gas properties in the United States. It holds interests in four oil and gas producing leases, which cover 1,038 acres with 17 oil wells and 4 injection wells located Baylor County, Texas. The company was formerly known as DMA Minerals Inc. and changed its name to Liberty Energy Corp. in June 2008. Liberty Energy Corp. was founded in 2006 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "LONE": {"short_name": "LONESTAR RESOURCES US INC", "long_name": "Lonestar Resources US Inc.", "summary": "Lonestar Resources US Inc., an independent oil and gas company, engages in the acquisition, development, and production of unconventional oil, natural gas liquids, and natural gas properties in the United States. It primarily focuses on Eagle Ford Shale properties that cover an area of 53,831 net acres in Texas counties. The company was incorporated in 2015 and is headquartered in Fort Worth, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Fort Worth"}, "LPI": {"short_name": "Laredo Petroleum, Inc.", "long_name": "Laredo Petroleum, Inc.", "summary": "Laredo Petroleum, Inc., an independent energy company, engages in the acquisition, exploration, and development of oil and natural gas properties in the Permian Basin of West Texas, the United States. The company also engages in midstream and marketing infrastructure activities, including transportation and marketing of oil and natural gas, and handling of fresh, recycled, and produced water, as well as operates natural gas lift facilities. As of December 31, 2019, it had assembled 133,512 net acres in the Permian Basin; and had total proved reserves of 293,377 thousand barrels of oil equivalent. The company was formerly known as Laredo Petroleum Holdings, Inc. and changed its name to Laredo Petroleum, Inc. in December 2013. Laredo Petroleum, Inc. was founded in 2006 and is headquartered in Tulsa, Oklahoma.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Tulsa"}, "LRDC": {"short_name": "LAREDO OIL INC", "long_name": "Laredo Oil, Inc.", "summary": "Laredo Oil, Inc., a management services company, manages the acquisition and operation of mature oil fields, and recovers stranded oil from those fields using enhanced oil recovery methods. The company was formerly known as Laredo Mining, Inc. and changed its name to Laredo Oil, Inc. in October 2009. Laredo Oil, Inc. was founded in 2008 and is headquartered in Golden, Colorado.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Golden"}, "MCF": {"short_name": "Contango Oil & Gas Company", "long_name": "Contango Oil & Gas Company", "summary": "Contango Oil & Gas Company, an independent oil and natural gas company, acquires, explores, develops, exploits, and produces crude oil and natural gas properties in the shallow waters of the Gulf of Mexico and onshore properties in Texas, Oklahoma, Louisiana, and Wyoming in the United States. As of December 31, 2019, it had proved reserves of approximately 316.4 billion cubic feet equivalent, including 131.3 billion cubic feet of natural gas, 19.1 million barrels of crude oil and condensate, and 11.8 million barrels of natural gas liquids. The company was founded in 1986 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Houston"}, "MDMP": {"short_name": "MDM PERMIAN INC", "long_name": "MDM Permian, Inc.", "summary": "MDM Permian, Inc. engages in the drilling and production of oil and gas properties. It primarily focuses on the oil and gas drilling prospects in the Midland Basin of West Texas. The company is based in Addison, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Addison"}, "MENC": {"short_name": "MILLENNIUM ENERGY CORP", "long_name": "Millennium Energy Corp", "summary": "Millennium Energy Corporation focuses on a range of renewable energy projects worldwide. Its renewable energy projects are powered by wind, solar, or waste to energy facilities. Millennium Energy Corporation has a strategic alliance with Amplex Capital. The company was formerly known as Third Millennium Industries, Inc. and changed its name to Millennium Energy Corporation in February 2014. Millennium Energy Corporation was founded in 2001 and is based in New York, New York.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "New York"}, "MGUY": {"short_name": "MOGUL ENERGY INTERNATIONAL INC", "long_name": "Mogul Energy International, Inc.", "summary": "Mogul Energy International, Inc. operates as an oil and gas exploration and development company. It operates the Stafford prospect located in Jackson County, Texas; the Alkek prospect situated in Goliad County, Texas; and the East Mathis prospect located in San Patricio County, Texas, as well as prospects across the Gulf Coast area of Texas. The company was founded in 2005 and is headquartered in Houston, Texas. On September 20, 2017, Mogul Energy International Inc. filed a voluntary petition for liquidation under Chapter 7 in the US Bankruptcy Court for the Southern District of Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "MGY": {"short_name": "Magnolia Oil & Gas Corporation", "long_name": "Magnolia Oil & Gas Corporation", "summary": "Magnolia Oil & Gas Corporation engages in the acquisition, development, exploration, and production of oil, natural gas, and natural gas liquids reserves in the United States. The company's properties are located primarily in Karnes County and the Giddings Field in South Texas principally comprising the Eagle Ford Shale and the Austin Chalk formation. As of December 31, 2019, its assets consisted of a total leasehold position of 450,854 net acres, including 22,088 net acres in Karnes, Gonzales, DeWitt, and Atascosa counties, Texas; 428,766 net acres in the Giddings Field; and approximately 1,141 net wells with a total production capacity of 66.8 thousand barrels of oil equivalent per day. The company is headquartered in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Houston"}, "MKGP": {"short_name": "MAVERICK ENERGY GROUP LTD", "long_name": "Maverick Energy Group, Ltd.", "summary": "Maverick Energy Group, Ltd. operates as a natural gas and crude oil exploration and production company. The company focuses on the development and acquisition of producing natural gas and oil properties onshore North America. It is involved in drilling the Larremore field located in Caldwell County in south Texas; operating the Big Foot Field located in Frio and Atascosa counties in Texas; and owning seven producing gas wells in West Virginia. The company also acquires 100% interest Couch leases that cover approximately 800 acres adjacent to the Big Foot Field; and holds interests in the Eagle Ford shale located in south Texas. Maverick Energy Group, Ltd. is based in Tulsa, Oklahoma.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Tulsa"}, "MMEX": {"short_name": "MMEX RESOURCES CORPORATION", "long_name": "MMEX Resources Corporation", "summary": "MMEX Resources Corporation, a development stage company, engages in the exploration, extraction, refining, and distribution of oil, gas, petroleum products, and electric power. It focuses on the acquisition, development, and financing of oil, gas, refining and electric power projects in Texas, Peru, and other countries in Latin America. The company was founded in 2009 and is headquartered in Fort Stockton, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Fort Stockton"}, "MNRL": {"short_name": "Brigham Minerals, Inc.", "long_name": "Brigham Minerals, Inc.", "summary": "Brigham Minerals, Inc. owns and operates a portfolio of mineral and royalty interests in the continental United States. The company primarily holds mineral and royalty interests in the Permian Basin in West Texas and New Mexico; the South Central Oklahoma Oil Province and Sooner Trend Anadarko Basin Canadian and Kingfisher Counties plays in the Anadarko Basin of Oklahoma; the Denver-Julesburg Basin in Colorado; and Wyoming and the Williston Basin in North Dakota. As of December 31, 2019, it had mineral and royalty interests in approximately 57,800 net mineral acres; and owned mineral and royalty interests in 4,908 gross productive horizontal wells, which consisted of 4,424 oil wells and 484 natural gas wells, as well as proved undeveloped reserves of 7,037 thousand barrels of oil; 28,498 million cubic feet of natural gas; and 3,344 thousand barrels of natural gas liquids for a total of 15,131 thousand barrels of oil equivalent. Brigham Minerals, Inc. was founded in 2012 and is headquartered in Austin, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Austin"}, "MNVN": {"short_name": "MONDIAL VENTURES INC", "long_name": "Mondial Ventures, Inc.", "summary": "Mondial Ventures, Inc., an independent oil and gas company, engages in the exploration, development, and exploitation of crude oil and natural gas properties primarily in the United States. It holds interests in the North 40 acres of the J.B. Tubb Leasehold Estate/Amoco Crawar field comprising three well heads and three well bores; and in the South 40 acres of the Highland Production Company No. 2 well-bore located in Ward County, Texas. The company was founded in 2002 and is headquartered in Scottsdale, Arizona.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Scottsdale"}, "MNVWF": {"short_name": "MOUNTAINVIEW ENERGY", "long_name": "Mountainview Energy Ltd.", "summary": "Mountainview Energy Ltd. engages in the acquisition, exploration, development, and production of petroleum and natural gas reserves in Montana and North Dakota, the United States. It primarily focuses on the Bakken and Three Forks Shale in the Williston Basin and the South Alberta Bakken. The company was incorporated in 2000 and is headquartered in Cut Bank, Montana.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Cut Bank"}, "MPLN.F": {"short_name": "TELLURIAN INC.  DL-,01", "long_name": "Tellurian Inc.", "summary": "Tellurian Inc. engages in the natural gas business worldwide. The company is developing a portfolio of natural gas production, liquefied natural gas (LNG) marketing, and infrastructure assets that includes an approximately 27.6 million tons per annum LNG terminal facility and an associated pipeline in southwest Louisiana. As of February 24, 2020, it owned interests in approximately 10,260 net acres and 67 producing wells located in the Haynesville Shale trend of north Louisiana. The company was founded in 2016 and is headquartered in Houston, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Houston"}, "MRO": {"short_name": "Marathon Oil Corporation", "long_name": "Marathon Oil Corporation", "summary": "Marathon Oil Corporation operates as an independent exploration and production company in the United States and Equatorial Guinea. The company engages in the exploration, production, and marketing of crude oil and condensate, natural gas liquids, and natural gas; and the production and marketing of products manufactured from natural gas, such as liquefied natural gas and methanol, as well as owns and operates 32 central gathering and treating facilities and the Sugarloaf gathering system, a 42-mile natural gas pipeline through Karnes and Atascosa Counties. As of December 31, 2019, it had estimated proved developed reserves totaling 721 million barrels of oil equivalent (mmboe); and estimated proved undeveloped reserves totaling 484 mmboe. The company was formerly known as USX Corporation and changed its name to Marathon Oil Corporation in July 2001. Marathon Oil Corporation was founded in 1887 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Houston"}, "MTDR": {"short_name": "Matador Resources Company", "long_name": "Matador Resources Company", "summary": "Matador Resources Company, an independent energy company, engages in the exploration, development, production, and acquisition of oil and natural gas resources in the United States. It operates in two segments, Exploration and Production; and Midstream. The company primarily holds interests in the Wolfcamp and Bone Spring plays in the Delaware Basin in Southeast New Mexico and West Texas. It also operates the Eagle Ford shale play in South Texas; and the Haynesville shale and Cotton Valley plays in Northwest Louisiana. In addition, the company conducts midstream operations in support of its exploration, development, and production operations; provides natural gas processing and oil transportation services; and offers oil, natural gas, and salt water gathering services, as well as salt water disposal services to third parties. As of December 31, 2019, its estimated total proved oil and natural gas reserves were 252.5 million barrels of oil equivalent, including 148.0 million stock tank barrels of oil and 627.2 billion cubic feet of natural gas. The company was formerly known as Matador Holdco, Inc. and changed its name to Matador Resources Company in August 2011. Matador Resources Company was founded in 2003 and is headquartered in Dallas, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Dallas"}, "MTR": {"short_name": "Mesa Royalty Trust", "long_name": "Mesa Royalty Trust", "summary": "Mesa Royalty Trust owns net overriding royalty interests in various oil and gas producing properties in the United States. It has interests in properties located in the Hugoton field of Kansas; and the San Juan Basin field of New Mexico and Colorado. The company was founded in 1979 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Houston"}, "MUQ.F": {"short_name": "MURPHY OIL CORP.  DL 1", "long_name": "Murphy Oil Corporation", "summary": "Murphy Oil Corporation operates as an oil and natural gas exploration and production company in the United States, Canada, and internationally. It explores for and produces crude oil, natural gas, and natural gas liquids. The company was formerly known as Murphy Corporation and changed its name to Murphy Oil Corporation in 1964. Murphy Oil Corporation was incorporated in 1950 and is headquartered in El Dorado, Arkansas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "El Dorado"}, "MUR": {"short_name": "Murphy Oil Corporation", "long_name": "Murphy Oil Corporation", "summary": "Murphy Oil Corporation operates as an oil and natural gas exploration and production company in the United States, Canada, and internationally. It explores for and produces crude oil, natural gas, and natural gas liquids. The company was formerly known as Murphy Corporation and changed its name to Murphy Oil Corporation in 1964. Murphy Oil Corporation was incorporated in 1950 and is headquartered in El Dorado, Arkansas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "El Dorado"}, "MVO": {"short_name": "MV Oil Trust", "long_name": "MV Oil Trust", "summary": "MV Oil Trust acquires and holds net profits interests in the oil and natural gas properties of MV Partners, LLC. Its properties include approximately 900 producing oil and gas wells located in the Mid-Continent region in the states of Kansas and Colorado. The company was founded in 2006 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Houston"}, "MXC": {"short_name": "Mexco Energy Corporation", "long_name": "Mexco Energy Corporation", "summary": "Mexco Energy Corporation, an independent oil and gas company, engages in the acquisition, exploration, development, and production of natural gas, crude oil, condensate, and natural gas liquids in the United States. It owns partial interests in approximately 6,300 producing wells located in the states of Texas, New Mexico, Oklahoma, Louisiana, Ohio, Alabama, Mississippi, Arkansas, Wyoming, Kansas, Colorado, Montana, Virginia, and North Dakota. As of March 31, 2020, the company's total estimated proved reserves were approximately 1.816 million barrels of oil equivalent. It also owned leasehold mineral and royalty interests in approximately 3,402 net acres. The company was formerly known as Miller Oil Company and changed its name to Mexco Energy Corporation in April 1980. Mexco Energy Corporation was founded in 1972 and is based in Midland, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Midland"}, "MZB.F": {"short_name": "MEXCO ENERGY CORP. DL-,50", "long_name": "Mexco Energy Corporation", "summary": "Mexco Energy Corporation, an independent oil and gas company, engages in the acquisition, exploration, development, and production of natural gas, crude oil, condensate, and natural gas liquids in the United States. It owns partial interests in approximately 6,300 producing wells located in the states of Texas, New Mexico, Oklahoma, Louisiana, Ohio, Alabama, Mississippi, Arkansas, Wyoming, Kansas, Colorado, Montana, Virginia, and North Dakota. As of March 31, 2020, the company's total estimated proved reserves were approximately 1.816 million barrels of oil equivalent. It also owned leasehold mineral and royalty interests in approximately 3,402 net acres. The company was formerly known as Miller Oil Company and changed its name to Mexco Energy Corporation in April 1980. Mexco Energy Corporation was founded in 1972 and is based in Midland, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Midland"}, "NEXT": {"short_name": "NextDecade Corporation", "long_name": "NextDecade Corporation", "summary": "NextDecade Corporation, a liquefied natural gas (LNG) development company, engages in the development activities related to the liquefaction and sale of LNG. It focusses on the development activities of Rio Grande LNG terminal facility located in the Port of Brownsville, Texas; and Galveston Bay LNG terminal facility situated in Texas City, Texas. The company is headquartered in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Houston"}, "NFEI": {"short_name": "NEW FRONTIER ENERGY INC", "long_name": "New Frontier Energy, Inc.", "summary": "New Frontier Energy, Inc., an independent energy company, engages in the acquisition, exploration, development, and production of natural gas and crude oil. Its operations are conducted in the continental United States, principally in the Denver Julesberg Basin. The company was formerly known as Storage Finders.com and changed its name to New Frontier Energy, Inc. in March 2001. New Frontier Energy, Inc. was founded in 2000 and is based in Denver, Colorado.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Denver"}, "NKRN": {"short_name": "NIKRON TECHNOLOGIES INC", "long_name": "Nikron Technologies, Inc.", "summary": "Nikron Technologies, Inc., a natural resource company, focuses on heavy oil recovery from mature onshore U.S. fields. The company intends to acquire leases on heavy oil reserves, directly own and operate the recovery facilities, and sell the extracted crude oil product. The company was formerly known as CYR, Inc. and changed its name to Nikron Technologies, Inc. in October 2000 to reflect its current business activities. Nikron Technologies, Inc. was founded in 1987 and is based in Topeka, Kansas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Topeka"}, "NOG": {"short_name": "Northern Oil and Gas, Inc.", "long_name": "Northern Oil and Gas, Inc.", "summary": "Northern Oil and Gas, Inc., an independent energy company, engages in the acquisition, exploration, exploitation, development, and production of crude oil and natural gas properties in the United States. The company primarily holds interests in the Bakken and Three Forks formations in the Williston Basin of North Dakota and Montana. As of December 31, 2019, it owned working interests in 6,156 gross producing wells; and had proved reserves of 163.3 million barrels of oil equivalent. The company is based in Minnetonka, Minnesota.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Minnetonka"}, "NRIS": {"short_name": "NORRIS INDUSTRIES INC", "long_name": "Norris Industries, Inc.", "summary": "Norris Industries, Inc. acquires, explores for, and develops crude oil and natural gas properties in Texas. The company's principal properties are located in the Ellenberger formation in Coleman County, as well as the Jack and Palo-Pinto Counties. As of March 1, 2020, it had total proved reserves of approximately 29 thousands of barrels of oil and 150 millions of cubic feet of gas. The company was formerly known as International Western Petroleum, Inc. and changed its name to Norris Industries, Inc. in February 2018. Norris Industries, Inc. was founded in 2014 and is headquartered in Weatherford, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Weatherford"}, "NSLPQ": {"short_name": "NEW SOURCE ENERGY PARTNERS L P", "long_name": "New Source Energy Partners L.P.", "summary": "New Source Energy Partners L.P. acquires, owns, develops, and produces oil and natural gas properties in the United States. It operates through two segments, Exploration and Production, and Oilfield Services. As of December 31, 2014, the company had 145,919 gross acres in the Golden Lane, Luther, and Southern Dome fields in east-central Oklahoma; and 83 gross proved undeveloped drilling locations. It had proved reserves of approximately 16.3 MMBoe. The company also offers various oilfield services, including wellsite services during the drilling and completion stages of a well, such as blowout prevention, surface valve, and flowback services for horizontal and vertical wells in oil, natural gas, and NGL production regions in North America. New Source Energy GP, LLC operates as a general partner of the company. The company was founded in 2012 and is headquartered in Oklahoma City, Oklahoma. On March 15, 2016, New Source Energy Partners LP, along with its affiliate, filed a voluntary petition for liquidation under Chapter 7 in the US Bankruptcy Court for the District of Delaware.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Oklahoma City"}, "OAS": {"short_name": "Oasis Petroleum Inc.", "long_name": "Oasis Petroleum Inc.", "summary": "Oasis Petroleum Inc., an independent exploration and production company, focuses on the acquisition and development of onshore unconventional oil and natural gas resources in the North Dakota and Montana regions of the Williston Basin and the Texas region of the Delaware Basin. As of December 31, 2019, the company had 408,117 net leasehold acres in the Williston Basin; and 24,995 net leasehold acres in the Delaware Basin, as well as approximately 286.4 million barrels of oil equivalent of estimated net proved reserves. It also operates midstream services business. The company sells its crude oil and natural gas to refiners, marketers, and other purchasers that have access to pipeline and rail facilities. Oasis Petroleum Inc. was founded in 2007 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Houston"}, "OEDVQ": {"short_name": "OSAGE EXPLORATION & DEVELOPMENT", "long_name": "Osage Exploration and Development, Inc.", "summary": "Osage Exploration and Development, Inc., an independent energy company, primarily engages in the acquisition, development, production, and sale of oil, gas, and natural gas liquids in Oklahoma, the United States. It has interest in oil and gas properties located in Logan, Coal, and Pawnee counties. The company was formerly known as Osage Energy Corporation and changed its name to Osage Exploration and Development, Inc. in July 2007. Osage Exploration and Development, Inc. is headquartered in San Diego, California.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "San Diego"}, "OILY": {"short_name": "SINO AMERICAN OIL COMPANY", "long_name": "Sino American Oil Company", "summary": "Sino American Oil Company operates as an oil and gas exploration company. It also seeks mergers and acquisitions contracts, as well as commodity trading of hydrocarbon products. The company was formerly known as Raphael Industries Ltd. and changed its name to Sino American Oil Company in November 2010. Sino American Oil Company was incorporated in 2005 and is based in Cheyenne, Wyoming.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Cheyenne"}, "OOAG": {"short_name": "OMDA OIL & GAS INC", "long_name": "OMDA Oil and Gas, Inc.", "summary": "OMDA Oil and Gas, Inc. operates as a consulting company. The company is headquartered in Wilmington, Delaware.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Wilmington"}, "OOIL": {"short_name": "PERKINS OIL & GAS INC", "long_name": "Perkins Oil & Gas, Inc.", "summary": "Perkins Oil & Gas, Inc., an exploration stage company, focuses on the exploration and development of oil and gas properties. The company was founded in 2012 and is based in Dallas, Texas. Perkins Oil & Gas, Inc. is a subsidiary of Regale Consultants Ltd. As of February 3, 2017, Perkins Oil & Gas, Inc. operates as a subsidiary of Regale Consultants Ltd.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Dallas"}, "OPC.DE": {"short_name": "OCCIDENTAL PET.  DL-,20", "long_name": "Occidental Petroleum Corporation", "summary": "Occidental Petroleum Corporation, together with its subsidiaries, engages in the acquisition, exploration, and development of oil and gas properties in the United States, the Middle East, and Latin America. The company operates through three segments: Oil and Gas, Chemical, and Marketing and Midstream. The Oil and Gas segment explores for, develops, and produces oil and condensate, natural gas liquids (NGLs), and natural gas. The Chemical segment manufactures and markets basic chemicals, including chlorine, caustic soda, chlorinated organics, potassium chemicals, ethylene dichloride, chlorinated isocyanurates, sodium silicates, and calcium chloride; vinyls comprising vinyl chloride monomer, polyvinyl chloride, and ethylene. The Midstream and Marketing segment gathers, processes, transports, stores, purchases, and markets oil, condensate, NGLs, natural gas, carbon dioxide, and power. This segment also trades around its assets consisting of transportation and storage capacity; and invests in entities. Occidental Petroleum Corporation was founded in 1920 and is headquartered in Houston, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "GER", "market": "de_market", "country": "United States", "city": "Houston"}, "OPC.F": {"short_name": "OCCIDENTAL PET.  DL-,20", "long_name": "Occidental Petroleum Corporation", "summary": "Occidental Petroleum Corporation, together with its subsidiaries, engages in the acquisition, exploration, and development of oil and gas properties in the United States, the Middle East, and Latin America. The company operates through three segments: Oil and Gas, Chemical, and Marketing and Midstream. The Oil and Gas segment explores for, develops, and produces oil and condensate, natural gas liquids (NGLs), and natural gas. The Chemical segment manufactures and markets basic chemicals, including chlorine, caustic soda, chlorinated organics, potassium chemicals, ethylene dichloride, chlorinated isocyanurates, sodium silicates, and calcium chloride; vinyls comprising vinyl chloride monomer, polyvinyl chloride, and ethylene. The Midstream and Marketing segment gathers, processes, transports, stores, purchases, and markets oil, condensate, NGLs, natural gas, carbon dioxide, and power. This segment also trades around its assets consisting of transportation and storage capacity; and invests in entities. Occidental Petroleum Corporation was founded in 1920 and is headquartered in Houston, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Houston"}, "OS70.F": {"short_name": "OASIS PETROLEUM  DL -,01", "long_name": "Oasis Petroleum Inc.", "summary": "Oasis Petroleum Inc., an independent exploration and production company, focuses on the acquisition and development of onshore unconventional oil and natural gas resources in the North Dakota and Montana regions of the Williston Basin and the Texas region of the Delaware Basin. As of December 31, 2019, the company had 408,117 net leasehold acres in the Williston Basin; and 24,995 net leasehold acres in the Delaware Basin, as well as approximately 286.4 million barrels of oil equivalent of estimated net proved reserves. It also operates midstream services business. The company sells its crude oil and natural gas to refiners, marketers, and other purchasers that have access to pipeline and rail facilities. Oasis Petroleum Inc. was founded in 2007 and is headquartered in Houston, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Houston"}, "OSKA": {"short_name": "OSYKA CORPORATION", "long_name": "Osyka Corporation", "summary": "Osyka Corporation, an oil and gas company, engages in the acquisition, development, exploration, and production of oil and gas properties in Mississippi and Texas. The company was founded in 1990 and is based in Houston, Texas. Osyka Corporation is former subsidiary of Legado Resources LLC and Tellus Energy Group, LLC.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "OVV": {"short_name": "Ovintiv Inc. (DE)", "long_name": "Ovintiv Inc.", "summary": "Ovintiv Inc., together with its subsidiaries, engages in the exploration, development, production, and marketing of natural gas, oil, and natural gas liquids. The company's principal assets include Permian in west Texas and Anadarko in west-central Oklahoma; and Montney in northeast British Columbia and northwest Alberta. Its other upstream assets comprise Eagle Ford in south Texas, Bakken in North Dakota, and Uinta in central Utah; and Duvernay in west central Alberta, Wheatland in southern Alberta, Horn River in northeast British Columbia, and Deep Panuke in offshore Nova Scotia. The company was formerly known as Encana Corporation and changed its name to Ovintiv Inc. in January 2020. Ovintiv Inc. is based in Denver, Colorado.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Denver"}, "OVV.TO": {"short_name": "OVINTIV INC", "long_name": "Ovintiv Inc.", "summary": "Ovintiv Inc., together with its subsidiaries, engages in the exploration, development, production, and marketing of natural gas, oil, and natural gas liquids. The company's principal assets include Permian in west Texas and Anadarko in west-central Oklahoma; and Montney in northeast British Columbia and northwest Alberta. Its other upstream assets comprise Eagle Ford in south Texas, Bakken in North Dakota, and Uinta in central Utah; and Duvernay in west central Alberta, Wheatland in southern Alberta, Horn River in northeast British Columbia, and Deep Panuke in offshore Nova Scotia. The company was formerly known as Encana Corporation and changed its name to Ovintiv Inc. in January 2020. Ovintiv Inc. is based in Denver, Colorado.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "TOR", "market": "ca_market", "country": "United States", "city": "Denver"}, "OXY": {"short_name": "Occidental Petroleum Corporatio", "long_name": "Occidental Petroleum Corporation", "summary": "Occidental Petroleum Corporation, together with its subsidiaries, engages in the acquisition, exploration, and development of oil and gas properties in the United States, the Middle East, and Latin America. The company operates through three segments: Oil and Gas, Chemical, and Marketing and Midstream. The Oil and Gas segment explores for, develops, and produces oil and condensate, natural gas liquids (NGLs), and natural gas. The Chemical segment manufactures and markets basic chemicals, including chlorine, caustic soda, chlorinated organics, potassium chemicals, ethylene dichloride, chlorinated isocyanurates, sodium silicates, and calcium chloride; vinyls comprising vinyl chloride monomer, polyvinyl chloride, and ethylene. The Midstream and Marketing segment gathers, processes, transports, stores, purchases, and markets oil, condensate, NGLs, natural gas, carbon dioxide, and power. This segment also trades around its assets consisting of transportation and storage capacity; and invests in entities. Occidental Petroleum Corporation was founded in 1920 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Houston"}, "OXYP34.SA": {"short_name": "OCCIDENT PTRDRN", "long_name": "Occidental Petroleum Corporation", "summary": "Occidental Petroleum Corporation, together with its subsidiaries, engages in the acquisition, exploration, and development of oil and gas properties in the United States, the Middle East, and Latin America. The company operates through three segments: Oil and Gas, Chemical, and Marketing and Midstream. The Oil and Gas segment explores for, develops, and produces oil and condensate, natural gas liquids (NGLs), and natural gas. The Chemical segment manufactures and markets basic chemicals, including chlorine, caustic soda, chlorinated organics, potassium chemicals, ethylene dichloride, chlorinated isocyanurates, sodium silicates, and calcium chloride; vinyls comprising vinyl chloride monomer, polyvinyl chloride, and ethylene. The Midstream and Marketing segment gathers, processes, transports, stores, purchases, and markets oil, condensate, NGLs, natural gas, carbon dioxide, and power. This segment also trades around its assets consisting of transportation and storage capacity; and invests in entities. Occidental Petroleum Corporation was founded in 1920 and is headquartered in Houston, Texas.", "currency": "BRL", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "SAO", "market": "br_market", "country": "United States", "city": "Houston"}, "P0BR.F": {"short_name": "PERMIAN BASIN R.TR. U.B.I", "long_name": "Permian Basin Royalty Trust", "summary": "Permian Basin Royalty Trust, an express trust, holds overriding royalty interests in various oil and gas properties in the United States. The company owns a 75% net overriding royalty interest in the Waddell Ranch properties comprising Dune, Judkins, McKnight, Tubb, Devonian, and Waddell fields located in Crane County, Texas. As of December 31, 2019, the Waddell Ranch properties contained 332 net productive oil wells, 106 net productive gas wells, and 120 net injection wells. The company also holds a 95% net overriding royalty in the Texas Royalty properties, which consist of various producing oil fields, such as Yates, Wasson, Sand Hills, East Texas, Kelly-Snyder, Panhandle Regular, N. Cowden, Todd, Keystone, Kermit, McElroy, Howard-Glasscock, Seminole, and others located in 33 counties in Texas. The Texas Royalty properties comprised approximately 125 separate royalty interests containing approximately 51,000 net producing acres. Permian Basin Royalty Trust was founded in 1980 and is based in Dallas, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Dallas"}, "P3CP.F": {"short_name": "YUMA ENERGY", "long_name": "Yuma Energy, Inc.", "summary": "Yuma Energy, Inc. focuses on the acquisition, development, and exploration for conventional and unconventional oil and natural gas resources in the United States. It has onshore properties located in central and southern Louisiana, and southeastern Texas; and operated and non-operated assets in south Louisiana, including Cameron, LaFourche, Livingston, St. Helena, St. Bernard, and Vermilion parishes. The company also holds operated and non-operated assets located in Jefferson and Madison counties, southeast Texas; non-operated position in the East Texas Woodbine; and operated positions in Kern County in California. Yuma Energy, Inc. is based in Houston, Texas. On October 19, 2020, the voluntary petition of Yuma Energy, Inc. for reorganization under Chapter 11 was converted to Chapter 7. It had filed for Chapter 11 bankruptcy on April 15, 2020.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Houston"}, "PBT": {"short_name": "Permian Basin Royalty Trust", "long_name": "Permian Basin Royalty Trust", "summary": "Permian Basin Royalty Trust, an express trust, holds overriding royalty interests in various oil and gas properties in the United States. The company owns a 75% net overriding royalty interest in the Waddell Ranch properties comprising Dune, Judkins, McKnight, Tubb, Devonian, and Waddell fields located in Crane County, Texas. As of December 31, 2019, the Waddell Ranch properties contained 332 net productive oil wells, 106 net productive gas wells, and 120 net injection wells. The company also holds a 95% net overriding royalty in the Texas Royalty properties, which consist of various producing oil fields, such as Yates, Wasson, Sand Hills, East Texas, Kelly-Snyder, Panhandle Regular, N. Cowden, Todd, Keystone, Kermit, McElroy, Howard-Glasscock, Seminole, and others located in 33 counties in Texas. The Texas Royalty properties comprised approximately 125 separate royalty interests containing approximately 51,000 net producing acres. Permian Basin Royalty Trust was founded in 1980 and is based in Dallas, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Dallas"}, "PDCE": {"short_name": "PDC Energy, Inc.", "long_name": "PDC Energy, Inc.", "summary": "PDC Energy, Inc., an independent exploration and production company, acquires, explores for, develops, and produces crude oil, natural gas, and natural gas liquids in the United States. The company's operations are primarily located in the Wattenberg Field in Colorado and the Delaware Basin in Texas. As of December 31, 2019, it owned interests in approximately 2,649 productive gross wells. The company was formerly known as Petroleum Development Corporation and changed its name to PDC Energy, Inc. in June 2012. PDC Energy, Inc. was founded in 1969 and is headquartered in Denver, Colorado.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Denver"}, "PE": {"short_name": "Parsley Energy, Inc.", "long_name": "Parsley Energy, Inc.", "summary": "Parsley Energy, Inc., an independent oil and natural gas company, engages in the acquisition, development, exploration, production, and sale of crude oil and natural gas properties in the Permian Basin in west Texas and Southeastern New Mexico. As of December 31, 2019, its acreage position consisted of 191,179 net acres, including 149,615 net acres in the Midland Basin and 41,564 net acres in the Delaware Basin; and operated 558.9 net acres of the horizontal wells and 723.1 net acres of the vertical wells, as well an estimated proved oil, natural gas, and natural gas liquid reserves of 592.3 MMBoe. The company was founded in 2008 and is headquartered in Austin, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Austin"}, "PED": {"short_name": "Pedevco Corp.", "long_name": "PEDEVCO Corp.", "summary": "PEDEVCO Corp., an oil and gas company, engages in the acquisition, development, and production of oil and natural gas assets in the United States. As of December 31, 2018, the company held approximately 23,441 net acres in the Permian Basin Asset located in Chaves and Roosevelt Counties, New Mexico; and approximately 11,948 net D-J Basin acres in D-J Basin Asset situated in Weld and Morgan Counties, Colorado. It had interests in 337 net wells in Permian Basin Asset; and 21.5 net wells in D-J Basin Asset. The company was formerly known as Blast Energy Services, Inc. and changed its name to PEDEVCO Corp. in July 2012. PEDEVCO Corp. is headquartered in Houston, Texas. PEDEVCO Corp. operates as a subsidiary of SK Energy LLC.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Houston"}, "PERS": {"short_name": "SandRidge Permian Trust", "long_name": "SandRidge Permian Trust", "summary": "SandRidge Permian Trust holds royalty interests in specified oil and natural gas properties in the Permian Basin located in Andrews County, Texas. The company was founded in 2011 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "PFNO": {"short_name": "PARAFIN CORP", "long_name": "ParaFin Corporation", "summary": "ParaFin Corporation, a development stage company, acquires and explores oil and gas properties in the United States. It primarily focuses on the acquisition of hydrocarbon concessions in the Republic of Paraguay. The company was founded in 1978 and is based in Reno, Nevada.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Reno"}, "PHX": {"short_name": "PHX Minerals Inc.", "long_name": "PHX Minerals Inc.", "summary": "PHX Minerals Inc. acquires, develops, and manages oil and natural gas properties in the United States. The company produces and sells natural gas, crude oil, and natural gas liquids. Its principal properties are located in Oklahoma, Arkansas, Texas, New Mexico, and North Dakota. As of September 30, 2020, the company owned perpetual ownership of 252,443 net mineral acres; leased 17,091 net acres; and held working interests and royalty interests in 6,510 producing oil and natural gas wells, as well as had 125 wells in the process of being drilled or completed. It sells its products to various purchasers, including pipeline and marketing companies. The company was formerly known as Panhandle Oil and Gas Inc. and changed its name to PHX Minerals Inc. in October 2020. PHX Minerals Inc. was founded in 1926 and is based in Oklahoma City, Oklahoma.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Oklahoma City"}, "PNK.F": {"short_name": "PIONEER NATURAL  DL-,01", "long_name": "Pioneer Natural Resources Company", "summary": "Pioneer Natural Resources Company operates as an independent oil and gas exploration and production company in the United States. The company explores for, develops, and produces oil, natural gas liquids (NGLs), and gas. It has operations primarily in the Permian Basin in West Texas. As of December 31, 2019, the company had proved undeveloped reserves and proved developed non-producing reserves of 39 million barrels of oil, 16 million barrels of NGLs, and 83 billion cubic feet of gas; and owned interests in 11 gas processing plants. Pioneer Natural Resources Company was founded in 1997 and is headquartered in Irving, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Irving"}, "PNRC": {"short_name": "PERMIER ENERGY CORP", "long_name": "Premier Energy Corporation", "summary": "Premier Energy Corporation acquires, explores, develops, and produces crude oil and natural gas in the Russian Federation. The company holds exploration and production license, and operates the North-Kopanskoye oilfield consisting of approximately 3,213 acres of concession area located to the southeast of the city of Orenburg. As of December 31, 2009, it had proved reserves of approximately 15,651 trillion barrels of oil equivalent. The company was founded in 2000 and is based in Dallas, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Dallas"}, "PNRG": {"short_name": "PrimeEnergy Resources Corporati", "long_name": "PrimeEnergy Resources Corporation", "summary": "PrimeEnergy Resources Corporation, an independent oil and natural gas company, through its subsidiaries, engages in acquiring, developing, and producing of oil and natural gas properties in the United States. It also acquires producing oil and gas properties through joint ventures with industry partners; and provides contract services to third parties, including well-servicing support operations, site-preparation, and construction services for oil and gas drilling and reworking operations. The company operates approximately 1,400 active wells and owns non-operating interests in approximately 800 additional wells primarily in Oklahoma, Texas, and West Virginia. The company was formerly known as PrimeEnergy Corporation and changed its name to PrimeEnergy Resources Corporation in December 2018. The company was founded in 1973 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Houston"}, "PQCF.F": {"short_name": "PETROTEQ ENERGY INC.", "long_name": "Petroteq Energy Inc.", "summary": "Petroteq Energy Inc., through its subsidiaries, engages in the oil sands mining and oil extraction operations in the United States. The company mines and extracts oil from tar sands. It holds rights to mine, extract, and produce oil and associated hydrocarbons and minerals from oil sands containing heavy oil and bitumen under mineral leases covering approximately 2,541.76 acres in the Asphalt Ridge area of Utah, including 1,229.82 acres held under the TMC Mineral Lease and an additional 833.03 and 478.91 acres, respectively, held under the State of Utah's School and Institutional Trust Land Administration Leases. The company also operates rights under five leases covering lands consisting of approximately 5,960 acres situated in Uintah, Wayne, and Garfield Counties, Utah. In addition, it is developing a blockchain-powered supply chain management platform for the oil and gas industry. The company was formerly known as MCW Energy Group Limited and changed its name to Petroteq Energy Inc. in May 2017. Petroteq Energy Inc. is based in Sherman Oaks, California.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Sherman Oaks"}, "PQE.V": {"short_name": "PETROTEQ ENERGY INC", "long_name": "Petroteq Energy Inc.", "summary": "Petroteq Energy Inc., through its subsidiaries, engages in the oil sands mining and oil extraction operations in the United States. The company mines and extracts oil from tar sands. It holds rights to mine, extract, and produce oil and associated hydrocarbons and minerals from oil sands containing heavy oil and bitumen under mineral leases covering approximately 2,541.76 acres in the Asphalt Ridge area of Utah, including 1,229.82 acres held under the TMC Mineral Lease and an additional 833.03 and 478.91 acres, respectively, held under the State of Utah's School and Institutional Trust Land Administration Leases. The company also operates rights under five leases covering lands consisting of approximately 5,960 acres situated in Uintah, Wayne, and Garfield Counties, Utah. In addition, it is developing a blockchain-powered supply chain management platform for the oil and gas industry. The company was formerly known as MCW Energy Group Limited and changed its name to Petroteq Energy Inc. in May 2017. Petroteq Energy Inc. is based in Sherman Oaks, California.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "VAN", "market": "ca_market", "country": "United States", "city": "Sherman Oaks"}, "PQEFF": {"short_name": "PETROTEQ ENERGY INC", "long_name": "Petroteq Energy Inc.", "summary": "Petroteq Energy Inc., through its subsidiaries, engages in the oil sands mining and oil extraction operations in the United States. The company mines and extracts oil from tar sands. It holds rights to mine, extract, and produce oil and associated hydrocarbons and minerals from oil sands containing heavy oil and bitumen under mineral leases covering approximately 2,541.76 acres in the Asphalt Ridge area of Utah, including 1,229.82 acres held under the TMC Mineral Lease and an additional 833.03 and 478.91 acres, respectively, held under the State of Utah's School and Institutional Trust Land Administration Leases. The company also operates rights under five leases covering lands consisting of approximately 5,960 acres situated in Uintah, Wayne, and Garfield Counties, Utah. In addition, it is developing a blockchain-powered supply chain management platform for the oil and gas industry. The company was formerly known as MCW Energy Group Limited and changed its name to Petroteq Energy Inc. in May 2017. Petroteq Energy Inc. is based in Sherman Oaks, California.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Sherman Oaks"}, "PRE.V": {"short_name": "PALEO RESOURCES INC", "long_name": "Paleo Resources, Inc.", "summary": "Paleo Resources, Inc., an oil and gas, and mineral exploration company, engages in the acquisition, exploration, and development of the oil and gas and precious and base metal properties in Canada and the United States. It holds a 50% interest in the Joffre D-3 B Oil Pool located in Alberta; and a 100% interest in the Burchell Lake property covering an area of 5,900 hectares located in the Shebandowan gold camp in Ontario. The company's Burchell Lake Property is prospective for gold, copper, and molybdenum minerals. It also develops and produces oil and gas assets in Polk and Tyler counties, Texas. The company was formerly known as Tanager Energy Inc. and changed its name to Paleo Resources, Inc. in April 2019. Paleo Resources, Inc. was founded in 1945 and is headquartered in San Antonio, Texas.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "VAN", "market": "ca_market", "country": "United States", "city": "San Antonio"}, "PRIEF": {"short_name": "PALEO RESOURCES INC", "long_name": "Paleo Resources, Inc.", "summary": "Paleo Resources, Inc., an oil and gas, and mineral exploration company, engages in the acquisition, exploration, and development of the oil and gas and precious and base metal properties in Canada and the United States. It holds a 50% interest in the Joffre D-3 B Oil Pool located in Alberta; and a 100% interest in the Burchell Lake property covering an area of 5,900 hectares located in the Shebandowan gold camp in Ontario. The company's Burchell Lake Property is prospective for gold, copper, and molybdenum minerals. It also develops and produces oil and gas assets in Polk and Tyler counties, Texas. The company was formerly known as Tanager Energy Inc. and changed its name to Paleo Resources, Inc. in April 2019. Paleo Resources, Inc. was founded in 1945 and is headquartered in San Antonio, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "San Antonio"}, "PROP": {"short_name": "PLEDGE PETROLEUM CORP", "long_name": "Pledge Petroleum Corp.", "summary": "Pledge Petroleum Corp. intends to produce renewable diesel fuel and biochar. The company is based in Maryville, Tennessee.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Maryville"}, "PRT": {"short_name": "PermRock Royalty Trust Trust", "long_name": "PermRock Royalty Trust", "summary": "PermRock Royalty Trust owns 80% net profits interest in the oil and natural gas production properties acquired by Boaz Energy II, LLC in Permian Basin, Texas. Its underlying properties consist of 22,997 net acres, which include 2,434 net acres on the Central Basin Platform of the Permian Basin in Hockley and Terry counties, Texas; 1,667 net acres on the Central Basin Platform of the Permian Basin in Terry and Cochran counties, Texas; 14,727 net acres on the Eastern Shelf of the Permian Basin in Glasscock, Schleicher, Stonewall, and Coke counties, Texas; and 4,169 net acres on the Central Basin Platform of the Permian Basin in Ward, Crane, Terry, and Ector counties, Texas. The company was founded in 2017 and is based in Fort Worth, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Fort Worth"}, "PSSS": {"short_name": "PUISSANT INDS INC", "long_name": "Puissant Industries, Inc.", "summary": "Puissant Industries, Inc. explores, develops, and produces oil and natural gas properties focusing on the onshore United States. The company holds oil and gas interests in the Raccoon Mountain, Wofford, Woodbine, and Rockholds Fields located in Clay and Whitley counties in Kentucky. It has 39 wells with an area of approximately 4,685 acres available for drilling and exploration. The company was formerly known as American Resource Management, Inc. and changed its name to Puissant Industries, Inc. in March 2011. Puissant Industries, Inc. was founded in 2009 and is based in London, Kentucky.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "London"}, "PSTRQ": {"short_name": "POSTROCK ENERGY CORPORATION", "long_name": "PostRock Energy Corporation", "summary": "PostRock Energy Corporation, an independent oil and gas company, engages in the acquisition, exploration, development, production, and gathering of crude oil and natural gas. It primarily focuses on the production of conventional oil and coal bed methane gas from its properties located in the Cherokee basin, a region in southeastern Kansas, northeastern Oklahoma, and central Oklahoma. The company also has minor oil and gas producing properties in the Appalachian basin. Its estimated proved reserves include 119.1 billion cubic feet of natural gas and 4.1 million barrels of oil. As of March 27, 2015, the company owned and operated approximately 3,000 wells and maintained approximately 2,200 miles of gas gathering lines primarily in the Cherokee Basin. PostRock Energy Corporation was founded in 1982 and is headquartered in Oklahoma City, Oklahoma. On December 21, 2018, the voluntary petition of PostRock Energy Corporation for reorganization under Chapter 11 was converted to Chapter 7. It had filed for Chapter 11 bankruptcy on April 1, 2016.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Oklahoma City"}, "PSUD": {"short_name": "PETROSUN INC", "long_name": "PetroSun, Inc.", "summary": "PetroSun, Inc., an exploration stage company, explores for, develops, and produces oil and gas properties. It also focuses on producing algae-to bio fuels, as well as offers oilfield services. The company was formerly known as PetroSun Drilling, Inc. and changed its name to PetroSun, Inc. in August 2006. PetroSun, Inc. is based in Phoenix, Arizona.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Phoenix"}, "PTAL.L": {"short_name": "PETROTAL CORPORATION COM SHS NP", "long_name": "PetroTal Corp.", "summary": "PetroTal Corp. engages in the exploration, appraisal, and development of crude oil and natural gas in Peru, South America. Its primary property is the Bretana oil field located in the Maranon Basin of northern Peru. The company was formerly known as Sterling Resources Ltd. and changed its name to PetroTal Corp. in June 2018. PetroTal Corp. is headquartered in Houston, Texas.", "currency": "GBp", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "LSE", "market": "gb_market", "country": "United States", "city": "Houston"}, "PTALF": {"short_name": "PETROTAL CORP", "long_name": "PetroTal Corp.", "summary": "PetroTal Corp. engages in the exploration, appraisal, and development of crude oil and natural gas in Peru, South America. Its primary property is the Bretana oil field located in the Maranon Basin of northern Peru. The company was formerly known as Sterling Resources Ltd. and changed its name to PetroTal Corp. in June 2018. PetroTal Corp. is headquartered in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "PTCO": {"short_name": "PETROGAS COMPANY", "long_name": "PetroGas Company", "summary": "PetroGas Company engages in the exploration and production of oil and natural gas. It has 7 oil wells in the Burns and Rogers leases covering an area of 714 acres located in Frio and Atascosa counties, Texas. The company was formerly known as America Resources Exploration, Inc. and changed its name to PetroGas Company in January 2016. PetroGas Company was founded in 2014 and is based in Houston, Texas. PetroGas Company is a subsidiary of Rise Fast Limited.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "PTRC": {"short_name": "PETRO RIVER OIL CORPORATION", "long_name": "Petro River Oil Corp.", "summary": "Petro River Oil Corp., an independent energy company, focuses on the exploration and development of conventional oil and gas assets. It primarily holds interests in the Mid-Continent Region in Oklahoma, including Osage County and Kay County, Oklahoma. The company is based in New York, New York.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "New York"}, "PVAC": {"short_name": "Penn Virginia Corporation", "long_name": "Penn Virginia Corporation", "summary": "Penn Virginia Corporation, an independent oil and gas company, engages in the onshore exploration, development, and production of crude oil, natural gas liquids, and natural gas in the United States. It primarily operates wells in the Eagle Ford Shale field in South Texas. As of December 31, 2019, it had total proved reserves of approximately 133 million barrels of oil equivalent; and 510 gross productive wells, as well as owned approximately 100,200 gross acres of leasehold and royalty interests. Penn Virginia Corporation was founded in 1882 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Houston"}, "PVAE.F": {"short_name": "PENN VIRGINIA CORP.DL-,01", "long_name": "Penn Virginia Corporation", "summary": "Penn Virginia Corporation, an independent oil and gas company, engages in the onshore exploration, development, and production of crude oil, natural gas liquids, and natural gas in the United States. It primarily operates wells in the Eagle Ford Shale field in South Texas. As of December 31, 2019, it had total proved reserves of approximately 133 million barrels of oil equivalent; and 510 gross productive wells, as well as owned approximately 100,200 gross acres of leasehold and royalty interests. Penn Virginia Corporation was founded in 1882 and is headquartered in Houston, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Houston"}, "PVL": {"short_name": "Permianville Royalty Trust Trus", "long_name": "Permianville Royalty Trust", "summary": "Permianville Royalty Trust operates a statutory trust. It owns a net profits interest representing the right to receive 80% of the net profits from the sale of oil and natural gas production from properties located in Texas, Louisiana, and New Mexico. The company was formerly known as Enduro Royalty Trust and changed its name to Permianville Royalty Trust in September 2018. Permianville Royalty Trust was founded in 2011 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Houston"}, "PVRS": {"short_name": "PROVIDENCE RESOURCES INC", "long_name": "Providence Resources, Inc.", "summary": "Providence Resources, Inc., an exploration stage company, engages in the acquisition, exploration, and development of oil and gas properties. The company is based in Austin, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Austin"}, "PXD": {"short_name": "Pioneer Natural Resources Compa", "long_name": "Pioneer Natural Resources Company", "summary": "Pioneer Natural Resources Company operates as an independent oil and gas exploration and production company in the United States. The company explores for, develops, and produces oil, natural gas liquids (NGLs), and gas. It has operations primarily in the Permian Basin in West Texas. As of December 31, 2019, the company had proved undeveloped reserves and proved developed non-producing reserves of 39 million barrels of oil, 16 million barrels of NGLs, and 83 billion cubic feet of gas; and owned interests in 11 gas processing plants. Pioneer Natural Resources Company was founded in 1997 and is headquartered in Irving, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Irving"}, "Q8Q.F": {"short_name": "QEP RESOURCES INC. DL-,01", "long_name": "QEP Resources, Inc.", "summary": "QEP Resources, Inc. operates as a crude oil and natural gas exploration and production company in the United States. The company conducts exploration and production activities in the Permian Basin in Western Texas; and Williston Basin in North Dakota. As of December 31, 2019, it had estimated proved reserves of approximately 382.3 million barrels of oil equivalent. The company sells oil, condensate, gas, and natural gas liquids to refiners, marketers, midstream service providers, wholesale marketers, industrial users, local distribution companies, and utility and other companies. QEP Resources, Inc. was incorporated in 2010 and is headquartered in Denver, Colorado.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Denver"}, "QEP": {"short_name": "QEP Resources, Inc.", "long_name": "QEP Resources, Inc.", "summary": "QEP Resources, Inc. operates as a crude oil and natural gas exploration and production company in the United States. The company conducts exploration and production activities in the Permian Basin in Western Texas; and Williston Basin in North Dakota. As of December 31, 2019, it had estimated proved reserves of approximately 382.3 million barrels of oil equivalent. The company sells oil, condensate, gas, and natural gas liquids to refiners, marketers, midstream service providers, wholesale marketers, industrial users, local distribution companies, and utility and other companies. QEP Resources, Inc. was incorporated in 2010 and is headquartered in Denver, Colorado.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Denver"}, "QOIL": {"short_name": "QUEST OIL CORPORATION", "long_name": "Quest Oil Corporation", "summary": "Quest Oil Corporation acquires, develops, produces, and explores crude oil and natural gas properties in United States and Canada. The company's oil and gas lands consist of land in Warner, South Taber, and Diamond regions of southern Alberta. The company was formerly known as GameState Entertainment, Inc. and changed its name to Quest Oil Corporation in September, 2004. Quest Oil Corporation was incorporated in 1999 and is based in Kerrville, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Kerrville"}, "RAX.F": {"short_name": "RANGE RES CORP.  DL-,01", "long_name": "Range Resources Corporation", "summary": "Range Resources Corporation operates as an independent natural gas, natural gas liquids (NGLs), and oil company in the United States. The company engages in the exploration, development, and acquisition of natural gas and oil properties. It holds interests in developed and undeveloped natural gas and oil leases in the Appalachian and North Louisiana regions of the United States. As of December 31, 2019, the company owned and operated 1,272 net producing wells and approximately 833,000 net acres under lease in the Appalachian region; and 409 net producing wells and approximately 105,000 net acres under lease in the North Louisiana region. It markets and sells natural gas, and NGLs to utilities, marketing and midstream companies, and industrial users; petrochemical end users, NGL distributors, and natural gas processors; and oil and condensate to crude oil processors, transporters, and refining and marketing companies. The company was formerly known as Lomak Petroleum, Inc. and changed its name to Range Resources Corporation in 1998. Range Resources Corporation was founded in 1976 and is headquartered in Fort Worth, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Fort Worth"}, "REI": {"short_name": "Ring Energy, Inc.", "long_name": "Ring Energy, Inc.", "summary": "Ring Energy, Inc., an exploration and production company, acquires, explores for, develops, and produces oil and natural gas in Texas and New Mexico. As of December 31, 2019, the company's proved reserves consisted of approximately 81.1 million barrel of oil equivalent. It also had interests in 18,372 net developed acres and 47,427 net undeveloped acres in Andrews and Gaines counties, Texas; 19,138 net developed acres and 860 net undeveloped acres in Culberson and Reeves counties, Texas; and 8,085 net developed acres and 28,514 net undeveloped acres in Gaines, Yoakum, Runnels, and Coke Counties, Texas and Lea County, New Mexico. It primarily sells its oil and natural gas production to end users, marketers, and other purchasers. The company was formerly known as Transglobal Mining Corp. and changed its name to Ring Energy, Inc. in March 2008. Ring Energy, Inc. was founded in 2004 and is headquartered in Midland, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Midland"}, "REOS": {"short_name": "REOSTAR ENERGY CORPORATION", "long_name": "ReoStar Energy Corp.", "summary": "ReoStar Energy Corporation engages in the exploration, development, and acquisition of oil and gas properties primarily in Texas. It owns approximately 9,000 acres of leasehold, which include 5,000 acres of exploratory and developmental prospects, as well as 4,000 acres of enhanced oil recovery prospects. The company was formerly known as Goldrange Resources, Inc. and changed its name to ReoStar Energy Corporation in November 2004. ReoStar Energy Corporation was incorporated in 2004 and is headquartered in Fort Worth, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Fort Worth"}, "RITE": {"short_name": "MINERALRITE CORP", "long_name": "MineralRite Corporation", "summary": "MineralRite Corporation engages in the acquisition, exploration, and development of mining opportunities in Utah. The company, through its subsidiary, Goldfield International, Inc., manufactures and sells alluvial gold, diamond, and other gem stone recovery equipment; and equipment for environmental clean-up projects, including barges, clarifiers, lead recovery systems, dryers, conveyors, and hoppers, as well as other mechanical equipment. The company was formerly known as Royal Quantum Group, Inc. and changed its name to MineralRite Corporation in October 2012. MineralRite Corporation was incorporated in 1996 and is based in Lindon, Utah.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Lindon"}, "RKOS": {"short_name": "ARKOSE ENERGY CORP", "long_name": "Arkose Energy Corp.", "summary": "Arkose Energy Corp. specializes in the production of oil and gas. It engages in the acquisition and development of oil and gas properties, primarily in Louisiana, New Mexico, Oklahoma, Texas, and Wyoming. Arkose Energy Corp. was formerly known as CanTex Energy Corporation and changed its name to Arkose Energy Corp. in June 2014. The company was incorporated in 2002 and is headquartered in Dallas, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Dallas"}, "ROYL": {"short_name": "ROYALE ENERGY INC", "long_name": "Royale Energy, Inc.", "summary": "Royale Energy, Inc. acquires, explores for, develops, produces, and sells oil and natural gas properties in the United States. Its principal operations are located in the Sacramento Basin and San Joaquin Basin in California, as well as in Utah, Texas, Oklahoma, Colorado, and Louisiana. Royale Energy, Inc. was founded in 1986 and is based in El Cajon, California.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "El Cajon"}, "ROYTL": {"short_name": "Pacific Coast Oil Trust", "long_name": "Pacific Coast Oil Trust", "summary": "Pacific Coast Oil Trust acquires and holds net profits and royalty interests in various oil and natural gas properties located in California. Its properties include Orcutt properties located in the Santa Maria Basin; and West Pico, East Coyote, and Sawtelle properties located in the Los Angeles Basin of California. As of December 31, 2018, the company had proved reserves of 19.0 million barrels of oil equivalent. Pacific Coast Oil Trust was founded in 2012 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "RRC": {"short_name": "Range Resources Corporation", "long_name": "Range Resources Corporation", "summary": "Range Resources Corporation operates as an independent natural gas, natural gas liquids (NGLs), and oil company in the United States. The company engages in the exploration, development, and acquisition of natural gas and oil properties. It holds interests in developed and undeveloped natural gas and oil leases in the Appalachian and North Louisiana regions of the United States. As of December 31, 2019, the company owned and operated 1,272 net producing wells and approximately 833,000 net acres under lease in the Appalachian region; and 409 net producing wells and approximately 105,000 net acres under lease in the North Louisiana region. It markets and sells natural gas, and NGLs to utilities, marketing and midstream companies, and industrial users; petrochemical end users, NGL distributors, and natural gas processors; and oil and condensate to crude oil processors, transporters, and refining and marketing companies. The company was formerly known as Lomak Petroleum, Inc. and changed its name to Range Resources Corporation in 1998. Range Resources Corporation was founded in 1976 and is headquartered in Fort Worth, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Fort Worth"}, "RSRV": {"short_name": "RESERVE PETROLEUM CO", "long_name": "The Reserve Petroleum Company", "summary": "The Reserve Petroleum Company engages in oil and natural gas exploration and development, and mineral properties management primarily in Texas, Oklahoma, Kansas, Arkansas, and South Dakota. As of December 31, 2019, the company had working interests in 22.52 net gas wells; and 25.59 net oil wells located in 7,732 net producing acres. It owns non-producing mineral interests of 88,239 net acres located in the north and south central United States; and has interests in approximately 945 producing properties. The Reserve Petroleum Company was founded in 1931 and is based in Oklahoma City, Oklahoma.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Oklahoma City"}, "SA2D.F": {"short_name": "SANDRIDGE ENERGY  DL-,001", "long_name": "SandRidge Energy, Inc.", "summary": "SandRidge Energy, Inc. engages in the exploration, development, and production of oil, natural gas, and natural gas liquids primarily in the Mid-Continent and North Park Basin of the United States. As of December 31, 2019, it had 1,013 net producing wells; and approximately 511,000 net acres under lease, as well as total estimated proved reserves of 89.9 million barrels of oil equivalent. The company is headquartered in Oklahoma City, Oklahoma. On May 16, 2016, SandRidge Energy, Inc. and its direct and indirect subsidiaries filed voluntary petitions for reorganization under Chapter 11 of the United States Bankruptcy Code in the United States Bankruptcy Court for the Southern District of Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Oklahoma City"}, "SAEC": {"short_name": "STARLIGHT ENERGY CORPORATION", "long_name": "Starlight Energy Corp.", "summary": "Starlight Energy Corporation operates as a technology-driven oil and gas production company in the United States. It also generates electricity from gas for the delivery into the electric grid. The company was incorporated in 1997 and is based in Littleton, Colorado.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Littleton"}, "SBOW": {"short_name": "SilverBow Resorces, Inc.", "long_name": "SilverBow Resources, Inc.", "summary": "SilverBow Resources, Inc., an energy company, engages in the exploration, development, and production of oil and gas from the Eagle Ford Shale in South Texas. As of December 31, 2019, it had proved reserves of 1,420 billion cubic feet of natural gas equivalent. The company was formerly known as Swift Energy Company and changed its name to SilverBow Resources, Inc. in May 2017. SilverBow Resources, Inc. was founded in 1979 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Houston"}, "SBR": {"short_name": "Sabine Royalty Trust", "long_name": "Sabine Royalty Trust", "summary": "Sabine Royalty Trust holds royalty and mineral interests in various oil and gas properties in the United States. Its royalty and mineral interests include landowner's royalties, overriding royalty interests, minerals, production payments, and other similar non-participatory interest in certain producing and proved undeveloped oil and gas properties located in Florida, Louisiana, Mississippi, New Mexico, Oklahoma, and Texas. The company was founded in 1982 and is based in Dallas, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Dallas"}, "SD": {"short_name": "SandRidge Energy, Inc.", "long_name": "SandRidge Energy, Inc.", "summary": "SandRidge Energy, Inc. engages in the exploration, development, and production of oil, natural gas, and natural gas liquids primarily in the Mid-Continent and North Park Basin of the United States. As of December 31, 2019, it had 1,013 net producing wells; and approximately 511,000 net acres under lease, as well as total estimated proved reserves of 89.9 million barrels of oil equivalent. The company is headquartered in Oklahoma City, Oklahoma. On May 16, 2016, SandRidge Energy, Inc. and its direct and indirect subsidiaries filed voluntary petitions for reorganization under Chapter 11 of the United States Bankruptcy Code in the United States Bankruptcy Court for the Southern District of Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Oklahoma City"}, "SDTTU": {"short_name": "SANDRIDGE MISSISSIPPIAN TR I SB", "long_name": "SandRidge Mississippian Trust I", "summary": "SandRidge Mississippian Trust I, a statutory trust, holds royalty interests in specified oil and natural gas properties located in the Mississippian formation in Alfalfa, Garfield, Grant, and Woods counties in Oklahoma. As of December 31, 2019, the company's properties comprised royalty interests in the initial wells; and 121 additional wells that were drilled and perforated by the company. SandRidge Mississippian Trust I was founded in 2010 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "SEI.V": {"short_name": "SINTANA ENERGY INC", "long_name": "Sintana Energy Inc.", "summary": "Sintana Energy Inc., an oil and natural gas exploration company, engages in the acquisition, exploration, development, production, and sale of crude oil and natural gas resources in Colombia. Its principal assets are private participation interests of 30% unconventional and 100% conventional interests in the hydrocarbon resources of VMM 37 Block, which covers 43,158 acres located in the Middle Magdalena Basin. The company was incorporated in 1994 and is headquartered in Dallas, Texas.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "VAN", "market": "ca_market", "country": "United States", "city": "Dallas"}, "SFPI": {"short_name": "SANTA FE PETE INC", "long_name": "Santa Fe Petroleum, Inc.", "summary": "Santa Fe Petroleum, Inc., an oil and gas exploration company, engages in the acquisition, development, production, and sale of oil and gas with properties in Texas and Oklahoma. The company is based in Allen, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Allen"}, "SGER": {"short_name": "STERLING ENERGY RESOURCES INC", "long_name": "Sterling Energy Resources Incorporated", "summary": "Sterling Energy Resources Incorporated engages in the acquisition, development, and production of oil and natural gas in the continental United States. It holds interests in the Permian Basin of Texas; Forest City Basin of Kansas; and the Sacramento and San Joaquin Basins of California. The company is headquartered in Overland Park, Kansas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Overland Park"}, "SGTN": {"short_name": "SOLIGEN TECHNOLOGIES INC", "long_name": "Soligen Technologies, Inc.", "summary": "Soligen Technologies, Inc., through its subsidiary, manufactures cast metal parts for automotive companies in the United States. The company offers engine blocks, cylinder heads, manifolds, and other metal parts involved in building and testing prototype automotive and aerospace engines. The company manufactures ceramic casting molds including functional engine blocks and golf club heads. The company was incorporated in 1988 and is based in Van Nuys, California.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Van Nuys"}, "SJL.F": {"short_name": "SM ENERGY CO.  DL-,01", "long_name": "SM Energy Company", "summary": "SM Energy Company, an independent energy company, engages in the acquisition, exploration, development, and production of crude oil and condensate, natural gas, and natural gas liquids in the state of Texas. As of December 31, 2019, the company had 462.0 million barrels of oil equivalent of estimated proved reserves; and working interests in 807 gross productive oil wells and 519 gross productive gas wells in the Midland Basin and South Texas. The company was formerly known as St. Mary Land & Exploration Company and changed its name to SM Energy Company in May 2010. SM Energy Company was founded in 1908 and is headquartered in Denver, Colorado.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Denver"}, "SJT": {"short_name": "San Juan Basin Royalty Trust", "long_name": "San Juan Basin Royalty Trust", "summary": "San Juan Basin Royalty Trust operates as an express trust in Texas. The company has a 75% net overriding royalty interest carved out of Southland's oil and natural gas interests (the subject interests) in properties located in the San Juan Basin in northwestern New Mexico. The subject interests consist of working interests, royalty interests, overriding royalty interests, and other contractual rights in 119,000 net producing acres in San Juan, Rio Arriba, and Sandoval Counties of northwestern New Mexico, as well as 826.3 net wells. BBVA USA serves as the trustee of the San Juan Basin Royalty Trust. The company was founded in 1980 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Houston"}, "SKPI": {"short_name": "SKY PETROLEUM INC", "long_name": "Sky Petroleum, Inc.", "summary": "Sky Petroleum, Inc. acquires, explores, develops, and produces oil and natural gas properties of others under arrangements in which the company finances the costs in exchange for interests in the oil or natural gas revenue generated by the properties. It has a production sharing contract with the Ministry of Economy, Trade and Energy of Albania for three exploration blocks, including Four, Five, and Dumre blocks in the Republic of Albania. The company was formerly known as Seaside Explorations, Inc. and changed its name to Sky Petroleum, Inc. in March 2005. Sky Petroleum, Inc. was founded in 2002 and is based in Dallas, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Dallas"}, "SM": {"short_name": "SM Energy Company", "long_name": "SM Energy Company", "summary": "SM Energy Company, an independent energy company, engages in the acquisition, exploration, development, and production of crude oil and condensate, natural gas, and natural gas liquids in the state of Texas. As of December 31, 2019, the company had 462.0 million barrels of oil equivalent of estimated proved reserves; and working interests in 807 gross productive oil wells and 519 gross productive gas wells in the Midland Basin and South Texas. The company was formerly known as St. Mary Land & Exploration Company and changed its name to SM Energy Company in May 2010. SM Energy Company was founded in 1908 and is headquartered in Denver, Colorado.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Denver"}, "SNDE": {"short_name": "Sundance Energy Inc.", "long_name": "Sundance Energy Inc.", "summary": "Sundance Energy Inc. operates as an onshore independent oil and natural gas company in North America. The company explores for, develops, and produces oil and natural gas. It focuses on operations on its 41,000 net acres in the Eagle Ford, Live Oak, Atascosa, La Salle, and McMullen counties, South Texas. Sundance Energy, Inc. is headquartered in Denver, Colorado.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Denver"}, "SPLM": {"short_name": "SENTRY PETROLEUM LTD", "long_name": "Sentry Petroleum Ltd", "summary": "Sentry Petroleum Ltd., an exploration stage company, acquires, explores, and develops oil and gas properties. It holds 100% interests in 4 exploration permits, including ATP 862, 864, 865, and 866 covering an area of approximately 6.9 million net acres located in the Adavale Basin, Queensland. The company was formerly known as Summit Exploration Inc. and changed its name to Sentry Petroleum Ltd. in December 2007. Sentry Petroleum Ltd. was founded in 2006 and is based in Denver, Colorado.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Denver"}, "SPND": {"short_name": "SPINDLETOP OIL & GAS CO TEX", "long_name": "Spindletop Oil & Gas Co.", "summary": "Spindletop Oil & Gas Co., an independent oil and gas company, engages in the acquisition, exploration, development, and production of oil and natural gas in Alabama, Arkansas, Louisiana, Oklahoma, New Mexico, and Texas, the United States. The company holds approximately 84,248 gross acres under lease in 14 states. As of December 31, 2019, its net proved crude oil and natural gas reserves were 228,747 barrels of oil and condensate; and 4.520 billion cubic feet of natural gas. The company is also involved in the rental of oilfield equipment. In addition, it owns various miles of pipelines located in Texas and other states, which are used for gathering natural gas, as well as transporting natural gas produced by the company and third parties. Further, the company engages in commercial real estate leasing business. It sells crude oil and natural gas to oil and gas companies, brokers, pipelines, and distributors, as well as oil and natural gas properties. The company was founded in 1985 and is headquartered in Dallas, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Dallas"}, "SPRN": {"short_name": "SUPERNOVA ENERGY INC", "long_name": "Supernova Energy, Inc.", "summary": "Supernova Energy, Inc. engages in the exploration and production of oil and gas properties primarily in Kansas. It has 87 oil, gas, and SWD wells with interests in 2,020 acres of leaseholds. The company holds a 50% working interest on the Monroe Lease, which has 2 producing wells with approximately 1200 feet deep. It is also involved in the exploration of precious minerals. The company was formerly known as Northumberland Resources, Inc. and changed its name to Supernova Energy, Inc. in October 2013. Supernova Energy, Inc. was founded in 2009 and is based in Rockville Centre, New York.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Rockville Centre"}, "SRLY": {"short_name": "SOUTHERN REALTY CO", "long_name": "Southern Realty Co.", "summary": "Southern Realty Co. leases its oil and gas mineral rights. The company owns approximately 40,000 gross (18,000 net) acres of mineral rights in seven counties in California. Southern Realty Co. was incorporated in 1949 and is based in La Jolla, California.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "La Jolla"}, "SSER": {"short_name": "SOUTHERN STAR ENERGY CORPORATIO", "long_name": "Southern Star Energy Corp.", "summary": "Southern Star Energy Corporation, a development stage company, engages in the oil and gas development activities. The company was formerly known as Gulf Biomedical Corporation and changed its name to Southern Star Energy Corporation in October 2007. Southern Star Energy Corporation was incorporated in 1988 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "STDE": {"short_name": "STANDARD ENERGY CORP", "long_name": "Standard Energy Corp.", "summary": "Standard Energy Corporation engages in the acquisition of unproven oil and gas leaseholds with the intent of reselling or drilling; and developing such leaseholds with third-parties. It acquires primarily federal oil and gas leaseholds. The company also obtains leases through purchases in competitive bidding programs offered by various state agencies, principally the states of Utah and Wyoming. Standard Energy Corporation retains a royalty interest, ranging from 1% to 6% in various leaseholds that it resells. The company, through its wholly owned subsidiary, Petroleum Investment Company, also offers various geologic lease evaluation services; and provides information relating to geologic data, recommendations, and reports with respect to leaseholds offered in the leasing programs. Standard Energy Corporation also sells information with respect to individual oil and gas properties throughout the Rocky Mountain area, as well as offers oil and gas mapping services about properties located in the Rocky Mountain region. Further, it engages in the commercial development of its Â\u0091Biofuel Technologies', which are designed to solve the problem of disposing of municipal solid waste, through the recycle of the Â\u0091paper waste' in municipal waste into useful products, such as ethanol transportation fuels and fermentation lignin turbine fuels. The company was founded in 1978 and is headquartered in Salt Lake City, Utah.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Salt Lake City"}, "STSC": {"short_name": "START SCIENTIFIC INC", "long_name": "Start Scientific, Inc.", "summary": "Start Scientific, Inc. engages in the exploration, development, and production of oil and gas interests in the United States. It holds working interests in various oil and gas leases located in Yazoo County, Mississippi in the Pickens field. The company was formerly known as Secure Netwerks, Inc. and changed its name to Start Scientific, Inc. in November 2011. Start Scientific, Inc. was founded in 2004 and is based in Oklahoma City, Oklahoma.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Oklahoma City"}, "STTX": {"short_name": "STRATEX OIL & GAS HOLDINGS INC", "long_name": "Stratex Oil & Gas Holdings, Inc.", "summary": "Stratex Oil & Gas Holdings, Inc., an independent energy company, focuses on the acquisition, exploitation, and development of crude oil in Kansas and Texas, as well as non-operated working interests in North Dakota, Montana, Utah, Colorado, and Kansas. The company is also involved in the sale of oil and gas. As of March 31, 2015, it owned an interest in 86 wells, as well as holds approximately 35,317 net leasehold acres in Sheridan, Montana; Williams, Billings, Divide, Mountrail, and Stark Counties, North Dakota; and Weld County, Colorado, Central Kansas, Central Utah and Zavala County, Texas. The company was formerly known as Poway Muffler and Brake, Inc. and changed its name to Stratex Oil & Gas Holdings, Inc. in May 2012. Stratex Oil & Gas Holdings, Inc. is based in Salt Lake City, Utah.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Salt Lake City"}, "SVSE": {"short_name": "SILVER STAR ENERGY INC", "long_name": "Silver Star Energy, Inc.", "summary": "Silver Star Energy, Inc. explores and develops oil and natural gas reserves in North America. The company holds interest in the Evi prospect in northern Alberta; and interests in the Verdigris Lake prospect located in southeastern Alberta, Canada. It also owns interest in the North Franklin prospect located in Sacramento county, California. Silver Star Energy, Inc. was formerly known as Movito Holdings Ltd. and changed its name to Silver Star Energy, Inc. in December 2003. The company was founded in 2002 and is based in Beverly Hills, California.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Beverly Hills"}, "SWN": {"short_name": "Southwestern Energy Company", "long_name": "Southwestern Energy Company", "summary": "Southwestern Energy Company, an independent energy company, engages in the exploration, development, and production of natural gas, oil, and natural gas liquids (NGLs) in the United States. It operates through Exploration and Production, and Marketing segments. The company focuses on the development of unconventional natural gas reservoirs located in Pennsylvania and West Virginia. As of December 31, 2019, it had approximately 173,994 net acres in Northeast Appalachia; and approximately 287,693 net acres in Southwest Appalachia. The company's estimated proved natural gas, oil, and NGLs reserves comprise 12,721 billion cubic feet of natural gas equivalent (Bcfe); and 929 Bcfe of proved undeveloped reserves. It also engages in marketing of natural gas, oil, and NGLs. It serves energy companies, utilities, and industrial purchasers of natural gas. Southwestern Energy Company was founded in 1929 and is headquartered in Spring, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Spring"}, "T7UA.F": {"short_name": "TENGASCO INC.NEW  DL-,001", "long_name": "Tengasco, Inc.", "summary": "Tengasco, Inc., together with its subsidiaries, explores for and produces oil and natural gas in the United States. It primarily holds interests in the oil and gas properties located in Kansas. As of December 31, 2019, the company had 174 producing oil wells, 13 shut-in wells, and 37 active disposal wells. The company was formerly known as Onasco Companies, Inc. and changed its name to Tengasco, Inc. in 1995. Tengasco, Inc. was founded in 1916 and is headquartered in Greenwood Village, Colorado.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Greenwood Village"}, "TALO": {"short_name": "Talos Energy, Inc.", "long_name": "Talos Energy Inc.", "summary": "Talos Energy Inc., an independent exploration and production company, focuses on the exploration and production of oil and natural gas properties in the United States Gulf of Mexico and offshore Mexico. The company was founded in 2011 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Houston"}, "TCEC": {"short_name": "TRANSCOASTAL CORP", "long_name": "TransCoastal Corporation", "summary": "TransCoastal Corporation, an energy development company, engages in the acquisition, exploration, development, and production of oil and natural gas properties. It holds interests in approximately 100 acquired or divested wells; and 200 undeveloped locations covering an area of approximately 6000 acres of leased oil and gas property located primarily in the panhandle area of west Texas. The company was founded in 1998 and is based in Dallas, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Dallas"}, "TCRRF": {"short_name": "TERRACE ENERGY CORP", "long_name": "Terrace Energy Corp.", "summary": "Terrace Energy Corp. engages in the acquisition, exploration, and development of conventional onshore oil and gas properties in the United States. It has an option to acquire a 50% working interest in the Maverick County project covering approximately 147,000 gross mineral acres located in Maverick County, Texas. The company was formerly known as Terrace Resources Inc. and changed its name to Terrace Energy Corp. in June 2011. Terrace Energy Corp. was incorporated in 2006 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "TELL": {"short_name": "Tellurian Inc.", "long_name": "Tellurian Inc.", "summary": "Tellurian Inc. engages in the natural gas business worldwide. The company is developing a portfolio of natural gas production, liquefied natural gas (LNG) marketing, and infrastructure assets that includes an approximately 27.6 million tons per annum LNG terminal facility and an associated pipeline in southwest Louisiana. As of February 24, 2020, it owned interests in approximately 10,260 net acres and 67 producing wells located in the Haynesville Shale trend of north Louisiana. The company was founded in 2016 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NCM", "market": "us_market", "country": "United States", "city": "Houston"}, "TGC": {"short_name": "Tengasco, Inc.", "long_name": "Tengasco, Inc.", "summary": "Tengasco, Inc., together with its subsidiaries, explores for and produces oil and natural gas in the United States. It primarily holds interests in the oil and gas properties located in Kansas. As of December 31, 2019, the company had 174 producing oil wells, 13 shut-in wells, and 37 active disposal wells. The company was formerly known as Onasco Companies, Inc. and changed its name to Tengasco, Inc. in 1995. Tengasco, Inc. was founded in 1916 and is headquartered in Greenwood Village, Colorado.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Greenwood Village"}, "TNEN": {"short_name": "TRUE NORTH ENERGY CORP", "long_name": "True North Energy Corp.", "summary": "True North Energy Corp. acquires, explores, develops, and produces oil and gas properties in the United States. The company also provides shoes through its stores located in Europe, Japan, and the United States, as well as through online. True North Energy Corp. was formerly known as Ameriprint International Ltd. and changed its name to True North Energy Corp. in January 2006. The company was incorporated in 2004 and is based in Spring, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Spring"}, "TOPZ": {"short_name": "TOPAZ RESOURCES INC", "long_name": "Topaz Resources, Inc.", "summary": "Topaz Resources, Inc. operates as an independent oil and gas company. It focuses on production, acquisition, and developmental drilling opportunities within proven producing areas of north, central, and west Texas. The company was formerly known as Kids Germ Defense Corp. and changed its name to Topaz Resources, Inc. in April 2010. Topaz Resources, Inc. was founded in 2009 and is headquartered in Denton, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Denton"}, "TPL": {"short_name": "Texas Pacific Land Corporation", "long_name": "Texas Pacific Land Corporation", "summary": "Texas Pacific Land Corporation holds title to tracts of land in the state of Texas. The company operates through two segments, Land and Resource Management, and Water Service and Operations. The Land and Resource Management segment manages various land and related resources in West Texas. This segment has oil and gas royalty interests; enter into easement contracts covering activities, such as oil and gas pipelines and subsurface wellbore easements; and leases land. It owns approximately 880,000 acres of land comprising various separate tracts located in 19 counties in the West Texas. This segment also owns a 1/128th nonparticipating perpetual oil and gas royalty interest under 85,000 acres of land, as well as a 1/16th nonparticipating perpetual oil and gas royalty interest under 371,000 acres of land in the western part of Texas; and oil and gas royalty interests in approximately 4,000 net royalty acres. The Water Service and Operations segment offers water sourcing, produced-water gathering/treatment, infrastructure development, disposal solutions, water tracking, analytics, and well testing services. Texas Pacific Land Trust was founded in 1888 and is headquartered in Dallas, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Dallas"}, "TRCH": {"short_name": "Torchlight Energy Resources, In", "long_name": "Torchlight Energy Resources, Inc.", "summary": "Torchlight Energy Resources, Inc., through its subsidiaries, engages in the acquisition, exploration, exploitation, and/or development of oil and natural gas properties in the United States. As of December 31, 2019, it had interests in four oil and gas projects, including the Orogrande project in Hudspeth County, Texas; Hazel project in Sterling, Tom Green, and Irion Counties, Texas; Winkler project in Winkler County, Texas; and Hunton wells in partnership with Husky Ventures in central Oklahoma. The company was founded in 2010 and is headquartered in Plano, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NCM", "market": "us_market", "country": "United States", "city": "Plano"}, "TRKX": {"short_name": "TREK RESOURCES INC", "long_name": "Trek Resources, Inc.", "summary": "Trek Resources, Inc., an independent energy company, engages in the exploration, development, exploitation, and acquisition of onshore oil and natural gas properties principally in the United States. The company was formerly known as McGowen Resources Company, Inc. and changed its name to Trek Resources, Inc. in 2001. Trek Resources is based in Dallas, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Dallas"}, "TRSI": {"short_name": "TROPHY RESOURCES INC", "long_name": "Trophy Resources, Inc.", "summary": "Trophy Resources, Inc. operates as an independent natural resource company in North America. Its oil interests are in the Fort Worth Basin in central Texas and the Casper Arch/Wind River Basin in Wyoming. Trophy Resources has a joint venture partnership with Russell Industries, Inc. and American Uranium Mining Company for developing the companies' commercial holdings in uranium, oil, and natural gas. The company was founded in 1997 and is based in Alpharetta, Georgia.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Alpharetta"}, "TRXO": {"short_name": "COLUMBINE VALLEY RESOURCES INC", "long_name": "Columbine Valley Resources, Inc.", "summary": "Columbine Valley Resources, Inc. engages in the acquisition, exploration, and development of oil and gas properties in the United States. The company owns various properties, which are primarily located in the Rocky Mountain region of Wyoming, as well as Nebraska. Columbine Valley Resources, Inc. is headquartered in Broomfield, Colorado.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Broomfield"}, "TTEN": {"short_name": "TITAN ENERGY LLC", "long_name": "Titan Energy, LLC", "summary": "Titan Energy, LLC,an integrated energy drilling and production company, develops, acquires, and manages oil and gas properties. It owns the Mississippi Lime and Hunton located in northwestern Oklahoma; Utica Shale in eastern Ohio; Black Warrior Basin located in central Alabama; and Eagle Ford Shale located in southern Texas. The company has 1 Tcfe of proved reserves and an interest in approximately 14,000 producing wells in 17 states. It also sponsor of tax-advantaged direct investment natural gas and oil partnerships. Titan Energy, LLC was founded in 2011 and is headquartered in Fort Worth, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Fort Worth"}, "TTYP": {"short_name": "TRINITY PETROLEUM TRUST", "long_name": "Trinity Petroleum Trust", "summary": "Trinity Petroleum Trust operates as a royalty trust that owns oil and gas properties in the United States. The company is based in Austin, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Austin"}, "TXHE": {"short_name": "TEXHOMA ENERGY INC", "long_name": "Texhoma Energy, Inc.", "summary": "Texhoma Energy, Inc. engages in the acquisition, exploration, and production of crude oil and natural gas. It primarily focuses on south Louisiana and east Texas, including near-shore Gulf of Mexico. The company acquires and holds royalty and non-operating working interests in properties located in Texas. Texhoma Energy, Inc. was formerly known as Make Your Move, Inc and changed its name to Texhoma Energy, Inc.in September 2004. The company was founded in 1998 and is based in Spring, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Spring"}, "TXSO": {"short_name": "TEXAS SOUTH ENERGY INC", "long_name": "Texas South Energy, Inc.", "summary": "Texas South Energy, Inc. engages in the business of exploring for, drilling, and producing oil and gas. As of April 1, 2019, it owned 12 blocks in 9 offshore prospects in the Gulf of Mexico, as well as oil and gas interests in Texas and Louisiana. The company was formerly known as Inka Productions Corp. and changed its name to Texas South Energy, Inc. in November 2013. Texas South Energy, Inc. was founded in 2010 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "TZR.V": {"short_name": "TERRACE ENERGY CORP", "long_name": "Terrace Energy Corp.", "summary": "Terrace Energy Corp. engages in the acquisition, exploration, and development of conventional onshore oil and gas properties in the United States. It has an option to acquire a 50% working interest in the Maverick County project covering approximately 147,000 gross mineral acres located in Maverick County, Texas. The company was formerly known as Terrace Resources Inc. and changed its name to Terrace Energy Corp. in June 2011. Terrace Energy Corp. was incorporated in 2006 and is headquartered in Houston, Texas.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "VAN", "market": "ca_market", "country": "United States", "city": "Houston"}, "UAPC": {"short_name": "UNITED AMERICAN PETROLEUM CORP", "long_name": "United American Petroleum Corp.", "summary": "United American Petroleum Corp., together with its subsidiaries, engages in the acquisition, exploration, development, and production of oil and gas properties in the United States. The company owns 100% working interests in the Marcee 1 Tract property that covers an area of approximately 112 acres located in Gonzalez County; and the Hector Lozano Tract, which covers an area of approximately 110 acres located in Texas. It also holds oil and gas interests in the Welder, Walker Smith, Merrick Gabriel and Rosser, McKenzie State Well, and McKinney interests, as well as in the Baily, Rogers, and Fahn interests located in Texas. Further, it provides operational services to third party well owners in Austin, Texas. United American Petroleum Corp. was founded in 2009 and is based in Austin, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Austin"}, "UD1P.SG": {"short_name": "Pedevco Corp. Registered Shares", "long_name": "PEDEVCO Corp.", "summary": "PEDEVCO Corp., an oil and gas company, engages in the acquisition, development, and production of oil and natural gas assets in the United States. As of December 31, 2018, the company held approximately 23,441 net acres in the Permian Basin Asset located in Chaves and Roosevelt Counties, New Mexico; and approximately 11,948 net D-J Basin acres in D-J Basin Asset situated in Weld and Morgan Counties, Colorado. It had interests in 337 net wells in Permian Basin Asset; and 21.5 net wells in D-J Basin Asset. The company was formerly known as Blast Energy Services, Inc. and changed its name to PEDEVCO Corp. in July 2012. PEDEVCO Corp. is headquartered in Houston, Texas. PEDEVCO Corp. operates as a subsidiary of SK Energy LLC.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "STU", "market": "dr_market", "country": "United States", "city": "Houston"}, "UNGS": {"short_name": "SYLIOS CORP", "long_name": "Sylios Corp", "summary": "Sylios Corp engages in the exploration, development, and production of oil and natural gas properties in the United States. The company holds leasehold interests that cover an area of approximately 4,600 acres in South Central Kentucky, as well as interests in 19 oil and gas wells. It also invests in equities and corporate debts; and develops products utilized for the medical and recreational marijuana industry, as well as engages in real estate development activities. The company was formerly known as US Natural Gas Corp. and changed its name to Sylios Corp in June 2014. Sylios Corp was founded in 2008 and is based in St. Petersburg, Florida.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "St. Petersburg"}, "USEG": {"short_name": "U.S. Energy Corp.", "long_name": "U.S. Energy Corp.", "summary": "U.S. Energy Corp., an independent energy company, focuses on the acquisition, exploration, and development of oil and natural gas properties in the United States. It holds interests in various oil and gas properties primarily in North Dakota and South Texas. The company was founded in 1966 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Houston"}, "USS.F": {"short_name": "MARATHON OIL  DL 1", "long_name": "Marathon Oil Corporation", "summary": "Marathon Oil Corporation operates as an independent exploration and production company in the United States and Equatorial Guinea. The company engages in the exploration, production, and marketing of crude oil and condensate, natural gas liquids, and natural gas; and the production and marketing of products manufactured from natural gas, such as liquefied natural gas and methanol, as well as owns and operates 32 central gathering and treating facilities and the Sugarloaf gathering system, a 42-mile natural gas pipeline through Karnes and Atascosa Counties. As of December 31, 2019, it had estimated proved developed reserves totaling 721 million barrels of oil equivalent (mmboe); and estimated proved undeveloped reserves totaling 484 mmboe. The company was formerly known as USX Corporation and changed its name to Marathon Oil Corporation in July 2001. Marathon Oil Corporation was founded in 1887 and is headquartered in Houston, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Houston"}, "UVSE": {"short_name": "UNIVERSAL ENERGY CORPORATION", "long_name": "Universal Energy Corp.", "summary": "Universal Energy Corp., an independent energy company, engages in the acquisition, exploration, development, and production of crude oil and natural gas in the United States and Canada. It has 13 oil and gas lease projects. The company was founded in 2002 and is based in Lake Mary, Florida.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Lake Mary"}, "UWV.F": {"short_name": "W+T OFFSHORE INC.DL-00001", "long_name": "W&T Offshore, Inc.", "summary": "W&T Offshore, Inc., an independent oil and natural gas producer, engages in the acquisition, exploration, and development of oil and natural gas properties in the Gulf of Mexico. The company sells crude oil, natural gas liquids, and natural gas. It holds working interests in approximately 51 offshore fields in federal and state waters. The company also owns interests in approximately 146 offshore structures. It has interests in offshore leases covering approximately 550,000 net acres spanning across the Outer Continental Shelf off the coasts of Louisiana, Texas, Mississippi, and Alabama. As of December 31, 2019, its total proved reserves were 157.4 million barrels of oil equivalent. The company was founded in 1983 and is headquartered in Houston, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Houston"}, "VAW.F": {"short_name": "VAALCO EN. INC.  DL-,10", "long_name": "VAALCO Energy, Inc.", "summary": "VAALCO Energy, Inc., an independent energy company, acquires, explores for, develops, and produces crude oil and natural gas. The company holds Etame production sharing contract related to the Etame Marin block located offshore in the Republic of Gabon, West Africa. It also owns interests in an undeveloped block offshore Equatorial Guinea, West Africa. VAALCO Energy, Inc. was founded in 1985 and is headquartered in Houston, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Houston"}, "VBHI": {"short_name": "VERDE BIO HLDGS INC", "long_name": "Verde Bio Holdings, Inc.", "summary": "Verde Bio Holdings, Inc. engages in the oil and gas exploration and investment business. The company was formerly known as Appiphany Technologies Holdings Corp. and changed its name to Verde Bio Holdings, Inc. in May 2020. Verde Bio Holdings, Inc. was incorporated in 2010 and is based in Frisco, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Frisco"}, "VCYE": {"short_name": "VELOCITY ENERGY INC", "long_name": "Velocity Energy Inc.", "summary": "Velocity Energy Inc., an independent energy company, engages in the acquisition, exploration, development, and production of oil and natural gas. The company's operations are located in Matagorda Bay, Calhoun County, Texas. It also focuses on the exploration of oil and natural gas in the Appalachian Basin. The company was formerly known as Sonterra Resources, Inc. and changed its name to Velocity Energy Inc. in March 2009. Velocity Energy Inc. is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "VIVK": {"short_name": "VIVAKOR INC", "long_name": "Vivakor, Inc.", "summary": "Vivakor, Inc. operates, acquires, and develops clean energy technologies and environmental solutions with a focus on soil remediation in the United States and Kuwait. It specializes in the remediation of soil and the extraction of hydrocarbons, such as oil, from properties contaminated by or laden with heavy crude oil and other hydrocarbon-based substances. The company was founded in 2006 and is based in South Salt Lake City, Utah.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "South Salt Lake City"}, "VKIN": {"short_name": "VIKING ENERGY GROUP INC", "long_name": "Viking Energy Group, Inc.", "summary": "Viking Energy Group, Inc. engages in the acquisition, exploration, development, and production of oil and natural gas properties in North America. The company owns oil and gas leases in Kansas, Missouri, Texas, Louisiana, and Mississippi. The company was formerly known as Viking Investments Group, Inc. and changed its name to Viking Energy Group, Inc. in March 2017. Viking Energy Group, Inc. was incorporated in 1989 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "VOC": {"short_name": "VOC Energy Trust Units of Benef", "long_name": "VOC Energy Trust", "summary": "VOC Energy Trust acquires and holds a term net profits interest of the net proceeds from production and sale of the interests in oil and natural gas properties in the states of Kansas and Texas. The company has an 80% term net profits interest of the net proceeds on the underlying properties. As of December 31, 2019, its underlying properties had interests in 475.9 net producing wells and 52,233.0 net acres; and had proved reserves of approximately 3.2 million barrels of oil equivalent (MMBoe) attributable to the portion of the Kansas underlying properties, and approximately 5.7 MMBoe attributable to the Texas underlying properties. VOC Energy Trust was founded in 2010 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Houston"}, "VRY.V": {"short_name": "PETRO VICTORY ENERGY CORP", "long_name": "Petro-Victory Energy Corp.", "summary": "Petro-Victory Energy Corp., through its subsidiaries, engages in petroleum and natural gas exploration, and other energy activities in Latin America. It holds working interests in 28 licenses totaling an area of 168,433 acres in 4 oil producing basins in Brazil. The company also has a net profits interest in a 2-million-acre concession in Paraguay. Petro-Victory Energy Corp. was founded in 2014 and is headquartered in Fort Worth, Texas.", "currency": "CAD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "VAN", "market": "ca_market", "country": "United States", "city": "Fort Worth"}, "VTXB": {"short_name": "VORTEX BRANDS CO", "long_name": "Vortex Brands Co.", "summary": "Vortex Brands Co., doing business as Vortex Green Energy, provides Phase Angle Synchronization (PAS) equipment to electric utilities in California. PAS captures the unusable electricity before it travels back to the utility and recycles it to be usable again to the end-user. It is also developing the tracking and auditing protocols for the environmental impact of PAS systems. The company is based in Sacramento, California.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Sacramento"}, "WCYN": {"short_name": "WEST CANYON ENERGY CORPORATION", "long_name": "West Canyon Energy Corp.", "summary": "West Canyon Energy Corp., an exploration stage company, engages in the exploration and production of oil and gas properties in Colombia. It primarily owns a 16% participation stake in the Buenavista block, an exploration project located to the northeast of Bogota, Colombia. The company was formerly known as PetroSouth Energy Corp. and changed its name to West Canyon Energy Corp. in April 2008. West Canyon Energy Corp. was founded in 2004 and is based in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "WHT2.F": {"short_name": "WHITING PETR. NEW DL-,001", "long_name": "Whiting Petroleum Corporation", "summary": "Whiting Petroleum Corporation, an independent oil and gas company, engages in the acquisition, exploration, development, and production of crude oil, natural gas, and natural gas liquids primarily in the Rocky Mountains region of the United States. The company sells its oil and gas production to end users, marketers, and other purchasers. As of December 31, 2019, it had interests in 2,171 net productive wells on approximately 523,600 net developed acres, as well as total estimated proved reserves of 485.4 million barrels of oil equivalent. The company was founded in 1980 and is headquartered in Denver, Colorado.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Denver"}, "WHZT": {"short_name": "WHITING USA TR II", "long_name": "Whiting USA Trust II", "summary": "Whiting USA Trust II holds a term net profits interest in the oil and gas producing properties located in the Permian Basin, Rocky Mountains, Gulf Coast, and Mid-Continent regions. As of December 31, 2019, its oil and gas properties included interests in approximately 368.3 net producing oil and natural gas wells located in 44 predominately mature fields with established production profiles in 10 states. The company was founded in 2011 and is based in Houston, Texas. Whiting USA Trust II is a subsidiary of Whiting Petroleum Corporation.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "WKLN": {"short_name": "WALKER LANE EXPLORATION INC", "long_name": "Walker Lane Exploration, Inc.", "summary": "Walker Lane Exploration, Inc. focuses on the early-stage exploration of gold and silver prospects within the prolific Walker Lane Belt of Nevada. Its properties include the Trinity property that consists of 24 claims located in Churchill County; the Pyramid property, which consists of 10 claims located in Washoe County; and the Paradise Property that consists of 2 claim blocks located in the historic Paradise Peak Mining District. The company was incorporated in 2007 and is based in Lakewood, Colorado.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Lakewood"}, "WLL": {"short_name": "Whiting Petroleum Corporation", "long_name": "Whiting Petroleum Corporation", "summary": "Whiting Petroleum Corporation, an independent oil and gas company, engages in the acquisition, exploration, development, and production of crude oil, natural gas, and natural gas liquids primarily in the Rocky Mountains region of the United States. The company sells its oil and gas production to end users, marketers, and other purchasers. As of December 31, 2019, it had interests in 2,171 net productive wells on approximately 523,600 net developed acres, as well as total estimated proved reserves of 485.4 million barrels of oil equivalent. The company was founded in 1980 and is headquartered in Denver, Colorado.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Denver"}, "WLL1.MX": {"short_name": "WHITING PETROLEUM CORP", "long_name": "Whiting Petroleum Corporation", "summary": "Whiting Petroleum Corporation, an independent oil and gas company, engages in the acquisition, exploration, development, and production of crude oil, natural gas, and natural gas liquids primarily in the Rocky Mountains region of the United States. The company sells its oil and gas production to end users, marketers, and other purchasers. As of December 31, 2019, it had interests in 2,171 net productive wells on approximately 523,600 net developed acres, as well as total estimated proved reserves of 485.4 million barrels of oil equivalent. The company was founded in 1980 and is headquartered in Denver, Colorado.", "currency": "MXN", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Denver"}, "WPE.F": {"short_name": "WPX ENERGY  CL.A  DL -,01", "long_name": "WPX Energy, Inc.", "summary": "WPX Energy, Inc., an independent oil and natural gas exploration and production company, engages in the exploitation and development of unconventional properties in the United States. It produces oil, natural gas, and natural gas liquids. The company operates 688 wells and owns interests in 787 wells covering an area of approximately 122,000 net acres located in Delaware Basin, Texas, and New Mexico; and operates 404 wells and owns interests in 104 wells that covers an area of approximately 87,000 net acres situated in the Williston Basin, North Dakota. As of December 31, 2019, it had proved reserves of 528 million barrels of oil equivalent. The company was founded in 1983 and is headquartered in Tulsa, Oklahoma. As of January 7, 2021, WPX Energy, Inc. operates as a subsidiary of Devon Energy Corporation.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Tulsa"}, "WTI": {"short_name": "W&T Offshore, Inc.", "long_name": "W&T Offshore, Inc.", "summary": "W&T Offshore, Inc., an independent oil and natural gas producer, engages in the acquisition, exploration, and development of oil and natural gas properties in the Gulf of Mexico. The company sells crude oil, natural gas liquids, and natural gas. It holds working interests in approximately 51 offshore fields in federal and state waters. The company also owns interests in approximately 146 offshore structures. It has interests in offshore leases covering approximately 550,000 net acres spanning across the Outer Continental Shelf off the coasts of Louisiana, Texas, Mississippi, and Alabama. As of December 31, 2019, its total proved reserves were 157.4 million barrels of oil equivalent. The company was founded in 1983 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Houston"}, "WTXR": {"short_name": "WEST TEXAS RESOURCES INC", "long_name": "West Texas Resources, Inc.", "summary": "West Texas Resources, Inc. acquires, explores for, and develops oil and gas properties in North America. The company holds a 50% working interest in non-operating leases covering approximately 1,070 gross mineral acre leases in a property located in Hale County, Texas; 1% working interest in an oil prospect located in Floyd County, Texas; 25% working interest in oil and gas properties located in Gregg County, Texas; and 25% working interest in an East Texas oil and gas property. It also holds a 100% interest in Kiowa properties located in North Dakota, Florida, Illinois, and Kentucky. The company was formerly known as Texas Resources Energy, Inc. and changed its name to West Texas Resources, Inc. in June 2011. West Texas Resources, Inc. was founded in 2010 and is headquartered in Frisco, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Frisco"}, "XBOR": {"short_name": "CROSS BORDER RESOURCES INC", "long_name": "Cross Border Resources, Inc.", "summary": "Cross Border Resources, Inc., an independent natural gas and oil company, engages in the acquisition, exploration, development, and exploitation of natural gas and oil reserves in North America. The company focuses on the southeastern New Mexico. It owns approximately 865,893 gross mineral and lease acres in New Mexico. The company is headquartered in Dallas, Texas. Cross Border Resources, Inc. is a subsidiary of Red Mountain Resources, Inc.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Dallas"}, "XCPT": {"short_name": "XCANA PETROLEUM CORPORATION", "long_name": "XCana Petroleum Corporation", "summary": "XCana Petroleum Corporation, an oil and gas company, is engaged in exploiting oil and gas reserves in the Western Canadian Sedimentary basin. The company also, through its subsidiaries, is engaged in computer system integration business; reselling midrange and personal computer systems, and IBM's operating system software and utilities in Colombia; providing Microsoft Solutions; and reselling telecommunications products and services. In addition, it offers dial-up Internet services to consumers and businesses in Argentina, Bolivia, Brazil, Chile, Colombia, El Salvador, Ecuador, Guatemala, Mexico, Paraguay, Peru, the United States, and Venezuela. The company was formerly known as Cana Petroleum, Inc. and changed its name to XCana Petroleum Corporation in May 2007. XCana Petroleum Corporation was incorporated in 1980 and is based in Dallas, Texas with subsidiaries in the United States and Colombia.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Dallas"}, "XCQ.DE": {"short_name": "CABOT OIL + GAS  DL-,10", "long_name": "Cabot Oil & Gas Corporation", "summary": "Cabot Oil & Gas Corporation, an independent oil and gas company, explores for, exploits, develops, produces, and markets oil and gas properties in the United States. It primarily focuses on the Marcellus Shale with approximately 173,000 net acres in the dry gas window of the play located in Susquehanna County, Pennsylvania. The company sells its natural gas to industrial customers, local distribution companies, gas marketers, and power generation facilities through gathering systems and pipelines. As of December 31, 2019, it had proved reserves of approximately 12,903 billion cubic feet of gas; and 22 thousand barrels of oil or other liquid hydrocarbons. Cabot Oil & Gas Corporation was incorporated in 1989 and is headquartered in Houston, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "GER", "market": "de_market", "country": "United States", "city": "Houston"}, "XCQ.F": {"short_name": "CABOT OIL + GAS  DL-,10", "long_name": "Cabot Oil & Gas Corporation", "summary": "Cabot Oil & Gas Corporation, an independent oil and gas company, explores for, exploits, develops, produces, and markets oil and gas properties in the United States. It primarily focuses on the Marcellus Shale with approximately 173,000 net acres in the dry gas window of the play located in Susquehanna County, Pennsylvania. The company sells its natural gas to industrial customers, local distribution companies, gas marketers, and power generation facilities through gathering systems and pipelines. As of December 31, 2019, it had proved reserves of approximately 12,903 billion cubic feet of gas; and 22 thousand barrels of oil or other liquid hydrocarbons. Cabot Oil & Gas Corporation was incorporated in 1989 and is headquartered in Houston, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Houston"}, "XEC": {"short_name": "Cimarex Energy Co", "long_name": "Cimarex Energy Co.", "summary": "Cimarex Energy Co. operates as an independent oil and gas exploration and production company primarily in Texas, Oklahoma, and New Mexico. As of December 31, 2019, it had a total proved reserves of 619.6 million barrels of oil equivalent, consisting of 1.53 trillion cubic feet of natural gas; 169.8 million barrels (MMBbls) of oil; and 194.5 MMBbls of natural gas liquids primarily located in the Permian Basin and Mid-Continent regions. The company also owned interests in 2,782 net productive oil and gas wells. Cimarex Energy Co. was founded in 2002 and is headquartered in Denver, Colorado.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Denver"}, "XOG": {"short_name": "Extraction Oil & Gas, Inc.", "long_name": "Extraction Oil & Gas, Inc.", "summary": "Extraction Oil & Gas, Inc., an independent oil and gas company, focuses on the acquisition, development, and production of oil, natural gas, and natural gas liquid reserves in the Rocky Mountain region, primarily in the Wattenberg Field of the Denver-Julesburg (DJ) Basin of Colorado. The company also engages in the construction and support of midstream assets to gather, process, and produce crude oil and gas. As of December 31, 2019, it had approximately 169,900 net acres of contiguous acreage blocks in the productive areas of the DJ Basin; held approximately 125,500 net acres outside of the Core DJ Basin; had estimated proved reserves of approximately 254.1 MMBoe; and had 1,509 gross producing wells. The company was founded in 2012 and is headquartered in Denver, Colorado.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Denver"}, "YCP.DE": {"short_name": "CONOCOPHILLIPS  DL-,01", "long_name": "ConocoPhillips", "summary": "ConocoPhillips explores for, produces, transports, and markets crude oil, bitumen, natural gas, liquefied natural gas (LNG), and natural gas liquids worldwide. The company primarily engages in the conventional and tight oil reservoirs, shale gas, heavy oil, LNG, oil sands, and other production operations. Its portfolio includes unconventional plays in North America; conventional assets in North America, Europe, Asia, and Australia; various LNG developments; oil sands assets in Canada; and an inventory of conventional and unconventional exploration prospects. The company was founded in 1917 and is headquartered in Houston, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "GER", "market": "de_market", "country": "United States", "city": "Houston"}, "YCP.F": {"short_name": "CONOCOPHILLIPS  DL-,01", "long_name": "ConocoPhillips", "summary": "ConocoPhillips explores for, produces, transports, and markets crude oil, bitumen, natural gas, liquefied natural gas (LNG), and natural gas liquids worldwide. The company primarily engages in the conventional and tight oil reservoirs, shale gas, heavy oil, LNG, oil sands, and other production operations. Its portfolio includes unconventional plays in North America; conventional assets in North America, Europe, Asia, and Australia; various LNG developments; oil sands assets in Canada; and an inventory of conventional and unconventional exploration prospects. The company was founded in 1917 and is headquartered in Houston, Texas.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Houston"}, "YUMAQ": {"short_name": "YUMA ENERGY INC", "long_name": "Yuma Energy, Inc.", "summary": "Yuma Energy, Inc. focuses on the acquisition, development, and exploration for conventional and unconventional oil and natural gas resources in the United States. It has onshore properties located in central and southern Louisiana, and southeastern Texas; and operated and non-operated assets in south Louisiana, including Cameron, LaFourche, Livingston, St. Helena, St. Bernard, and Vermilion parishes. The company also holds operated and non-operated assets located in Jefferson and Madison counties, southeast Texas; non-operated position in the East Texas Woodbine; and operated positions in Kern County in California. Yuma Energy, Inc. is based in Houston, Texas. On October 19, 2020, the voluntary petition of Yuma Energy, Inc. for reorganization under Chapter 11 was converted to Chapter 7. It had filed for Chapter 11 bankruptcy on April 15, 2020.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "ZDEXF": {"short_name": "SINTANA ENERGY INC", "long_name": "Sintana Energy Inc.", "summary": "Sintana Energy Inc., an oil and natural gas exploration company, engages in the acquisition, exploration, development, production, and sale of crude oil and natural gas resources in Colombia. Its principal assets are private participation interests of 30% unconventional and 100% conventional interests in the hydrocarbon resources of VMM 37 Block, which covers 43,158 acres located in the Middle Magdalena Basin. The company was incorporated in 1994 and is headquartered in Dallas, Texas.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Dallas"}}