{
    "AGDY": {
        "short_name": "AGRI DYNAMICS INC",
        "long_name": "Agri Dynamics, Inc.",
        "summary": "Agri Dynamics, Inc. is a holding company providing management consulting services. The company is based in Forest Hills, New York.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Forest Hills",
        "zipcode": "11375",
        "website": "http://www.agri-dynamicsinc.com",
        "market_cap": "Small Cap"
    },
    "BRCOQ": {
        "short_name": "BEARD OIL CO",
        "long_name": "Beard Co. (The)",
        "summary": "The Beard Company, through its subsidiaries, engages in carbon dioxide, oil and gas, coal reclamation, and e-commerce businesses in the United States. The company's Carbon Dioxide segment produces and sells carbon dioxide gas in Colorado and New Mexico. Its Oil and Gas segment engages in the exploration, development, production, and sale of oil and gas. This segment owns non-operated working interests or overriding royalty interests in producing wells in Colorado and Wyoming; and undeveloped oil and gas leases in such states and in Mississippi. The company's Coal Reclamation segment operates coal fines reclamation facilities; and provides slurry pond core drilling services, fine coal laboratory analytical services, and consulting services. Its e-Commerce segment holds Voucher patent that is offered under royalty basis. The company was founded in 1921 and is headquartered in Oklahoma City, Oklahoma. On October 12, 2012, The Beard Company, Inc. filed a voluntary petition for liquidation under Chapter 7 in the U.S. Bankruptcy Court for the Western District of Oklahoma. Beard Co. is in liquidation.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "OK",
        "city": "Oklahoma City",
        "zipcode": "73116",
        "website": null,
        "market_cap": "Small Cap"
    },
    "DO1.F": {
        "short_name": "DIAMOND OFFSHORE DRILLING",
        "long_name": "Diamond Offshore Drilling, Inc.",
        "summary": "Diamond Offshore Drilling, Inc. provides contract drilling services to the energy industry worldwide. The company operates a fleet of 13 offshore drilling rigs, including four drillships and nine semisubmersible rigs. It serves independent oil and gas companies, and government-owned oil companies. The company was founded in 1953 and is headquartered in Houston, Texas. Diamond Offshore Drilling, Inc. is a subsidiary of Loews Corporation.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77094-1810",
        "website": "http://www.diamondoffshore.com",
        "market_cap": "Small Cap"
    },
    "EXLA": {
        "short_name": "HELMER DIRECTIONAL DRILLING COR",
        "long_name": "Helmer Directional Drilling Corp.",
        "summary": "Helmer Directional Drilling Corp., an exploration stage, engages in the acquisition, exploration, and development of mineral properties. It focuses on gold, silver, copper, iron, rare earth minerals, and other exploitable resources. The company has interests primarily in the Great Excelsior Mine that consists of 60 lode mining claims and is located in Whatcom County, the Mount Baker quadrangle, western Washington State. It also has interests in the Liver Peak property, which comprises 30 unpatented federal mining claims covering 620 acres and is located in the Lolo National Forest in Sanders County, Montana. The company is based in Wenatchee, Washington.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WA",
        "city": "Wenatchee",
        "zipcode": "98802",
        "website": null,
        "market_cap": "Small Cap"
    },
    "HP": {
        "short_name": "Helmerich & Payne, Inc.",
        "long_name": "Helmerich & Payne, Inc.",
        "summary": "Helmerich & Payne, Inc., together with its subsidiaries, provides drilling services and solutions for exploration and production companies. The company operates through three segments: North America Solutions, Offshore Gulf of Mexico, and International Solutions. The North America Solutions segment drills primarily in Colorado, Ohio, Oklahoma, New Mexico, North Dakota, Pennsylvania, Texas, West Virginia, and Wyoming. It also focuses on developing, promoting, and commercializing technologies designed to enhance the drilling operations, as well as wellbore quality and placement. The Offshore Gulf of Mexico segment has drilling operations in Louisiana and in U.S. federal waters in the Gulf of Mexico. The International Solutions segment conducts drilling operations in Argentina, Bahrain, Colombia, and the United Arab Emirates. As of September 30, 2020, the company operated a fleet of 262 land rigs in North America; 32 international land rigs; and 8 offshore platform rigs. It also owns, develops, and operates commercial real estate properties. The company's real estate investments include a shopping center comprising approximately 389,000 leasable square feet; retail and multi-tenant warehouse space; and approximately 210 acres of undeveloped real estate located in Tulsa, Oklahoma. Helmerich & Payne, Inc. was founded in 1920 and is headquartered in Tulsa, Oklahoma.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OK",
        "city": "Tulsa",
        "zipcode": "74119",
        "website": "http://www.hpinc.com",
        "market_cap": "Mid Cap"
    },
    "HPC.F": {
        "short_name": "HELMERICH PAYNE  DL-,10",
        "long_name": "Helmerich & Payne, Inc.",
        "summary": "Helmerich & Payne, Inc., together with its subsidiaries, provides drilling services and solutions for exploration and production companies. The company operates through three segments: North America Solutions, Offshore Gulf of Mexico, and International Solutions. The North America Solutions segment drills primarily in Colorado, Ohio, Oklahoma, New Mexico, North Dakota, Pennsylvania, Texas, West Virginia, and Wyoming. It also focuses on developing, promoting, and commercializing technologies designed to enhance the drilling operations, as well as wellbore quality and placement. The Offshore Gulf of Mexico segment has drilling operations in Louisiana and in U.S. federal waters in the Gulf of Mexico. The International Solutions segment conducts drilling operations in Argentina, Bahrain, Colombia, and the United Arab Emirates. As of September 30, 2020, the company operated a fleet of 262 land rigs in North America; 32 international land rigs; and 8 offshore platform rigs. It also owns, develops, and operates commercial real estate properties. The company's real estate investments include a shopping center comprising approximately 389,000 leasable square feet; retail and multi-tenant warehouse space; and approximately 210 acres of undeveloped real estate located in Tulsa, Oklahoma. Helmerich & Payne, Inc. was founded in 1920 and is headquartered in Tulsa, Oklahoma.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OK",
        "city": "Tulsa",
        "zipcode": "74119",
        "website": "http://www.hpinc.com",
        "market_cap": "Mid Cap"
    },
    "ICD": {
        "short_name": "Independence Contract Drilling,",
        "long_name": "Independence Contract Drilling, Inc.",
        "summary": "Independence Contract Drilling, Inc. provides land-based contract drilling services for oil and natural gas producers in the United States. The company constructs, owns, and operates a fleet of pad-optimal ShaleDriller rigs that are engineered and designed to accelerate its clients' production profiles and cash flows from their technically demanding and economically impactful oil and gas properties in the Permian Basin, the Haynesville Shale, and the Eagle Ford Shale. Its fleet consists of 29 rigs. The company was founded in 2011 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77070",
        "website": "http://www.icdrilling.com",
        "market_cap": "Small Cap"
    },
    "PDGO": {
        "short_name": "PARADIGM OIL & GAS",
        "long_name": "Paradigm Oil and Gas, Inc.",
        "summary": "Paradigm Oil and Gas, Inc., an exploration stage company, engages in the acquisition, exploration, development, and operation of oil and gas properties. It holds interests in 4 oil and gas leases covering approximately 934 net mineral acres located in the Wichita and Navarro counties of Texas. The company is headquartered in Indian Rocks Beach, Florida.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Indian Rocks Beach",
        "zipcode": "33785",
        "website": "http://www.paradigmoil.com",
        "market_cap": "Small Cap"
    },
    "PE1.F": {
        "short_name": "PATTERS.-UTI  DL-,01",
        "long_name": "Patterson-UTI Energy, Inc.",
        "summary": "Patterson-UTI Energy, Inc., through its subsidiaries, provides onshore contract drilling services to oil and natural gas operators in the United States and Canada. It operates through three segments: Contract Drilling Services, Pressure Pumping Services, and Directional Drilling Services. The Contract Drilling Services segment markets its contract drilling services primarily in west Texas and southeastern New Mexico, north central and east Texas, northern Louisiana, Colorado, Wyoming, North Dakota, south Texas, western Oklahoma, Pennsylvania, Ohio, and West Virginia. As of December 31, 2020, this segment had a drilling fleet of 210 marketable land-based drilling rigs. The Pressure Pumping Services segment offers pressure pumping services that consist of well stimulation for the completion of new wells and remedial work on existing wells, as well as hydraulic fracturing, cementing, and acid pumping services in Texas and the Appalachian region. The Directional Drilling Services segment provides a suite of directional drilling services, including directional drilling and measurement-while-drilling services; supply and rental of downhole performance motors and wireline steering tools; and services that enhance the accuracy of horizontal wellbore placement. It also service equipment to drilling contractors, as well as provides electrical controls and automation to the energy, marine, and mining industries in North America and other markets; and owns and invests in oil and natural gas assets as a non-operating working interest owner located principally in Texas and New Mexico. The company was founded in 1978 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77064",
        "website": "http://www.patenergy.com",
        "market_cap": "Small Cap"
    },
    "PTEN": {
        "short_name": "Patterson-UTI Energy, Inc.",
        "long_name": "Patterson-UTI Energy, Inc.",
        "summary": "Patterson-UTI Energy, Inc., through its subsidiaries, provides onshore contract drilling services to oil and natural gas operators in the United States and Canada. It operates through three segments: Contract Drilling Services, Pressure Pumping Services, and Directional Drilling Services. The Contract Drilling Services segment markets its contract drilling services primarily in west Texas and southeastern New Mexico, north central and east Texas, northern Louisiana, Colorado, Wyoming, North Dakota, south Texas, western Oklahoma, Pennsylvania, Ohio, and West Virginia. As of December 31, 2020, this segment had a drilling fleet of 210 marketable land-based drilling rigs. The Pressure Pumping Services segment offers pressure pumping services that consist of well stimulation for the completion of new wells and remedial work on existing wells, as well as hydraulic fracturing, cementing, and acid pumping services in Texas and the Appalachian region. The Directional Drilling Services segment provides a suite of directional drilling services, including directional drilling and measurement-while-drilling services; supply and rental of downhole performance motors and wireline steering tools; and services that enhance the accuracy of horizontal wellbore placement. It also service equipment to drilling contractors, as well as provides electrical controls and automation to the energy, marine, and mining industries in North America and other markets; and owns and invests in oil and natural gas assets as a non-operating working interest owner located principally in Texas and New Mexico. The company was founded in 1978 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77064",
        "website": "http://www.patenergy.com",
        "market_cap": "Small Cap"
    },
    "PTRO": {
        "short_name": "PETROMINERALS CORP",
        "long_name": "Petrominerals Corporation",
        "summary": "Petrominerals Corporation engages in the exploration, drilling, and production of oil and gas; and other oil industry-related businesses. It owns interests in oil producing properties in southern California. The company has a 53% working interest in the Castaic Hills Unit; a 100% working interest in a single oil well; and a 83.3% working interest in two oil wells in the Hasley Canyon field. Its properties are located in Santa Clarita, California. The company's net production of oil and gas was approximately 8 million barrels, as of December 31, 2003. It had approximately 23 gross oil and gas producing wells, as of the above date. Petrominerals Corporation was founded in 1966 and is based in Ventura, California.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Ventura",
        "zipcode": "93003",
        "website": null,
        "market_cap": "Small Cap"
    },
    "TISDZ": {
        "short_name": "TREASURE ISLAND ROYALTY TRUST",
        "long_name": "Treasure Island Royalty Trust",
        "summary": "Treasure Island Royalty Trust holds nonexpense bearing overriding royalty interests in ultra deep prospects in the shallow waters of the Gulf of Mexico. The trust owns, or has the right to receive, overriding royalty interests from Newfield Exploration Company's interest in any future production. It has interests in 116 lease blocks located offshore Louisiana in the South Timbalier, Ship Shoal, South Marsh Island, and Eugene Island areas. Treasure Island Royalty Trust was founded in 2002 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77057",
        "website": null,
        "market_cap": "Small Cap"
    },
    "VTDRF": {
        "short_name": "VANTAGE DRILLING INTERNATIONAL",
        "long_name": "Vantage Drilling International",
        "summary": "Vantage Drilling International provides offshore contract drilling services for national and independent oil and natural gas companies in the Cayman Islands, India, Qatar, Indonesia, Lebanon, Congo, Egypt, South Africa, and internationally. It also provides construction supervision services for drilling units for rigs that are under construction; preservation management services for rigs that are stacked; and operations and marketing services for operating rigs. As of March 18, 2021, it had a fleet of two ultra-deepwater drillships; and five premium jackup drilling rigs. The company was formerly known as Offshore Group Investment Limited and changed its name to Vantage Drilling International in February 2016. Vantage Drilling International was founded in 2007 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77056",
        "website": "http://www.vantagedrilling.com",
        "market_cap": "Small Cap"
    },
    "VTGDF": {
        "short_name": "VANTAGE DRILLING COMPANY",
        "long_name": "Vantage Drilling Company",
        "summary": "Vantage Drilling Company, through its subsidiaries, provides offshore contract drilling services in the United States and internationally. It offers drilling units, related equipment, and work crews under contract to drill oil and natural gas wells. The company also provides construction supervision and operations management services for drilling units owned by others. As of March 6, 2015, it owned a fleet of seven drilling units, including three ultra-deepwater drillships and four ultra-premium jackup rigs. The company primarily serves multinational oil and natural gas companies, government owned oil and natural gas companies, and independent oil and natural gas producers. Vantage Drilling Company was founded in 2007 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77056",
        "website": "http://www.vantagedrilling.com",
        "market_cap": "Small Cap"
    },
    "WBRE": {
        "short_name": "WILD BRUSH ENERGY INC",
        "long_name": "Wild Brush Energy, Inc.",
        "summary": "Wild Brush Energy, Inc. operates as a renewable energy company. The company focuses on identifying, developing, and financing clean air energy producing alternatives, such as solar energy, wind farms, and hydro power. It explores for green energy producing opportunities, such as large scale commercial wind farms in Europe, as well as solar and hydro energy prospects within North America and internationally. The company was formerly known as Wysak Petroleum, Inc. and changed its name to Wild Brush Energy, Inc. in 2006. Wild Brush Energy, Inc. was founded in 2003 and is based in Seattle, Washington.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WA",
        "city": "Seattle",
        "zipcode": "98101",
        "website": null,
        "market_cap": "Small Cap"
    }
}