{"INTET.AT": {"short_name": "INTERTECH S.A. INTER TECH", "long_name": "Intertech S.A. Inter. Technologies", "summary": "Intertech S.A. Inter. Technologies distributes technology products in Greece. It operates as a distributor of various brands, such as Panasonic, iLuv, Ricoh, Gestetner, and Satellite. The company was founded in 1988 and is based in Elliniko, Greece. Intertech S.A. Inter. Technologies was formerly a subsidiary of Demco Group.", "currency": "EUR", "sector": "Technology", "industry": "Diversified Electronics", "exchange": "ATH", "market": "gr_market", "country": "Greece", "city": "Elliniko"}, "ITKG": {"short_name": "INTEGRAL TECHNOLOGIES INC", "long_name": "Integral Technologies, Inc.", "summary": "Integral Technologies, Inc. focuses on the research, development, and commercialization of its ElectriPlast technologies in the United States. It offers ElectriPlast, an electrically and thermally conductive resin-based material that can be molded into various shapes and sizes associated with plastics and rubbers. The company's products are used in batteries, antennas, electronics shielding, lighting/LED circuitry, motors, switch actuators, resistors, medical devices, thermal management, toys, cable connector bodies, and other applications. Integral Technologies, Inc. was founded in 1996 and is headquartered in Evansville, Indiana.", "currency": "USD", "sector": "Technology", "industry": "Diversified Electronics", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Evansville"}, "LEBEK.AT": {"short_name": "N. Levederis (C)", "long_name": "N. Leventeris S.A.", "summary": "N. Leventeris S.A. manufactures and sells wires and wire ropes in Greece. The company offers steel wires, steel wire ropes, combination ropes, fiber and mooring ropes, wire rope slings, chains, anchors, fiber slings, crosby products, and agricultural wire ropes, as well as accessories comprising hooks, turnbuckles, shackles, and wire rope thimbles. It also provides spring wires; synthetic and natural fiber ropes; clips; fenders; and special wire ropes for marine, fishing, elevator, hoist, overhead crane, crane, excavator, mine, quarry, and cultivation industries. The company was founded in 1948 and is headquartered in Piraeus, Greece.", "currency": "EUR", "sector": "Technology", "industry": "Diversified Electronics", "exchange": "ATH", "market": "gr_market", "country": "Greece", "city": "Piraeus"}, "LEBEP.AT": {"short_name": "N. Levederis (P)", "long_name": "N. Leventeris S.A.", "summary": "N. Leventeris S.A. manufactures and sells wires and wire ropes in Greece. The company offers steel wires, steel wire ropes, combination ropes, fiber and mooring ropes, wire rope slings, chains, anchors, fiber slings, crosby products, and agricultural wire ropes, as well as accessories comprising hooks, turnbuckles, shackles, and wire rope thimbles. It also provides spring wires; synthetic and natural fiber ropes; clips; fenders; and special wire ropes for marine, fishing, elevator, hoist, overhead crane, crane, excavator, mine, quarry, and cultivation industries. The company was founded in 1948 and is headquartered in Piraeus, Greece.", "currency": "EUR", "sector": "Technology", "industry": "Diversified Electronics", "exchange": "ATH", "market": "gr_market", "country": "Greece", "city": "Piraeus"}, "NEXS": {"short_name": "NEXUS BIOPHARMA INC", "long_name": "Nexus BioPharma, Inc.", "summary": "Nexus BioPharma, Inc., a life science company, focuses on the development and commercialization of a pharmaceutical preparation to treat obesity and the symptoms of type 2 diabetes. The company is headquartered in Houston, Texas.", "currency": "USD", "sector": "Technology", "industry": "Diversified Electronics", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "OMRNN.MX": {"short_name": "OMRON CORP", "long_name": "OMRON Corporation", "summary": "OMRON Corporation engages in industrial automation, electronic and mechanical components, social systems, and healthcare businesses worldwide. The company's Industrial Automation Business offers sensors, switches, safety and control components, relays, automation systems, motion/drives, robotics, energy conservation support/environment measure equipment, and power supplies. Its Electronic and Mechanical Components Business provides relays, switches, connectors, sensors, and components/units for amusement equipment. The company's Social Systems, Solutions and Service Business offers terminals and systems, including PV inverters and storage batteries; railway station systems, such as automated ticket gates and ticket vending machines, traffic and road management systems, payment systems, and UPS that protect equipment from unexpected power disruption; and transport management systems and infrastructure monitoring systems, as wells provides a range of solutions comprising software development and maintenance services to support the social infrastructure. Its Healthcare Business offers blood pressure monitors, nebulizers, electrotherapy TENS devices, digital thermometers, body composition monitors, and other products, such as activity monitors, AEDs, etc. The company was formerly known as OMRON Tateisi Electronics Co. and changed its name to OMRON Corporation in January 1990. OMRON Corporation was founded in 1933 and is headquartered in Kyoto, Japan.", "currency": "MXN", "sector": "Technology", "industry": "Diversified Electronics", "exchange": "MEX", "market": "mx_market", "country": "Japan", "city": "Kyoto"}, "YASKYN.MX": {"short_name": "YASKAWA ELECTRIC CORP", "long_name": "YASKAWA Electric Corporation", "summary": "YASKAWA Electric Corporation engages in motion control, robotics, system engineering, and other businesses worldwide. It manufactures and sells various AC drives, including general purpose AC drives, medium-voltage AC drives, system-use AC drives, and power regenerative units for use in cranes, fans, pumps, machine tools, conveyors, automated warehouses, and metal working machinery; and rotary servo motors, direct drive servo motors, linear servo motors, machine controllers, and machine vision systems that are used in chip mounters, robots, and metal working machinery. The company also offers arc and spot welding, handling/assembling, collaborative, biomedical, palletizing, press handling, sealing/cutting/laser machining, deburring, painting, glass substrates transfer, and semiconductor wafer transfer robots for use in semiconductor/liquid crystal manufacturing, arc welding, spot welding, palletizing, painting, and handling and assembly applications. In addition, it provides industrial system electrical products, such as medium-voltage AC drives, system use AC drives, and system controllers for use in iron and steel systems, water and wastewater treatment, and paper-making/film/port cargo handling/fiber/printing applications. Further, the company offers equipment for energy saving and creation comprising PV inverters, systems for large wind turbines, control equipment for small-scale power generation, and motor drive systems for use in photovoltaic power generation and electric vehicles. YASKAWA Electric Corporation was founded in 1915 and is headquartered in Kitakyushu, Japan.", "currency": "MXN", "sector": "Technology", "industry": "Diversified Electronics", "exchange": "MEX", "market": "mx_market", "country": "Japan", "city": "Kitakyushu"}}