{
    "CURM": {
        "short_name": "CUR MEDIA INC",
        "long_name": "CÜR Media, Inc.",
        "summary": "CÃ\u009cR Media, Inc., an Internet music service, focuses on providing a paid subscription Internet radio service offering listeners streaming music on the Web and mobile devices under the CÃ\u009cR brand. It also intends to offer personalized advertising in the form of display ads, email, and text messages; and to sell music, concert tickets, and merchandise through its music streaming service, as well as music downloads. The company was formerly known as Duane Street Corp and changed its name to CÃ\u009cR Media, Inc. in January 2014. CÃ\u009cR Media, Inc. was founded in 2008 and is based in Glastonbury, Connecticut.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Internet Information Providers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Glastonbury",
        "zipcode": "06033",
        "website": "http://www.curmusic.com",
        "market_cap": "Small Cap"
    },
    "EVTI": {
        "short_name": "EVENTURE INTERACTIVE INC",
        "long_name": "Eventure Interactive, Inc.",
        "summary": "Eventure Interactive, Inc. engages in the social media business in the United States. It develops social applications, as well as operates a mobile-to-Web technology platform that enables the users to create, capture, and organize memories and data. The company provides mobile applications for android and iOS based smartphones and mobile devices. It also operates eventure.com, which provides Eventure service that enables customers to find, plan, invite, navigate, capture, organize, and share events into a single application. The company was formerly known as Live Event Media, Inc. and changed its name to Eventure Interactive, Inc. in February 2013. Eventure Interactive, Inc. was founded in 2010 and is headquartered in Costa Mesa, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Internet Information Providers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Costa Mesa",
        "zipcode": "92626",
        "website": "http://www.eventure.com",
        "market_cap": "Small Cap"
    },
    "OPMG": {
        "short_name": "OPTIONS MEDIA GROUP HOLDINGS IN",
        "long_name": "Options Media Group Holdings, Inc.",
        "summary": "Options Media Group Holdings, Inc., through its subsidiaries, focuses on the mobile software applications in the United States and Canada. It offers PhoneGuard anti-texting software, a mobile phone control management software suite, which is designed to prevent texting and emailing while driving, as well as offers parents and employers the ability to monitor the driving habits of mobile phone users to prevent speeding. The company also provides lead generation programs to assist various businesses with customer acquisition for the products and services they are selling. Options Media Group Holdings, Inc. was incorporated in 2000 and is headquartered in Boca Raton, Florida.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Internet Information Providers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Boca Raton",
        "zipcode": "33432",
        "website": null,
        "market_cap": "Small Cap"
    },
    "SBAY": {
        "short_name": "SUBAYE INC",
        "long_name": "Subaye, Inc.",
        "summary": "Subaye, Inc. provides online business services in the People's Republic of China. The company offers bundled cloud product that uses Internet-based computing, storage, and connectivity technology to deliver various services to small-to-medium sized enterprises. It markets its products through direct sales and third party agencies. The company was formerly known as MyStarU.com, Inc. and changed its name to Subaye, Inc. in October 2009. Subaye, Inc. was founded in 1997 and is based in Guangzhou, China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Internet Information Providers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510006",
        "website": "http://www.mystaru.com",
        "market_cap": "Small Cap"
    },
    "SPOTN.MX": {
        "short_name": "SPOTIFY TECHNOLOGY S.A.",
        "long_name": "Spotify Technology S.A.",
        "summary": "Spotify Technology S.A., together with its subsidiaries, provides audio streaming services worldwide. It operates in two segments, Premium and Ad-Supported. The Premium segment offers unlimited online and offline streaming access to its catalog of music and podcasts without commercial breaks to its subscribers. The Ad-Supported segment provides on-demand online access to its catalog of music and unlimited online access to the catalog of podcasts to its subscribers with no subscription fees. The company also offers sales, marketing, contract research and development, and customer support services. As of December 31, 2020, its platform included 345 million monthly active users and 155 million premium subscribers in 93 countries and territories. The company was founded in 2006 and is based in Luxembourg, Luxembourg.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Internet Information Providers",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Luxembourg",
        "state": null,
        "city": "Luxembourg",
        "zipcode": "1610",
        "website": "http://www.spotify.com",
        "market_cap": "Large Cap"
    },
    "SPXA": {
        "short_name": "SPECTRUMDNA INC",
        "long_name": "SpectrumDNA, Inc.",
        "summary": "Spectrum DNA, Inc. operates a social media studio that creates digital networked applications, which are engines of engagement (enginets) primarily for media outlets and brand advertisers. Its enginets are branded Web and wireless-based network experiences, and Web and mobile applications. The company's principal enginets include The Addictionary, a social wordplay engine used as the foundation for apps created to engage in word-related apps; and PlanetTagger, a location-enabled integrated social marketing platform that offers online communities a tool, which centralize the social media marketing and editorial programming, as well as provides the community users with utility to extend the reach of the community. It also offers OptEngage, a new class configurable and contextual browser application that talks to a cloud-based platform, which enables clients to deliver content and utility to their users on the Web; and the Hucklemonkey, an application programming interface API that integrates gamification into clients existing services or new applications. The company was founded in 2006 and is based in Park City, Utah.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Internet Information Providers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "UT",
        "city": "Park City",
        "zipcode": "84068",
        "website": null,
        "market_cap": "Small Cap"
    },
    "TCEHYN.MX": {
        "short_name": "TENCENT HOLDINGS LIMITED",
        "long_name": "Tencent Holdings Limited",
        "summary": "Tencent Holdings Limited, an investment holding company, provides value-added services (VAS) and Online advertising services in Mainland China and internationally. The company operates through VAS, Online Advertising, FinTech and Business Services, and Others segments. It offers online games and social network services; FinTech and cloud services, and online advertising services, such as media, social, and others advertisement services. The company is also involved in production, investment, and distribution of films and television programs for third parties, as well as copyrights licensing, merchandise sales, and other activities. In addition, it develops software; develops and operates online games; and provides information technology, information system integration, asset management, online literature, and online music entertainment services. Tencent Holdings Limited company was founded in 1998 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Internet Information Providers",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518054",
        "website": "http://www.tencent.com",
        "market_cap": "Large Cap"
    },
    "WBN.MX": {
        "short_name": "WEIBO CORPORATION",
        "long_name": "Weibo Corporation",
        "summary": "Weibo Corporation, through its subsidiaries, operates as a social media platform for people to create, distribute, and discover content in the People's Republic of China. It operates in two segments, Advertising and Marketing Services; and Value-Added Services. The company offers discovery products to help users discover content on its platform; self-expression products that enable its users to express themselves on its platform; and social products to promote social interaction between users on its platform. It also provides advertising and marketing solutions, such as social display advertisements; and promoted marketing offerings, such as Fans Headline and Weibo Express, as well as promoted trends and search products that appear alongside user's trends discovery and search behaviors. In addition, the company offers products, such as trends, search, video/live streaming, and editing tools; content customization, copyright contents pooling, and user interaction development; and search list recommendation, trends list recommendation, and Weibo app opening advertisements for copyright content providers. Further, it provides back-end management, traffic support, and product solutions to MCNs, unions, and e-commerce partners; open application platform for other app developers that allows users to log into third-party applications with their Weibo account for sharing third-party content on its platform; and Weibo Wallet, a product that enables platform partners to conduct interest generation activities on Weibo, such as handing out red envelops and coupons. The company was formerly known as T.CN Corporation and changed its name to Weibo Corporation in 2012. The company was founded in 2009 and is headquartered in Beijing, China. Weibo Corporation is a subsidiary of Sina Corporation.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Internet Information Providers",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100027",
        "website": "http://ir.weibo.com",
        "market_cap": "Small Cap"
    }
}