{"BCG.NS": {"short_name": "BRIGHTCOM GROUP", "long_name": "Brightcom Group Limited", "summary": "Brightcom Group Limited provides digital marketing solutions to businesses, agencies, and online publishers worldwide. It operates through Digital Marketing and Software Development segments. The company connects advertisers with their audience across various forms of digital media to deliver messages to the right audience. The company was formerly known as Lycos Internet Limited and changed its name to Brightcom Group Limited in September 2018. Brightcom Group Limited was incorporated in 1999 and is based in Hyderabad, India.", "currency": "INR", "sector": "Technology", "industry": "Internet Information Providers", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Hyderabad"}, "GRPN.MX": {"short_name": "GROUPON INC", "long_name": "Groupon, Inc.", "summary": "Groupon, Inc. operates online local commerce marketplaces that connect merchants to consumers by offering goods and services at a discount in North America and internationally. The company provides deals in various categories, including events and activities; health, beauty, and wellness; food and drink; home and garden; automotive; discounted and market rates for hotel, airfare, and package deals, as well as deals on various product lines, such as electronics, sporting goods, jewelry, toys, household items, and apparel. It offers its deal offerings to customers through Websites; search engines; mobile applications and mobile, which enable consumers to browse, purchase, manage, and redeem deals on their mobile devices; emails and push notifications; affiliate channels; social and display advertising; and offline marketing. The company was formerly known as ThePoint.com, Inc. and changed its name to Groupon, Inc. in October 2008. Groupon, Inc. was founded in 2008 and is headquartered in Chicago, Illinois.", "currency": "MXN", "sector": "Technology", "industry": "Internet Information Providers", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Chicago"}, "OPMG": {"short_name": "OPTIONS MEDIA GROUP HOLDINGS IN", "long_name": "Options Media Group Holdings, Inc.", "summary": "Options Media Group Holdings, Inc., through its subsidiaries, focuses on the mobile software applications in the United States and Canada. It offers PhoneGuard anti-texting software, a mobile phone control management software suite, which is designed to prevent texting and emailing while driving, as well as offers parents and employers the ability to monitor the driving habits of mobile phone users to prevent speeding. The company also provides lead generation programs to assist various businesses with customer acquisition for the products and services they are selling. Options Media Group Holdings, Inc. was incorporated in 2000 and is headquartered in Boca Raton, Florida.", "currency": "USD", "sector": "Technology", "industry": "Internet Information Providers", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Boca Raton"}, "SBAY": {"short_name": "SUBAYE INC", "long_name": "Subaye, Inc.", "summary": "Subaye, Inc. provides online business services in the People's Republic of China. The company offers bundled cloud product that uses Internet-based computing, storage, and connectivity technology to deliver various services to small-to-medium sized enterprises. It markets its products through direct sales and third party agencies. The company was formerly known as MyStarU.com, Inc. and changed its name to Subaye, Inc. in October 2009. Subaye, Inc. was founded in 1997 and is based in Guangzhou, China.", "currency": "USD", "sector": "Technology", "industry": "Internet Information Providers", "exchange": "PNK", "market": "us_market", "country": "China", "city": "Guangzhou"}, "SINAN.MX": {"short_name": "SINA CORPORATION (CAY)", "long_name": "SINA Corporation", "summary": "SINA Corporation, together with its subsidiaries, operates as an online media company in the People's Republic of China and internationally. The company operates SINA.com, an online media property that provides region-focused format and content, including feeds from news providers; business news coverage and personal finance columns; sporting events information; entertainment news and events; automobile-related news and service information; technology updates; interactive video products, such as news, sports, and entertainment; and education, digital, fashion, luxury, health, collectibles, travel, and other interest-based channels. It also offers SINA mobile, a mobile portal, which provides news information and entertainment content from SINA.com for mobile users in mobile browser and application format. In addition, it operates Weibo.com that offers discovery products to help users discover content; self-expression products to enable users to express themselves on Weibo platform; social products to promote social interaction between users on Weibo platform; advertising and marketing solutions; and tools and services. Further, the company offers online loan facilitation and payment, VIP membership, live streaming, and game-related services. SINA Corporation was founded in 1993 and is headquartered in Beijing, the People's Republic of China.", "currency": "MXN", "sector": "Technology", "industry": "Internet Information Providers", "exchange": "MEX", "market": "mx_market", "country": "China", "city": "Beijing"}, "SPOTN.MX": {"short_name": "SPOTIFY TECHNOLOGY S.A.", "long_name": "Spotify Technology S.A.", "summary": "Spotify Technology S.A., together with its subsidiaries, provides audio streaming services in the United States, the United Kingdom, Luxembourg, and internationally. It operates through two segments, Premium and Ad-Supported. The company offers unlimited online and offline high-quality streaming access to its catalog of music and podcasts without commercial breaks to its subscribers. It also provides on-demand online access to its catalog of music and unlimited online access to the catalog of podcasts to its subscribers with no subscription fees; and sales, marketing, contract research and development, and customer support services. As of March 31, 2020, the company's platform included 286 million monthly active users and 130 million premium subscribers in approximately 79 countries and territories. Spotify Technology S.A. was founded in 2006 and is based in Luxembourg, Luxembourg.", "currency": "MXN", "sector": "Technology", "industry": "Internet Information Providers", "exchange": "MEX", "market": "mx_market", "country": "Luxembourg", "city": "Luxembourg"}, "SPXA": {"short_name": "SPECTRUMDNA INC", "long_name": "SpectrumDNA, Inc.", "summary": "Spectrum DNA, Inc. operates a social media studio that creates digital networked applications, which are engines of engagement (enginets) primarily for media outlets and brand advertisers. Its enginets are branded Web and wireless-based network experiences, and Web and mobile applications. The company's principal enginets include The Addictionary, a social wordplay engine used as the foundation for apps created to engage in word-related apps; and PlanetTagger, a location-enabled integrated social marketing platform that offers online communities a tool, which centralize the social media marketing and editorial programming, as well as provides the community users with utility to extend the reach of the community. It also offers OptEngage, a new class configurable and contextual browser application that talks to a cloud-based platform, which enables clients to deliver content and utility to their users on the Web; and the Hucklemonkey, an application programming interface API that integrates gamification into clients existing services or new applications. The company was founded in 2006 and is based in Park City, Utah.", "currency": "USD", "sector": "Technology", "industry": "Internet Information Providers", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Park City"}, "TCEHYN.MX": {"short_name": "TENCENT HOLDINGS LIMITED", "long_name": "Tencent Holdings Limited", "summary": "Tencent Holdings Limited, an investment holding company, provides value-added services (VAS) and Internet advertising services in Mainland China, the United States, Europe, and internationally. The company operates through VAS, FinTech and Business Services, Online Advertising, and Others segments. It offers online games and social network services; FinTech and cloud services; and online advertising services, such as media, social, and others advertisement services. The company is also involved in production, investment, and distribution of films and television programs for third parties, as well as copyrights licensing, merchandise sales, and other activities. In addition, it develops software; develops and operates online games; and provides information technology, information system integration, asset management, online literature, and online music entertainment services. The company was founded in 1998 and is headquartered in Shenzhen, the People's Republic of China.", "currency": "MXN", "sector": "Technology", "industry": "Internet Information Providers", "exchange": "MEX", "market": "mx_market", "country": "China", "city": "Shenzhen"}, "WBN.MX": {"short_name": "WEIBO CORPORATION", "long_name": "Weibo Corporation", "summary": "Weibo Corporation, through its subsidiaries, operates as a social media platform for people to create, distribute, and discover content in the People's Republic of China. It operates in two segments, Advertising and Marketing Services; and Value-Added Services. The company offers discovery products to help users discover content on its platform; self-expression products that enable its users to express themselves on its platform; and social products to promote social interaction between users on its platform. It also provides advertising and marketing solutions, such as social display advertisements; and promoted feeds, such as Super FST, Fans Headline, and Weibo Express, promoted accounts, and promoted trends and search products that enable its customers to promote their brands and conduct marketing activities. In addition, the company offers copyright content, such as TV channels, online video websites, and operators with copyright content through traffic resource exchange and content traffic sharing; MCNs and other self-media to manage and provide services to content creators on Weibo, such as MCNs, unions, and e-commerce partners; other app developers an application platform, which allows users to log into third-party applications; and Weibo Wallet product consists of red envelops and coupons that enables platform partners to conduct interest generation activities on Weibo. The company was formerly known as T.CN Corporation and changed its name to Weibo Corporation in 2012. The company was founded in 2009 and is headquartered in Beijing, China. Weibo Corporation is a subsidiary of Sina Corporation.", "currency": "MXN", "sector": "Technology", "industry": "Internet Information Providers", "exchange": "MEX", "market": "mx_market", "country": "China", "city": "Beijing"}}