{
    "0Q19.L": {
        "short_name": "CEVA INC CEVA ORD SHS",
        "long_name": "CEVA, Inc.",
        "summary": "CEVA, Inc. operates as a licensor of wireless connectivity and smart sensing platforms to semiconductor and original equipment manufacturer (OEM) companies worldwide. It designs and licenses various digital signal processors, AI processors, wireless platforms, and complementary software for sensor fusion, image enhancement, computer vision, voice input, and artificial intelligence (AI). The company licenses a family of signal processing intellectual properties (IPs), including DSP-based platforms for 5G baseband processing in mobile and infrastructure; imaging and computer vision for any camera-enabled devices; audio/voice/speech and ultra-low power applications for multiple IoT markets; sensor fusion software and inertial measurement unit solutions for AR/VR, robotics, remote controls, and IoT; AI processors capable of handling the gamut of neural network workload and on-device; IPs for Bluetooth, Wi-Fi 4/5/6, and NB-IoT. Its technologies are licensed to companies, which design, manufacture, market, and sell application-specific integrated circuits and application-specific standard products to wireless, consumer electronics, and automotive companies for incorporation into various end products. The company delivers its DSP cores, platforms, and AI processors in the form of a hardware description language definition; and offers development platforms, software development kits, and software debug tools that facilitate system design, debug, and software development. The company licenses its technology through a direct sales force. The company was formerly known as ParthusCeva, Inc. and changed its name to CEVA, Inc. in December 2003. CEVA, Inc. was incorporated in 1999 and is headquartered in Rockville, Maryland.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductor - Broad Line",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United States",
        "state": "MD",
        "city": "Rockville",
        "zipcode": "20850",
        "website": "http://www.ceva-dsp.com",
        "market_cap": "Small Cap"
    },
    "ASEHN.MX": {
        "short_name": "ASE TECHNOLOGY HOLDING CO LTD",
        "long_name": "ASE Technology Holding Co., Ltd.",
        "summary": "ASE Technology Holding Co., Ltd. provides a range of semiconductors packaging and testing, and electronic manufacturing services in the United States, Taiwan, rest of Asia, Europe, and internationally. The company offers packaging services, including flip chip ball grid array (BGA), flip chip chip scale package (CSP), advanced chip scale packages, quad flat packages, low profile and thin quad flat packages, bump chip carrier and quad flat no-lead (QFN) packages, advanced QFN packages, plastic BGAs, and 3D chip packages; stacked die solutions in various package types; and copper and silver wire bonding solutions. It also provides advanced packages, such as flip chip BGA; heat-spreader FCBGA; flip-chip CSP; hybrid FCCSP; flip chip package in package and package on package (POP); advanced single sided substrate; high-bandwidth POP; fan-out wafer-level packaging; SESUB; and 2.5D silicon interposer. In addition, the company offers IC wire bonding packages; system-in-package products (SiP) and modules; and interconnect materials, as well as assembles automotive electronic products. Further, it provides a range of semiconductor testing services, including front-end engineering testing, wafer probing, logic/mixed-signal/RF module and SiP/MEMS/discrete final testing, and other test-related services, as well as drop shipment services. Additionally, the company develops, constructs, sells, leases, and manages real estate properties; produces substrates; offers information software, equipment leasing, financing, investment advisory, and warehousing management services; processes and sells computer and communication peripherals, electronic components, telecommunications equipment, and motherboards; and imports and exports goods and technology. ASE Technology Holding Co., Ltd. was incorporated in 1984 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Semiconductor - Broad Line",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "811",
        "website": "http://www.aseglobal.com",
        "market_cap": null
    },
    "AVGO.MX": {
        "short_name": "BROADCOM INC",
        "long_name": "Broadcom Inc.",
        "summary": "Broadcom Inc. designs, develops, and supplies semiconductor infrastructure software solutions. It offers semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company's infrastructure software solutions enable customers to plan, develop, automate, manage, and secure applications across mainframe, distributed, mobile, and cloud platforms. It operates through two segments, Semiconductor Solutions and Infrastructure Software. The company was incorporated in 2018 and is based in San Jose, California.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Semiconductor - Broad Line",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CA",
        "city": "San Jose",
        "zipcode": "95131-2313",
        "website": "http://www.broadcom.com",
        "market_cap": "Large Cap"
    },
    "NXPIN.MX": {
        "short_name": "NXP SEMICONDUCTORS N V",
        "long_name": "NXP Semiconductors N.V.",
        "summary": "NXP Semiconductors N.V. offers various semiconductor products. The company's product portfolio includes microcontrollers; application processors including i.MX application processors and i.MX 8 family of applications processors; communication processors; wireless connectivity solutions, such as near field communications, ultra-wideband, Bluetooth low-energy, Zigbee, and Wi-Fi and Wi-Fi/Bluetooth integrated SoCs; analog and interface devices; radio frequency power amplifiers; and security controllers, as well as semiconductor-based environmental and inertial sensors, including pressure, inertial, magnetic, and gyroscopic sensors. Its product solutions are used in a range of applications, including automotive, industrial and Internet of Things, mobile, and communication infrastructure. The company markets its products to various original equipment manufacturers, original design manufacturers, contract manufacturers, and distributors. It operates in China, the Netherlands, the United States, Singapore, Germany, Japan, South Korea, Malaysia, and internationally. The company was formerly known as KASLION Acquisition B.V and changed its name to NXP Semiconductors N.V. in May 2010. NXP Semiconductors N.V. was incorporated in 2006 and is headquartered in Eindhoven, the Netherlands.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Semiconductor - Broad Line",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Netherlands",
        "state": null,
        "city": "Eindhoven",
        "zipcode": "5656 AG",
        "website": "http://www.nxp.com",
        "market_cap": "Large Cap"
    },
    "RNECN.MX": {
        "short_name": "RENESAS ELECTRONICS CORP",
        "long_name": "Renesas Electronics Corporation",
        "summary": "Renesas Electronics Corporation, together with its subsidiaries, researches, develops, designs, manufactures, sells, and services semiconductors in Japan, China, North America, Europe, rest of Asia, and internationally. It operates through Automotive Business and Industrial/Infrastructure/IoT Business segments. The company offers microcontrollers (MCUs) and microprocessors; analog products, such as amplifiers, audio and video, data converters, power line communication, and switches and multiplexer products; automotive products, including battery management, interface, power devices, power management, sensors, video and display, wireless power, system-on-chips, and MCU products; and clock ICs and clock timing solutions, such as specific clocks, clock distribution and generation, jitter attenuators, and crystal oscillator products. It also provides interface and connectivity products, including buffers, wireless modules, data compression, industrial Ethernet, IO-link line driver, memory interface, optical interconnect, photocouplers/optocouplers, power line communication, signal integrity, telecom datacom and interface, USB switches and hubs, video broadcast software and ASICs, VME, and wireless broadband modem products. In addition, the company offers memory and logic products, such as low power static random access memory; power and power management products; RF and microwave products; sensor products; SMD, MIL-STD-883 (/883), and Class-V/Q products. Further, it provides automotive information devices, such as in-vehicle infotainment and instrument panels. The company offers its products for automotive, communication, healthcare, computing, home and building, industrial, personal electronic, technology, and other applications. Renesas Electronics Corporation was founded in 2002 and is headquartered in Tokyo, Japan.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Semiconductor - Broad Line",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "135-0061",
        "website": "http://www.renesas.com",
        "market_cap": "Large Cap"
    },
    "XIX.DE": {
        "short_name": "XILINX INC.  DL-,01",
        "long_name": "Xilinx, Inc.",
        "summary": "Xilinx, Inc. designs and develops programmable devices and associated technologies worldwide. The company offers integrated circuits (ICs) in the form of programmable logic devices (PLDs), such as programmable system on chips, and three dimensional ICs; adaptive compute acceleration platform; software design tools to program the PLDs; software development environments and embedded platforms; targeted reference designs; printed circuit boards; and intellectual property (IP) core licenses covering Ethernet, memory controllers, Interlaken, and peripheral component interconnect express interfaces, as well as domain-specific IP in the areas of embedded, digital signal processing and connectivity, and market-specific IP cores. It also offers development boards; development kits, including hardware, design tools, IP, and reference designs that are designed to streamline and accelerate the development of domain-specific and market-specific applications; and configuration products comprising one-time programmable and in-system programmable storage devices to configure field programmable gate arrays. In addition, it provides design, customer training, field engineering, and technical support services. The company offers its products to electronic equipment manufacturers in sub- markets, such as data center, wireless, wireline, aerospace and defense, test and measurement, industrial, scientific and medical, automotive, audio, video and broadcast, and consumer. It sells its products through a network of independent distributors; and through direct sales to original equipment manufacturers and electronic manufacturing service providers, as well as independent sales representatives. The company has a collaboration with Kameleon Security to develop cybersecurity solution for servers, cloud computing, and data centers. Xilinx, Inc. was founded in 1984 and is headquartered in San Jose, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductor - Broad Line",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "CA",
        "city": "San Jose",
        "zipcode": "95124",
        "website": "http://www.xilinx.com",
        "market_cap": "Large Cap"
    }
}