{"0Q19.L": {"short_name": "CEVA INC CEVA ORD SHS", "long_name": "CEVA, Inc.", "summary": "CEVA, Inc. operates as a licensor of wireless connectivity and smart sensing platforms to semiconductor and original equipment manufacturer (OEM) companies worldwide. It designs and licenses various digital signal processors, AI processors, wireless platforms, and complementary software for sensor fusion, image enhancement, computer vision, voice input, and artificial intelligence (AI). The company licenses a family of signal processing intellectual properties (IPs), including DSP-based platforms for 5G baseband processing in mobile and infrastructure; imaging and computer vision for any camera-enabled device; audio/voice/speech and ultra-low power always-on/sensing applications for multiple IoT markets; sensor fusion software and IMU solutions for AR/VR, robotics, remote controls, and IoT; AI processors capable of handling the gamut of neural network workload and on-device; IPs for Bluetooth, Wi-Fi 4/5/6, and NB-IoT. Its technologies are licensed to companies, which design, manufacture, market, and sell application-specific integrated circuits and application-specific standard products to wireless, consumer electronics, and automotive companies for incorporation into various end products. The company delivers its DSP cores, platforms, and AI processors in the form of a hardware description language definition; and offers development platforms, software development kits, and software debug tools that facilitate system design, debug, and software development. CEVA, Inc. licenses its technology through a direct sales force. The company was formerly known as ParthusCeva, Inc. and changed its name to CEVA, Inc. in December 2003. CEVA, Inc. was founded in 1999 and is headquartered in Mountain View, California.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor - Broad Line", "exchange": "LSE", "market": "gb_market", "country": "United States", "city": "Mountain View"}, "ALDOL.PA": {"short_name": "DOLFINES", "long_name": "Dietswell S.A.", "summary": "Dietswell S.A. provides onshore and offshore drilling solutions to the energy industry worldwide. It offers design and engineering, inspections and QHSE audit, technical assistance, and drilling operations management services. The company designs various aspects of the processes related to onshore and offshore engineering; and provides well engineering services. It also offers independent third party rig inspection, technical audit, and commissioning services in order to assist oil and gas operators and drilling contractors. In addition, the company is involved in the operation of onshore and offshore drilling units, such as land rigs, platform rigs, swamp barges, jack ups, TAD, semi-submersible rigs, and drill ships. Further, it offers human resource services, including French and international contracts comprising legal, payroll, and back-office support services, as well as travel, medical, and healthcare insurance services; logistics services comprising mobilization services, travel logistics, local visas and work permit, and onsite assistance; and sourcing services consisting of pre-employment background check, advertisement, job interview, selection, and sourcing using network of consultants, as well as CVs databases. Additionally, the company provides legal services, including risk management, local content compliance, fiscal optimization, and notice period management; training and medical services, such as QHSE awareness training, performance score card and improvement plan, and personnel training development and implementation through certified training centers; and rig management and maintenance, drilling operations, and rig stacking/restart/revamping program services. Dietswell S.A. was founded in 2000 and is headquartered in Guyancourt, France.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor - Broad Line", "exchange": "PAR", "market": "fr_market", "country": "France", "city": "Guyancourt"}, "AVGO.MX": {"short_name": "BROADCOM INC", "long_name": "Broadcom Inc.", "summary": "Broadcom Inc. designs, develops, and supplies semiconductor infrastructure software solutions. It offers semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company's infrastructure software solutions enable customers to plan, develop, automate, manage, and secure applications across mainframe, distributed, mobile, and cloud platforms. It operates through two segments, Semiconductor Solutions and Infrastructure Software. The company was incorporated in 2018 and is based in San Jose, California.", "currency": "MXN", "sector": "Technology", "industry": "Semiconductor - Broad Line", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "San Jose"}, "MCHP.MX": {"short_name": "MICROCHIP TECHNOLOGY", "long_name": "Microchip Technology Incorporated", "summary": "Microchip Technology Incorporated develops, manufactures, and sells semiconductor products for various embedded control applications in the Americas, Europe, and Asia. The company offers general purpose and specialized 8-bit, 16-bit, and 32-bit microcontrollers; 32-bit microprocessors; and microcontrollers for automotive, industrial, computing, communication, lighting, power supplies, motor control, human machine interface, security, and wired and wireless connectivity applications. It also provides development tools that enable system designers to program microcontroller products for specific applications; field-programmable gate array (FPGA) products; and analog, power, interface, mixed signal, and timing products comprising power management, linear, mixed-signal, high-voltage, thermal management, discrete diodes and metal oxide semiconductor field effect transistors (MOSFETS), radio frequency (RF), drivers, safety, security, timing, USB, Ethernet, wireless, and other interface products. In addition, the company offers memory products consisting of serial electrically erasable programmable read-only memory, serial flash memories, parallel flash memories, serial static random access memories, and serial electrically erasable random access memories for the production of very small footprint devices; and licenses its SuperFlash embedded flash and Smartbits one time programmable NVM technologies to foundries, integrated device manufacturers, and design partners for use in the manufacture of microcontroller products, gate array, RF, analog, and neuromorphic compute products that require embedded non-volatile memory, as well as provides engineering services. Further, it offers wafer foundry and assembly and test subcontracting manufacturing services; and aerospace and timing systems products, application specific integrated circuits, and complex programmable logic devices. Microchip Technology Incorporated was founded in 1989 and is headquartered in Chandler, Arizona.", "currency": "MXN", "sector": "Technology", "industry": "Semiconductor - Broad Line", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Chandler"}, "NXPIN.MX": {"short_name": "NXP SEMICONDUCTORS N V", "long_name": "NXP Semiconductors N.V.", "summary": "NXP Semiconductors N.V. offers various semiconductor products. The company's product portfolio includes microcontrollers; application processors including i.MX application processors and i.MX 8 family of applications processors ; communication processors; wireless connectivity solutions, such as Near Field Communications, Ultra-wideband, Bluetooth low-energy, Zigbee, and Wi-Fi and Wi-Fi/Bluetooth integrated SoCs; analog and interface devices; Radio Frequency power amplifiers; and security controllers, as well as semiconductor-based environmental and inertial sensors, including pressure, inertial, magnetic, and gyroscopic sensors. Its product solutions are used in a range of applications, including automotive, industrial and Internet of Things, mobile, and communication infrastructure. The company markets its products to various original equipment manufacturers, original design manufacturers, contract manufacturers, and distributors. It operates is China, the Netherlands, the United States, Singapore, Germany, Japan, South Korea, Malaysia, and internationally. NXP Semiconductors N.V. has a strategic relationship with Amazon Web Services to extend connected vehicle opportunities. The company was formerly known as KASLION Acquisition B.V and changed its name to NXP Semiconductors N.V. in May 2010. NXP Semiconductors N.V. was founded in 2006 and is headquartered in Eindhoven, the Netherlands.", "currency": "MXN", "sector": "Technology", "industry": "Semiconductor - Broad Line", "exchange": "MEX", "market": "mx_market", "country": "Netherlands", "city": "Eindhoven"}, "STMN.MX": {"short_name": "STMICROELECTRONICS", "long_name": "STMicroelectronics N.V.", "summary": "STMicroelectronics N.V., together with its subsidiaries, develops, manufactures, and markets semiconductor products in EMEA, the Americas, and the Asia Pacific. It operates through Automotive and Discrete Group; Analog, MEMS and Sensors Group; and Microcontrollers and Digital ICs Group segments. The Automotive and Discrete Group segment offers digital and analog automotive integrated circuits (ICs); and discrete and power transistor products. The Analog, MEMS and Sensors Group segment provides custom and general purpose analog ICs; smart power products for industrial, computer, and personal electronics markets; touch screen controllers; wireline and wireless low power connectivity solutions for Internet of Things; power conversion products; metering solutions for smart grid; specialized imaging sensors and modules; and micro-electro-mechanical systems products for sensors or actuators. The Microcontrollers and Digital ICs Group segment offers general purpose and secure microcontrollers, electrically erasable programmable read-only memories, and digital application-specific integrated circuits; and aerospace and defense products, including components for microwave and millimeter wave. It also provides subsystems, assembly, and other services. The company sells its products through its distributors and retailers, as well as through sales representatives. It has a strategic partnership with Sanken Electric Co., Ltd to develop intelligent power modules for high-voltage industrial and automotive products; and collaboration with Advantest Corporation on advanced automated test cell for IC testing. STMicroelectronics N.V. was founded in 1987 and is headquartered in Geneva, Switzerland.", "currency": "MXN", "sector": "Technology", "industry": "Semiconductor - Broad Line", "exchange": "MEX", "market": "mx_market", "country": "Switzerland", "city": "Geneva"}, "XIX.DE": {"short_name": "XILINX INC.  DL-,01", "long_name": "Xilinx, Inc.", "summary": "Xilinx, Inc. designs and develops programmable devices and associated technologies worldwide. The company offers integrated circuits (ICs) in the form of programmable logic devices (PLDs), such as programmable system on chips, and three dimensional ICs; adaptive compute acceleration platform; software design tools to program the PLDs; software development environments and embedded platforms; targeted reference designs; printed circuit boards; and intellectual property (IP) core licenses covering Ethernet, memory controllers, Interlaken, and peripheral component interconnect express interfaces, as well as domain-specific IP in the areas of embedded, digital signal processing and connectivity, and market-specific IP cores. It also offers development boards; development kits, including hardware, design tools, IP, and reference designs that are designed to streamline and accelerate the development of domain-specific and market-specific applications; and configuration products comprising one-time programmable and in-system programmable storage devices to configure field programmable gate arrays. In addition, it provides design, customer training, field engineering, and technical support services. The company offers its products to electronic equipment manufacturers in sub- markets, such as data center, wireless, wireline, aerospace and defense, test and measurement, industrial, scientific and medical, automotive, audio, video and broadcast, and consumer. It sells its products through a network of independent distributors; and through direct sales to original equipment manufacturers and electronic manufacturing service providers, as well as independent sales representatives. The company has a collaboration with Kameleon Security to develop cybersecurity solution for servers, cloud computing, and data centers. Xilinx, Inc. was founded in 1984 and is headquartered in San Jose, California.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor - Broad Line", "exchange": "GER", "market": "de_market", "country": "United States", "city": "San Jose"}}