{"002129.SZ": {"short_name": "TIANJIN ZHONGHUA", "long_name": "Tianjin Zhonghuan Semiconductor Co., Ltd.", "summary": "Tianjin Zhonghuan Semiconductor Co., Ltd. provides semiconductor materials and devices, and new energy materials in China and internationally. The company offers solar energy materials, including solar mono-crystalline silicon rods, wafers, and materials, as well as solar polycrystalline silicon materials; solar products, such as mono-crystalline silicon solar cells; and photovoltaic power stations. It also provides semiconductor materials comprising etching, polished, float-zone mono-crystalline silicon, and czochralski mono-crystalline silicon wafers. In addition, the company offers semiconductor devices consisting of TVS protective, HV, bridge, and schottky diodes, as well as GPP chips and metal-oxide-semiconductor field-effect transistors. Its products are used in smart grid transmission, new energy vehicle, high-speed rail, wind power inverters, integrated circuits, consumer electronics, aerospace, solar power generation, etc. The company was founded in 1989 and is headquartered in Tianjin, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Tianjin"}, "002156.SZ": {"short_name": "TONGFU MICROELECTR", "long_name": "Tongfu Microelectronics Co.,Ltd", "summary": "Tongfu Microelectronics Co.,Ltd provides integrated circuit (IC) assembling and testing services to the semiconductor industry worldwide. It provides wafer-level, flip chip, flip chip interconnection, ball grid array, plastic qual flat no-lead and dual flat no-lead, small outline, small outline transistor, dual-in-line, transistor outline, and plastic single-in-line packaging series products. The company's products are used in AP/PA/BB/RFIC chips, wireless LAN, card, switch, power management, memory, and standard analog, etc.; package solution for applications in computing, gaming, and high bandwidth networking/communication devices; networking, memory, microprocessors, graphic processors, logic, and micro-controllers; and consumer products, automotive devices, and analog ICs. Its products are also used in wireless/RF and analog devices, portable products, data storage systems, notebook computers, and pagers; power supplies, converters and power motor controls, hand-held instruments, battery powered consumer products, etc.; and automotive consumer and communications products. The company was formerly known as Nantong Fujitsu Microelectronics Co., Ltd. and changed its name to Tongfu Microelectronics Co.,Ltd in December 2016. Tongfu Microelectronics Co.,Ltd was founded in 1997 and is headquartered in Nantong, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Nantong"}, "002185.SZ": {"short_name": "TIANSHUI HUATIAN T", "long_name": "Tianshui Huatian Technology Co., Ltd.", "summary": "Tianshui Huatian Technology Co., Ltd. operates as an IC packaging and testing company. The company offers lead frame packaging products; and analog and mixed signal/RF testing services, as well as wafer probing, test development, and design and simulation services. It has operations in China, Taiwan, Hong Kong, Singapore, South Korea, the United States, etc. Tianshui Huatian Technology Co., Ltd. was founded in 2003 and is based in Tianshui, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Tianshui"}, "002409.SZ": {"short_name": "JIANGSU YOKE TECHN", "long_name": "Jiangsu Yoke Technology Co., Ltd.", "summary": "Jiangsu Yoke Technology Co., Ltd. engages in the research and development of electronic semiconductor materials, cryogenic composite materials, and plastic additives materials. It also offers flame retardants for plastics. The company was founded in 1997 and is headquartered in Yixing, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Yixing"}, "002504.SZ": {"short_name": "BEIJING HONGGAO CR", "long_name": "Beijing Honggao Creative Architectural Design Co., Ltd", "summary": "Beijing Honggao Creative Architectural Design Co., Ltd provides interior design services in China. It offers fine decoration construction, electromechanical installation, curtain wall construction, and construction general contracting services for hotels, office spaces, commercial complexes, medical, exhibition halls, and apartment clubs. It also engages in the equity investment activities; and provides mergers and acquisitions services in BIM, VR, design, consulting, construction technology, education and training, Internet, and construction industries. In addition, the company invests in and finances independent projects and cooperation with real estate enterprises. Beijing Honggao Creative Architectural Design Co., Ltd was founded in 1993 and is based in Beijing, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Beijing"}, "002610.SZ": {"short_name": "JIANGSU AKCOME SCI", "long_name": "Jiangsu Akcome Science and Technology Co., Ltd.", "summary": "Jiangsu Akcome Science and Technology Co., Ltd. manufactures photovoltaic (PV) accessories; and invests in and operates power stations primarily in the People's Republic of China. The company operates, inspects, maintains, and rates 1.1GW of grid-tied clean energy power stations; sells generated power to grid companies; develops carbon assets; and operates new energy vehicles and charging piles. It also offers aluminum frameworks of polar batteries; sectional materials; PV installation racks; and PV welding strips. Jiangsu Akcome Science and Technology Co., Ltd. was founded in 2006 and is headquartered in Zhangjiagang, the People's Republic of China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Zhangjiagang"}, "002806.SZ": {"short_name": "GUANGDONG HUAFENG", "long_name": "Guangdong Huafeng New Energy Technology Co.,Ltd.", "summary": "Guangdong Huafeng New Energy Technology Co., Ltd. manufactures and sells electronic aluminum foils. It also offers water treatment chemicals. The company was formerly known as Zhaoqing Hua Feng Electronic Aluminium Foil Co., Ltd. and changed its name to Guangdong Huafeng New Energy Technology Co., Ltd. in November 2018. The company was founded in 1995 and is based in Zhaoqing, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Zhaoqing"}, "004380.KS": {"short_name": "SAMICKTHK", "long_name": "Samick THK Co., Ltd.", "summary": "Samick THK Co., Ltd. manufactures and sells industrial automation equipment in South Korea. The company's products include linear motion systems; mechanized and robot systems; linear motors; harmonic drives; and files and rasps comprising bee, saw, diamond, rasps, and iron wire lines. It also manufactures automobile parts, such as brake discs and drums; and slide rails and other parts. The company was formerly known as SAMICK LMS Co., Ltd. and changed its name to Samick THK Co., Ltd. in April 2006. Samick THK Co., Ltd. was founded in 1960 and is based in Daegu, South Korea.", "currency": "KRW", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Daegu"}, "025560.KS": {"short_name": "Mirae", "long_name": "Mirae Corporation", "summary": "Mirae Corporation manufactures and sells semiconductor equipment primarily in South Korea, China, and rest of Asia, Europe, Africa, north America, and south America. It offers hybrid placement and insertion systems; reel tape feeders; and SMT software consisting of standard machine software, feeder barcode systems, LED rank control systems, offline editor software, offline feeder setup software, and line manager systems. The company also provides accessories, such as reel exchangers, feeder stackers, trolleys, stick feeders, internal reel exchangers, bar code systems, off-line trolley setup kits, LSM2 supplies, manual trays, feeder precision adjustion stations, and reel tape cutters. In addition, it offers memory and module test handlers, and burn in sorters; and linear motor technology products, as well as MRM series. Mirae Corporation was founded in 1983 and is headquartered in Cheonan, South Korea.", "currency": "KRW", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Cheonan-si"}, "042700.KS": {"short_name": "HANMISemi", "long_name": "HANMI Semiconductor Co., Ltd.", "summary": "HANMI Semiconductor Co., Ltd. manufactures and sells semiconductor equipment in South Korea and internationally. The company offers vision placement equipment; flip chip, TSV dual stacking, TC, flip chip, jumbo panel flip chip, and die flip chip bonders; and EMI shield vision attach and detach, EMI shield vision placement, EMI shield tape mounter, EMI shield tape laser cutting, EMI shield tape demounter, vision inspection, and converlay attach equipment. It also provides power ECU auto, test handler, vision placement, trim, and form/singulation devices, as well as 3D vision inspection equipment; auto mold, compression auto mold, mechanical mold press, and hydraulic mold press equipment; laser marking, laser wafer marking, laser ablation, laser cutting, and laser cutting/deflash equipment. In addition, the company offers cam press trim and form, micro cam press, CSP singulation, pick and place, die soater, strip mounter, and test equipment. HANMI Semiconductor Co., Ltd. was founded in 1980 and is based in Incheon, South Korea.", "currency": "KRW", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Incheon"}, "0OZ.SG": {"short_name": "Ohizumi MFG. Co. Ltd. Registere", "long_name": "Ohizumi Mfg. Co., Ltd.", "summary": "Ohizumi Mfg. Co., Ltd. manufactures and sells electronics parts and electric equipment/devices primarily in Japan. It offers NTC thermistors, such as thermistors for temperature sensing or temperature compensation, temperature sensors for automobile engines, sensors for car air conditioners, and temperature sensors for room air conditioners, as well as for residential installations and home electric appliances. The company also provides PTC thermistors for over-current protection, demagnetization, heaters, temperature sensing/compensation, and other applications; and metal oxide non-linear resistor varistors for the protection of semiconductors from over-voltage, lighting surge, on-off surge of relays, automotive electronic equipment, etc. In addition, it offers thermistor assemblies for automotive industries, household and housing applications, and thermistor assembly and other applications. The company was formerly known as Ohizumi Aircraft Equipment Manufacturing Co., Ltd. and changed its name to Ohizumi Mfg. Co., Ltd. in 1945. Ohizumi Mfg. Co., Ltd. was founded in 1939 and is headquartered in Sayama, Japan.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "STU", "market": "dr_market", "country": "Japan", "city": "Sayama"}, "1385.HK": {"short_name": "SHANGHAI FUDAN", "long_name": "Shanghai Fudan Microelectronics Group Company Limited", "summary": "Shanghai Fudan Microelectronics Group Company Limited designs, develops, and sells products of specific application integrated circuits (ICs) in Mainland China, rest of the Asia Pacific, and internationally. It offers security and identification products, including contact and contactless memory ICs, NFC tag and channel ICs, HF RFID tag ICs, contactless CPU card, chips, contact dual interface, CPU card chips, secured encryption chips, and HF readers. The company also provides smart meters ASIC chips, ultra-low general purpose MCU, and ePLC solutions; NVM products, such as EEPROM, SPI NOR flash, SPI and parallel NAND flash, and ASNVM; and specific analog circuits, including earth leakage protection device, lighting circuit, auto and motorcycle circuit, communication circuit, consumer electronics, etc. In addition, it offers bank, smart meter, social security, and smart transportation card solutions. Further, the company designs, develops, and sells IC testing software and products; produces probe cards; and offers research and consultancy services of IC technology, as well as testing services for IC products. The company was formerly known as Shanghai Fudan Microelectronics Company Limited. Shanghai Fudan Microelectronics Group Company Limited was founded in 1998 and is headquartered in Shanghai, the People's Republic of China.", "currency": "HKD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "HKG", "market": "hk_market", "country": "China", "city": "Shanghai"}, "195870.KS": {"short_name": "HAESUNG DS", "long_name": "HAESUNG DS Co., Ltd.", "summary": "HAESUNG DS Co., Ltd. manufactures and sells semiconductor components in South Korea and internationally. The company offers lead frames for use in automotive, mobile device, personal computer, and consumer electronics applications; package substrates for use in flash memory, mobile DRAM, and graphic DRAM applications; and graphene for application in the energy, sensor, bio, military, ink, and display industries. It is also involved in developing bio healthcare sensors, which enables in checking physical activity and status of health, as well as applying sensors to wearable and IT devices. The company was founded in 1984 and is headquartered in Seoul, South Korea.", "currency": "KRW", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}, "2302.TW": {"short_name": "RECTRON", "long_name": "Rectron Limited", "summary": "Rectron Limited manufactures and sells discrete semiconductors in Taiwan and internationally. Its products include bridge rectifiers, ESD diodes, high voltage products, recovery rectifiers, schottky diodes, signal-switching diodes, silicon carbide schottky, standard rectifiers, transistors, TVS and zener diodes, MOSFET, and other products. Rectron Limited was founded in 1976 and is based in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "2336.HK": {"short_name": "HAILIANG INTL", "long_name": "Hailiang International Holdings Limited", "summary": "Hailiang International Holdings Limited, an investment holding company, sells semiconductors and related products, and metals in Hong Kong, rest of the People's Republic of China, Australia, Singapore, and internationally. The company is also involved in the development and provision of electronic turnkey device solutions, including the manufacture and sale of microcontrollers for home electrical appliances. In addition, it engages in the property development business; and sale of metals, such as copper and nickel. The company was formerly known as Sunlink International Holdings Limited and changed its name to Hailiang International Holdings Limited in February 2015. The company is headquartered in Central, Hong Kong. Hailiang International Holdings Limited is a subsidiary of Rich Pro Investments Limited.", "currency": "HKD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "2338.TW": {"short_name": "TAIWAN MASK CORP", "long_name": "Taiwan Mask Corporation", "summary": "Taiwan Mask Corporation engages in the design, development, production, and sale of photomasks and integrated circuits for the semiconductor industry. The company also provides technology assistance, consultation, inspection, and maintenance services for masks and circuits; foundry services to semiconductor design companies; and packaging and testing services. In addition, it manufactures and sells medical wares. The company has operations in Taiwan, Asia, the Americas, and internationally. Taiwan Mask Corporation was founded in 1988 and is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "2369.TW": {"short_name": "LINGSEN PRECISION INDUSTRIES", "long_name": "Lingsen Precision Industries, Ltd.", "summary": "Lingsen Precision Industries, Ltd. operates in semiconductor industry in Taiwan, the United States, Europe, Japan, and China. It offers assembly and testing services. The company was founded in 1970 and is headquartered in Taichung, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taichung"}, "2436.TW": {"short_name": "WELTREND SEMI-CONDUCTOR INC", "long_name": "Weltrend Semiconductor, Inc.", "summary": "Weltrend Semiconductor, Inc., a fabless semiconductor company, engages in planning, designing, testing, developing, and distributing integrated circuit (IC) products in Taiwan and internationally. The company offers display ICs, including advanced driver assistance system SoC, display MCU, FPD SoC, and 3D active shutter glasses ICs; and consumer ICs, such as consumer MCUs, touch device controllers, heart rate monitors, USB HID controllers, boosted NFC card solutions, MSR and barcode decoders, and I/O expanders. It also provides power management and analog ICs comprising USB power and charging port controllers, motor drivers, LED drivers, SPS supervisors, and OP amplifiers; and microcontrollers include 8-bit ADC type MCUs, Andes and Arm based 32-bit MCUs products, and BLDC motor control ICs. In addition, the company distributes electronic components. Weltrend Semiconductor, Inc. was founded in 1989 and is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "2455.TW": {"short_name": "VISUAL PHOTONICS EPITAXY CO LTD", "long_name": "Visual Photonics Epitaxy Co., Ltd.", "summary": "Visual Photonics Epitaxy Co., Ltd. provides solutions for wireless communications, optical fiber communications, and solar cell applications. The company offers GaAs heterojunction bipolar transistor (HBT), low turn-on voltage HBT, high voltage HBT, InP HBT and HEMT, GaAs PHEMT and BiHEMT, and GaN epi wafers. It also provides GaAs PD, InGaAs PD and APD, Zn diffusion ready InGaAs PD and APD, long wavelength InGaAs PD, F-P and DFB LD, an VCSEL epi wafers; and solar cell epi wafers. In addition, the company offers customerized epi foundry services. Visual Photonics Epitaxy Co., Ltd. was founded in 1996 and is based in Taoyuan City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "2481.TW": {"short_name": "PAN JIT INTERNATIONAL INC", "long_name": "Pan Jit International Inc.", "summary": "Pan Jit International Inc. designs, manufactures, and sells diodes, bridge rectifiers, transistors, MOSFETs, and protection devices worldwide. It offers Schottky rectifiers; SiC Schottky diodes for use in servers, solar inverters, power supplies, and other applications; and diode rectifiers. The company also provides Schottky and general purpose bridges; Zener diode products; low/medium/high voltage MOSFETs; ESD protection and transient voltage suppressor devices; and bipolar junction transistors. Its products are used in LED lighting, adapter, automotive, and industrial applications. The company was founded in 1986 and is headquartered in Kaohsiung, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Kaohsiung"}, "2493.TW": {"short_name": "AMPOC FAR EAST CO", "long_name": "Ampoc Far-East Co., Ltd.", "summary": "Ampoc Far-East Co., Ltd. manufactures and sells equipment and materials for the electronic industry in Taiwan. Its products have applications in printed circuit boards, FPD and touch panels, IC packaging, light emitting diode and OLED, solar cells, IC wafers and substrates, passive devices and components, MEMS, consumables and others, and inspection tools. The company offers its products in Mainland China and Hong Kong through its service centers and distribution channels. AMPOC Far-East Co., Ltd. was founded in 1980 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "281820.KS": {"short_name": "KCTECH", "long_name": "KCTech Co., Ltd.", "summary": "KCTech Co., Ltd. engages in the manufacture and distribution of semiconductor systems, display systems, and electronic materials in South Korea. The company offers semiconductor equipment, including chemical mechanical polishing systems and wet cleaning systems; display equipment, such as wet stations, atmospheric pressure plasma cleaners, CO2 clearers, and coater and tract systems; and electronic materials comprising dielectric slurry and additive, and metal slurry products. KCTech Co., Ltd. was founded in 1987 and is headquartered in Anseong, South Korea.", "currency": "KRW", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Anseong"}, "300080.SZ": {"short_name": "HENAN YICHENG NEW", "long_name": "Henan Yicheng New Energy Co., Ltd.", "summary": "Henan Yicheng New Energy Co., Ltd. manufactures graphite electrodes. The company was founded in 2002 and is based in Kaifeng City, China. Henan Yicheng New Energy Co., Ltd. operates as a subsidiary of China Pingmei Shenma Energy & Chemical Group Co., Ltd.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Kaifeng"}, "300316.SZ": {"short_name": "ZHEJIANG JINGSHENG", "long_name": "Zhejiang Jingsheng Mechanical & Electrical Co., Ltd.", "summary": "Zhejiang Jingsheng Mechanical & Electrical Co., Ltd. engages in the manufacture and sale of semiconductor equipment and LED substrate material. The company provides automatic crystal growing furnaces; silicon float zone crystal pullers; semiconductor mono-crystalline silicon truncating, semiconductor single and full automatic crystal ingot rolling and grinding integrated, full automatic 8-inch semiconductor wafer polishing, 32B double-sided grinding, semiconductor silicon ingot diamond wire truncating, and semiconductor single crystal silicon polishing machines; semiconductor valves and fittings; magnetic fluid vacuum sealing devices; semiconductor silicon polishing fluid; and semiconductor synthetic sand quartz crucible. It also offers automatic crystal growing, multi-crystalline silicon, and CFZ float zone silicon monocrystal furnaces; silicon block chamfering and grinding integrated, silicon block and silicon ingot single diamond wire cutting, silicon ingot squaring and grinding integrated, silicon diamond wire cutting, crystal ingot single wire squaring, and monocrystal rounding and grinding machines; stringers; and PECVD products. In addition, the company provides sapphire crystal products; fully automatic sapphire crystal growth furnaces; sapphire cutters, grinders, mounters, and substrates; sapphire truncating, automatic crystal rounding and grinding, and automatic sapphire chemical polishing machines; and customized optical panels. Further, it offers module automatic, poly-crystalline silicon ingot prosessing automatic, automatic battery, and LED bulb lamp automatic production line products; and unmanned polishing workshop and mono-crystalline silicon ingot auto testing line products. The company was founded in 2006 and is based in Shaoxing, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Shaoxing"}, "300323.SZ": {"short_name": "HC SEMITEK CORPORA", "long_name": "HC SemiTek Corporation", "summary": "HC SemiTek Corporation researches, develops, produces, and sells light emitting diode (LED) epitaxial wafers and chips in China. It offers full color series of LED wafer and chips used in full-color LED display screens, back light, illumination, etc. The company also provides monocrystalline sapphire, sapphire substrate, and other sapphire window materials; and integrated magnetic sensor and magnetic module solutions. The company was formerly known as Wuhan HC SemiTek Co., Ltd and changed its name to HC SemiTek Corporation. HC SemiTek Corporation was founded in 2005 and is based in Wuhan, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Wuhan"}, "300623.SZ": {"short_name": "JIANGSU JIEJIE MIC", "long_name": "Jiangsu JieJie Microelectronics Co.,Ltd.", "summary": "Jiangsu JieJie Microelectronics Co.,Ltd. designs, manufactures, and markets semiconductor discrete components and power electronic devices in China and internationally. It offers thyristor wafers, including TRIACS, SCRS, power transistors, Darlington transistors, etc.; protective device wafers, such as TSS, SIDAC, TVS, ESD, etc.; and FRD wafers comprising FRD, STD, etc. The company also provides triode device packaging and testing products; and diode device packaging and testing products. Its products are used in washing machines, vacuum cleaners, electronic fans, water purifiers, instant electronic showers, negative ion generators, and leakage circuit breakers. The company was founded in 1995 and is based in Qidong, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Qidong"}, "300666.SZ": {"short_name": "KONFOONG MATERIALS", "long_name": "Konfoong Materials International Co., Ltd", "summary": "Konfoong Materials International Co., Ltd. develops, manufactures, and sells metal materials and sputtering targets for the semiconductor and integrated circuit industries in Europe, the United States, Japan, South Korea, Southeast Asia, Taiwan, and Mainland China. The company offers semiconductor targets; metal sputtering targets and backing plates for the solar industry; and metal sputtering target and spare parts for the liquid crystal displays, and shield plates for PVD and liquid crystal glass handing parts for carbon fiber reinforced plastics. It also provides precision parts for semiconductors; clamp rings and collimators for PVD tools; face plates and shower heads for CVD and etching tools; and diamond disks and retainer rings for CMP tools. In addition, the company offers materials for applications in sputtering targets, anodes, solar products, audio devices, vacuum electron devices and cables, etc., as well as technical support services. Konfoong Materials International Co., Ltd. was founded in 2005 and is based in Yuyao, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Yuyao"}, "300751.SZ": {"short_name": "SUZHOU MAXWELL TEC", "long_name": "Suzhou Maxwell Technologies Co., Ltd.", "summary": "Suzhou Maxwell Technologies Co., Ltd. develops, produces, and sells production equipment for the solar cell and OLED panel industries. It also offers solar screen printing equipment. The company was founded in 2008 and is based in Suzhou, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Suzhou"}, "3016.TW": {"short_name": "EPISIL PRECISION INCORPORATION", "long_name": "Episil-Precision Inc.", "summary": "Episil-Precision Inc. engages in the research, development, production, and sale of epitaxial Si/SiC/GaN wafers in Taiwan and internationally. The company's products include epitaxial wafers, such as silicon epitaxial, SiC on SiC epitaxial, and GaN on Si epitaxial wafers for use in power discretes, power ICs, image sensors, graded Epis, buried layer Epis, and multi-layer Epis. It also provides buried layer epitaxial services. The company was founded in 1998 and is headquartered in Hsinchu City, Taiwan. Episil-Precision Inc. is a subsidiary of Episil Holding Inc.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "3033.TW": {"short_name": "WEIKENG INDUSTRIAL CO", "long_name": "Weikeng Industrial Co., Ltd.", "summary": "Weikeng Industrial Co., Ltd. distributes electronic components and peripherals for computing, communications, consumer, automotive, and industrial applications in Taiwan. The company offers storage, micro controller, embedded processor, power discrete IC, sensing and display, discrete and passive components, programmable logic and display systems, ESD protection, connectors, digital audio/video, and USB products. It also offers technical support services; and data center, IoT application, data and communications, automotive, networking, industrial electronics, and consumer solutions. Weikeng Industrial Co., Ltd. was founded in 1977 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "3035.TW": {"short_name": "FARADAY TECHNOLOGY", "long_name": "Faraday Technology Corporation", "summary": "Faraday Technology Corporation operates as a fabless ASIC/SoC and silicon intellectual property (IP) provider worldwide. The company offers SoC design services and evaluation platforms; and ASIC services. It also provides IP products, including library and memory compilers, processor cores, analog IPs, peripheral IPs, and interface IPs. The company offers design solutions for a range of applications comprising consumer electronics, multimedia, display, communication, networking, and PC peripheral/storage. Faraday Technology Corporation was founded in 1993 and is headquartered in Hsinchu City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "3055.TW": {"short_name": "SPIROX CORP", "long_name": "Spirox Corporation", "summary": "Spirox Corporation provides integrated solutions to the semiconductor, electronics manufacturing, telecom, and automobile markets worldwide. The company offers wafer level test handlers, analog/mixed signal and logic options, chuck systems, testers, thermal emission microscopes, semiconductor test systems, mass production test handlers, automatic probers, power device test systems, fluxless reflow systems, wafer inspection systems, probe cards, dockings, LCD driver IC test systems, and memory test systems. Spirox Corporation has partnerships with AFORE Oy; ERS electronic GmbH; EXICON Co., Ltd.; Hamamatsu Corporation; HANWA Electronic Ind. Co., Ltd.; Northstar Technologies Limited; OSAI A.S.; SEMICS Inc.; ShibaSoku Corporation; STI Co. Ltd.; Toray Engineering Co., Ltd.; Translarity Inc.; Turbodynamics GmbH; and YIK Corporation. The company was founded in 1987 and is headquartered in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu"}, "3436.T": {"short_name": "SUMCO CORPORATION", "long_name": "Sumco Corporation", "summary": "Sumco Corporation, together with its subsidiaries, manufactures and sells silicon wafers for the semiconductor industry primarily in Japan, North America, Asia, and Europe. It provides monocrystalline ingots, as well as polished, annealed, epitaxial, junction isolated, silicon-on-insulator, and reclaimed polished wafers. The company was formerly known as Sumitomo Mitsubishi Silicon Corp. and changed its name to Sumco Corporation in August 2005. Sumco Corporation was founded in 1999 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3532.TW": {"short_name": "FORMOSA SUMCO TECHNOLOGY CORP", "long_name": "Formosa Sumco Technology Corporation", "summary": "Formosa Sumco Technology Corporation manufactures, sells, and trades in primarily in Taiwan. It offers polished, annealed, epitaxial, and test wafers. The company was founded in 1995 and is headquartered in Yunlin, Taiwan. Formosa Sumco Technology Corporation is a subsidiary of Sumco Techxiv Corporation.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Yunlin"}, "39YA.F": {"short_name": "RUBICON TECHN. NEW DL-001", "long_name": "Rubicon Technology, Inc.", "summary": "Rubicon Technology, Inc. provides monocrystalline sapphire for applications in optical and industrial systems. It operates in Sapphire and Pharmacy segments. The company offers optical and industrial sapphire products in various shapes and sizes, including round and rectangular windows and wafers, domes, tubes, and rods for a range of end markets comprising defense and aerospace, specialty lighting, instrumentation, sensors and detectors, semiconductor process equipment, electronic substrates, medical, and laser applications. It also provides medications and vitamins to patients being discharged from skilled nursing facilities. The company markets and sells its products through its direct sales force in North America, Europe, and Asia. Its principal customers include defense subcontractors, industrial manufacturers, fabricators, and resellers. The company was founded in 2001 and is headquartered in Bensenville, Illinois.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Bensenville"}, "4238.T": {"short_name": "MIRAIAL CO.LTD", "long_name": "Miraial Co., Ltd.", "summary": "Miraial Co., Ltd. engages in the manufacture and sale of plastic and metal machining for semiconductor, automotive, medical device, and electronic components industries in Japan. The company offers wafer handling products, including wafer shipping and processing; fluid system products, such as fittings; and electrical components that include fluoro terminals. It also manufactures and distributes various vertical molding machines and metal molds; and offers plastic and metal processing services. The company was formerly known as Kakizaki Manufacturing Co., Ltd. and changed its name to Miraial Co., Ltd. in August 2003. Miraial Co., Ltd. was founded in 1968 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4IH.F": {"short_name": "ICHOR HLDGS LTD  DL-,0001", "long_name": "Ichor Holdings, Ltd.", "summary": "Ichor Holdings, Ltd. engages in the design, engineering, and manufacture of fluid delivery subsystems and components for semiconductor capital equipment. It primarily offers gas and chemical delivery subsystems that are used in the manufacturing of semiconductor devices. The company's gas delivery subsystems deliver, monitor, and control gases used in semiconductor manufacturing processes, such as etch and deposition; and chemical delivery subsystems blend and dispense the reactive liquid chemistries used in semiconductor manufacturing processes comprising chemical-mechanical planarization, electroplating, and cleaning. It also manufactures precision machined components, weldments, and proprietary products for use in fluid delivery systems. The company operates in the United States, Europe, Singapore, and internationally. Ichor Holdings, Ltd. was founded in 1999 and is headquartered in Fremont, California.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Fremont"}, "5384.T": {"short_name": "FUJIMI INC", "long_name": "Fujimi Incorporated", "summary": "Fujimi Incorporated manufactures and sells synthetic precision abrasives in Japan, rest of Asia, North America, and Europe. The company offers various products for crystal silicon ingots, lapping, and polishing silicon wafers; abrasives used in the production of semiconductor devices, such as CMP slurry and other materials; and polishing products for magnetic disks of the hard disk drives. It also provides specialty materials, including lapping, polishing, and diamond products, as well as polishing pads and catalyst carriers for use in electronic components, lighting and LED products, automobiles, lenses, power semiconductors, and other products. In addition, the company offers thermal spray materials for use in aerospace, semiconductor liquid crystal, steel, energy, chemical, and other industries. Fujimi Incorporated was founded in 1950 and is headquartered in Kiyosu, Japan.", "currency": "JPY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kiyosu"}, "5434.TW": {"short_name": "TOPCO SCIENTIFIC CO", "long_name": "Topco Scientific Co.,Ltd.", "summary": "Topco Scientific Co., Ltd. provides precision materials, processing equipment, and components for semiconductor and opto-electronic industries in Taiwan, China, and internationally. It also offers semiconductor related products, such as wafer and wafer processing materials; wafer carriers; thin films; photolithography materials; etching and furnace products, including quartz glass products, chemical, and special gases; CMP slurry products; package and testing related materials and equipment; and semiconductor equipment. In addition, the company offers LCD related equipment and materials; LED related photoelectric related products; solar materials comprising conductive paste for solar cells, quartz crucibles, SiC powder, coolants, diamond wires, chemicals, and special gases; and electronic materials. Further, it undertakes water treatment, clean room and electromechanical, and public construction projects; and solar power plant projects, as well as provides IC foundry services. The company was founded in 1990 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "558.SI": {"short_name": "UMS", "long_name": "UMS Holdings Limited", "summary": "UMS Holdings Limited, an investment holding company, provides high precision front-end semiconductor components, and electromechanical assembly and final testing services. It operates in two segments, Semiconductor and Others. The Semiconductor segment offers precision machining components and equipment modules for semiconductor equipment manufacturers. The Others segment provides water disinfection systems shipment services; and supplies base components to oil and gas original equipment manufacturers, as well as trades in nonferrous metal alloys. The company also offers precision machining services, including milling, lathe, horizontal, cleaning, anodizing, and CMM; metal finishing services, such as electroless and selective nickel, anodizing, plating, e-polish, chemical cleaning, and parts refurbishment; and system integration, refurbishment, prototyping, and vendor managed inventory services, as well as electroplating services. In addition, it is involved in the assembly and integration of equipment and automated assembly lines; manufacture and assembly of stainless steel gaslines and weldment products; manufacture and repair of waste water treatment equipment; and holding of investment properties. The company serves semiconductor, electronic, machine tools, aerospace, and oil and gas industries. It operates in Singapore, Malaysia, Taiwan, the United States, South Korea, the People's Republic of China, and internationally. UMS Holdings Limited was incorporated in 2001 and is headquartered in Singapore.", "currency": "SGD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "575.SI": {"short_name": "ASTI^", "long_name": "ASTI Holdings Limited", "summary": "ASTI Holdings Limited, an investment holding company, engages in the provision of semiconductor manufacturing services for surface mount technology components in Singapore, China, Malaysia, the Philippines, the United States, the United Kingdom, and internationally. It operates in two segments, Back-end Equipment Solutions and Technologies, and Distribution and Services. The company provides tape and reel packaging, and integrated circuit programming services to original equipment manufacturers, contract manufacturers, and component distributors. It also offers solutions and technologies in the back-end, including assembly, test, and finishing activities; and semiconductor application in consumer electronics, computer peripheral, and communication solutions. In addition, the company manufactures and distributes carrier tapes and plastic reels; and develops chip packaging and related technologies. Further, it offers equipment contract manufacturing services comprising turnkey manufacturing, assembly, and machining services for the semiconductor, medical, scientific, and precision tooling industries; trades in electronic components and computer peripherals, equipment, and materials; and acts as a commission agent, as well as engages in the property investment activities. Additionally, the company is involved in the construction of antique wooden sea boats, communication of culture, exhibition, conference activities, etc.; and development and management of a mixed-use property. ASTI Holdings Limited was incorporated in 1999 and is based in Singapore.", "currency": "SGD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "5DQ2.F": {"short_name": "DAQO NEW ENERGY CRP.ADR 5", "long_name": "Daqo New Energy Corp.", "summary": "Daqo New Energy Corp., together with its subsidiaries, manufactures and sells polysilicon to photovoltaic product manufactures in the People's Republic of China. It offers ready-to-use polysilicon, and packaged to meet crucible stacking, pulling, and solidification products. The company was formerly known as Mega Stand International Limited and changed its name to Daqo New Energy Corp. in August 2009. Daqo New Energy Corp. was founded in 2006 and is based in Wanzhou, the People's Republic of China.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "China", "city": "Wanzhou"}, "5DQ2.MU": {"short_name": "DAQO NEW ENERGY CRP.ADR 5", "long_name": "Daqo New Energy Corp.", "summary": "Daqo New Energy Corp., together with its subsidiaries, manufactures and sells polysilicon to photovoltaic product manufactures in the People's Republic of China. It offers ready-to-use polysilicon, and packaged to meet crucible stacking, pulling, and solidification products. The company was formerly known as Mega Stand International Limited and changed its name to Daqo New Energy Corp. in August 2009. Daqo New Energy Corp. was founded in 2006 and is based in Wanzhou, the People's Republic of China.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "MUN", "market": "dr_market", "country": "China", "city": "Wanzhou"}, "600171.SS": {"short_name": "SHANGHAI BELLING CORP. LTD", "long_name": "Shanghai Belling Co., Ltd.", "summary": "Shanghai Belling Co., Ltd. operates in IC industry in China. Its products include power management, AC/DC converters, electric energy metering circuits, LED drive ICs, interface circuits, ADC circuits, MCU, EEPROM, MOSFET and discrete devices, and smoke detector circuits. The company was founded in 1998 and is based in Shanghai, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Shanghai"}, "600206.SS": {"short_name": "GRINM ADVANCED MATERIALS CO LTD", "long_name": "Grinm Advanced Materials Co., Ltd.", "summary": "Grinm Advanced Materials Co., Ltd. engages in the research and development, manufacture, and sale of advanced materials in the nonferrous metals industry in China. The company offers rare earth (RE) magnetic materials, including RE permanent magnets, RE giant magneto-strictive materials, RE magnetic refrigerant materials, etc.; and RE luminescent materials, such as aluminates, nitrides, silicofluorides, metal halides, etc. It also provides RE compounds comprising RE oxides; salts and composites with various purities, particle sizes, and special microstructures, including anhydrous RE halides; and Zr-based composite RE oxides, such as ScZr, YZr, and CeZr. In addition, the company offers RE metals; RE alloys, which include DyFe, HoCu, Y-Al, and Er-Al; optoelectronic film materials consisting of high purity metal materials, and sputter target and evaporation materials used in electronic information industry; biomedical materials, including SMA vascular stent-grafts, archenteric stents, correction instruments for pectus excavatum, and orthodontic devices; rare and precious metals; and optical fiber application materials, such as GeCl4, Sicl4, and other high-purity optical fiber application materials. Further, it provides infrared optical materials comprising standard and multispectral ZnS, CVD ZnSe, chalcogenide glasses, and various optical polishing and coating products; and photoelectric materials consisting of HB-GaAs, germanium and GaP monocrystals, GaAs monocrystals, infrared optical germanium monocrystals, and dislocation germanium monocrystals, as well as technology consulting services. Grinm Advanced Materials Co., Ltd. was founded in 1999 and is based in Beijing, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Beijing"}, "600360.SS": {"short_name": "JILIN SINO-MICOELECTRONICS", "long_name": "Jilin Sino-Microelectronics Co., Ltd.", "summary": "Jilin Sino-Microelectronics Co., Ltd. designs, manufactures, and markets semiconductor devices in China and internationally. The company provides bipolar transistor, field effect transistor, schottky diode, SCR, fast recovery diode, insulated gate bipolar transistor, discharge tube, LED lighting driver, and intelligent power module. It also involved in foundry business of power semiconductor discrete devices; and chip processing, packaging testing, and product marketing activities. Jilin Sino-Microelectronics Co., Ltd. is based in Jilin City, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Jilin City"}, "600460.SS": {"short_name": "HANGZHOU SILAN MICROELECTRONICS", "long_name": "Hangzhou Silan Microelectronics Co., Ltd", "summary": "Hangzhou Silan Microelectronics Co., Ltd. designs, manufactures, and sells integrated circuits (ICs) in China. The company offers MCU products; power management products, including AC-DC and DC-DC convertors; isolated and non-isolated constant-current LED drivers, linear drives, and DC-DC LED drivers; high and low voltage motor driver modules, and gate drivers; and audio power amplifier/headphone drivers, volume/sound effect control circuits, AM/FM tuner/stereo demodulators, and PLL/frequency display circuits for AM/FM receivers. It also provides CD/DVD optical pick-up drivers, digital audio SOC circuits, and servo decoding ICs; VFD/LCD/LED drivers for machine display panels, electronic fan control transmitter/receiver circuits, telephone circuits, high frequency head ICs, remote control encoders/decoders, toy remote control encoders/decoders, and low drop-out regulators; MEMS sensors, such as accelerometer sensors, inertial modules, geomagnetic sensors, ALS and PS sensors, VSCEL sensors, heart rate sensors, and Si-microphone sensors; measurement ICs, including multi-meter circuits; and discrete devices comprising transistors, diodes, MOSFETs, and modules. The company offers its products for use in LED display, industrial, audio-visual, consumer, automotive, toy, and LED lighting products, as well as for home appliances. Hangzhou Silan Microelectronics Co., Ltd. was founded in 1997 and is based in Hangzhou, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Hangzhou"}, "600667.SS": {"short_name": "WUXI TAIJI INDUSTRIAL CO. LTD.", "long_name": "Wuxi Taiji Industry Company Ltd.", "summary": "Wuxi Taiji Industry Company Ltd. primarily engages in semiconductor packaging assembly and test, chemical fibers, tire cord fabrics, and conveyor belt fabrics businesses in China and internationally. The company's semiconductor post processing business is involved in the IC chips probe test, packaging assembly, packaging test, and module assembly and test; and chemical fiber business engages in the research, development, production, and sales of polyester industrial yarns, dipped conveyor belt fabrics, dipped tire cord fabrics, canvas, etc. It is also involved in the engineering design and general contracting business in the field of photovoltaics. The company's products application include agriculture, industry, transportation, infrastructure, environmental protection, construction, protection, automobile manufacturing, etc. The company was founded in 1966 and is based in Wuxi, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Wuxi"}, "600817.SS": {"short_name": "ZHENGZHOU DEHENG HONGSHENG TECH", "long_name": "Zhengzhou Deheng Hongsheng Technology Co., Ltd.", "summary": "Zhengzhou Deheng Hongsheng Technology Co., Ltd. engages in the house leasing business in China. The company leases its underground garage as a parking lot. It is also involved in the research and development, production, and sale of automotive interiors, such as car seat covers, curtains, custom-made carpets, RV decks, and soft cases for dashboards, etc. The company was formerly known as Xi'an Hongsheng Technology Co., Ltd. The company is based in Zhengzhou, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Zhengzhou"}, "601012.SS": {"short_name": "LONGI GREEN ENERGY TECHNOLOGY C", "long_name": "LONGi Green Energy Technology Co., Ltd.", "summary": "LONGi Green Energy Technology Co., Ltd. manufactures and sells single crystal silicon products worldwide. It offers single crystal silicon rod; and monocrystalline silicon, battery components, distributed power station, and ground power station products. The company was formerly known as Xi'an LONGI Silicon Materials Corp. and changed its name to LONGi Green Energy Technology Co., Ltd. in January 2017. LONGi Green Energy Technology Co., Ltd. was founded in 2000 and is headquartered in Xi'an, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Xi'an"}, "601908.SS": {"short_name": "BEIJING JINGYUNTONG TECHNOLOGY ", "long_name": "Beijing Jingyuntong Technology Co., Ltd.", "summary": "Beijing Jingyuntong Technology Co., Ltd., together with its subsidiaries, manufactures and sells photovoltaic (PV) and semiconductor equipment in China. The company's products include mono-crystal growers, multi-crystalline directional solidification growers, and float-zone furnace. It also provides PV material products, such as mono and multi crystal ingots and wafers, as well as PV and wind power generation stations, and honeycomb medium and low temperature SCR flue gas denitrification catalyst. Beijing Jingyuntong Technology Co., Ltd was founded in 2002 and is headquartered in Beijing, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Beijing"}, "603290.SS": {"short_name": "STARPOWER SEMICONDUCTOR LTD", "long_name": "StarPower Semiconductor Ltd.", "summary": "StarPower Semiconductor Ltd. researches, develops, produces and sells power semiconductor components worldwide. The company offers IGBT, MOSFET, IPM, FRD, SiC, and other modules. Its products are used in energy vehicles, inverters, inverter welding machines, ups, photovoltaic/wind power, SVG, white goods, and other fields. The company was founded in 2005 and is headquartered in Jiaxing, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Jiaxing"}, "603806.SS": {"short_name": "HANGZHOU FIRST APPLIED MATERIAL", "long_name": "Hangzhou First Applied Material Co., Ltd.", "summary": "Hangzhou First Applied Material Co., Ltd. designs, develops, manufactures, and sells photovoltaic encapsulation materials in China. The company offers encapsulant EVA films, polyolefin films, and backsheet materials for PV modules; dry film photoresists and flexible copper clad laminates; aluminum laminated films; silicone encapsulant for LED; and co-polyamide hot melt web, a double-sided adhesive non-woven fabric used in the bonding of fabric, leather, metal, plastic, microfiber, non-woven fabric, wood, paper, and other materials. It also exports its products. The company was formerly known as Hangzhou First PV Material Co., Ltd. and changed its name to Hangzhou First Applied Material Co., Ltd. in March 2017. The company was founded in 2003 and is based in Hangzhou, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Hangzhou"}, "605111.SS": {"short_name": "WUXI NCE POWER CO LTD", "long_name": "Wuxi NCE Power Co., Ltd.", "summary": "Wuxi NCE Power Co., Ltd. engages in the research and development, and marketing of semiconductor power devices in China. It offers N-MOSFET, P-MOSFET, and N+P MOSFET discrete devices that are used in various applications, such as lithium battery protection modules, consumer electronics power supply products, uninterruptible power supply products, inverter and various electric power suppliers, portable digital power management systems, electric vehicle controllers, and LED illumination products. The company also provides super trench MOSFETs; super junction MOSFETs that are used in batteries of computers and servers, HID/LED illumination, industrial and roadway illumination, adaptors of PC and printer, and consumer electronics; and IGBT products for use in motor drive, welding, UPS, frequency converter, industrial inverter, solar converter, induction heating, and resonant switch applications. Its products are used in consumer electronic, electrical vehicle, mobile terminal, power management, illumination, and industrial applications. The company was founded in 2013 and is headquartered in Wuxi, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Wuxi"}, "6176.TW": {"short_name": "RADIANT OPTO-ELECTRONICS CORP", "long_name": "Radiant Opto-Electronics Corporation", "summary": "Radiant Opto-Electronics Corporation designs, manufactures, assembles, and markets backlight modules and light guide plates for liquid crystal display (LCD) panels in Asia, Europe, and the United States. The company's backlight modules are used in various applications, including smartphones, DSC, smart speakers, vehicle panels, tablets, notebooks, dashboards, pocket TVs, DVD players, car navigations, monitors, all in one PCs, and TFT LCD TVs. Radiant Opto-Electronics Corporation was founded in 1995 and is headquartered in Kaohsiung, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Kaohsiung"}, "6257.TW": {"short_name": "SIGURD MICROELECTRONICS CORP", "long_name": "Sigurd Microelectronics Corporation", "summary": "Sigurd Microelectronics Corporation, together with its subsidiaries, engages in the design, processing, testing, burn-in treatment, manufacture, and trading of integrated circuits in Taiwan, Singapore, China, the United states, and internationally. The company provides testing services for various IC and wafers; TSOT and STO packaging; quad flat no lead packaging; RF module packaging and testing; photosenaor packaging and testing; wafer level chip scale package technology; solder bumping; and Cu-pillar. It also offers assembly services comprise wafer grinding and chip sawing, and MEMS, multi-chip ICs, RF modules, optical device, and analog/power ICs assembly services. In addition, the company provides research and development, and engineering services, including mass production, test engineering, and assembly engineering solutions. Further, it is involved in manufacture and sale of medical equipment; provision of digital information supply services; and commodity broker businesses. The company serves semiconductor design houses, IDMs, and wafer foundries. The company was formerly known as More Power Electronic Co., Ltd. Sigurd Microelectronics Corporation was founded in 1988 and is headquartered in Hsin-Chu, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu City"}, "6278.TW": {"short_name": "TAIWAN SURFACE MOUNTING TECHNOL", "long_name": "Taiwan Surface Mounting Technology Corp.", "summary": "Taiwan Surface Mounting Technology Corp. provides LCD surface-mount technology production solutions in Mainland China, Taiwan, Europe, the United States, Asia, and internationally. It offers digital camera and cellular phone LCD panel control boards; notebook and television TFT-LCD panel control boards; LED TV power supply control boards; and LCD TV inverter control boards. The company also provides micro projector and touch panel control boards, wireless controllers, DVD R/W control boards, TV set control boards, refrigerator display panels, and lighting application control boards; and digital camera/cellular, automotive dashboard panel, note book, and PC/LCD television backlight bars. Taiwan Surface Mounting Technology Corp. was founded in 1990 and is headquartered in Taoyuan City, Taiwan.", "currency": "TWD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "6323.T": {"short_name": "RORZE CORP", "long_name": "Rorze Corporation", "summary": "Rorze Corporation engages in the design, development, manufacture, and sale of automation systems for the semiconductor and flat panel display production worldwide. The company offers wafer handling systems, including atmospheric robots, vacuum wafer robots, aligners, load ports, vacuum platforms, EFEMs/sorters, and stockers; and mask/reticle handling systems. It also provides system integration and package service, as well as host online communication, equipment control, and EDA/interface A solutions; and control devices, such as controllers, and stepping motors and drivers. In addition, the company offers life science automation products comprising mechatronics CO2 incubators, cell keepers, twist decappers and incubators, heat sealers, power seals, varistocks, and cell farms and shots. Further, it is involved in manufacturing of robot for semiconductor production equipment; the processing and export of machinery parts for robots; and importing, selling, maintaining, and broking equipment and parts. The company was founded in 1985 and is headquartered in Fukuyama, Japan.", "currency": "JPY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Fukuyama"}, "6337.T": {"short_name": "TESEC CORP", "long_name": "TESEC Corporation", "summary": "TESEC Corporation designs, develops, manufactures, and sells semiconductor test equipment in Japan and internationally. It offers various test systems, including discrete device test systems, thermal resistance testers, inductive load testers, dynamic test systems, IPD/IPM test systems, and internal gate resistance testers. The company also provides various handlers comprising micro electro mechanical systems, strip test, film frame test, gravity, pick and place, discrete, and TAB handlers, as well as die sorters. In addition, it offers after-sales services, such as tester calibration, overhaul, and training services, as well as spare parts, warranty, maintenance, and resale services. The company was formerly known as TES Corporation and changed its name to TESEC Corporation in 1980. TESEC Corporation was founded in 1969 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6387.T": {"short_name": "SAMCO INC", "long_name": "SAMCO Inc.", "summary": "SAMCO Inc. manufactures and sells operates as a semiconductor and materials company. The company primarily offers thin film deposition, microfabrication, cleaning, and surface treatment products. Its deposition systems include anode and cathode PECVD systems, atomic layer deposition systems, and silicon carbide (SiC) chemical vapor deposition systems; and etching systems comprise reactive ion etching systems, inductively coupled plasma (ICP) etch systems for general purpose, ICP etch systems for SiC etching, ICP etch systems for batch processing, silicon deep reactive ion etching systems, and XeF2 etch systems for MEMS release. The company also provides cleaning systems consisting of plasma cleaners, remote source plasma cleaners, and UV-ozone cleaners; and basic plasma research kits. It serves MEMS, laser diode, high brightness LED, TSV, SAW device, and RF device markets. The company was formerly known as SAMCO International, Inc. and changed its name to SAMCO Inc. in December 2004. SAMCO Inc. was founded in 1979 and is headquartered in Kyoto, Japan.", "currency": "JPY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kyoto"}, "6596.T": {"short_name": "TSUKUBASEIKO CO LTD", "long_name": "Tsukuba Seiko Co., Ltd.", "summary": "TSUKUBASEIKO Co,.Ltd. engages in the development, manufacture, and sale of electrostatic clamping systems. The company offers thin hand, cordless holder, thin wafer supporter, wafer hand, electrostatic belt, and soft palm products. Its products are used in liquid crystal panel, organic EL, touch panel, semiconductor wafer, solar cell wafer, HDD, fuel cell, printed circuit board, and printing machine industries. The company was founded in 1985 and is based in Kawachi-gun, Japan.", "currency": "JPY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kawachi-gun"}, "6618.T": {"short_name": "OHIZUMI MFG CO LTD", "long_name": "Ohizumi Mfg. Co., Ltd.", "summary": "Ohizumi Mfg. Co., Ltd. manufactures and sells electronics parts and electric equipment/devices primarily in Japan. It offers NTC thermistors, such as thermistors for temperature sensing or temperature compensation, temperature sensors for automobile engines, sensors for car air conditioners, and temperature sensors for room air conditioners, as well as for residential installations and home electric appliances. The company also provides PTC thermistors for over-current protection, demagnetization, heaters, temperature sensing/compensation, and other applications; and metal oxide non-linear resistor varistors for the protection of semiconductors from over-voltage, lighting surge, on-off surge of relays, automotive electronic equipment, etc. In addition, it offers thermistor assemblies for automotive industries, household and housing applications, and thermistor assembly and other applications. The company was formerly known as Ohizumi Aircraft Equipment Manufacturing Co., Ltd. and changed its name to Ohizumi Mfg. Co., Ltd. in 1945. Ohizumi Mfg. Co., Ltd. was founded in 1939 and is headquartered in Sayama, Japan.", "currency": "JPY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Sayama"}, "6627.T": {"short_name": "TERA PROBE INC", "long_name": "Tera Probe, Inc.", "summary": "Tera Probe, Inc. engages in wafer testing, final testing, and test engineering business in Japan and internationally. The company provides testing and test related services for various semiconductor devices, including DRAM, SoC, CPU, image sensors, and analog devices; and test program cross-platform conversion services for debugging, as well as test patterns conversion services to work with testers. It also offers design and development support services, and mass production for various probe cards; and provides card evaluation and parallelism testing services. The company was founded in 2005 and is headquartered in Yokohama, Japan. Tera Probe, Inc. is a subsidiary of Powertech Technology Inc.", "currency": "JPY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Yokohama"}, "6656.T": {"short_name": "INSPEC INC", "long_name": "inspec Inc.", "summary": "inspec Inc. engages in the research, development, manufacture, and sale of visual inspection and measurement equipment, software, and other equipment for the automatic visual inspection of semiconductor and various IT-related devices. The company's products are used for the inspection and verification of semiconductor package boards, precision printed boards, glass mask and film substrates, high density boards, rectangles, LED boards and frames, flexible boards, and TAB tapes. It also offers offline teaching and verification software products; and verification equipment, vane inspection devices, and inline inspection modules, as well as periodic maintenance and calibration, and operational support services. The company was formerly known as Taiyo Mfg.Co.,Ltd. and changed its name to inspec Inc. in January 2001. inspec Inc. was founded in 1984 and is headquartered in Senboku, Japan.", "currency": "JPY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Senboku"}, "688019.SS": {"short_name": "ANJI MICROELECTRONICS TECHNOLOG", "long_name": "Anji Microelectronics Technology (Shanghai) Co., Ltd.", "summary": "Anji Microelectronics Technology (Shanghai) Co., Ltd. engages in the research and development, manufacture, and sale of semiconductor materials worldwide. It offers copper, barrier, TSV, oxide, silicon/polysilicon, Al, and BSI CMP slurries; and stripping/cleaning solutions, such as post Al etch residue removers and bulk photoresist strippers. The company was founded in 2004 and is headquartered in Shanghai, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Shanghai"}, "688127.SS": {"short_name": "ZHEJIANG LANTE OPTICS CO LTD", "long_name": "Zhejiang Lante Optics Co., Ltd.", "summary": "Zhejiang Lante Optics Co., Ltd. manufactures and sells optical products in China. The company offers prisms, lenses, windows, and filters; coatings; molded micro aspherical products; mini prisms and miniature glass spherical/aspheric lenses; car rearview mirrors, logo projection lamps, and car lenses; substrate, carrier, packaged, through hole, and lithography wafers; micro prisms, small lenses, PBS prisms, and etching glasses; imaging glass aspherical lens, laser collimators, FAC lens, and optical communication lens; and automotive, projection, TOF, low light level, and special industry lenses. Its products are used in telescopes, microscopes, mobile phones, AR/VR products, digital cameras, security monitors, multimedia projectors, sights, image measuring equipment, and automobile interior and exterior decorations. The company was founded in 1995 and is based in Jiaxing, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Jiaxing"}, "688233.SS": {"short_name": "THINKON SEMICONDUCTOR JINZHOU C", "long_name": "Thinkon Semiconductor Jinzhou Corp.", "summary": "Thinkon Semiconductor Jinzhou Corp. researches and develops, produces, and markets monocrystalline silicon products for IC etching in China and internationally. It offers silicon ingots, cylinders, plates, rings, and wafers. The company was founded in 2013 and is headquartered in Jinzhou, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Jinzhou"}, "688313.SS": {"short_name": "HENAN SHIJIA PHOTONS TECHNOLOGY", "long_name": "Henan Shijia Photons Technology Co., Ltd.", "summary": "Henan Shijia Photons Technology Co., Ltd. engages in the research and development, production, and sale of PLC photonic chips and optoelectronic devices. It offers PLC splitters, arrayed waveguide grating products, active products, optical fiber cables, and OEM platforms. The company was founded in 2010 and is based in Zhengzhou, China.", "currency": "CNY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Zhengzhou"}, "7510.T": {"short_name": "TAKEBISHI CORPORATION", "long_name": "Takebishi Corporation", "summary": "Takebishi Corporation, a technological trading company, deals in industrial electric machinery and electronic equipment in Japan. The company provides industrial factory automation (FA) equipment, such as controllers, drive controls, and electricity distribution controls; FA systems that automate the production line and save labor; and industrial equipment, including processing machinery and robots for enhancing productivity and quality. It also offers semiconductor parts to assembly manufacturers and electronic device makers; and machinery and peripheral devices for use in home electronics, such as PCs, controllers for industrial application, and other products for the amusement sector. In addition, the company provides air conditioning units and devices for household equipment; building equipment, including elevators and escalators; electrical substation equipment for local municipalities, as well as emergency power generating equipment; power distribution facilities for systems in factories and buildings; and inspection equipment, such as radiation cancer therapy systems and other therapy equipment, and CT and MRI systems. Further, it sells equipment, including PCs and PC servers; designs, develops, and maintains sales management and production management systems; and security systems, such as surveillance cameras and controls for entering and exiting. The company was formerly known as Takebishi Electric Co., Ltd. and changed its name to Takebishi Corporation in October 2006. Takebishi Corporation was founded in 1926 and is headquartered in Kyoto, Japan.", "currency": "JPY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kyoto"}, "7587.T": {"short_name": "PALTEK CORP", "long_name": "Paltek Corporation", "summary": "Paltek Corporation engages in the sale of semiconductors and related products in Japan. Its products include FPGAs, memory ICs, ASSP, analog ICs/power supply ICs, telecom/network applications, wireless ICs, sensor ICs, clock/timing ICs, etc. The company also offers ODM services in the field of medical, industrial, and communication equipment; model-based design services; and in-house products, such as FPGA computing platforms used for video processing and video transmission. In addition, it provides mobility, IoT, AI, video transmission, server and storage, paper packing, and fleet management solutions, as well as body motion sensor for infants, work support wearable robots, chlorus acid water, and space sanitization systems. Paltek Corporation was incorporated in 1977 and is headquartered in Yokohama, Japan.", "currency": "JPY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Yokohama"}, "7609.T": {"short_name": "DAITRON CO LTD", "long_name": "Daitron Co., Ltd.", "summary": "Daitron Co., Ltd., an electronics engineering trading company, primarily imports, exports, and sells electronic components and assembly goods in Japan and internationally. The company also manufactures, imports, exports, and sells semiconductors, embedded systems, power supply equipment, image-related equipment and components, and information systems. In addition, it provides production equipment and inspection requipment for silicon wafers, ICs, LSIs, FPDs, electronic materials, semiconductors, optical devices, energy devices, and OEM products, as well as flat panels, including LCDs, CFs, PDPs, organic Els. Further, the company engages in the development, manufacture, and sale of wafer edge grinding machines and chip sorting machines; LED testers/probers and processing equipment; and original-system low noise switching power supply custom UPS products and transformers. Additionally, it designs, manufactures, assembles, and customizes image device dedicated harness and other electronic equipment. The company was formerly known as Daito Electron Co., Ltd. and changed its name to Daitron Co., Ltd. in 2017. Daitron Co., Ltd. was founded in 1952 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "7748.T": {"short_name": "HOLON CO LTD", "long_name": "Holon Co.,Ltd.", "summary": "Holon Co.,Ltd. engages in the development, manufacture, marketing, and maintenance of semiconductor circuitry dimension measurement and inspection tools in Japan. The company offers photomask critical dimension-scanning electron microscopes (SEMs), wafer CD-SEMs, defect review SEMs, pattern transfer equipment for LED production, and roller mold measurement tools. Its products are used in fabricating semiconductors. The company was founded in 1985 and is headquartered in Tokorozawa, Japan. As of June 22, 2018, Holon Co.,Ltd. operates as a subsidiary of A&D Company, Limited.", "currency": "JPY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokorozawa"}, "8035.T": {"short_name": "TOKYO ELECTRON", "long_name": "Tokyo Electron Limited", "summary": "Tokyo Electron Limited, together with its subsidiaries, develops, manufactures, distributes, and sells semiconductor and flat panel display (FPD) production equipment in Japan, North America, Europe, South Korea, Taiwan, China, and internationally. The company's Semiconductor Production Equipment segment offers coaters/developers, plasma etch systems, and single wafer deposition systems and cleaning systems used in wafer processing; wafer probers used in wafer testing process; and wafer bonders/debonders used in packaging processes. Its Flat Panel Display Production Equipment segment provides coaters/developers and plasma etch/ash systems for use in the manufacture of FPDs, as well as inkjet printing systems for manufacturing OLED panels. The company also offers logistic, facility maintenance, and insurance services. Tokyo Electron Limited was incorporated in 1951 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8155.T": {"short_name": "MIMASU SEMICONDUCTOR INDUSTRY", "long_name": "Mimasu Semiconductor Industry Co., Ltd.", "summary": "Mimasu Semiconductor Industry Co., Ltd. engages in the processing and sales of semiconductor materials in Japan. The company's semiconductor materials include prime and recycle wafers. It also offers measuring instruments, testing machines, information equipment, automatic control equipment, and other precision equipment, as well as manufacturing, inspection, and testing systems; and develops and sells in-house products and related systems. In addition, the company manufactures and sells various plants, such as pure water production and wastewater treatment equipment; and semiconductor manufacturing equipment. Mimasu Semiconductor Industry Co., Ltd. was founded in 1963 and is headquartered in Takasaki, Japan.", "currency": "JPY", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Takasaki"}, "8490.HK": {"short_name": "NICHE-TECH", "long_name": "Niche-Tech Group Limited", "summary": "Niche-Tech Group Limited, an investment holding company develops, manufactures, and sells semiconductor packaging materials in the People's Republic of China and Hong Kong. It offers copper bonding wires, aluminum silicon bonding wires, heavy aluminum bonding wires, silver alloy bonding wires, palladium- coated copper wires, and gold alloy bonding wires; and encapsulant for LED filament and COB LED. The company also provides epoxy encapsulant products, such as glob top epoxy, LED epoxy encapsulant, and die attach adhesives; and soldering materials. It serves LED and IC packaging industries. The company was founded in 2006 and is headquartered in Tai Po, Hong Kong. Niche-Tech Group Limited is a subsidiary of Niche-Tech Investments Holdings Limited.", "currency": "HKD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Tai Po"}, "A8B.F": {"short_name": "AMBARELLA INC. DL -,00045", "long_name": "Ambarella, Inc.", "summary": "Ambarella, Inc. develops semiconductor processing solutions for video that enable high-definition (HD), video capture, analysis, sharing, and display worldwide. The company's system-on-a-chip designs integrated HD video processing, image processing, computer vision functionality, audio processing, and system functions onto a single chip for delivering video and image quality, differentiated functionality, and low power consumption. Its solutions enable the creation of video content for wearable cameras, automotive cameras, drones, and virtual reality cameras, as well as Internet Protocol security cameras for professional use and home security and monitoring. The company sells its solutions to original design manufacturers and original equipment manufacturers through its direct sales force and distributors. Ambarella, Inc. was founded in 2004 and is headquartered in Santa Clara, California.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Santa Clara"}, "ACLS": {"short_name": "Axcelis Technologies, Inc.", "long_name": "Axcelis Technologies, Inc.", "summary": "Axcelis Technologies, Inc. designs, manufactures, and services ion implantation and other processing equipment used in the fabrication of semiconductor chips in the United States, Europe, and Asia. The company offers high energy, high current, and medium current implanters for various application requirements. In addition, the company offers aftermarket lifecycle products and services, including used tools, spare parts, equipment upgrades, maintenance services, and customer training. It sells its equipment and services to semiconductor chip manufacturers through its direct sales force. The company was founded in 1978 and is headquartered in Beverly, Massachusetts.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Beverly"}, "ACMR": {"short_name": "ACM Research, Inc.", "long_name": "ACM Research, Inc.", "summary": "ACM Research, Inc., together with its subsidiaries, develops, manufactures, and sells single-wafer wet cleaning equipment for enhancing the manufacturing process and yield for integrated chips worldwide. It offers space alternated phase of megasonic waves to deliver megasonic energy to flat and patterned wafer surfaces in a uniform manner on a microscopic level; timely energized bubble oscillation cleaning equipment for two-dimensional and three-dimensional patterned wafers at advanced process nodes; and single-wafer tools for back-end assembly and packaging equipment, as well as electro-chemical plating equipment for advanced metal plating. The company markets and sells its products under the Ultra C brand name through direct sales force and third-party representatives. ACM Research, Inc. was founded in 1998 and is headquartered in Fremont, California.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NGM", "market": "us_market", "country": "United States", "city": "Fremont"}, "AEHR": {"short_name": "Aehr Test Systems", "long_name": "Aehr Test Systems", "summary": "Aehr Test Systems primarily designs, engineers, manufactures, and sells test and burn-in equipment for use in the semiconductor industry in the United States, Asia, and Europe. It provides full wafer contact test systems, test during burn-in systems, test fixtures, and related accessories. The company offers Advanced Burn-in and Test System family of packaged part burn-in and test systems, which perform test during burn-in of complex devices, such as digital signal processors, microprocessors, microcontrollers, and systems-on-a-chip, as well as individual temperature control for high-power advanced logic devices. It also provides FOX systems, which are full wafer contact parallel test and burn-in systems designed to make contact with various pads of a wafer simultaneously; WaferPak contactor that includes a full-wafer probe card for use in testing wafers in FOX systems; DiePak carrier, a reusable and temporary package that enables integrated circuit (IC) manufacturers to perform test and burn-in of singulated bare die or very small multi-IC modules; and test fixtures that hold the devices undergoing test or burn-in and electrically connect the devices under test to the system electronics. In addition, the company offers WaferPak Aligner, which performs automatic alignment of the customer's wafer to the WaferPak contactor; and DiePak Loader that performs automatic loading of the customer's modules to the DiePak carrier. Further, Aehr Test Systems provides customer service and support programs, including system installation, system repair, applications engineering support, spare parts inventory, customer training, and documentation services. It markets and sells its products to semiconductor manufacturers, semiconductor contract assemblers, electronics manufacturers, and burn-in and test service companies through a network of distributors and sales representatives. Aehr Test Systems was founded in 1977 and is headquartered in Fremont, California.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Fremont"}, "AHV.F": {"short_name": "AXT INC.  DL-,001", "long_name": "AXT, Inc.", "summary": "AXT, Inc. researches, develops, and produces compound and single element semiconductor substrates. It produces semiconductor substrates using its proprietary vertical gradient freeze technology. The company offers indium phosphide (InP) for use in fiber optic lasers and detectors, passive optical networks, data center connectivity, silicon photonics, photonic integrated circuits, terrestrial solar cells, radio frequency amplifier and switching, infrared light-emitting diode (LEDs) motion control, and infrared thermal imaging, as well as for 5G. It also provides semi-insulating gallium arsenide (GaAs) substrates for applications in power amplifiers, direct broadcast television, transistors, satellite communications, and solar cells; and semi-conducting GaAs substrates that are used in 3-D sensing, data center communication, high brightness LEDs, lasers, near-infrared sensors, printer head lasers and LEDs, optical couplers, solar cells, and night vision goggles, as well as laser machining, cutting, and drilling. In addition, the company offers germanium (Ge) substrates for use in satellite solar cells, optical sensors and detectors, terrestrial concentrated photo voltaic cells, multi-junction solar cells for satellites, and infrared detectors. Further, it provides materials, including 4N raw gallium, 6N+ purified gallium, Boron trioxide, Gallium-Magnesium alloy, pyrolytic boron nitride (pBN) crucibles, and pBN insulating parts. AXT, Inc. sells its products through direct salesforce in the United States, China, and Europe, as well as through independent sales representatives and distributors in Japan, Taiwan, Korea, and internationally. The company was formerly known as American Xtal Technology, Inc. and changed its name to AXT, Inc. in July 2000. AXT, Inc. was founded in 1986 and is headquartered in Fremont, California.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Fremont"}, "AIXA.DE": {"short_name": "AIXTRON SE NA O.N.", "long_name": "AIXTRON SE", "summary": "AIXTRON SE, together with its subsidiaries, provides deposition equipment to the semiconductor industry in Germany, the United States, Korea, China, and Taiwan. The company develops, produces, sells, and maintains equipment for the deposition of semiconductor materials; and provides consulting and training, customer support, peripheral equipment and services, and upgrading services for systems, as well as sells spare parts. Its technology solutions are used to build components for electronic and optoelectronic applications that are used in laser, LED and display technologies, power electronics based on SiC and GaN components, communications, signaling and lighting technology, and other applications. The company's registered trademark includes AIXACT, AIXTRON, APEVA, Atomic Level SolutionS, Close Coupled Showerhead, CRIUS, EXP, EPISON, Gas Foil Rotation, Optacap, OVPD, Planetary Reactor, PVPD, STExS, and TriJet. AIXTRON SE was founded in 1983 and is headquartered in Herzogenrath, Germany.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "GER", "market": "de_market", "country": "Germany", "city": "Herzogenrath"}, "AIXA.F": {"short_name": "AIXTRON SE NA O.N.", "long_name": "AIXTRON SE", "summary": "AIXTRON SE, together with its subsidiaries, provides deposition equipment to the semiconductor industry in Germany, the United States, Korea, China, and Taiwan. The company develops, produces, sells, and maintains equipment for the deposition of semiconductor materials; and provides consulting and training, customer support, peripheral equipment and services, and upgrading services for systems, as well as sells spare parts. Its technology solutions are used to build components for electronic and optoelectronic applications that are used in laser, LED and display technologies, power electronics based on SiC and GaN components, communications, signaling and lighting technology, and other applications. The company's registered trademark includes AIXACT, AIXTRON, APEVA, Atomic Level SolutionS, Close Coupled Showerhead, CRIUS, EXP, EPISON, Gas Foil Rotation, Optacap, OVPD, Planetary Reactor, PVPD, STExS, and TriJet. AIXTRON SE was founded in 1983 and is headquartered in Herzogenrath, Germany.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "Germany", "city": "Herzogenrath"}, "AIXT.VI": {"short_name": "AIXTRON SE", "long_name": "AIXTRON SE", "summary": "AIXTRON SE, together with its subsidiaries, provides deposition equipment to the semiconductor industry in Germany, the United States, Korea, China, and Taiwan. The company develops, produces, sells, and maintains equipment for the deposition of semiconductor materials; and provides consulting and training, customer support, peripheral equipment and services, and upgrading services for systems, as well as sells spare parts. Its technology solutions are used to build components for electronic and optoelectronic applications that are used in laser, LED and display technologies, power electronics based on SiC and GaN components, communications, signaling and lighting technology, and other applications. The company's registered trademark includes AIXACT, AIXTRON, APEVA, Atomic Level SolutionS, Close Coupled Showerhead, CRIUS, EXP, EPISON, Gas Foil Rotation, Optacap, OVPD, Planetary Reactor, PVPD, STExS, and TriJet. AIXTRON SE was founded in 1983 and is headquartered in Herzogenrath, Germany.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "VIE", "market": "at_market", "country": "Germany", "city": "Herzogenrath"}, "AIXXF": {"short_name": "AIXTRON SE", "long_name": "AIXTRON SE", "summary": "AIXTRON SE, together with its subsidiaries, provides deposition equipment to the semiconductor industry in Germany, the United States, Korea, China, and Taiwan. The company develops, produces, sells, and maintains equipment for the deposition of semiconductor materials; and provides consulting and training, customer support, peripheral equipment and services, and upgrading services for systems, as well as sells spare parts. Its technology solutions are used to build components for electronic and optoelectronic applications that are used in laser, LED and display technologies, power electronics based on SiC and GaN components, communications, signaling and lighting technology, and other applications. The company's registered trademark includes AIXACT, AIXTRON, APEVA, Atomic Level SolutionS, Close Coupled Showerhead, CRIUS, EXP, EPISON, Gas Foil Rotation, Optacap, OVPD, Planetary Reactor, PVPD, STExS, and TriJet. AIXTRON SE was founded in 1983 and is headquartered in Herzogenrath, Germany.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "Germany", "city": "Herzogenrath"}, "ALRIB.PA": {"short_name": "RIBER", "long_name": "Riber S.A.", "summary": "Riber S.A. provides molecular beam epitaxy (MBE) equipment and material evaporation sources for the semiconductor industry. The company offers MBE research tools for the production of epitaxial layers; MBE production systems; and refurbishment solutions. It also provides chemical vapor deposition (CVD) systems comprising MPVD 300, an ultra-high-vacuum system for depositing films. In addition, the company offers MBE cells and sources comprising Knudsen cells, valved sources, corrosive materials, RF plasma sources, gas sources, gas modules and specialty sources; resistant heaters; shutters, gaskets, viewports and viewport shutters, ion pumps, automatic impedance matchers, crucibles, inserts, liners, power supplies, and cables; and process controllers. Further, it provides vacuum thermal evaporation and linear sources, including point sources, linear sources, and process controllers. Additionally, the company offers technical support, advice, equipment upgrades, and reactor maintenance services to MBE users. It provides its products for use in arsenides, phosphides, antimonides, selenides, gallium nitrides, mercury cadmium tellurides, II-VI materials, silicon germanium, metals, and oxides. Riber S.A. was founded in 1964 and is headquartered in Bezons, France.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PAR", "market": "fr_market", "country": "France", "city": "Bezons"}, "ALTRO.PA": {"short_name": "TRONICS", "long_name": "Tronic's Microsystems SA", "summary": "Tronic's Microsystems SA manufactures and sells MEMS devices for various applications in France and internationally. It provides custom and standard products primarily to the industrial, aeronautics, security, and medical markets. The company engages in developing, manufacturing, and packaging accelerometers, gyroscopes, micropumps, pressure sensors, switches, biodetectors, and other MEMS, as well as providing MEMS foundry and wafer fab manufacturing solutions. Its products are used in BioMEMS, high performance inertial MEMS, RF MEMS switches, micromirrors, thermal printheads, and MEMS for medical devices, etc. The company was founded in 1997 and is based in Crolles, France. Tronic's Microsystems SA is a subsidiary of EPCOS AG.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PAR", "market": "fr_market", "country": "France", "city": "Crolles"}, "AMAT": {"short_name": "Applied Materials, Inc.", "long_name": "Applied Materials, Inc.", "summary": "Applied Materials, Inc. provides manufacturing equipment, services, and software to the semiconductor, display, and related industries. It operates through three segments: Semiconductor Systems, Applied Global Services, and Display and Adjacent Markets. The Semiconductor Systems segment develops, manufactures, and sells various manufacturing equipment that is used to fabricate semiconductor chips or integrated circuits. This segment also offers various technologies, including epitaxy, ion implantation, oxidation/nitridation, rapid thermal processing, physical vapor deposition, chemical vapor deposition, chemical mechanical planarization, electrochemical deposition, atomic layer deposition, etching, and selective deposition and removal, as well as metrology and inspection tools. The Applied Global Services segment provides integrated solutions to optimize equipment and fab performance and productivity comprising spares, upgrades, services, remanufactured earlier generation equipment, and factory automation software for semiconductor, display, and other products. The Display and Adjacent Markets segment offers products for manufacturing liquid crystal displays; organic light-emitting diodes; and other display technologies for TVs, monitors, laptops, personal computers, electronic tablets, smart phones, and other consumer-oriented devices, as well as equipment for processing flexible substrates. The company operates in the United States, China, Korea, Taiwan, Japan, Southeast Asia, and Europe. Applied Materials, Inc. was founded in 1967 and is headquartered in Santa Clara, California.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Santa Clara"}, "AMAT.VI": {"short_name": "APPLIED MATERIALS INC", "long_name": "Applied Materials, Inc.", "summary": "Applied Materials, Inc. provides manufacturing equipment, services, and software to the semiconductor, display, and related industries. It operates through three segments: Semiconductor Systems, Applied Global Services, and Display and Adjacent Markets. The Semiconductor Systems segment develops, manufactures, and sells various manufacturing equipment that is used to fabricate semiconductor chips or integrated circuits. This segment also offers various technologies, including epitaxy, ion implantation, oxidation/nitridation, rapid thermal processing, physical vapor deposition, chemical vapor deposition, chemical mechanical planarization, electrochemical deposition, atomic layer deposition, etching, and selective deposition and removal, as well as metrology and inspection tools. The Applied Global Services segment provides integrated solutions to optimize equipment and fab performance and productivity comprising spares, upgrades, services, remanufactured earlier generation equipment, and factory automation software for semiconductor, display, and other products. The Display and Adjacent Markets segment offers products for manufacturing liquid crystal displays; organic light-emitting diodes; and other display technologies for TVs, monitors, laptops, personal computers, electronic tablets, smart phones, and other consumer-oriented devices, as well as equipment for processing flexible substrates. The company operates in the United States, China, Korea, Taiwan, Japan, Southeast Asia, and Europe. Applied Materials, Inc. was founded in 1967 and is headquartered in Santa Clara, California.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "VIE", "market": "at_market", "country": "United States", "city": "Santa Clara"}, "AMBA": {"short_name": "Ambarella, Inc.", "long_name": "Ambarella, Inc.", "summary": "Ambarella, Inc. develops semiconductor processing solutions for video that enable high-definition (HD), video capture, analysis, sharing, and display worldwide. The company's system-on-a-chip designs integrated HD video processing, image processing, computer vision functionality, audio processing, and system functions onto a single chip for delivering video and image quality, differentiated functionality, and low power consumption. Its solutions enable the creation of video content for wearable cameras, automotive cameras, drones, and virtual reality cameras, as well as Internet Protocol security cameras for professional use and home security and monitoring. The company sells its solutions to original design manufacturers and original equipment manufacturers through its direct sales force and distributors. Ambarella, Inc. was founded in 2004 and is headquartered in Santa Clara, California.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Santa Clara"}, "AS3.F": {"short_name": "AMTECH SYS INC.  DL-,01", "long_name": "Amtech Systems, Inc.", "summary": "Amtech Systems, Inc. manufactures and sells capital equipment and related consumables for use in fabricating silicon carbide (SiC), silicon power devices, analog and discrete devices, electronic assemblies, and light-emitting diodes (LEDs) worldwide. The company operates in Semiconductor and SiC/LED segments. The Semiconductor segment designs, manufactures, sells, and services thermal processing equipment, including solder reflow ovens, diffusion furnaces, and customer high-temp belt furnaces for use by semiconductor manufacturers, as well as in electronics, automotive and other industries; and wafer polishing equipment and related services. Its products include horizontal diffusion furnaces; and belt furnaces. The SiC/LED segment manufactures and sells consumables and machinery for lapping and polishing of materials, such as silicon wafers for semiconductor products; sapphire substrates for LED lighting and mobile devices; silicon carbide wafers for LED and power device applications; various glass and silica components for 3D image transmission; quartz and ceramic components for telecommunications devices; and medical device components, and optical and photonics applications. The company sells its products through sales personnel, as well as a network of independent sales representatives and distributors. The company was formerly known as Quartz Engineering & Materials, Inc. and changed its name to Amtech Systems, Inc. in 1987. Amtech Systems, Inc. was founded in 1981 and is headquartered in Tempe, Arizona.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Tempe"}, "ASME.DE": {"short_name": "ASML HOLDING  EO -,09", "long_name": "ASML Holding N.V.", "summary": "ASML Holding N.V. develops, produces, markets, sells, and services advanced semiconductor equipment systems consisting of lithography related systems for memory and logic chipmakers. The company provides extreme ultraviolet lithography systems; and deep ultraviolet lithography systems comprising immersion and dry lithography solutions to manufacture variosus range of semiconductor nodes and technologies. It also offers metrology and inspection systems, including YieldStar optical metrology solutions to measure the quality of patterns on the wafers; and HMI e-beam solutions to locate and analyze individual chip defects. In addition, the company provides computational lithography and software solutions to create applications that enhance the setup of the lithography system; and mature products and services that refurbish used lithography equipment and offers associated services. It operates in Japan, Korea, Singapore, Taiwan, China, the Netherlands, Europe, the Middle East, Africa, the United States, and reat of Asia. The company was formerly known as ASM Lithography Holding N.V. and changed its name to ASML Holding N.V. in 2001. ASML Holding N.V. was founded in 1984 and is headquartered in Veldhoven, the Netherlands.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "GER", "market": "de_market", "country": "Netherlands", "city": "Veldhoven"}, "ASME.F": {"short_name": "ASML HOLDING  EO -,09", "long_name": "ASML Holding N.V.", "summary": "ASML Holding N.V. develops, produces, markets, sells, and services advanced semiconductor equipment systems consisting of lithography related systems for memory and logic chipmakers. The company provides extreme ultraviolet lithography systems; and deep ultraviolet lithography systems comprising immersion and dry lithography solutions to manufacture variosus range of semiconductor nodes and technologies. It also offers metrology and inspection systems, including YieldStar optical metrology solutions to measure the quality of patterns on the wafers; and HMI e-beam solutions to locate and analyze individual chip defects. In addition, the company provides computational lithography and software solutions to create applications that enhance the setup of the lithography system; and mature products and services that refurbish used lithography equipment and offers associated services. It operates in Japan, Korea, Singapore, Taiwan, China, the Netherlands, Europe, the Middle East, Africa, the United States, and reat of Asia. The company was formerly known as ASM Lithography Holding N.V. and changed its name to ASML Holding N.V. in 2001. ASML Holding N.V. was founded in 1984 and is headquartered in Veldhoven, the Netherlands.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "Netherlands", "city": "Veldhoven"}, "ASMF.F": {"short_name": "ASML HOLDING NY  EO-,09", "long_name": "ASML Holding N.V.", "summary": "ASML Holding N.V. develops, produces, markets, sells, and services advanced semiconductor equipment systems consisting of lithography related systems for memory and logic chipmakers. The company provides extreme ultraviolet lithography systems; and deep ultraviolet lithography systems comprising immersion and dry lithography solutions to manufacture variosus range of semiconductor nodes and technologies. It also offers metrology and inspection systems, including YieldStar optical metrology solutions to measure the quality of patterns on the wafers; and HMI e-beam solutions to locate and analyze individual chip defects. In addition, the company provides computational lithography and software solutions to create applications that enhance the setup of the lithography system; and mature products and services that refurbish used lithography equipment and offers associated services. It operates in Japan, Korea, Singapore, Taiwan, China, the Netherlands, Europe, the Middle East, Africa, the United States, and reat of Asia. The company was formerly known as ASM Lithography Holding N.V. and changed its name to ASML Holding N.V. in 2001. ASML Holding N.V. was founded in 1984 and is headquartered in Veldhoven, the Netherlands.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "Netherlands", "city": "Veldhoven"}, "ASMIY": {"short_name": "ASM INTERNATIONAL NV", "long_name": "ASM International NV", "summary": "ASM International NV, together with its subsidiaries, engages in the research, development, manufacture, marketing, and servicing of equipment and materials used to produce semiconductor devices. The company operates through two segments, Front-end and Back-end. The Front-end segment manufactures and sells equipment used in wafer processing, encompassing the fabrication steps in which silicon wafers are layered with semiconductor devices in Europe, the United States, Japan, South Korea, and Southeast Asia. The Back-end segment manufactures and sells equipment and materials that are used in the assembly and packaging, encompassing the processes in which silicon wafers are separated into individual circuits and assembled, packaged, and tested in Hong Kong, the People's Republic of China, Singapore, Malaysia, and Germany. The company's products include wafer processing deposition systems for single-wafer atomic layer deposition, plasma enhanced chemical vapor deposition, epitaxy, and batch diffusion/furnace systems. It serves manufacturers of semiconductor devices and integrated circuits. The company was formerly known as Advanced Semiconductor Materials International NV. ASM International NV was founded in 1968 and is headquartered in Almere, the Netherlands.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "Netherlands", "city": "Almere"}, "ASML": {"short_name": "ASML Holding N.V. - New York Re", "long_name": "ASML Holding N.V.", "summary": "ASML Holding N.V. develops, produces, markets, sells, and services advanced semiconductor equipment systems consisting of lithography related systems for memory and logic chipmakers. The company provides extreme ultraviolet lithography systems; and deep ultraviolet lithography systems comprising immersion and dry lithography solutions to manufacture variosus range of semiconductor nodes and technologies. It also offers metrology and inspection systems, including YieldStar optical metrology solutions to measure the quality of patterns on the wafers; and HMI e-beam solutions to locate and analyze individual chip defects. In addition, the company provides computational lithography and software solutions to create applications that enhance the setup of the lithography system; and mature products and services that refurbish used lithography equipment and offers associated services. It operates in Japan, Korea, Singapore, Taiwan, China, the Netherlands, Europe, the Middle East, Africa, the United States, and reat of Asia. The company was formerly known as ASM Lithography Holding N.V. and changed its name to ASML Holding N.V. in 2001. ASML Holding N.V. was founded in 1984 and is headquartered in Veldhoven, the Netherlands.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "Netherlands", "city": "Veldhoven"}, "ASML.AS": {"short_name": "ASML HOLDING", "long_name": "ASML Holding N.V.", "summary": "ASML Holding N.V. develops, produces, markets, sells, and services advanced semiconductor equipment systems consisting of lithography related systems for memory and logic chipmakers. The company provides extreme ultraviolet lithography systems; and deep ultraviolet lithography systems comprising immersion and dry lithography solutions to manufacture variosus range of semiconductor nodes and technologies. It also offers metrology and inspection systems, including YieldStar optical metrology solutions to measure the quality of patterns on the wafers; and HMI e-beam solutions to locate and analyze individual chip defects. In addition, the company provides computational lithography and software solutions to create applications that enhance the setup of the lithography system; and mature products and services that refurbish used lithography equipment and offers associated services. It operates in Japan, Korea, Singapore, Taiwan, China, the Netherlands, Europe, the Middle East, Africa, the United States, and reat of Asia. The company was formerly known as ASM Lithography Holding N.V. and changed its name to ASML Holding N.V. in 2001. ASML Holding N.V. was founded in 1984 and is headquartered in Veldhoven, the Netherlands.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "AMS", "market": "nl_market", "country": "Netherlands", "city": "Veldhoven"}, "ASMLF": {"short_name": "ASML HOLDING NV", "long_name": "ASML Holding N.V.", "summary": "ASML Holding N.V. develops, produces, markets, sells, and services advanced semiconductor equipment systems consisting of lithography related systems for memory and logic chipmakers. The company provides extreme ultraviolet lithography systems; and deep ultraviolet lithography systems comprising immersion and dry lithography solutions to manufacture variosus range of semiconductor nodes and technologies. It also offers metrology and inspection systems, including YieldStar optical metrology solutions to measure the quality of patterns on the wafers; and HMI e-beam solutions to locate and analyze individual chip defects. In addition, the company provides computational lithography and software solutions to create applications that enhance the setup of the lithography system; and mature products and services that refurbish used lithography equipment and offers associated services. It operates in Japan, Korea, Singapore, Taiwan, China, the Netherlands, Europe, the Middle East, Africa, the United States, and reat of Asia. The company was formerly known as ASM Lithography Holding N.V. and changed its name to ASML Holding N.V. in 2001. ASML Holding N.V. was founded in 1984 and is headquartered in Veldhoven, the Netherlands.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "Netherlands", "city": "Veldhoven"}, "ASMLN.MX": {"short_name": "ASML HOLDING NV", "long_name": "ASML Holding N.V.", "summary": "ASML Holding N.V. develops, produces, markets, sells, and services advanced semiconductor equipment systems consisting of lithography related systems for memory and logic chipmakers. The company provides extreme ultraviolet lithography systems; and deep ultraviolet lithography systems comprising immersion and dry lithography solutions to manufacture variosus range of semiconductor nodes and technologies. It also offers metrology and inspection systems, including YieldStar optical metrology solutions to measure the quality of patterns on the wafers; and HMI e-beam solutions to locate and analyze individual chip defects. In addition, the company provides computational lithography and software solutions to create applications that enhance the setup of the lithography system; and mature products and services that refurbish used lithography equipment and offers associated services. It operates in Japan, Korea, Singapore, Taiwan, China, the Netherlands, Europe, the Middle East, Africa, the United States, and reat of Asia. The company was formerly known as ASM Lithography Holding N.V. and changed its name to ASML Holding N.V. in 2001. ASML Holding N.V. was founded in 1984 and is headquartered in Veldhoven, the Netherlands.", "currency": "MXN", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "MEX", "market": "mx_market", "country": "Netherlands", "city": "Veldhoven"}, "ASMVF": {"short_name": "ASM PACIFIC TECHNOLOGY", "long_name": "ASM Pacific Technology Limited", "summary": "ASM Pacific Technology Limited, an investment holding company, engages in the design, manufacture, and marketing of machines, tools, and materials used in the semiconductor and electronics assembly industries worldwide. It operates through three segments: Semiconductor Solutions, Surface Mount Technology Solutions, and Materials. The company provides deposition process equipment, wafer separation equipment, AOI/FOL equipment, die attach equipment, wire bonding equipment, dispensing equipment, encapsulation solutions equipment, and CIS equipment. It also offers singulation, trim, and form systems; LED testing, sorting, and taping systems; and test and finish handling systems. In addition, it offers advanced fine pitch solutions; advanced packaging solutions; copper bonding solutions; leadframe solutions; LED/opto solutions; photonics, display, and COB solutions; stacked die solutions; and smart SMT factory solutions. Further, the company provides agency and logistics services. ASM Pacific Technology Limited was founded in 1975 and is based in Tsing Yi, Hong Kong.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Tsing Yi"}, "ASMVY": {"short_name": "ASM PAC TECHNOLOGY LTD", "long_name": "ASM Pacific Technology Limited", "summary": "ASM Pacific Technology Limited, an investment holding company, engages in the design, manufacture, and marketing of machines, tools, and materials used in the semiconductor and electronics assembly industries worldwide. It operates through three segments: Semiconductor Solutions, Surface Mount Technology Solutions, and Materials. The company provides deposition process equipment, wafer separation equipment, AOI/FOL equipment, die attach equipment, wire bonding equipment, dispensing equipment, encapsulation solutions equipment, and CIS equipment. It also offers singulation, trim, and form systems; LED testing, sorting, and taping systems; and test and finish handling systems. In addition, it offers advanced fine pitch solutions; advanced packaging solutions; copper bonding solutions; leadframe solutions; LED/opto solutions; photonics, display, and COB solutions; stacked die solutions; and smart SMT factory solutions. Further, the company provides agency and logistics services. ASM Pacific Technology Limited was founded in 1975 and is based in Tsing Yi, Hong Kong.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Tsing Yi"}, "ASYS": {"short_name": "Amtech Systems, Inc.", "long_name": "Amtech Systems, Inc.", "summary": "Amtech Systems, Inc. manufactures and sells capital equipment and related consumables for use in fabricating silicon carbide (SiC), silicon power devices, analog and discrete devices, electronic assemblies, and light-emitting diodes (LEDs) worldwide. The company operates in Semiconductor and SiC/LED segments. The Semiconductor segment designs, manufactures, sells, and services thermal processing equipment, including solder reflow ovens, diffusion furnaces, and customer high-temp belt furnaces for use by semiconductor manufacturers, as well as in electronics, automotive and other industries; and wafer polishing equipment and related services. Its products include horizontal diffusion furnaces; and belt furnaces. The SiC/LED segment manufactures and sells consumables and machinery for lapping and polishing of materials, such as silicon wafers for semiconductor products; sapphire substrates for LED lighting and mobile devices; silicon carbide wafers for LED and power device applications; various glass and silica components for 3D image transmission; quartz and ceramic components for telecommunications devices; and medical device components, and optical and photonics applications. The company sells its products through sales personnel, as well as a network of independent sales representatives and distributors. The company was formerly known as Quartz Engineering & Materials, Inc. and changed its name to Amtech Systems, Inc. in 1987. Amtech Systems, Inc. was founded in 1981 and is headquartered in Tempe, Arizona.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Tempe"}, "ATEYY": {"short_name": "ADVANTEST CORP", "long_name": "Advantest Corporation", "summary": "Advantest Corporation manufactures and sells semiconductor and component test system products and mechatronics-related products. It operates through three segments: Semiconductor and Component Test System; Mechatronics System; and Services, Support and Others. The Semiconductor and Component Test System segment provides customers with test system products for the semiconductor industry and the electronic parts industry. This segment offers test systems for SoC semiconductor devices; and test systems for memory semiconductors devices. The Mechatronics System segment provides test handlers; mechatronic-applied products for handling semiconductor devices; and device interfaces, which serve as interfaces with the devices that are measured. This segment also engages in the operations related to nano-technology products. The Services, Support and Others segment provides customer solutions for the semiconductor and component test system and mechatronics system segments; and support services. This segment is also involved in the sale of consumables and used products; and equipment lease business and others. In addition, the company engages in the research and development activities measuring and testing technologies. Advantest Corporation serves fabless semiconductor companies, foundries, and test houses, as well as industrial, design, and manufacturing companies in Japan, rest of Asia, the United States, and Europe. Advantest Corporation has collaboration with STMicroelectronics on advanced automated test cell for IC Testing; and partnership with PDF Solutions Inc. for cloud-based software solutions. The company was founded in 1954 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "ATOM": {"short_name": "Atomera Incorporated", "long_name": "Atomera Incorporated", "summary": "Atomera Incorporated engages in developing, commercializing, and licensing proprietary materials, processes, and technologies for the semiconductor industry primarily in North America, Europe, and the Asia Pacific. The company's lead technology is Mears Silicon Technology, a thin film of reengineered silicon that can be applied as a transistor channel enhancement to CMOS-type transistors. Its customers include foundries, integrated device manufacturers, fabless semiconductor manufacturers, original equipment manufacturers, and electronic design automation companies. The company was formerly known as Mears Technologies, Inc. and changed its name to Atomera Incorporated in January 2016. Atomera Incorporated was founded in 2001 and is headquartered in Los Gatos, California.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NCM", "market": "us_market", "country": "United States", "city": "Los Gatos"}, "AVS.F": {"short_name": "ASM INTL N.V.  EO-,04", "long_name": "ASM International NV", "summary": "ASM International NV, together with its subsidiaries, engages in the research, development, manufacture, marketing, and servicing of equipment and materials used to produce semiconductor devices. The company operates through two segments, Front-end and Back-end. The Front-end segment manufactures and sells equipment used in wafer processing, encompassing the fabrication steps in which silicon wafers are layered with semiconductor devices in Europe, the United States, Japan, South Korea, and Southeast Asia. The Back-end segment manufactures and sells equipment and materials that are used in the assembly and packaging, encompassing the processes in which silicon wafers are separated into individual circuits and assembled, packaged, and tested in Hong Kong, the People's Republic of China, Singapore, Malaysia, and Germany. The company's products include wafer processing deposition systems for single-wafer atomic layer deposition, plasma enhanced chemical vapor deposition, epitaxy, and batch diffusion/furnace systems. It serves manufacturers of semiconductor devices and integrated circuits. The company was formerly known as Advanced Semiconductor Materials International NV. ASM International NV was founded in 1968 and is headquartered in Almere, the Netherlands.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "Netherlands", "city": "Almere"}, "AVSN.SG": {"short_name": "ASM International N.V. Reg. Shs", "long_name": "ASM International NV", "summary": "ASM International NV, together with its subsidiaries, engages in the research, development, manufacture, marketing, and servicing of equipment and materials used to produce semiconductor devices. The company operates through two segments, Front-end and Back-end. The Front-end segment manufactures and sells equipment used in wafer processing, encompassing the fabrication steps in which silicon wafers are layered with semiconductor devices in Europe, the United States, Japan, South Korea, and Southeast Asia. The Back-end segment manufactures and sells equipment and materials that are used in the assembly and packaging, encompassing the processes in which silicon wafers are separated into individual circuits and assembled, packaged, and tested in Hong Kong, the People's Republic of China, Singapore, Malaysia, and Germany. The company's products include wafer processing deposition systems for single-wafer atomic layer deposition, plasma enhanced chemical vapor deposition, epitaxy, and batch diffusion/furnace systems. It serves manufacturers of semiconductor devices and integrated circuits. The company was formerly known as Advanced Semiconductor Materials International NV. ASM International NV was founded in 1968 and is headquartered in Almere, the Netherlands.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "STU", "market": "dr_market", "country": "Netherlands", "city": "Almere"}, "AWX.SI": {"short_name": "AEM", "long_name": "AEM Holdings Ltd", "summary": "AEM Holdings Ltd provides intelligent system testing and handling solutions for semiconductor and electronics companies Asia, North America, Europe, the Middle East, and Central America. It operates through Equipment Systems Solutions, System Level Test & Inspection, Micro-Electro-Mechanical Systems, and Test and Measurement Solutions segments. The company offers handling and test equipment; engineering and design services; field support services; and supplies, consumables, maintenance services, upgrade kits, and upgrade engineering for handlers. It also provides automatic measurement and test solutions for communications; and specialized wafer probers that enable the testing for sensors and semiconductors for the automotive, industrial, and consumer sectors. AEM Holdings Ltd is headquartered in Singapore.", "currency": "SGD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "AXTI": {"short_name": "AXT Inc", "long_name": "AXT, Inc.", "summary": "AXT, Inc. researches, develops, and produces compound and single element semiconductor substrates. It produces semiconductor substrates using its proprietary vertical gradient freeze technology. The company offers indium phosphide (InP) for use in fiber optic lasers and detectors, passive optical networks, data center connectivity, silicon photonics, photonic integrated circuits, terrestrial solar cells, radio frequency amplifier and switching, infrared light-emitting diode (LEDs) motion control, and infrared thermal imaging, as well as for 5G. It also provides semi-insulating gallium arsenide (GaAs) substrates for applications in power amplifiers, direct broadcast television, transistors, satellite communications, and solar cells; and semi-conducting GaAs substrates that are used in 3-D sensing, data center communication, high brightness LEDs, lasers, near-infrared sensors, printer head lasers and LEDs, optical couplers, solar cells, and night vision goggles, as well as laser machining, cutting, and drilling. In addition, the company offers germanium (Ge) substrates for use in satellite solar cells, optical sensors and detectors, terrestrial concentrated photo voltaic cells, multi-junction solar cells for satellites, and infrared detectors. Further, it provides materials, including 4N raw gallium, 6N+ purified gallium, Boron trioxide, Gallium-Magnesium alloy, pyrolytic boron nitride (pBN) crucibles, and pBN insulating parts. AXT, Inc. sells its products through direct salesforce in the United States, China, and Europe, as well as through independent sales representatives and distributors in Japan, Taiwan, Korea, and internationally. The company was formerly known as American Xtal Technology, Inc. and changed its name to AXT, Inc. in July 2000. AXT, Inc. was founded in 1986 and is headquartered in Fremont, California.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Fremont"}, "AYB.F": {"short_name": "AEHR TEST SYSTEMS  DL-,01", "long_name": "Aehr Test Systems", "summary": "Aehr Test Systems primarily designs, engineers, manufactures, and sells test and burn-in equipment for use in the semiconductor industry in the United States, Asia, and Europe. It provides full wafer contact test systems, test during burn-in systems, test fixtures, and related accessories. The company offers Advanced Burn-in and Test System family of packaged part burn-in and test systems, which perform test during burn-in of complex devices, such as digital signal processors, microprocessors, microcontrollers, and systems-on-a-chip, as well as individual temperature control for high-power advanced logic devices. It also provides FOX systems, which are full wafer contact parallel test and burn-in systems designed to make contact with various pads of a wafer simultaneously; WaferPak contactor that includes a full-wafer probe card for use in testing wafers in FOX systems; DiePak carrier, a reusable and temporary package that enables integrated circuit (IC) manufacturers to perform test and burn-in of singulated bare die or very small multi-IC modules; and test fixtures that hold the devices undergoing test or burn-in and electrically connect the devices under test to the system electronics. In addition, the company offers WaferPak Aligner, which performs automatic alignment of the customer's wafer to the WaferPak contactor; and DiePak Loader that performs automatic loading of the customer's modules to the DiePak carrier. Further, Aehr Test Systems provides customer service and support programs, including system installation, system repair, applications engineering support, spare parts inventory, customer training, and documentation services. It markets and sells its products to semiconductor manufacturers, semiconductor contract assemblers, electronics manufacturers, and burn-in and test service companies through a network of distributors and sales representatives. Aehr Test Systems was founded in 1977 and is headquartered in Fremont, California.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Fremont"}, "AYN.SI": {"short_name": "Global Testing", "long_name": "Global Testing Corporation Limited", "summary": "Global Testing Corporation Limited, an investment holding company, engages in the semiconductor testing business in Singapore, the United States, Taiwan, the People's Republic of China, Japan, and internationally. It offers testing services, such as wafer sorting and final testing to the semiconductor industry, focusing on logic and mixed signal semiconductors used in consumer electronics and communication devices. The company also provides test program development, conversion, and optimization services; and load board and probe card design services, as well as leases its customers for trial and pilot testing purposes on an ad hoc basis. In addition, it offers wafer testing services to the automotive devices industry. The company was founded in 1998 and is headquartered in Hsinchu City, Taiwan.", "currency": "SGD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SES", "market": "sg_market", "country": "Taiwan", "city": "Hsinchu City"}, "BESI.AS": {"short_name": "BE SEMICONDUCTOR", "long_name": "BE Semiconductor Industries N.V.", "summary": "BE Semiconductor Industries N.V. develops, manufactures, markets, sells, and services semiconductor assembly equipment for the semiconductor and electronics industries worldwide. The company's principal products include die attach equipment, such as single chips, multi chips, multi modules, flip chips, TCBs, FOWLP and hybrid die bonding systems, and die sorting systems; and packaging equipment comprising conventional, ultra thin, and wafer level molding, as well as trim and form, and singulation systems. Its principal products also comprise plating equipment consisting of tin, copper, and precious metal plating systems, as well as related process chemicals; and tooling, conversion kits, spare parts, and other services. The company provides its products primarily to chip manufacturers, assembly subcontractors, and electronics and industrial companies. BE Semiconductor Industries N.V. was founded in 1995 and is headquartered in Duiven, the Netherlands.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "AMS", "market": "nl_market", "country": "Netherlands", "city": "Duiven"}, "BESIY": {"short_name": "BE SEMICONDUCTOR INDUSTRIES NV", "long_name": "BE Semiconductor Industries N.V.", "summary": "BE Semiconductor Industries N.V. develops, manufactures, markets, sells, and services semiconductor assembly equipment for the semiconductor and electronics industries worldwide. The company's principal products include die attach equipment, such as single chips, multi chips, multi modules, flip chips, TCBs, FOWLP and hybrid die bonding systems, and die sorting systems; and packaging equipment comprising conventional, ultra thin, and wafer level molding, as well as trim and form, and singulation systems. Its principal products also comprise plating equipment consisting of tin, copper, and precious metal plating systems, as well as related process chemicals; and tooling, conversion kits, spare parts, and other services. The company provides its products primarily to chip manufacturers, assembly subcontractors, and electronics and industrial companies. BE Semiconductor Industries N.V. was founded in 1995 and is headquartered in Duiven, the Netherlands.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "Netherlands", "city": "Duiven"}, "BIX.SI": {"short_name": "Ellipsiz", "long_name": "Ellipsiz Ltd", "summary": "Ellipsiz Ltd, an investment holding company, distributes various manufacturing, testing, and inspection/measurement equipment to the semiconductor, electronics manufacturing, and telecommunication industries. The company's Distribution and Services Solutions segment distributes equipment and tools for semiconductor and electronics manufacturing, integrated circuit (IC) failure analysis, IC reliability testing, and printed circuit board assembly testing and inspection services; and provides equipment maintenance support engineering services, including systems integration to the semiconductor and electronics manufacturing services industry. This segment also provides facilities management services, such as chemicals, gas and abatement management, and turnkey wafer fabrication equipment relocation; and trades in consumable products for hospital, pharmaceutical, electronic, and food processing industries. Its Automated Precision System Solutions segment offers customized systems and solutions for test automation; high precision automated assembly process for fiber and lens; and automated wafer level testing in the semiconductor and electronics manufacturing environment. The company's Vending Solutions segment distributes and provides retail solutions through intelligent automated retail machines. Its Property Investment and Development segment invests in and develops properties. The company also offers solutions for in-circuit and functional testing; sells and markets scientific and industrial products; engineering services; and related technical and support services. It operates in Singapore, Malaysia, China, Taiwan, Indonesia, and internationally. The company was formerly known as SingaTrust Ltd. and changed its name to Ellipsiz Ltd in 2001. Ellipsiz Ltd was founded in 1992 and is headquartered in Singapore. Ellipsiz Ltd is a subsidiary of Bevrian Pte. Ltd.", "currency": "SGD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "BLG.AX": {"short_name": "BLUGLASS FPO", "long_name": "BluGlass Limited", "summary": "BluGlass Limited, together with its subsidiaries, engages in the research and development of Gallium nitrides in Australia. The company develops and commercializes Remote Plasma Chemical Vapour Deposition, a patented low temperature technology for manufacturing semiconductor materials and producing laser diode, light emitting diode (LED), and microLED devices. It offers laser diode devices for industrial welding, biotech, and display applications. The company also provides foundry services. BluGlass Limited was founded in 2005 and is based in Silverwater, Australia.", "currency": "AUD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Silverwater"}, "BRKS": {"short_name": "Brooks Automation, Inc.", "long_name": "Brooks Automation, Inc.", "summary": "Brooks Automation, Inc. provides manufacturing automation solutions for the semiconductor industry, and life science sample-based services and solutions for the life sciences market worldwide. The company operates in three segments: Brooks Semiconductor Solutions Group, Brooks Life Sciences Services, and Brooks Life Sciences Products. The Brooks Semiconductor Solutions Group segment offers wafer automation and contamination controls solutions and services. Its products include atmospheric and vacuum robots, robotic modules, and tool automation systems that offer precision handling and clean wafer environments; and automated cleaning and inspection systems for wafer carriers, reticle pod cleaners, and stockers. It also offers repair and refurbishment, diagnostics, and installation services, as well as spare parts and productivity enhancement upgrade services. The Brooks Life Sciences Services segment provides gene sequencing and gene synthesis services, including next generation sequencing, sanger sequencing, gene synthesis, bioinformatics, and good laboratory practices regulatory services; on-site and off-site sample storage, cold chain logistics, sample transport and collection relocation, bio-processing solutions, disaster recovery, and business continuity, as well as project management and consulting services; and sample intelligence software solutions and integration of customer technology. The Brooks Life Sciences Products segment offers automated cold storage systems; consumables, such as various formats of racks, tubes, caps, plates, and foils used for the storage and handling of samples in cold storage environments; and instruments used for labeling, bar coding, capping, de-capping, auditing, sealing, peeling, and piercing tubes and plates. The company serves semiconductor capital equipment and life sciences sample management markets in approximately 50 countries. Brooks Automation, Inc. was founded in 1978 and is headquartered in Chelmsford, Massachusetts.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Chelmsford"}, "BXE.SI": {"short_name": "CDW", "long_name": "CDW Holding Limited", "summary": "CDW Holding Limited, an investment holding company, produces and supplies precision components in Mainland China, Hong Kong, Japan, and internationally. The company operates through four segments: LCD Backlight Units, Office Automation, LCD Parts and Accessories, and Others. It offers small to medium sized LCD backlight units and flexible printed circuits that are used for the production of a range of equipment, including mobile communication, consumer information technology, and entertainment equipment; and small to large sized high precision metal and plastic frames and reflectors for a range of equipment, such as notebook monitors, mobile phones, game box entertainment equipment, and GPS navigators. The company also provides customized labels, shock absorbers, insulators, and other precision accessories for various office equipment and electrical appliances, which include photocopiers, printers, TV monitors, projectors, microwave ovens, etc. In addition, it is involved in the general trading; food and beverage management and advisory services; and life sciences businesses. Further, the company offers surface mounting technique services in electronic product assembly; plastic injection for electronic consumer products and automobiles; and label printing services. Additionally, the company engages in the manufacture, sale, and marketing of healthcare and beauty products; and provision of biotech related research and development services. CDW Holding Limited was founded in 1991 and is headquartered in Shatin, Hong Kong.", "currency": "SGD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SES", "market": "sg_market", "country": "Hong Kong", "city": "Sha Tin"}, "CAMT": {"short_name": "Camtek Ltd.", "long_name": "Camtek Ltd.", "summary": "Camtek Ltd. develops, manufactures, and sells metrology and inspection equipment for the advanced interconnect packaging, memory, complementary metal oxide semiconductor image sensors, micro-electro mechanical systems, radio frequency, and other segments of the semiconductor industry. It provides inspection and metrology systems, including Eagle i, a system that delivers 2D inspection and metrology capabilities; Eagle AP, which addresses the advanced packaging market using software and hardware technologies that deliver superior 2D and 3D inspection and metrology capabilities on the same platform; and Golden Eagle, a panel inspection and metrology system to support the manufacturing of panel wafers used in the manufacturing of fan-out level packaging applications. The company sells its products in the Asia Pacific, the United States, and Europe. Camtek Ltd. was incorporated in 1987 and is headquartered in Migdal HaEmek, Israel.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "Israel", "city": "Migdal Haemek"}, "CAMT.TA": {"short_name": "CAMTEK", "long_name": "Camtek Ltd.", "summary": "Camtek Ltd. develops, manufactures, and sells metrology and inspection equipment for the advanced interconnect packaging, memory, complementary metal oxide semiconductor image sensors, micro-electro mechanical systems, radio frequency, and other segments of the semiconductor industry. It provides inspection and metrology systems, including Eagle i, a system that delivers 2D inspection and metrology capabilities; Eagle AP, which addresses the advanced packaging market using software and hardware technologies that deliver superior 2D and 3D inspection and metrology capabilities on the same platform; and Golden Eagle, a panel inspection and metrology system to support the manufacturing of panel wafers used in the manufacturing of fan-out level packaging applications. The company sells its products in the Asia Pacific, the United States, and Europe. Camtek Ltd. was incorporated in 1987 and is headquartered in Migdal HaEmek, Israel.", "currency": "ILA", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Migdal Haemek"}, "CCMP": {"short_name": "CMC Materials, Inc.", "long_name": "CMC Materials, Inc.", "summary": "CMC Materials, Inc., together with its subsidiaries, provides consumable materials to semiconductor manufacturers, and pipeline and adjacent industry customers in North America, Asia, Europe, the Middle East, Africa, and South America. The company operates through two segments, Electronic Materials and Performance Materials. The Electronic Materials segment provides chemical mechanical planarization (CMP) are used for polishing various materials used in IC devices, including tungsten, dielectric materials, copper, tantalum, and aluminum; and various materials that are used in the production of disk substrates and magnetic heads for hard disk drives; and CMP pads which are used in conjunction with slurries in the CMP process. This segment also offers sulfuric, phosphoric, nitric, and hydrofluoric acids, as well as ammonium hydroxide, hydrogen peroxide, isopropyl alcohol, other specialty organic solvents, and various blends of chemicals. The Performance Materials segment engages in pipeline and industrial materials business; provides routine and emergency maintenance services; polymer-based drag-reducing agents for crude oil transmission; and valve greases, cleaners and sealants, and related services and equipment. This segment also offers precision polishing and metrology systems for advanced optics applications; and magneto-rheological polishing fluids, consumables, and spare and replacement parts, as well as optical polishing services and other customer support services. It also engages in the wood treatment business. The company was formerly known as Cabot Microelectronics Corporation and changed its name to CMC Materials, Inc. in October 2020. CMC Materials, Inc. was founded in 1999 and is headquartered in Aurora, Illinois.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Aurora"}, "CMZ.F": {"short_name": "CAMTEK LTD.", "long_name": "Camtek Ltd.", "summary": "Camtek Ltd. develops, manufactures, and sells metrology and inspection equipment for the advanced interconnect packaging, memory, complementary metal oxide semiconductor image sensors, micro-electro mechanical systems, radio frequency, and other segments of the semiconductor industry. It provides inspection and metrology systems, including Eagle i, a system that delivers 2D inspection and metrology capabilities; Eagle AP, which addresses the advanced packaging market using software and hardware technologies that deliver superior 2D and 3D inspection and metrology capabilities on the same platform; and Golden Eagle, a panel inspection and metrology system to support the manufacturing of panel wafers used in the manufacturing of fan-out level packaging applications. The company sells its products in the Asia Pacific, the United States, and Europe. Camtek Ltd. was incorporated in 1987 and is headquartered in Migdal HaEmek, Israel.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "Israel", "city": "Migdal Haemek"}, "COHU": {"short_name": "Cohu, Inc.", "long_name": "Cohu, Inc.", "summary": "Cohu, Inc., through its subsidiaries, provides semiconductor test and inspection handlers, micro-electro mechanical system (MEMS) test modules, test contactors, thermal sub-systems, semiconductor automated test equipment (ATE), and bare board printed circuit board (PCB) test systems for semiconductor and electronics manufacturers, and test subcontractors in Germany, the United States, Japan, Malaysia, the Philippines, and internationally. It operates through two segments, Semiconductor Test and Inspection Equipment; and PCB Test Equipment. The company provides semiconductor ATE for wafer level and device package testing; various test handlers, including pick-and-place, turret, gravity, strip, and MEMS for testing and thermal sub-systems that include temperature control of the integrated circuit during the testing process. It also offers bare board PCB test systems to test pre-assembly PCBs; flying probe and grid testers; interface products comprising test contactors and probe pins; spares and kits; and a range of device dedication kits that enable handlers to process various semiconductor packages. In addition, the company provides various parts and labor warranties on test and handling systems, and instruments; and training on the maintenance and operation of its systems. It markets its products through direct sales force and independent sales representatives. The company was formerly known as Cohu Electronics, Inc. and changed its name to Cohu, Inc. in 1972. Cohu, Inc. was incorporated in 1947 and is headquartered in Poway, California.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Poway"}, "CTD.F": {"short_name": "CMC MATERIALS  DL-,001", "long_name": "CMC Materials, Inc.", "summary": "CMC Materials, Inc., together with its subsidiaries, provides consumable materials to semiconductor manufacturers, and pipeline and adjacent industry customers in North America, Asia, Europe, the Middle East, Africa, and South America. The company operates through two segments, Electronic Materials and Performance Materials. The Electronic Materials segment provides chemical mechanical planarization (CMP) are used for polishing various materials used in IC devices, including tungsten, dielectric materials, copper, tantalum, and aluminum; and various materials that are used in the production of disk substrates and magnetic heads for hard disk drives; and CMP pads which are used in conjunction with slurries in the CMP process. This segment also offers sulfuric, phosphoric, nitric, and hydrofluoric acids, as well as ammonium hydroxide, hydrogen peroxide, isopropyl alcohol, other specialty organic solvents, and various blends of chemicals. The Performance Materials segment engages in pipeline and industrial materials business; provides routine and emergency maintenance services; polymer-based drag-reducing agents for crude oil transmission; and valve greases, cleaners and sealants, and related services and equipment. This segment also offers precision polishing and metrology systems for advanced optics applications; and magneto-rheological polishing fluids, consumables, and spare and replacement parts, as well as optical polishing services and other customer support services. It also engages in the wood treatment business. The company was formerly known as Cabot Microelectronics Corporation and changed its name to CMC Materials, Inc. in October 2020. CMC Materials, Inc. was founded in 1999 and is headquartered in Aurora, Illinois.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Aurora"}, "CU3.F": {"short_name": "COHU INC.  DL 1", "long_name": "Cohu, Inc.", "summary": "Cohu, Inc., through its subsidiaries, provides semiconductor test and inspection handlers, micro-electro mechanical system (MEMS) test modules, test contactors, thermal sub-systems, semiconductor automated test equipment (ATE), and bare board printed circuit board (PCB) test systems for semiconductor and electronics manufacturers, and test subcontractors in Germany, the United States, Japan, Malaysia, the Philippines, and internationally. It operates through two segments, Semiconductor Test and Inspection Equipment; and PCB Test Equipment. The company provides semiconductor ATE for wafer level and device package testing; various test handlers, including pick-and-place, turret, gravity, strip, and MEMS for testing and thermal sub-systems that include temperature control of the integrated circuit during the testing process. It also offers bare board PCB test systems to test pre-assembly PCBs; flying probe and grid testers; interface products comprising test contactors and probe pins; spares and kits; and a range of device dedication kits that enable handlers to process various semiconductor packages. In addition, the company provides various parts and labor warranties on test and handling systems, and instruments; and training on the maintenance and operation of its systems. It markets its products through direct sales force and independent sales representatives. The company was formerly known as Cohu Electronics, Inc. and changed its name to Cohu, Inc. in 1972. Cohu, Inc. was incorporated in 1947 and is headquartered in Poway, California.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Poway"}, "DQ": {"short_name": "DAQO New Energy Corp.", "long_name": "Daqo New Energy Corp.", "summary": "Daqo New Energy Corp., together with its subsidiaries, manufactures and sells polysilicon to photovoltaic product manufactures in the People's Republic of China. It offers ready-to-use polysilicon, and packaged to meet crucible stacking, pulling, and solidification products. The company was formerly known as Mega Stand International Limited and changed its name to Daqo New Energy Corp. in August 2009. Daqo New Energy Corp. was founded in 2006 and is based in Wanzhou, the People's Republic of China.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NYQ", "market": "us_market", "country": "China", "city": "Wanzhou"}, "DSCSY": {"short_name": "DISCO CORPORATION", "long_name": "Disco Corporation", "summary": "Disco Corporation manufactures and sells precision cutting, grinding, and polishing machines in Japan and internationally. The company's precision machines include dicing saws, laser saws, grinders, polishers, wafer mounters, die separators, surface planers, and waterjet saws, as well as products for dicing before grinding process and package singulation. It also offers precision processing tools comprising dicing blades, grinding wheels, and dry polishing wheels; and other products, such as accessory equipment, as well as frames and cassettes, and additives for cutting waters. In addition, the company is involved in the disassembly and recycling of precision cutting, grinding, and polishing machines, as well as provides training services for the maintenance and operation of its products. Further, it leases precision machines; and purchases and sells used machines. The company was founded in 1937 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "ELES.MI": {"short_name": "ELES", "long_name": "ELES Semiconductor Equipment S.p.A.", "summary": "ELES Semiconductor Equipment S.p.A. designs, manufactures, and sells test equipment, fixtures, solutions, and services for the semiconductor industry in Italy. It serves customers in automotive, defence, aerospace, industrial, IoT, and communication, as well as electronic control unit, electronic module, and system markets. The company was founded in 1988 and is headquartered in Todi, Italy.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "MIL", "market": "it_market", "country": "Italy", "city": "Todi"}, "ELG.DE": {"short_name": "ELMOS SEMICOND. INH O.N.", "long_name": "Elmos Semiconductor SE", "summary": "Elmos Semiconductor SE, together with its subsidiaries, develops, produces, and markets semiconductors and sensors primarily for use in the automotive industry worldwide. The company operates in two segments, Semiconductor and Micromechanics. Its products include optical IR and passive infrared sensors, sensor signal processors, smoke detector controllers, and ultrasonic sensors; motor control products, such as stepper, DC, and brushless DC motors; transceivers and system basis chips; power management products comprising DC/DC Converters, low dropout regulator, and LED drivers; and application specific integrated circuit chips, engine management products, relay drivers, and automotive safety products. The company products applications in household appliances, installation and building technology, and machine control systems, as well as micro-electro-mechanical systems. Elmos Semiconductor SE was founded in 1984 and is headquartered in Dortmund, Germany.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "GER", "market": "de_market", "country": "Germany", "city": "Dortmund"}, "ELG.F": {"short_name": "ELMOS SEMICOND. INH O.N.", "long_name": "Elmos Semiconductor SE", "summary": "Elmos Semiconductor SE, together with its subsidiaries, develops, produces, and markets semiconductors and sensors primarily for use in the automotive industry worldwide. The company operates in two segments, Semiconductor and Micromechanics. Its products include optical IR and passive infrared sensors, sensor signal processors, smoke detector controllers, and ultrasonic sensors; motor control products, such as stepper, DC, and brushless DC motors; transceivers and system basis chips; power management products comprising DC/DC Converters, low dropout regulator, and LED drivers; and application specific integrated circuit chips, engine management products, relay drivers, and automotive safety products. The company products applications in household appliances, installation and building technology, and machine control systems, as well as micro-electro-mechanical systems. Elmos Semiconductor SE was founded in 1984 and is headquartered in Dortmund, Germany.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "Germany", "city": "Dortmund"}, "EMAN": {"short_name": "eMagin Corporation", "long_name": "eMagin Corporation", "summary": "eMagin Corporation designs, develops, manufactures, and markets organic light-emitting diode (OLED) displays on-silicon micro displays, virtual imaging products that utilize OLED micro displays, and related products. It offers super video graphics array (SVGA) + OLED micro displays; digital SVGA OLED-XL; super eXtended graphics array OLED-XL/XLS and OLED-XL; video graphics array OLED-XL; and widescreen ultra-extended graphics array OLED-XL/XLS. The company also provides design reference kits, which include a microdisplay and associated electronics to help original equipment manufacturers (OEMs) to evaluate microdisplay products; near-eye virtual imaging modules that incorporate its OLED-on-silicon microdisplays with its lenses and electronic interfaces for integration into OEM products. Its products are used in military aviation helmets, military weapons sights and targeting systems, night vision and thermal imaging devices, training and simulation, visualization for ocular surgery, mobile ultrasound, and augmented reality applications. The company serves in North America, Asia, and Europe. eMagin Corporation was founded in 1996 and is headquartered in Hopewell Junction, New York.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Hopewell Junction"}, "EMGA.F": {"short_name": "EMAGIN CORP. NEW  DL -,01", "long_name": "eMagin Corporation", "summary": "eMagin Corporation designs, develops, manufactures, and markets organic light-emitting diode (OLED) displays on-silicon micro displays, virtual imaging products that utilize OLED micro displays, and related products. It offers super video graphics array (SVGA) + OLED micro displays; digital SVGA OLED-XL; super eXtended graphics array OLED-XL/XLS and OLED-XL; video graphics array OLED-XL; and widescreen ultra-extended graphics array OLED-XL/XLS. The company also provides design reference kits, which include a microdisplay and associated electronics to help original equipment manufacturers (OEMs) to evaluate microdisplay products; near-eye virtual imaging modules that incorporate its OLED-on-silicon microdisplays with its lenses and electronic interfaces for integration into OEM products. Its products are used in military aviation helmets, military weapons sights and targeting systems, night vision and thermal imaging devices, training and simulation, visualization for ocular surgery, mobile ultrasound, and augmented reality applications. The company serves in North America, Asia, and Europe. eMagin Corporation was founded in 1996 and is headquartered in Hopewell Junction, New York.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Hopewell Junction"}, "ENQ.F": {"short_name": "ENTEGRIS INC.  DL-,01", "long_name": "Entegris, Inc.", "summary": "Entegris, Inc. develops, manufactures, and supplies microcontamination control products, specialty chemicals, and advanced materials handling solutions for manufacturing processes in the semiconductor and other high-technology industries in North America, Taiwan, South Korea, Japan, China, Europe, and Southeast Asia. It operates through three segments: Specialty Chemicals and Engineered Materials (SCEM); Microcontamination Control (MC); and Advanced Materials Handling (AMH). The SCEM segment offers high-performance and high-purity process chemistries, gases, and materials, as well as delivery systems to support semiconductor and other advanced manufacturing processes. The MC segment provides solutions to filter and purify critical liquid chemistries and gases used in semiconductor manufacturing processes and other high-technology industries. The AMH segment develops solutions to monitor, protect, transport, and deliver critical liquid chemistries, wafers, and other substrates for application in the semiconductor and other high-technology industries. The company's customers include semiconductor device manufacturers, semiconductor equipment makers, gas and chemical manufacturing companies, wafer grower companies, and manufacturers of high-precision electronics; and flat panel display equipment makers, materials suppliers and panel manufacturers, and manufacturers of hard disk drive components and devices. It also serves manufacturers and suppliers in the solar and life science industries, electrical discharge machining customers, glass and glass container manufacturers, aerospace manufacturers, and manufacturers of biomedical implantation devices. The company was founded in 1966 and is headquartered in Billerica, Massachusetts.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Billerica"}, "ENTG": {"short_name": "Entegris, Inc.", "long_name": "Entegris, Inc.", "summary": "Entegris, Inc. develops, manufactures, and supplies microcontamination control products, specialty chemicals, and advanced materials handling solutions for manufacturing processes in the semiconductor and other high-technology industries in North America, Taiwan, South Korea, Japan, China, Europe, and Southeast Asia. It operates through three segments: Specialty Chemicals and Engineered Materials (SCEM); Microcontamination Control (MC); and Advanced Materials Handling (AMH). The SCEM segment offers high-performance and high-purity process chemistries, gases, and materials, as well as delivery systems to support semiconductor and other advanced manufacturing processes. The MC segment provides solutions to filter and purify critical liquid chemistries and gases used in semiconductor manufacturing processes and other high-technology industries. The AMH segment develops solutions to monitor, protect, transport, and deliver critical liquid chemistries, wafers, and other substrates for application in the semiconductor and other high-technology industries. The company's customers include semiconductor device manufacturers, semiconductor equipment makers, gas and chemical manufacturing companies, wafer grower companies, and manufacturers of high-precision electronics; and flat panel display equipment makers, materials suppliers and panel manufacturers, and manufacturers of hard disk drive components and devices. It also serves manufacturers and suppliers in the solar and life science industries, electrical discharge machining customers, glass and glass container manufacturers, aerospace manufacturers, and manufacturers of biomedical implantation devices. The company was founded in 1966 and is headquartered in Billerica, Massachusetts.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Billerica"}, "GSTX": {"short_name": "GRAPHENE & SOLAR TECHNOLOGIES L", "long_name": "Graphene & Solar Technologies Limited", "summary": "Graphene & Solar Technologies Limited produces high purity quartz sand. The company's products are used for manufacturing photovoltaic solar cells, semiconductors, and high-end electronics. It also owns Quartz Hill and White Springs deposits located in North Queensland, Australia. Graphene & Solar Technologies Limited The company was formerly known as Solar Quartz Technologies Corporation and changed its name to Graphene & Solar Technologies Limited in September 2018. The company is based in Beverly Hills, California. Graphene & Solar Technologies Limited is a subsidiary of Phoenix Global Holdings Limited.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Beverly Hills"}, "GXG.F": {"short_name": "NANOCO GROUP PLC  LS -,10", "long_name": "Nanoco Group plc", "summary": "Nanoco Group plc, together with its subsidiaries, engages in the research, development, manufacture, and licensing of cadmium and heavy-metal-free quantum dots (CFQD) and semiconductor nanomaterials for use in various commercial applications. The company offers CFQD quantum dots, which are fluorescent semiconductor nanoparticles for OLED and ÂµLED colour conversion, QD-EL, and security tagging applications; CFQD fine color film, an optical film for use in colour conversion applications; HEATWAVE quantum dots for use in the sensor industry applications; copper indium gallium diselenide/sulfide and copper indium diselenide/sulfide nanoparticles for solar spectrum applications; and VIVODOTS nanoparticles for medical and veterinary applications. It has operations in the United Kingdom, rest of Europe, Asia, and the United States. The company was founded in 2001 and is headquartered in Manchester, the United Kingdom.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Manchester"}, "ICHR": {"short_name": "Ichor Holdings", "long_name": "Ichor Holdings, Ltd.", "summary": "Ichor Holdings, Ltd. engages in the design, engineering, and manufacture of fluid delivery subsystems and components for semiconductor capital equipment. It primarily offers gas and chemical delivery subsystems that are used in the manufacturing of semiconductor devices. The company's gas delivery subsystems deliver, monitor, and control gases used in semiconductor manufacturing processes, such as etch and deposition; and chemical delivery subsystems blend and dispense the reactive liquid chemistries used in semiconductor manufacturing processes comprising chemical-mechanical planarization, electroplating, and cleaning. It also manufactures precision machined components, weldments, and proprietary products for use in fluid delivery systems. The company operates in the United States, Europe, Singapore, and internationally. Ichor Holdings, Ltd. was founded in 1999 and is headquartered in Fremont, California.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Fremont"}, "IPGP": {"short_name": "IPG Photonics Corporation", "long_name": "IPG Photonics Corporation", "summary": "IPG Photonics Corporation develops and manufactures a range of high-performance fiber lasers, fiber amplifiers, and diode lasers used in various applications primarily in materials processing worldwide. The company's laser products include high power lasers; fiber pigtailed packaged diodes and fiber coupled direct diode laser systems; high-energy pulsed lasers, multi-wavelength and tunable lasers, and single-polarization and single-frequency lasers; and high power optical fiber delivery cables, fiber couplers, beam switches, chillers, scanners, and other accessories. It also provides erbium-doped fiber and Raman amplifiers, and integrated communications systems, which are deployed in broadband networks; and ytterbium and thulium specialty fiber amplifiers and broadband light sources. In addition, the company offers integrated laser systems; 2D compact flat sheet cutter systems and multi-axis systems; welding seam stepper and picker, a fiber laser welding tool; and specialized fiber laser systems for material processing applications; and optical transceiver and transponder modules for interconnecting electronic equipment, including Ethernet switches, IP routers and SONET/SDH optical transport modules within telecommunications, cable multi-system operator, and data center networking applications. Its lasers and amplifiers are also used in materials processing, advanced communications, and medical applications. The company markets its products to original equipment manufacturers, system integrators, and end users through direct sales force, as well as through agreements with independent sales representatives and distributors. IPG Photonics Corporation was founded in 1990 and is headquartered in Oxford, Massachusetts.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Oxford"}, "IPGP.MX": {"short_name": "IPG PHOTONICS CORPORATION", "long_name": "IPG Photonics Corporation", "summary": "IPG Photonics Corporation develops and manufactures a range of high-performance fiber lasers, fiber amplifiers, and diode lasers used in various applications primarily in materials processing worldwide. The company's laser products include high power lasers; fiber pigtailed packaged diodes and fiber coupled direct diode laser systems; high-energy pulsed lasers, multi-wavelength and tunable lasers, and single-polarization and single-frequency lasers; and high power optical fiber delivery cables, fiber couplers, beam switches, chillers, scanners, and other accessories. It also provides erbium-doped fiber and Raman amplifiers, and integrated communications systems, which are deployed in broadband networks; and ytterbium and thulium specialty fiber amplifiers and broadband light sources. In addition, the company offers integrated laser systems; 2D compact flat sheet cutter systems and multi-axis systems; welding seam stepper and picker, a fiber laser welding tool; and specialized fiber laser systems for material processing applications; and optical transceiver and transponder modules for interconnecting electronic equipment, including Ethernet switches, IP routers and SONET/SDH optical transport modules within telecommunications, cable multi-system operator, and data center networking applications. Its lasers and amplifiers are also used in materials processing, advanced communications, and medical applications. The company markets its products to original equipment manufacturers, system integrators, and end users through direct sales force, as well as through agreements with independent sales representatives and distributors. IPG Photonics Corporation was founded in 1990 and is headquartered in Oxford, Massachusetts.", "currency": "MXN", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Oxford"}, "IQE.L": {"short_name": "IQE PLC ORD 1P", "long_name": "IQE plc", "summary": "IQE plc develops, manufactures, and sells advanced semiconductor materials. The company operates through Wireless, Photonics, and CMOS++ segments. It manufactures compound semiconductor wafers or epiwafers using epitaxy process; and offers various products, including HBTs, pHEMTs, BiFETs/BiHEMTs, HFETs, LMHEMTs, LNHEMTs, and MESFETs for use in electronic devices, such as mobile phones, smartphones, mobile networks, Wi-Fi, smart metering, satellite navigation, and a plethora of connected devices. The company also provides a range of wafers comprising optical fiber communications optical storage solutions consisting of CDs and DVDs; optical networking solutions, including storage area networks; computing solutions, such as optical mouse devices and CD/DVD ROMs; office/professional solutions comprising laser printing/copying; and energy solutions consisting of solar cells for emitters and detectors, infrared, solar, optical interconnects, laser projection, gesture recognition, solid state lighting applications. In addition, it offers IR sensor, thermal imaging, night vision, and thermal photovoltaic products for infrared applications; and compound semiconductor solar cells and panels for utility scale electricity generation, satellite/space power generation, power generation, and power applications. Further, the company produces compound semiconductor on silicon wafers; and engineered substrates for next-generation microprocessors, and ultra high speed/density flash memory and MEMs devices. Additionally, it provides gallium nitride, a compound semiconductor, which includes a range of RF, photonic, and electronic properties. The company serves in the United States, rest of the Americas, France, Germany, Israel, the United Kingdom, rest of Europe, the Middle East, Africa, the People's Republic of China, Japan, Taiwan, and rest of the Asia-Pacific. IQE plc was founded in 1988 and is headquartered in Cardiff, the United Kingdom.", "currency": "GBp", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Cardiff"}, "IQEPF": {"short_name": "IQE PLC", "long_name": "IQE plc", "summary": "IQE plc develops, manufactures, and sells advanced semiconductor materials. The company operates through Wireless, Photonics, and CMOS++ segments. It manufactures compound semiconductor wafers or epiwafers using epitaxy process; and offers various products, including HBTs, pHEMTs, BiFETs/BiHEMTs, HFETs, LMHEMTs, LNHEMTs, and MESFETs for use in electronic devices, such as mobile phones, smartphones, mobile networks, Wi-Fi, smart metering, satellite navigation, and a plethora of connected devices. The company also provides a range of wafers comprising optical fiber communications optical storage solutions consisting of CDs and DVDs; optical networking solutions, including storage area networks; computing solutions, such as optical mouse devices and CD/DVD ROMs; office/professional solutions comprising laser printing/copying; and energy solutions consisting of solar cells for emitters and detectors, infrared, solar, optical interconnects, laser projection, gesture recognition, solid state lighting applications. In addition, it offers IR sensor, thermal imaging, night vision, and thermal photovoltaic products for infrared applications; and compound semiconductor solar cells and panels for utility scale electricity generation, satellite/space power generation, power generation, and power applications. Further, the company produces compound semiconductor on silicon wafers; and engineered substrates for next-generation microprocessors, and ultra high speed/density flash memory and MEMs devices. Additionally, it provides gallium nitride, a compound semiconductor, which includes a range of RF, photonic, and electronic properties. The company serves in the United States, rest of the Americas, France, Germany, Israel, the United Kingdom, rest of Europe, the Middle East, Africa, the People's Republic of China, Japan, Taiwan, and rest of the Asia-Pacific. IQE plc was founded in 1988 and is headquartered in Cardiff, the United Kingdom.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Cardiff"}, "IQX.F": {"short_name": "IQE PLC  LS-,01", "long_name": "IQE plc", "summary": "IQE plc develops, manufactures, and sells advanced semiconductor materials. The company operates through Wireless, Photonics, and CMOS++ segments. It manufactures compound semiconductor wafers or epiwafers using epitaxy process; and offers various products, including HBTs, pHEMTs, BiFETs/BiHEMTs, HFETs, LMHEMTs, LNHEMTs, and MESFETs for use in electronic devices, such as mobile phones, smartphones, mobile networks, Wi-Fi, smart metering, satellite navigation, and a plethora of connected devices. The company also provides a range of wafers comprising optical fiber communications optical storage solutions consisting of CDs and DVDs; optical networking solutions, including storage area networks; computing solutions, such as optical mouse devices and CD/DVD ROMs; office/professional solutions comprising laser printing/copying; and energy solutions consisting of solar cells for emitters and detectors, infrared, solar, optical interconnects, laser projection, gesture recognition, solid state lighting applications. In addition, it offers IR sensor, thermal imaging, night vision, and thermal photovoltaic products for infrared applications; and compound semiconductor solar cells and panels for utility scale electricity generation, satellite/space power generation, power generation, and power applications. Further, the company produces compound semiconductor on silicon wafers; and engineered substrates for next-generation microprocessors, and ultra high speed/density flash memory and MEMs devices. Additionally, it provides gallium nitride, a compound semiconductor, which includes a range of RF, photonic, and electronic properties. The company serves in the United States, rest of the Americas, France, Germany, Israel, the United Kingdom, rest of Europe, the Middle East, Africa, the People's Republic of China, Japan, Taiwan, and rest of the Asia-Pacific. IQE plc was founded in 1988 and is headquartered in Cardiff, the United Kingdom.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Cardiff"}, "KLAC": {"short_name": "KLA Corporation", "long_name": "KLA Corporation", "summary": "KLA Corporation designs, manufactures, and markets process control and yield management solutions for the semiconductor and related nanoelectronics industries worldwide. The company offers chip and wafer manufacturing products, including defect inspection and review systems, metrology solutions, in situ process monitoring products, computational lithography software, and data analytics systems for chip manufacturers to manage yield throughout the semiconductor fabrication process. It also provides reticle manufacturing products, such as reticle inspection, metrology, and data analytics systems for mask shops; and packaging manufacturing products comprising packaging process control on wafer, automated optical inspection, data analytics, and packaging process control after singulation. In addition, the company offers compound semiconductor, power device, light emitting diode, and microelectromechanical system manufacturing products; data storage media/head manufacturing products; general purpose/lab applications; and previous-generation KLA systems. Further, it provides wafer processing solutions; printed circuit boards, and display and inspection components; products for the deposition of thin film coating of materials on crystalline silicon photovoltaic wafers; and other services. The company offers its products and services for use by various bare wafer, integrated circuit, reticle, and hard disk drive manufacturers. The company was formerly known as KLA-Tencor Corporation and changed its name to KLA Corporation in July 2019. KLA Corporation was founded in 1975 and is headquartered in Milpitas, California.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Milpitas"}, "KLAC.VI": {"short_name": "KLA-TENCOR CORP", "long_name": "KLA Corporation", "summary": "KLA Corporation designs, manufactures, and markets process control and yield management solutions for the semiconductor and related nanoelectronics industries worldwide. The company offers chip and wafer manufacturing products, including defect inspection and review systems, metrology solutions, in situ process monitoring products, computational lithography software, and data analytics systems for chip manufacturers to manage yield throughout the semiconductor fabrication process. It also provides reticle manufacturing products, such as reticle inspection, metrology, and data analytics systems for mask shops; and packaging manufacturing products comprising packaging process control on wafer, automated optical inspection, data analytics, and packaging process control after singulation. In addition, the company offers compound semiconductor, power device, light emitting diode, and microelectromechanical system manufacturing products; data storage media/head manufacturing products; general purpose/lab applications; and previous-generation KLA systems. Further, it provides wafer processing solutions; printed circuit boards, and display and inspection components; products for the deposition of thin film coating of materials on crystalline silicon photovoltaic wafers; and other services. The company offers its products and services for use by various bare wafer, integrated circuit, reticle, and hard disk drive manufacturers. The company was formerly known as KLA-Tencor Corporation and changed its name to KLA Corporation in July 2019. KLA Corporation was founded in 1975 and is headquartered in Milpitas, California.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "VIE", "market": "at_market", "country": "United States", "city": "Milpitas"}, "KLIC": {"short_name": "Kulicke and Soffa Industries, I", "long_name": "Kulicke and Soffa Industries, Inc.", "summary": "Kulicke and Soffa Industries, Inc. designs, manufactures, and sells capital equipment and tools to assemble semiconductor devices. It operates in two segments, Capital Equipment, and Aftermarket Products and Services (APS). The Capital Equipment segment manufactures and sells ball and wedge bonders, and advanced packaging and electronic assembly solutions. The APS segment manufactures and sells dicing blades, capillaries, and bonding wedges. The company also services, maintains, repairs, and upgrades equipment. It serves semiconductor device manufacturers, integrated device manufacturers, outsourced semiconductor assembly and test providers, other electronics manufacturers, industrial manufacturers, and automotive electronics suppliers primarily in the United States and the Asia/Pacific region. Kulicke and Soffa Industries, Inc. was founded in 1951 and is headquartered in Singapore.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "KU1.F": {"short_name": "KULICKE + SOFFA IND.", "long_name": "Kulicke and Soffa Industries, Inc.", "summary": "Kulicke and Soffa Industries, Inc. designs, manufactures, and sells capital equipment and tools to assemble semiconductor devices. It operates in two segments, Capital Equipment, and Aftermarket Products and Services (APS). The Capital Equipment segment manufactures and sells ball and wedge bonders, and advanced packaging and electronic assembly solutions. The APS segment manufactures and sells dicing blades, capillaries, and bonding wedges. The company also services, maintains, repairs, and upgrades equipment. It serves semiconductor device manufacturers, integrated device manufacturers, outsourced semiconductor assembly and test providers, other electronics manufacturers, industrial manufacturers, and automotive electronics suppliers primarily in the United States and the Asia/Pacific region. Kulicke and Soffa Industries, Inc. was founded in 1951 and is headquartered in Singapore.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "LRCX": {"short_name": "Lam Research Corporation", "long_name": "Lam Research Corporation", "summary": "Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits worldwide. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper damascene manufacturing; SOLA ultraviolet thermal processing products for film treatments; and VECTOR plasma-enhanced CVD ALD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition (HDP-CVD) products; and Striker single-wafer atomic layer deposition (ALD) products that provide multiple dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; Da Vinci, DV-Prime, EOS, and SP to address a range of wafer cleaning applications; and Metryx mass metrology systems for high precision in-line mass measurement in semiconductor wafer manufacturing. Lam Research Corporation was founded in 1980 and is headquartered in Fremont, California.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Fremont"}, "LRCX.VI": {"short_name": "LAM RESEARCH CORP", "long_name": "Lam Research Corporation", "summary": "Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits worldwide. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper damascene manufacturing; SOLA ultraviolet thermal processing products for film treatments; and VECTOR plasma-enhanced CVD ALD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition (HDP-CVD) products; and Striker single-wafer atomic layer deposition (ALD) products that provide multiple dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; Da Vinci, DV-Prime, EOS, and SP to address a range of wafer cleaning applications; and Metryx mass metrology systems for high precision in-line mass measurement in semiconductor wafer manufacturing. Lam Research Corporation was founded in 1980 and is headquartered in Fremont, California.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "VIE", "market": "at_market", "country": "United States", "city": "Fremont"}, "MBTN.SW": {"short_name": "MEYER BURGER N", "long_name": "Meyer Burger Technology AG", "summary": "Meyer Burger Technology AG, a technology company, provides systems and production equipment in the semiconductor and optoelectronic industries. It operates through Photovoltaics and Specialised Technologies segments. The company offers heat treatment system for heterojunction technology cells, latest generation cell coating, latest-generation integrated cell lines; front and rear SiN deposition, three deposition processes in a single piece of equipment, equipment for passivated emitter rear cell cell coating, SiN front side coating; and cell testers. It also provides stringer for SmartWire cell connection; SmartWire connection module lines; module tester and module inspection systems; industrial microwave and plasma systems; and inkjet printing products. In addition, the company offers installation and commissioning, service level agreements, training, process support, maintenance and repair, parts and consumables, overhaul, and upgrades and retrofit services. It operates in Switzerland, Germany, rest of Europe, Asia, the United States, and internationally. The company has a strategic partnership with Oxford Photovoltaics Limited to advance the technology for the mass production of perovskite on silicium heterojunction tandem cells. Meyer Burger Technology AG was founded in 1953 and is headquartered in Thun, Switzerland.", "currency": "CHF", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "EBS", "market": "ch_market", "country": "Switzerland", "city": "Thun"}, "MELE.BR": {"short_name": "MELEXIS", "long_name": "Melexis NV", "summary": "Melexis NV designs, develops, tests, and markets advanced integrated semiconductor devices primarily for the automotive industry in Europe, the Middle-East, Africa, the Asia Pacific, and North and Latin America. The company offers position, latch and switch, current, temperature, optical, pressure, and speed sensor ICs. It also provides embedded motor driver, fan, LED, and pre driver ICs; and LIN/CAN system basis, NFC/RFID, radio-frequency receiver and transmitter, and switch controller ICs. The company was founded in 1988 and is headquartered in Ieper, Belgium. Melexis NV is a subsidiary of Xtrion NV.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "BRU", "market": "be_market", "country": "Belgium", "city": "Ieper"}, "MEMS.PA": {"short_name": "MEMSCAP REGPT", "long_name": "MEMSCAP, S.A.", "summary": "MEMSCAP, S.A. provides products and solutions based on micro-electro-mechanical systems (MEMS) for aerospace/defense, optical communications, medical and biomedical, and IT/consumer markets worldwide. The company offers pressure sensors, pressure transducers, and pressure switches for various applications, such as air data computers, cabin pressure, engine control, altimeters, barometers, cockpit instruments, and air data test sets. It also provides gold coated and titanium based pressure transducers, plastic domes, line-sets, and related accessories; and magnetic switches/relays, as well as supplies implantable pressure sensors for spinal pressure monitoring, abdominal aortic aneurism, etc. In addition, the company supplies optical MEMS chips for variable optical attenuators in optical telecommunication markets; and provides the multi-user MEMS processes (MUMPs) comprising PolyMUMPs, SOIMUMPs, and PiezoMUMPs, as well as MUMPs-PLUS and post processing services. Further, it offers custom products, including wafers, MEMS dies, and wafer level packaged devices; and manufacturing services, as well as prototyping services. The company sells its products and services to Fortune 500 companies, high-technology industries, research institutes, and universities. MEMSCAP, S.A. was founded in 1997 and is headquartered in Crolles, France.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PAR", "market": "fr_market", "country": "France", "city": "Crolles"}, "MEX.F": {"short_name": "MELEXIS NV", "long_name": "Melexis NV", "summary": "Melexis NV designs, develops, tests, and markets advanced integrated semiconductor devices primarily for the automotive industry in Europe, the Middle-East, Africa, the Asia Pacific, and North and Latin America. The company offers position, latch and switch, current, temperature, optical, pressure, and speed sensor ICs. It also provides embedded motor driver, fan, LED, and pre driver ICs; and LIN/CAN system basis, NFC/RFID, radio-frequency receiver and transmitter, and switch controller ICs. The company was founded in 1988 and is headquartered in Ieper, Belgium. Melexis NV is a subsidiary of Xtrion NV.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "Belgium", "city": "Ieper"}, "MMAPF": {"short_name": "MEMSCAP", "long_name": "MEMSCAP, S.A.", "summary": "MEMSCAP, S.A. provides products and solutions based on micro-electro-mechanical systems (MEMS) for aerospace/defense, optical communications, medical and biomedical, and IT/consumer markets worldwide. The company offers pressure sensors, pressure transducers, and pressure switches for various applications, such as air data computers, cabin pressure, engine control, altimeters, barometers, cockpit instruments, and air data test sets. It also provides gold coated and titanium based pressure transducers, plastic domes, line-sets, and related accessories; and magnetic switches/relays, as well as supplies implantable pressure sensors for spinal pressure monitoring, abdominal aortic aneurism, etc. In addition, the company supplies optical MEMS chips for variable optical attenuators in optical telecommunication markets; and provides the multi-user MEMS processes (MUMPs) comprising PolyMUMPs, SOIMUMPs, and PiezoMUMPs, as well as MUMPs-PLUS and post processing services. Further, it offers custom products, including wafers, MEMS dies, and wafer level packaged devices; and manufacturing services, as well as prototyping services. The company sells its products and services to Fortune 500 companies, high-technology industries, research institutes, and universities. MEMSCAP, S.A. was founded in 1997 and is headquartered in Crolles, France.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "France", "city": "Crolles"}, "MSBA.F": {"short_name": "MEMSCAP ACT.NOUV. EO0,25", "long_name": "MEMSCAP, S.A.", "summary": "MEMSCAP, S.A. provides products and solutions based on micro-electro-mechanical systems (MEMS) for aerospace/defense, optical communications, medical and biomedical, and IT/consumer markets worldwide. The company offers pressure sensors, pressure transducers, and pressure switches for various applications, such as air data computers, cabin pressure, engine control, altimeters, barometers, cockpit instruments, and air data test sets. It also provides gold coated and titanium based pressure transducers, plastic domes, line-sets, and related accessories; and magnetic switches/relays, as well as supplies implantable pressure sensors for spinal pressure monitoring, abdominal aortic aneurism, etc. In addition, the company supplies optical MEMS chips for variable optical attenuators in optical telecommunication markets; and provides the multi-user MEMS processes (MUMPs) comprising PolyMUMPs, SOIMUMPs, and PiezoMUMPs, as well as MUMPs-PLUS and post processing services. Further, it offers custom products, including wafers, MEMS dies, and wafer level packaged devices; and manufacturing services, as well as prototyping services. The company sells its products and services to Fortune 500 companies, high-technology industries, research institutes, and universities. MEMSCAP, S.A. was founded in 1997 and is headquartered in Crolles, France.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "France", "city": "Crolles"}, "MU2.MU": {"short_name": "MIMASU SEMICON.IND.", "long_name": "Mimasu Semiconductor Industry Co., Ltd.", "summary": "Mimasu Semiconductor Industry Co., Ltd. engages in the processing and sales of semiconductor materials in Japan. The company's semiconductor materials include prime and recycle wafers. It also offers measuring instruments, testing machines, information equipment, automatic control equipment, and other precision equipment, as well as manufacturing, inspection, and testing systems; and develops and sells in-house products and related systems. In addition, the company manufactures and sells various plants, such as pure water production and wastewater treatment equipment; and semiconductor manufacturing equipment. Mimasu Semiconductor Industry Co., Ltd. was founded in 1963 and is headquartered in Takasaki, Japan.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "MUN", "market": "dr_market", "country": "Japan", "city": "Takasaki"}, "MYBUF": {"short_name": "MEYER BURGER TECHNOLOGY AG", "long_name": "Meyer Burger Technology AG", "summary": "Meyer Burger Technology AG, a technology company, provides systems and production equipment in the semiconductor and optoelectronic industries. It operates through Photovoltaics and Specialised Technologies segments. The company offers heat treatment system for heterojunction technology cells, latest generation cell coating, latest-generation integrated cell lines; front and rear SiN deposition, three deposition processes in a single piece of equipment, equipment for passivated emitter rear cell cell coating, SiN front side coating; and cell testers. It also provides stringer for SmartWire cell connection; SmartWire connection module lines; module tester and module inspection systems; industrial microwave and plasma systems; and inkjet printing products. In addition, the company offers installation and commissioning, service level agreements, training, process support, maintenance and repair, parts and consumables, overhaul, and upgrades and retrofit services. It operates in Switzerland, Germany, rest of Europe, Asia, the United States, and internationally. The company has a strategic partnership with Oxford Photovoltaics Limited to advance the technology for the mass production of perovskite on silicium heterojunction tandem cells. Meyer Burger Technology AG was founded in 1953 and is headquartered in Thun, Switzerland.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "Switzerland", "city": "Thun"}, "N8U.SG": {"short_name": "UMS Holdings Ltd. Registered Sh", "long_name": "UMS Holdings Limited", "summary": "UMS Holdings Limited, an investment holding company, provides high precision front-end semiconductor components, and electromechanical assembly and final testing services. It operates in two segments, Semiconductor and Others. The Semiconductor segment offers precision machining components and equipment modules for semiconductor equipment manufacturers. The Others segment provides water disinfection systems shipment services; and supplies base components to oil and gas original equipment manufacturers, as well as trades in nonferrous metal alloys. The company also offers precision machining services, including milling, lathe, horizontal, cleaning, anodizing, and CMM; metal finishing services, such as electroless and selective nickel, anodizing, plating, e-polish, chemical cleaning, and parts refurbishment; and system integration, refurbishment, prototyping, and vendor managed inventory services, as well as electroplating services. In addition, it is involved in the assembly and integration of equipment and automated assembly lines; manufacture and assembly of stainless steel gaslines and weldment products; manufacture and repair of waste water treatment equipment; and holding of investment properties. The company serves semiconductor, electronic, machine tools, aerospace, and oil and gas industries. It operates in Singapore, Malaysia, Taiwan, the United States, South Korea, the People's Republic of China, and internationally. UMS Holdings Limited was incorporated in 2001 and is headquartered in Singapore.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "STU", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "NANO.L": {"short_name": "NANOCO GROUP PLC ORD 10P", "long_name": "Nanoco Group plc", "summary": "Nanoco Group plc, together with its subsidiaries, engages in the research, development, manufacture, and licensing of cadmium and heavy-metal-free quantum dots (CFQD) and semiconductor nanomaterials for use in various commercial applications. The company offers CFQD quantum dots, which are fluorescent semiconductor nanoparticles for OLED and ÂµLED colour conversion, QD-EL, and security tagging applications; CFQD fine color film, an optical film for use in colour conversion applications; HEATWAVE quantum dots for use in the sensor industry applications; copper indium gallium diselenide/sulfide and copper indium diselenide/sulfide nanoparticles for solar spectrum applications; and VIVODOTS nanoparticles for medical and veterinary applications. It has operations in the United Kingdom, rest of Europe, Asia, and the United States. The company was founded in 2001 and is headquartered in Manchester, the United Kingdom.", "currency": "GBp", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Manchester"}, "NDCVF": {"short_name": "NORDIC SEMICONDUCTOR", "long_name": "Nordic Semiconductor ASA", "summary": "Nordic Semiconductor ASA, a fabless semiconductor company, designs, develops, and sells integrated circuits and related solutions for short and long range wireless communication in Europe, the Americas, and the Asia/Pacific. The company specializes in ultra-low power components, based on its proprietary 2.4 GHz RF, Bluetooth low energy, and LTE-M and NB- Internet of Things (IoT); and develops long power cellular IoT. It also provides Bluetooth 5 solutions; low power cellular devices for the IoT; and Bluetooth 5.1 solutions for direction finding applications. In addition, the company offers Zigbee 3.0 IoT solutions; Thread solution for low-power IEEE 802.15.4 devices; nRF52 and nRF51 series system-on-chips, and nRF5 software development kits; ANT, a proprietary ultra-low power wireless solution for battery operated products; and application specific integrated circuits and related consulting services. Further, it provides software for system development, communication stacks, and application layer software, as well as development tools for desktops, mobiles, and clouds. The company's products are used in various applications, such as audio and music, automotives, beacons, computer peripherals, connected health and homes, education, industrial automation, LED lightings, logistics and transport, retail and payment, sports and fitness, toys and gaming, virtual reality and augmented reality products, mobile phone accessories, and consumer electronics, as well as wearables, including connected watches, jewelry, proximity tags, and smart clothes and apparels. Nordic Semiconductor ASA was founded in 1983 and is headquartered in Trondheim, Norway.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "Norway", "city": "Trondheim"}, "NMR.F": {"short_name": "NOVA MEASURING INSTR.LTD.", "long_name": "Nova Measuring Instruments Ltd.", "summary": "Nova Measuring Instruments Ltd. designs, develops, produces, and sells process control systems used in the manufacture of semiconductors in Israel. Its product portfolio includes integrated and stand-alone metrology platforms for dimensional, films, and material metrology measurements for process control for various semiconductor manufacturing process steps, including lithography, etch, chemical mechanical planarization, and deposition. The company serves various sectors of the integrated circuit manufacturing industry, including logic, foundries, and memory manufactures, as well as end users and process equipment manufacturers worldwide. Nova Measuring Instruments Ltd. was founded in 1993 and is headquartered in Rehovot, Israel.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "Israel", "city": "Rehovot"}, "NNOCF": {"short_name": "NANOCO GROUP", "long_name": "Nanoco Group plc", "summary": "Nanoco Group plc, together with its subsidiaries, engages in the research, development, manufacture, and licensing of cadmium and heavy-metal-free quantum dots (CFQD) and semiconductor nanomaterials for use in various commercial applications. The company offers CFQD quantum dots, which are fluorescent semiconductor nanoparticles for OLED and ÂµLED colour conversion, QD-EL, and security tagging applications; CFQD fine color film, an optical film for use in colour conversion applications; HEATWAVE quantum dots for use in the sensor industry applications; copper indium gallium diselenide/sulfide and copper indium diselenide/sulfide nanoparticles for solar spectrum applications; and VIVODOTS nanoparticles for medical and veterinary applications. It has operations in the United Kingdom, rest of Europe, Asia, and the United States. The company was founded in 2001 and is headquartered in Manchester, the United Kingdom.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Manchester"}, "NOD.OL": {"short_name": "NORDIC SEMICONDUCT", "long_name": "Nordic Semiconductor ASA", "summary": "Nordic Semiconductor ASA, a fabless semiconductor company, designs, develops, and sells integrated circuits and related solutions for short and long range wireless communication in Europe, the Americas, and the Asia/Pacific. The company specializes in ultra-low power components, based on its proprietary 2.4 GHz RF, Bluetooth low energy, and LTE-M and NB- Internet of Things (IoT); and develops long power cellular IoT. It also provides Bluetooth 5 solutions; low power cellular devices for the IoT; and Bluetooth 5.1 solutions for direction finding applications. In addition, the company offers Zigbee 3.0 IoT solutions; Thread solution for low-power IEEE 802.15.4 devices; nRF52 and nRF51 series system-on-chips, and nRF5 software development kits; ANT, a proprietary ultra-low power wireless solution for battery operated products; and application specific integrated circuits and related consulting services. Further, it provides software for system development, communication stacks, and application layer software, as well as development tools for desktops, mobiles, and clouds. The company's products are used in various applications, such as audio and music, automotives, beacons, computer peripherals, connected health and homes, education, industrial automation, LED lightings, logistics and transport, retail and payment, sports and fitness, toys and gaming, virtual reality and augmented reality products, mobile phone accessories, and consumer electronics, as well as wearables, including connected watches, jewelry, proximity tags, and smart clothes and apparels. Nordic Semiconductor ASA was founded in 1983 and is headquartered in Trondheim, Norway.", "currency": "NOK", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "OSL", "market": "no_market", "country": "Norway", "city": "Trondheim"}, "NVMI": {"short_name": "Nova Measuring Instruments Ltd.", "long_name": "Nova Measuring Instruments Ltd.", "summary": "Nova Measuring Instruments Ltd. designs, develops, produces, and sells process control systems used in the manufacture of semiconductors in Israel. Its product portfolio includes integrated and stand-alone metrology platforms for dimensional, films, and material metrology measurements for process control for various semiconductor manufacturing process steps, including lithography, etch, chemical mechanical planarization, and deposition. The company serves various sectors of the integrated circuit manufacturing industry, including logic, foundries, and memory manufactures, as well as end users and process equipment manufacturers worldwide. Nova Measuring Instruments Ltd. was founded in 1993 and is headquartered in Rehovot, Israel.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "Israel", "city": "Rehovot"}, "NVMI.TA": {"short_name": "NOVA MEASURING INS", "long_name": "Nova Measuring Instruments Ltd.", "summary": "Nova Measuring Instruments Ltd. designs, develops, produces, and sells process control systems used in the manufacture of semiconductors in Israel. Its product portfolio includes integrated and stand-alone metrology platforms for dimensional, films, and material metrology measurements for process control for various semiconductor manufacturing process steps, including lithography, etch, chemical mechanical planarization, and deposition. The company serves various sectors of the integrated circuit manufacturing industry, including logic, foundries, and memory manufactures, as well as end users and process equipment manufacturers worldwide. Nova Measuring Instruments Ltd. was founded in 1993 and is headquartered in Rehovot, Israel.", "currency": "ILA", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Rehovot"}, "OLED": {"short_name": "Universal Display Corporation", "long_name": "Universal Display Corporation", "summary": "Universal Display Corporation engages in the research, development, and commercialization of organic light emitting diode (OLED) technologies and materials for use in display and solid-state lighting applications. As of February 20, 2020, it owned, exclusively licenses, or had sole rights to sublicense approximately 5,000 issued and pending patents worldwide. The company licenses and supplies its proprietary UniversalPHOLED materials to display and lighting manufacturers, and others. It is also involved in the research, development, and commercialization of other OLED device and manufacturing technologies, including FOLED that are flexible OLEDs for the fabrication of OLEDs on flexible substrates; OVJP, an organic vapor jet printing technology; thin-film encapsulation technology for the packaging of flexible OLEDs and other thin-film devices, as well as for use as a barrier film for plastic substrates; and UniversalP2OLED, which are printable phosphorescent OLEDs. In addition, the company provides technology development and support services, including third-party collaboration and support to third parties for the commercialization of their OLED products. Further, it provides contract research services in the areas of chemical materials synthesis research, development, and commercialization for non-OLED applications. The company was founded in 1985 and is headquartered in Ewing, New Jersey.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Ewing"}, "OLED.MX": {"short_name": "UNIVERSAL DISPLAY CORP", "long_name": "Universal Display Corporation", "summary": "Universal Display Corporation engages in the research, development, and commercialization of organic light emitting diode (OLED) technologies and materials for use in display and solid-state lighting applications. As of February 20, 2020, it owned, exclusively licenses, or had sole rights to sublicense approximately 5,000 issued and pending patents worldwide. The company licenses and supplies its proprietary UniversalPHOLED materials to display and lighting manufacturers, and others. It is also involved in the research, development, and commercialization of other OLED device and manufacturing technologies, including FOLED that are flexible OLEDs for the fabrication of OLEDs on flexible substrates; OVJP, an organic vapor jet printing technology; thin-film encapsulation technology for the packaging of flexible OLEDs and other thin-film devices, as well as for use as a barrier film for plastic substrates; and UniversalP2OLED, which are printable phosphorescent OLEDs. In addition, the company provides technology development and support services, including third-party collaboration and support to third parties for the commercialization of their OLED products. Further, it provides contract research services in the areas of chemical materials synthesis research, development, and commercialization for non-OLED applications. The company was founded in 1985 and is headquartered in Ewing, New Jersey.", "currency": "MXN", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Ewing"}, "OXIG.L": {"short_name": "OXFORD INSTRUMENTS PLC ORD 5P", "long_name": "Oxford Instruments plc", "summary": "Oxford Instruments plc, through its subsidiaries, researches, develops, manufactures, rents, sells, and services tools and systems in the United Kingdom, China, Japan, the United States, Germany, rest of Europe, rest of Asia, and internationally. It operates through Materials and Characterisation, Research and Discovery, and Service and Healthcare segments. The company offers atomic force microscopy products; tools for use in research and development across a range of applications, including semiconductors, renewable energy, mining, metallurgy, and forensics; etch and deposition processing equipment and solutions for use power and RF devices, VCSELs/lasers, 2D materials, augmented reality, biomems, failure analysis, HBLEDs, infrared sensors, MEMS and sensors, and quantum; and low temperature systems comprising wet systems, magnet systems, instrumentation products, and custom and specialty systems. It also provides optical imaging products; and nuclear magnetic resonance (NMR) instruments, including NMR spectrometers, QC/QA analyzers, and rock core analyzers for use in applications, such as agriculture and food, automotive and aviation, building and construction, chemicals, environment, illicit drugs testing, mining and minerals, pharma, polymers, rock core analysis, textiles, and education. In addition, the offers MRI and CT serving products; scientific cameras spectroscopy solutions, microscopy systems, and software for applications comprising astronomy, bio imaging and life science, energy generation and storage, forensics and environment, photonics, quantum technology, semiconductors, microelectronics, and data storage; and manufacture of x-ray tubes, power supplies, and integrated x-ray sources for analytical, medical imaging, food quality and packaging inspection, and industrial NDT markets. Oxford Instruments plc was founded in 1959 and is headquartered in Abingdon, the United Kingdom.", "currency": "GBp", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Abingdon"}, "OXINF": {"short_name": "OXFORD INSTRUMENTS", "long_name": "Oxford Instruments plc", "summary": "Oxford Instruments plc, through its subsidiaries, researches, develops, manufactures, rents, sells, and services tools and systems in the United Kingdom, China, Japan, the United States, Germany, rest of Europe, rest of Asia, and internationally. It operates through Materials and Characterisation, Research and Discovery, and Service and Healthcare segments. The company offers atomic force microscopy products; tools for use in research and development across a range of applications, including semiconductors, renewable energy, mining, metallurgy, and forensics; etch and deposition processing equipment and solutions for use power and RF devices, VCSELs/lasers, 2D materials, augmented reality, biomems, failure analysis, HBLEDs, infrared sensors, MEMS and sensors, and quantum; and low temperature systems comprising wet systems, magnet systems, instrumentation products, and custom and specialty systems. It also provides optical imaging products; and nuclear magnetic resonance (NMR) instruments, including NMR spectrometers, QC/QA analyzers, and rock core analyzers for use in applications, such as agriculture and food, automotive and aviation, building and construction, chemicals, environment, illicit drugs testing, mining and minerals, pharma, polymers, rock core analysis, textiles, and education. In addition, the offers MRI and CT serving products; scientific cameras spectroscopy solutions, microscopy systems, and software for applications comprising astronomy, bio imaging and life science, energy generation and storage, forensics and environment, photonics, quantum technology, semiconductors, microelectronics, and data storage; and manufacture of x-ray tubes, power supplies, and integrated x-ray sources for analytical, medical imaging, food quality and packaging inspection, and industrial NDT markets. Oxford Instruments plc was founded in 1959 and is headquartered in Abingdon, the United Kingdom.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Abingdon"}, "PLAB": {"short_name": "Photronics, Inc.", "long_name": "Photronics, Inc.", "summary": "Photronics, Inc., together with its subsidiaries, engages in the manufacture and sale of photomask products and services in the United States, Taiwan, Korea, Europe, China, and internationally. The company offers photomasks that are used in the manufacture of integrated circuits and flat panel displays (FPDs); and to transfer circuit patterns onto semiconductor wafers, FDP substrates, and other types of electrical and optical components. It sells its products to semiconductor and FPD manufacturers, designers, and foundries, as well as to other high-performance electronics manufacturers through its sales personnel and customer service representatives. The company was formerly known as Photronic Labs, Inc. and changed its name to Photronics, Inc. in 1990. Photronics, Inc. was founded in 1969 and is based in Brookfield, Connecticut.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Brookfield"}, "PQ2.F": {"short_name": "PHOTRONICS INC.", "long_name": "Photronics, Inc.", "summary": "Photronics, Inc., together with its subsidiaries, engages in the manufacture and sale of photomask products and services in the United States, Taiwan, Korea, Europe, China, and internationally. The company offers photomasks that are used in the manufacture of integrated circuits and flat panel displays (FPDs); and to transfer circuit patterns onto semiconductor wafers, FDP substrates, and other types of electrical and optical components. It sells its products to semiconductor and FPD manufacturers, designers, and foundries, as well as to other high-performance electronics manufacturers through its sales personnel and customer service representatives. The company was formerly known as Photronic Labs, Inc. and changed its name to Photronics, Inc. in 1990. Photronics, Inc. was founded in 1969 and is based in Brookfield, Connecticut.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Brookfield"}, "PVS.AX": {"short_name": "PIVOTAL CDI FORUS", "long_name": "Pivotal Systems Corporation", "summary": "Pivotal Systems Corporation designs, develops, manufactures, and sells gas flow controllers for the semiconductor industry in Asia and North America. The company's platform includes gas flow controller product lines that provide real-time monitoring and control of the critical parameters difficult to control in wafer processing. It serves integrated device manufacturers, foundries, and original equipment manufacturers. The company was founded in 2003 and is headquartered in Fremont, California.", "currency": "AUD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "ASX", "market": "au_market", "country": "United States", "city": "Fremont"}, "QLTU.TA": {"short_name": "QUALITAU", "long_name": "Qualitau Ltd", "summary": "Qualitau Ltd engages in the development, manufacture, and sale of test equipment and services for use in the semiconductor industry worldwide. The company provides reliability test systems, including package and wafer-level multi-application testing, package level pulse EM and BTS testing, package and wafer-level TDDB and HC testing, multi-site parallel wafer-level probing systems, and semi- auto probers. It also offers parametric and reliability solutions comprising desktop semiconductor parametric testers, fully automated multiplexers for automated wafer probing and testing, and micro-oven systems, as well as package and wafer level reliability test services. The company was founded in 1994 and is based in Ness Ziona, Israel.", "currency": "ILA", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Ness Ziona"}, "RBCN": {"short_name": "Rubicon Technology, Inc.", "long_name": "Rubicon Technology, Inc.", "summary": "Rubicon Technology, Inc. provides monocrystalline sapphire for applications in optical and industrial systems. It operates in Sapphire and Pharmacy segments. The company offers optical and industrial sapphire products in various shapes and sizes, including round and rectangular windows and wafers, domes, tubes, and rods for a range of end markets comprising defense and aerospace, specialty lighting, instrumentation, sensors and detectors, semiconductor process equipment, electronic substrates, medical, and laser applications. It also provides medications and vitamins to patients being discharged from skilled nursing facilities. The company markets and sells its products through its direct sales force in North America, Europe, and Asia. Its principal customers include defense subcontractors, industrial manufacturers, fabricators, and resellers. The company was founded in 2001 and is headquartered in Bensenville, Illinois.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Bensenville"}, "RECSI.OL": {"short_name": "REC SILICON ASA", "long_name": "REC Silicon ASA", "summary": "REC Silicon ASA, together with its subsidiaries, produces and sells silicon materials for the solar and electronics industries worldwide. It offers various solar grade polysilicon for solar applications, including granular polysilicon, Siemens rod sections, chunks, chips, and fines. The company also provides electronic grade polysilicon comprising TearDrop, as-grown Siemens rods, rod sections, chunks, and chips for use in Czochralski monocrystalline ingot/wafer manufacturing for the semiconductor industry, as well as other electronic market segments, such as optics and microelectromechanical systems; and float zone polysilicon. In addition, it offers silicon gases consisting of silane, dichlorosilane, monochlorosilane, disilane, and polysilanes. The company was formerly known as Renewable Energy Corporation ASA and changed its name to REC Silicon ASA in October 2013. REC Silicon ASA was founded in 1996 and is headquartered in Lysaker, Norway.", "currency": "NOK", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "OSL", "market": "no_market", "country": "Norway", "city": "Lysaker"}, "RI7.F": {"short_name": "RIBER S.A. INH.  EO -,16", "long_name": "Riber S.A.", "summary": "Riber S.A. provides molecular beam epitaxy (MBE) equipment and material evaporation sources for the semiconductor industry. The company offers MBE research tools for the production of epitaxial layers; MBE production systems; and refurbishment solutions. It also provides chemical vapor deposition (CVD) systems comprising MPVD 300, an ultra-high-vacuum system for depositing films. In addition, the company offers MBE cells and sources comprising Knudsen cells, valved sources, corrosive materials, RF plasma sources, gas sources, gas modules and specialty sources; resistant heaters; shutters, gaskets, viewports and viewport shutters, ion pumps, automatic impedance matchers, crucibles, inserts, liners, power supplies, and cables; and process controllers. Further, it provides vacuum thermal evaporation and linear sources, including point sources, linear sources, and process controllers. Additionally, the company offers technical support, advice, equipment upgrades, and reactor maintenance services to MBE users. It provides its products for use in arsenides, phosphides, antimonides, selenides, gallium nitrides, mercury cadmium tellurides, II-VI materials, silicon germanium, metals, and oxides. Riber S.A. was founded in 1964 and is headquartered in Bezons, France.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "France", "city": "Bezons"}, "RNWEF": {"short_name": "REC SILICON ASA", "long_name": "REC Silicon ASA", "summary": "REC Silicon ASA, together with its subsidiaries, produces and sells silicon materials for the solar and electronics industries worldwide. It offers various solar grade polysilicon for solar applications, including granular polysilicon, Siemens rod sections, chunks, chips, and fines. The company also provides electronic grade polysilicon comprising TearDrop, as-grown Siemens rods, rod sections, chunks, and chips for use in Czochralski monocrystalline ingot/wafer manufacturing for the semiconductor industry, as well as other electronic market segments, such as optics and microelectromechanical systems; and float zone polysilicon. In addition, it offers silicon gases consisting of silane, dichlorosilane, monochlorosilane, disilane, and polysilanes. The company was formerly known as Renewable Energy Corporation ASA and changed its name to REC Silicon ASA in October 2013. REC Silicon ASA was founded in 1996 and is headquartered in Lysaker, Norway.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "Norway", "city": "Lysaker"}, "RNWEY": {"short_name": "REC SILICON ASA", "long_name": "REC Silicon ASA", "summary": "REC Silicon ASA, together with its subsidiaries, produces and sells silicon materials for the solar and electronics industries worldwide. It offers various solar grade polysilicon for solar applications, including granular polysilicon, Siemens rod sections, chunks, chips, and fines. The company also provides electronic grade polysilicon comprising TearDrop, as-grown Siemens rods, rod sections, chunks, and chips for use in Czochralski monocrystalline ingot/wafer manufacturing for the semiconductor industry, as well as other electronic market segments, such as optics and microelectromechanical systems; and float zone polysilicon. In addition, it offers silicon gases consisting of silane, dichlorosilane, monochlorosilane, disilane, and polysilanes. The company was formerly known as Renewable Energy Corporation ASA and changed its name to REC Silicon ASA in October 2013. REC Silicon ASA was founded in 1996 and is headquartered in Lysaker, Norway.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "Norway", "city": "Lysaker"}, "RVS.AX": {"short_name": "REVASUM CDI 1:1", "long_name": "Revasum, Inc.", "summary": "Revasum, Inc. designs, develops, manufactures, and markets a portfolio of semiconductor processing equipment in Asia, North America, and Europe. The company offers grinding, polishing, and chemical mechanical planarization equipment to manufacture microchips, sensors, LEDs, and RF and power devices, which are used in IoT devices, cellphones, wearables, automotive, and 5G and industrial applications. It also provides wafer processing equipment for device and substrate manufacturing; and spare parts kits, on-site and off-site training, and training services. The company was founded in 2016 and is headquartered in San Luis Obispo, California.", "currency": "AUD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "ASX", "market": "au_market", "country": "United States", "city": "San Luis Obispo"}, "S3X.F": {"short_name": "SUMCO CORP.", "long_name": "Sumco Corporation", "summary": "Sumco Corporation, together with its subsidiaries, manufactures and sells silicon wafers for the semiconductor industry primarily in Japan, North America, Asia, and Europe. It provides monocrystalline ingots, as well as polished, annealed, epitaxial, junction isolated, silicon-on-insulator, and reclaimed polished wafers. The company was formerly known as Sumitomo Mitsubishi Silicon Corp. and changed its name to Sumco Corporation in August 2005. Sumco Corporation was founded in 1999 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "SCIA": {"short_name": "SCI ENGINEERED MATERIALS INC", "long_name": "SCI Engineered Materials, Inc.", "summary": "SCI Engineered Materials, Inc. engages in manufacturing and supplying materials for physical vapor deposition thin film applications. The company offers ceramic targets, metal sputtering targets, and backing plates for use in semiconductors, flat panel displays, photonics, glass, transparent electronics, and thin film solar and battery products. Its material are used to produce nano layers of metals and oxides for advanced material systems; and in applying decorative coatings for end uses, such as sink faucets to produce various electronic, photonic, and semiconductor products. The company serves domestic and multi-national corporations, universities, and research institutions. It distributes its products directly, as well as through independent manufacturers' representatives in the United States; and independent distributors and manufacturers' representatives internationally. The company was formerly known as Superconductive Components, Inc. and changed its name to SCI Engineered Materials, Inc. in 2007. SCI Engineered Materials, Inc. was founded in 1987 and is headquartered in Columbus, Ohio.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Columbus"}, "SCON": {"short_name": "SUPERCONDUCTOR TECHNOLOGIES INC", "long_name": "Superconductor Technologies Inc.", "summary": "Superconductor Technologies Inc., together with its subsidiaries, develops, produces, and commercializes high temperature superconductor materials and related technologies in the United States. It is also involved in developing conductus superconducting wire for power applications. The company was founded in 1987 and is headquartered in Austin, Texas.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Austin"}, "SESMF": {"short_name": "SUESS MICROTEC SE", "long_name": "SÜSS MicroTec SE", "summary": "SÃ\u009cSS MicroTec SE, together with its subsidiaries, develops, manufactures, and markets machines for the production of microelectronics, microelectromechanical systems, and related applications in Europe, the Middle East, Africa, North America, and the Asia Pacific. It operates through Lithography, Bonder, Photomask Equipment, and Microoptics divisions. The Lithography division offers mask aligners, and coaters/ developers, as well as UV projection lithography systems, and laser processing systems. The Bonder division provides bonder systems for microelectromechanical systems, compound semiconductors, and 3D integration markets. The Photomask Equipment division offers specialized tools for the cleaning and processing of photomasks for the semiconductor industry. The Microoptics division is involved in micro-optics and lenses business for various industrial applications. The company distributes its products through production facilities, as well as through distribution companies and trade representatives. SÃ\u009cSS MicroTec SE was founded in 1949 and is headquartered in Garching, Germany.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "Germany", "city": "Garching bei MÃ¼nchen"}, "SIS.DE": {"short_name": "FIRST SENSOR AG O.N.", "long_name": "First Sensor AG", "summary": "First Sensor AG develops, produces, and sells sensor chips, sensor components, sensors, and sensor systems for industrial, medical, and mobility markets worldwide. It offers optical and opto-electronic sensor solutions, including quadrant PIN photodiodes, quadrant avalanche photodiodes (APD), APD arrays, position-sensitive diodes, wavelength-sensitive diodes, InGaAs photodiodes, and silicon photomultipliers (SiPMs); optoelectronic modules; laser diodes; and custom sensors. The company also provides radiation sensors, such as detectors for ionizing radiation and SiPMs; pressure sensor elements and components, pressure sensors and transmitters, and pressure sensors for OEM applications; level sensors comprising hydrostatic liquid level sensors and optical liquid level switches; flow sensors consisting of mass flow sensors for gases and sensors for volumetric flow measurement; inertial sensors; and rugged and compact cameras. In addition, it offers power semiconductors, including power MOSFETs for aerospace applications, as well as radiation-hardened high voltage diodes for space applications; and other products, such as oxygen sensors, miniature solenoid valves, media resistant solenoid valves, electronic pressure controllers, and miniature diaphragm pumps. The company was formerly known as Silicon Sensor International AG and changed its name to First Sensor AG in June 2011. First Sensor AG was founded in 1991 and is headquartered in Berlin, Germany. As of March 12, 2020, First Sensor AG operates as a subsidiary of TE Connectivity Ltd.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "GER", "market": "de_market", "country": "Germany", "city": "Berlin"}, "SLOIY": {"short_name": "SOITEC S.A.", "long_name": "Soitec S.A.", "summary": "Soitec S.A. designs and produces semiconductor materials in the United States, Europe, and Asia. It offers silicon-on-insulator (SOI) wafers for processor and connectivity system on chips (SoCs), including partially-depleted SOI, fully-depleted SOI, and FinFET products. The company also provides RFeSI-SOI for enhanced signal integrity substrates for LTE and LTE-advanced front-end module ICs; iFEM-SOI substrates for Wi-Fi, Internet of Things, and other consumer applications; and HR-SOI products. In addition, it offers SOI wafers for manufacturing smart power ICs; photonics-SOIs for high-speed optical transceivers in data centers; imager-SOI for enhanced performance of next generation 3D cameras; piezoelectric-on-insulator engineered substrates for radio frequency (RF) front end module filters; and gallium nitride epitaxial wafers to meet the requirements of next generation 5G RF cellular networks, consumer power supplies, and smart sensor systems. The company's products are used to manufacture chips for phones, tablets, computers, IT servers, and data centers, as well as electronic components in cars, connected devices, industrial, and medical equipment. The company has a strategic partnership with Shanghai Simgui Technology Co., Ltd. to deliver RF-SOI and Power-SOI products. Soitec S.A. was founded in 1992 and is headquartered in Bernin, France.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "France", "city": "Bernin"}, "SMHN.DE": {"short_name": "SUESS MICROTEC SE NA O.N.", "long_name": "SÜSS MicroTec SE", "summary": "SÃ\u009cSS MicroTec SE, together with its subsidiaries, develops, manufactures, and markets machines for the production of microelectronics, microelectromechanical systems, and related applications in Europe, the Middle East, Africa, North America, and the Asia Pacific. It operates through Lithography, Bonder, Photomask Equipment, and Microoptics divisions. The Lithography division offers mask aligners, and coaters/ developers, as well as UV projection lithography systems, and laser processing systems. The Bonder division provides bonder systems for microelectromechanical systems, compound semiconductors, and 3D integration markets. The Photomask Equipment division offers specialized tools for the cleaning and processing of photomasks for the semiconductor industry. The Microoptics division is involved in micro-optics and lenses business for various industrial applications. The company distributes its products through production facilities, as well as through distribution companies and trade representatives. SÃ\u009cSS MicroTec SE was founded in 1949 and is headquartered in Garching, Germany.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "GER", "market": "de_market", "country": "Germany", "city": "Garching bei MÃ¼nchen"}, "SMHN.F": {"short_name": "SUESS MICROTEC SE NA O.N.", "long_name": "SÜSS MicroTec SE", "summary": "SÃ\u009cSS MicroTec SE, together with its subsidiaries, develops, manufactures, and markets machines for the production of microelectronics, microelectromechanical systems, and related applications in Europe, the Middle East, Africa, North America, and the Asia Pacific. It operates through Lithography, Bonder, Photomask Equipment, and Microoptics divisions. The Lithography division offers mask aligners, and coaters/ developers, as well as UV projection lithography systems, and laser processing systems. The Bonder division provides bonder systems for microelectromechanical systems, compound semiconductors, and 3D integration markets. The Photomask Equipment division offers specialized tools for the cleaning and processing of photomasks for the semiconductor industry. The Microoptics division is involved in micro-optics and lenses business for various industrial applications. The company distributes its products through production facilities, as well as through distribution companies and trade representatives. SÃ\u009cSS MicroTec SE was founded in 1949 and is headquartered in Garching, Germany.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "Germany", "city": "Garching bei MÃ¼nchen"}, "SMU.F": {"short_name": "SAMCO INC.", "long_name": "SAMCO Inc.", "summary": "SAMCO Inc. manufactures and sells operates as a semiconductor and materials company. The company primarily offers thin film deposition, microfabrication, cleaning, and surface treatment products. Its deposition systems include anode and cathode PECVD systems, atomic layer deposition systems, and silicon carbide (SiC) chemical vapor deposition systems; and etching systems comprise reactive ion etching systems, inductively coupled plasma (ICP) etch systems for general purpose, ICP etch systems for SiC etching, ICP etch systems for batch processing, silicon deep reactive ion etching systems, and XeF2 etch systems for MEMS release. The company also provides cleaning systems consisting of plasma cleaners, remote source plasma cleaners, and UV-ozone cleaners; and basic plasma research kits. It serves MEMS, laser diode, high brightness LED, TSV, SAW device, and RF device markets. The company was formerly known as SAMCO International, Inc. and changed its name to SAMCO Inc. in December 2004. SAMCO Inc. was founded in 1979 and is headquartered in Kyoto, Japan.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Kyoto"}, "SODI": {"short_name": "SOLITRON DEVICES INC", "long_name": "Solitron Devices, Inc.", "summary": "Solitron Devices, Inc. designs, develops, manufactures, and markets solid-state semiconductor components and related devices primarily for the military and aerospace markets. The company offers various bipolar and metal oxide semiconductor (MOS) power transistors, power and control hybrids, junction and power MOS field effect transistors, field effect transistors, and other related products. It also offers joint army/navy transistors, diodes, and standard military drawings voltage regulators; and power supplies and other electronic control products to the general electronic industry. The company's semiconductor products are used as components of military, commercial, and aerospace electronic equipment, such as ground and airborne radar systems, power distribution systems, missiles, missile control systems, and spacecraft, as well as for non-military, scientific, and industrial applications. It operates in the United States, Canada, Latin America, the Far East, the Middle East, Europe, and Australia. The company sells its products directly to customers, as well as through a network of manufacturers' representatives and distributors. Solitron Devices, Inc. was incorporated in 1959 and is headquartered in West Palm Beach, Florida.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "West Palm Beach"}, "SOH1.F": {"short_name": "SOITEC S.A.  EO 2", "long_name": "Soitec S.A.", "summary": "Soitec S.A. designs and produces semiconductor materials in the United States, Europe, and Asia. It offers silicon-on-insulator (SOI) wafers for processor and connectivity system on chips (SoCs), including partially-depleted SOI, fully-depleted SOI, and FinFET products. The company also provides RFeSI-SOI for enhanced signal integrity substrates for LTE and LTE-advanced front-end module ICs; iFEM-SOI substrates for Wi-Fi, Internet of Things, and other consumer applications; and HR-SOI products. In addition, it offers SOI wafers for manufacturing smart power ICs; photonics-SOIs for high-speed optical transceivers in data centers; imager-SOI for enhanced performance of next generation 3D cameras; piezoelectric-on-insulator engineered substrates for radio frequency (RF) front end module filters; and gallium nitride epitaxial wafers to meet the requirements of next generation 5G RF cellular networks, consumer power supplies, and smart sensor systems. The company's products are used to manufacture chips for phones, tablets, computers, IT servers, and data centers, as well as electronic components in cars, connected devices, industrial, and medical equipment. The company has a strategic partnership with Shanghai Simgui Technology Co., Ltd. to deliver RF-SOI and Power-SOI products. Soitec S.A. was founded in 1992 and is headquartered in Bernin, France.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "France", "city": "Bernin"}, "SOI.PA": {"short_name": "SOITEC", "long_name": "Soitec S.A.", "summary": "Soitec S.A. designs and produces semiconductor materials in the United States, Europe, and Asia. It offers silicon-on-insulator (SOI) wafers for processor and connectivity system on chips (SoCs), including partially-depleted SOI, fully-depleted SOI, and FinFET products. The company also provides RFeSI-SOI for enhanced signal integrity substrates for LTE and LTE-advanced front-end module ICs; iFEM-SOI substrates for Wi-Fi, Internet of Things, and other consumer applications; and HR-SOI products. In addition, it offers SOI wafers for manufacturing smart power ICs; photonics-SOIs for high-speed optical transceivers in data centers; imager-SOI for enhanced performance of next generation 3D cameras; piezoelectric-on-insulator engineered substrates for radio frequency (RF) front end module filters; and gallium nitride epitaxial wafers to meet the requirements of next generation 5G RF cellular networks, consumer power supplies, and smart sensor systems. The company's products are used to manufacture chips for phones, tablets, computers, IT servers, and data centers, as well as electronic components in cars, connected devices, industrial, and medical equipment. The company has a strategic partnership with Shanghai Simgui Technology Co., Ltd. to deliver RF-SOI and Power-SOI products. Soitec S.A. was founded in 1992 and is headquartered in Bernin, France.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PAR", "market": "fr_market", "country": "France", "city": "Bernin"}, "STRI": {"short_name": "STR HOLDINGS INC", "long_name": "STR Holdings, Inc.", "summary": "STR Holdings, Inc., together with its subsidiaries, operates as a plastic and industrial materials research and development company in the United States, Spain, India, and China. The company designs, develops, and manufactures encapsulants that protect the embedded semiconductor circuits of solar panels for sale to solar module manufacturers; and multi-layer films for packaging applications, such as meat, fish, cheese, yogurt, fruit, cereals, snack foods, etc. Its encapsulants can be used in crystalline silicon and thin-film solar modules. STR Holdings, Inc. was founded in 1944 and is headquartered in Enfield, Connecticut. STR Holdings, Inc. is a subsidiary of Zhen Fa New Energy (U.S.) Co., Ltd.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Enfield"}, "SUMCF": {"short_name": "SUMCO CORPORATION", "long_name": "Sumco Corporation", "summary": "Sumco Corporation, together with its subsidiaries, manufactures and sells silicon wafers for the semiconductor industry primarily in Japan, North America, Asia, and Europe. It provides monocrystalline ingots, as well as polished, annealed, epitaxial, junction isolated, silicon-on-insulator, and reclaimed polished wafers. The company was formerly known as Sumitomo Mitsubishi Silicon Corp. and changed its name to Sumco Corporation in August 2005. Sumco Corporation was founded in 1999 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "SUOPY": {"short_name": "SUMCO CORPORATION", "long_name": "Sumco Corporation", "summary": "Sumco Corporation, together with its subsidiaries, manufactures and sells silicon wafers for the semiconductor industry primarily in Japan, North America, Asia, and Europe. It provides monocrystalline ingots, as well as polished, annealed, epitaxial, junction isolated, silicon-on-insulator, and reclaimed polished wafers. The company was formerly known as Sumitomo Mitsubishi Silicon Corp. and changed its name to Sumco Corporation in August 2005. Sumco Corporation was founded in 1999 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "TER": {"short_name": "Teradyne, Inc.", "long_name": "Teradyne, Inc.", "summary": "Teradyne, Inc. designs, develops, manufactures, sells, and supports automatic test equipment worldwide. The company operates through Semiconductor Test, System Test, Industrial Automation, and Wireless Test segments. The Semiconductor Test segment offers products and services for wafer level and device package testing in automotive, industrial, communications, consumer, computer and electronic game, and other applications. This segment also provides FLEX test platform systems; J750 test system to address the highest volume semiconductor devices; Magnum platform that tests memory devices, such as flash memory and DRAM; and ETS platform for semiconductor manufacturers, and assembly and test subcontractors in the analog/mixed signal markets. It serves integrated device manufacturers that integrate the fabrication of silicon wafers into their business; fabless companies that outsource the manufacturing of silicon wafers; foundries; and outsourced semiconductor assembly and test providers. The System Test segment offers defense/aerospace test instrumentation and systems; storage test systems; and circuit-board test and inspection systems. The Industrial Automation segment provides collaborative, autonomous mobile, and advanced robotic control software for manufacturing and light industrial customers. The Wireless Test segment provides test solutions for use in the development and manufacture of wireless devices, smart phones, tablets, notebooks, laptops, peripherals, and Internet-of-Things devices under the LitePoint brand name. This segment also offers IQxel products for Wi-Fi and other standards; IQxstream solution for testing GSM, EDGE, CDMA2000, TD-SCDMA, WCDMA, HSPA+, LTE-FDD, TD_LTE, LTE-A, and 5G technologies; IQcell, a multi-device cellular signaling test solution; IQgig test solution; and turnkey test software for wireless chipsets. The company was founded in 1960 and is headquartered in North Reading, Massachusetts.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "North Reading"}, "TER.MX": {"short_name": "TERADYNE INC", "long_name": "Teradyne, Inc.", "summary": "Teradyne, Inc. designs, develops, manufactures, sells, and supports automatic test equipment worldwide. The company operates through Semiconductor Test, System Test, Industrial Automation, and Wireless Test segments. The Semiconductor Test segment offers products and services for wafer level and device package testing in automotive, industrial, communications, consumer, computer and electronic game, and other applications. This segment also provides FLEX test platform systems; J750 test system to address the highest volume semiconductor devices; Magnum platform that tests memory devices, such as flash memory and DRAM; and ETS platform for semiconductor manufacturers, and assembly and test subcontractors in the analog/mixed signal markets. It serves integrated device manufacturers that integrate the fabrication of silicon wafers into their business; fabless companies that outsource the manufacturing of silicon wafers; foundries; and outsourced semiconductor assembly and test providers. The System Test segment offers defense/aerospace test instrumentation and systems; storage test systems; and circuit-board test and inspection systems. The Industrial Automation segment provides collaborative, autonomous mobile, and advanced robotic control software for manufacturing and light industrial customers. The Wireless Test segment provides test solutions for use in the development and manufacture of wireless devices, smart phones, tablets, notebooks, laptops, peripherals, and Internet-of-Things devices under the LitePoint brand name. This segment also offers IQxel products for Wi-Fi and other standards; IQxstream solution for testing GSM, EDGE, CDMA2000, TD-SCDMA, WCDMA, HSPA+, LTE-FDD, TD_LTE, LTE-A, and 5G technologies; IQcell, a multi-device cellular signaling test solution; IQgig test solution; and turnkey test software for wireless chipsets. The company was founded in 1960 and is headquartered in North Reading, Massachusetts.", "currency": "MXN", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "North Reading"}, "TEW.F": {"short_name": "TESEC CORP.", "long_name": "TESEC Corporation", "summary": "TESEC Corporation designs, develops, manufactures, and sells semiconductor test equipment in Japan and internationally. It offers various test systems, including discrete device test systems, thermal resistance testers, inductive load testers, dynamic test systems, IPD/IPM test systems, and internal gate resistance testers. The company also provides various handlers comprising micro electro mechanical systems, strip test, film frame test, gravity, pick and place, discrete, and TAB handlers, as well as die sorters. In addition, it offers after-sales services, such as tester calibration, overhaul, and training services, as well as spare parts, warranty, maintenance, and resale services. The company was formerly known as TES Corporation and changed its name to TESEC Corporation in 1980. TESEC Corporation was founded in 1969 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "TEY.DE": {"short_name": "TERADYNE INC.  DL-,125", "long_name": "Teradyne, Inc.", "summary": "Teradyne, Inc. designs, develops, manufactures, sells, and supports automatic test equipment worldwide. The company operates through Semiconductor Test, System Test, Industrial Automation, and Wireless Test segments. The Semiconductor Test segment offers products and services for wafer level and device package testing in automotive, industrial, communications, consumer, computer and electronic game, and other applications. This segment also provides FLEX test platform systems; J750 test system to address the highest volume semiconductor devices; Magnum platform that tests memory devices, such as flash memory and DRAM; and ETS platform for semiconductor manufacturers, and assembly and test subcontractors in the analog/mixed signal markets. It serves integrated device manufacturers that integrate the fabrication of silicon wafers into their business; fabless companies that outsource the manufacturing of silicon wafers; foundries; and outsourced semiconductor assembly and test providers. The System Test segment offers defense/aerospace test instrumentation and systems; storage test systems; and circuit-board test and inspection systems. The Industrial Automation segment provides collaborative, autonomous mobile, and advanced robotic control software for manufacturing and light industrial customers. The Wireless Test segment provides test solutions for use in the development and manufacture of wireless devices, smart phones, tablets, notebooks, laptops, peripherals, and Internet-of-Things devices under the LitePoint brand name. This segment also offers IQxel products for Wi-Fi and other standards; IQxstream solution for testing GSM, EDGE, CDMA2000, TD-SCDMA, WCDMA, HSPA+, LTE-FDD, TD_LTE, LTE-A, and 5G technologies; IQcell, a multi-device cellular signaling test solution; IQgig test solution; and turnkey test software for wireless chipsets. The company was founded in 1960 and is headquartered in North Reading, Massachusetts.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "GER", "market": "de_market", "country": "United States", "city": "North Reading"}, "TEY.F": {"short_name": "TERADYNE INC.  DL-,125", "long_name": "Teradyne, Inc.", "summary": "Teradyne, Inc. designs, develops, manufactures, sells, and supports automatic test equipment worldwide. The company operates through Semiconductor Test, System Test, Industrial Automation, and Wireless Test segments. The Semiconductor Test segment offers products and services for wafer level and device package testing in automotive, industrial, communications, consumer, computer and electronic game, and other applications. This segment also provides FLEX test platform systems; J750 test system to address the highest volume semiconductor devices; Magnum platform that tests memory devices, such as flash memory and DRAM; and ETS platform for semiconductor manufacturers, and assembly and test subcontractors in the analog/mixed signal markets. It serves integrated device manufacturers that integrate the fabrication of silicon wafers into their business; fabless companies that outsource the manufacturing of silicon wafers; foundries; and outsourced semiconductor assembly and test providers. The System Test segment offers defense/aerospace test instrumentation and systems; storage test systems; and circuit-board test and inspection systems. The Industrial Automation segment provides collaborative, autonomous mobile, and advanced robotic control software for manufacturing and light industrial customers. The Wireless Test segment provides test solutions for use in the development and manufacture of wireless devices, smart phones, tablets, notebooks, laptops, peripherals, and Internet-of-Things devices under the LitePoint brand name. This segment also offers IQxel products for Wi-Fi and other standards; IQxstream solution for testing GSM, EDGE, CDMA2000, TD-SCDMA, WCDMA, HSPA+, LTE-FDD, TD_LTE, LTE-A, and 5G technologies; IQcell, a multi-device cellular signaling test solution; IQgig test solution; and turnkey test software for wireless chipsets. The company was founded in 1960 and is headquartered in North Reading, Massachusetts.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "North Reading"}, "TGAN": {"short_name": "TRANSPHORM INC", "long_name": "Transphorm, Inc.", "summary": "Transphorm, Inc. designs and manufactures gallium nitride (GaN) field effect transistors. It offers products for various high-voltage power conversion applications, such as server/storage products, PV inverters, automotive products, and motor control. The company offers products through sales representatives and distributors in the Americas, the EMEA, Japan, China and ASEAN, Korea, and Taiwan. Transphorm, Inc. was founded in 2007 and is based in Goleta, California.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Goleta"}, "TKY.F": {"short_name": "TOKYO ELECTRON LTD", "long_name": "Tokyo Electron Limited", "summary": "Tokyo Electron Limited, together with its subsidiaries, develops, manufactures, distributes, and sells semiconductor and flat panel display (FPD) production equipment in Japan, North America, Europe, South Korea, Taiwan, China, and internationally. The company's Semiconductor Production Equipment segment offers coaters/developers, plasma etch systems, and single wafer deposition systems and cleaning systems used in wafer processing; wafer probers used in wafer testing process; and wafer bonders/debonders used in packaging processes. Its Flat Panel Display Production Equipment segment provides coaters/developers and plasma etch/ash systems for use in the manufacture of FPDs, as well as inkjet printing systems for manufacturing OLED panels. The company also offers logistic, facility maintenance, and insurance services. Tokyo Electron Limited was incorporated in 1951 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "TOELF": {"short_name": "TOKYO ELECTRON", "long_name": "Tokyo Electron Limited", "summary": "Tokyo Electron Limited, together with its subsidiaries, develops, manufactures, distributes, and sells semiconductor and flat panel display (FPD) production equipment in Japan, North America, Europe, South Korea, Taiwan, China, and internationally. The company's Semiconductor Production Equipment segment offers coaters/developers, plasma etch systems, and single wafer deposition systems and cleaning systems used in wafer processing; wafer probers used in wafer testing process; and wafer bonders/debonders used in packaging processes. Its Flat Panel Display Production Equipment segment provides coaters/developers and plasma etch/ash systems for use in the manufacture of FPDs, as well as inkjet printing systems for manufacturing OLED panels. The company also offers logistic, facility maintenance, and insurance services. Tokyo Electron Limited was incorporated in 1951 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "TOELY": {"short_name": "TOKYO ELECTRON", "long_name": "Tokyo Electron Limited", "summary": "Tokyo Electron Limited, together with its subsidiaries, develops, manufactures, distributes, and sells semiconductor and flat panel display (FPD) production equipment in Japan, North America, Europe, South Korea, Taiwan, China, and internationally. The company's Semiconductor Production Equipment segment offers coaters/developers, plasma etch systems, and single wafer deposition systems and cleaning systems used in wafer processing; wafer probers used in wafer testing process; and wafer bonders/debonders used in packaging processes. Its Flat Panel Display Production Equipment segment provides coaters/developers and plasma etch/ash systems for use in the manufacture of FPDs, as well as inkjet printing systems for manufacturing OLED panels. The company also offers logistic, facility maintenance, and insurance services. Tokyo Electron Limited was incorporated in 1951 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "TRT": {"short_name": "Trio-Tech International", "long_name": "Trio-Tech International", "summary": "Trio-Tech International, together with its subsidiaries, provides manufacturing, testing, and distribution services to the semiconductor industry. The company's Testing Services segment offers stabilization bake, thermal shock, temperature cycling, mechanical shock, constant acceleration, gross and fine leak, electrical, static and dynamic burn-in, and vibration testing, as well as reliability lab and microprocessor equipment contract cleaning services. This segment also provides qualification testing services that test small samples of output from manufacturers for qualification of their processes and devices. Its Manufacturing segment manufactures front-end semiconductor test equipment, such as artic temperature controlled wafer chucks used for test, characterization, and failure analysis of semiconductor wafers and other components; and wet process stations for cleaning, rinsing, and drying semiconductor wafers, flat panel display magnetic disks, and other microelectronic substrates. This segment also manufactures back-end products comprising autoclaves and highly accelerated stress test equipment; burn-in equipment and boards; and component centrifuges and leak detection equipment. The company's Distribution segment distributes complementary products, including environmental chambers, handlers, interface systems, vibration systems, shaker systems, solderability testers, and other semiconductor equipment, as well as components, such as connectors, sockets, LCD display panels, and touch-screen panels. Its Real Estate segment invests in and rents real estate properties. The company primarily serves semiconductor chip manufacturers or testing facilities that purchase testing equipment. The company operates in the United States, Singapore, Malaysia, Thailand, and China. Trio-Tech International was founded in 1958 and is headquartered in Van Nuys, California.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Van Nuys"}, "UCE.F": {"short_name": "ULTRA CLEAN HLDGS DL-,001", "long_name": "Ultra Clean Holdings, Inc.", "summary": "Ultra Clean Holdings, Inc. designs, develops, prototypes, engineers, manufactures, and tests production tools, modules, and subsystems for the semiconductor and display capital equipment industries in the United States and internationally. The company provides subsystems, such as wafer cleaning modules; chemical delivery modules that deliver gases and reactive chemicals in a liquid or gaseous form from a centralized subsystem to the reaction chamber; frame assemblies, a support structures fabricated from steel tubing or folded sheet metal; process modules, a subsystems of semiconductor manufacturing tools that process integrated circuits onto wafers; and top-plate assemblies. It also offers various industrial and automation production equipment products; gas delivery systems, which include one or more gas lines, such as weldments, filters, mass flow controllers, regulators, pressure transducers and valves, component heaters, and an integrated electronic and/or pneumatic control system; fluid delivery systems consists of one or more chemical delivery units, including PFA tubing, filters, flow controllers, regulators, component heaters, and an integrated electronic and/or pneumatic control system; precision robotic systems that are used when accurate controlled motion is required; and other high level assemblies. In addition, the company provides tool chamber parts cleaning and coating services; micro-contamination analysis services for tool parts, wafers and depositions, chemicals, cleanroom materials, deionized water, and airborne molecular contamination; and analytical verification services for process tool chamber part cleaning. It primarily serves original equipment manufacturing customers in the semiconductor capital equipment and semiconductor integrated device manufacturing industries, as well as display, consumer, medical, energy, industrial, and research equipment industries. The company was founded in 1991 and is headquartered in Hayward, California.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Hayward"}, "UCTT": {"short_name": "Ultra Clean Holdings, Inc.", "long_name": "Ultra Clean Holdings, Inc.", "summary": "Ultra Clean Holdings, Inc. designs, develops, prototypes, engineers, manufactures, and tests production tools, modules, and subsystems for the semiconductor and display capital equipment industries in the United States and internationally. The company provides subsystems, such as wafer cleaning modules; chemical delivery modules that deliver gases and reactive chemicals in a liquid or gaseous form from a centralized subsystem to the reaction chamber; frame assemblies, a support structures fabricated from steel tubing or folded sheet metal; process modules, a subsystems of semiconductor manufacturing tools that process integrated circuits onto wafers; and top-plate assemblies. It also offers various industrial and automation production equipment products; gas delivery systems, which include one or more gas lines, such as weldments, filters, mass flow controllers, regulators, pressure transducers and valves, component heaters, and an integrated electronic and/or pneumatic control system; fluid delivery systems consists of one or more chemical delivery units, including PFA tubing, filters, flow controllers, regulators, component heaters, and an integrated electronic and/or pneumatic control system; precision robotic systems that are used when accurate controlled motion is required; and other high level assemblies. In addition, the company provides tool chamber parts cleaning and coating services; micro-contamination analysis services for tool parts, wafers and depositions, chemicals, cleanroom materials, deionized water, and airborne molecular contamination; and analytical verification services for process tool chamber part cleaning. It primarily serves original equipment manufacturing customers in the semiconductor capital equipment and semiconductor integrated device manufacturing industries, as well as display, consumer, medical, energy, industrial, and research equipment industries. The company was founded in 1991 and is headquartered in Hayward, California.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Hayward"}, "UNIT.TA": {"short_name": "UNITRONICS", "long_name": "Unitronics (1989) (R\"G) Ltd", "summary": "Unitronics (1989) (R'G) Ltd, together with its subsidiaries, designs, develops, produces, markets, and sells industrial automation products in Israel and internationally. It operates through, Products segment. The Products segment provides programmable logic controllers (PLCs), which are computer-based electronic products used for command and control of machines performing automated actions, including production systems and other automated installations in various areas. This segment offers various series of PLCs, as well as external expansion units for the PLCs; software for the PLCs; PLCs for management of automatic systems comprising industrial automation, logistics systems, and automated parking facilities, as well as for management of production floors; and additional auxiliary items. This segment serves manufacturers of PLC-controlled industrial machines in various industries consisting of plastics, textile, vehicle spare parts, food, petrochemical, and others. It serves customers in industrial and/or logistics businesses. Unitronics (1989) (R'G) Ltd was founded in 1989 and is headquartered in Airport City, Israel.", "currency": "ILA", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Airport City"}, "UVD.F": {"short_name": "UNIVERSAL DISPLAY  DL-,01", "long_name": "Universal Display Corporation", "summary": "Universal Display Corporation engages in the research, development, and commercialization of organic light emitting diode (OLED) technologies and materials for use in display and solid-state lighting applications. As of February 20, 2020, it owned, exclusively licenses, or had sole rights to sublicense approximately 5,000 issued and pending patents worldwide. The company licenses and supplies its proprietary UniversalPHOLED materials to display and lighting manufacturers, and others. It is also involved in the research, development, and commercialization of other OLED device and manufacturing technologies, including FOLED that are flexible OLEDs for the fabrication of OLEDs on flexible substrates; OVJP, an organic vapor jet printing technology; thin-film encapsulation technology for the packaging of flexible OLEDs and other thin-film devices, as well as for use as a barrier film for plastic substrates; and UniversalP2OLED, which are printable phosphorescent OLEDs. In addition, the company provides technology development and support services, including third-party collaboration and support to third parties for the commercialization of their OLED products. Further, it provides contract research services in the areas of chemical materials synthesis research, development, and commercialization for non-OLED applications. The company was founded in 1985 and is headquartered in Ewing, New Jersey.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Ewing"}, "VECO": {"short_name": "Veeco Instruments Inc.", "long_name": "Veeco Instruments Inc.", "summary": "Veeco Instruments Inc., together with its subsidiaries, develops, manufactures, sells, and supports semiconductor and thin film process equipment primarily to make electronic devices worldwide. It offers ion beam deposition and etch systems, laser annealing systems, metal organic chemical vapor deposition systems, packaging lithography equipment; single wafer wet etch and clean systems; molecular beam epitaxy systems; and atomic layer deposition and other deposition systems. The company sells its process equipment systems for use in the production of a range of microelectronic components, including radio frequency filters and amplifiers, power electronics, thin film magnetic heads, laser diodes, 3D NAND, DRAM, logic, mini-and micro-LEDs, micro-electro mechanical systems, and other semiconductor devices, as well as research centers and universities. Veeco Instruments Inc. was founded in 1945 and is headquartered in Plainview, New York.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Plainview"}, "VEO.F": {"short_name": "VEECO INSTRUMENTS  DL-,01", "long_name": "Veeco Instruments Inc.", "summary": "Veeco Instruments Inc., together with its subsidiaries, develops, manufactures, sells, and supports semiconductor and thin film process equipment primarily to make electronic devices worldwide. It offers ion beam deposition and etch systems, laser annealing systems, metal organic chemical vapor deposition systems, packaging lithography equipment; single wafer wet etch and clean systems; molecular beam epitaxy systems; and atomic layer deposition and other deposition systems. The company sells its process equipment systems for use in the production of a range of microelectronic components, including radio frequency filters and amplifiers, power electronics, thin film magnetic heads, laser diodes, 3D NAND, DRAM, logic, mini-and micro-LEDs, micro-electro mechanical systems, and other semiconductor devices, as well as research centers and universities. Veeco Instruments Inc. was founded in 1945 and is headquartered in Plainview, New York.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Plainview"}, "W-R.BK": {"short_name": "WOW FACTOR PUBLIC COMPANY LIMIT", "long_name": "Wow Factor Public Company Limited", "summary": "Wow Factor Public Company Limited, together with its subsidiaries, produces, imports, exports, and sells electronics spare parts in Thailand, Germany, Hong Kong, China, and internationally. The company is also involved in the rental, sale, and proceeding of advertisements; and provision of printing services for various publications. In addition, it engages in restaurant, bar, coffee shop, and food and beverages operations; and sells food and beverages. The company was formerly known as Electronics Industry Public Company Limited and changed its name to Wow Factor Public Company Limited in May 2020. Wow Factor Public Company Limited was founded in 1984 and is based in Bangkok, Thailand.", "currency": "THB", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Bangkok"}, "XPER": {"short_name": "Xperi Holding Corporation", "long_name": "Xperi Holding Corporation", "summary": "Xperi Holding Corporation invents, develops, and delivers various technologies worldwide. Its technologies that enable extraordinary experiences are integrated into consumer devices, media platforms, and semiconductors. The company provides its technologies under the DTS, HD Radio, IMAX Enhanced, Invensas, TiVo, and Perceive brands. It serves automotive, home solutions, mobile, pro audio and content solutions, semiconductor technologies, and intellectual property markets. The company is based in San Jose, California.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "San Jose"}, "XXA1.F": {"short_name": "AXCELIS TECHS  DL-,001", "long_name": "Axcelis Technologies, Inc.", "summary": "Axcelis Technologies, Inc. designs, manufactures, and services ion implantation and other processing equipment used in the fabrication of semiconductor chips in the United States, Europe, and Asia. The company offers high energy, high current, and medium current implanters for various application requirements. In addition, the company offers aftermarket lifecycle products and services, including used tools, spare parts, equipment upgrades, maintenance services, and customer training. It sells its equipment and services to semiconductor chip manufacturers through its direct sales force. The company was founded in 1978 and is headquartered in Beverly, Massachusetts.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Beverly"}}