{
    "0RS2.L": {
        "short_name": "MENSCH UND MASCHINE SOFTWARE SE",
        "long_name": "Mensch und Maschine Software SE",
        "summary": "Mensch und Maschine Software SE provides computer aided design, manufacturing, and engineering (CAD/CAM/CAE), product data management, and building information modeling/management solutions in Germany and internationally. It operates in two segments, VAR Business and M+M Software. The VAR Business segment sells CAD software to end users, as well as provides associated services. The M+M Software segments engages in the development of CAD/CAM/CAE software. The company offers software solutions that are used for the process control of milling, drilling, and turning in various industries, such as mechanical engineering; tool, mold, and die making; automotive and aerospace industry; medical technology; and toy industry, as well as watch, clock, and jewelry manufacturing. Mensch und Maschine Software SE was founded in 1984 and is headquartered in Starnberg, Germany.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Technical & System Software",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Germany",
        "city": "Starnberg"
    },
    "EPSIL.AT": {
        "short_name": "EPSILON NET S.A. (CR)",
        "long_name": "Epsilon Net S.A.",
        "summary": "Epsilon Net S.A. operates in the areas of information technology in Greece. The company offers software solutions for taxation, accounting, and payroll and human resource management, as well as applications for commercial, retail, customer relations management, restaurant, hospitality, and services sectors. It also provides specialized training services to business executives and professionals through various professional training programs; custom business training; and operates e-forologia, a networking portal that addresses businesses and professionals of financial field. In addition, the company offers online search engine services; Tax e-Calendar, a networking tool of tax and labor tasks management; Komvos, a network of solutions to tax issues; Epsilon 7 magazine; and tax/accounting e-magazine. Epsilon Net S.A. was founded in 1999 and is based in Thessaloniki, Greece.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Technical & System Software",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Thessaloniki"
    },
    "ILYDA.AT": {
        "short_name": "ILYDA  S.A. (CR)",
        "long_name": "Ilyda SA",
        "summary": "Ilyda SA engages in software development business in Greece. It offers enterprise resource planning systems, such as MegaTron ERP and Kinitron Smart ERP; Dioscourides Smart, Dioscourides XPress, and Dioscourides ERP Retail System for pharmacies; MegaTron Pharma ERP for drugstores; and LIS Bio-Diagnosis for microbiological laboratories. The company also provides MegaTron DEVA for water supply/sewerage companies; PSIS Financial Management for public sector companies; PSIS Payroll & Personnel Management for legal entities; and SIS Secretariats of Educational Institutions for educational institutions. In addition, it provides software support services, such as telephone support, remote support, on-site support, and feedback support services; project design and implementation; and software training services. The company was founded in 1992 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Technical & System Software",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "SHOPN.MX": {
        "short_name": "SHOPIFY INC",
        "long_name": "Shopify Inc.",
        "summary": "Shopify Inc., a commerce company, provides a cloud-based multi-channel commerce platform for small and medium-sized businesses in Canada, the United States, the United Kingdom, Australia, and internationally. Its platform provides merchants with a single view of business and customers in various sales channels, including Web and mobile storefronts, physical retail locations, social media storefronts, and marketplaces; and enables to manage products and inventory, process orders and payments, fulfill and ship orders, build customer relationships, source products, leverage analytics and reporting, and access financing. The company was formerly known as Jaded Pixel Technologies Inc. and changed its name to Shopify Inc. in November 2011. Shopify Inc. was founded in 2004 and is headquartered in Ottawa, Canada.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Technical & System Software",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Canada",
        "city": "Ottawa"
    }
}