{"BTAN.MX": {"short_name": "BT GROUP", "long_name": "BT Group plc", "summary": "BT Group plc provides communications products and services in the United Kingdom, Europe, the Middle East, Africa, the Americas, the Asia Pacific, and internationally. It operates through Consumer, Enterprise, Global, and Openreach segments. The Consumer segment offers mobile, broadband, home phone, and TV services under the BT, EE and Plusnet brands. The Enterprise segment sells communications and IT services to businesses and public sector organizations; and provides network products and services to communications providers. Its services include fixed voice, mobile, fixed connectivity, and IT services. The Global segment offers connectivity, communications, and IT services to multinational corporations. Its services include voice and data network, managed, security and network, and IT infrastructure services The Openreach segment builds and sells access to the network that connects the homes and businesses. It provides wholesale Â\u0091last mile' fixed access from homes and businesses to exchanges; and installs and maintains fiber and copper communications networks. The company was formerly known as Newgate Telecommunications Limited and changed its name to BT Group plc in September 2001. BT Group plc was incorporated in 2001 and is headquartered in London, the United Kingdom.", "currency": "MXN", "sector": "Technology", "industry": "Wireless Communications", "exchange": "MEX", "market": "mx_market", "country": "United Kingdom", "city": "London"}, "DTEN.MX": {"short_name": "DEUTSCHE TELEKOM AG", "long_name": "Deutsche Telekom AG", "summary": "Deutsche Telekom AG, together with its subsidiaries, provides integrated telecommunication services worldwide. The company operates through five segments: Germany, United States, Europe, Systems Solutions, and Group Development. It offers fixed-network services, including voice and data communication services based on fixed-network and broadband technology; and sells terminal equipment and other hardware products, as well as services to resellers. The company also provides mobile voice and data services to consumers and business customers; sells mobile devices and other hardware products; and sells mobile services to resellers and to companies that purchases and markets network services to third parties, such as mobile virtual network operators. In addition, it offers Internet services; Internet-based TV products and services; and information and communication technology systems for multinational corporations and public sector institutions with an infrastructure of data centers and networks under the T-Systems brand, as well as call center services. The company has 184 million mobile customers and 21 million broadband customers, as well as 28 million fixed-network lines. Deutsche Telekom AG has a collaboration with VMware, Inc. on cloud-based open and intelligent virtual RAN platform to bring agility to radio access networks for existing LTE and future 5G networks; and partnership with Microsoft to deliver high-performance cloud computing experiences. The company was founded in 1995 and is headquartered in Bonn, Germany.", "currency": "MXN", "sector": "Technology", "industry": "Wireless Communications", "exchange": "MEX", "market": "mx_market", "country": "Germany", "city": "Bonn"}, "FORTH.AT": {"short_name": "FORTHNET S.A.", "long_name": "Hellenic Company for Telecommunications and Telematic Applications S.A.", "summary": "Hellenic Company for Telecommunications and Telematic Applications S.A., together with its subsidiaries, provides telecommunications and pay-TV services to small and medium-sized enterprises, and private consumers in Greece. It offers Internet services, such as Internet access, Internet leased lines, data connectivity services, LMDS, etc., as well as fixed telephony and data services. The company also provides digital radio-television and/or audiovisual services; owns and broadcasts the Novasports channels; and offers content acquisition and customer support services, as well as provides satellite services. Hellenic Company for Telecommunications and Telematic Applications S.A. was incorporated in 1995 and is headquartered in Pallini, Greece.", "currency": "EUR", "sector": "Technology", "industry": "Wireless Communications", "exchange": "ATH", "market": "gr_market", "country": "Greece", "city": "Pallini"}, "HTO.AT": {"short_name": "HELLENIC TELECOM. ORG. (CR)", "long_name": "Hellenic Telecommunications Organization S.A.", "summary": "Hellenic Telecommunications Organization S.A., together with its subsidiaries, provides telecommunications and related services to businesses and individuals primarily in Greece and Romania. It operates through OTE, COSMOTE Group, TELEKOM ROMANIA, and Other segments. The company offers fixed-line, Internet access, and ICT services; and international carrier and TV production services. It also provides mobile and satellite telecommunication, electronic money, e-commerce, financing, consultancy and security, real estate, insurance brokerage, training, wholesale telephony, retail, marketing, overdue accounts management, wholesale broadband, and infrastructure services. The company was founded in 1949 and is based in Athens, Greece.", "currency": "EUR", "sector": "Technology", "industry": "Wireless Communications", "exchange": "ATH", "market": "gr_market", "country": "Greece", "city": "Athens"}, "TKCN.MX": {"short_name": "TURKCELL ILETISIM HIZMET", "long_name": "Turkcell Iletisim Hizmetleri A.S.", "summary": "Turkcell Iletisim Hizmetleri A.S. provides digital services in Turkey, Ukraine, Belarus, Azerbaijan, Cyprus, Germany, and the Netherlands. It operates in two segments, Turkcell Turkey and Turkcell International. It offers voice services, such as mobile communication and fixed voice for consumers and corporate customers; and broadband services, including mobile broadband, fiber to the home/building and ADSL Docsis, cable, LTE, and fixed wireless broadband. The company also provides BiP, an integrated IP-based communication platform; TV+, which enables subscribers to watch live television channels and on-demand video content; fizy, a digital music platform; Lifebox, a cloud service for data storage; Dergilik, a digital publishing platform; Yaani, a search engine application; Digital Operator, an application for its customers to track their bills and usage, change their account settings, and make transactions and purchases; Goals on Your Mobile that allows update on game scores and player transfers; Turkcell Academy that provides digital learning contents and services; UpCall, a call management service; Kopilot that connects cars to smartphones and enables real-time monitoring of metrics on the vehicle's performance; and Supercam, which ensures the safety of the home and workplace. In addition, it offers digital business services and solutions, such as digital business infrastructure, digital business applications, managed services, cloud, IoT products and solution management, big data and analytics services, business insights and analytics, location based services, hospital information systems, and techfin services. Further, the company provides international roaming, and wholesale voice and data services. As of December 31, 2019, it had 12.4 million prepaid subscribers and 20.4 million postpaid subscribers. The company was founded in 1993 and is based in Istanbul, Turkey.", "currency": "MXN", "sector": "Technology", "industry": "Wireless Communications", "exchange": "MEX", "market": "mx_market", "country": "Turkey", "city": "Istanbul"}, "TMUS.MX": {"short_name": "T-MOBILE US INC", "long_name": "T-Mobile US, Inc.", "summary": "T-Mobile US, Inc., through its subsidiaries, provides wireless services for branded postpaid and prepaid, and wholesale customers in the United States, Puerto Rico, and the United States Virgin Islands. The company offers voice, messaging, and data services. It also provides wireless devices, including smartphones, wearables, tablets, and other mobile communication devices, as well as accessories; and wirelines services. The company offers its services under the T-Mobile, Metro by T-Mobile, and Sprint brands. The company was founded in 1994 and is headquartered in Bellevue, Washington.", "currency": "MXN", "sector": "Technology", "industry": "Wireless Communications", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Bellevue"}, "UNLA": {"short_name": "UNILAVA CORPORATION", "long_name": "Unilava Corporation", "summary": "Unilava Corporation provides various communications services, products, and equipment to small and medium sized enterprise businesses and consumers worldwide. Its Wireline segment offers retail and resell communication services comprising local, long-distance, and other services; and integrated voice and data services. This segment's long distance services comprise traditional and international long distance, calling card, and conference calling services, as well as wholesale switched access services to other service providers. Its data services include switched and dedicated transport, Internet access and network integration, data equipment sales, and U-verse services; high-speed connections, such as private lines, packet, dedicated Internet, and enterprise networking services; DSL/broadband, dial-up Internet access, and Wi-Fi services; and businesses voice applications over IP-based networks. The company's Wireless segment provides wireless voice communications services; sells wireless equipment comprising handsets and personal computer wireless data cards through online stores, agents, or third-party retail stores; and sells accessories, such as carrying cases, hands-free devices, batteries, battery chargers, and other items to consumers, as well as to agents and other third-party distributors for resale. Its Advertising Solutions segment sells Yellow Pages online Internet-based directory advertising and local search. This segment operates Counia.com, a coupon Website for savings and values; and Local114.co.kr that provides yellow pages and business services, such as Website development, Internet advertising, and other value-added services. The company's Other segment offers roadside assistance and operator services. Unilava Corporation provides its services under the Telava, Countryconnect, Telava Mobile, Local Area Yellow Pages, Telava Wireless, Counia, and Nationwide Roadside Assistance brand names. The company is headquartered in San Francisco, California.", "currency": "USD", "sector": "Technology", "industry": "Wireless Communications", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "San Francisco"}}