{
    "2050.SR": {
        "short_name": "SAVOLA Group",
        "long_name": "Savola Group Company",
        "summary": "Savola Group Company, through its subsidiaries, manufactures and distributes food products in the Middle East, North Africa, and Turkey region. The company operates through five segments: Food Processing, Retail, Food Services, Frozen Foods, and Investments. It offers edible oils, vegetable oils, sugar, pasta, bakery products, specialty fats, seafood, confectionery, and frozen food products. The company also engages in the agro cultivation, services and maintenance, trading and distribution, and real estate related investment activities. In addition, it retails groceries through a chain of hypermarkets, supermarkets, and convenience stores. The company was founded in 1979 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "23511-7333",
        "website": "http://www.savola.com",
        "market_cap": 22737000448
    },
    "2100.SR": {
        "short_name": "Wafrah for Industry and Develop",
        "long_name": "Wafrah for Industry and Development Company",
        "summary": "Wafrah for Industry and Development Company engages in manufacturing, canning, preserving, processing, and marketing food products in Saudi Arabia and internationally. It provides pasta products, potato chips, frozen French fries products, peanut products, and breakfast cereals, as well as frozen, chilled, and cooked meat products. The company markets its products under the Wafra, Caprini, Saudi Garden, and Nemah brands. It is also involved in the treatment and processing of agricultural products; and investment in land property. The company was formerly known as Food Products Company and changed its name to Wafrah for Industry and Development Company in 2014. Wafrah for Industry and Development Company was founded in 1989 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11383",
        "website": "http://www.wafrah.com",
        "market_cap": 1336591360
    },
    "2270.SR": {
        "short_name": "Saudia Dairy and Foodstuff Co.",
        "long_name": "Saudia Dairy & Foodstuff Company",
        "summary": "Saudia Dairy & Foodstuff Company engages in the production and distribution of dairy products, beverages, and various foodstuffs in the Kingdom of Saudi Arabia, Poland, and other Gulf and Arab countries. It operates through Drinks and NonÂ\u0096Drinks segments. The company offers milk and milk powder, soy drinks, laban, evaporated milk, cheese, cream, fruit drinks, ice cream, butter, tomato products, French fries, and snacks. It provides its products under the Saudia, Crispy, Majestique, and Baboo brands. The company was founded in 1976 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21422",
        "website": "http://www.sadafco.com",
        "market_cap": 5887963136
    },
    "2280.SR": {
        "short_name": "Almarai Co.",
        "long_name": "Almarai Company",
        "summary": "Almarai Company, together with its subsidiaries, operates as an integrated consumer food and beverage company in Saudi Arabia, Egypt, Jordan, and rest of Gulf Cooperation Council countries. The company operates through Dairy and Juice, Bakery, Poultry, and Other Activities segments. It offers dairy, fruit juice, and related food products under the Almarai, Joosy Life, Beyti, and Teeba brand names; bakery products under the L'usine and 7 Days brand names; and poultry products under the Alyoum and AlBashayer brand names. The company also engages in the arable and horticulture activities; and provision of infant nutrition products under the Nuralac and Evolac brand names. Almarai Company was founded in 1977 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11492",
        "website": "http://www.almarai.com",
        "market_cap": 62124437504
    },
    "4061.SR": {
        "short_name": "Anaam International Holding Gro",
        "long_name": "Anaam International Holding Group Company",
        "summary": "Anaam International Holding Group Company engages in food, agriculture, and estate development businesses in Saudi Arabia. The company imports, distributes, and sells frozen food products, including chicken, mutton, fish, potatoes, vegetables, fruits, and other products. It also produces grain and fodder products, such as alfalfa, corn, wheat, fruits and vegetables, tomatoes, potatoes, onions, and other products, as well as owns agricultural land with an area of 100,000,000 square meters in the fertile agricultural Albesitae northern Saudi Arabia. In addition, the company manages and leases cold and dry storage facilities; builds, manages, and maintains commercial centers; and builds, manages, and operates industrial projects. Further, it undertakes contracts to build residential complexes, commercial centers, economic cities, and industrial properties; constructs, sells, and leases buildings; leases construction machinery and equipment; and undertakes finishing works in construction, as well as provides construction maintenance, and construction materials wholesale and retail services. Anaam International Holding Group Company was founded in 1980 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11555",
        "website": "http://www.anaamgroup.com",
        "market_cap": 1098300032
    },
    "4161.SR": {
        "short_name": "BinDawood Holding Co.",
        "long_name": "Bin Dawood Holding Company",
        "summary": "Bin Dawood Holding Company engages in retail trading of foodstuff and household items. The company is also involved in the wholesale of bakery and related products to commercial supermarkets. It operates 74 hypermarkets and supermarkets under the BinDawood and Danube brands in the Kingdom of Saudi Arabia. The company was founded in 1984 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21530",
        "website": "http://www.bindawoodholding.com",
        "market_cap": 13030200320
    },
    "4290.SR": {
        "short_name": "Alkhaleej Training and Educatio",
        "long_name": "Al Khaleej Training and Education Company",
        "summary": "Al Khaleej Training and Education Company engages in the computer, language, education projects, financial and management training, communication centers, and schools businesses in the Kingdom of Saudi Arabia. The company's Computer segment offers advanced programming, networking, and computer solutions to individuals and corporates. Its Language segment provides training courses in English language. The company's Education Projects segment offers educational projects to universities and the Ministry of Education, as well as operates orientation years for Saudi universities. Its Financial and Management Training segment provides management, leadership, stock trading, and other courses. The company's Communication Centers segment provides management and operating services for customer service centers through telephone for companies and bodies. Its School segment operates private educational schools for boys/girls. The company also offers training solutions for women hairdressers, beauty salons staff, students, cosmetic consultants, nutritionists, and fitness specialists through Formul'A Academy. In addition, the company provides lifeboat and fast rescue boat training, as well as management training solutions through New Dimension center. Further, it offers manpower and human resources to call centers and customer care services. Additionally, the company is involved in the establishment and construction of schools and cafeterias; installation of networks; provision of infrastructures, communication systems, operation and maintenance, and computer software, as well as online training and technical support services. It also provides franchise rights to various brands. Al Khaleej Training and Education Company was founded in 1993 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11451",
        "website": "http://www.alkhaleej.com.sa",
        "market_cap": 1322999936
    },
    "4292.SR": {
        "short_name": "Ataa Educational Co.",
        "long_name": "Ataa Educational Company",
        "summary": "Ataa Educational Company, an education company, engages in the establishment of kindergarten, primary, middle, and secondary schools for boys and girls in the Kingdom of Saudi Arabia. The company operates through Private Schools, International Schools, Indian Schools, and French Schools segments. It is also involved in the establishment, management, and operation and maintenance of computer training centers. Ataa Educational Company was founded in 1992 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11652",
        "website": "http://www.ataa.sa",
        "market_cap": 1992000000
    },
    "6001.SR": {
        "short_name": "Halwani Bros. Co.",
        "long_name": "Halwani Bros. Co. Ltd.",
        "summary": "Halwani Bros. Co. Ltd. produces, manufactures, and distributes food products in the Kingdom of Saudi Arabia. It offers Middle Eastern food products, such as sweets; meat products; breaded chicken and burgers; jams; dairy products; cheese; juices; provisions, such as olive oil, olives, peppers, and pickles; bakery products stuffed with dates, and packaging products. The company was founded in 1950 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21421",
        "website": "http://www.halwani.com.sa",
        "market_cap": 3475602944
    },
    "6020.SR": {
        "short_name": "Al Gassim Investment  Holding C",
        "long_name": "Al Gassim Investment Holding Company",
        "summary": "Al Gassim Investment Holding Company invests in agriculture business in the Kingdom of Saudi Arabia. It engages in the manufacturing and selling of agricultural products; and import of seeds. The company was formerly known as Qassim Agriculture Company and changed its name to Al Gassim Investment Holding Co. in January 2017. Al Gassim Investment Holding Co. was founded in 1984 and is based in Jaradat al Buraykah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jaradat al Buraykah",
        "zipcode": "51451",
        "website": "http://www.gih.sa",
        "market_cap": 964500032
    },
    "6040.SR": {
        "short_name": "Tabuk Agriculture Development C",
        "long_name": "Tabuk Agricultural Development Company",
        "summary": "Tabuk Agricultural Development Company produces and sells agricultural products in Saudi Arabia. It offers fruits; vegetables; alfalfa and wheat; and olive oil. The company also engages in the management and leasing of owned or leased properties. It sells its products under the TADCO brand. Tabuk Agricultural Development Company was founded in 1983 and is headquartered in Tabuk, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Tabuk",
        "zipcode": "71421",
        "website": "http://www.tadco-agri.com",
        "market_cap": 1389329920
    },
    "6050.SR": {
        "short_name": "Saudi Fisheris Co.",
        "long_name": "Saudi Fisheries Company",
        "summary": "Saudi Fisheries Company engages in fishing, fish-farming, and marketing activities in the Kingdom of Saudi Arabia. The company's seafood products include hareed, hamour baloul, zubaidi, shaour emperor, andak red sea bream, dennis seabream, qarous sea bass, hamor seaman, and nagel fish, as well as crab, peeled shrimp, lobster, squid, and salmon and knad steaks. It also offers meal products, including salmon grilled with rice, sweet sour shrimp with rice, tempura fish, fried prawns with potatoes, daqoos, flour, thome, green salad, spiced eggplant, rabban timbora, his sanctity, and chickpeas, as well as frozen shrimp. In addition, the company is involved in the operation of fish and shrimp farms; ice production and storage facilities; and operation and management of seafood restaurants. In addition, it engages in the sorting, cleaning, and chopping of fish, as well as preservation, cooking, and packing; and provision of logistic services, which include procurement, transportation, and warehouse of products. The company was founded in 1980 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "12641",
        "website": "http://www.alasmak.com.sa",
        "market_cap": 2436000000
    },
    "6090.SR": {
        "short_name": "Jazan Energy and Development Co",
        "long_name": "Jazan Energy and Development Company",
        "summary": "Jazan Energy and Development Company, together with its subsidiaries, engages in the fisheries, agricultural, industrial, and real estate businesses in Saudi Arabia. The company is involved in the cultivation of mangoes and shrimps; preservation of fish and fish products; cooling and freezing of fruits; production and packaging and distributing of pure filtered water; operates hotels; and other activities. It engages in the buying, selling, and renting of land and real estate properties. Jazan Energy and Development Company was incorporated in 1993 and is headquartered in Jazan, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jazan",
        "zipcode": null,
        "website": "http://www.jazadco.com.sa",
        "market_cap": 1200000000
    }
}