{"4290.SR": {"short_name": "Alkhaleej Training and Educatio", "long_name": "Al Khaleej Training and Education Company", "summary": "Al Khaleej Training and Education Company engages in the computer, language, education projects, financial and management training, communication centers, and schools businesses in the Kingdom of Saudi Arabia. The company's Computer segment offers advanced programming, networking, and computer solutions to individuals and corporates. Its Language segment provides training courses in English language. The company's Education Projects segment offers educational projects to universities and the Ministry of Education, as well as operates orientation years for Saudi universities. Its Financial and Management Training segment provides management, leadership, stock trading, and other courses. The company's Communication Centers segment provides management and operating services for customer service centers through telephone for companies and bodies. Its School segment operates private educational schools for boys/girls. The company also offers training solutions for women hairdressers, beauty salons staff, students, cosmetic consultants, nutritionists, and fitness specialists through Formul'A Academy. In addition, the company provides lifeboat and fast rescue boat training, as well as management training solutions through New Dimension center. Further, it offers manpower and human resources to call centers and customer care services. Additionally, the company is involved in the establishment and construction of schools and cafeterias; installation of networks; provision of infrastructures, communication systems, operation and maintenance, and computer software, as well as online training and technical support services. It also provides franchise rights to various brands. Al Khaleej Training and Education Company was founded in 1993 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.", "currency": "SAR", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "SAU", "market": "sr_market", "country": "Saudi Arabia", "city": "Riyadh"}, "4292.SR": {"short_name": "Ataa Educational Co.", "long_name": "Ataa Educational Company", "summary": "Ataa Educational Company, an education company, engages in the establishment of kindergarten, primary, middle, and secondary schools for boys and girls in the Kingdom of Saudi Arabia. The company operates through Private Schools, International Schools, Indian Schools, and French Schools segments. It is also involved in the establishment, management, and operation and maintenance of computer training centers. Ataa Educational Company was founded in 1992 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.", "currency": "SAR", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "SAU", "market": "sr_market", "country": "Saudi Arabia", "city": "Riyadh"}}