{"6020.SR": {"short_name": "Al Gassim Investment  Holding C", "long_name": "Al Gassim Investment Holding Co.", "summary": "Al Gassim Investment Holding Co. invests in agriculture business. It engages in manufacturing, packaging, and marketing of agricultural and food products. The company also invests in stocks and other securities; general contracting; food and non-food items; import and export, and other business; and industrial, education, health, and transport sectors. In addition, it offers refrigeration units and transportation services; and invests in real estate sector for planning, developing, buying, and selling of land, commercial, and residential complexes, as well as hotels. The company was formerly known as Qassim Agriculture Company and changed its name to Al Gassim Investment Holding Co. in January 2017. Al Gassim Investment Holding Co. was founded in 1985 and is based in Buraydah, the Kingdom of Saudi Arabia.", "currency": "SAR", "sector": "Consumer Defensive", "industry": "Farm Products", "exchange": "SAU", "market": "sr_market", "country": "Saudi Arabia", "city": "Buraydah"}, "6040.SR": {"short_name": "Tabuk Agriculture Development C", "long_name": "Tabuk Agricultural Development Company", "summary": "Tabuk Agricultural Development Company produces and sells agricultural products in Saudi Arabia. It offers vegetables, such as potatoes and onions; fruits, including apricots, figs, grapes, nectarines, peaches, pears, and plums; wheat grains and seeds; alfalfa and forage; and olive oil. The company also provides consultancy services for water resource management. In addition, it exports onions. The company holds an area of approximately 35,000 hectares. It sells its products under the TADCO brand. Tabuk Agricultural Development Company was founded in 1983 and is headquartered in Tabuk, Saudi Arabia.", "currency": "SAR", "sector": "Consumer Defensive", "industry": "Farm Products", "exchange": "SAU", "market": "sr_market", "country": "Saudi Arabia", "city": "Tabuk"}, "6060.SR": {"short_name": "Ash-Sharqiyah Development Co.", "long_name": "Ash-Sharqiyah Development Co.", "summary": "Eastern Development Company engages in the agricultural business in Saudi Arabia and internationally. The company produces agricultural products, including maize, clover, fodder, Rhodes grass, wheat and corn hay, and dates. It is also involved in the animal husbandry activities, including the production of fresh milk, calf breeding, calves fattening, sheep production, and bio-fertilizer and honey production. In addition, the company rents farming land; undertakes the land reclamation and irrigation projects; and imports grains and animal fodder, as well as imports and manufactures agriculture equipment. Eastern Development Company was founded in 1986 and is based in Dammam, Saudi Arabia.", "currency": "SAR", "sector": "Consumer Defensive", "industry": "Farm Products", "exchange": "SAU", "market": "sr_market", "country": "Saudi Arabia", "city": "Dammam"}, "6070.SR": {"short_name": "Al-Jouf Agriculture Development", "long_name": "Al-Jouf Agricultural Development Co.", "summary": "Al-Jouf Agricultural Development Co. produces and sells agricultural products in Saudi Arabia. Its products include wheat, barley, maize, fodder crops, potatoes, onion, and olive; fruits, such as peaches, apricots, plums, pears, and grapes; and vegetables consisting of tomatoes, peppers, squashes, cucumbers, and eggplants. The company also operates nurseries to produce seedlings of fruits and olive trees; and serves as a consultant in the agricultural production activities. Al-Jouf Agricultural Development Co. was founded in 1988 and is based in Sakakah, Saudi Arabia.", "currency": "SAR", "sector": "Consumer Defensive", "industry": "Farm Products", "exchange": "SAU", "market": "sr_market", "country": "Saudi Arabia", "city": "Sakakah"}, "6090.SR": {"short_name": "Jazan Energy and Development Co", "long_name": "Jazan Energy and Development Co.", "summary": "Jazan Energy and Development Co. engages in the fisheries, agricultural, industrial, and real estate businesses in Saudi Arabia. The company is involved in the establishment of agricultural and livestock projects; rearing and fattening of sheep and calves; production of chickens; fishing activities; establishment of nurseries; and production of fruit seedlings, forest and ornamental trees, and medicinal and aromatic plants. It also engages in the manufacturing and marketing of agricultural, animal, plant, and fish products and their derivatives; wholesale and retail trade of materials, machineries, and agricultural inputs; establishment, development, maintenance, rental, lease, and sale of real estate properties; and general contracting activities. In addition, the company is involved in the establishment, management, maintenance, and operation of industrial projects; and wholesale and retail trade of food, industrial tools, building materials, electrical appliances and tools, and mechanical and electronic apparatus. Further, it engages in the construction, repair, demolition, and restoration of public and residential buildings, commercial buildings, educational and health facilities, airports, and ports; undertaking works of roads and pavements, lighting works, extensions of telephone, water and sanitation, infrastructure, maintenance, and cleanliness; planting gardens and parks; and producing packaged drinking water. Additionally, the company engages in well drilling activities, as well as provides access to commercial agencies. Jazan Energy and Development Co. was founded in 1993 and is headquartered in Jazan, Saudi Arabia.", "currency": "SAR", "sector": "Consumer Defensive", "industry": "Farm Products", "exchange": "SAU", "market": "sr_market", "country": "Saudi Arabia", "city": "Jazan"}}