{"ICTSF": {"short_name": "ICTS INTERNATIONAL NV", "long_name": "ICTS International N.V.", "summary": "ICTS International N.V., together with its subsidiaries, provides airport security and other aviation services in the Netherlands, Germany, the United States, and internationally. It operates through Airport Security and Other Aviation Services; and Authentication Technology segments. The company offers security consulting and security handling services, including security screening, checkpoint screening, cargo screening, hold baggage screening, X-ray operator training, and integrated services, as well as passengers security screening and cargo security services; various aviation security training programs and seminars; and aviation security consulting services in the areas of risk analysis, security concept development, security system design, implementation and assimilation, and security surveys and audits. Its security and other services also comprise limited security services, including charter flight screening for airlines, cargo and aircraft security screening, and aircraft search to detect dangerous objects; and non-security services, such as agent services, guard services, queue monitors assisting passengers before the checkpoint, aircraft cleaning, janitorial, skycap passengers luggage, wheelchair attendant, and baggage handling services, as well as shuttle services to airline crews. The company also develops and sells authentication security software to financial and other institutions; New Advanced Passenger Screening, a IT-system that enables pre-departure analysis of passenger information; I-Check document scan stand and tablet application; security airport realtime application, a tool that provides the missing link between HR and the operational daily business of running a security operation; realtime operational management; and front-end and back office identity document authentication management systems and onboarding automation service. ICTS International N.V. was founded in 1982 and is based in Schiphol-Oost, the Netherlands.", "currency": "USD", "sector": "Industrials", "industry": "Security & Protection Services", "exchange": "PNK", "market": "us_market", "country": "Netherlands", "city": "Schiphol"}}