{
    "5MD.SI": {
        "short_name": "$ Soon Lian",
        "long_name": "Soon Lian Holdings Limited",
        "summary": "Soon Lian Holdings Limited, an investment holding company, operates as a specialist supplier of aluminum alloy products in Singapore, Malaysia, Taiwan, Indonesia, China, and internationally. The company operates through Precision Engineering, Marine, Stockists and Traders, and Other Customers segments. It offers aluminum plates and sheets, rods and bars, extrusions, and special and other metal products. The company supplies its aluminum alloy products for use in shipbuilding-hulls, decks, superstructures, and cabins of catamarans, pleasure crafts, and patrol boats, as well as in crew and rescue boats in offshore oil and gas industry; and precision parts for electronic equipment, precision instruments, medical instrumentation, semiconductor equipment, automated assembly lines, pharmaceutical machinery, and robotics. Its products are also used in aircraft industries, oil tankers, automotive parts, rail coaches, truck frames, and bridges and towers. The company was founded in 1983 and is headquartered in Singapore. Soon Lian Holdings Limited is a subsidiary of Soon Tien Holdings Pte. Ltd.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "638615",
        "website": "http://slmetalsgroup.com",
        "market_cap": "Nano Cap"
    },
    "5SN.F": {
        "short_name": "SOON LIAN HLDGS LTD",
        "long_name": "Soon Lian Holdings Limited",
        "summary": "Soon Lian Holdings Limited, an investment holding company, operates as a specialist supplier of aluminum alloy products in Singapore, Malaysia, Taiwan, Indonesia, China, and internationally. The company operates through Precision Engineering, Marine, Stockists and Traders, and Other Customers segments. It offers aluminum plates and sheets, rods and bars, extrusions, and special and other metal products. The company supplies its aluminum alloy products for use in shipbuilding-hulls, decks, superstructures, and cabins of catamarans, pleasure crafts, and patrol boats, as well as in crew and rescue boats in offshore oil and gas industry; and precision parts for electronic equipment, precision instruments, medical instrumentation, semiconductor equipment, automated assembly lines, pharmaceutical machinery, and robotics. Its products are also used in aircraft industries, oil tankers, automotive parts, rail coaches, truck frames, and bridges and towers. The company was founded in 1983 and is headquartered in Singapore. Soon Lian Holdings Limited is a subsidiary of Soon Tien Holdings Pte. Ltd.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "638615",
        "website": "http://slmetalsgroup.com",
        "market_cap": "Nano Cap"
    },
    "AWG.SI": {
        "short_name": "AEI^",
        "long_name": "AEI Corporation Ltd.",
        "summary": "AEI Corporation Ltd., an investment holding company, manufactures and sells aluminum extrusion products and precision metal components in Singapore, Greater China, Malaysia, and internationally. It operates through Electronics and Precision Engineering, and Construction and Infrastructure Building segments. The Electronics and Precision Engineering segment offers precision aluminum extrusions that form components of products of the high-tech electronics and precision engineering industries. This segment's products are used in electronics and precision engineering components, bio-medical equipment and products, and clean room equipment and structures, as well as in industrial machinery, including machine frames, machinery components, linear tables, and actuators; and technology products for the defense and aerospace industries. The Construction and Infrastructure Building segment offers public infrastructure, building construction, interior fixtures, signages, and advertising panels to the construction, civil engineering, and infrastructure building industries. The company also engages in the manufacture of basic ferrous and non-ferrous metals, and engineering components; and wholesale of scrap, junk, and waste products. AEI Corporation Ltd. was founded in 1983 and is based in Singapore. AEI Corporation Ltd. is a subsidiary of OCBC Securities Private Limited.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "636936",
        "website": "http://www.aei.com.sg",
        "market_cap": "Micro Cap"
    }
}