{
    "541.SI": {
        "short_name": "$ Abundance Intl",
        "long_name": "Abundance International Limited",
        "summary": "Abundance International Limited, together with its subsidiaries, engages in the trading of chemical products. It operates through Chemicals, Printing related, and Investment segments. The company offers commodity and specialty chemicals primarily for industrial applications, as well as provides water treatment solutions using microbial and/or chemicals. It also produces books, calendars, and other publications. In addition, the company invests in equity, securities, and other instruments, such as bonds or convertible bonds; and quoted securities and instruments, such as funds and bonds. It operates in the People's Republic of China, Taiwan, Indonesia, Singapore, other countries in Asia, and internationally. The company was formerly known as Craft Print International Limited and changed its name to Abundance International Limited in August 2015. Abundance International Limited was incorporated in 1975 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "629041",
        "website": "http://www.abundance.com.sg",
        "market_cap": 35887320
    },
    "5VJ.SI": {
        "short_name": "Halcyon Agri",
        "long_name": "Halcyon Agri Corporation Limited",
        "summary": "Halcyon Agri Corporation Limited, an investment holding company, originates, produces, and distributes natural rubber products in Singapore, China, the United States, Canada, Europe, rest of Asia, and internationally. It operates through Corrie MacColl Group; HRC Group; SINRIO Group; and Corporate segments. The company processes and produces technically specified rubber, crumb rubber, and latex, as well as constant viscosity rubber products; and owns rubber plantations approximately 110,000 hectares of land in Malaysia and Cameroon. It provides its natural rubber primarily under the HeveaPRO brand, as well as procures other origins and grades of rubber from third party producers. The company offers its products for use in tires, shoe soles, medical gloves, seals, gaskets, and others through a network of logistical assets and sales offices. It is also involved in trading and distribution of natural rubber, latex, and synthetic rubber under the Centrotrade, Wurfbain, Corrie MacColl, Alan L. Grant, Momentum Technologies, and Kelvin Terminals brand names; and manufactures and distributes plastic products, as well as operates oil palm plantations. The company was founded in 1934 and is headquartered in Singapore. As of December 31, 2018, Halcyon Agri Corporation Limited operates as a subsidiary of Sinochem International (Overseas) Pte. Ltd.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "239922",
        "website": "http://www.halcyonagri.com",
        "market_cap": 406727552
    },
    "C05.SI": {
        "short_name": "Chemical Ind",
        "long_name": "Chemical Industries (Far East) Limited",
        "summary": "Chemical Industries (Far East) Limited, an investment holding company, manufactures and sells chemicals primarily in Singapore and Myanmar. It operates through two segments, Industrial Chemicals and Properties. The company offers basic chemicals, such as chlorine, caustic soda, sodium hypochlorite, and hydrochloric acid, as well as hydrogen to the petro-chemical, pharmaceutical, electronics, polycarbonate, and water-treatment industries. It also manages and rents commercial properties. In addition, the company operates as a general carrier; and general merchant, importer, and exporter of chemicals. Further, it is involved in the treatment and disposal of waste, including remediation activities; and manufacture of water treatment, waste treatment, and oilfield chemicals. The company was founded in 1962 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "629127",
        "website": "http://www.cil.sg",
        "market_cap": 56199596
    },
    "C8R.SI": {
        "short_name": "$ Jiutian Chemical",
        "long_name": "Jiutian Chemical Group Limited",
        "summary": "Jiutian Chemical Group Limited, an investment holding company, manufactures and sells chemical-based products in the People's Republic of China. The company offers dimethylformamide (DMF), which is used as a feedstock in the production of polyurethane, pharmaceutical, and agro chemical products, as well as an absorbing agent primarily in electronics, acrylic fiber, and pharmaceutical products; and methylamine, a chemical feedstock in the organic chemical industry used in various areas, such as agricultural chemicals, medicines, fuels, synthetic resins, and leather making, as well as in the production of the solvent used for chemical fibers, activating agents, and photography. It also provides sodium hydrosulfite, a crystalline powder for use in water treatment, gas purification, cleaning, and stripping, as well as in the industrial processing of textiles, leather, foods, polymers, photography, and others; industrial and consumable carbon dioxide for use in aerated beverages, tobacco, and preserving vegetables; Oxygen-18, an isotope of oxygen to produce fluorodeoxyglucose; deuterium depleted water to inhibit cancer growth; and industrial methanol. In addition, the company is involved in the sale of downstream products; and research and development of isotope technology. Jiutian Chemical Group Limited was founded in 1994 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "238868",
        "website": null,
        "market_cap": 178959616
    },
    "HAT.SG": {
        "short_name": "Halcyon Agri Corporation Ltd. R",
        "long_name": "Halcyon Agri Corporation Limited",
        "summary": "Halcyon Agri Corporation Limited, an investment holding company, originates, produces, and distributes natural rubber products in Singapore, China, the United States, Canada, Europe, rest of Asia, and internationally. It operates through Corrie MacColl Group; HRC Group; SINRIO Group; and Corporate segments. The company processes and produces technically specified rubber, crumb rubber, and latex, as well as constant viscosity rubber products; and owns rubber plantations approximately 110,000 hectares of land in Malaysia and Cameroon. It provides its natural rubber primarily under the HeveaPRO brand, as well as procures other origins and grades of rubber from third party producers. The company offers its products for use in tires, shoe soles, medical gloves, seals, gaskets, and others through a network of logistical assets and sales offices. It is also involved in trading and distribution of natural rubber, latex, and synthetic rubber under the Centrotrade, Wurfbain, Corrie MacColl, Alan L. Grant, Momentum Technologies, and Kelvin Terminals brand names; and manufactures and distributes plastic products, as well as operates oil palm plantations. The company was founded in 1934 and is headquartered in Singapore. As of December 31, 2018, Halcyon Agri Corporation Limited operates as a subsidiary of Sinochem International (Overseas) Pte. Ltd.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "239922",
        "website": "http://www.halcyonagri.com",
        "market_cap": 245735088
    }
}