{
    "1A1.SI": {
        "short_name": "$ Wong Fong Ind",
        "long_name": "Wong Fong Industries Limited",
        "summary": "Wong Fong Industries Limited, an investment holding company, provides land transport engineering solutions and systems in Singapore, Malaysia, Myanmar, and the People's Republic of China. It operates through Engineering and Training segments. The company sells and installs load handling and waste management systems, as well as assistive technology and mobility aids. It offers truck-mounted cranes, tailgates, tippers, self-loaders, hookloaders, portable compactors, and sweeper vehicles. The company also operates service centers for truck-mounted cranes, hookloaders, and tailgates; and offers design, customization, fabrication, and integration services. In addition, its projects include customization of special purpose vehicles and solutions. Further, the company provides training services for industrial, construction, food hygiene, quality and service audit, consultancy, workplace safety, security, and food and beverage. Additionally, it distributes, rents, and markets heavy and construction machinery, including spare parts, accessories, and engineering works; and trades and installs mechanical handling equipment and truck mounted hydraulic speed loaders. The company also undertakes mechanical engineering works, and installs industry machinery and machinery component parts; offers business and management consultancy services, motivational courses, and provision of educational services and recruitment of personnel, as well as educational and consultancy services to schools, teachers, parents, and community. It serves construction, logistics, waste management, and defense industries. The company was founded in 1964 and is headquartered in Singapore. Wong Fong Industries Limited is a subsidiary of Wong Fong Investments Pte. Ltd.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "3YQA.SG": {
        "short_name": "Yongmao Holdings Ltd. Registere",
        "long_name": "Yongmao Holdings Limited",
        "summary": "Yongmao Holdings Limited, an investment holding company, designs, develops, manufactures, sells, rents, and services construction machineries, tower cranes, and tower crane related components and accessories. The company offers Topless STT, ST, Luffing STL, and Derrick Q series tower cranes with lifting capacities in the range of 80 to 3,300 tonne-metres under the Yongmao brand. It also maintains, installs, erects, and dismantles tower cranes. The company primarily serves construction sites, infrastructure projects, and shipbuilding industry; and construction equipment distributors and equipment rental companies. It operates in the People's Republic of China, Hong Kong, Macau, Singapore, other Asian countries, the Middle East, the United States, Europe, and internationally. The company was founded in 1992 and is based in Singapore. Yongmao Holdings Limited is a subsidiary of Sun & Tian Investment Pte. Ltd.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "BKA.SI": {
        "short_name": "Sin Heng Mach",
        "long_name": "Sin Heng Heavy Machinery Limited",
        "summary": "Sin Heng Heavy Machinery Limited, together with its subsidiaries, operates as a lifting service provider in Singapore, Indonesia, Myanmar, Malaysia, Vietnam, Brunei, Thailand, and internationally. It operates through Equipment Rental and Trading segments. The company rents crawler, all terrain, truck, rough terrain, and self-erecting cranes; and aerial lifts, including boom and scissor lifts, as well as provides turnkey project engineering services. It also trades in new and used cranes and aerial lifts; and sells and distributes spare parts for cranes and aerial lifts. In addition, the company provides facilities and custody services. It serves infrastructure and geotechnic, construction, civil engineering works, offshore and marine, and oil and gas industries. Sin Heng Heavy Machinery Limited was founded in 1969 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "BKX.SI": {
        "short_name": "Yongmao",
        "long_name": "Yongmao Holdings Limited",
        "summary": "Yongmao Holdings Limited, an investment holding company, designs, develops, manufactures, sells, rents, and services construction machineries, tower cranes, and tower crane related components and accessories. The company offers Topless STT, ST, Luffing STL, and Derrick Q series tower cranes with lifting capacities in the range of 80 to 3,300 tonne-metres under the Yongmao brand. It also maintains, installs, erects, and dismantles tower cranes. The company primarily serves construction sites, infrastructure projects, and shipbuilding industry; and construction equipment distributors and equipment rental companies. It operates in the People's Republic of China, Hong Kong, Macau, Singapore, other Asian countries, the Middle East, the United States, Europe, and internationally. The company was founded in 1992 and is based in Singapore. Yongmao Holdings Limited is a subsidiary of Sun & Tian Investment Pte. Ltd.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "SNVA.F": {
        "short_name": "SIN HENG HEAVY MACH.LTD",
        "long_name": "Sin Heng Heavy Machinery Limited",
        "summary": "Sin Heng Heavy Machinery Limited, together with its subsidiaries, operates as a lifting service provider in Singapore, Indonesia, Myanmar, Malaysia, Vietnam, Brunei, Thailand, and internationally. It operates through Equipment Rental and Trading segments. The company rents crawler, all terrain, truck, rough terrain, and self-erecting cranes; and aerial lifts, including boom and scissor lifts, as well as provides turnkey project engineering services. It also trades in new and used cranes and aerial lifts; and sells and distributes spare parts for cranes and aerial lifts. In addition, the company provides facilities and custody services. It serves infrastructure and geotechnic, construction, civil engineering works, offshore and marine, and oil and gas industries. Sin Heng Heavy Machinery Limited was founded in 1969 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    }
}