{
  "AWE.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Industrial Distribution",
    "long_name": "SP Corporation Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "SP Corp",
    "state": null,
    "summary": "SP Corporation Limited engages in the commodities trading business. The company distributes tyres; and trades in and markets various products, including coal, rubber, and metals, as well as other commodities and products that are used by manufacturers in the energy, tyre, metal, and automotive industries. It also markets and distributes consumer products, such as feminine napkins, baby diapers, diaper pants, baby wet wipes, and adult diapers; and provides in-house packaging for supermarkets. SP Corporation Limited operates in Singapore, China, Hong Kong, Indonesia, and internationally. The company was incorporated in 1952 and is headquartered in Singapore. SP Corporation Limited is a subsidiary of Tuan Sing Holdings Limited.",
    "website": "http://www.spcorp.com.sg",
    "zipcode": "589472"
  },
  "B9S.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Industrial Distribution",
    "long_name": "CosmoSteel Holdings Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "CosmoSteel^",
    "state": null,
    "summary": "CosmoSteel Holdings Limited, an investment holding company, engages in sourcing and distributing piping system components. It operates through Energy, Marine, Trading, and Others segments. The company provides steel pipes, fittings, and flanges; and structural and cable products, including structural beams, channels, sheets, plates, flats, and hollow sections. It also offers electrical products, such as switching and distribution systems, terminal and junction boxes and switches, light fittings, and isolators; and carbon, low temp carbon, stainless, duplex, super duplex, high yield, and low alloys steel. In addition, the company provides customization, validation, testing, expedited delivery, and project management services. It serves oil and gas, engineering and construction, petrochemical, power, shipbuilding and repair, manufacturing, pharmaceutical, and trading industries. The company primarily operates in Brunei, Europe, Indonesia, Japan, Malaysia, the Middle East, Singapore, Thailand, Vietnam, and internationally. CosmoSteel Holdings Limited was founded in 1984 and is headquartered in Singapore.",
    "website": "http://www.cosmosteel.com",
    "zipcode": "628633"
  },
  "BFU.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Industrial Distribution",
    "long_name": "Tye Soon Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "Tye Soon",
    "state": null,
    "summary": "Tye Soon Limited, together with its subsidiaries, imports and exports, and distributes automotive parts in Singapore, Malaysia, Australia, Thailand, South Korea, and internationally. It offers electrical and aircon parts, transmission products, chassis and body parts, engine parts, and brake parts, as well as genuine parts. The company is also involved in the trading of automotive spare parts. The company was founded in 1933 and is based in Singapore. Tye Soon Limited is a subsidiary of OBG & Sons Pte Ltd.",
    "website": "http://www.tyesoon.com",
    "zipcode": "608832"
  },
  "CMR.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Industrial Distribution",
    "long_name": "CosmoSteel Holdings Limited",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "COSMOSTEEL HLDGS LTD",
    "state": null,
    "summary": "CosmoSteel Holdings Limited, an investment holding company, engages in sourcing and distributing piping system components. It operates through Energy, Marine, Trading, and Others segments. The company provides steel pipes, fittings, and flanges; and structural and cable products, including structural beams, channels, sheets, plates, flats, and hollow sections. It also offers electrical products, such as switching and distribution systems, terminal and junction boxes and switches, light fittings, and isolators; and carbon, low temp carbon, stainless, duplex, super duplex, high yield, and low alloys steel. In addition, the company provides customization, validation, testing, expedited delivery, and project management services. It serves oil and gas, engineering and construction, petrochemical, power, shipbuilding and repair, manufacturing, pharmaceutical, and trading industries. The company primarily operates in Brunei, Europe, Indonesia, Japan, Malaysia, the Middle East, Singapore, Thailand, Vietnam, and internationally. CosmoSteel Holdings Limited was founded in 1984 and is headquartered in Singapore.",
    "website": "http://www.cosmosteel.com",
    "zipcode": "628633"
  },
  "I06.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Industrial Distribution",
    "long_name": "Intraco Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "Intraco",
    "state": null,
    "summary": "Intraco Limited, an investment holding company, engages in the trading of plastics products in Singapore, Vietnam, Indonesia, and internationally. The company operates through two segments, Fire Protection, and Trading and Others. It manufactures, sells, and installs passive fire protection products; and offers commercial wireless services. The company is also involved in the provision of radio coverage system management, operation, and mobile services; and supply of communications equipment to other service providers. In addition, it trades, markets, distributes, wholesales, imports, and export industrial materials, such as metals, plastics, petrochemicals and rubbers; trades, markets, and distributes energy commodities products, as well as act as an commission agent; and trades and processes agricultural and food products, including frozen seafood and fertilizers. The company was founded in 1968 and is based in Singapore.",
    "website": "http://www.intraco.com.sg",
    "zipcode": "189969"
  }
}
