{
    "5HH.SI": {
        "short_name": "$ Sinjia Land",
        "long_name": "Sinjia Land Limited",
        "summary": "Sinjia Land Limited, an investment holding company, operates and manages lodging and boarding houses, and backpackers hostels in Singapore, Thailand, and the United States. It also invests in fund management business. The company was formerly known as HLN Technologies Limited and changed its name to Sinjia Land Limited in April 2013. Sinjia Land Limited was founded in 1979 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "5I1.SI": {
        "short_name": "$ KOP",
        "long_name": "KOP Limited",
        "summary": "KOP Limited, an investment holding company, operates as a real estate development and entertainment company. It operates through Real Estate Development and Investment, Real Estate Origination and Management Services, Hospitality, and Entertainment segments. The company invests in, develops, constructs, manages, and sells real estate properties. It is also involved in the properties acquisition and development conceptualization, construction management, and marketing and branding strategizing activities, as well as retail sale of projects; and development, management, and operation of hotels and resorts, including restaurants and spas. In addition, the company sells goods and tickets; and assigns distribution rights, as well as engages in the sponsorship, theatrical distribution, and concert promotions activities. Further, it is involved in business and management consultancy services; property management and consultancy activities; ownership and lease of real estate properties; investment management and consultancy activities; and operation of cafes and coffee houses. The company has operations in Singapore, Indonesia, and the People's Republic of China. KOP Limited was incorporated in 2004 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "A34.SI": {
        "short_name": "Amara",
        "long_name": "Amara Holdings Limited",
        "summary": "Amara Holdings Limited, an investment holding company, engages in the hotel investment and management; property investment and development; and specialty restaurants and food services businesses in Singapore, the People's Republic of China, and Thailand. It invests in and develops office, retail, and residential properties. The company is also involved in the share trading and investment activities; and the provision of construction services, as well as in franchising business. In addition, it offers management and technical advisory services for the management and development of hotels and resorts; and general management and administrative services. The company was incorporated in 1970 and is based in Singapore. Amara Holdings Limited is a subsidiary of First Security Pte Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "AVX.SI": {
        "short_name": "HL Global Ent",
        "long_name": "HL Global Enterprises Limited",
        "summary": "HL Global Enterprises Limited, an investment holding company, operates in the hospitality operations and property development activities in Singapore, Malaysia, and the People's Republic of China. It operates in three segments: Investments and Others, Hospitality and Restaurant, and Property Development. The company operates and manages hotels and restaurants; and develops, sells, and rents properties. It also provides property and development project management, and hotel management and consultancy services. The company was formerly known as HLG Enterprise Limited and changed its name to HL Global Enterprises Limited in April 2008. HL Global Enterprises Limited was incorporated in 1961 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "B28.SI": {
        "short_name": "Bonvests",
        "long_name": "Bonvests Holdings Limited",
        "summary": "Bonvests Holdings Limited, an investment holding company, engages in the property development and investment, hotel ownership and management, and waste management and contract cleaning businesses. The company operates through Rental, Hotel, Industrial, Investment, and Others segments. It owns and manages various commercial and residential properties. The company also engages in the operation of the golf course, hotels and restaurants, bars, and thalassotherapy center; and investment, operation, and management of resorts, spas, and food and beverage outlets; and securities trading and investment holding activities. In addition, the company offers business and management, and public relations consultancy services; sales and marketing support; contract cleaning; laundry; and waste management services, such as waste disposal services to commercial, industrial, and residential properties, as well as other waste disposal related services. It operates in Singapore, Tunisia, Mauritius, Zanzibar, Maldives, Indonesia, Morocco, and Australia. Bonvests Holdings Limited was founded in 1982 and is based in Singapore. Bonvests Holdings Limited is a subsidiary of Goldvein Holdings Pte. Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "BDX.SI": {
        "short_name": "GSH",
        "long_name": "GSH Corporation Limited",
        "summary": "GSH Corporation Limited, an investment holding company, engages in the development and sale of properties primarily in Malaysia and China. It operates through Hospitality, Property, and Others segments. The company is also involved in the rental of investment properties. In addition, it owns and operates the Sutera Harbour Resort comprising two five-star hotels, a 104-berth marina, and a 27-hole championship golf course in Kota Kinabalu, Malaysia, as well as the idyllic Sutera@Mantanani Resort, a 30-room resort on the Mantanani Islands in Sabah. Further, the company is involved in the retailing of clothing, souvenirs, and convenience items, as well as provision of upmarket train and facilities management services. Additionally, it engages in the sale of fuel and other related bunkering services; and frozen food trading business. The company was formerly known as JEL Corporation (Holdings) Ltd. and changed its name to GSH Corporation Limited in May 2012. GSH Corporation Limited was incorporated in 2001 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "BKW.SI": {
        "short_name": "Datapulse Tech",
        "long_name": "Datapulse Technology Limited",
        "summary": "Datapulse Technology Limited, an investment holding company, engages in the hotel and hospitality property investment business in South Korea and Singapore. The company is involved in the acquisition, property development, and trading of real estate, such as hotels and hospitality, commercial, industrial, residential, and mixed development properties; and operation of a hotel. It also provides asset management services, as well as engages in the investment activity of holding long-term and trading in short-term investments. The company was founded in 1980 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "CHJ.SI": {
        "short_name": "Uni-Asia Grp",
        "long_name": "Uni-Asia Group Limited",
        "summary": "Uni-Asia Group Limited, together with its subsidiaries, operates as an alternative investment company. It operates hotels under the Hotel Vista and Hotel Vista Premio brands. The company also owns and charters ships, as well as offers ship investment and asset management services. In addition, it provides ship commercial and technical management services; and shipping related brokerage services, as well as involved in finance arrangement business. Further, the company provides property management and investment, project management, accounting, and administration, as well as investment advisory; and property leasing and construction management services. The company has operations in Japan, Asia, and internationally. Uni-Asia Group Limited was founded in 1997 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "DTPA.MU": {
        "short_name": "DATAPULSE TECHNOLOGY NEW",
        "long_name": "Datapulse Technology Limited",
        "summary": "Datapulse Technology Limited, an investment holding company, engages in the hotel and hospitality property investment business in South Korea and Singapore. The company is involved in the acquisition, property development, and trading of real estate, such as hotels and hospitality, commercial, industrial, residential, and mixed development properties; and operation of a hotel. It also provides asset management services, as well as engages in the investment activity of holding long-term and trading in short-term investments. The company was founded in 1980 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "H07.SI": {
        "short_name": "Stamford Land",
        "long_name": "Stamford Land Corporation Ltd",
        "summary": "Stamford Land Corporation Ltd, an investment holding company, owns, operates, and manages luxury hotels in Singapore, Australia, the United Kingdom, and New Zealand. The company operates through five segments: Hotel Owning and Management, Property Development, Property Investment, Trading, and Others. It owns and operates hotels and resorts under the Sir Stamford Circular Quay, Stamford Plaza Sydney Airport, Stamford Grand Adelaide, Stamford Plaza Adelaide, Stamford Plaza Melbourne, Stamford Plaza Brisbane, and Stamford Plaza Auckland names. The company also invests in, develops, constructs, trades in, rents, and manages real estate properties. In addition, it trades in interior  decoration products; and offers trustee, travel agency, and management services. Further, the company invests in securities; and provides treasury functions. The company was formerly known as Hai Sun Hup Group Ltd. Stamford Land Corporation Ltd was founded in 1935 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    }
}