{
    "1D4.SI": {
        "short_name": "$ Aoxin Q & M",
        "long_name": "Aoxin Q & M Dental Group Limited",
        "summary": "Aoxin Q & M Dental Group Limited, an investment holding company, provides private dental services, and dental equipment and supplies primarily in the People's Republic of China. The company offers private dental services, including stomatology and general dentistry, endodontics, orthodontics, periodontics, prosthodontics, dental implantology, oral and maxillofacial surgery, aesthetic dentistry, and paedodontics, as well as manages dental centers. As of December 31, 2019, it operated a total of 17 dental centers comprising 6 dental hospitals and 11 polyclinics in 8 cities in Liaoning Province. The company also distributes and sells dental equipment and supplies, such as dental chairs, ultrasound scanners, dental instruments, and materials and consumables to dental hospitals, clinics, distributors, and laboratories. In addition, it provides laboratory service, which includes the manufacturing of porcelain crown, bridges, and dentures; and leases dental equipment. The company was founded in 1997 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068898",
        "website": "http://www.aoxinqm.com.sg",
        "market_cap": "Small Cap"
    },
    "1J3.SI": {
        "short_name": "$ Asian Healthcare",
        "long_name": "Asian Healthcare Specialists Limited",
        "summary": "Asian Healthcare Specialists Limited, together with its subsidiaries, provides medical consultancy and services in the field of orthopedic medicine in Singapore. It operates through Ortho, Anaesthesia, ENT, and Other Medical Services segments. The company offers a range of general and specialized healthcare services comprising anesthesia, dermatology, family medicine, gastroenterology, orthopedics, ophthalmology, otorhinolaryngology, urology, and rehabilitative services. It has 16 medical specialists and doctors operating at 14 clinics. The company was founded in 2013 and is based in Singapore. Asian Healthcare Specialists Limited is a subsidiary of AHS Investments Holdings Pte. Ltd.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "329563",
        "website": "http://www.toc.com.sg",
        "market_cap": "Small Cap"
    },
    "40T.SI": {
        "short_name": "$ ISEC",
        "long_name": "ISEC Healthcare Ltd.",
        "summary": "ISEC Healthcare Ltd., an investment holding company, provides medical care, consultancy, treatment, and surgery services in the field of ophthalmology in Singapore, Malaysia, and Myanmar. The company operates in two segments, Specialised Health Services and General Health Services. It offers a range of specialist eye care services, including cataract and intraocular lens implant surgeries, refractive surgeries, corneal transplant surgery, adult strabismus and paediatric ophthalmology, glaucoma diagnostics and therapeutics, medical retinal diseases, uveitis, oculoplastics, facial cosmetics, and aesthetics surgeries, as well as services for vitreous and retinal diseases, external eye diseases, and optometry and orthoptics. In addition, the company offers general medical services. It operates eye care centers in Kuala Lumpur, Malacca, Penang, and Sibu. ISEC Healthcare Ltd. was incorporated in 2014 and is headquartered in Singapore. ISEC Healthcare Ltd. is a subsidiary of Aier Eye Hospital Group Co., Ltd.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "307591",
        "website": "http://www.isechealthcare.com",
        "market_cap": "Small Cap"
    },
    "5G3.SI": {
        "short_name": "$ TalkMed",
        "long_name": "TalkMed Group Limited",
        "summary": "TalkMed Group Limited, an investment holding company, provides medical oncology, stem cell transplants, and palliative care services in Singapore, China, Hong Kong, Vietnam, Malaysia, Indonesia, and internationally. It operates through three segments: Oncology Services; Stem Cell Related Products and Services; and Cellular and Gene Therapy Related Products and Services. The company offers medical oncology services in the areas of breast, colon, lung, liver, biliary and pancreatic, gastro-intestinal, head and neck, genitourinary and gynaecological, and haematology malignancies and brain cancers, as well as lymphoma and leukaemia. It also provides palliative care services comprising cancer pain management, discharge and home care planning, advance care planning, and end-of-life care services; and ancillary health services, such as CANSCREEN, a screening program that provides screening for individuals at a risk of getting cancer. In addition, the company is involved in the provision of services related to the processing, culturing, and storage of stem cells; goods and services related to cellular and gene therapy; specialist doctors and medical staff; healthcare management services; services related to the operation of cellular laboratories and storage facilities, and cellular therapeutics clinics; and customized solutions for skin care and hair rejuvenation. It operates a network of nine clinics. The company was founded in 1997 and is based in Singapore. TalkMed Group Limited is a subsidiary of Ladyhill Holdings Pte. Ltd.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "228510",
        "website": "http://www.talkmed.com.sg",
        "market_cap": "Small Cap"
    },
    "5NG.SI": {
        "short_name": "$ Healthway Med",
        "long_name": "Healthway Medical Corporation Limited",
        "summary": "Healthway Medical Corporation Limited, an investment holding company, provides healthcare management services primarily in Singapore and China. The company operates in two segments, Primary Healthcare and Specialist Healthcare. The Primary Healthcare segment offers services in family medicine, dentistry, and healthcare benefit management areas, as well as invests in strategic medical related business. The Specialist Healthcare segment provides services in the areas of pediatrics, orthopedics, aesthetic medicine, obstetrics, and gynecology; and cardiology, gastroenterology, psychiatry, ophthalmology, otorhinolaryngology, and general surgery. The company also provides managed healthcare, medical, and consultancy services; and sells drugs and medical supplies. It owns, operates, and manages 89 clinics and medical centers. Healthway Medical Corporation Limited was founded in 1990 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068809",
        "website": "http://www.healthwaymedical.com",
        "market_cap": "Small Cap"
    },
    "5RE.SI": {
        "short_name": "$ Asia Vets",
        "long_name": "Asia Vets Holdings Ltd.",
        "summary": "Asia Vets Holdings Ltd., through its subsidiary, AVH Animal Ark Pte. Ltd., provides veterinary care and clinical services to small animals in Singapore. It provides various veterinary services, including medical, surgical, and dental care to dogs, cats, rabbits, hamsters, guinea pigs, and chinchillas, as well as offers emergency services. The company was formerly known as Smartflex Holdings Ltd. and changed its name to Asia Vets Holdings Ltd. in July 2018. The company was founded in 2003 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "069915",
        "website": "http://www.asiavets.com",
        "market_cap": "Small Cap"
    },
    "5WA.SI": {
        "short_name": "$ OUE Lippo HC",
        "long_name": "OUE Lippo Healthcare Limited",
        "summary": "OUE Lippo Healthcare Limited, an investment holding company, acquires, develops, operates, and manages healthcare facilities, healthcare-related assets, and integrated mixed-use projects in Japan and the People's Republic of China. The company operates through Healthcare Operations, Healthcare Assets, Properties Under Development, and Investments segments. Its facilities include medical centers, day surgeries, hospitals, nursing homes, and retirement communities. The company owns and operates 12 nursing homes in Japan, as well as one hospital in China. It is also involved in the rental of investment properties and assets; and trading of pharmaceutical supplies, drugs, and medical equipment. The company was formerly known as International Healthway Corporation Limited and changed its name to OUE Lippo Healthcare Limited in October 2017. The company was founded in 2010 and is based in Singapore. OUE Lippo Healthcare Limited is a subsidiary of OUE Limited.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068809",
        "website": "http://www.ouelh.com",
        "market_cap": "Small Cap"
    },
    "8437.HK": {
        "short_name": "RMH HOLDINGS",
        "long_name": "RMH Holdings Limited",
        "summary": "RMH Holdings Limited, an investment holding company, provides dermatology treatment solutions in Singapore, Hong Kong, and internationally. The company operates in two segments, Healthcare service and Trading sales. It offers specialty care services for various dermatological conditions affecting skin, hair, and nails through medical, surgical, laser, and aesthetic treatments. The company also engages in treating skin cancer and skin diseases, such as eczema, psoriasis, acne, pigmentation, adverse drug reactions, and warts; and providing consultancy, prescription, and dispensing services. It operates three clinics at Orchard Road, Raffles Place, and East Coast. The company was incorporated in 2017 and is headquartered in Singapore. RMH Holdings Limited is a subsidiary of Brisk Success Holdings Limited.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "238859",
        "website": "http://www.rmhholdings.com.sg",
        "market_cap": "Small Cap"
    },
    "A50.SI": {
        "short_name": "Thomson Medical",
        "long_name": "Thomson Medical Group Limited",
        "summary": "Thomson Medical Group Limited, an investment holding company, provides healthcare services for women and children in Singapore, Malaysia, the United Kingdom, China, the Middle East, and internationally. The company owns and operates the Thomson Medical Center, as well as a network of 35 clinics and centers, which provide services in the areas of obstetrics, gynecology, pediatrics, aesthetics, cardiology, sports medicine, dermatology, cancer treatment, dental, traditional Chinese medicine, health screening, laboratory, and radiology; and offer diagnostic imaging, pharmacy, and outpatient services. It also provides consumer products and services, such as health supplements, skin care products, and mother and baby products. In addition, the company operates a pre-natal and clinical diagnostic laboratory; the Thomson Hospital Kota Damansara, a 205-bed hospital located in Kota Damansara, Kuala Lumpur; 6 fertility treatment centers under the TMC Fertility Center name; and the Vantage Bay Healthcare City, an integrated health and wellness development that consists of medical, wellness, and educational facilities located in Iskandar Malaysia. Further, it provides architect, planning, and engineering; research and development; property development; and engineering consultancy services. The company was founded in 1979 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "307591",
        "website": "http://www.thomsonmedicalgroup.com",
        "market_cap": "Mid Cap"
    },
    "AJJ.AX": {
        "short_name": "ASIAN AMER FPO",
        "long_name": "Asian American Medical Group Limited",
        "summary": "Asian American Medical Group Limited provides specialized medical services for liver diseases in Singapore, rest of Asia, and internationally. It operates through Liver, Multi-Speciality, Management and Consultancy, and Healthcare Real Estate segments. The company provides medical consultation and services for hepatology and related fields; multi-specialty medical consultation and services for medical pilot zones in China; and healthcare management and consultancy services, as well as develops real estate projects. Asian American Medical Group Limited has a strategic collaboration with University of Pittsburgh Medical Centre. The company was formerly known as Asian Centre for Liver Diseases and Transplantation Limited and changed its name to Asian American Medical Group Limited in December 2012. Asian American Medical Group Limited was founded in 1994 and is based in Singapore.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "258500",
        "website": "http://www.aamg.co",
        "market_cap": "Small Cap"
    },
    "BSL.SI": {
        "short_name": "Raffles Medical",
        "long_name": "Raffles Medical Group Ltd",
        "summary": "Raffles Medical Group Ltd provides integrated private healthcare services primarily in Singapore, Greater China, Vietnam, Cambodia, and Japan. The company operates through Healthcare Services, Hospital Services, and Investment Holdings segments. Its flagship hospital is the Raffles Hospital, a tertiary care hospital that offers cancer, children and women care, Chinese medicine, counselling, dental, dialysis, diabetes and endocrinology, ear, nose, throat, eye, fertility, heart, internal medicine, neuroscience, pain management, rehabilitation, orthopedic, skin and aesthetics, surgery, nuclear medicine, and urology services. The company also offers emergency services, family medicine services, health screening, and various multi-disciplinary specialist clinic services. Raffles Medical Group Ltd was founded in 1976 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "188770",
        "website": "http://www.rafflesmedicalgroup.com/raffles-medical-group",
        "market_cap": "Mid Cap"
    },
    "EHG.SI": {
        "short_name": "$ Econ Healthcare",
        "long_name": "Econ Healthcare (Asia) Limited",
        "summary": "Econ Healthcare (Asia) Limited operates nursing homes for the elderly in Singapore, Malaysia, and China. It operates medicare centers and nursing homes that offer residential nursing care services, rehabilitation services and traditional Chinese medicine (TCM) treatments, clinical services, and home care services. The company also provides other operations and ancillary services, such as healthcare training services, TCM services, operation of senior activity centers. As of March 12, 2021, it operated 10 medicare centres and nursing homes with a total bed capacity of 1,376. The company was founded in 1987 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "419728",
        "website": "http://www.econhealthcare.com",
        "market_cap": "Small Cap"
    },
    "FRQ.SI": {
        "short_name": "$ Sing Paincare",
        "long_name": "Singapore Paincare Holdings Limited",
        "summary": "Singapore Paincare Holdings Limited, an investment holding company, operates medical clinics in Singapore. It offers pain care services for the treatment of patients suffering from acute and chronic pain, including minimally invasive procedures, cancer pain treatment, specialized injections, pharmacotherapy, and cognitive behavioural therapy, as well as neck pain, lower, spinal stenosis, osteoarthritis, fibromyalgia, frozen shoulder, plantar fasciitis, and tennis elbow pain conditions; and primary care and other services comprising general medical consultations, management of chronic and acute conditions, and dermatology services. The company also offers myofascial pain injections, platelet rich plasma, neuroplasty, necleoplasty, radio frequency ablation, intrathecal pump implants, pulsed radio frequency, spinal cord stimulator, and endoscopic laser decompression services. It has two specialist clinics and four medical clinics. Singapore Paincare Holdings Limited was founded in 2007 and based in Singapore.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "238841",
        "website": "http://www.sgpaincareholdings.com",
        "market_cap": "Small Cap"
    },
    "HLM.F": {
        "short_name": "HEALTHWAY MEDIC. CORP.LTD",
        "long_name": "Healthway Medical Corporation Limited",
        "summary": "Healthway Medical Corporation Limited, an investment holding company, provides healthcare management services primarily in Singapore and China. The company operates in two segments, Primary Healthcare and Specialist Healthcare. The Primary Healthcare segment offers services in family medicine, dentistry, and healthcare benefit management areas, as well as invests in strategic medical related business. The Specialist Healthcare segment provides services in the areas of pediatrics, orthopedics, aesthetic medicine, obstetrics, and gynecology; and cardiology, gastroenterology, psychiatry, ophthalmology, otorhinolaryngology, and general surgery. The company also provides managed healthcare, medical, and consultancy services; and sells drugs and medical supplies. It owns, operates, and manages 89 clinics and medical centers. Healthway Medical Corporation Limited was founded in 1990 and is based in Singapore.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068809",
        "website": "http://www.healthwaymedical.com",
        "market_cap": "Small Cap"
    },
    "MIJ.SI": {
        "short_name": "$ Alliance HC",
        "long_name": "Alliance Healthcare Group Limited",
        "summary": "Alliance Healthcare Group Limited, an investment holding company, provides corporate health solutions in Singapore, Hong Kong, Japan, Thailand, and internationally. It operates through Managed Healthcare Solutions, GP Clinic Services, Specialist Care Services, and Pharmaceutical Services segments. The Managed Healthcare Solutions segment offers managed healthcare solutions to corporations and insurance companies by establishing an extensive network of medical service providers to deliver healthcare services to the employees of corporations or insured members of policyholders of insurance companies. The GP Clinics Services segment provides primary healthcare medical services by general practitioners. The Specialist Care Services segment offers medical services by specialists. The Pharmaceutical Services segment engages in the wholesale of pharmaceutical products, including medicines and health supplements, as well as medical devices. The company was incorporated in 2006 and is based in Singapore. Alliance Healthcare Group Limited is a subsidiary of Alpine Investment Holdings Pte. Ltd.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "658066",
        "website": "http://www.alliancehealthcare.com.sg",
        "market_cap": "Small Cap"
    },
    "OTX.SI": {
        "short_name": "$ Medinex",
        "long_name": "Medinex Limited",
        "summary": "Medinex Limited, an investment holding company, provides professional medical support and consultancy services to medical clinics in Singapore. The company operates through three segments: Medical Support Services, Business Support Services, and Pharmaceutical Services. Its medical support services include overseeing the setting up of clinics; and facilitating applications for relevant clinic licenses. The company also provides business support services, such as accounting and tax agent services, human resource management services, and corporate secretarial services. In addition, it offers pharmaceutical services, such as assistance in procuring medical and pharmaceutical products, as well as business support services to companies outside of the healthcare industry. It primarily serves general practitioners and specialists; and clients in various industries, including food and beverage, retail, education, and beauty industries. The company was incorporated in 2009 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "179098",
        "website": "http://www.medinex.com.sg",
        "market_cap": "Small Cap"
    },
    "PRH.SI": {
        "short_name": "$ Livingstone",
        "long_name": "Livingstone Health Holdings Limited",
        "summary": "Livingstone Health Holdings Limited, an investment holding company, provides healthcare services in Singapore and the Asia Pacific region. It offers healthcare services in the fields of cardiology, orthopedic surgery, pain management and anaesthesiology, aesthetics and wellness, and family medicine. Livingstone Health Holdings Limited was incorporated in 2017 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "209000",
        "website": "http://www.livingstonehealth.com.sg",
        "market_cap": "Small Cap"
    },
    "QC7.SI": {
        "short_name": "Q&M Dental",
        "long_name": "Q & M Dental Group (Singapore) Limited",
        "summary": "Q & M Dental Group (Singapore) Limited, an investment holding company, provides private dental healthcare services. It operates through Primary Healthcare, and Dental Equipment and Supplies Distribution segments. It offers various aesthetic/cosmetic, CAD CAM digital, children, general, geriatric, and implant dentistry services; consultation, gum disease and surgery, oral surgery, root canal treatment, scaling and polishing, teeth grinding and whitening, tooth-colored filling, and wisdom tooth surgery services; and crowns and bridges, dental X-rays, dentures, extractions, mouth guards, orthodontics, and sensitive teeth. The company also provides general health services comprising adult and children consultation, chronic disease management, men's health, and skin care services; and cervical PAP smear, family planning, general and pre-marital health screening, smoking cessation, and weight loss management services, as well as cervical cancer, chicken pox, childhood, hepatitis profiling, influenza, and travel advice vaccinations. In addition, it offers pre-education/extracurricular activity certifications, and pre-employment checks; and ear syringing, foreign materials and warts removal, suturing, and wound care and dressing services. Further, the company offers dental laboratory services; trades in dental surgery materials and equipment; leases dental equipment; and develops dental healthcare software and equipment. As of April 23, 2020, it operated 114 dental outlets, 5 medical clinics, and 3 dental supplies and equipment distribution companies in Singapore, Malaysia, and the People's Republic of China. The company was founded in 1996 and is based in Singapore. Q & M Dental Group (Singapore) Limited is a subsidiary of Quan Min Holdings Pte. Ltd.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "129809",
        "website": "http://www.qandm.com.sg",
        "market_cap": "Small Cap"
    },
    "QMBN.F": {
        "short_name": "Q+M DENTAL GROUP SING.LTD",
        "long_name": "Q & M Dental Group (Singapore) Limited",
        "summary": "Q & M Dental Group (Singapore) Limited, an investment holding company, provides private dental healthcare services. It operates through Primary Healthcare, and Dental Equipment and Supplies Distribution segments. It offers various aesthetic/cosmetic, CAD CAM digital, children, general, geriatric, and implant dentistry services; consultation, gum disease and surgery, oral surgery, root canal treatment, scaling and polishing, teeth grinding and whitening, tooth-colored filling, and wisdom tooth surgery services; and crowns and bridges, dental X-rays, dentures, extractions, mouth guards, orthodontics, and sensitive teeth. The company also provides general health services comprising adult and children consultation, chronic disease management, men's health, and skin care services; and cervical PAP smear, family planning, general and pre-marital health screening, smoking cessation, and weight loss management services, as well as cervical cancer, chicken pox, childhood, hepatitis profiling, influenza, and travel advice vaccinations. In addition, it offers pre-education/extracurricular activity certifications, and pre-employment checks; and ear syringing, foreign materials and warts removal, suturing, and wound care and dressing services. Further, the company offers dental laboratory services; trades in dental surgery materials and equipment; leases dental equipment; and develops dental healthcare software and equipment. As of April 23, 2020, it operated 114 dental outlets, 5 medical clinics, and 3 dental supplies and equipment distribution companies in Singapore, Malaysia, and the People's Republic of China. The company was founded in 1996 and is based in Singapore. Q & M Dental Group (Singapore) Limited is a subsidiary of Quan Min Holdings Pte. Ltd.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "129809",
        "website": "http://www.qandm.com.sg",
        "market_cap": "Small Cap"
    },
    "RAFLF": {
        "short_name": "RAFFLES MEDICAL GROUP",
        "long_name": "Raffles Medical Group Ltd",
        "summary": "Raffles Medical Group Ltd provides integrated private healthcare services primarily in Singapore, Greater China, Vietnam, Cambodia, and Japan. The company operates through Healthcare Services, Hospital Services, and Investment Holdings segments. Its flagship hospital is the Raffles Hospital, a tertiary care hospital that offers cancer, children and women care, Chinese medicine, counselling, dental, dialysis, diabetes and endocrinology, ear, nose, throat, eye, fertility, heart, internal medicine, neuroscience, pain management, rehabilitation, orthopedic, skin and aesthetics, surgery, nuclear medicine, and urology services. The company also offers emergency services, family medicine services, health screening, and various multi-disciplinary specialist clinic services. Raffles Medical Group Ltd was founded in 1976 and is based in Singapore.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "188770",
        "website": "http://www.rafflesmedicalgroup.com/raffles-medical-group",
        "market_cap": "Small Cap"
    },
    "VFP.SI": {
        "short_name": "$ Beverly JCG",
        "long_name": "Beverly JCG Ltd.",
        "summary": "Beverly JCG Ltd., an investment holding company, engages in trading and distribution, and medical businesses. Its Trading and Distribution segment engages in the trading and distribution of steel raw materials, consumables, instruments, and semi-finished products for steel mills, iron and steel foundries, and aluminum smelters in the Asia-Pacific region, as well as provision of ancillary services. The company's Aesthetic Medical segment provides aesthetic medical services, including the provision of aesthetic medical, beauty, and wellness services in Asia. Its Event Organisation and Management Consultancy segment engages in the provision of event organisation and management consultancy services. The company's Investment and Others segment provides management services, as well as marketing, distribution, and related services. The company was formerly known as JCG Investment Holdings Ltd. and changed its name to Beverly JCG Ltd. in July 2020. Beverly JCG Ltd. was founded in 1987 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "188778",
        "website": "http://www.jcg-investment.com",
        "market_cap": "Small Cap"
    }
}