{
    "569.SI": {
        "short_name": "Vicplas Intl",
        "long_name": "Vicplas International Ltd",
        "summary": "Vicplas International Ltd, an investment holding company, engages in the medical devices, and pipes and pipe fittings businesses in Singapore, Malaysia, and China. It manufactures and distributes piping systems for various industries, including waste and potable water systems for residential homes, schools, and commercial and industrial buildings; underground electrical and internal building wire piping systems; and data and signal line piping systems by telecommunications companies. The company also designs, develops, manufactures, and assembles sterile and non-sterile medical devices; sells pharmaceutical products; and provides project design and engineering services. The company was founded in 1993 and is based in Singapore. Vicplas International Ltd is a subsidiary of Venner Capital S.A.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "5I0.SI": {
        "short_name": "$ QT Vascular",
        "long_name": "QT Vascular Ltd.",
        "summary": "QT Vascular Ltd., together with its subsidiaries, engages in the design, assembly, and distribution of advanced therapeutic solutions for the minimally invasive treatment of complex vascular diseases. The company offers coronary products, including Chocolate percutaneous transluminal coronary angioplasty (PTCA) balloon catheter to reduce vessel trauma by providing balloon inflation; and Glider PTCA balloon catheter for the treatment of various complex lesions. It also provides Chocolate percutaneous transluminal angioplasty (PTA) balloon catheter for atraumatic dilatation in the treatment of blocked arteries; Chocolate Touch PTA balloon catheter to treat peripheral vascular disease; GliderfleX PTA balloon catheter for treating distal peripheral vessels; and GliderXtreme PTA balloon catheter that targets complex lesions in the distal peripheral vasculature. It has operations in the United States, Europe, and Singapore. The company was incorporated in 2005 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "8YY.SI": {
        "short_name": "$ Biolidics",
        "long_name": "Biolidics Limited",
        "summary": "Biolidics Limited, a medical technology company, develops cell enrichment systems for cancer diagnosis, prognosis, and treatment selection and monitoring applications. The company engages in the research, experimental development, and marketing on biotechnology, life and medical science, and electronics related industrial design services. It offers ClearCell FX1 System, an automated in vitro diagnostic medical device that separates and enriches cancer cells from blood. The company has a strategic collaboration with Sysmex Corporation. It serves academic and research institutes, hospitals, and laboratories in Singapore, China, Hong Kong, Japan, the United States, and other European Union countries. The company was founded in 2009 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "QTVLF": {
        "short_name": "QT VASCULAR LTD",
        "long_name": "QT Vascular Ltd.",
        "summary": "QT Vascular Ltd., together with its subsidiaries, engages in the design, assembly, and distribution of advanced therapeutic solutions for the minimally invasive treatment of complex vascular diseases. The company offers coronary products, including Chocolate percutaneous transluminal coronary angioplasty (PTCA) balloon catheter to reduce vessel trauma by providing balloon inflation; and Glider PTCA balloon catheter for the treatment of various complex lesions. It also provides Chocolate percutaneous transluminal angioplasty (PTA) balloon catheter for atraumatic dilatation in the treatment of blocked arteries; Chocolate Touch PTA balloon catheter to treat peripheral vascular disease; GliderfleX PTA balloon catheter for treating distal peripheral vessels; and GliderXtreme PTA balloon catheter that targets complex lesions in the distal peripheral vasculature. It has operations in the United States, Europe, and Singapore. The company was incorporated in 2005 and is based in Singapore.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    }
}