{
    "AP4.SI": {
        "short_name": "Riverstone",
        "long_name": "Riverstone Holdings Limited",
        "summary": "Riverstone Holdings Limited, an investment holding company, manufactures and distributes cleanroom and healthcare gloves in Malaysia. The company offers cleanroom finger cots, static shielding and packaging bags, face masks, and wipers; and other consumables, such as hairnets, antistatic gloves, conductive latex finger cots, static dissipative shoes, safety booties, shoe covers, cleanroom coveralls, ESD rubber bands, sticky mats and rollers, swab-polyester and microfibers, and cleanroom papers. It also provides healthcare products, including blue, white, black, and accelerator free nitrile exam gloves. In addition, the company trades in latex products; and distributes cleanroom products. It sells its products under the RS brand for use in the hard disk drive, semiconductor, and healthcare industries. The company also exports its products to Asia, Europe, and the Americas. Riverstone Holdings Limited was founded in 1989 and is based in Singapore. Riverstone Holdings Limited operates as a  subsidiary of Raffles Nominees (PTE.) Limited.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "534963",
        "website": "http://www.riverstone.com.my",
        "market_cap": "Small Cap"
    },
    "OSX.AX": {
        "short_name": "OSTEOPORE FPO",
        "long_name": "Osteopore Limited",
        "summary": "Osteopore Limited designs, develops, and markets bioresorbable polymer implants for neurosurgical, orthopedic, and maxillofacial surgery applications. It specializes in the production of 3D printed bioresorbable implants that are used in conjunction with surgical procedures to assist with the natural stages of bone healing. The company offers Osteoplug, a bioresorbable implant, which is used for covering trephination burr holes in neurosurgery; Osteomesh, a bioresorbable implant that is used in craniofacial surgery to repair various types of fractures, such as orbital floor fracture, as well as to fill surgical defects; and Osteostrip. It operates in Singapore, Korea, Vietnam, and internationally. The company was founded in 2003 and is headquartered in Singapore.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "618305",
        "website": "http://www.osteopore.com",
        "market_cap": "Small Cap"
    }
}