{
    "1A4.SI": {
        "short_name": "$ AGV",
        "long_name": "AGV Group Limited",
        "summary": "AGV Group Limited, an investment holding company, provides hot dip galvanizing services to steel and iron fabrication industries in Singapore and Malaysia. The company also engages in consultation and contract works relating to galvanization. It serves customers in public and transport sectors. The company was incorporated in 2015 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "629892",
        "website": "http://www.agvgroup.com.sg",
        "market_cap": "Nano Cap"
    },
    "5EB.SI": {
        "short_name": "$ CFM",
        "long_name": "CFM Holdings Limited",
        "summary": "CFM Holdings Limited, an investment holding company, designs, fabricates, and sells tools-and-dies used for the manufacture of stamped metal components. The company operates through Metal Stamping; Tooling; Components and Parts and Others; and Cleanroom Products segments. The Metal Stamping segment manufactures metal plates and metal stampings. The Tooling segment manufactures and fabricates engineering tools and dies. The Components and Parts and Others segment is involved in trading other components and parts. This segment also engages in warehousing and service logistic businesses. The Cleanroom Products segment engages in trading disposables and wearables for use in cleanroom, bio-medical, laboratories, and hospitals. The company serves electronics, automotive, telecommunications, technology, M&E, and pharmaceutical industries. It operates in Singapore, Malaysia, the United States, the Slovak Republic, the Czech Republic, the Netherlands, and internationally. CFM Holdings Limited was founded in 1979 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "569498",
        "website": "http://www.cfmholdings.com",
        "market_cap": "Micro Cap"
    },
    "8027.HK": {
        "short_name": "KPM HOLDING",
        "long_name": "KPM Holding Limited",
        "summary": "KPM Holding Limited, an investment holding company, engages in the design, fabrication, installation, and maintenance of signage and related products in Singapore. The company offers its products in the public sector for roads, education institutions, public housing flats/compounds, defense compound, airport and national parks, and others; and private sector for commercial and industrial buildings, private residential buildings, hospitals, and fast food chains. It also provides subcontracting services for fitting-out work to commercial premises and residential developments, as well as renovation services for premises. KPM Holding Limited was founded in 1997 and is headquartered in Singapore.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "507601",
        "website": "http://www.kpmholding.com",
        "market_cap": "Nano Cap"
    },
    "G0I.SI": {
        "short_name": "Nam Lee Metal",
        "long_name": "Nam Lee Pressed Metal Industries Limited",
        "summary": "Nam Lee Pressed Metal Industries Limited, together with its subsidiaries, engages in the design, fabrication, supply, and installation of steel and aluminum products in Singapore, Malaysia, and Hong Kong. It operates through four segments: Aluminium, Mild Steel, Stainless Steel, and Others. The company's steel and aluminum products include gates, door frames, railings, laundry racks, letter boxes, sliding windows and doors, curtain walls, and cladding systems for building and infrastructure projects. It also manufactures and supplies aluminum industrial products for container refrigeration units. In addition, the company manufactures grilles, drying racks, hoppers, and other metal and steel-based products. Further, it is involved in the fabrication, installation, and supply of building materials and products. Additionally, the company offers glasses and shower screens for building construction projects; and mild steel products on door frame and entrance gate for building construction projects. Nam Lee Pressed Metal Industries Limited was incorporated in 1975 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "729048",
        "website": "http://www.namlee.com.sg",
        "market_cap": "Micro Cap"
    },
    "K1Q.SI": {
        "short_name": "TTJ",
        "long_name": "T T J Holdings Limited",
        "summary": "T T J Holdings Limited, an investment holding company, engages in the design, supply, fabrication, and erection of various structural steel works in Singapore, Malaysia, and Thailand. It operates through Structural Steel, Waste Management and Treatment, and Other segments. It offers structural steel works used in the construction of buildings, factories, plants, and infrastructures; and fabricates and installs various cranes and lifting equipment used in shipyards, factories, and construction sites, as well as handles heavy lifting operations, such as launching of heavy trusses, viaduct beams for MRT, and LRT. The company also designs and develops various standard two-rail and three-rail aluminum parapets for use in flyovers and expressways; fabricates and installs various bomb shelter doors for the HDB, MOE, and SMRT; and offers mechanized car parking systems. In addition, it manufactures and sells wood pallets; and operates dormitories. T T J Holdings Limited was founded in 1981 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "628508",
        "website": "http://www.ttj.com.sg",
        "market_cap": "Nano Cap"
    },
    "M03.SI": {
        "short_name": "$ Miyoshi",
        "long_name": "Miyoshi Limited",
        "summary": "Miyoshi Limited, together with its subsidiaries, designs and manufactures mold and precision pressed parts, and trades in related products. The company operates through four segments: Data Storage, Consumer Electronics, Automotive, and Rental. The Data Storage segment manufactures metal semi-finished components for hard disk drives and removable storage devices. The Consumer Electronics segment offers metal semi-finished components for photocopiers, scanners, and printers. The Automotive segment provides finished products of light electric vehicles, as well as semi-finished metal components for motor vehicles. The Rental segment offers properties on rent. The company also engages in the metal stamping, fabrication of parts and components of machine tools, and plastic injection molding activities; trading of machines; and manufacturing of consumer electronics, as well as provides cold storage services. It operates in the Philippines, the People's Republic of China, Thailand, Mexico, Hungary, Malaysia, Singapore, and internationally. The company was formerly known as Miyoshi Precision Limited and changed its name to Miyoshi Limited in December 2014. Miyoshi Limited was founded in 1987 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "609970",
        "website": "http://www.miyoshi.biz",
        "market_cap": "Nano Cap"
    },
    "M14.SI": {
        "short_name": "InnoTek",
        "long_name": "InnoTek Limited",
        "summary": "InnoTek Limited, an investment holding company, operates as a precision metal components manufacturer in Singapore, the People's Republic of China, and Thailand. Its Precision Components and Tooling Segment provides stamping components, and tooling design and fabrication services to automotive components, office automation, and consumer electronics products industries. This segment also offers die making services to manufacturers. Its Precision Machining segment engages in the machining of products for the TV and office automation industries; and provision of metal-related components for customers in TV, tablet, and mobile-phone industries. The company also provides metal stamping and sub-assembly of stamped components, as well as tooling and plastic injection products. The company was formerly known as Magnecomp International Limited and changed its name to InnoTek Limited in November 2007. InnoTek Limited was incorporated in 1995 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068914",
        "website": "http://www.innotek.com.sg",
        "market_cap": "Micro Cap"
    }
}