{
    "BWEK.OL": {
        "short_name": "BW EPIC KOSAN LTD",
        "long_name": "BW Epic Kosan Ltd.",
        "summary": "BW Epic Kosan Ltd., together with its subsidiaries, owns and operates a fleet of pressurized gas carriers in Southeast Asia, Europe, West Africa, and the United States. The company operates a fleet of 76 vessels that provide seaborne services for the transportation of liquefied petroleum gas and petrochemicals, which serve as a link in the international gas and petrochemical supply chains of various oil and commodity trading houses. It also offers commercial and technical management services for various ship owners, as well as engages in vessel owning and chartering activities. The company was formerly known as Epic Gas Ltd and changed its name to BW Epic Kosan Ltd in March 2021. The company was incorporated in 2012 and is headquartered in Singapore. BW Epic Kosan Ltd. is a subsidiary of BW Group Limited.",
        "currency": "NOK",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "059818",
        "website": "http://www.bwek.com",
        "market_cap": "Micro Cap"
    },
    "FQ7.SI": {
        "short_name": "Jasper Inv",
        "long_name": "Jasper Investments Limited",
        "summary": "Jasper Investments Limited, an investment holding company, manages vessels and provides barge transportation services in the North Asian region. The company's transportation services include chartering and operating various vessels and transportation equipment for the infrastructure players in the reclamation, construction, and earthwork sectors. It also acts as a contractor for project management of infrastructural works. The company was incorporated in 1987 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "589472",
        "website": "http://www.jasperinvests.com",
        "market_cap": "Nano Cap"
    }
}