{
    "BMT.SI": {
        "short_name": "New Silkroutes",
        "long_name": "New Silkroutes Group Limited",
        "summary": "New Silkroutes Group Limited, an investment holding company, primarily operates in the healthcare and energy sectors. It operates in Trading of Oil and Gas, and Healthcare segments. The Trading of Oil and Gas segment trades in petrochemical products; generates power; and invests in strategic petrochemical assets. The Healthcare segment owns and operates primary care medical and dental clinics; and provides hospital development and management services. It owns 16 clinics comprising one dental specialist clinic, eight dental clinics, five family medicine clinics, one aesthetic clinic, and one traditional Chinese medicine clinic. This segment also runs employee healthcare benefits programs; offers systems integration services to hospitals and healthcare facilities; distributes dental and medical supplies; and manufactures disposable medical consumables, such as hospital gowns, linen, personal protective equipment, and masks. It also distributes health supplements and Chinese proprietary medicines; provides clinical management and healthscience consultancy services; and offers business, management, and investment consultancy, as well as management services. In addition, the company is involved in the wholesale and retail trading of crude oil, intermediate fuel oil, and other distillates; and chartering of ships. It has operations in Australia, Cambodia, China, India, Singapore, South Korea, Switzerland, the United Arab Emirates, and Vietnam. The company was formerly known as Digiland International Limited and changed its name to New Silkroutes Group Limited in July 2015. New Silkroutes Group Limited was incorporated in 1994 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "Y35.SI": {
        "short_name": "AnAn Intl",
        "long_name": "AnAn International Limited",
        "summary": "AnAn International Limited, an investment holding company, engages in the trading of petrochemical, fuel oil, and petroleum products. It offers crude oil; light ends products, such as LPG, NGLs, naphtha, gasoline and blending components, etc.; middle distillates products, including kerosene and diesel; heavy ends products, which include vacuum gasoil, straight-run fuel oil, cracked fuel oil, asphalt, etc.; and chemical products comprising paraxylene, mixed xylenes, glycol, styrene, natural runner, etc. The company also engages in the derivatives trading of energy commodities, as well as invests in energy sector. It has operations in Europe, Singapore, Hong Kong, the People's Republic of China, and internationally. The company was formerly known as CEFC International Limited and changed its name to AnAn International Limited in September 2017. AnAn International Limited was incorporated in 2004 and is based in Singapore. AnAn International Limited is a subsidiary of AnAn Group (Singapore) Pte. Ltd.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    }
}