{
    "5WV.SI": {
        "short_name": "$ AsiaPhos",
        "long_name": "AsiaPhos Limited",
        "summary": "AsiaPhos Limited, an investment holding company, manufactures, sells, and trades in phosphate-based chemical products in the People's Republic of China, Singapore, India, the United States, and internationally. The company offers yellow phosphorus, sodium tripolyphosphate, sodium trimetaphosphate, sodium hexametaphosphate, trisodium phosphate, tetra-sodium pyrophosphate, tetrapotassium pyrophosphate, sodium acid pyrophosphate, disodium phosphate, monosodium phosphate, and Phosphoric Acid. It is also involved in the general wholesale trade and trading of chemicals; and provision of Internet technology consulting and transportation services. AsiaPhos Limited was founded in 1996 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "ASO.SG": {
        "short_name": "AsiaPhos Ltd. Registered Shares",
        "long_name": "AsiaPhos Limited",
        "summary": "AsiaPhos Limited, an investment holding company, manufactures, sells, and trades in phosphate-based chemical products in the People's Republic of China, Singapore, India, the United States, and internationally. The company offers yellow phosphorus, sodium tripolyphosphate, sodium trimetaphosphate, sodium hexametaphosphate, trisodium phosphate, tetra-sodium pyrophosphate, tetrapotassium pyrophosphate, sodium acid pyrophosphate, disodium phosphate, monosodium phosphate, and Phosphoric Acid. It is also involved in the general wholesale trade and trading of chemicals; and provision of Internet technology consulting and transportation services. AsiaPhos Limited was founded in 1996 and is based in Singapore.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "OMH.AX": {
        "short_name": "OM HLDNGS FPO 10C",
        "long_name": "OM Holdings Limited",
        "summary": "OM Holdings Limited, an investment holding company, engages in mining, smelting, trading, and marketing ores and ferroalloys. The company operates through Mining, Smelting, and Marketing and Trading segments. It owns Bootu Creek manganese mine that is located in the Northern territory of Australia. The company also provides manganese ferroalloys, ferrosilicon, and manganese sinter ore. In addition, it trades in manganese ore, manganese ferroalloys, ferrosilicon, and sinter ore. The company has operations in Australia, the People's Republic of China, Singapore, Malaysia, and Mauritius. OM Holdings Limited was founded in 1994 and is based in Singapore.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "S20.SI": {
        "short_name": "Straits Trading",
        "long_name": "The Straits Trading Company Limited",
        "summary": "The Straits Trading Company Limited, an investment company, has stakes in real estate, hospitality, and resources businesses. It operates through Resources, Real Estate, and Hospitality segments. The company engages in the smelting of tin concentrates and tin bearing materials. It also produces various grades of refined tin metal and by-products; and invests in other metals and mineral resources. In addition, the company invests in, develops, leases, and sells real estate properties; provides property and real estate fund management services; and owns and manages hotels. It has operations in Singapore, Malaysia, Japan, Australia, and China. The company was founded in 1887 and is headquartered in Singapore. The Straits Trading Company Limited is a subsidiary of The Cairns Pte. Ltd.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "SAU.TO": {
        "short_name": "ST AUGUSTINE GOLD AND COPPER LT",
        "long_name": "St. Augustine Gold and Copper Limited",
        "summary": "St. Augustine Gold and Copper Limited, a mineral exploration company, engages in the acquisition, exploration, and evaluation of mineral properties in the Philippines. It holds interests in the King-king copper-gold project covering an area of approximately 1,548 hectares located in the Province of Compostela Valley, Mindanao Island. The company is headquartered in Singapore.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "STP.SI": {
        "short_name": "$ Silkroad Nickel",
        "long_name": "Silkroad Nickel Ltd.",
        "summary": "Silkroad Nickel Ltd., together with its subsidiaries, engages in the exploration, mining, production, and sale of nickel ore. The company's nickel mining concession area consists of approximately 1,301 hectares in the Morowali Regency, Central Sulawesi, Indonesia. Silkroad Nickel Ltd. was incorporated in 2005 and is headquartered in Singapore. Silkroad Nickel Ltd. is a subsidiary of Far East Mining Pte. Ltd.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    }
}