{
    "BMGU.SI": {
        "short_name": "BHG Retail Reit",
        "long_name": "BHG Retail REIT",
        "summary": "BHG Retail REIT is the first pure-play China Retail REIT sponsored by a leading China integrated retail group. The REIT was listed on the Main Board of the Singapore Exchange Securities Trading Limited on 11 December 2015. The principal investment strategy of BHG Retail REIT is to invest, directly or indirectly, in a diversified portfolio of income-producing real estate which is used primarily for retail purposes (whether either wholly or partially), as well as real estate-related assets in relation to the foregoing, with an initial focus on China. As at 30 June 2020, the REIT's portfolio comprises six retail properties, Beijing Wanliu (60%), Chengdu Konggang, Hefei Mengchenglu, Hefei Changjiangxilu, Xining Huayuan, Dalian Jinsanjiao located in Tier 1, Tier 2 and other cities of significant economic potential in China. The portfolio gross floor area of about 311,691 sqm, has a committed occupancy of 92.9% as at 30 June 2020.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "CPAMF": {
        "short_name": "CAPITALAND INTEGRATED COM TRUST",
        "long_name": "CapitaLand Integrated Commercial Trust",
        "summary": "CapitaLand Integrated Commercial Trust (CICT) is the first and largest real estate investment trust (REIT) listed on Singapore Exchange Securities Trading Limited (SGX-ST) with a market capitalisation of S$11.4 billion as at 2 November 2020. It debuted on SGX-ST as CapitaLand Mall Trust in July 2002 and was renamed CICT in November 2020 following the merger with CapitaLand Commercial Trust. CICT owns and invests in quality income-producing assets primarily used for commercial (including retail and/or office) purpose, located predominantly in Singapore. As the largest proxy for Singapore commercial real estate, CICT's portfolio comprises 22 properties in Singapore and two in Frankfurt, Germany, with a total property value of S$22.4 billion as at 30 June 2020. CICT is managed by CapitaLand Integrated Commercial Trust Management Limited, which is a wholly owned subsidiary of Singapore-listed CapitaLand Limited, one of Asia's largest diversified real estate groups.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "CRPU.SI": {
        "short_name": "Sasseur Reit",
        "long_name": "Sasseur Real Estate Investment Trust",
        "summary": "Sasseur Real Estate Investment Trust invests in a portfolio of real estate and related assets. The company operates through four segments: Chongqing Outlets, Bishan Outlets, Hefei Outlets, and Kunming Outlets. Its property portfolio comprises four retail outlet malls covering a gross floor area of 377,737 square meters located in the People's Republic of China. The company is based in Singapore. Sasseur Real Estate Investment Trust is a subsidiary of Sasseur Cayman Holding II.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "D5IU.SI": {
        "short_name": "Lippo Malls Tr",
        "long_name": "Lippo Malls Indonesia Retail Trust",
        "summary": "LMIR Trust is a Singapore-based real estate investment trust established with the principal investment objective of owning and investing, on a long-term basis, in a diversified portfolio of income-producing real estate in Indonesia that are primarily used for retail and/or retail-related purposes. LMIR Trust's current asset portfolio comprises 21 retail malls (Â\u0093Retail MallsÂ\u0094) and seven retail spaces located within other retail malls (Â\u0093Retail SpacesÂ\u0094, and collectively with the Retail Malls, the Â\u0093PropertiesÂ\u0094). The Properties have a total net lettable area of 839,907 square metres and total valuation of Rp15,716.1 billion as at 31 July 2020, and are strategically located in major cities of Indonesia with large middle-income population. Tenants include leading names such as Matahari Department Store, Zara, M&S, H&M, Sogo, Giant, Hypermart, Carrefour, Ace Hardware, as well as international specialty tenants such as Victoria's Secret, Promod, McDonalds, Pizza Hut, Kentucky Fried Chicken, A&W, Fitness First and Starbucks.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "FRZCF": {
        "short_name": "FRASERS CENTREPOINT TRUST",
        "long_name": "Frasers Centrepoint Trust",
        "summary": "Frasers Centrepoint Trust (Â\u0093FCTÂ\u0094) is a leading developer-sponsored retail real estate investment trust (Â\u0093REITÂ\u0094) and one of the largest suburban retail mall owners in Singapore with total assets of approximately S$6.7 billion. FCT's current property portfolio comprises 11 retail malls9 and an office building located in the suburban regions of Singapore, near homes and within minutes to transportation amenities. The retail portfolio has over 2.3 million square feet of net lettable area with over 1,500 leases with a strong focus on providing for necessity spending, food & beverage and essential services. The portfolio comprises Causeway Point, Northpoint City North Wing (including Yishun 10 Retail Podium), Anchorpoint, YewTee Point, Changi City Point, Waterway Point (40%-interest), Tiong Bahru Plaza, White Sands, Hougang Mall, Century Square and Tampines 1) and an office property (Central Plaza). FCT's malls enjoy stable and recurring shopper footfall supported by commuter traffic and residential population in the catchment. FCT also holds a 31.15% stake in Hektar Real Estate Investment Trust, a retail-focused REIT in Malaysia listed on the Main Market of Bursa Malaysia Securities Berhad. FCT is index constituent of several benchmark indices including the FTSE EPRA/NAREIT Global Real Estate Index Series (Global Developed Index), FTSE ST Real Estate investment Trust Index, MSCI Singapore Small Cap Index and the SGX iEdge S-REIT Leaders Index. Listed on the Main Board of the Singapore Exchange Securities Trading Limited since 5 July 2006, FCT is managed by Frasers Centrepoint Asset Management Ltd., a real estate management company and a wholly-owned subsidiary of Frasers Property Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "J69U.SI": {
        "short_name": "FRASERS CENTREPOINT TRUST",
        "long_name": "Frasers Centrepoint Trust",
        "summary": "Frasers Centrepoint Trust (Â\u0093FCTÂ\u0094) is a leading developer-sponsored retail real estate investment trust (Â\u0093REITÂ\u0094) and one of the largest suburban retail mall owners in Singapore with total assets of approximately S$6.7 billion. FCT's current property portfolio comprises 11 retail malls9 and an office building located in the suburban regions of Singapore, near homes and within minutes to transportation amenities. The retail portfolio has over 2.3 million square feet of net lettable area with over 1,500 leases with a strong focus on providing for necessity spending, food & beverage and essential services. The portfolio comprises Causeway Point, Northpoint City North Wing (including Yishun 10 Retail Podium), Anchorpoint, YewTee Point, Changi City Point, Waterway Point (40%-interest), Tiong Bahru Plaza, White Sands, Hougang Mall, Century Square and Tampines 1) and an office property (Central Plaza). FCT's malls enjoy stable and recurring shopper footfall supported by commuter traffic and residential population in the catchment. FCT also holds a 31.15% stake in Hektar Real Estate Investment Trust, a retail-focused REIT in Malaysia listed on the Main Market of Bursa Malaysia Securities Berhad. FCT is index constituent of several benchmark indices including the FTSE EPRA/NAREIT Global Real Estate Index Series (Global Developed Index), FTSE ST Real Estate investment Trust Index, MSCI Singapore Small Cap Index and the SGX iEdge S-REIT Leaders Index. Listed on the Main Board of the Singapore Exchange Securities Trading Limited since 5 July 2006, FCT is managed by Frasers Centrepoint Asset Management Ltd., a real estate management company and a wholly-owned subsidiary of Frasers Property Limited.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "LPMDF": {
        "short_name": "LIPPO MALLS INDONESIA RETAIL TR",
        "long_name": "Lippo Malls Indonesia Retail Trust",
        "summary": "LMIR Trust is a Singapore-based real estate investment trust established with the principal investment objective of owning and investing, on a long-term basis, in a diversified portfolio of income-producing real estate in Indonesia that are primarily used for retail and/or retail-related purposes. LMIR Trust's current asset portfolio comprises 21 retail malls (Â\u0093Retail MallsÂ\u0094) and seven retail spaces located within other retail malls (Â\u0093Retail SpacesÂ\u0094, and collectively with the Retail Malls, the Â\u0093PropertiesÂ\u0094). The Properties have a total net lettable area of 839,907 square metres and total valuation of Rp15,716.1 billion as at 31 July 2020, and are strategically located in major cities of Indonesia with large middle-income population. Tenants include leading names such as Matahari Department Store, Zara, M&S, H&M, Sogo, Giant, Hypermart, Carrefour, Ace Hardware, as well as international specialty tenants such as Victoria's Secret, Promod, McDonalds, Pizza Hut, Kentucky Fried Chicken, A&W, Fitness First and Starbucks.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "MPCMF": {
        "short_name": "MAPLETREE COMMERCIAL TRUST TREA",
        "long_name": "Mapletree Commercial Trust",
        "summary": "Mapletree Commercial Trust is a Singapore-focused real estate investment trust (Â\u0093REITÂ\u0094) that invests on a long-term basis, directly or indirectly, in a diversified portfolio of income-producing real estate used primarily for office and/or retail purposes, whether wholly or partially, in Singapore, as well as real estate related assets. MCT's portfolio comprises VivoCity, MBC, PSA Building, Mapletree Anson and MLHF. These five assets have a total NLA of 5.0 million square feet with a total value of S$8.7 billion.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "P40U.SI": {
        "short_name": "StarhillGbl Reit",
        "long_name": "Starhill Global Real Estate Investment Trust",
        "summary": "Starhill Global REIT is a Singapore-based real estate investment trust investing primarily in real estate used for retail and office purposes, both in Singapore and overseas. Since its listing on the Mainboard of the Singapore Exchange Securities Trading Limited (the Â\u0093SGX-STÂ\u0094) on 20 September 2005, Starhill Global REIT has grown its initial portfolio from interests in two landmark properties on Orchard Road in Singapore to 10 properties in Singapore, Australia, Malaysia, China, and Japan, valued at about S$2.9 billion. These comprise interests in Wisma Atria and Ngee Ann City on Orchard Road in Singapore, Myer Centre Adelaide, David Jones Building and Plaza Arcade in Adelaide and Perth, Australia, Starhill Gallery and Lot 10 in Kuala Lumpur, Malaysia, a retail property in Chengdu, China, and two properties in Tokyo, Japan. Starhill Global REIT remains focused on sourcing attractive property assets in Singapore and overseas, while driving organic growth from its existing portfolio, through proactive leasing efforts and creative asset enhancements. Starhill Global REIT is managed by an external manager, YTL Starhill Global REIT Management Limited. The Manager is a wholly-owned subsidiary of YTL Starhill Global REIT Management Holdings Pte. Ltd. which is in turn an indirect wholly-owned subsidiary of YTL Corporation Berhad.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "TS0U.SI": {
        "short_name": "OUE Com Reit",
        "long_name": "OUE Commercial Real Estate Investment Trust",
        "summary": "OUE C-REIT is a real estate investment trust listed on the Main Board of Singapore Exchange Securities Trading Limited since 27 January 2014. OUE C-REIT completed the merger with OUE Hospitality Trust in September 2019 to become one of the largest diversified REITs with total assets of S$6.8 billion. With seven properties across the commercial and hospitality segments in Singapore and Shanghai, OUE C-REIT's property portfolio comprises approximately 2.2 million sq ft of prime office and retail space, and 1,640 upscale hotel rooms. OUE C-REIT invests in income-producing real estate used primarily for commercial purposes (including real estate used primarily for office and/or retail purposes) in financial and business hubs, and/or hospitality and/or hospitality-related purposes, as well as real estate-related assets. OUE C-REIT is managed by OUE Commercial REIT Management Pte. Ltd., which is a wholly-owned subsidiary of OUE Limited.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    }
}