{
    "AJBU.SI": {
        "short_name": "Keppel DC Reit",
        "long_name": "Keppel DC REIT",
        "summary": "Listed on 12 December 2014, Keppel DC REIT is the first pure-play data centre REIT listed in Asia and on the Singapore Exchange (SGX-ST). Keppel DC REIT's investment strategy is to principally invest, directly or indirectly, in a diversified portfolio of income-producing real estate assets which are used primarily for data centre purposes, as well as real estate related assets. As at 31 December 2020, its portfolio comprises 19 data centres strategically located in key data centre hubs. With an aggregate lettable area of approximately 2,089,085 sq ft, the portfolio spans 12 cities in eight countries across Asia Pacific and Europe. Keppel Telecommunications & Transportation Ltd (Keppel T&T), the Sponsor of the REIT, has also granted Rights of First Refusal (ROFR) to the REIT for future acquisition opportunities of its data centre assets. The REIT is managed by Keppel DC REIT Management Pte. Ltd.. Keppel Capital Holdings Pte. Ltd. (Keppel Capital) has a 50% interest in the Manager, with the remaining interest held by Keppel T&T. Keppel Capital is a premier asset manager in Asia with assets under management comprising real estate, infrastructure and data centre properties in key global markets. The Manager's key objectives are to provide the REIT's Unitholders with regular and stable distributions, as well as achieve long-term growth while maintaining an optimal capital structure.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "BTOU.SI": {
        "short_name": "ManulifeReit USD",
        "long_name": "Manulife US Real Estate Investment Trust",
        "summary": "Manulife US Real Estate Investment Trust (Â\u0093Manulife US REITÂ\u0094) is the first pure-play U.S. office REIT listed in Asia. It is a Singapore listed REIT established with the investment strategy principally to invest, directly or indirectly, in a portfolio of income-producing office real estate in key markets in the United States (Â\u0093U.S.Â\u0094), as well as real estate-related assets. Manulife US REIT's portfolio comprises nine prime, freehold and Trophy or Class A quality office properties strategically located in California, Atlanta, New Jersey and Washington D.C. Metro Area. The current portfolio valued at US$2.1 billion, has an aggregate Net Lettable Area of 4.7 million sq ft and an occupancy rate of 95.8% as at 31 December 2019.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "K71U.SI": {
        "short_name": "Keppel Reit",
        "long_name": "Keppel REIT",
        "summary": "Listed by way of an introduction on 28 April 2006, Keppel REIT is one of Asia's leading REITs with a portfolio of Grade A commercial assets in key business districts pan-Asia. Keppel REIT's objective is to generate stable income and long-term growth for Unitholders by owning and investing in a portfolio of quality income-producing commercial real estate and real estate-related assets in Singapore and pan-Asia. The REIT has assets under management of over $8 billion in Singapore, key Australian cities of Sydney, Melbourne, Brisbane and Perth, as well as Seoul, South Korea. Keppel REIT is sponsored by Keppel Land Limited, one of Asia's leading property companies. It is managed by Keppel REIT Management Limited, a wholly-owned subsidiary of Keppel Capital Holdings Pte Ltd (Keppel Capital). Keppel Capital is a premier asset manager in Asia with a diversified portfolio in real estate, infrastructure and data centre properties in key global markets.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "KREVF": {
        "short_name": "KEPPEL REIT",
        "long_name": "Keppel REIT",
        "summary": "Listed by way of an introduction on 28 April 2006, Keppel REIT is one of Asia's leading REITs with a portfolio of Grade A commercial assets in key business districts pan-Asia. Keppel REIT's objective is to generate stable income and long-term growth for Unitholders by owning and investing in a portfolio of quality income-producing commercial real estate and real estate-related assets in Singapore and pan-Asia. The REIT has assets under management of over $8 billion in Singapore, key Australian cities of Sydney, Melbourne, Brisbane and Perth, as well as Seoul, South Korea. Keppel REIT is sponsored by Keppel Land Limited, one of Asia's leading property companies. It is managed by Keppel REIT Management Limited, a wholly-owned subsidiary of Keppel Capital Holdings Pte Ltd (Keppel Capital). Keppel Capital is a premier asset manager in Asia with a diversified portfolio in real estate, infrastructure and data centre properties in key global markets.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "MXNU.SI": {
        "short_name": "EliteComREIT GBP",
        "long_name": "Elite Commercial REIT",
        "summary": "Elite Commercial REIT operates as a real estate investment trust. The company primarily invests in commercial assets and real estate-related assets in the United Kingdom. Its investment properties comprise 96 freehold and 1 leasehold offices situated in England, Scotland, and Wales, which are primarily let to the UK Government. The company qualifies as a real estate investment trust for federal income tax purposes. Elite Commercial REIT Management Pte. Ltd. operates as the manager of Elite Commercial REIT. Elite Commercial REIT was founded in 2018 and is based in Singapore.",
        "currency": "GBP",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "OXMU.SI": {
        "short_name": "Prime US ReitUSD",
        "long_name": "Prime US REIT",
        "summary": "Prime US REIT (Â\u0093PRIMEÂ\u0094) is a diversified Singapore real estate investment trust (\"REIT\") with a focus on stabilised income-producing office assets in the United States (\"U.S.\"). PRIME offers investors a unique exposure to a high-quality portfolio of 12 prime and freehold office properties, strategically located in ten primary markets in the U.S., with a total appraised value of US$1.42 billion. With a geographically diversified portfolio of strategically-located prime office assets in key U.S. office markets, PRIME is well-positioned to achieve its key objectives to provide Unitholders with regular and stable distributions through long-term growth in distributions per unit and net asset value per unit growth while maintaining an appropriate capital structure.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "UD1U.SI": {
        "short_name": "IREIT Global",
        "long_name": "IREIT Global",
        "summary": "IREIT Global (Â\u0093IREITÂ\u0094) is the first Singapore-listed real estate investment trust with the investment strategy of principally investing, directly or indirectly, in a portfolio of income-producing real estate in Europe which is used primarily for office, retail and industrial (including logistics) purposes, as well as real estate-related assets. IREIT's portfolio comprises five freehold office properties in Germany and four freehold office properties in Spain, with a total attributable lettable area of c.230,000 sqm and c.4,000 parking spaces. As at 31 December 2019, the portfolio has an occupancy rate of 94.6% and a valuation of Â\u0080630.2 million. IREIT is managed by IREIT Global Group Pte. Ltd., which is jointly owned by Tikehau Capital and City Developments Limited (Â\u0093CDLÂ\u0094). Tikehau Capital is an asset management and investment group listed in France, while CDL is a leading global real estate company listed in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    }
}