{
    "570.SI": {
        "short_name": "Transit Concrete",
        "long_name": "Transit-Mixed Concrete Ltd",
        "summary": "Transit-Mixed Concrete Ltd, an investment holding company, manufactures, supplies, and sells ready-mixed concrete in Singapore and Malaysia. The company operates through three segments: Ready-Mixed Concrete, Concrete Pumping Services, and Waste Management Services. It is also involved in the rental of concrete pumping services; and trading of spare parts, pipes, and accessories of concrete pump business, as well as sells new and used concrete pumping equipment, including concrete placing booms, and mobile and stationary concrete pumps. In addition, the company offers waste management services, such as sewer pipeline inspection services with video camera, as well as sewer pipeline and grease-interceptor cleaning services. Further, it is involved in the provision of batching services; and rental of truck mixers. The company was incorporated in 1979 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "419973",
        "website": "http://www.tmcltd.com.sg",
        "market_cap": 10786574
    },
    "5PO.SI": {
        "short_name": "$ Hiap Tong",
        "long_name": "Hiap Tong Corporation Ltd.",
        "summary": "Hiap Tong Corporation Ltd., together with its subsidiaries, provides hydraulic lifting and haulage services to marine, petrochemical, and construction industries in Singapore and Malaysia. The company operates in two segments, Leasing and Haulage Services, and Port Services. It engages in the rental of rough terrain, mobile tower, all terrain, telescopic crawler, crawler, and mobile truck cranes; and haulage equipment comprising trailers, prime movers, and lorry cranes. The company also provides labor supply for container lashing/unlashing, prime mover driving services, and ancillary works, as well as repair and maintenance services for motor vehicles. The company was founded in 1978 and is based in Singapore. Hiap Tong Corporation Ltd. is a subsidiary of Tembusu Asia Holdings Pte. Ltd.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "628082",
        "website": "http://www.hiaptong.com",
        "market_cap": 19100030
    },
    "BQM.SI": {
        "short_name": "Tiong Woon",
        "long_name": "Tiong Woon Corporation Holding Ltd",
        "summary": "Tiong Woon Corporation Holding Ltd, an investment holding company, provides integrated services for the oil and gas, petrochemical, infrastructure, and construction sectors. The company operates through three segments: Heavy Lift and Haulage, Marine Transportation, and Trading. It offers heavy lift and haulage, marine transportation, and inland transportation services; equipment installation services, such as trays and structures; project engineering services for heavy lifting and haulage requirements; maintenance and repair services; and wall tie installation, foundation anchor, and jacking up services. The company also leases heavy haulage equipment that consists of prime movers, low beds, self-propelled modular trailers, tow trucks, and trailers for the transportation of heavy process equipment, such as modules and structures; supplies various models of tower cranes for sale and rent; and refurbishes, delivers, maintains, jack downs, dismantles, and erects tower cranes. In addition, it provides tug and barge services for various sea transportation projects; and trades in crawler, mobile, and tower cranes. Further, the company sells and hires cranes and transport; manages marine and industrial plant projects; and sells, services, and leases equipment. Additionally, it is involved in providing mechanical and infrastructure engineering, structural work, freight forwarding, and logistics related services. As of June 30, 2020, the company had a fleet of 537 cranes and 287 haulage assets; and 7 tugboats and 9 barges. It operates in Singapore, Brunei, the Middle East, India, Malaysia, Thailand, Indonesia, China, Bangladesh, Myanmar, the Philippines, Sri Lanka, and Vietnam. The company was founded in 1978 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "128470",
        "website": "http://www.tiongwoon.com",
        "market_cap": 107989280
    }
}