{
  "1843.HK": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Restaurants",
    "long_name": "Snack Empire Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SNACK EMPIRE",
    "state": null,
    "summary": "Snack Empire Holdings Limited, a food and beverage company, engages in the wholesale and retail of food and beverages. The company provides Taiwanese snacks and beverages under the Shihlin Taiwan Street Snacks brand. It operates approximately 248 outlets and restaurants in Singapore, Malaysia, Indonesia, and the United States. The company was founded in 2003 and is headquartered in Singapore.",
    "website": "http://snackemp.com",
    "zipcode": "079903"
  },
  "1A0.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Restaurants",
    "long_name": "Katrina Group Ltd.",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "$ Katrina",
    "state": null,
    "summary": "Katrina Group Ltd., an investment holding company, owns and operates restaurants and cafes. The company operates through two segments, Hospitality, and Food and Beverages. It serves Hong Kong, Indonesian, Japanese, Mexican, northern Chinese, Thai, Vietnamese, and Yunnan cuisines. The company also provides online food delivery services; manufactures and distributes foods; and offers domestic household cleaning services. It operates 42 restaurants in Singapore and 2 restaurants in Indonesia under the Bali, Thai, Honguo, So Pho, Streats, Bayang, Hutong, Muchos, RENNthai, and Tomo Izakaya food and beverage brands. The company leases and manages 241 private residences, and 2 apartment buildings comprising 68 apartment units, as well as 4 co-living hotels, including approximately 242 rooms across Singapore and 18 serviced apartments in Hong Kong. Katrina Group Ltd. was founded in 1995 and is based in Singapore.",
    "website": "http://katrinagroup.com",
    "zipcode": "189648"
  },
  "1D0.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Restaurants",
    "long_name": "Kimly Limited",
    "market": "sg_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "$ Kimly",
    "state": null,
    "summary": "Kimly Limited, an investment holding company, operates coffee shops in Singapore. The company operates through three segments: Outlet Management, Food Retail, and Others. The Outlet Management segment engages in the sale of food, beverages, and tobacco products; leasing of food outlet premises to tenants; and provision of cleaning and utilities services to tenants, as well as management services to third party coffee shops. It operates and manages 67 coffee shops and four industrial canteens under the Kimly brand and a third party brand; and three food courts under the foodclique brand. The Food Retail segment is primarily involved in the retail of cooked food directly to consumers through a network of 83 food outlets under the Kimly, foodclique, and a third party brand; and 137 food stalls comprising Mixed Vegetable Rice, Teochew Porridge, Dim Sum, and Seafood Zi Char, as well as 1 Kanaaji Japanese Tonkatsu food stall, two Tonkichi restaurants, and seven Rive Gauche confectionery shops. The Others segment offers management, finance, human resource, treasury, and administrative services. Kimly Limited was founded in 1990 and is headquartered in Singapore.",
    "website": "http://www.kimlygroup.sg",
    "zipcode": "738725"
  },
  "1D3.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Restaurants",
    "long_name": "LifeBrandz Ltd.",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "$ LifeBrandz",
    "state": null,
    "summary": "LifeBrandz Ltd., an investment holding company, engages in the brand development and management, travel, fintech, IT, fund management, and food and beverage businesses in Singapore, Thailand, Japan, and the United States. The company operates through two segments, Lifestyle and Entertainment, and Travel Agency Services. It provides leisure and travel consultancy, and ticketing agency services; and other travel-related services and products, such as travel insurance arrangement, visa applications, and land transfers between airport and accommodation. The company also offers financial institutions white label wealth solutions to automate the process of financial planning, saving, and investing through its digital platform. In addition, it operates a pub and restaurant. The company was founded in 2001 and is based in Singapore.",
    "website": "http://www.lifebrandz.com",
    "zipcode": "048624"
  },
  "1G6.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Restaurants",
    "long_name": "No Signboard Holdings Ltd.",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "$ No Signboard",
    "state": null,
    "summary": "No Signboard Holdings Ltd., an investment holding company, manages and operates food and beverage outlets in Singapore. It operates a chain of restaurants under various F&B brands and concepts, including No Signboard Seafood, Hawker Asian Burger & Buns, Little Sheep Hot Pot, and Mom's Touch Korean Chicken & Burger. The company also produces, promotes, and distributes beer under the Draft Denmark brand, as well as is involved in the wholesale trade of liquor and soft drinks; and distributes various third party brands of beer, as well as operates as an OEM beer supplier for third party brands. In addition, it produces and distributes ready meals through a network of vending machines. The company was founded in 1981 and is based in Singapore. No Signboard Holdings Ltd. is a subsidiary of GuGong Pte. Ltd.",
    "website": "http://www.nosignboardseafood.com",
    "zipcode": "408564"
  },
  "42R.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Restaurants",
    "long_name": "Jumbo Group Limited",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "$ Jumbo",
    "state": null,
    "summary": "Jumbo Group Limited, an investment holding company, operates and manages a network of restaurants in Singapore, the People's Republic of China, Taiwan, and internationally. It operates 39 food and beverages (F&B) outlets under the JUMBO Seafood, NG AH SIO Bak Kut Teh, HACK IT, Chui Huay Lim Teochew Cuisine, Zui Yu Xuan Teochew Cuisine, Chao Ting, Kok Kee Wanton Noodle, Singapore Seafood Republic, and XINYAO Hainanese Chicken Rice restaurant brands in Singapore, Shanghai, Xi'an, Beijing, Fuzhou, Bangkok, Ho Chi Minh, Seoul, Ilsan, Taipei, Taichung, Hsinchu, Taoyuan, Tokyo and Osaka. The company also operates 2 Cha Chaan Teng outlet as a franchisee, as well as manages 1 Singapore Seafood Republic outlet in Singapore. In addition, it sells packaged sauces and spice mixes in its outlets, selected stores, supermarkets, travel agencies, and online through JUMBO eShop and e-commerce stores, as well as offers catering services in Singapore. The company was founded in 1987 and is based in Singapore.",
    "website": "http://www.jumbogroup.sg",
    "zipcode": "417939"
  },
  "596.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Restaurants",
    "long_name": "Pavillon Holdings Ltd.",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Pavillon",
    "state": null,
    "summary": "Pavillon Holdings Ltd., an investment holding company, engages in the restaurant operations in Singapore, the People's Republic of China, and internationally. The company operates through Food and Beverages Operations, Leasing Operations, and Properties Operations segments. It owns 2 self-managed restaurants and 6 franchise restaurants; and operates food stalls. The company also provides leases motor vehicles and equipment. In addition, it is involved in the business development, trading, import, and export of machineries; financial leasing of machineries, tools, and equipment; and provision of asset management, enterprise management, mergers and acquisitions, and financial advisory services. Further, the company offers property management, warehousing, and logistics management services. The company was formerly known as Thai Village Holdings Ltd and changed its name to Pavillon Holdings Ltd. in January 2014. Pavillon Holdings Ltd. was founded in 1991 and is based in Singapore.",
    "website": "http://www.thaivillagerestaurant.com.sg",
    "zipcode": "534409"
  },
  "5DO.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Restaurants",
    "long_name": "Sakae Holdings Ltd.",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Sakae",
    "state": null,
    "summary": "Sakae Holdings Ltd., together with its subsidiaries, operates as a food and beverage company in Singapore, Malaysia, and internationally. The company operates through Sakae Sushi, and Other Products and Services segments. It operates restaurants, kiosks, and cafes primarily under the Sakae Sushi, Sakae Delivery, Sakae Teppanyaki, Sakae Shoppe, Hei Sushi, Hei Delivery, Senjyu, Nouvelle Events & Catering, Sachi, and Crepes & Cream brand names, as well as food delivery services under the Sakae Delivery and Hei Delivery names. The company is also involved in trading, sushi processing, catering, and franchising activities; and provision of cleaning, investment property holding, general wholesale trading, and cold storage warehousing and logistics services activities. In addition, it offers advisory and strategic investor relations services; financial and technological applications and training; and trading of canned and frozen seafood products. The company was formerly known as Apex-Pal International Ltd. and changed its name to Sakae Holdings Ltd. in 2010. Sakae Holdings Ltd. was founded in 1996 and is headquartered in Singapore.",
    "website": "http://www.sakaeholdings.com",
    "zipcode": "534106"
  },
  "5KI.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Restaurants",
    "long_name": "Soup Restaurant Group Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Soup Restaurant",
    "state": null,
    "summary": "Soup Restaurant Group Limited, an investment holding company, operates restaurants. The company operates 19 restaurant outlets in Singapore and Malaysia under Soup Restaurant, CAFE O, and POT LUCK brands, as well as 2 franchised outlets in Indonesia. It also sources, supplies, processes, and distributes raw materials and food products, as well as provides procurement services; and offers job training and vocational rehabilitation services. The company was founded in 1991 and is headquartered in Singapore.",
    "website": "http://www.souprestaurant.com.sg",
    "zipcode": "368324"
  },
  "8527.HK": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Restaurants",
    "long_name": "JLogo Holdings Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "JLOGO HLDGS",
    "state": null,
    "summary": "JLogo Holdings Limited, an investment holding company, owns and operates restaurants in Singapore. The company operates through two segments, The Dining Operations and The Artisanal Bakery. It operates eight restaurants, which include six restaurants under the Central Hong Kong Café brand, one restaurant under the Black Society brand, and one restaurant under the franchised Greyhound Café brand. The company also operates artisanal dimsum café under MASA by Black Society brand. In addition, it operates 21 bakery retail outlets in Malaysia, including 17 are self-operated bakery retail outlets and four are franchised bakery retail outlets under the Bread Story brand. The company's bakery retail outlets sell various breads, pastries, cakes, and flour confectionery products under Bread Story brand. It serves primarily retail customers. The company was founded in 2002 and is headquartered in Singapore.",
    "website": "http://www.jlogoholdings.com",
    "zipcode": "388405"
  },
  "SR6.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Restaurants",
    "long_name": "Soup Restaurant Group Limited",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SOUP RESTAURANT GROUP LTD",
    "state": null,
    "summary": "Soup Restaurant Group Limited, an investment holding company, operates restaurants. The company operates 19 restaurant outlets in Singapore and Malaysia under Soup Restaurant, CAFE O, and POT LUCK brands, as well as 2 franchised outlets in Indonesia. It also sources, supplies, processes, and distributes raw materials and food products, as well as provides procurement services; and offers job training and vocational rehabilitation services. The company was founded in 1991 and is headquartered in Singapore.",
    "website": "http://www.souprestaurant.com.sg",
    "zipcode": "368324"
  },
  "VL6.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Restaurants",
    "long_name": "Koufu Group Limited",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Koufu",
    "state": null,
    "summary": "Koufu Group Limited, an investment holding company, manages and operates food courts and coffee shops in Singapore and Macau. The company operates in two segments, Outlet & Mall Management and Food and Beverages (F&B) Retail. The Outlet & Mall Management segment operates and/or manages food courts, coffee shops, and a hawker center and a commercial mall. As of December 31, 2019, it operated 50 food courts, including two food courts in Macau, as well as 16 coffee shops, a hawker center, and a commercial mall in Singapore. The F&B Retail segment operates 76 self-operated F&B stalls, including four F&B stalls in Macau; 29 F&B kiosks comprising one in Macau and one in Malaysia; and 7 quick-service and 4 full-service restaurants. The company operates food courts under the Koufu, Rasapura Masters, Cookhouse by Koufu, Fork & Spoon, and Gourmet Paradise brands; coffee shops under the Happy Hawkers, R&B Tea, and 1983-A Taste Of Nanyang brands; full service restaurants under the Elemen brand; quick service restaurants under the Grove, 1983-Coffee & Toast, and Supertea brands; and commercial mall under the Punggol Plaza brand. It also processes food products; leases intangible assets; and engages in letting and operating coffee shops. The company was founded in 2002 and is based in Singapore. Koufu Group Limited is a subsidiary of Jun Yuan Holdings Pte Ltd.",
    "website": "http://www.koufu.com.sg",
    "zipcode": "738443"
  }
}
