{
    "42N.SI": {
        "short_name": "$ IPS Securex",
        "long_name": "IPS Securex Holdings Limited",
        "summary": "IPS Securex Holdings Limited, through its subsidiaries, provides security products and integrated security solutions to commercial entities, and government bodies and agencies. The company operates in two segments, Security Solutions Business, and Maintenance and Leasing Business. It designs, supplies, installs, tests, commissions, maintains, and leases security products and integrated security solutions to address various security requirements, including checkpoint security, law enforcement, and the protection and surveillance of buildings and critical infrastructure. The company's homeland security products include acoustic hailing systems, cargo scanning systems, CBRNE equipment and solutions, non-lethal countermeasure systems, surveillance radar systems, and vehicle inspection systems. Its general security products comprise access control solutions that prevent unauthorized access and restrict access to sensitive areas; video monitoring solutions for investigation and deterrence of incidents that cause harm, loss, and damage; and mass notification products for public announcement and to evacuate people in emergency situations, as well as other enhancements, such as background music and hearing assistive technology for the hearing impaired. The company also provides customer, maintenance, project management, repair, consultancy, and training services, as well as spare parts. It has operations in Singapore, China, Hong Kong, South Korea, Myanmar, Laos, Cambodia, Philippines, Timor Leste, Thailand, Vietnam, Indonesia, Brunei, Malaysia, and internationally. IPS Securex Holdings Limited was founded in 1986 and is based in Singapore. IPS Securex Holdings Limited is a subsidiary of IPS Technologies Pte. Ltd.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "159553",
        "website": "http://www.ips-securex.com",
        "full_time_employees": 49
    },
    "43B.SI": {
        "short_name": "$ Secura",
        "long_name": "Secura Group Limited",
        "summary": "Secura Group Limited, an investment holding company, provides an integrated suite of security products, services, and solutions in Singapore, the Philippines, and internationally. It operates through Security Printing; Security Guarding; Cyber Security; Homeland Security and Digital Forensic; and System Integration, Security Consultancy and Security Training segments. The company offers cyber security consultancy, products, and services; security courses; corporate/event security guarding services for heads of states and VIPs; and unarmed and manned security guarding services for commercial premises, data centers, embassies, hotels, schools, hospitals, government buildings, industrial premises, and residential properties. It also provides security printing services for various valued documents, including cheques, licenses, statements, computerized and pressure seal forms, and stationery; risk assessment, tender management, and project management solutions to customers in private and public sectors; homeland security and digital forensic services; integrated command center services; and systems integration and training services. In addition, the company offers private investigation services; distributes homeland security products; and provides data, eStatement, eArchiving, security data processing, printing, and stationery services. It serves customers in various industries, including multinational corporations, government agencies, financial institutions, and small and medium enterprises. The company was incorporated in 2015 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "119932",
        "website": "http://www.securagroup.com.sg",
        "full_time_employees": null
    },
    "XVG.SI": {
        "short_name": "$ Aedge Group",
        "long_name": "Aedge Group Limited",
        "summary": "Aedge Group Limited provides engineering, security and manpower, and transport services. Aedge Group Limited was formerly known as Aedge Group Pte. Ltd. The company was incorporated in 2019 and is based in Singapore, Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "569738",
        "website": "http://www.aedge.com.sg",
        "full_time_employees": 534
    }
}