{
    "558.SI": {
        "short_name": "UMS",
        "long_name": "UMS Holdings Limited",
        "summary": "UMS Holdings Limited, an investment holding company, provides high precision front-end semiconductor components, and electromechanical assembly and final testing services. It operates in two segments, Semiconductor and Others. The Semiconductor segment offers precision machining components and equipment modules for semiconductor equipment manufacturers. The Others segment provides water disinfection systems shipment services; and supplies base components to oil and gas original equipment manufacturers, as well as trades in nonferrous metal alloys. The company also offers precision machining services, including milling, lathe, horizontal, cleaning, anodizing, and CMM; metal finishing services, such as electroless and selective nickel, anodizing, plating, e-polish, chemical cleaning, and parts refurbishment; and system integration, refurbishment, prototyping, and vendor managed inventory services, as well as electroplating services. In addition, it is involved in the assembly and integration of equipment and automated assembly lines; manufacture and assembly of stainless steel gaslines and weldment products; manufacture and repair of waste water treatment equipment; and holding of investment properties. The company serves semiconductor, electronic, machine tools, aerospace, and oil and gas industries. It operates in Singapore, Malaysia, Taiwan, the United States, South Korea, the People's Republic of China, and internationally. UMS Holdings Limited was incorporated in 2001 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "575.SI": {
        "short_name": "ASTI^",
        "long_name": "ASTI Holdings Limited",
        "summary": "ASTI Holdings Limited, an investment holding company, engages in the provision of semiconductor manufacturing services for surface mount technology components in Singapore, China, Malaysia, the Philippines, the United Kingdom, and internationally. It operates in two segments, Back-end Equipment Solutions and Technologies, and Distribution and Services. The company provides tape and reel packaging, and integrated circuit programming services to original equipment manufacturers, contract manufacturers, and component distributors. It also offers solutions and technologies in the back-end, including assembly, test, and finishing activities; and semiconductor application in consumer electronics, computer peripheral, and communication solutions. In addition, the company manufactures and distributes carrier tapes and plastic reels; and develops chip packaging and related technologies. Further, it offers equipment contract manufacturing services comprising turnkey manufacturing, assembly, and machining services for the semiconductor, medical, scientific, and precision tooling industries; trades in electronic components and computer peripherals, equipment, and materials; and acts as a commission agent, as well as engages in the property investment activities. Additionally, the company is involved in the construction of antique wooden sea boats, communication of culture, exhibition, conference activities, etc.; and development and management of a mixed-use property. ASTI Holdings Limited was incorporated in 1999 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "AWX.SI": {
        "short_name": "AEM",
        "long_name": "AEM Holdings Ltd",
        "summary": "AEM Holdings Ltd provides intelligent system testing and handling solutions for semiconductor and electronics companies Asia, North America, Europe, the Middle East, and Central America. It operates through Equipment Systems Solutions, System Level Test & Inspection, Micro-Electro-Mechanical Systems, and Test and Measurement Solutions segments. The company offers handling and test equipment; engineering and design services; field support services; and supplies, consumables, maintenance services, upgrade kits, and upgrade engineering for handlers. It also provides automatic measurement and test solutions for communications; and specialized wafer probers that enable the testing for sensors and semiconductors for the automotive, industrial, and consumer sectors. AEM Holdings Ltd is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "BIX.SI": {
        "short_name": "Ellipsiz",
        "long_name": "Ellipsiz Ltd",
        "summary": "Ellipsiz Ltd, an investment holding company, distributes various manufacturing, testing, and inspection/measurement equipment to the semiconductor, electronics manufacturing, and telecommunication industries. The company's Distribution and Services Solutions segment distributes equipment and tools for semiconductor and electronics manufacturing, integrated circuit (IC) failure analysis, IC reliability testing, and printed circuit board assembly testing and inspection services; and provides equipment maintenance support engineering services, including systems integration to the semiconductor and electronics manufacturing services industry. This segment also provides facilities management services, such as chemicals, gas and abatement management, and turnkey wafer fabrication equipment relocation; and trades in consumable products for hospital, pharmaceutical, electronic, and food processing industries. Its Automated Precision System Solutions segment offers customized systems and solutions for test automation; high precision automated assembly process for fiber and lens; and automated wafer level testing in the semiconductor and electronics manufacturing environment. The company's Vending Solutions segment distributes and provides retail solutions through intelligent automated retail machines. Its Property Investment and Development segment invests in and develops properties. The company also offers solutions for in-circuit and functional testing; sells and markets scientific and industrial products; engineering services; and related technical and support services. It operates in Singapore, Malaysia, China, Taiwan, Indonesia, and internationally. The company was formerly known as SingaTrust Ltd. and changed its name to Ellipsiz Ltd in 2001. Ellipsiz Ltd was founded in 1992 and is headquartered in Singapore. Ellipsiz Ltd is a subsidiary of Bevrian Pte. Ltd.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "KLIC": {
        "short_name": "Kulicke and Soffa Industries, I",
        "long_name": "Kulicke and Soffa Industries, Inc.",
        "summary": "Kulicke and Soffa Industries, Inc. designs, manufactures, and sells capital equipment and tools to assemble semiconductor devices. It operates in two segments, Capital Equipment, and Aftermarket Products and Services (APS). The Capital Equipment segment manufactures and sells ball and wedge bonders, and advanced packaging and electronic assembly solutions. The APS segment manufactures and sells dicing blades, capillaries, and bonding wedges. The company also services, maintains, repairs, and upgrades equipment. It serves semiconductor device manufacturers, integrated device manufacturers, outsourced semiconductor assembly and test providers, other electronics manufacturers, industrial manufacturers, and automotive electronics suppliers primarily in the United States and the Asia/Pacific region. Kulicke and Soffa Industries, Inc. was founded in 1951 and is headquartered in Singapore.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "KU1.F": {
        "short_name": "KULICKE + SOFFA IND.",
        "long_name": "Kulicke and Soffa Industries, Inc.",
        "summary": "Kulicke and Soffa Industries, Inc. designs, manufactures, and sells capital equipment and tools to assemble semiconductor devices. It operates in two segments, Capital Equipment, and Aftermarket Products and Services (APS). The Capital Equipment segment manufactures and sells ball and wedge bonders, and advanced packaging and electronic assembly solutions. The APS segment manufactures and sells dicing blades, capillaries, and bonding wedges. The company also services, maintains, repairs, and upgrades equipment. It serves semiconductor device manufacturers, integrated device manufacturers, outsourced semiconductor assembly and test providers, other electronics manufacturers, industrial manufacturers, and automotive electronics suppliers primarily in the United States and the Asia/Pacific region. Kulicke and Soffa Industries, Inc. was founded in 1951 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "M11.SI": {
        "short_name": "MFG Integration",
        "long_name": "Manufacturing Integration Technology Ltd",
        "summary": "Manufacturing Integration Technology Ltd, an investment holding company, designs, develops, manufactures, and distributes automated equipment for semiconductor and other industries in Singapore, China, Europe, the United States, and other countries in Asia. The company operates through Built-To-Print and Customised Automation segments. It also offers contract equipment manufacturing services; manufactures and repairs lifting and handling equipment; and components for electronic and semiconductor industries. The company was founded in 1989 and is headquartered in Singapore. Manufacturing Integration Technology Ltd is a subsidiary of MIT Technologies Pte Ltd.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "MCRNF": {
        "short_name": "MICRO MECHANICS(HOLDINGS)",
        "long_name": "Micro-Mechanics (Holdings) Ltd.",
        "summary": "Micro-Mechanics (Holdings) Ltd. designs, manufactures, and markets high precision parts and tools used in applications for the wafer-fabrication and assembly processes of the semiconductor industry. The company operates through five segments: Singapore, Malaysia, The Philippines, USA, and China. It offers die attach - pick-up products, such as rubber tips, high-temp plastic tools, tungsten carbide tools, sensor assemblies, and vacuum wand tools; die attach - dispensing products, including dispense nozzle adaptors, dispense nozzles, pen dispense assemblies, writing pen nozzle tips, and epoxy stamping tools; and die attach - die ejection products comprising ejector needles, needle holders/pepper pots, and needle holder seals. The company also provides thermosonic bonding products that include clamps and electronic flame off products; ultrasonic bonding products comprising clamps, bearing base assemblies, anvils, and wire cutters; and encapsulation products consisting of BGA dispensing nozzles, dispensing manifolds, pump screws, and O-rings. In addition, it manufactures precision parts and assemblies on a contract basis for OEMs. Micro-Mechanics (Holdings) Ltd. was founded in 1983 and is based in Singapore.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "N8U.SG": {
        "short_name": "UMS Holdings Ltd. Registered Sh",
        "long_name": "UMS Holdings Limited",
        "summary": "UMS Holdings Limited, an investment holding company, provides high precision front-end semiconductor components, and electromechanical assembly and final testing services. It operates in two segments, Semiconductor and Others. The Semiconductor segment offers precision machining components and equipment modules for semiconductor equipment manufacturers. The Others segment provides water disinfection systems shipment services; and supplies base components to oil and gas original equipment manufacturers, as well as trades in nonferrous metal alloys. The company also offers precision machining services, including milling, lathe, horizontal, cleaning, anodizing, and CMM; metal finishing services, such as electroless and selective nickel, anodizing, plating, e-polish, chemical cleaning, and parts refurbishment; and system integration, refurbishment, prototyping, and vendor managed inventory services, as well as electroplating services. In addition, it is involved in the assembly and integration of equipment and automated assembly lines; manufacture and assembly of stainless steel gaslines and weldment products; manufacture and repair of waste water treatment equipment; and holding of investment properties. The company serves semiconductor, electronic, machine tools, aerospace, and oil and gas industries. It operates in Singapore, Malaysia, Taiwan, the United States, South Korea, the People's Republic of China, and internationally. UMS Holdings Limited was incorporated in 2001 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    }
}