{
    "BKY.SI": {
        "short_name": "Avi-Tech",
        "long_name": "Avi-Tech Electronics Limited",
        "summary": "Avi-Tech Electronics Limited provides burn-in, manufacturing and printed circuit board assembly, and engineering services for the semiconductor, electronics, life sciences, aviation, and other industries. It operates through three divisions: Burn-In and Related Services, Burn-In Boards and Boards Related Products, and Engineering Services and Equipment Distribution. The Burn-In and Related Services division offers static burn-in, dynamic burn-in, test during burn-in, and high power burn-in services for semiconductor manufacturers, as well as tape and reel services. The Burn-In Boards and Boards Related Products division designs and manufactures a range of burn-in boards for various types of burn-in systems; and boards for other types of reliability tests, such as high temperature operating life tests and highly accelerated stress tests. It also provides printed circuit board assembly services for industries ranging from medical, mobile communications, and aviation. The Engineering Services and Equipment Distribution division is involved in the design, development, full turnkey outsourced manufacturing, and system integration of semiconductor equipment and lab automation systems for the life sciences and biotech industries. It also provides technical services, as well as distributes third party products. The company also markets and sells burn-in boards; and trades in imaging equipment and energy efficient products, as well as engages in business support activities. It serves customers in Singapore, the United States, Malaysia, Germany, the Philippines, Thailand, Taiwan, and China. The company was incorporated in 1981 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "JLB.SI": {
        "short_name": "$ Grand Venture",
        "long_name": "Grand Venture Technology Limited",
        "summary": "Grand Venture Technology Limited manufactures precision machining and sheet metal components and modules in Singapore, Malaysia, the United States, China, and internationally. The company operates through two segments, Life sciences, electronics and others; and Semiconductor. The Life sciences, electronics and others segment is involved in manufacturing of components of mass spectrometers and liquid chromatography instruments used for various laboratories testing and pharmaceutical applications, as well as the assembly of modules. The Semiconductor segment manufactures electrical components and devices, such as transistors and diodes. The company offers precision machining services, such as metals, engineering plastics, ceramic, quartz, and sub-micron machining, as well as manufactures vacuum parts; sheet metal fabrication, including cutting/laser cutting, CNC bending, CNC turret punching, welding and robotic magnesium inert gas welding, and wet painting/powder coating. It also provides modular, electromechanical, mechatronics, and cleanroom assemblies, as well as testing services. The company serves semiconductor, electronics, analytical life sciences, medical and industrial automation industries. Grand Venture Technology Limited was founded in 2012 and is headquartered in Singapore. Grand Venture Technology Limited is a subsidiary of Metalbank Singapore Pte. Ltd.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "S71.SI": {
        "short_name": "Sunright",
        "long_name": "Sunright Limited",
        "summary": "Sunright Limited, an investment holding company, provides burn-in, testing, and electronic manufacturing services to semiconductor and electronics manufacturers in Singapore, Malaysia, China, Taiwan, Hong Kong, India, the Philippines, Thailand, Vietnam, the United States, and internationally. The company offers burn-in services for a range of integrated circuits, such as memories, micro-controllers, microprocessors, digital signal processors, etc., as well as turnkey services, including wafer sort, test, burn-in, mark, scan, and drop ship. It also provides testing services; manufactures parallel test/burn-in boards, test interface board assemblies, and probe cards; and designs, develops, and delivers hardware and software products for burn-in parallel tests comprising parallel test burn-in systems, and handling and storage products. In addition, the company offers design, engineering, and manufacturing services for electronic products to aerospace, automotive, computing, consumers' electronics, industrial, medical, and mobile OEM customers. Further, it assembles electronic and electrical components; provides research and development services for burn-in and test related activities; and trades in and distributes high-technology electronic products. The company was founded in 1978 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    }
}