{
    "8353.HK": {
        "short_name": "ANACLE",
        "long_name": "Anacle Systems Limited",
        "summary": "Anacle Systems Limited engages in the software development, and provision of enterprise application software and energy management solutions in Singapore, Malaysia, the People's Republic of China, and internationally. It operates through three segments: Simplicity and myBill; Starlight; and SpaceMonster. The Simplicity and myBill segment include a package of enterprise application software solutions, which provides specific solutions for enterprise asset management, shared resources management, tenancy management, financial management, supply chain management, customer relationship management, and billing management. The Starlight segment provides cloud-based energy management solutions to the energy profiles of buildings, including energy consumption, power quality, energy analytics, and carbon footprint profiles information. The SpaceMonster segment operates as an online venue booking platform. The company also offers support and maintenance services; and researches, designs, develops, and supervises the manufacturing and assembly process of hardware products. It serves aerospace, defense, education, environment, healthcare, real estate, and utility industries. Anacle Systems Limited was founded in 2006 and is headquartered in Singapore.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "AIY.SI": {
        "short_name": "IFAST",
        "long_name": "iFAST Corporation Ltd.",
        "summary": "iFAST Corporation Ltd. provides investment products and services in Singapore, Hong Kong, Malaysia, and China. The company operates through Business-to-Business (B2B), Business-to-Consumer (B2C), and Business-to-Business-to-Consumer (B2B2C) divisions. The B2B division operates iFAST Central that includes a range of services, including investment administration and transactions services, research and trainings, IT services, and backroom functions to banks, financial advisory firms, and financial institutions. It also operates iFAST Global Prestige, an investment platform designed to meet the requirements of high net worth individuals, as well as the wealth advisers servicing them; and iFAST Pensions that delivers tax-effective employee benefit solutions to multinational companies and its employees comprising expatriates, as well as assists companies to administer pension schemes for its employees through an Internet platform. In addition, this division operates iFAST Global Markets that provides investors with transparent adviser-assisted wealth management plans. The B2C division offers a distribution and transactional platform for investors through its Fundsupermart.com Website that offers a range of investment products, transparent fees structure, tools to compare investments, customer services support, and research advice. The B2B2C division provides fintech solutions to institutional clients to develop and enhance its capabilities. The company also operates bondsupermart.com, a regional bond information portal that provides bond information and research for investors and wealth advisers. iFAST Corporation Ltd. was incorporated in 2000 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "DSE.AX": {
        "short_name": "DROPSUITE FPO",
        "long_name": "Dropsuite Limited",
        "summary": "Dropsuite Limited operates a cloud based software platform worldwide. The company offers Dropsuite Website Backup, a cloud-based website, database backup, and monitoring service that allows website owners to securely backup, recover, monitor, and protect their website data; Dropsuite Email Backup, a cloud-based solution that automatically protects and recovers all business critical email data; Dropsuite Email Archiving, a cloud-based email archiving solution to store, safeguard, manage, and discover data from email systems; and Dropsuite for Office 365, a backup and archiving solution. It also provides Reseller Provisioning Platform, which allows reseller partners to add, suspend, modify, and unsubscribe users manually from the reseller portal. The company serves financial services, government, healthcare, law firms, and manufacturing industries. The company was incorporated in 1983 and is headquartered in Singapore.",
        "currency": "AUD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "NAHD": {
        "short_name": "NEW ASIA HOLDINGS INC",
        "long_name": "New Asia Holdings, Inc.",
        "summary": "New Asia Holdings, Inc. develops and provides neural trading models for the financial community. The company offers algorithm trading software solutions to clients on the basis of Software as a Service licensing and delivery models with licensed users availing themselves of service-based contractual arrangements. It serves broker-dealers, banks, funds, and other clients. The company was formerly known as DM Products, Inc. and changed its name to New Asia Holdings, Inc. in January 2015. New Asia Holdings, Inc. was incorporated in 2001 and is headquartered in Singapore.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    }
}