{
    "543.SI": {
        "short_name": "Noel Gifts Intl",
        "long_name": "Noel Gifts International Ltd",
        "summary": "Noel Gifts International Ltd provides hampers, flowers, and gifts in Singapore and Malaysia. The company operates in two segments, Gifts and Properties. It operates a franchise program that provides franchisees the right to use the company's name. The company also engages in creative gift designs; and markets, sells, operates, and purchases strategies and systems. In addition, it invests in and develops properties. Noel Gifts International Ltd offers its products through its retail outlets and online. The company was formerly known as Noel Hampers and Gifts Pte Ltd and changed its name to Noel Gifts International Ltd in 1993. Noel Gifts International Ltd was founded in 1975 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "5SO.SI": {
        "short_name": "Duty Free Intl",
        "long_name": "Duty Free International Limited",
        "summary": "Duty Free International Limited, an investment holding company, trades in duty free merchandise under the Zon brand in Malaysia. The company wholesales, distributes, and retails duty free and non-dutiable merchandise, including imported duty free beverages, tobacco products, chocolates and confectionary products, perfumes, cosmetics, and souvenirs. It operates approximately 40 outlets comprising duty-free retail outlets and duty paid retail outlets located at various locations in airports, seaports, ferry terminals, border towns, and tourist destinations. The company is also involved in the development of resorts; property investment and management activities; cultivation of oil palms; and sale of fresh oil palm fruit bunches. The company was founded in 1978 and is based in Singapore. Duty Free International Limited is a subsidiary of Atlan Holdings Bhd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "5WJ.SI": {
        "short_name": "$ MoneyMax Fin",
        "long_name": "MoneyMax Financial Services Ltd.",
        "summary": "MoneyMax Financial Services Ltd., an investment holding company, engages in the pawnbroking, retailing, and trading of new and pre-owned jewellery, luxury bags, and timepieces. The company operates through two segments, Pawnbroking, and Retail and Trading of Pre-Owned Luxury Items. It also operates MoneyMax Online, an online platform to shop, sell, and appraise valuables. In addition, the company provides finance leasing, automotive financing, and refurbishment and repair services, as well as insurance agency services. It operates a network of 71 outlets in Singapore and Malaysia. The company was founded in 2008 and is headquartered in Singapore. MoneyMax Financial Services Ltd. is a subsidiary of Money Farm Pte. Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "AWI.SI": {
        "short_name": "Thakral",
        "long_name": "Thakral Corporation Ltd",
        "summary": "Thakral Corporation Ltd, an investment holding company, markets and distributes beauty, wellness, and lifestyle products. It operates through two divisions, Lifestyle Division and Investment Division. The company's Lifestyle division distributes beauty, wellness, and lifestyle products in Hong Kong, India, Indonesia, the Philippines, Singapore, and Thailand. It distributes products of at-home beauty and wellness device brands comprising Panasonic, DermaWand, Philips, T3, and Slendertone; skin and hair care products under the John Masters Organics brand; fragrance under the Maison Margiela, Ralph Lauren, Diesel, and Cacharel brands; and lifestyle brands, such as DJI. The company's Investments division is involved in real estate and property investments in Australia, Japan, and Singapore. It invests in real estate and other investment opportunities, which include property-backed financial instruments. This division also engages in the origination, packaging, and managing investment projects; and development and management of retirement living resorts under the GemLife brand. It is also involved in the property development activities. The company was incorporated in 1993 and is based in Singapore. Thakral Corporation Ltd is a subsidiary of Prime Trade Enterprises Limited.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "THK1.F": {
        "short_name": "THAKRAL CORP. LTD",
        "long_name": "Thakral Corporation Ltd",
        "summary": "Thakral Corporation Ltd, an investment holding company, markets and distributes beauty, wellness, and lifestyle products. It operates through two divisions, Lifestyle Division and Investment Division. The company's Lifestyle division distributes beauty, wellness, and lifestyle products in Hong Kong, India, Indonesia, the Philippines, Singapore, and Thailand. It distributes products of at-home beauty and wellness device brands comprising Panasonic, DermaWand, Philips, T3, and Slendertone; skin and hair care products under the John Masters Organics brand; fragrance under the Maison Margiela, Ralph Lauren, Diesel, and Cacharel brands; and lifestyle brands, such as DJI. The company's Investments division is involved in real estate and property investments in Australia, Japan, and Singapore. It invests in real estate and other investment opportunities, which include property-backed financial instruments. This division also engages in the origination, packaging, and managing investment projects; and development and management of retirement living resorts under the GemLife brand. It is also involved in the property development activities. The company was incorporated in 1993 and is based in Singapore. Thakral Corporation Ltd is a subsidiary of Prime Trade Enterprises Limited.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "Y45.SI": {
        "short_name": "SingMyanmar^",
        "long_name": "Singapore Myanmar Investco Limited",
        "summary": "Singapore Myanmar Investco Limited operates as an investment and management company primarily in Myanmar. The company engages in the travel and fashion retail, auto services, food and beverage, logistics and warehouse services, construction services, and serviced offices businesses. It distributes heavy equipment and spare parts; retail of fashion, lifestyle, and travel products; and provides car rental and limousine services. The company is also involved in the operation of food and beverage outlets, including restaurants, and coffee and tea stores; distribution of food and beverage items, wine, syrup, and water; provision of trucking, warehousing, and cold storage facility services; and equipment rental, vehicle repair, and fleet management activities. In addition, it offers infrastructure engineering, management consultancy, and consultancy and advertising services for the food and beverage industry. The company was formerly known as Singapore Windsor Holdings Limited and changed its name to Singapore Myanmar Investco Limited in July 2015. The company was founded in 1986 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    }
}