{
    "5DS.SI": {
        "short_name": "$ MegaChem",
        "long_name": "Megachem Limited",
        "summary": "Megachem Limited trades in chemicals and chemical-related products in Singapore, Malaysia, Indonesia, the United Kingdom, China, Vietnam, the Philippines, the Middle East, India, and Australia. It distributes performance coatings and polymers; advanced polymer composites; and surface technology, biotech, oil and gas, mining, and lifestyle chemicals. The company also engages in mixing and blending of chemicals according to customers' formulations. Its chemical contract manufacturing services include liquid and solid blending, and repacking services, as well as packaging and relabeling, raw material supply, used drums/tanks washing, lab analysis, and containers stuffing/unstuffing services. The company was founded in 1988 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "638588",
        "website": "http://www.megachem.com",
        "market_cap": "Small Cap"
    },
    "BFT.SI": {
        "short_name": "Fabchem China^",
        "long_name": "Fabchem China Limited",
        "summary": "Fabchem China Limited, an investment holding company, manufactures and sells commercial explosive products. It operates through Explosives Devices, Industrial Fuse and Initiating Explosives Devices, and Industrial Detonators segments. The Explosives Devices segment provides boosters to enhance the power of explosions, and oil and gas exploration activities. The Industrial Fuse and Initiating Explosive Devices segment offers detonating cords and non-electric tubes. The Industrial Detonators segment provides non-electric detonators and piston non-electric detonators that are used in methane-free and mine dust-free explosion projects, detonation projects in the mining industry, the excavation of alleys and tunnels, controlled explosions, and underwater demolitions. The company is also involved in the properties holding and management activities, and provision of safety advisory services. It sells its products to customers in the mining, energy exploration and infrastructure construction industries, such as coal mining, hydroelectric construction, oil exploration, road and railway construction and large construction under the Yinguang brand in the People's Republic of China, Australia, Kyrgyzstan, Mongolia, India, Kazakhstan, and Indonesia. The company was founded in 1979 and is based in Singapore. Fabchem China Limited is a subsidiary of Triple Vision Pte. Ltd.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "159835",
        "website": "http://www.fabchemchina.com",
        "market_cap": "Small Cap"
    },
    "CHMN.F": {
        "short_name": "CHINA SUNSINE HLDGS P.S.",
        "long_name": "China Sunsine Chemical Holdings Ltd.",
        "summary": "China Sunsine Chemical Holdings Ltd., an investment holding company, manufactures and sells rubber chemicals in the People's Republic of China, rest of Asia, the United States, Europe, and internationally. The company operates through three segments: Manufacturing and Sale of Rubber Chemicals; Production and Supply of Heating Power; and Waste Treatment. It offers rubber accelerators, anti-oxidant agents, anti-scorching agents, insoluble sulphur used for the production of tires, and other rubber related products, such as tubes, belts, shoes, rollers, cables, seals, latex products, and other light-color rubber products. The company provides its products under the Sunsine brand name. It is also involved in the production and supply of heating power; and hotel and restaurant business. The company primarily serves the tire companies. China Sunsine Chemical Holdings Ltd. was incorporated in 2006 and is based in Singapore. China Sunsine Chemical Holdings Ltd. is a subsidiary of Success More Group Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068902",
        "website": "http://www.chinasunsine.com",
        "market_cap": "Small Cap"
    },
    "M15.SI": {
        "short_name": "$ Matex Intl",
        "long_name": "Matex International Limited",
        "summary": "Matex International Limited engages in the formulation, manufacture, and sale of specialty chemicals worldwide. The company offers dyestuffs, auxiliaries, textile chemicals, optical brighteners, and color measurement and computer aided systems. It is also involved in the import, export, and wholesale of garments, textile products, and chemical products. The company serves textile, paper, leather, detergent, and polymer industries. Matex International Limited was founded in 1989 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "139947",
        "website": "http://www.matex.com.sg",
        "market_cap": "Small Cap"
    },
    "QES.SI": {
        "short_name": "ChinaSunsine",
        "long_name": "China Sunsine Chemical Holdings Ltd.",
        "summary": "China Sunsine Chemical Holdings Ltd., an investment holding company, manufactures and sells rubber chemicals in the People's Republic of China, rest of Asia, the United States, Europe, and internationally. The company operates through three segments: Manufacturing and Sale of Rubber Chemicals; Production and Supply of Heating Power; and Waste Treatment. It offers rubber accelerators, anti-oxidant agents, anti-scorching agents, insoluble sulphur used for the production of tires, and other rubber related products, such as tubes, belts, shoes, rollers, cables, seals, latex products, and other light-color rubber products. The company provides its products under the Sunsine brand name. It is also involved in the production and supply of heating power; and hotel and restaurant business. The company primarily serves the tire companies. China Sunsine Chemical Holdings Ltd. was incorporated in 2006 and is based in Singapore. China Sunsine Chemical Holdings Ltd. is a subsidiary of Success More Group Limited.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068902",
        "website": "http://www.chinasunsine.com",
        "market_cap": "Small Cap"
    }
}