{
    "3302.HK": {
        "short_name": "KINERGY",
        "long_name": "Kinergy Corporation Ltd.",
        "summary": "Kinergy Corporation Ltd., together with its subsidiaries, provides contract manufacturing, design, engineering, and assembly services for the electronics industry in Singapore, the Philippines, the United States, the People's Republic of China, Japan, and internationally. It operates through two segments, Electronics Manufacturing Services (EMS) and Original Design Manufacturing (ODM). The EMS segment manufactures and sells sub-systems, such as work-holders, sliders, and magazine handlers; complete machines, including dicing machines, lapping machines, lifters, and polishing machines; and mechanical components for semiconductor processing equipment industry, as well as provides maintenance and commissioning services. The ODM segment designs, develops, manufactures, and sells automated equipment, such as auto frame loader, auto-buffing equipment, and strip laser markers; precision tools, such as encapsulation moulds and dies; and spare parts. It offers its products under the Kinergy brand. The company is also involved in marketing and logistics business; and the procurement of materials. The company was formerly known as Kinergy Ltd and changed its name to Kinergy Corporation Ltd. in December 2013. Kinergy Corporation Ltd. was founded in 1988 and is headquartered in Singapore.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "498789",
        "website": "http://www.kinergy.com.sg",
        "full_time_employees": 535
    },
    "42Z.SI": {
        "short_name": "$ Eindec",
        "long_name": "Eindec Corporation Limited",
        "summary": "Eindec Corporation Limited, an investment holding company, manufactures and distributes clean air environmental technology solutions for residential, commercial, and industrial customers in Singapore, China, Malaysia, and internationally. The company operates through four segments: Clean Room Equipment, Heating Ventilation and Air-Conditioning Products, Air Purification Equipment, and Others. The Clean Room Equipment segment offers fan filter units, air showers, clean booths, pass boxes, clean hand dryers, clean benches, and others. It also provides value-added design services and customized cleanroom equipment. The Heating Ventilation and Air-Conditioning Products segment provides dampers, deflection grilles, and air diffusers to regulate the airflow within a confined space in commercial, residential, and industrial buildings, as well as in offshore platforms and vessels. The Air Purification Equipment segment designs, manufactures, and sells air purifiers, and fresh air purification and ventilation systems, which remove solid and gaseous pollutants from the air. The Others segment offers cooling towers. The company also provides technology consultation and services; and after-sales services. In addition, it engages in the wholesale of clean room and ventilation equipment; and agency, and import and export of industrial products, as well as in the related supporting business. The company was founded in 1984 and is headquartered in Singapore. Eindec Corporation Limited is a subsidiary of Weiye Holdings Limited.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "118524",
        "website": "http://www.eindec.com.sg",
        "full_time_employees": null
    },
    "508.SI": {
        "short_name": "$ Fuji Offset",
        "long_name": "Fuji Offset Plates Manufacturing Ltd",
        "summary": "Fuji Offset Plates Manufacturing Ltd manufactures and supplies plates and chemicals for the printing industry in Singapore, Malaysia, Sri Lanka, and internationally. The company operates through three segments: Printing Plates and Cylinders, Investment Holding, and Investment in Property Development Companies. It engages in the sale of pre-sensitized offset plates and CTP plates; manufactures and sale of print cylinders; and the supply of related industry required chemicals. The company is also involved in the trading of printing cylinders and its related products; and letting of properties. In addition, it invests in commercial, industrial, hospitality, residential, and/or mixed development properties. The company was incorporated in 1982 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "329134",
        "website": "http://www.fopgroup.com",
        "full_time_employees": null
    },
    "5FW.SI": {
        "short_name": "$ Acesian Partners",
        "long_name": "Acesian Partners Limited",
        "summary": "Acesian Partners Limited supplies and installs environment-control exhaust systems in Singapore, Malaysia, and Europe. It operates through two segments: Manufacturing, Distribution, and Services; and Engineering Services. The company manufactures ethylene tetrafluoroethylene coated stainless steel ducts under the CMT brand; coated and uncoated stainless steel ducts; and galvanized ducts and accessories for use in heating, ventilation, and air-conditioning systems; and other specialized exhaust system components, as well as offers laboratory air flow products. It also provides turnkey facility construction management and engineering solutions; and project management and consultancy services. Further, it operates as a general contractor for building construction, plumbing, pumping, air-conditioning, and information communication technologies, including design and build audio-visual solutions, system integration, and managed services. The company was formerly known as Linair Technologies Limited and changed its name to Acesian Partners Limited in October 2015. Acesian Partners Limited was incorporated in 1995 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "368082",
        "website": "http://www.acesian.com",
        "full_time_employees": null
    },
    "BJD.SI": {
        "short_name": "VibroPower",
        "long_name": "VibroPower Corporation Limited",
        "summary": "VibroPower Corporation Limited, an investment holding company, designs, manufactures, supplies, installs, commissions, and services generators primarily for commercial and industrial properties, and housing projects in Singapore, rest of Asia, and internationally. The company operates through three segments: Projects, Power Plant, and Others. It also trades in, installs, commissions, and services diesel generators; and manufactures and repairs electric generators. In addition, the company engages in the import, export, and sale of engines and spare parts; trade of generator parts and accessories; and development, operation, and management of power generation projects. VibroPower Corporation Limited was founded in 1995 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "638929",
        "website": "http://www.vibropower.com",
        "full_time_employees": null
    },
    "BQF.SI": {
        "short_name": "XMH^",
        "long_name": "XMH Holdings Ltd.",
        "summary": "XMH Holdings Ltd., an investment holding company, provides diesel engine, propulsion, and power generating solutions for customers in the marine and industrial sectors in Singapore, Indonesia, Vietnam, and internationally. The company operates through three segments: Distribution, After-sales, and Projects. It offers high-speed marine diesel engines for propulsion systems, pumps, deck machines, bow thrusters, power generating sets, and portable power packs; medium-speed marine diesel engines for propulsion systems and power generating sets; low-speed marine diesel engines for propulsion systems; power generating sets for auxiliary power supply to marine vessels; and industrial diesel engines for portable power packs, deck machinery, and power generating sets. The company also supplies engines, general machinery, and machinery equipment for marine, agriculture, construction, and industrial use; manufactures and repairs machinery for mining, quarrying, and construction; and manufactures, imports, and exports generating sets, spare parts, and general engineering and other related products. In addition, it trades in machinery, spare parts, and equipment; sells generators and related accessories; manufactures generator sets and related power solution products; and offers after-sales services. The company offers its marine products to shipyards, vessel owners, and dealers; and hotel proprietors, building owners, and contractors. XMH Holdings Ltd. was founded in 1955 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "638743",
        "website": "http://www.xmh.com.sg",
        "full_time_employees": null
    },
    "CYD.F": {
        "short_name": "CHINA YUCHAI INTL  DL-,01",
        "long_name": "China Yuchai International Limited",
        "summary": "China Yuchai International Limited, through its subsidiaries, manufactures, assembles, and sells diesel and natural gas engines in the People's Republic of China and internationally. It operates in two segments, Yuchai and HLGE. The company provides diesel engines comprising 4- and 6-cylinder diesel engines, high horsepower marine diesel engines, and power generator engines, as well as natural gas engines, diesel power generators, diesel engine parts, and remanufacturing services for light trucks, medium and heavy-duty trucks, buses and passenger vehicles, and marine and industrial applications; and generator sets, as well as plug in hybrid engines, range extenders, power generation powertrains, hybrid powertrains, integrated electric drive axel powertrains, and fuel cell systems. It also manufactures diesel engines for construction and agriculture applications, as well as supplies after-market parts and services. In addition, it engages in hospitality and property development activities. Further, the company designs, produces, and sells exhaust emission control systems. China Yuchai International Limited distributes its engines directly to auto original equipment manufacturers, agents, and retailers, as well as provides maintenance and retrofitting services. The company was founded in 1951 and is based in Singapore.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "048581",
        "website": "http://www.cyilimited.com",
        "full_time_employees": 8927
    },
    "CYD": {
        "short_name": "China Yuchai International Limi",
        "long_name": "China Yuchai International Limited",
        "summary": "China Yuchai International Limited, through its subsidiaries, manufactures, assembles, and sells diesel and natural gas engines in the People's Republic of China and internationally. It operates in two segments, Yuchai and HLGE. The company provides diesel engines comprising 4- and 6-cylinder diesel engines, high horsepower marine diesel engines, and power generator engines, as well as natural gas engines, diesel power generators, diesel engine parts, and remanufacturing services for light trucks, medium and heavy-duty trucks, buses and passenger vehicles, and marine and industrial applications; and generator sets, as well as plug in hybrid engines, range extenders, power generation powertrains, hybrid powertrains, integrated electric drive axel powertrains, and fuel cell systems. It also manufactures diesel engines for construction and agriculture applications, as well as supplies after-market parts and services. In addition, it engages in hospitality and property development activities. Further, the company designs, produces, and sells exhaust emission control systems. China Yuchai International Limited distributes its engines directly to auto original equipment manufacturers, agents, and retailers, as well as provides maintenance and retrofitting services. The company was founded in 1951 and is based in Singapore.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "048581",
        "website": "http://www.cyilimited.com",
        "full_time_employees": 8927
    },
    "F13.SI": {
        "short_name": "Fu Yu",
        "long_name": "Fu Yu Corporation Limited",
        "summary": "Fu Yu Corporation Limited, an investment holding company, engages in the manufacture and sub-assembly of precision plastic parts and components primarily in Singapore, Malaysia, and China. The company is also involved in the fabrication of precision molds and dies; trading activities; and provision of management services. It serves companies in the printing and imaging, networking and communications, consumer, medical, and automotive sectors. The company was formerly known as Fu Yu Manufacturing Limited and changed its name to Fu Yu Corporation Limited in 2004. Fu Yu Corporation Limited was founded in 1978 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "638675",
        "website": "http://www.fuyucorp.com",
        "full_time_employees": null
    },
    "H22.SI": {
        "short_name": "Hong Leong Asia",
        "long_name": "Hong Leong Asia Ltd.",
        "summary": "Hong Leong Asia Ltd., an investment holding company, manufactures and distributes diesel engines and related products, building materials, rigid packaging products, and air-conditioning systems in the People's Republic of China, Singapore, Malaysia, and internationally. Its Diesel Engines segment offers light-duty, medium-duty, and heavy-duty engines for trucks, buses, passenger vehicles, industrial equipment, and marine and agriculture applications; engines for diesel-powered generators; automobile spare parts; and maintenance and retrofitting services. This segment offers diesel-powered generators, industrial engines, marine engines, and natural gas engines. The company's Building Materials segment manufactures, trades in, and distributes cement, pre-cast concrete products, ready-mix concrete, and quarry products for the construction industry. Its Rigid Plastic Packaging segment provides rigid plastic packaging products, such as bottles, closures, jerry cans, pails, and drums for the industrial and consumer packaging markets, including personal care, household, food and beverage, lubricant, and chemical markets; and container components. The company's Air-conditioning Systems segment offers central air-conditioning, multi-split, residential heat pump, floor heating, and variable refrigerant flow systems; fan coils; air cooled and water cooled chillers; and air handling units under the Airwell and Fedders brands for use in residential, commercial, and industrial applications, as well as in private households. The company is also involved in the hospitality and property development activities. It also exports its products. The company was founded in 1941 and is headquartered in Singapore. Hong Leong Asia Ltd. operates as a subsidiary of Hong Leong Corporation Holdings Pte Ltd.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "048581",
        "website": "http://www.hlasia.com.sg",
        "full_time_employees": 5928
    },
    "ZGL.AX": {
        "short_name": "ZICOM FPO",
        "long_name": "Zicom Group Limited",
        "summary": "Zicom Group Limited, together with its subsidiaries, manufactures and sells marine deck machinery, fluid regulating and metering stations, transit concrete mixers, and geotechnical equipment in Singapore. It operates through Offshore Marine, Oil & Gas Machinery; Construction Equipment; Precision Engineering & Technologies; and Industrial & Mobile Hydraulics segments. The Offshore Marine, Oil & Gas Machinery segment manufactures and supplies deck machinery, such as winches, windlasses, capstans, deck cranes, derricks, cable laying and lifeboat davits, shark jaws, and towing pins used in deep-sea vessels; and gas processing plants and related equipment, parts, and services, as well as gas metering stations used by gas utility companies and industrial gas users. The Construction Equipment segment provides concrete mixers and foundation equipment, including vibratory piling and impact piling hammers, boring machines, and vibroflots, as well as equipment rental, parts, and related services. The Precision Engineering & Technologies segment offers precision and automation equipment comprising flip chip bonders, medtech equipment, medical consumables, and engineering services. The Industrial & Mobile Hydraulics segment supplies hydraulic drive systems, parts, and services. Zicom Group Limited is headquartered in Singapore.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "639420",
        "website": "http://www.zicomgroup.com",
        "full_time_employees": null
    }
}