{
    "A52.SI": {
        "short_name": "$ AnnAik",
        "long_name": "AnnAik Limited",
        "summary": "AnnAik Limited, an investment holding company, manufactures and sells stainless steel piping products in Singapore, the People's Republic of China, South Korea, Malaysia, and internationally. The company operates in four segments: Distribution of Stainless Steel Piping Products; Manufacturing of Steel Flanges; Engineering Construction of Piping Process System; and Environmental Business. The company offers butt-weld, screwed, and high pressure forged steel fittings; stainless steel forged flanges; and ball, flange-end ball, gate, globe, and swing check valves. It also is involved in designing, contracting, and managing engineering projects; the development of environmental technologies, as well as environmental engineering activities; wholesale of metals and metal ores; and provision of import and export agency services. In addition, the company constructs, owns, operates, and manages wastewater treatment plants; constructs and supplies rural wastewater treatment equipment; and provides consulting services in water resource management to governmental and commercial operators. Further, it is involved in the design, fabrication, installation, testing, and commissioning of mechanical system in process plants. AnnAik Limited was founded in 1977 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "639193",
        "website": "http://www.annaik.com",
        "market_cap": "Nano Cap"
    },
    "A55.SI": {
        "short_name": "Asia Enterprises",
        "long_name": "Asia Enterprises Holding Limited",
        "summary": "Asia Enterprises Holding Limited, an investment holding company, distributes steel products to industrial end-users in Singapore, Indonesia, Malaysia, and other regions in the Asia Pacific. Its products include shipbuilding plates/high tensile plates, hot-rolled plates/chequered plates, wide-flanged beams, bulb flats, channels, equal angles/unequal angles/inverted angles, round/square/flat bars, hollow sections, seamless/ERW API grade pipes, and serrated galvanized gratings. The company also offers processed steel materials, which include cold-rolled, electro-galvanized, hot-dipped galvanized, and stainless steel coils/sheets, as well as hot-rolled pickled and oiled coils/sheets. It serves customers primarily in the marine and offshore, oil and gas, construction, precision metal stamping, manufacturing, and engineering/fabrication industries. The company was founded in 1961 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "627897",
        "website": "http://www.asiaenterprises.com.sg",
        "market_cap": "Nano Cap"
    },
    "B7K.SI": {
        "short_name": "Sin Ghee Huat",
        "long_name": "Sin Ghee Huat Corporation Ltd.",
        "summary": "Sin Ghee Huat Corporation Ltd., an investment holding company, engages in the trading and sale of stainless steel and specialty metal products in Singapore, Indonesia, China, other ASEAN countries, Australia, New Zealand, India, South America, and the Middle East. It offers seamless and welded pipes, as well as seamless, round, square, and rectangular tubes; butt-welded and forged fittings; flanges; plates; and round, flat, equal angle, U channel, hollow, square, and hexagonal bars, as well as I beams. The company also offers project management services. It serves oil and gas, petrochemical, marine and shipbuilding, construction, food processing, pulp and paper, and pharmaceutical industries. The company was founded in 1939 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "629537",
        "website": "http://singheehuat.com.sg",
        "market_cap": "Nano Cap"
    },
    "BEC.SI": {
        "short_name": "BRC Asia",
        "long_name": "BRC Asia Limited",
        "summary": "BRC Asia Limited, together with its subsidiaries, engages in the prefabrication of steel reinforcement for use in concrete in Singapore, China, Hong Kong, Malaysia, Thailand, and internationally. It operates through Fabrication and Manufacturing, and Others segments. The company is involved in the trade of steel reinforcing bars; manufacture and sale of wire mesh fences; trading and distribution of steel products; and provision of weldfences and cages, as well as prefabrication, rebar, and cut and bend services. It also operates and manages airports, hotels, and resorts; and develops properties. The company was incorporated in 1938 and is based in Singapore. BRC Asia Limited is a subsidiary of Esteel Enterprise Pte. Ltd.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "619530",
        "website": "http://www.brc.com.sg",
        "market_cap": "Micro Cap"
    },
    "BTG.SI": {
        "short_name": "HG Metal",
        "long_name": "HG Metal Manufacturing Limited",
        "summary": "HG Metal Manufacturing Limited, an investment holding company, primarily engages in the trading of steel products. It operates through three segments: Trading, Manufacturing, and Others. The company offers various steel products, such as angle bars, API pipes, beams and columns, chequered plates, flat bars, channels, gratings, hollow sections, round/square bars, mild steel plates, steel sheet piles, galvanized sheets, shipbuilding plates, and T-bars. It also provides cut and bend, caging and rebar fabrication, and integrated coupler and computer controlled production services. In addition, the company offers tailored steel solutions for diversified industries, such as energy, heavy equipment, electronics, marine, and others; surface protection services; and precision slitting and shearing, CNC profile cut, and cut to length services, as well as logistics and shipping services. Further, it provides engineering services; and customized steel finishing services, such as galvanizing, coating, cutting, and drilling, as well as rents plates and beams to the construction industry. Additionally, the company is involved in the sourcing, retailing, and trading steel products. It has operations in Singapore, Myanmar, Malaysia, Indonesia, Sri Lanka, Brunei, Thailand, Vietnam, New Zealand, Australia, Papua New Guinea, and internationally. HG Metal Manufacturing Limited was founded in 1971 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "619484",
        "website": "http://www.hgmetal.com",
        "market_cap": "Nano Cap"
    },
    "SGQ.F": {
        "short_name": "SIN GHEE HUAT CORP. LTD",
        "long_name": "Sin Ghee Huat Corporation Ltd.",
        "summary": "Sin Ghee Huat Corporation Ltd., an investment holding company, engages in the trading and sale of stainless steel and specialty metal products in Singapore, Indonesia, China, other ASEAN countries, Australia, New Zealand, India, South America, and the Middle East. It offers seamless and welded pipes, as well as seamless, round, square, and rectangular tubes; butt-welded and forged fittings; flanges; plates; and round, flat, equal angle, U channel, hollow, square, and hexagonal bars, as well as I beams. The company also offers project management services. It serves oil and gas, petrochemical, marine and shipbuilding, construction, food processing, pulp and paper, and pharmaceutical industries. The company was founded in 1939 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "629537",
        "website": "http://singheehuat.com.sg",
        "market_cap": "Nano Cap"
    }
}