{
    "42F.SI": {
        "short_name": "$ Yinda Infocomm",
        "long_name": "Yinda Infocomm Limited",
        "summary": "Yinda Infocomm Limited, an investment holding company, provides integrated communication solutions and services in Singapore, Thailand, the Philippines, and Malaysia. It offers in-building coverage services, such as planning and design, construction, and implementation of indoor mobile network infrastructure; and outdoor construction services that include planning and design, construction, and implementation of outdoor mobile network infrastructure. The company is also involved in undertaking telecommunications implementation works for the installation and commissioning of radio-based transceiver stations; and provision of corrective and preventive maintenance services for network reliability and minimal network disruptions. In addition, it designs, develops, installs, and maintains telecommunication equipment and systems for commercial and industrial applications, as well as other related activities. The company was formerly known as CMC Infocomm Limited and changed its name to Yinda Infocomm Limited in September 2017. The company was incorporated in 2015 and is based in Singapore. Yinda Infocomm Limited is a subsidiary of Yinda Pte. Ltd.",
        "currency": "SGD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "049319",
        "website": "http://yinda.com.sg",
        "market_cap": "Micro Cap"
    },
    "AWV.SI": {
        "short_name": "Captii",
        "long_name": "Captii Limited",
        "summary": "Captii Limited, an investment holding company, operates in the technology and telecommunication businesses in South East Asia, South Asia, the Middle East, Africa, China, North America, and internationally. The company operates through three segments: Unifiedcomms, GlobeOSS, and Captii Ventures. It offers content-driven mobile value-added services; messaging and signaling systems, solutions, and managed services; and mobile network operation support systems, solutions, and managed services, as well as invests in early and late-stage technology ventures. The company also provides telecommunications, technology, and customized solutions for telecommunications operators, service providers, and enterprises; and research and development, software engineering, system integration, project management, and maintenance and support services for the telecommunications industry. In addition, it offers global roaming quality and service management solutions; distributes information technology and telecommunications products; and provides money lending, credit profiling, pay-later, and other related services to telecommunications operators, service providers, and enterprises, as well as offers management services. The company was formerly known as Unified Communications Holdings Limited and changed its name to Captii Limited in May 2014. Captii Limited was founded in 1998 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "409015",
        "website": "http://www.captii.com",
        "market_cap": "Nano Cap"
    },
    "BAI.SI": {
        "short_name": "$ Digilife Tech",
        "long_name": "Digilife Technologies Limited",
        "summary": "Digilife Technologies Limited provides telecommunication services in Southeast Asia and internationally. The company operates through two segments, Telecom and Technology. It distributes mobile prepaid cards of telecom operators in Indonesia; and operates a distribution network of 30,000 resellers, and 150 dealers and sub-dealers; and various branch offices and sub-branch offices in Indonesia. The company also provides hardware infrastructure and business service integration for government and corporate clients; and integrated onestop ICT solutions, such as consultancy, maintenance, and disaster recovery services; and undertakes projects on networking, data hosting, and managed service solutions; and focuses on services driven business and key offerings, such as cloud, IOT, server consolidation, virtualization, and other services. In addition, it supplies, rents, maintains, and services computer hardware and peripheral equipment; and provision of systems integration services related to computer equipment and peripherals, storage systems, networking products, and customized solutions and software products. Further, the company offers networking and routing solutions; cloud computing and data, security, backup, and infrastructure services; data services, including broadband, lease line access, private network, network security, hosted services, and information technology solutions. It also engages in the battery electric vehicles and passenger land transport business; motor vehicles dealership and retail of spare parts and accessories; rents and leases private cars; procurement and sale of mobile handsets and accessories, computer, and electronic equipment; trades in portable computers and computer accessories; and repair and maintenance of mobile phones. The company was formerly known as SEVAK Limited and changed its name to Digilife Technologies Limited in April 2021. Digilife Technologies Limited was incorporated in 1993 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "408826",
        "website": "http://www.sevaklimited.com",
        "market_cap": "Nano Cap"
    },
    "CC3.SI": {
        "short_name": "StarHub",
        "long_name": "StarHub Ltd",
        "summary": "StarHub Ltd, an integrated info communications company, provides communications, entertainment, and digital solutions for individuals and corporations in Singapore. The company operates in four segments: Telecommunications, Cyber Security, High Security Assurance Product, and Regional Information Communication Technology. It is involved in the provision of mobile, pay TV, broadband, data center, cybersecurity, network and protection, recovery planning, and connectivity and managed services; electronic and internet security, and surveillance services; and trading and installation services for electronic devices, as well as services for development and implementation of computer systems. The company also provides system integration, maintenance, project management, business continuity, and business application solutions and related services; architecting ICT solutions; develops software as a service application; and designs and develops high security products and technology. Further, the company provides hospital information systems solutions, healthcare information technology software, and research, development, and support services; and petrol station retail and fuel logistics management solutions, as well as other professional, scientific, and technical services. Additionally, it is involved in the supply and implementation of hardware and software solutions; and sale of IT security products. The company was incorporated in 1998 and is headquartered in Singapore. StarHub Ltd is a subsidiary of Asia Mobile Holdings Pte. Ltd.",
        "currency": "SGD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "408942",
        "website": "http://www.starhub.com",
        "market_cap": "Small Cap"
    },
    "CJLU.SI": {
        "short_name": "NetLink NBN Tr",
        "long_name": "NetLink NBN Trust",
        "summary": "NetLink NBN Trust owns, designs, builds, and operates the passive fibre network infrastructure for residential homes and non-residential premises, and non-building address point (NBAP) connections in mainland Singapore and its connected islands. Its passive fibre network infrastructure includes ducts, manholes, fibre cables, and central offices. As of March 31, 2020, it had an approximately 1,427,445 residential; 47,681 non-residential; and 1,679 NBAP end-user connections. The company was founded in 2017 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "469005",
        "website": "http://www.netlinknbn.com",
        "market_cap": "Mid Cap"
    },
    "MZZ1.F": {
        "short_name": "DIGILIFE TECHNOLOGIES LTD",
        "long_name": "Digilife Technologies Limited",
        "summary": "Digilife Technologies Limited provides telecommunication services in Southeast Asia and internationally. The company operates through two segments, Telecom and Technology. It distributes mobile prepaid cards of telecom operators in Indonesia; and operates a distribution network of 30,000 resellers, and 150 dealers and sub-dealers; and various branch offices and sub-branch offices in Indonesia. The company also provides hardware infrastructure and business service integration for government and corporate clients; and integrated onestop ICT solutions, such as consultancy, maintenance, and disaster recovery services; and undertakes projects on networking, data hosting, and managed service solutions; and focuses on services driven business and key offerings, such as cloud, IOT, server consolidation, virtualization, and other services. In addition, it supplies, rents, maintains, and services computer hardware and peripheral equipment; and provision of systems integration services related to computer equipment and peripherals, storage systems, networking products, and customized solutions and software products. Further, the company offers networking and routing solutions; cloud computing and data, security, backup, and infrastructure services; data services, including broadband, lease line access, private network, network security, hosted services, and information technology solutions. It also engages in the battery electric vehicles and passenger land transport business; motor vehicles dealership and retail of spare parts and accessories; rents and leases private cars; procurement and sale of mobile handsets and accessories, computer, and electronic equipment; trades in portable computers and computer accessories; and repair and maintenance of mobile phones. The company was formerly known as SEVAK Limited and changed its name to Digilife Technologies Limited in April 2021. Digilife Technologies Limited was incorporated in 1993 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "408826",
        "website": "http://www.sevaklimited.com",
        "market_cap": "Nano Cap"
    },
    "RYTB.F": {
        "short_name": "STARHUB LTD",
        "long_name": "StarHub Ltd",
        "summary": "StarHub Ltd, an integrated info communications company, provides communications, entertainment, and digital solutions for individuals and corporations in Singapore. The company operates in four segments: Telecommunications, Cyber Security, High Security Assurance Product, and Regional Information Communication Technology. It is involved in the provision of mobile, pay TV, broadband, data center, cybersecurity, network and protection, recovery planning, and connectivity and managed services; electronic and internet security, and surveillance services; and trading and installation services for electronic devices, as well as services for development and implementation of computer systems. The company also provides system integration, maintenance, project management, business continuity, and business application solutions and related services; architecting ICT solutions; develops software as a service application; and designs and develops high security products and technology. Further, the company provides hospital information systems solutions, healthcare information technology software, and research, development, and support services; and petrol station retail and fuel logistics management solutions, as well as other professional, scientific, and technical services. Additionally, it is involved in the supply and implementation of hardware and software solutions; and sale of IT security products. The company was incorporated in 1998 and is headquartered in Singapore. StarHub Ltd is a subsidiary of Asia Mobile Holdings Pte. Ltd.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "408942",
        "website": "http://www.starhub.com",
        "market_cap": "Small Cap"
    },
    "SGAPY": {
        "short_name": "SINGAPORE TELECOMMUNICATIONS",
        "long_name": "Singapore Telecommunications Limited",
        "summary": "Singapore Telecommunications Limited provides communication, infotainment, and technology services to consumers and small businesses in Singapore, Australia, the United States, and internationally. It operates through three segments: Group Consumer, Group Enterprise, and Group Digital Life. The company engages in the carriage business, including mobile, pay television, fixed broadband, and voice, as well as telecommunication equipment sales; mobile financial, and gaming and digital content business; and digital marketing, and advanced analytics and intelligence businesses. It offers mobile, fixed voice and data, managed, cloud computing, cybersecurity, IT services, and professional consulting services; ICT solutions and marketing technology; Internet advertising solutions; lifestyle services; regional premium over-the-top video service; facilities management and consultancy; technical and management consultancy; money remittance; information security services and products; fund management; satellite capacity for telecommunications and video broadcasting services; storage facilities for submarine telecommunication cables and related equipment; handset insurance and related services; and billing and communication engineering services. In addition, the company operates a venture capital fund that focuses its investments on technologies and solutions; distributes prepaid mobile, and specialized telecommunications and data communication products; and operates and maintains fiber optic network. Further, it offers inSing.com that provides hyper-local content, user reviews, and editorials, as well as business or service information; and Trustwave that enables businesses to fight cybercrime, protect data, and reduce security risk. Singapore Telecommunications Limited has a collaboration with Nokia Software to develop and trial 5G network slicing capabilities based on a network as a service approach. The company was incorporated in 1992 and is headquartered in Singapore.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "239732",
        "website": "http://www.singtel.com",
        "market_cap": "Large Cap"
    },
    "SIT4.F": {
        "short_name": "SINGAPORE TELE.  SD-,15",
        "long_name": "Singapore Telecommunications Limited",
        "summary": "Singapore Telecommunications Limited provides communication, infotainment, and technology services to consumers and small businesses in Singapore, Australia, the United States, and internationally. It operates through three segments: Group Consumer, Group Enterprise, and Group Digital Life. The company engages in the carriage business, including mobile, pay television, fixed broadband, and voice, as well as telecommunication equipment sales; mobile financial, and gaming and digital content business; and digital marketing, and advanced analytics and intelligence businesses. It offers mobile, fixed voice and data, managed, cloud computing, cybersecurity, IT services, and professional consulting services; ICT solutions and marketing technology; Internet advertising solutions; lifestyle services; regional premium over-the-top video service; facilities management and consultancy; technical and management consultancy; money remittance; information security services and products; fund management; satellite capacity for telecommunications and video broadcasting services; storage facilities for submarine telecommunication cables and related equipment; handset insurance and related services; and billing and communication engineering services. In addition, the company operates a venture capital fund that focuses its investments on technologies and solutions; distributes prepaid mobile, and specialized telecommunications and data communication products; and operates and maintains fiber optic network. Further, it offers inSing.com that provides hyper-local content, user reviews, and editorials, as well as business or service information; and Trustwave that enables businesses to fight cybercrime, protect data, and reduce security risk. Singapore Telecommunications Limited has a collaboration with Nokia Software to develop and trial 5G network slicing capabilities based on a network as a service approach. The company was incorporated in 1992 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "239732",
        "website": "http://www.singtel.com",
        "market_cap": "Large Cap"
    },
    "SNGNF": {
        "short_name": "SINGAPORE TELECOMMUNICATIONS",
        "long_name": "Singapore Telecommunications Limited",
        "summary": "Singapore Telecommunications Limited provides communication, infotainment, and technology services to consumers and small businesses in Singapore, Australia, the United States, and internationally. It operates through three segments: Group Consumer, Group Enterprise, and Group Digital Life. The company engages in the carriage business, including mobile, pay television, fixed broadband, and voice, as well as telecommunication equipment sales; mobile financial, and gaming and digital content business; and digital marketing, and advanced analytics and intelligence businesses. It offers mobile, fixed voice and data, managed, cloud computing, cybersecurity, IT services, and professional consulting services; ICT solutions and marketing technology; Internet advertising solutions; lifestyle services; regional premium over-the-top video service; facilities management and consultancy; technical and management consultancy; money remittance; information security services and products; fund management; satellite capacity for telecommunications and video broadcasting services; storage facilities for submarine telecommunication cables and related equipment; handset insurance and related services; and billing and communication engineering services. In addition, the company operates a venture capital fund that focuses its investments on technologies and solutions; distributes prepaid mobile, and specialized telecommunications and data communication products; and operates and maintains fiber optic network. Further, it offers inSing.com that provides hyper-local content, user reviews, and editorials, as well as business or service information; and Trustwave that enables businesses to fight cybercrime, protect data, and reduce security risk. Singapore Telecommunications Limited has a collaboration with Nokia Software to develop and trial 5G network slicing capabilities based on a network as a service approach. The company was incorporated in 1992 and is headquartered in Singapore.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "239732",
        "website": "http://www.singtel.com",
        "market_cap": "Large Cap"
    },
    "SRHBF": {
        "short_name": "STARHUB LTD",
        "long_name": "StarHub Ltd",
        "summary": "StarHub Ltd, an integrated info communications company, provides communications, entertainment, and digital solutions for individuals and corporations in Singapore. The company operates in four segments: Telecommunications, Cyber Security, High Security Assurance Product, and Regional Information Communication Technology. It is involved in the provision of mobile, pay TV, broadband, data center, cybersecurity, network and protection, recovery planning, and connectivity and managed services; electronic and internet security, and surveillance services; and trading and installation services for electronic devices, as well as services for development and implementation of computer systems. The company also provides system integration, maintenance, project management, business continuity, and business application solutions and related services; architecting ICT solutions; develops software as a service application; and designs and develops high security products and technology. Further, the company provides hospital information systems solutions, healthcare information technology software, and research, development, and support services; and petrol station retail and fuel logistics management solutions, as well as other professional, scientific, and technical services. Additionally, it is involved in the supply and implementation of hardware and software solutions; and sale of IT security products. The company was incorporated in 1998 and is headquartered in Singapore. StarHub Ltd is a subsidiary of Asia Mobile Holdings Pte. Ltd.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "408942",
        "website": "http://www.starhub.com",
        "market_cap": "Small Cap"
    },
    "SRHBY": {
        "short_name": "STARHUB LTD",
        "long_name": "StarHub Ltd",
        "summary": "StarHub Ltd, an integrated info communications company, provides communications, entertainment, and digital solutions for individuals and corporations in Singapore. The company operates in four segments: Telecommunications, Cyber Security, High Security Assurance Product, and Regional Information Communication Technology. It is involved in the provision of mobile, pay TV, broadband, data center, cybersecurity, network and protection, recovery planning, and connectivity and managed services; electronic and internet security, and surveillance services; and trading and installation services for electronic devices, as well as services for development and implementation of computer systems. The company also provides system integration, maintenance, project management, business continuity, and business application solutions and related services; architecting ICT solutions; develops software as a service application; and designs and develops high security products and technology. Further, the company provides hospital information systems solutions, healthcare information technology software, and research, development, and support services; and petrol station retail and fuel logistics management solutions, as well as other professional, scientific, and technical services. Additionally, it is involved in the supply and implementation of hardware and software solutions; and sale of IT security products. The company was incorporated in 1998 and is headquartered in Singapore. StarHub Ltd is a subsidiary of Asia Mobile Holdings Pte. Ltd.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "408942",
        "website": "http://www.starhub.com",
        "market_cap": "Small Cap"
    },
    "T41.SI": {
        "short_name": "TeleChoice Intl",
        "long_name": "TeleChoice International Limited",
        "summary": "TeleChoice International Limited, an investment holding company, provides various info-communications services and solutions for the consumer and enterprise markets in Singapore, Indonesia, Malaysia, the Philippines, Hong Kong, and internationally. The company operates through three segments: Personal Communications Solutions Services (PCS), Info-communications Technology Services (ICT), and Network Engineering Services. The company's PCS segment offers distribution and supply chain management services relating to mobile communication devices, wearables, and accessories; mobile handset delivery, and last mile services; and retail management, fulfilment, and supply chain services. This segment also operates StarHub Platinum shops and concept stores; distributes prepaid cards; and operates eplanetworld.com, an e-commerce site that offers mobile phones and tablets, as well as accessories for online shoppers. Its ICT segment provides consultancy and system integration services for enterprise IT infrastructure, and business solutions and applications. This segment offers managed and hosted, fixed and wireless networking, and contact center and unified communications solutions; consultancy and managed services; Internet Protocol television solutions for the hospitality industry; and IDD, SMS broadcast, and mobility solutions and services. The company's Network Engineering services segment provides network engineering services and supplies specialized telecommunications products. It designs, builds, and manages telecommunications networks. Its services comprise radio network planning and optimization, transmission network planning, network implementation, maintenance, and project management; and a range of products for telecommunications access and coverage needs, as well as for power supply and power backup requirements. The company was incorporated in 1998 and is based in Singapore. TeleChoice International Limited is a subsidiary of STT Communications Ltd.",
        "currency": "SGD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "554910",
        "website": "http://www.telechoice.com.sg",
        "market_cap": "Micro Cap"
    },
    "Z74.SI": {
        "short_name": "Singtel",
        "long_name": "Singapore Telecommunications Limited",
        "summary": "Singapore Telecommunications Limited provides communication, infotainment, and technology services to consumers and small businesses in Singapore, Australia, the United States, and internationally. It operates through three segments: Group Consumer, Group Enterprise, and Group Digital Life. The company engages in the carriage business, including mobile, pay television, fixed broadband, and voice, as well as telecommunication equipment sales; mobile financial, and gaming and digital content business; and digital marketing, and advanced analytics and intelligence businesses. It offers mobile, fixed voice and data, managed, cloud computing, cybersecurity, IT services, and professional consulting services; ICT solutions and marketing technology; Internet advertising solutions; lifestyle services; regional premium over-the-top video service; facilities management and consultancy; technical and management consultancy; money remittance; information security services and products; fund management; satellite capacity for telecommunications and video broadcasting services; storage facilities for submarine telecommunication cables and related equipment; handset insurance and related services; and billing and communication engineering services. In addition, the company operates a venture capital fund that focuses its investments on technologies and solutions; distributes prepaid mobile, and specialized telecommunications and data communication products; and operates and maintains fiber optic network. Further, it offers inSing.com that provides hyper-local content, user reviews, and editorials, as well as business or service information; and Trustwave that enables businesses to fight cybercrime, protect data, and reduce security risk. Singapore Telecommunications Limited has a collaboration with Nokia Software to develop and trial 5G network slicing capabilities based on a network as a service approach. The company was incorporated in 1992 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "239732",
        "website": "http://www.singtel.com",
        "market_cap": "Large Cap"
    },
    "Z77.SI": {
        "short_name": "Singtel 10",
        "long_name": "Singapore Telecommunications Limited",
        "summary": "Singapore Telecommunications Limited provides communication, infotainment, and technology services to consumers and small businesses in Singapore, Australia, the United States, and internationally. It operates through three segments: Group Consumer, Group Enterprise, and Group Digital Life. The company engages in the carriage business, including mobile, pay television, fixed broadband, and voice, as well as telecommunication equipment sales; mobile financial, and gaming and digital content business; and digital marketing, and advanced analytics and intelligence businesses. It offers mobile, fixed voice and data, managed, cloud computing, cybersecurity, IT services, and professional consulting services; ICT solutions and marketing technology; Internet advertising solutions; lifestyle services; regional premium over-the-top video service; facilities management and consultancy; technical and management consultancy; money remittance; information security services and products; fund management; satellite capacity for telecommunications and video broadcasting services; storage facilities for submarine telecommunication cables and related equipment; handset insurance and related services; and billing and communication engineering services. In addition, the company operates a venture capital fund that focuses its investments on technologies and solutions; distributes prepaid mobile, and specialized telecommunications and data communication products; and operates and maintains fiber optic network. Further, it offers inSing.com that provides hyper-local content, user reviews, and editorials, as well as business or service information; and Trustwave that enables businesses to fight cybercrime, protect data, and reduce security risk. Singapore Telecommunications Limited has a collaboration with Nokia Software to develop and trial 5G network slicing capabilities based on a network as a service approach. The company was incorporated in 1992 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "239732",
        "website": "http://www.singtel.com",
        "market_cap": "Large Cap"
    }
}