{
    "5WE.SI": {
        "short_name": "$ Moya Asia",
        "long_name": "Moya Holdings Asia Limited",
        "summary": "Moya Holdings Asia Limited, an investment holding company offers a range of water treatment solutions to government in Indonesia. It offers commissioning, operation, and maintenance of various water treatment plants on design, build, operate, and transfer arrangements. The company also provides management, technical advisory and analysis, and management consultancy services to the clean water industry; and supplies and distributes clean water. It serves approximately 3.5 million people and is connected to approximately 560,000 customers in the Greater Jakarta region. The company was incorporated in 2013 and is based in Singapore. Moya Holdings Asia Limited is a subsidiary of Tamaris Infrastructure Pte. Ltd.",
        "currency": "SGD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "049513",
        "website": "http://www.moyaasia.com",
        "market_cap": 294251296
    },
    "HYFXF": {
        "short_name": "HYFLUX",
        "long_name": "Hyflux Ltd",
        "summary": "Hyflux Ltd provides various solutions in water and energy areas worldwide. The company operates through two segments, Municipal and Industrial. The Municipal segment supplies a range of infrastructure solutions, including water, power, and waste-to-energy to municipalities and governments. The Industrial segment supplies infrastructure solutions for water to industrial customers. The company provides seawater desalination, raw water purification, wastewater cleaning, water recycling, water reclamation, and pure water production services to municipal and industrial clients, as well as to home consumers; and filtration and purification products. It also designs, constructs, owns, operates, and sells water treatment, seawater desalination, wastewater treatment, and water recycling plants under service concession arrangements; and sells oxygen-rich water and related products and services. In addition, the company designs, constructs, owns, operates, and sells power plants and waste-to-energy plants; trades in the electricity markets; and sells retail electricity contracts. Hyflux Ltd was founded in 1989 and is headquartered in Singapore.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "339949",
        "website": "http://www.hyflux.com",
        "market_cap": 37628252
    },
    "SGXXF": {
        "short_name": "SOUND GLOBAL LTD",
        "long_name": "Sound Global Ltd.",
        "summary": "Sound Global Ltd., an investment holding company, provides water and wastewater treatment solutions in the People's Republic of China, Singapore, and Bangladesh. It operates in three segments: Turnkey Projects and Services; Equipment Fabrications; and Operations and Maintenance of Water Supply and Wastewater Treatment Facilities. The company designs, constructs, operates, and maintains water and wastewater treatment facilities; and manufactures water and wastewater treatment equipment. It is also involved in the municipal water supply, wastewater treatment, and water recycling and reuse; research and development of water treatment technologies and provision of services of technology consultation; labor subcontracting activities; and leasing of construction machinery and equipment. In addition, the company plans, designs, constructs, and manages industrial zone water management systems, municipal wastewater projects, and water supply projects; and offers integrated solutions in various fields, such as industrial water supply, desalination, and industrial wastewater treatment and cyclical reuse, as well as centralized treatment for water supply and drainage in industrial zones. Further, it engages in the integration of water supply and drainage in villages and small towns; industrial and residential properties construction, and engineering design and construction activities; sale of building materials; leasing of properties; and computer software development activities. Additionally, the company offers equity investment management and consulting services; and property management and maintenance services. The company was formerly known as Epure International Ltd. and changed its name to Sound Global Ltd. in May 2010. Sound Global Ltd. was founded in 1993 and is based in Singapore. Sound Global Ltd. is a subsidiary of Sound Water (BVI) Limited.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "119962",
        "website": "http://www.soundglobal.com.sg",
        "market_cap": 4900200960
    },
    "SYM.SI": {
        "short_name": "$ Memiontec",
        "long_name": "Memiontec Holdings Ltd.",
        "summary": "Memiontec Holdings Ltd., a water treatment company, provides water and wastewater management services in Singapore, Indonesia, and the People's Republic of China. The company operates through Total Solutions with Engineering, Procurement and Construction (TSEPC); Operation, Maintenance and Service (OMS); Sales and Distribution of Water System and Equipment (Trading); and Others segments. The TSEPC segment engages in the provision of a range of solutions in water treatment, wastewater treatment, water recycling treatment, and sea water treatment and desalination. This segment's customers include public sectors and industrial-related industries, including agro, food and beverage, power, petrochemical, palm oil, chemical, semiconductor, and real estate. The OMS segment offers operational, preventive, and corrective maintenance works, as well as technical support and consultation services for plant maintenance to TSEPC customers with water and wastewater infrastructure. The Trading segment sells and distributes modular and customized water treatment systems, water treatment equipment, components or spare parts, and specialty and/or blended chemicals. The Others segment sells treated water. Memiontec Holdings Ltd. was founded in 1992 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "738733",
        "website": "http://memiontec.com",
        "market_cap": 49557820
    }
}