{
    "2160.T": {
        "short_name": "GNI GROUP LTD",
        "long_name": "GNI Group Ltd.",
        "summary": "GNI Group Ltd., together with its subsidiaries, engages in the research, development, manufacture, and sale of pharmaceutical drugs and traditional Chinese medicines in Japan and internationally. It provides Etuary for the treatment of idiopathic pulmonary fibrosis. The company is also developing Etuary, which is in Phase III clinical trial for the treatment of connective tissue associated interstitial lung disease; and in clinical trial phase II and pre-phase III clinical trial pilot study for the treatment of radiation pneumonitis, as well as for the treatment of diabetic nephropathy. In addition, it is involved in developing F351, which is in Phase II clinical trial for the treatment of liver fibrosis; and F573 that is in pre-clinical phase for the treatment of acute on chronic liver failure, as well as Tamibarotene for the treatment of acute promyelocytic leukemia. The company was founded in 2001 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0023",
        "website": "http://www.gnipharma.com",
        "market_cap": 104988770304
    },
    "2183.T": {
        "short_name": "LINICAL CO LTD",
        "long_name": "Linical Co., Ltd.",
        "summary": "Linical Co., Ltd. provides drug development services primarily in the areas of oncology and central nervous system to pharmaceutical companies worldwide. It offers drug development consulting services, such as market analysis of products in development, regulatory affairs consultation support, and licensing support. The company also provides clinical research and development, and contract medical affairs services, including front-end services comprising project management, monitoring, quality control, vendor management, auditing, and clinical research secretariat; and back-end services, which include data management, bio statistical analysis, medical writing, pharmacovigilance, and medical management. Linical Co., Ltd. was founded in 2005 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "532-0003",
        "website": "http://www.linical.co.jp",
        "market_cap": 18069280768
    },
    "2191.T": {
        "short_name": "TELLA INC",
        "long_name": "tella, Inc.",
        "summary": "tella, Inc. researches and develops regenerative and cell medicines. The company offers techniques and operational knowhow associated with dendritic cell vaccine therapy to affiliated medical institutions for the treatment of cancer. It is also involved in the provision of consultation services on the establishment and maintenance of cell processing centers, and on introduction of management systems for cell cultivation; and lease of standard operating procedure and regular checks on manufacturing operation management and training of cell cultivation technicians. In addition, the company provides consultation services on training of expertise regarding treatment practice; and support services for the assessment of therapies, documentation required for treatment practice, and cognition and information providing activities for physicians and patients. tella, Inc. was founded in 2004 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-0023",
        "website": "http://www.tella.jp",
        "market_cap": 5647943168
    },
    "2342.T": {
        "short_name": "TRANS GENIC INC",
        "long_name": "Trans Genic Inc.",
        "summary": "Trans Genic Inc. develops, distributes, and licenses genetically engineered animals and antibodies in Japan. The company provides information of approximately 750 knockout mouse strains; 2,000 knockout ES clones produced by the exchangeable gene-trap method; 900 knockout mouse strains, as well as 750 phenotypic data centering on target genes for drug discovery. It also engages in the custom production of genetically engineered mice comprising conventional, conditional, and knock-in mice, as well as transgenic mice; and customized mouse-related analysis, such as speed congenics and phenotype analysis, including blood examination, as well as cryopreservation of embryo and sperm, and housing and breeding activities. In addition, the company provides mouse-related products, such as circadian locomotor output cycles kaput mice used as disease models; frozen embryos used to produce genetically engineered mice; and electronic instruction manual of reproduction technology for embryo manipulation, as well as approximately 600 antibody products. Further, it offers contract services for drug efficiency and pharmacological, safety pharmacological, disposition, and pharmacokinetic studies. Additionally, the company provides drug discovery support services, such as clinical and nonclinical pharmacological tests for Parkinson's and Alzheimer's diseases; and high density human tissue microarrays for use in the assessment of drug target molecules. It is also involved in the custom production of high-affinity, monoclonal, and polyclonal antibodies; and protein hyper-producing cells, as well as the provision of antibody purification and labeling, and peptide synthesis services. The company was formerly known as Kumamoto Immunochemical Laboratories Inc. and changed its name to Trans Genic Inc. in April 2000. Trans Genic Inc. was founded in 1998 and is headquartered in Fukuoka, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuoka",
        "zipcode": "810-0001",
        "website": "http://www.transgenic.co.jp",
        "market_cap": 9569602560
    },
    "2370.T": {
        "short_name": "MEDINET CO LTD",
        "long_name": "MEDINET Co., Ltd.",
        "summary": "MEDINET Co., Ltd. operates as a contract development and manufacturing organization that provides regenerative medicine and cell therapy solutions in Japan. Its solutions include technical know-how, facilities, systems, materials, professional cell-engineers, and other requirements to conduct immuno-cell therapy. The company also manufactures regenerative medical/investigational and specified cell products. In addition, its value chain solutions include personnel training, facility and equipment design, facility operations and management, preparation of standard operating procedures, logistics network, information system, purchasing and production management, quality management system, quality control and assurance, and technology transfer and process development solutions. The company supports medical institutions, research institutions, and biopharmaceutical companies to conduct immuno-cell therapy. MEDINET Co., Ltd. was founded in 1995 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "143-0006",
        "website": "http://www.medinet-inc.co.jp",
        "market_cap": 10007030784
    },
    "2385.T": {
        "short_name": "SOIKEN HOLDINGS INC",
        "long_name": "Soiken Holdings Inc.",
        "summary": "Soiken Holdings Inc. engages in the development of biomarkers in Japan. The company is involved in the development and sale of cosmetics and dietary supplements; licensing and development of biomarker technology; provision of marketing research and post-marketing surveys for dietary supplements; and research, development, and sale of functional materials, such as lactoferrin, as well as pharmaceutical products from ascochlorin derivatives and other compounds. It also provides clinical evaluation tests for foodstuffs using biomarker technology; support for clinical research and epidemiology studies; and services to health insurance societies, including contracted health guidance, specific health checkup promotion services for the dependents of insured, and service to prevent diabetes. The company was founded in 1994 and is headquartered in Toyonaka, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Toyonaka",
        "zipcode": "560-0082",
        "website": "http://www.soiken.com",
        "market_cap": 12634411008
    },
    "2OB.F": {
        "short_name": "ONCOLYS BIOPHARMA INC.",
        "long_name": "Oncolys BioPharma Inc.",
        "summary": "Oncolys BioPharma Inc. engages in the research, development, manufacture, sale, import, and export of oncolytic viruses, drugs and medicines, and tumor diagnostic agents in Japan, the rest of Asia, and the United States. The company operates in two segments, Pharmaceutical Business and Diagnostic Business. Its product pipeline includes Telomelysin (OBP-301), an oncolytic adenovirus that is in phase II clinical trial for the treatment of gastric cancer/gastroesophageal junction, head and neck, and esophageal cancers; and in phase I clinical trial for the treatment of hepatocellular carcinoma. The company's product pipeline also includes OBP-702, a telomerase-specific oncolytic adenovirus, which is in pre-clinical trial for the treatment of solid tumors; OBP-2001, which is in pre-clinical trial for the treatment of SARS-Cov-2 virus infection; OBP-601 (Censavudine), a nucleotide reverse transcriptase inhibitor that has completed the phase IIb clinical trial for the treatment of HIV infection; and OBP-801, a histone deacetylase inhibitor, which is in phase I clinical trial for the treatment of solid tumors, as well as in pre-clinical trial for ophthalmic use. In addition, it develops TelomeScan (OBP-401 and OBP-1101), a cancer detection drug, for detecting living circulating tumor cells in blood from cancer patients. Further, the company provides diagnostic drugs, devices, and inspection services. It has various licensing agreements with Okayama University, Osaka University, Kyoto Prefectural University of Medicine, Kagoshima University, Astellas Pharma Inc., Yale University, Biologics Consulting Group, Inc., Lonza Houston, Inc., Geron Corporation, Medigen Biotechnology Corp., WONIK CUBE Corp., and Liquid Biotech USA, Inc. Oncolys BioPharma Inc. was incorporated in 2004 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0001",
        "website": "http://www.oncolys.com",
        "market_cap": 184125760
    },
    "2PD.SG": {
        "short_name": "PeptiDream Inc. Registered Shar",
        "long_name": "PeptiDream Inc.",
        "summary": "PeptiDream Inc., a biopharmaceutical company, engages in the discovery and development of constrained peptides, small molecules, and peptide-drug conjugate therapeutics. The company uses its Peptide Discovery Platform System platform for the development of peptides. PeptiDream Inc. has a collaboration with Merck & Co. Inc. for the discovery and development of peptide therapeutics capable of neutralizing the SARS-CoV-2 virus (COVID19) and potential coronavirus outbreaks; and a collaborative research and exclusive license agreement with Takeda Pharmaceutical Company Limited to develop peptide drug conjugates for neuromuscular diseases. The company was founded in 2006 and is headquartered in Kawasaki, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Kawasaki",
        "zipcode": "210-0821",
        "website": "http://www.peptidream.com",
        "market_cap": 4827257856
    },
    "30O.F": {
        "short_name": "ONCOTHERAPY SCIENCE INC.",
        "long_name": "OncoTherapy Science, Inc.",
        "summary": "OncoTherapy Science, Inc. researches and develops anti-cancer medicines and therapies in Japan. Its clinical development product pipeline includes small-molecule drugs, such as OTS167, a maternal embryonic leucine zipper kinase inhibitor that is in Phase I/II clinical trials for the treatment of acute myeloid leukemia, as well as in Phase I clinical trials for the treatment of breast cancer; and OTS964, a T-LAK cell-originated protein kinase inhibitor for the treatment of various cancer diseases. The company's clinical development product pipeline also comprise cancer- specific peptide vaccines, including S-588410, which is in Phase III clinical trials for the treatment esophageal cancer, as well as in Phase II clinical trials for the treatment of bladder cancer; S-488210 that is in Phase I/II clinical trials for the treatment of head and neck cancer; and S-588210, which is in Phase I clinical trials for the treatment of solid tumor. In addition, it is developing antibody drugs consisting of OTSA101, which is in Phase I clinical trials for synovial sarcoma; and KHK6640, an anti-amyloid beta peptide antibody that is Phase I clinical trials for Alzheimer's disease. Further, the company provides contract analysis services. OncoTherapy Science, Inc. was founded in 2001 and is headquartered in Kawasaki, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Kawasaki",
        "zipcode": "213-0012",
        "website": "http://www.oncotherapy.co.jp",
        "market_cap": 153705056
    },
    "3G6.F": {
        "short_name": "GNI GROUP LTD.",
        "long_name": "GNI Group Ltd.",
        "summary": "GNI Group Ltd., together with its subsidiaries, engages in the research, development, manufacture, and sale of pharmaceutical drugs and traditional Chinese medicines in Japan and internationally. It provides Etuary for the treatment of idiopathic pulmonary fibrosis. The company is also developing Etuary, which is in Phase III clinical trial for the treatment of connective tissue associated interstitial lung disease; and in clinical trial phase II and pre-phase III clinical trial pilot study for the treatment of radiation pneumonitis, as well as for the treatment of diabetic nephropathy. In addition, it is involved in developing F351, which is in Phase II clinical trial for the treatment of liver fibrosis; and F573 that is in pre-clinical phase for the treatment of acute on chronic liver failure, as well as Tamibarotene for the treatment of acute promyelocytic leukemia. The company was founded in 2001 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0023",
        "website": "http://www.gnipharma.com",
        "market_cap": 787441792
    },
    "3NQ.F": {
        "short_name": "NANOCARRIER CO. LTD",
        "long_name": "NanoCarrier Co., Ltd.",
        "summary": "NanoCarrier Co., Ltd. researches, develops, produces, and sells pharmaceutical products using micellar nanoparticle technology primarily for the treatment of cancer in Japan. Its product pipeline includes NC-6004 Cisplatin micelle for the treatment of pancreatic, head and neck, non-small cell lung, bladder, and biliary track cancers; and VB-111, a non-replicating Adeno 5 vector for the treatment of rGBM/ovarian cancer, etc. The company's product pipeline also comprise NC-6300 Epirubicin micelle for soft tissue sarcoma; NC-4016 Dach-platinum micelle for solid cancers; and NK105 Paclitaxel micella for the treatment of breast and gastric cancers. NanoCarrier Co., Ltd. was founded in 1996 and is headquartered in Kashiwa, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Kashiwa",
        "zipcode": "277-0871",
        "website": "http://www.nanocarrier.co.jp",
        "market_cap": 157621648
    },
    "4563.T": {
        "short_name": "ANGES INC",
        "long_name": "AnGes, Inc.",
        "summary": "AnGes, Inc., a biopharmaceutical company, engages in the research and development of gene-based medical products. Its lead product is Hepatocyte Growth Factor (HGF) Plasmid, a gene therapy for the treatment of critical limb ischemia, a serious impairment of blood circulation in the leg. The company is also developing NF-kB Decoy Oligonucleotide, a nucleic acid medicine that suppresses inflammation for diseases, including low back pain; drugs for treating atopic dermatitis and disc degeneration; medical devices for the prevention of vascular restenosis; cervical intraepithelial neoplasia therapeutic vaccines for cervical cancer; and DNA vaccines for high blood pressure through collaborative research agreement with Osaka University. AnGes, Inc. has alliances with BioMarin Pharmaceutical Inc. to market Naglazyme, a drug for the treatment of mucopolysaccharidosis VI in Japan; and Mitsubishi Tanabe Pharma Corporation for marketing HGF Plasmid for the treatment of peripheral arterial disease in the United States and Japan. It also has alliances with SHIONOGI & CO., LTD. for the marketing of drugs for external use containing NF-kB decoy oligonucleotide for skin diseases; Vical, Inc. for the development and marketing of Allovectin for cancer treatment; and Osaka University to develop a coronavirus vaccine. In addition, the company has a collaboration agreement with Brickell Biotech, Inc. to develop investigational plasmid DNA vaccine intended to prevent coronavirus in the United States, South America, and other markets. The company was formerly known as AnGes MG, Inc. and changed its name to AnGes, Inc. in July 2017. AnGes, Inc. was founded in 1999 and is headquartered in Ibaraki, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Ibaraki",
        "zipcode": "567-0085",
        "website": "http://www.anges.co.jp",
        "market_cap": 132395696128
    },
    "4564.T": {
        "short_name": "ONCOTHERAPY SCIENCE INC",
        "long_name": "OncoTherapy Science, Inc.",
        "summary": "OncoTherapy Science, Inc. researches and develops anti-cancer medicines and therapies in Japan. Its clinical development product pipeline includes small-molecule drugs, such as OTS167, a maternal embryonic leucine zipper kinase inhibitor that is in Phase I/II clinical trials for the treatment of acute myeloid leukemia, as well as in Phase I clinical trials for the treatment of breast cancer; and OTS964, a T-LAK cell-originated protein kinase inhibitor for the treatment of various cancer diseases. The company's clinical development product pipeline also comprise cancer- specific peptide vaccines, including S-588410, which is in Phase III clinical trials for the treatment esophageal cancer, as well as in Phase II clinical trials for the treatment of bladder cancer; S-488210 that is in Phase I/II clinical trials for the treatment of head and neck cancer; and S-588210, which is in Phase I clinical trials for the treatment of solid tumor. In addition, it is developing antibody drugs consisting of OTSA101, which is in Phase I clinical trials for synovial sarcoma; and KHK6640, an anti-amyloid beta peptide antibody that is Phase I clinical trials for Alzheimer's disease. Further, the company provides contract analysis services. OncoTherapy Science, Inc. was founded in 2001 and is headquartered in Kawasaki, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kawasaki",
        "zipcode": "213-0012",
        "website": "http://www.oncotherapy.co.jp",
        "market_cap": 20101847040
    },
    "4565.T": {
        "short_name": "SOSEI GROUP CORP",
        "long_name": "Sosei Group Corporation",
        "summary": "Sosei Group Corporation discovers, develops, and commercializes biopharmaceutical products worldwide. Its marketed products include Ultibro/Breezhaler and Seebri/Breezhaler for the treatment of chronic obstructive pulmonary disease; Enerzair to treat asthma; and ORAVI, an oropharyngeal candidiasis. The company's product pipeline consists of AZD4635, an adenosine A2a antagonist, which is in Phase II clinical trial for the treatment of tumors and metastatic castration resistant prostate cancer; HTL0022562, a calcitonin gene related peptide antagonist, which is in pre-clinical stage to treat migraine and other severe headaches; PF-07081532 and PF-07054894, which are in Phase l for use in multiple therapeutic areas; HTL0014242, a mGlu5 small molecule negative-allosteric modulator, which is in Phase I clinical trial to treat neurological order; GPR35 agonist to treat inflammatory bowel disease; and KY1051, which is in preclinical stage for the treatment of immuno-oncology. It also offers HTL0016878, a muscarinic M4 receptor agonist, which is in Phase I clinical trial for the treatment of Alzheimer's disease; SSTR agonist, a novel somatostatin peptide agonist, which is in Phase I clinical trial to treat endocrine disorders; GLP-1 antagonist, which is in pre-clinical stage for the treatment of severe hypoglycaemia in rare diseases; H4 antagonist, which is in preclinical stage to treat atopic dermatitis; EP4 antagonist, which is in preclinical stage to mediate PGE2 immunosuppression; GLP-2 agonist, a potent glucagon-like peptide-2 agonist, which is in pre-clinical stage to treat intestinal disorder; GPR52 agonist to treat of neurology disease; and PAR2 mAb for the treatment of atopic dermatitis. Sosei Group Corporation has a strategic collaboration with Kymab; PeptiDream Inc; Pfizer; AbbVie; Biohaven; GSK; AstraZeneca; Novartis; Genentech; Takeda Pharmaceutical Company Limited; and Metrion Biosciences Limited. The company was incorporated in 1990 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0083",
        "website": "http://soseiheptares.com",
        "market_cap": 132255236096
    },
    "4571.T": {
        "short_name": "NANOCARRIER CO LTD",
        "long_name": "NanoCarrier Co., Ltd.",
        "summary": "NanoCarrier Co., Ltd. researches, develops, produces, and sells pharmaceutical products using micellar nanoparticle technology primarily for the treatment of cancer in Japan. Its product pipeline includes NC-6004 Cisplatin micelle for the treatment of pancreatic, head and neck, non-small cell lung, bladder, and biliary track cancers; and VB-111, a non-replicating Adeno 5 vector for the treatment of rGBM/ovarian cancer, etc. The company's product pipeline also comprise NC-6300 Epirubicin micelle for soft tissue sarcoma; NC-4016 Dach-platinum micelle for solid cancers; and NK105 Paclitaxel micella for the treatment of breast and gastric cancers. NanoCarrier Co., Ltd. was founded in 1996 and is headquartered in Kashiwa, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kashiwa",
        "zipcode": "277-0871",
        "website": "http://www.nanocarrier.co.jp",
        "market_cap": 21872470016
    },
    "4575.T": {
        "short_name": "CANBAS CO LTD",
        "long_name": "CanBas Co., Ltd.",
        "summary": "CanBas Co., Ltd., a clinical stage biopharmaceutical company, develops therapeutics for cancer patients. The company develops CBP501, a calmodulin modulator for the treatment of tumors. It also develops CBS9106, a small molecule reversible inhibitor of Exportin-1 that is in Phase I clinical trial for the treatment of solid tumors. The company has a collaboration alliance with Stemline Therapeutics, Inc. CanBas Co., Ltd. was founded in 2000 and is based in Numazu, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Numazu",
        "zipcode": "410-0801",
        "website": "http://www.canbas.co.jp",
        "market_cap": 2911428096
    },
    "4579.T": {
        "short_name": "RAQUALIA PHARMA INC",
        "long_name": "RaQualia Pharma Inc.",
        "summary": "RaQualia Pharma Inc. engages in the research and development of pharmaceutical compunds worldwide. The company offers Tegoprazan for gastroesophageal reflux diseases; ziprasidone for treatment of schizophrenia; Galliprant for pain management of dogs; and ENTYCE for treatment of anorexia of dogs. It also provides Cyclooxygenase-2 Inhibitor that is in Phase I clinical trial for pain; and Grapiprant which is in phase I and II clinical trials for cancer immunotherapy, as well as in phase I clinical trial for indication of pain. In addition, the company is developing potassium-competitive acid blocker for gastro-esophageal reflux disease; 5-HT2B Antagonist that has completed Phase I clinical trial for the treatment of irritable bowel syndrome; 5-HT4 Partial Agonist for gastroparesis, functional dyspepsia, and chronic constipation; and Motilin Receptor Agonist for gastroparesis, functional dyspepsia, and post-operative ileus. Further, it develops Ghrelin Receptor Agonist for the treatment of cancer-related anorexia/cachexia syndrome and spinal cord injury constipation; Selective Sodium Channel Blocker; Specific Ion Channels; P2X7 Receptor Antagonist for neuropathic pain; and TRPM8 Blocker Compounds for neuropathic pain. Additionally, the company licenses and sells intellectual property for pharmaceutical compounds and candidate compounds for clinical development. It has a collaborative agreement with Interprotein Corporation, ASKA Pharmaceutical. Co., Ltd., and Epigeneron, Inc. The company was founded in 2008 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "450-0003",
        "website": "http://www.raqualia.co.jp",
        "market_cap": 22837243904
    },
    "4583.T": {
        "short_name": "CHIOME BIOSCIENCE INC",
        "long_name": "Chiome Bioscience Inc.",
        "summary": "Chiome Bioscience Inc. engages in the research and development of drug discovery technology platforms worldwide. The company operates through two segments, Drug Discovery and Development Business; and Drug Discovery Support Business. It offers ADLib System, a monoclonal antibody generating system for drug discovery and development. The company also provides protein expression and purification services; stable cell line generation services for recombinant protein and antibody production; and antibody generation services using the ADLib system or B cell cloning techniques. Its product pipeline includes ADCT-701, an anti-dlk1 antibody for treating liver cancer; CBA-1205, an afucosylated anti-dlk1 antibody for liver cancer, lung cancer, neuroblastoma, etc.; CBA-1535, an anti 5T4/WAIF1 antibody for malignant mesothelioma, small cell lung cancer, non-small cell lung cancer, breast cancer (TNBC), etc.; LIV-2008/2008b, an anti-TROP-2 antibody for the treatment of TNBC, lung cancer, colorectal cancer, etc.; and BMAA, an anti-semphorin3a antibody for treating diabetic macular edema. The company serves universities, research institutions, and pharmaceutical companies. Chiome Bioscience Inc. was founded in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "151-0071",
        "website": "http://www.chiome.co.jp",
        "market_cap": 9871392768
    },
    "4587.T": {
        "short_name": "PEPTIDREAM INC",
        "long_name": "PeptiDream Inc.",
        "summary": "PeptiDream Inc., a biopharmaceutical company, engages in the discovery and development of constrained peptides, small molecules, and peptide-drug conjugate therapeutics. The company uses its Peptide Discovery Platform System platform for the development of peptides. PeptiDream Inc. has a collaboration with Merck & Co. Inc. for the discovery and development of peptide therapeutics capable of neutralizing the SARS-CoV-2 virus (COVID19) and potential coronavirus outbreaks; and a collaborative research and exclusive license agreement with Takeda Pharmaceutical Company Limited to develop peptide drug conjugates for neuromuscular diseases. The company was founded in 2006 and is headquartered in Kawasaki, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kawasaki",
        "zipcode": "210-0821",
        "website": "http://www.peptidream.com",
        "market_cap": 645235998720
    },
    "4588.T": {
        "short_name": "ONCOLYS BIOPHARMA INC",
        "long_name": "Oncolys BioPharma Inc.",
        "summary": "Oncolys BioPharma Inc. engages in the research, development, manufacture, sale, import, and export of oncolytic viruses, drugs and medicines, and tumor diagnostic agents in Japan, the rest of Asia, and the United States. The company operates in two segments, Pharmaceutical Business and Diagnostic Business. Its product pipeline includes Telomelysin (OBP-301), an oncolytic adenovirus that is in phase II clinical trial for the treatment of gastric cancer/gastroesophageal junction, head and neck, and esophageal cancers; and in phase I clinical trial for the treatment of hepatocellular carcinoma. The company's product pipeline also includes OBP-702, a telomerase-specific oncolytic adenovirus, which is in pre-clinical trial for the treatment of solid tumors; OBP-2001, which is in pre-clinical trial for the treatment of SARS-Cov-2 virus infection; OBP-601 (Censavudine), a nucleotide reverse transcriptase inhibitor that has completed the phase IIb clinical trial for the treatment of HIV infection; and OBP-801, a histone deacetylase inhibitor, which is in phase I clinical trial for the treatment of solid tumors, as well as in pre-clinical trial for ophthalmic use. In addition, it develops TelomeScan (OBP-401 and OBP-1101), a cancer detection drug, for detecting living circulating tumor cells in blood from cancer patients. Further, the company provides diagnostic drugs, devices, and inspection services. It has various licensing agreements with Okayama University, Osaka University, Kyoto Prefectural University of Medicine, Kagoshima University, Astellas Pharma Inc., Yale University, Biologics Consulting Group, Inc., Lonza Houston, Inc., Geron Corporation, Medigen Biotechnology Corp., WONIK CUBE Corp., and Liquid Biotech USA, Inc. Oncolys BioPharma Inc. was incorporated in 2004 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0001",
        "website": "http://www.oncolys.com",
        "market_cap": 24882462720
    },
    "4591.T": {
        "short_name": "RIBOMIC INC",
        "long_name": "Ribomic Inc.",
        "summary": "Ribomic Inc. discovers and develops pharmaceutical compounds using RNA aptamers in Japan. It develops drugs in the areas of pain, heart failure, achondroplasia, osteoarthritis, osteosclerosis, and fibrosis, as well as age-related macular degeneration. Ribomic Inc. has a joint research and development agreement with ASKA Pharmaceutical Co., Ltd. for drug discovery research and development targeting specific hormone receptors. The company was incorporated in 2003 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0071",
        "website": "http://www.ribomic.com",
        "market_cap": 9405265920
    },
    "4592.T": {
        "short_name": "SANBIO COMPANY LIMITED",
        "long_name": "SanBio Company Limited",
        "summary": "SanBio Company Limited develops, produces, and sells regenerative cell medicines for the central nervous system. The company develops SB623 that has completed a phase 2 clinical trial to treat traumatic brain injury in the United States and Japan. Its research pipeline products also comprise SB623 for ischemic and hemorrhagic strokes, age-related macular degeneration, retinitis pigments, spinal cord injury, Parkinson's disease, Alzheimer's disease, and others; SB618 for peripheral nerve damage; SB308 for muscular dystrophy disease; MSC1 for cancer; and MSC2 for inflammatory disease and optic neuritis. The company was founded in 2001 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0044",
        "website": "http://www.sanbio.jp",
        "market_cap": 79855403008
    },
    "4593.T": {
        "short_name": "HEALIOS KK",
        "long_name": "Healios K.K.",
        "summary": "Healios K.K. engages in the research and development, manufacture, and sale of cell therapy and regenerative medicine products in Japan, Europe, and the United States. The company is also developing cellular and tissue-based products comprising HLCR011 and HLCR012 that are iPSC regenerative medicines for the treatment of age-related macular degeneration; HLCL041, an iPSC regenerative medicine for the treatment of metabolic liver disease; and HLCM051, a regenerative medicine for treatment of ischemic stroke and acute respiratory distress syndrome, as well as HLCN061 for treating solid tumors. The company was formerly known as Retina Institute Japan, K.K. and changed its name to Healios K.K. in September 2013. Healios K.K. was incorporated in 2011 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0006",
        "website": "http://www.healios.co.jp",
        "market_cap": 95065989120
    },
    "4594.T": {
        "short_name": "BRIGHTPATH BIOTHERAPEUTICS CO L",
        "long_name": "BrightPath Biotherapeutics Co., Ltd.",
        "summary": "BrightPath Biotherapeutics Co., Ltd. develops cancer immunotherapy drugs. It develops ITK-1, a cancer peptide vaccine, which is in Phase III clinical study to treat prostate cancer. The company is also developing GRN-1201 that is in Phase II clinical study for the treatment of non-small cell lung cancer, as well as in Phase I clinical study to treat melanoma. Its products in research stage include GRN-1301, a drug resistant tumor-derived neoantigen for the treatment of non-small cell lung cancer; and iPS-NKT, an induced pluripotent stem cell derived regenerated NKT cell therapy. The company was formerly known as GreenPeptide Co., Ltd. and changed its name to BrightPath Biotherapeutics Co., Ltd. in July 2017. BrightPath Biotherapeutics Co., Ltd. was founded in 2003 and is headquartered in Kurume, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kurume",
        "zipcode": null,
        "website": "http://www.brightpathbio.com",
        "market_cap": 9240472576
    },
    "4596.T": {
        "short_name": "KUBOTA PHARMACEUTICAL HLDGS CO ",
        "long_name": "Kubota Pharmaceutical Holdings Co., Ltd.",
        "summary": "Kubota Pharmaceutical Holdings Co., Ltd. develops portfolio of drugs and devices in the ophthalmic field worldwide. Its product pipeline comprises emixustat hydrochloride, which is in Phase III clinical stage used for the treatment of stargardt disease, and Phase II clinical stage used for the treatment of proliferative diabetic retinopathy. The company is also developing human rhodopsin-based gene therapy for patients suffering from retinitis pigmentosa; a lanosterol-based pharmaceutical treatment for cataracts and presbyopia; and a small molecule pharmacologic treatment for age-related macular degeneration, diabetic macular edema, and other retinal neovascular conditions. In addition, it is developing home-based, patient self-monitoring optical coherence tomography devices. The company was founded in 2002 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0013",
        "website": "http://www.kubotaholdings.co.jp",
        "market_cap": 11694989312
    },
    "4599.T": {
        "short_name": "STEMRIM INC",
        "long_name": "StemRIM",
        "summary": "StemRIM, a biotechnology company, develops regeneration-guided medicines for the treatment of intractable diseases. The company focuses on the research and development of regeneration-inducing medicines that are applied to various diseases, such as epidermolysis bullosa, cerebral infarction, myocardial infarction/cardiomyopathy, and stem cell gene therapy, as well as autologous cell collection devices for treatment. It also provides PJ1 regeneration induction medicine HMGB1 peptides, PJ2 regeneration induction drug new peptides, and PJ3 regeneration-inducing proteins derived from living bodies; PJ4 therapeutic autologous cell collection device; and PJ5 stem cell gene therapy technology. StemRIM was founded in 2006 and is headquartered in Ibaraki, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Ibaraki",
        "zipcode": "567-0085",
        "website": "http://www.stemrim.com",
        "market_cap": 45802631168
    },
    "4880.T": {
        "short_name": "CELLSOURCE CO LTD",
        "long_name": "CellSource Co., Ltd.",
        "summary": "CellSource Co., Ltd. manufactures regenerative medicines. The company was founded in 2015 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0002",
        "website": "http://www.cellsource.co.jp",
        "market_cap": 80020619264
    },
    "4881.T": {
        "short_name": "FUNPEP COMPANY LTD",
        "long_name": "FunPep Company Limited",
        "summary": "FunPep Company Limited engages in the research and development of pharmaceuticals, cosmetics, and medical devices based on functional peptides. The company is developing SR-0379, an intractable skin ulcer drug; FPP003, an antibody-inducing peptide that is in Phase I/IIa clinical study for the treatment of psoriasis in Australia, as well as is in preclinical studies for ankylosing spondylitis in Japan; and FPP004, an antibody-inducing peptide for pollinosis. The company was founded in 2013 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "151-0051",
        "website": "http://www.funpep.co.jp",
        "market_cap": 8010124288
    },
    "4884.T": {
        "short_name": "KRINGLE PHARMA INC",
        "long_name": "Kringle Pharma, Inc.",
        "summary": "Kringle Pharma, Inc., a pharmaceutical biotechnology venture company, engages in the research and development of hepatocyte growth factor (HGF) protein medicines. The company develops HGF products for the treatment of acute spinal cord injury, amyotrophic lateral sclerosis (ALS), ALS acute kidney injury, and vocal fold scar. Kringle Pharma, Inc. was founded in 2001 and is based in Ibaraki, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Ibaraki",
        "zipcode": "567-0085",
        "website": "http://www.kringle-pharma.com",
        "market_cap": 3965209344
    },
    "4974.T": {
        "short_name": "TAKARA BIO INC",
        "long_name": "Takara Bio Inc.",
        "summary": "Takara Bio Inc., together with its subsidiaries, operates as a biotechnology company in Japan, the United States, China, other Asia, Europe, and internationally. The company operates through Bioindustry and Gene Therapy segments. It develops research reagents and scientific instruments; and provides contract development and manufacturing organization (CDMO) services for academic and corporate life sciences research and development. The company's CDMO services include contract service for developing regenerative medicine products; related services, such as quality and safety testing, and cell banking; and contract services for supporting genetic analysis and testing comprising human genome sequence analysis, analysis of cancerrelated genes, and intestinal flora analysis, as well as support services for genetic engineering research, such as genome editing using the latest technologies and equipment. It also engages in the development and commercialization of various gene therapies, including oncolytic virus utilizing Canerpaturev, which is an attenuated strain of the herpes simplex virus type 1 that exhibits antitumor activity upon local injection into a tumor due to tumor lysis; siTCR gene therapy, which is in Phase I/II clinical trials for the treatment of synovial sarcoma; and CD19 chimeric antigen receptors that is in Phase I/II clinical trial for the treatment of adult acute lymphoblastic leukemia. Additionally, the company offers RetroNectin for gene therapy. The company was founded in 2002 and is headquartered in Kusatsu, Japan. Takara Bio Inc. is a subsidiary of Takara Holdings Inc.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kusatsu",
        "zipcode": "525-0058",
        "website": "http://www.takara-bio.com",
        "market_cap": 357635522560
    },
    "4978.T": {
        "short_name": "REPROCELL INCORPORATED",
        "long_name": "ReproCELL Incorporated",
        "summary": "ReproCELL Incorporated operates as a stem cell research company in Japan. It offers stem cell reagents, including RNA reprogramming, small molecules, growth factors and cytokines, antibodies and staining kits, pluripotent stem cell culture media, cell substrates, cryopreservation media, dissociation solution, and transfection reagents; differentiated induced pluripotent stem cell (iPSC) and related reagents, and feeder cells; and 3D cell culture, labware, and drug discovery assays. The company also provides stem cell services, such as target cell isolation, iPSC reprogramming, and cell differentiation, as well as iPSC expansion, characterization, and banking services; and predictive drug discovery services in the areas of cardiac, vascular, respiratory, gastrointestinal, ADME/DMPK, skin/skin model, genitourinary, comparative pharmacology, and other assays. In addition, it offers human tissue samples, prospective collections, molecular, 3D cell, primary cell isolation, and DNA and RNA extraction services. ReproCELL Incorporated was founded in 2003 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "222-0033",
        "website": "http://www.reprocell.com",
        "market_cap": 25002459136
    },
    "6090.T": {
        "short_name": "HUMAN METABOLOME TECHNOLOGIES I",
        "long_name": "Human Metabolome Technologies, Inc.",
        "summary": "Human Metabolome Technologies, Inc., biotechnology company, develops metabolomics technologies and solutions for drug discovery, diagnosis, and food production in Japan. The company provides metabolome analysis services; and global profiling, targeted assays, flux analysis, and lipidomics services. It also develops biomarkers, such as Phosphorylethanolamine, a biomarker for major depressive disorder and measured in blood plasma. The company offers solutions for cancer metabolism, metabolic flux analysis, infectious diseases, basic science, preclinical and clinical, food and nutrition, and microbiome applications. It has a collaboration with the Institute for Advanced Biosciences and Keio University for the development of metabolome analysis technology. The company was incorporated in 2003 and is headquartered in Tsuruoka, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tsuruoka",
        "zipcode": "997-0052",
        "website": "http://www.humanmetabolome.com",
        "market_cap": 5276642304
    },
    "6190.T": {
        "short_name": "PHOENIXBIO CO LTD",
        "long_name": "PhoenixBio Co., Ltd.",
        "summary": "PhoenixBio Co., Ltd. provides contract study services for drug discovery and development primarily in Japan. The company uses PXB-mouse, a chimeric mouse with a humanized liver for use in drug development experiments. Its contract study services in the field of drug discovery and development includes DMPK studies; safety studies; viral hepatitis-related studies; efficacy and safety studies for human specific nucleic acids, antibody, or polypeptide medicines; and in vitro studies using fresh human hepatocytes taken from PXB-cells. The company was founded in 2002 and is headquartered in Higashihiroshima, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Higashihiroshima",
        "zipcode": "739-0046",
        "website": "http://www.phoenixbio.co.jp",
        "market_cap": 2009071872
    },
    "6RC.F": {
        "short_name": "REPROCELL INC.",
        "long_name": "ReproCELL Incorporated",
        "summary": "ReproCELL Incorporated operates as a stem cell research company in Japan. It offers stem cell reagents, including RNA reprogramming, small molecules, growth factors and cytokines, antibodies and staining kits, pluripotent stem cell culture media, cell substrates, cryopreservation media, dissociation solution, and transfection reagents; differentiated induced pluripotent stem cell (iPSC) and related reagents, and feeder cells; and 3D cell culture, labware, and drug discovery assays. The company also provides stem cell services, such as target cell isolation, iPSC reprogramming, and cell differentiation, as well as iPSC expansion, characterization, and banking services; and predictive drug discovery services in the areas of cardiac, vascular, respiratory, gastrointestinal, ADME/DMPK, skin/skin model, genitourinary, comparative pharmacology, and other assays. In addition, it offers human tissue samples, prospective collections, molecular, 3D cell, primary cell isolation, and DNA and RNA extraction services. ReproCELL Incorporated was founded in 2003 and is headquartered in Yokohama, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "222-0033",
        "website": "http://www.reprocell.com",
        "market_cap": 188554592
    },
    "6VX.F": {
        "short_name": "HEALIOS K.K.",
        "long_name": "Healios K.K.",
        "summary": "Healios K.K. engages in the research and development, manufacture, and sale of cell therapy and regenerative medicine products in Japan, Europe, and the United States. The company is also developing cellular and tissue-based products comprising HLCR011 and HLCR012 that are iPSC regenerative medicines for the treatment of age-related macular degeneration; HLCL041, an iPSC regenerative medicine for the treatment of metabolic liver disease; and HLCM051, a regenerative medicine for treatment of ischemic stroke and acute respiratory distress syndrome, as well as HLCN061 for treating solid tumors. The company was formerly known as Retina Institute Japan, K.K. and changed its name to Healios K.K. in September 2013. Healios K.K. was incorporated in 2011 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0006",
        "website": "http://www.healios.co.jp",
        "market_cap": 713018432
    },
    "7774.T": {
        "short_name": "JAPAN TISSUE ENGINEERING CO LTD",
        "long_name": "Japan Tissue Engineering Co., Ltd.",
        "summary": "Japan Tissue Engineering Co., Ltd. engages in the regenerative medicine business in Japan. The company offers autologous cultured epidermis and cartilage to medical institutions for the purpose of medical treatment. It also provides tissue-engineered medical products, which are used in autologous transplant cases, where living cells are taken from the actual patient himself, cultured, and then transplanted back to the same patient. In addition, the company researches and develops human 3-dimensional cultured tissue models for use in the development of cosmetics and drugs for external use, as well as in research that employs skin and cornea tissues. Further, it offers regenerative medical products contract development and manufacturing, and contract research services. Japan Tissue Engineering Co., Ltd. was founded in 1999 and is headquartered in Gamagori, As of March 2, 2021, Japan Tissue Engineering Co., Ltd. operates as a subsidiary of Teijin Limited.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Gamagori",
        "zipcode": "443-0022",
        "website": "http://www.jpte.co.jp",
        "market_cap": 32609830912
    },
    "7776.T": {
        "short_name": "CELLSEED INC",
        "long_name": "CellSeed Inc.",
        "summary": "CellSeed Inc. develops regenerative medicine products primarily in Japan and internationally. It is involved in the research, development, and commercialization of cell-sheet regenerative medicine products, such as epithelial cell sheet for esophageal regeneration, regenerated cartilage sheet, and chondrocyte sheet for the treatment of knee osteoarthritis. The company also offers UpCell, a temperature-responsive cell cultureware for cell-sheet engineering; RepCell, a temperature-responsive cell cutureware for cell collection; and HydroCell, a low cell binding cultureware. In addition, it provides contract development and manufacturing services. The company was founded in 2001 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "135-0064",
        "website": "http://www.cellseed.com",
        "market_cap": 3883214848
    },
    "AJW.F": {
        "short_name": "ANGES, INC.",
        "long_name": "AnGes, Inc.",
        "summary": "AnGes, Inc., a biopharmaceutical company, engages in the research and development of gene-based medical products. Its lead product is Hepatocyte Growth Factor (HGF) Plasmid, a gene therapy for the treatment of critical limb ischemia, a serious impairment of blood circulation in the leg. The company is also developing NF-kB Decoy Oligonucleotide, a nucleic acid medicine that suppresses inflammation for diseases, including low back pain; drugs for treating atopic dermatitis and disc degeneration; medical devices for the prevention of vascular restenosis; cervical intraepithelial neoplasia therapeutic vaccines for cervical cancer; and DNA vaccines for high blood pressure through collaborative research agreement with Osaka University. AnGes, Inc. has alliances with BioMarin Pharmaceutical Inc. to market Naglazyme, a drug for the treatment of mucopolysaccharidosis VI in Japan; and Mitsubishi Tanabe Pharma Corporation for marketing HGF Plasmid for the treatment of peripheral arterial disease in the United States and Japan. It also has alliances with SHIONOGI & CO., LTD. for the marketing of drugs for external use containing NF-kB decoy oligonucleotide for skin diseases; Vical, Inc. for the development and marketing of Allovectin for cancer treatment; and Osaka University to develop a coronavirus vaccine. In addition, the company has a collaboration agreement with Brickell Biotech, Inc. to develop investigational plasmid DNA vaccine intended to prevent coronavirus in the United States, South America, and other markets. The company was formerly known as AnGes MG, Inc. and changed its name to AnGes, Inc. in July 2017. AnGes, Inc. was founded in 1999 and is headquartered in Ibaraki, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Ibaraki",
        "zipcode": "567-0085",
        "website": "http://www.anges.co.jp",
        "market_cap": 948631104
    },
    "HLOSF": {
        "short_name": "HEALIOS KK",
        "long_name": "Healios K.K.",
        "summary": "Healios K.K. engages in the research and development, manufacture, and sale of cell therapy and regenerative medicine products in Japan, Europe, and the United States. The company is also developing cellular and tissue-based products comprising HLCR011 and HLCR012 that are iPSC regenerative medicines for the treatment of age-related macular degeneration; HLCL041, an iPSC regenerative medicine for the treatment of metabolic liver disease; and HLCM051, a regenerative medicine for treatment of ischemic stroke and acute respiratory distress syndrome, as well as HLCN061 for treating solid tumors. The company was formerly known as Retina Institute Japan, K.K. and changed its name to Healios K.K. in September 2013. Healios K.K. was incorporated in 2011 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0006",
        "website": "http://www.healios.co.jp",
        "market_cap": 776481152
    },
    "JSS.F": {
        "short_name": "SOSEI GROUP CORP",
        "long_name": "Sosei Group Corporation",
        "summary": "Sosei Group Corporation discovers, develops, and commercializes biopharmaceutical products worldwide. Its marketed products include Ultibro/Breezhaler and Seebri/Breezhaler for the treatment of chronic obstructive pulmonary disease; Enerzair to treat asthma; and ORAVI, an oropharyngeal candidiasis. The company's product pipeline consists of AZD4635, an adenosine A2a antagonist, which is in Phase II clinical trial for the treatment of tumors and metastatic castration resistant prostate cancer; HTL0022562, a calcitonin gene related peptide antagonist, which is in pre-clinical stage to treat migraine and other severe headaches; PF-07081532 and PF-07054894, which are in Phase l for use in multiple therapeutic areas; HTL0014242, a mGlu5 small molecule negative-allosteric modulator, which is in Phase I clinical trial to treat neurological order; GPR35 agonist to treat inflammatory bowel disease; and KY1051, which is in preclinical stage for the treatment of immuno-oncology. It also offers HTL0016878, a muscarinic M4 receptor agonist, which is in Phase I clinical trial for the treatment of Alzheimer's disease; SSTR agonist, a novel somatostatin peptide agonist, which is in Phase I clinical trial to treat endocrine disorders; GLP-1 antagonist, which is in pre-clinical stage for the treatment of severe hypoglycaemia in rare diseases; H4 antagonist, which is in preclinical stage to treat atopic dermatitis; EP4 antagonist, which is in preclinical stage to mediate PGE2 immunosuppression; GLP-2 agonist, a potent glucagon-like peptide-2 agonist, which is in pre-clinical stage to treat intestinal disorder; GPR52 agonist to treat of neurology disease; and PAR2 mAb for the treatment of atopic dermatitis. Sosei Group Corporation has a strategic collaboration with Kymab; PeptiDream Inc; Pfizer; AbbVie; Biohaven; GSK; AstraZeneca; Novartis; Genentech; Takeda Pharmaceutical Company Limited; and Metrion Biosciences Limited. The company was incorporated in 1990 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0083",
        "website": "http://soseiheptares.com",
        "market_cap": 994566784
    },
    "PPTDF": {
        "short_name": "PEPTIDREAM INC",
        "long_name": "PeptiDream Inc.",
        "summary": "PeptiDream Inc., a biopharmaceutical company, engages in the discovery and development of constrained peptides, small molecules, and peptide-drug conjugate therapeutics. The company uses its Peptide Discovery Platform System platform for the development of peptides. PeptiDream Inc. has a collaboration with Merck & Co. Inc. for the discovery and development of peptide therapeutics capable of neutralizing the SARS-CoV-2 virus (COVID19) and potential coronavirus outbreaks; and a collaborative research and exclusive license agreement with Takeda Pharmaceutical Company Limited to develop peptide drug conjugates for neuromuscular diseases. The company was founded in 2006 and is headquartered in Kawasaki, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Kawasaki",
        "zipcode": "210-0821",
        "website": "http://www.peptidream.com",
        "market_cap": 5463152128
    },
    "SOLTF": {
        "short_name": "SOSEI GROUP CORP",
        "long_name": "Sosei Group Corporation",
        "summary": "Sosei Group Corporation discovers, develops, and commercializes biopharmaceutical products worldwide. Its marketed products include Ultibro/Breezhaler and Seebri/Breezhaler for the treatment of chronic obstructive pulmonary disease; Enerzair to treat asthma; and ORAVI, an oropharyngeal candidiasis. The company's product pipeline consists of AZD4635, an adenosine A2a antagonist, which is in Phase II clinical trial for the treatment of tumors and metastatic castration resistant prostate cancer; HTL0022562, a calcitonin gene related peptide antagonist, which is in pre-clinical stage to treat migraine and other severe headaches; PF-07081532 and PF-07054894, which are in Phase l for use in multiple therapeutic areas; HTL0014242, a mGlu5 small molecule negative-allosteric modulator, which is in Phase I clinical trial to treat neurological order; GPR35 agonist to treat inflammatory bowel disease; and KY1051, which is in preclinical stage for the treatment of immuno-oncology. It also offers HTL0016878, a muscarinic M4 receptor agonist, which is in Phase I clinical trial for the treatment of Alzheimer's disease; SSTR agonist, a novel somatostatin peptide agonist, which is in Phase I clinical trial to treat endocrine disorders; GLP-1 antagonist, which is in pre-clinical stage for the treatment of severe hypoglycaemia in rare diseases; H4 antagonist, which is in preclinical stage to treat atopic dermatitis; EP4 antagonist, which is in preclinical stage to mediate PGE2 immunosuppression; GLP-2 agonist, a potent glucagon-like peptide-2 agonist, which is in pre-clinical stage to treat intestinal disorder; GPR52 agonist to treat of neurology disease; and PAR2 mAb for the treatment of atopic dermatitis. Sosei Group Corporation has a strategic collaboration with Kymab; PeptiDream Inc; Pfizer; AbbVie; Biohaven; GSK; AstraZeneca; Novartis; Genentech; Takeda Pharmaceutical Company Limited; and Metrion Biosciences Limited. The company was incorporated in 1990 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0083",
        "website": "http://soseiheptares.com",
        "market_cap": 1016264960
    },
    "TF2.F": {
        "short_name": "TAKARA BIO INC.",
        "long_name": "Takara Bio Inc.",
        "summary": "Takara Bio Inc., together with its subsidiaries, operates as a biotechnology company in Japan, the United States, China, other Asia, Europe, and internationally. The company operates through Bioindustry and Gene Therapy segments. It develops research reagents and scientific instruments; and provides contract development and manufacturing organization (CDMO) services for academic and corporate life sciences research and development. The company's CDMO services include contract service for developing regenerative medicine products; related services, such as quality and safety testing, and cell banking; and contract services for supporting genetic analysis and testing comprising human genome sequence analysis, analysis of cancerrelated genes, and intestinal flora analysis, as well as support services for genetic engineering research, such as genome editing using the latest technologies and equipment. It also engages in the development and commercialization of various gene therapies, including oncolytic virus utilizing Canerpaturev, which is an attenuated strain of the herpes simplex virus type 1 that exhibits antitumor activity upon local injection into a tumor due to tumor lysis; siTCR gene therapy, which is in Phase I/II clinical trials for the treatment of synovial sarcoma; and CD19 chimeric antigen receptors that is in Phase I/II clinical trial for the treatment of adult acute lymphoblastic leukemia. Additionally, the company offers RetroNectin for gene therapy. The company was founded in 2002 and is headquartered in Kusatsu, Japan. Takara Bio Inc. is a subsidiary of Takara Holdings Inc.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Kusatsu",
        "zipcode": "525-0058",
        "website": "http://www.takara-bio.com",
        "market_cap": 2557736960
    }
}