{
    "0YX.F": {
        "short_name": "SYSMEX CORP.",
        "long_name": "Sysmex Corporation",
        "summary": "Sysmex Corporation, together with its subsidiaries, engages in the development, manufacture, and sale of diagnostic instruments, reagents, and related software in Japan. The company offers three-part and five-part white blood cell differentiation instruments for use in hematology; and transport systems for high-volume testing in labs. It also provides urine formed sediment analysis systems; automated immunochemistry systems, which perform assays on minute sample quantities, as well as reagents to test for infectious disease and tumor markers; and flow cytometers to perform analysis in diagnosing leukemia, malignant lymphoma, and HIV/AIDS. In addition, the company offers cancer lymph node metastasis testing systems to detect information to help in diagnosing lymph node metastasis; cancer genome profiling systems; and cytogenic testing and lab assay services. It is also involved in the development and sale of software for diagnostic information systems; provision of facility management, office, and welfare services; development, manufacture, and sale of nucleic acid analogs; development, operation, and maintenance of IT solutions, platforms, and applications related to digital medicine; marketing, development, design, manufacture, sale, and after-sales service related to medical robots; and distribution and after sales support of medical devices and reagents for biotechnology, medical technology, and molecular cell analysis. The company serves national and other public hospitals, private hospitals, universities, research institutes, other medical institutions, etc. It also exports its products to approximately 190 countries. The company was formerly known as TOA Medical Electronics Co., Ltd. and changed its name to Sysmex Corporation in October 1998. Sysmex Corporation was founded in 1968 and is headquartered in Kobe, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Kobe",
        "zipcode": "651-0073",
        "website": "http://www.sysmex.co.jp",
        "market_cap": "Large Cap"
    },
    "2309.T": {
        "short_name": "CMIC HLDGS CO LTD",
        "long_name": "CMIC HOLDINGS Co., Ltd.",
        "summary": "CMIC HOLDINGS Co., Ltd. provides various services for the pharmaceutical industry in Japan. The company operates in five segments: Contract Research Organization, Contract Development and Manufacturing Organization, Contract Sales Organization, Healthcare, and Innovative Pharma Model. It offers clinical trial services, including clinical operations and trials, data management, in-country clinical caretaker services, medical writing, patient recruitment, pharmacovigilance, project management, audit and quality assurance, and statistical analysis; and clinical site network, CMC, drug development, health economics and outcome research, market entry/out-licensing, medical devices and in vitro diagnostic consulting, medical writing, national health insurance pricing, and product life cycle management consulting services. The company also provides development and manufacturing services, including commercial supply, contract development and manufacturing, investigational product manufacturing, packaging and labeling, release and stability tests, technology transfer, as well as formulation, process, and analytical development services; and laboratory services, such as bioanalysis and GLP analysis, biomarkers, CMC and GMP analysis, large molecule, oligonucleotides, small molecule, and toxicity, as well as safety pharmacology, in vitro and in vivo, and non-clinical studies. In addition, it offers patient and healthcare services, such as drug adherence support program, harmo, Helc+, prescription drug database, and selcheck, as well as call center, medical affairs, and marketing authorization holder related services; and post-marketing surveillance, self-inspection, regulatory affairs consulting, regulatory submissions and correspondence, sales and marketing, clinical research coordinating, clinical site administration, and site management services. The company was incorporated in 1985 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0023",
        "website": "http://www.cmicgroup.com",
        "market_cap": "Large Cap"
    },
    "4544.T": {
        "short_name": "H.U. GROUP HLDGS INC",
        "long_name": "H.U. Group Holdings, Inc.",
        "summary": "H.U. Group Holdings, Inc., through its subsidiaries, primarily provides clinical laboratory testing services in Japan. Its clinical laboratory testing services include collecting consigned specimens of patients from hospitals, clinics, and other medical institutions; and conducting analyses and reporting the test results back to these institutions. The company provides testing services in the areas of endocrinology, oncology, plasma protein disorders, virology, immunoserology, immunohematology, blood coagulation system, biochemistry, drug analysis, genetics, human leukocyte antigen, cellular immunity, pathology, cytodiagnosis, and other medical scientific analysis. It also develops, manufactures, and sells in vitro diagnostic reagents and assay instruments for infectious diseases and tumors to medical institutions, commercial laboratories, and blood centers; provides healthcare related services, such as sterilizing and clinical trials support; and rents and sells nursing-care equipment and supplies. In addition, the company offers home-visit nursing and long-term care. The company was formerly known as Miraca Holdings Inc. and changed its name to H.U. Group Holdings, Inc. in July 2020. H.U. Group Holdings, Inc. was founded in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "163-0408",
        "website": "http://www.hugp.com",
        "market_cap": "Large Cap"
    },
    "4671.T": {
        "short_name": "FALCO HOLDINGS CO LTD",
        "long_name": "FALCO HOLDINGS Co., Ltd.",
        "summary": "FALCO HOLDINGS Co., Ltd., a medical service company, primarily provides clinical testing and dispensing pharmacy services to medical institutions and companies in Japan. It offers clinical testing services in the fields of genetic tests, biochemistry, hematology, pathology, immunology, microbiology, and radio immunoassay; genetic testing services; and genomic-based drug discovery and biotechnology drug development services. The company also provides medical information technology services; food sanitation and environmental testing services; and food related genetic testing services to food manufacturers, retailers, and restaurants. In addition, it is involved in the dispensing pharmacies and drugstores business; and development and sale of various medical information systems, including @home Dr. electronic medical charts for clinics with concentrated clinical testing, as well as TASCAL for ASP, a medical support system. The company was founded in 1962 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "604-0911",
        "website": "http://www.falco-hd.co.jp",
        "market_cap": "Large Cap"
    },
    "4694.T": {
        "short_name": "BML INC",
        "long_name": "BML, Inc.",
        "summary": "BML, Inc. provides laboratory testing and related services in Japan. The company offers general laboratory tests, including biochemical and hematologic examinations; special laboratory tests, such as RIA, cellular, immunological, and DNA analysis; microbiological tests for medical and pharmaceutical societies and organizations; and laboratory tests in tumorology, infectious disease, diabetes, hypertension, allergy, and genetic studies. It also develops Frontier and Symphony automation systems, which automate pre-processing procedures from sorting to dispensing, and subsequent test procedures; and provides electronic medical charts for networking medical information, as well as offers preventive medicine services. In addition, the company provides food sanitation control and food processing services comprising contract services for microorganism testing of raw materials, and prepared and processed foods; environmental hygiene testing of food processing facilities and kitchens; and microorganism testing services, as well as assesses genetically modified organisms. Further, it provides drinking water and waste water tests; work sanitation management services, such as measurement of ethylene oxide gas, formaldehyde, organic solvents, and dust; environmental monitoring services, including measurement of indoor contaminants and other indoor environmental variables; and biological dioxin monitoring services. Additionally, the company offers analysis services for residual agricultural chemicals; dental test services for dental caries and periodontal diseases; consulting services for the approval of pharmaceuticals; investigative analysis services to pharmaceutical manufacturers; and gene expression analysis and testing for genes that cause susceptibility to infectious diseases. BML, Inc. was founded in 1955 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.bml.co.jp",
        "market_cap": "Large Cap"
    },
    "6869.T": {
        "short_name": "SYSMEX CORP",
        "long_name": "Sysmex Corporation",
        "summary": "Sysmex Corporation, together with its subsidiaries, engages in the development, manufacture, and sale of diagnostic instruments, reagents, and related software in Japan. The company offers three-part and five-part white blood cell differentiation instruments for use in hematology; and transport systems for high-volume testing in labs. It also provides urine formed sediment analysis systems; automated immunochemistry systems, which perform assays on minute sample quantities, as well as reagents to test for infectious disease and tumor markers; and flow cytometers to perform analysis in diagnosing leukemia, malignant lymphoma, and HIV/AIDS. In addition, the company offers cancer lymph node metastasis testing systems to detect information to help in diagnosing lymph node metastasis; cancer genome profiling systems; and cytogenic testing and lab assay services. It is also involved in the development and sale of software for diagnostic information systems; provision of facility management, office, and welfare services; development, manufacture, and sale of nucleic acid analogs; development, operation, and maintenance of IT solutions, platforms, and applications related to digital medicine; marketing, development, design, manufacture, sale, and after-sales service related to medical robots; and distribution and after sales support of medical devices and reagents for biotechnology, medical technology, and molecular cell analysis. The company serves national and other public hospitals, private hospitals, universities, research institutes, other medical institutions, etc. It also exports its products to approximately 190 countries. The company was formerly known as TOA Medical Electronics Co., Ltd. and changed its name to Sysmex Corporation in October 1998. Sysmex Corporation was founded in 1968 and is headquartered in Kobe, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kobe",
        "zipcode": "651-0073",
        "website": "http://www.sysmex.co.jp",
        "market_cap": "Large Cap"
    },
    "BMZ.MU": {
        "short_name": "BML INC.",
        "long_name": "BML, Inc.",
        "summary": "BML, Inc. provides laboratory testing and related services in Japan. The company offers general laboratory tests, including biochemical and hematologic examinations; special laboratory tests, such as RIA, cellular, immunological, and DNA analysis; microbiological tests for medical and pharmaceutical societies and organizations; and laboratory tests in tumorology, infectious disease, diabetes, hypertension, allergy, and genetic studies. It also develops Frontier and Symphony automation systems, which automate pre-processing procedures from sorting to dispensing, and subsequent test procedures; and provides electronic medical charts for networking medical information, as well as offers preventive medicine services. In addition, the company provides food sanitation control and food processing services comprising contract services for microorganism testing of raw materials, and prepared and processed foods; environmental hygiene testing of food processing facilities and kitchens; and microorganism testing services, as well as assesses genetically modified organisms. Further, it provides drinking water and waste water tests; work sanitation management services, such as measurement of ethylene oxide gas, formaldehyde, organic solvents, and dust; environmental monitoring services, including measurement of indoor contaminants and other indoor environmental variables; and biological dioxin monitoring services. Additionally, the company offers analysis services for residual agricultural chemicals; dental test services for dental caries and periodontal diseases; consulting services for the approval of pharmaceuticals; investigative analysis services to pharmaceutical manufacturers; and gene expression analysis and testing for genes that cause susceptibility to infectious diseases. BML, Inc. was founded in 1955 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.bml.co.jp",
        "market_cap": "Small Cap"
    },
    "EPLYF": {
        "short_name": "EPS HOLDINGS INC",
        "long_name": "EPS Holdings, Inc.",
        "summary": "EPS Holdings, Inc., through its subsidiaries, provides outsourced solutions to customers in the healthcare industry. It provides contract research organization (CRO) services and management of CRO segment activities; site management organization services; contract MR services, DI, and other call center services related BPO services, as well as medical device support services; contract sales solutions, including recruitment, training, and development of MRs (permanent, contract staffing, and temp to-perm), as well as medical communications programs and training; and promotion and BPO services for healthcare companies. The company also engages in clinical research related business; provision of IT services for pharmaceutical and medical settings; the import and export of products for non-clinical research, and provision of distribution services; research and development, manufacture, and sale of pharmaceuticals and medical devices; and provision of human studies (functionality and safety evaluations), basic research and animal studies, food composition analysis, research on functional substances, and other research and analysis services, as well as consulting in support of functional food development and other activities. In addition, it engages in trading, investment, and other businesses; shared services; rental and sale of advanced medical and other devices; and sale of clinical trial and other types of life and non-life insurance. The company serves pharmaceutical companies, medical device manufacturers, pharmaceutical development ventures, medical institutions, and universities and research institution in Japan and Asia. EPS Holdings, Inc. was founded in 1991 and is based in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "162-0821",
        "website": "http://www.eps-holdings.co.jp",
        "market_cap": "Small Cap"
    },
    "SSMXF": {
        "short_name": "SYSMEX CORP",
        "long_name": "Sysmex Corporation",
        "summary": "Sysmex Corporation, together with its subsidiaries, engages in the development, manufacture, and sale of diagnostic instruments, reagents, and related software in Japan. The company offers three-part and five-part white blood cell differentiation instruments for use in hematology; and transport systems for high-volume testing in labs. It also provides urine formed sediment analysis systems; automated immunochemistry systems, which perform assays on minute sample quantities, as well as reagents to test for infectious disease and tumor markers; and flow cytometers to perform analysis in diagnosing leukemia, malignant lymphoma, and HIV/AIDS. In addition, the company offers cancer lymph node metastasis testing systems to detect information to help in diagnosing lymph node metastasis; cancer genome profiling systems; and cytogenic testing and lab assay services. It is also involved in the development and sale of software for diagnostic information systems; provision of facility management, office, and welfare services; development, manufacture, and sale of nucleic acid analogs; development, operation, and maintenance of IT solutions, platforms, and applications related to digital medicine; marketing, development, design, manufacture, sale, and after-sales service related to medical robots; and distribution and after sales support of medical devices and reagents for biotechnology, medical technology, and molecular cell analysis. The company serves national and other public hospitals, private hospitals, universities, research institutes, other medical institutions, etc. It also exports its products to approximately 190 countries. The company was formerly known as TOA Medical Electronics Co., Ltd. and changed its name to Sysmex Corporation in October 1998. Sysmex Corporation was founded in 1968 and is headquartered in Kobe, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Kobe",
        "zipcode": "651-0073",
        "website": "http://www.sysmex.co.jp",
        "market_cap": "Large Cap"
    },
    "SSMXY": {
        "short_name": "SYSMEX CORP",
        "long_name": "Sysmex Corporation",
        "summary": "Sysmex Corporation, together with its subsidiaries, engages in the development, manufacture, and sale of diagnostic instruments, reagents, and related software in Japan. The company offers three-part and five-part white blood cell differentiation instruments for use in hematology; and transport systems for high-volume testing in labs. It also provides urine formed sediment analysis systems; automated immunochemistry systems, which perform assays on minute sample quantities, as well as reagents to test for infectious disease and tumor markers; and flow cytometers to perform analysis in diagnosing leukemia, malignant lymphoma, and HIV/AIDS. In addition, the company offers cancer lymph node metastasis testing systems to detect information to help in diagnosing lymph node metastasis; cancer genome profiling systems; and cytogenic testing and lab assay services. It is also involved in the development and sale of software for diagnostic information systems; provision of facility management, office, and welfare services; development, manufacture, and sale of nucleic acid analogs; development, operation, and maintenance of IT solutions, platforms, and applications related to digital medicine; marketing, development, design, manufacture, sale, and after-sales service related to medical robots; and distribution and after sales support of medical devices and reagents for biotechnology, medical technology, and molecular cell analysis. The company serves national and other public hospitals, private hospitals, universities, research institutes, other medical institutions, etc. It also exports its products to approximately 190 countries. The company was formerly known as TOA Medical Electronics Co., Ltd. and changed its name to Sysmex Corporation in October 1998. Sysmex Corporation was founded in 1968 and is headquartered in Kobe, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Kobe",
        "zipcode": "651-0073",
        "website": "http://www.sysmex.co.jp",
        "market_cap": "Large Cap"
    },
    "YB3.F": {
        "short_name": "SHIN NIPPON BIOMED.LAB.",
        "long_name": "Shin Nippon Biomedical Laboratories, Ltd.",
        "summary": "Shin Nippon Biomedical Laboratories, Ltd., a contract research organization, provides drug discovery and development services in Japan and internationally. The company offers pre-clinical laboratory services, such as Good Laboratory Practice inspections; general and specific toxicity studies; pathological examinations; PK/PD of biopharmaceuticals, immunotoxicity tests, and antibody production; reproductive and developmental toxicity studies; pharmacology and pharmacological efficacy studies; and imaging services. It also engages in the establishment and validation of analytical methods, analysis of biological samples, and calculation of pharmacokinetic parameters; and provides absorption, distribution, metabolism, and excretion studies using radioisotope-labeled compounds. In addition, the company offers site management organization services for clinical trials; clinical contract research organization services; and translational research services, including research and development of nasal delivery systems, nucleic acid adjuvants, and regenerative medicines. Shin Nippon Biomedical Laboratories, Ltd. was founded in 1957 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0044",
        "website": "http://www.snbl.co.jp",
        "market_cap": "Small Cap"
    }
}