{"TAKN.MX": {"short_name": "TAKEDA PHARMACEUTICAL CO LTD", "long_name": "Takeda Pharmaceutical Company Limited", "summary": "Takeda Pharmaceutical Company Limited engages in the research, development, manufacturing, and marketing of pharmaceutical products, over-the-counter medicines and quasi-drug consumer products, and other healthcare products. It offers pharmaceutical products in the areas of gastroenterology; oncology; neuroscience; and rare diseases, such as rare metabolic and hematology, and heredity angioedema, as well as plasma-derived therapies and vaccines. The company provides its products under the ENTYVIO, GATTEX/REVESTIVE, ALOFISEL, NATPARA, ADYNOVATE/ADYNOVI, TAKHZYRO, ELAPRASE, VPRIV, GAMMAGARD LIQUID/KIOVIG, HYQVIA, CUVITRU, ALBUMIN/FLEXBUMIN, NINLARO, and ALUNBRIG brands. It operates in Japan, the United States, Europe and Canada, Russia/CIS, Latin America, rest of Asia, the Middle East, Oceania, and Africa. The company has licensing agreements with TESARO, Inc., Denali Therapeutics, and Wave Life Sciences Ltd; collaboration agreements with Rani Therapeutics LLC, Novimmune S.A., AB Biosciences Inc., Sosei Group Corporation, and LogicBio Therapeutics, Inc.; strategic collaboration with Prometheus Biosciences, Inc; a license and research agreement with The University of Texas MD Anderson Cancer Center; a research collaboration agreements with Enzyre BV and Cerevance; a collaboration agreement with Artisan Bio, Inc.; and a multi-target rare disease collaboration with Evox Therapeutics Ltd., as well as licensing agreement with ProThera Biologics Inc. It also has a corporate strategic research alliance with Egle Therapeutics SAS; a strategic partnership with Neurocrine Biosciences, Inc.; Carmine Therapeutics and HemoShear Therapeutics, LLC; and strategic collaboration with KSQ Therapeutics to research, develop, and commercialize immune-based therapies for cancer. Takeda Pharmaceutical Company Limited was founded in 1781 and is headquartered in Tokyo, Japan.", "currency": "MXN", "sector": "Healthcare", "industry": "Drugs - Generic", "exchange": "MEX", "market": "mx_market", "country": "Japan", "city": "Tokyo"}}