{
    "4151.T": {
        "short_name": "KYOWA KIRIN CO LTD",
        "long_name": "Kyowa Kirin Co., Ltd.",
        "summary": "Kyowa Kirin Co., Ltd., a specialty pharmaceutical company, manufactures and markets pharmaceuticals focused on the therapeutic areas of oncology, nephrology, central nervous system, and immunology worldwide. Its products include ABSTRAL, a sublingual formulation of fentanyl used for the management of episodes of breakthrough pain experienced by cancer patients; ALLELOCK, an antihistamine agent for patients with various types of allergies; CONIEL, a calcium channel blocker for hypertension and angina pectoris; Crysvita, a recombinant human monoclonal IgG1 antibody against the phosphaturic hormone fibroblast growth factor 23; ESPO, a glycoprotein and human erythropoietin; NESP, an erythropoiesis stimulating agent; GRAN, a human colony-stimulating factor; and G-LASTA/Peglasta/Neulasta for chemotherapy-induced febrile neutropenia. The company's products also comprise LEUNASE for acute lymphoblastic leukemia; Mitomycin-C, an anticancer antibiotic; Moventig, an oral once daily peripherally acting mu-opioid receptor antagonist for the treatment of opioid induced constipation in adult patients; PecFent, a nasally administrated spray; POTELIGEO, a humanized monoclonal antibody that targets CC chemokine receptor 4; and REGPARA, an agent for the treatment of secondary hyperparathyroidism. In addition, it offers Romiplate/Nplate, a genetically recombinant protein, which stimulates platelet production through the stimulation of thrombopoietin receptors; and SANCUSO for the treatment of nausea and vomiting. The company was formerly known as Kyowa Hakko Kirin Co., Ltd. and changed its name to Kyowa Kirin Co., Ltd. in June 2019. The company was founded in 1949 and is headquartered in Tokyo, Japan. Kyowa Kirin Co., Ltd. is a subsidiary of Kirin Holdings Company, Limited.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "4503.T": {
        "short_name": "ASTELLAS PHARMA",
        "long_name": "Astellas Pharma Inc.",
        "summary": "Astellas Pharma Inc. engages in the manufacture, marketing, import, and export of pharmaceuticals worldwide. It provides XTANDI, an androgen receptor signaling inhibitor for prostate cancer; XOSPATA, a FLT3 inhibitor for adult patients with relapsed or refractory acute myeloid leukemia with a FLT3 mutation-positive; PADCEV, a treatment solution for adult patients with locally advanced or metastatic urothelial cancer; Betanis/Myrbetriq/BETMIGA, a beta-3 adrenergic receptor agonist for the treatment of urgency, urinary frequency, and urge urinary incontinence; Evrenzo, an oral treatment for anemia associated with chronic kidney disease; and Prograf and Advagraf/Graceptor/ASTAGRAF, which are immunosuppressants used to suppress organ rejection following a transplant. The company also offers mirabegron for the treatment of neurogenic detrusor overactivity in pediatric patients; Vesicare for OAB treatment; Eligard to treat prostate cancer; Harnal/Omnic for benign prostatic hyperplasia treatment; and Funguard/MYCAMINE, an antifungal agent. The company has a clinical trial collaboration with Merck & Co., Inc.; CytomX Therapeutics, Inc.; and an agreement with BANDAI NAMCO Entertainment Inc. for the development of smartphone exercise support application. It also has strategic research alliance with Harvard University for the research and development of therapeutics and technologies of mutual interest; and research collaboration with Actinium Pharmaceuticals, Inc. to develop targeted radiotherapies using its Antibody Warhead Enabling technology platforms. Astellas Pharma Inc. was founded in 1923 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "4519.T": {
        "short_name": "CHUGAI PHARMACEUTICAL CO",
        "long_name": "Chugai Pharmaceutical Co., Ltd.",
        "summary": "Chugai Pharmaceutical Co., Ltd., together with its subsidiaries, engages in the research, development, manufacture, marketing, and distribution of prescription medicines in Japan and internationally. The company's products for oncology primarily include Avastin, Herceptin, Rituxan, Alecensa, Perjeta, Xeloda, Tarceva, Kadcyla, Zelboraf, Neutrogin, Tecentriq, and Gazyva; bone and joint diseases/autoimmune diseases comprise Actemra, Edirol, Suvenyl, and Bonviva; renal diseases consist of Mircera and Oxarol; and other diseases comprise Tamiflu, CellCept, Copegus, and Hemlibra. It has various development product candidates in the areas of oncology, bone and joint diseases, autoimmune diseases, renal diseases, neurology, and other diseases. Chugai Pharmaceutical Co., Ltd. has strategic alliances with Roche Group and Genentech; and co-development agreements with Taisho Pharmaceutical Co., Ltd. and Nippon Shinyaku Co., Ltd. The company was founded in 1925 and is headquartered in Tokyo, Japan. Chugai Pharmaceutical Co., Ltd. is a subsidiary of Roche Holding Ltd.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "4528.T": {
        "short_name": "ONO PHARMACEUTICAL CO",
        "long_name": "Ono Pharmaceutical Co., Ltd.",
        "summary": "Ono Pharmaceutical Co., Ltd., together with its subsidiaries, produces, purchases, and sells pharmaceuticals and diagnostic reagents worldwide. The company offers OPDIVO intravenous infusions for the treatment of malignant tumors; KYPROLIS for intravenous injection; EMEND capsules/PROEMEND intravenous injections for chemotherapy-induced nausea and vomiting; DEMSER Capsule for improvement of the symptoms in patients with pheochromocytoma; and BRAFTOVI capsules, and MEKTOVI and VELEXBRU tablets for malignant tumors. It also provides GLACTIV and FORXIGA tablets for type 2 diabetes; ORENCIA injections for rheumatoid arthritis; RIVASTACH patches for Alzheimer's disease; PARSABIV, an intravenous injection for dialysis patients; ONOACT injections for tachyarrhythmia; STAYBLA tablets for overactive bladder; OPALMON tablets to treat peripheral circulatory disorder; ONON capsules and dry syrups for bronchial asthma and allergic rhinitis; CORALAN for treatment of chronic heart failure; and RECALBON tablets for osteoporosis. In addition, the company is developing products for colorectal, esophageal, gastric or esophago-gastric junction, small and non-small cell lung, ovarian, pancreatic, prostate, biliary tract, hematologic, and head and neck cancers; hepatocellular, urothelial, and virus positive/negative solid carcinoma; glioblastoma; multiple myeloma; malignant pleural mesothelioma; solid tumors; central nervous system, primary testicular, and lymphoplasmacytic; acute myeloid leukemia; melanoma; primary macroglobulinemia; chronic heart failure; Parkinson's disease; structural damage of the joints in rheumatoid arthritis; polymyositis/dermatomyositis; osteoarthritis; enthesopathy; pemphigus; celebral infarction; acromegaly; thrombosis; and autoimmune disease. The company has research and option agreement with Numab Therapeutics AG. Ono Pharmaceutical Co., Ltd. was founded in 1717 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "4536.T": {
        "short_name": "SANTEN PHARMACEUTICAL CO",
        "long_name": "Santen Pharmaceutical Co., Ltd.",
        "summary": "Santen Pharmaceutical Co., Ltd. researches and develops, manufactures, and markets pharmaceuticals and medical devices in Japan and internationally. It offers various pharmaceutical products to treat glaucoma and ocular hypertension, such as DE-111, which is in Phase III clinical trial; DE-117 in Japan; DE-126 that is in Phase 2b clinical trial; DE-128 in Europe, as well as is in Phase 2/3 clinical trial in the United States; and DE-130A that is in Phase III clinical trial. In addition, the company provides DE-114A to treat allergic conjunctivitis; DE-076C for the treatment of vernal keratoconjunctivitis; and DE-109, which is in Phase 3 clinical trial to treat uveitis. Further, it offers DE-127 to treat myopia, which is in Phase 2/3 clinical trial in Japan, as well as is in Phase 3 in Asia; and MD-16 for the treatment of cataract. Additionally, the company offers over-the-counter pharmaceutical products. The company was formerly known as Santendo Pharmaceutical Co., Ltd. and changed its name to Santen Pharmaceutical Co., Ltd. in 1958. Santen Pharmaceutical Co., Ltd. was founded in 1890 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "4550.T": {
        "short_name": "NISSUI PHARMACEUTICAL CO",
        "long_name": "Nissui Pharmaceutical Co., Ltd.",
        "summary": "Nissui Pharmaceutical Co., Ltd. produces, sells, imports, and exports culture media and diagnostics for medical institutions, research organizations, and food industries in Japan and internationally. It offers in vitro diagnostics and medical devices; culture media for microbiological testing; products for antimicrobial susceptibility tests, microorganism identification, and immunological tests; and quality control serum, which is used for ensuring the accuracy of clinical diagnoses. In addition,, the company provides microbiological testing products for food poisoning detection; immunosorbent assays for the detection of allergies to food items, such as eggs, wheat, milk, shrimp, crabs, buckwheat, peanuts, etc.; and culture media and reagents for regenerative medicine. Further, it supplies testing agents and bulk products to diagnostic agent manufacturers; and CompactDry, a dry medium that is used for coliform counting for food manufacturers. The company was formerly known as Nissan Research Institute Co., Ltd. and changed its name to Nissui Pharmaceutical Co., Ltd. in 1962. Nissui Pharmaceutical Co., Ltd. was founded in 1935 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "4552.T": {
        "short_name": "JCR PHARMACEUTICAL CO",
        "long_name": "JCR Pharmaceuticals Co., Ltd.",
        "summary": "JCR Pharmaceuticals Co., Ltd. engages in the research, development, manufacture, and sale of pharmaceutical products, regenerative medicines, and drug substances primarily in Japan. The company offers GROWJECT, a recombinant human growth hormone for the treatment of short stature; Agalsidase Beta BS I.V. Infusion, a biosimilar for agalsidase beta for the treatment of Fabry disease, a type of lysosomal storage disorder; and TEMCELL HS Inj, a therapeutic product using mesenchymal stem cells for the treatment of acute graft-versus-host disease. It also develops biosimilar products for the treatment of renal anemia. The company was founded in 1975 and is headquartered in Ashiya, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Ashiya"
    },
    "4568.T": {
        "short_name": "DAIICHI SANKYO COMPANY LIMITED",
        "long_name": "Daiichi Sankyo Company, Limited",
        "summary": "Daiichi Sankyo Company, Limited researches and develops, manufactures, imports, markets, and sells pharmaceutical products worldwide. The company offers trastuzumab deruxtecan, an anti-cancer agent and anti-HER2 antibody drug conjugate; mirogabalin for pain treatment; teneligliptin/canagliflozin for type 2 diabetes mellitus treatment; lacosamide anti-epileptic agent; prasugrel, an antiplatelet agent; denosumab for osteoporosis and bone disorders; teneligliptin for type 2 diabetes mellitus treatment; edoxaban, an anticoagulant; esomeprazole for ulcer treatment; memantine for treating Alzheimer's disease; and laninamivir for anti-influenza treatment. It also provides olmesartan, an antihypertensive agent; levofloxacin, an antibacterial agent; pravastatin for hypercholesterolemia treatment; and loxoprofen, an anti-inflammatory analgesic. In addition, the company offers colesevelam for treating hypercholesterolemia and type 2 diabetes mellitus treatment; and ferric carboxymaltose and iron sucrose injections for treating anemia. Further, it provides Lulu, a combination cold remedy; Loxonin S, an antipyretic analgesic /anti-inflammatory analgesic; Transino for melasma improvement and treating against spots and freckles; Minon, a skincare product; and Breath Labo and Clean Dental oral care products, as well as Silodosin for dysuria; Gefitinib for malignant tumours; Bicalutamide for prostate cancer; and Tamoxifen, an anti-breast cancer agent. Additionally, the company offers adsorbed cell culture-derived influenza, influenza HA, measles rubella combined, and mumps vaccines. It also provides pharmaceuticals and drugs for animals, cosmetics, medical equipment, food products, drinking water, active pharmaceutical ingredients, and intermediates. The company was founded in 1899 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "4578.T": {
        "short_name": "OTSUKA HLDGS CO LTD",
        "long_name": "Otsuka Holdings Co., Ltd.",
        "summary": "Otsuka Holdings Co., Ltd. engages in pharmaceuticals, nutraceuticals, consumer products, and other businesses worldwide. The company develops pharmaceutical products in the fields of central nervous system, oncology, cardiovascular system, gastroenterology, ophthalmology, diagnostics, and I.V. solutions, as well as medical devices businesses. It also provides EQUELLE, a product for women's health and beauty; BODYMAINTÃ\u0089 Jelly, a conditioning food product; BODYMAINTÃ\u0089 Drink, a drinkable-liquid; POCARI SWEAT, a drink; Calorie Mate, a nutritional food; SOYJOY, a soy bar; OS-1, an oral rehydration solution; HINE E-GEL, a concentrated liquid diet; PROCESSLEAD, a chew and swallow managing food; REHADAYS, a beverage to support exercise and rehabilitation; Oronine H Ointment, a household antiseptic medicine; and vitamin tonics, herbal digestive drinks, and herbal crude drugs. In addition, the company offers soft drinks, food products, and wines; chemicals; clinical testing and medical equipment; cosmetics; warehousing and transport services; analysis and measurement equipment; pharmaceutical intermediates; vehicle headlight testers; synthetic resin molded products; paper products; artificial turf; ceramic boards, ceramic walls, reliefs, terracotta, OT ceramics, and ceramic portraits and sign boards; functional films; stable isotopes; software and services to enhance management of mental healthcare systems; potassium titanate; polyolefin foams; spring and mineral water; industrial chemicals; hydrazine; insecticide and toiletry products; and adhesive tapes. Further, it operates a hotel. Otsuka Holdings Co., Ltd. was founded in 2008 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "ALPMF": {
        "short_name": "ASTELLAS PHARMA",
        "long_name": "Astellas Pharma Inc.",
        "summary": "Astellas Pharma Inc. engages in the manufacture, marketing, import, and export of pharmaceuticals worldwide. It provides XTANDI, an androgen receptor signaling inhibitor for prostate cancer; XOSPATA, a FLT3 inhibitor for adult patients with relapsed or refractory acute myeloid leukemia with a FLT3 mutation-positive; PADCEV, a treatment solution for adult patients with locally advanced or metastatic urothelial cancer; Betanis/Myrbetriq/BETMIGA, a beta-3 adrenergic receptor agonist for the treatment of urgency, urinary frequency, and urge urinary incontinence; Evrenzo, an oral treatment for anemia associated with chronic kidney disease; and Prograf and Advagraf/Graceptor/ASTAGRAF, which are immunosuppressants used to suppress organ rejection following a transplant. The company also offers mirabegron for the treatment of neurogenic detrusor overactivity in pediatric patients; Vesicare for OAB treatment; Eligard to treat prostate cancer; Harnal/Omnic for benign prostatic hyperplasia treatment; and Funguard/MYCAMINE, an antifungal agent. The company has a clinical trial collaboration with Merck & Co., Inc.; CytomX Therapeutics, Inc.; and an agreement with BANDAI NAMCO Entertainment Inc. for the development of smartphone exercise support application. It also has strategic research alliance with Harvard University for the research and development of therapeutics and technologies of mutual interest; and research collaboration with Actinium Pharmaceuticals, Inc. to develop targeted radiotherapies using its Antibody Warhead Enabling technology platforms. Astellas Pharma Inc. was founded in 1923 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "ALPMY": {
        "short_name": "ASTELLAS PHARMA",
        "long_name": "Astellas Pharma Inc.",
        "summary": "Astellas Pharma Inc. engages in the manufacture, marketing, import, and export of pharmaceuticals worldwide. It provides XTANDI, an androgen receptor signaling inhibitor for prostate cancer; XOSPATA, a FLT3 inhibitor for adult patients with relapsed or refractory acute myeloid leukemia with a FLT3 mutation-positive; PADCEV, a treatment solution for adult patients with locally advanced or metastatic urothelial cancer; Betanis/Myrbetriq/BETMIGA, a beta-3 adrenergic receptor agonist for the treatment of urgency, urinary frequency, and urge urinary incontinence; Evrenzo, an oral treatment for anemia associated with chronic kidney disease; and Prograf and Advagraf/Graceptor/ASTAGRAF, which are immunosuppressants used to suppress organ rejection following a transplant. The company also offers mirabegron for the treatment of neurogenic detrusor overactivity in pediatric patients; Vesicare for OAB treatment; Eligard to treat prostate cancer; Harnal/Omnic for benign prostatic hyperplasia treatment; and Funguard/MYCAMINE, an antifungal agent. The company has a clinical trial collaboration with Merck & Co., Inc.; CytomX Therapeutics, Inc.; and an agreement with BANDAI NAMCO Entertainment Inc. for the development of smartphone exercise support application. It also has strategic research alliance with Harvard University for the research and development of therapeutics and technologies of mutual interest; and research collaboration with Actinium Pharmaceuticals, Inc. to develop targeted radiotherapies using its Antibody Warhead Enabling technology platforms. Astellas Pharma Inc. was founded in 1923 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "CHGCY": {
        "short_name": "CHUGAI PHARMACEUTICAL CO",
        "long_name": "Chugai Pharmaceutical Co., Ltd.",
        "summary": "Chugai Pharmaceutical Co., Ltd., together with its subsidiaries, engages in the research, development, manufacture, marketing, and distribution of prescription medicines in Japan and internationally. The company's products for oncology primarily include Avastin, Herceptin, Rituxan, Alecensa, Perjeta, Xeloda, Tarceva, Kadcyla, Zelboraf, Neutrogin, Tecentriq, and Gazyva; bone and joint diseases/autoimmune diseases comprise Actemra, Edirol, Suvenyl, and Bonviva; renal diseases consist of Mircera and Oxarol; and other diseases comprise Tamiflu, CellCept, Copegus, and Hemlibra. It has various development product candidates in the areas of oncology, bone and joint diseases, autoimmune diseases, renal diseases, neurology, and other diseases. Chugai Pharmaceutical Co., Ltd. has strategic alliances with Roche Group and Genentech; and co-development agreements with Taisho Pharmaceutical Co., Ltd. and Nippon Shinyaku Co., Ltd. The company was founded in 1925 and is headquartered in Tokyo, Japan. Chugai Pharmaceutical Co., Ltd. is a subsidiary of Roche Holding Ltd.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "CUP.F": {
        "short_name": "CHUGAI PHARMACEUT'L",
        "long_name": "Chugai Pharmaceutical Co., Ltd.",
        "summary": "Chugai Pharmaceutical Co., Ltd., together with its subsidiaries, engages in the research, development, manufacture, marketing, and distribution of prescription medicines in Japan and internationally. The company's products for oncology primarily include Avastin, Herceptin, Rituxan, Alecensa, Perjeta, Xeloda, Tarceva, Kadcyla, Zelboraf, Neutrogin, Tecentriq, and Gazyva; bone and joint diseases/autoimmune diseases comprise Actemra, Edirol, Suvenyl, and Bonviva; renal diseases consist of Mircera and Oxarol; and other diseases comprise Tamiflu, CellCept, Copegus, and Hemlibra. It has various development product candidates in the areas of oncology, bone and joint diseases, autoimmune diseases, renal diseases, neurology, and other diseases. Chugai Pharmaceutical Co., Ltd. has strategic alliances with Roche Group and Genentech; and co-development agreements with Taisho Pharmaceutical Co., Ltd. and Nippon Shinyaku Co., Ltd. The company was founded in 1925 and is headquartered in Tokyo, Japan. Chugai Pharmaceutical Co., Ltd. is a subsidiary of Roche Holding Ltd.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "D4S.F": {
        "short_name": "DAIICHI SANKYO CO. LTD",
        "long_name": "Daiichi Sankyo Company, Limited",
        "summary": "Daiichi Sankyo Company, Limited researches and develops, manufactures, imports, markets, and sells pharmaceutical products worldwide. The company offers trastuzumab deruxtecan, an anti-cancer agent and anti-HER2 antibody drug conjugate; mirogabalin for pain treatment; teneligliptin/canagliflozin for type 2 diabetes mellitus treatment; lacosamide anti-epileptic agent; prasugrel, an antiplatelet agent; denosumab for osteoporosis and bone disorders; teneligliptin for type 2 diabetes mellitus treatment; edoxaban, an anticoagulant; esomeprazole for ulcer treatment; memantine for treating Alzheimer's disease; and laninamivir for anti-influenza treatment. It also provides olmesartan, an antihypertensive agent; levofloxacin, an antibacterial agent; pravastatin for hypercholesterolemia treatment; and loxoprofen, an anti-inflammatory analgesic. In addition, the company offers colesevelam for treating hypercholesterolemia and type 2 diabetes mellitus treatment; and ferric carboxymaltose and iron sucrose injections for treating anemia. Further, it provides Lulu, a combination cold remedy; Loxonin S, an antipyretic analgesic /anti-inflammatory analgesic; Transino for melasma improvement and treating against spots and freckles; Minon, a skincare product; and Breath Labo and Clean Dental oral care products, as well as Silodosin for dysuria; Gefitinib for malignant tumours; Bicalutamide for prostate cancer; and Tamoxifen, an anti-breast cancer agent. Additionally, the company offers adsorbed cell culture-derived influenza, influenza HA, measles rubella combined, and mumps vaccines. It also provides pharmaceuticals and drugs for animals, cosmetics, medical equipment, food products, drinking water, active pharmaceutical ingredients, and intermediates. The company was founded in 1899 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "DSKYF": {
        "short_name": "DAIICHI SANKYO COMPANY LIMITED",
        "long_name": "Daiichi Sankyo Company, Limited",
        "summary": "Daiichi Sankyo Company, Limited researches and develops, manufactures, imports, markets, and sells pharmaceutical products worldwide. The company offers trastuzumab deruxtecan, an anti-cancer agent and anti-HER2 antibody drug conjugate; mirogabalin for pain treatment; teneligliptin/canagliflozin for type 2 diabetes mellitus treatment; lacosamide anti-epileptic agent; prasugrel, an antiplatelet agent; denosumab for osteoporosis and bone disorders; teneligliptin for type 2 diabetes mellitus treatment; edoxaban, an anticoagulant; esomeprazole for ulcer treatment; memantine for treating Alzheimer's disease; and laninamivir for anti-influenza treatment. It also provides olmesartan, an antihypertensive agent; levofloxacin, an antibacterial agent; pravastatin for hypercholesterolemia treatment; and loxoprofen, an anti-inflammatory analgesic. In addition, the company offers colesevelam for treating hypercholesterolemia and type 2 diabetes mellitus treatment; and ferric carboxymaltose and iron sucrose injections for treating anemia. Further, it provides Lulu, a combination cold remedy; Loxonin S, an antipyretic analgesic /anti-inflammatory analgesic; Transino for melasma improvement and treating against spots and freckles; Minon, a skincare product; and Breath Labo and Clean Dental oral care products, as well as Silodosin for dysuria; Gefitinib for malignant tumours; Bicalutamide for prostate cancer; and Tamoxifen, an anti-breast cancer agent. Additionally, the company offers adsorbed cell culture-derived influenza, influenza HA, measles rubella combined, and mumps vaccines. It also provides pharmaceuticals and drugs for animals, cosmetics, medical equipment, food products, drinking water, active pharmaceutical ingredients, and intermediates. The company was founded in 1899 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "DSNKY": {
        "short_name": "DAIICHI SANKYO COMPANY LIMITED",
        "long_name": "Daiichi Sankyo Company, Limited",
        "summary": "Daiichi Sankyo Company, Limited researches and develops, manufactures, imports, markets, and sells pharmaceutical products worldwide. The company offers trastuzumab deruxtecan, an anti-cancer agent and anti-HER2 antibody drug conjugate; mirogabalin for pain treatment; teneligliptin/canagliflozin for type 2 diabetes mellitus treatment; lacosamide anti-epileptic agent; prasugrel, an antiplatelet agent; denosumab for osteoporosis and bone disorders; teneligliptin for type 2 diabetes mellitus treatment; edoxaban, an anticoagulant; esomeprazole for ulcer treatment; memantine for treating Alzheimer's disease; and laninamivir for anti-influenza treatment. It also provides olmesartan, an antihypertensive agent; levofloxacin, an antibacterial agent; pravastatin for hypercholesterolemia treatment; and loxoprofen, an anti-inflammatory analgesic. In addition, the company offers colesevelam for treating hypercholesterolemia and type 2 diabetes mellitus treatment; and ferric carboxymaltose and iron sucrose injections for treating anemia. Further, it provides Lulu, a combination cold remedy; Loxonin S, an antipyretic analgesic /anti-inflammatory analgesic; Transino for melasma improvement and treating against spots and freckles; Minon, a skincare product; and Breath Labo and Clean Dental oral care products, as well as Silodosin for dysuria; Gefitinib for malignant tumours; Bicalutamide for prostate cancer; and Tamoxifen, an anti-breast cancer agent. Additionally, the company offers adsorbed cell culture-derived influenza, influenza HA, measles rubella combined, and mumps vaccines. It also provides pharmaceuticals and drugs for animals, cosmetics, medical equipment, food products, drinking water, active pharmaceutical ingredients, and intermediates. The company was founded in 1899 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "KY4.F": {
        "short_name": "KYOWA KIRIN CO. LTD.",
        "long_name": "Kyowa Kirin Co., Ltd.",
        "summary": "Kyowa Kirin Co., Ltd., a specialty pharmaceutical company, manufactures and markets pharmaceuticals focused on the therapeutic areas of oncology, nephrology, central nervous system, and immunology worldwide. Its products include ABSTRAL, a sublingual formulation of fentanyl used for the management of episodes of breakthrough pain experienced by cancer patients; ALLELOCK, an antihistamine agent for patients with various types of allergies; CONIEL, a calcium channel blocker for hypertension and angina pectoris; Crysvita, a recombinant human monoclonal IgG1 antibody against the phosphaturic hormone fibroblast growth factor 23; ESPO, a glycoprotein and human erythropoietin; NESP, an erythropoiesis stimulating agent; GRAN, a human colony-stimulating factor; and G-LASTA/Peglasta/Neulasta for chemotherapy-induced febrile neutropenia. The company's products also comprise LEUNASE for acute lymphoblastic leukemia; Mitomycin-C, an anticancer antibiotic; Moventig, an oral once daily peripherally acting mu-opioid receptor antagonist for the treatment of opioid induced constipation in adult patients; PecFent, a nasally administrated spray; POTELIGEO, a humanized monoclonal antibody that targets CC chemokine receptor 4; and REGPARA, an agent for the treatment of secondary hyperparathyroidism. In addition, it offers Romiplate/Nplate, a genetically recombinant protein, which stimulates platelet production through the stimulation of thrombopoietin receptors; and SANCUSO for the treatment of nausea and vomiting. The company was formerly known as Kyowa Hakko Kirin Co., Ltd. and changed its name to Kyowa Kirin Co., Ltd. in June 2019. The company was founded in 1949 and is headquartered in Tokyo, Japan. Kyowa Kirin Co., Ltd. is a subsidiary of Kirin Holdings Company, Limited.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "KYKOF": {
        "short_name": "KYOWA KIRIN CO LTD",
        "long_name": "Kyowa Kirin Co., Ltd.",
        "summary": "Kyowa Kirin Co., Ltd., a specialty pharmaceutical company, manufactures and markets pharmaceuticals focused on the therapeutic areas of oncology, nephrology, central nervous system, and immunology worldwide. Its products include ABSTRAL, a sublingual formulation of fentanyl used for the management of episodes of breakthrough pain experienced by cancer patients; ALLELOCK, an antihistamine agent for patients with various types of allergies; CONIEL, a calcium channel blocker for hypertension and angina pectoris; Crysvita, a recombinant human monoclonal IgG1 antibody against the phosphaturic hormone fibroblast growth factor 23; ESPO, a glycoprotein and human erythropoietin; NESP, an erythropoiesis stimulating agent; GRAN, a human colony-stimulating factor; and G-LASTA/Peglasta/Neulasta for chemotherapy-induced febrile neutropenia. The company's products also comprise LEUNASE for acute lymphoblastic leukemia; Mitomycin-C, an anticancer antibiotic; Moventig, an oral once daily peripherally acting mu-opioid receptor antagonist for the treatment of opioid induced constipation in adult patients; PecFent, a nasally administrated spray; POTELIGEO, a humanized monoclonal antibody that targets CC chemokine receptor 4; and REGPARA, an agent for the treatment of secondary hyperparathyroidism. In addition, it offers Romiplate/Nplate, a genetically recombinant protein, which stimulates platelet production through the stimulation of thrombopoietin receptors; and SANCUSO for the treatment of nausea and vomiting. The company was formerly known as Kyowa Hakko Kirin Co., Ltd. and changed its name to Kyowa Kirin Co., Ltd. in June 2019. The company was founded in 1949 and is headquartered in Tokyo, Japan. Kyowa Kirin Co., Ltd. is a subsidiary of Kirin Holdings Company, Limited.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "ON4.MU": {
        "short_name": "ONO PHARMACEUT.",
        "long_name": "Ono Pharmaceutical Co., Ltd.",
        "summary": "Ono Pharmaceutical Co., Ltd., together with its subsidiaries, produces, purchases, and sells pharmaceuticals and diagnostic reagents worldwide. The company offers OPDIVO intravenous infusions for the treatment of malignant tumors; KYPROLIS for intravenous injection; EMEND capsules/PROEMEND intravenous injections for chemotherapy-induced nausea and vomiting; DEMSER Capsule for improvement of the symptoms in patients with pheochromocytoma; and BRAFTOVI capsules, and MEKTOVI and VELEXBRU tablets for malignant tumors. It also provides GLACTIV and FORXIGA tablets for type 2 diabetes; ORENCIA injections for rheumatoid arthritis; RIVASTACH patches for Alzheimer's disease; PARSABIV, an intravenous injection for dialysis patients; ONOACT injections for tachyarrhythmia; STAYBLA tablets for overactive bladder; OPALMON tablets to treat peripheral circulatory disorder; ONON capsules and dry syrups for bronchial asthma and allergic rhinitis; CORALAN for treatment of chronic heart failure; and RECALBON tablets for osteoporosis. In addition, the company is developing products for colorectal, esophageal, gastric or esophago-gastric junction, small and non-small cell lung, ovarian, pancreatic, prostate, biliary tract, hematologic, and head and neck cancers; hepatocellular, urothelial, and virus positive/negative solid carcinoma; glioblastoma; multiple myeloma; malignant pleural mesothelioma; solid tumors; central nervous system, primary testicular, and lymphoplasmacytic; acute myeloid leukemia; melanoma; primary macroglobulinemia; chronic heart failure; Parkinson's disease; structural damage of the joints in rheumatoid arthritis; polymyositis/dermatomyositis; osteoarthritis; enthesopathy; pemphigus; celebral infarction; acromegaly; thrombosis; and autoimmune disease. The company has research and option agreement with Numab Therapeutics AG. Ono Pharmaceutical Co., Ltd. was founded in 1717 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "OPHLY": {
        "short_name": "ONO PHARMACEUTICAL CO",
        "long_name": "Ono Pharmaceutical Co., Ltd.",
        "summary": "Ono Pharmaceutical Co., Ltd., together with its subsidiaries, produces, purchases, and sells pharmaceuticals and diagnostic reagents worldwide. The company offers OPDIVO intravenous infusions for the treatment of malignant tumors; KYPROLIS for intravenous injection; EMEND capsules/PROEMEND intravenous injections for chemotherapy-induced nausea and vomiting; DEMSER Capsule for improvement of the symptoms in patients with pheochromocytoma; and BRAFTOVI capsules, and MEKTOVI and VELEXBRU tablets for malignant tumors. It also provides GLACTIV and FORXIGA tablets for type 2 diabetes; ORENCIA injections for rheumatoid arthritis; RIVASTACH patches for Alzheimer's disease; PARSABIV, an intravenous injection for dialysis patients; ONOACT injections for tachyarrhythmia; STAYBLA tablets for overactive bladder; OPALMON tablets to treat peripheral circulatory disorder; ONON capsules and dry syrups for bronchial asthma and allergic rhinitis; CORALAN for treatment of chronic heart failure; and RECALBON tablets for osteoporosis. In addition, the company is developing products for colorectal, esophageal, gastric or esophago-gastric junction, small and non-small cell lung, ovarian, pancreatic, prostate, biliary tract, hematologic, and head and neck cancers; hepatocellular, urothelial, and virus positive/negative solid carcinoma; glioblastoma; multiple myeloma; malignant pleural mesothelioma; solid tumors; central nervous system, primary testicular, and lymphoplasmacytic; acute myeloid leukemia; melanoma; primary macroglobulinemia; chronic heart failure; Parkinson's disease; structural damage of the joints in rheumatoid arthritis; polymyositis/dermatomyositis; osteoarthritis; enthesopathy; pemphigus; celebral infarction; acromegaly; thrombosis; and autoimmune disease. The company has research and option agreement with Numab Therapeutics AG. Ono Pharmaceutical Co., Ltd. was founded in 1717 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "OS1.F": {
        "short_name": "OTSUKA HOLDINGS CO.LTD.",
        "long_name": "Otsuka Holdings Co., Ltd.",
        "summary": "Otsuka Holdings Co., Ltd. engages in pharmaceuticals, nutraceuticals, consumer products, and other businesses worldwide. The company develops pharmaceutical products in the fields of central nervous system, oncology, cardiovascular system, gastroenterology, ophthalmology, diagnostics, and I.V. solutions, as well as medical devices businesses. It also provides EQUELLE, a product for women's health and beauty; BODYMAINTÃ\u0089 Jelly, a conditioning food product; BODYMAINTÃ\u0089 Drink, a drinkable-liquid; POCARI SWEAT, a drink; Calorie Mate, a nutritional food; SOYJOY, a soy bar; OS-1, an oral rehydration solution; HINE E-GEL, a concentrated liquid diet; PROCESSLEAD, a chew and swallow managing food; REHADAYS, a beverage to support exercise and rehabilitation; Oronine H Ointment, a household antiseptic medicine; and vitamin tonics, herbal digestive drinks, and herbal crude drugs. In addition, the company offers soft drinks, food products, and wines; chemicals; clinical testing and medical equipment; cosmetics; warehousing and transport services; analysis and measurement equipment; pharmaceutical intermediates; vehicle headlight testers; synthetic resin molded products; paper products; artificial turf; ceramic boards, ceramic walls, reliefs, terracotta, OT ceramics, and ceramic portraits and sign boards; functional films; stable isotopes; software and services to enhance management of mental healthcare systems; potassium titanate; polyolefin foams; spring and mineral water; industrial chemicals; hydrazine; insecticide and toiletry products; and adhesive tapes. Further, it operates a hotel. Otsuka Holdings Co., Ltd. was founded in 2008 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "OTSKF": {
        "short_name": "OTSUKA HLDGS CO LTD",
        "long_name": "Otsuka Holdings Co., Ltd.",
        "summary": "Otsuka Holdings Co., Ltd. engages in pharmaceuticals, nutraceuticals, consumer products, and other businesses worldwide. The company develops pharmaceutical products in the fields of central nervous system, oncology, cardiovascular system, gastroenterology, ophthalmology, diagnostics, and I.V. solutions, as well as medical devices businesses. It also provides EQUELLE, a product for women's health and beauty; BODYMAINTÃ\u0089 Jelly, a conditioning food product; BODYMAINTÃ\u0089 Drink, a drinkable-liquid; POCARI SWEAT, a drink; Calorie Mate, a nutritional food; SOYJOY, a soy bar; OS-1, an oral rehydration solution; HINE E-GEL, a concentrated liquid diet; PROCESSLEAD, a chew and swallow managing food; REHADAYS, a beverage to support exercise and rehabilitation; Oronine H Ointment, a household antiseptic medicine; and vitamin tonics, herbal digestive drinks, and herbal crude drugs. In addition, the company offers soft drinks, food products, and wines; chemicals; clinical testing and medical equipment; cosmetics; warehousing and transport services; analysis and measurement equipment; pharmaceutical intermediates; vehicle headlight testers; synthetic resin molded products; paper products; artificial turf; ceramic boards, ceramic walls, reliefs, terracotta, OT ceramics, and ceramic portraits and sign boards; functional films; stable isotopes; software and services to enhance management of mental healthcare systems; potassium titanate; polyolefin foams; spring and mineral water; industrial chemicals; hydrazine; insecticide and toiletry products; and adhesive tapes. Further, it operates a hotel. Otsuka Holdings Co., Ltd. was founded in 2008 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "OTSKY": {
        "short_name": "OTSUKA HLDGS CO LTD",
        "long_name": "Otsuka Holdings Co., Ltd.",
        "summary": "Otsuka Holdings Co., Ltd. engages in pharmaceuticals, nutraceuticals, consumer products, and other businesses worldwide. The company develops pharmaceutical products in the fields of central nervous system, oncology, cardiovascular system, gastroenterology, ophthalmology, diagnostics, and I.V. solutions, as well as medical devices businesses. It also provides EQUELLE, a product for women's health and beauty; BODYMAINTÃ\u0089 Jelly, a conditioning food product; BODYMAINTÃ\u0089 Drink, a drinkable-liquid; POCARI SWEAT, a drink; Calorie Mate, a nutritional food; SOYJOY, a soy bar; OS-1, an oral rehydration solution; HINE E-GEL, a concentrated liquid diet; PROCESSLEAD, a chew and swallow managing food; REHADAYS, a beverage to support exercise and rehabilitation; Oronine H Ointment, a household antiseptic medicine; and vitamin tonics, herbal digestive drinks, and herbal crude drugs. In addition, the company offers soft drinks, food products, and wines; chemicals; clinical testing and medical equipment; cosmetics; warehousing and transport services; analysis and measurement equipment; pharmaceutical intermediates; vehicle headlight testers; synthetic resin molded products; paper products; artificial turf; ceramic boards, ceramic walls, reliefs, terracotta, OT ceramics, and ceramic portraits and sign boards; functional films; stable isotopes; software and services to enhance management of mental healthcare systems; potassium titanate; polyolefin foams; spring and mineral water; industrial chemicals; hydrazine; insecticide and toiletry products; and adhesive tapes. Further, it operates a hotel. Otsuka Holdings Co., Ltd. was founded in 2008 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "SNPHY": {
        "short_name": "SANTEN PHARMACEUTICAL CO",
        "long_name": "Santen Pharmaceutical Co., Ltd.",
        "summary": "Santen Pharmaceutical Co., Ltd. researches and develops, manufactures, and markets pharmaceuticals and medical devices in Japan and internationally. It offers various pharmaceutical products to treat glaucoma and ocular hypertension, such as DE-111, which is in Phase III clinical trial; DE-117 in Japan; DE-126 that is in Phase 2b clinical trial; DE-128 in Europe, as well as is in Phase 2/3 clinical trial in the United States; and DE-130A that is in Phase III clinical trial. In addition, the company provides DE-114A to treat allergic conjunctivitis; DE-076C for the treatment of vernal keratoconjunctivitis; and DE-109, which is in Phase 3 clinical trial to treat uveitis. Further, it offers DE-127 to treat myopia, which is in Phase 2/3 clinical trial in Japan, as well as is in Phase 3 in Asia; and MD-16 for the treatment of cataract. Additionally, the company offers over-the-counter pharmaceutical products. The company was formerly known as Santendo Pharmaceutical Co., Ltd. and changed its name to Santen Pharmaceutical Co., Ltd. in 1958. Santen Pharmaceutical Co., Ltd. was founded in 1890 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "SZD.F": {
        "short_name": "SANTEN PHARMA.",
        "long_name": "Santen Pharmaceutical Co., Ltd.",
        "summary": "Santen Pharmaceutical Co., Ltd. researches and develops, manufactures, and markets pharmaceuticals and medical devices in Japan and internationally. It offers various pharmaceutical products to treat glaucoma and ocular hypertension, such as DE-111, which is in Phase III clinical trial; DE-117 in Japan; DE-126 that is in Phase 2b clinical trial; DE-128 in Europe, as well as is in Phase 2/3 clinical trial in the United States; and DE-130A that is in Phase III clinical trial. In addition, the company provides DE-114A to treat allergic conjunctivitis; DE-076C for the treatment of vernal keratoconjunctivitis; and DE-109, which is in Phase 3 clinical trial to treat uveitis. Further, it offers DE-127 to treat myopia, which is in Phase 2/3 clinical trial in Japan, as well as is in Phase 3 in Asia; and MD-16 for the treatment of cataract. Additionally, the company offers over-the-counter pharmaceutical products. The company was formerly known as Santendo Pharmaceutical Co., Ltd. and changed its name to Santen Pharmaceutical Co., Ltd. in 1958. Santen Pharmaceutical Co., Ltd. was founded in 1890 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "YPH.F": {
        "short_name": "ASTELLAS PHARMA INC.",
        "long_name": "Astellas Pharma Inc.",
        "summary": "Astellas Pharma Inc. engages in the manufacture, marketing, import, and export of pharmaceuticals worldwide. It provides XTANDI, an androgen receptor signaling inhibitor for prostate cancer; XOSPATA, a FLT3 inhibitor for adult patients with relapsed or refractory acute myeloid leukemia with a FLT3 mutation-positive; PADCEV, a treatment solution for adult patients with locally advanced or metastatic urothelial cancer; Betanis/Myrbetriq/BETMIGA, a beta-3 adrenergic receptor agonist for the treatment of urgency, urinary frequency, and urge urinary incontinence; Evrenzo, an oral treatment for anemia associated with chronic kidney disease; and Prograf and Advagraf/Graceptor/ASTAGRAF, which are immunosuppressants used to suppress organ rejection following a transplant. The company also offers mirabegron for the treatment of neurogenic detrusor overactivity in pediatric patients; Vesicare for OAB treatment; Eligard to treat prostate cancer; Harnal/Omnic for benign prostatic hyperplasia treatment; and Funguard/MYCAMINE, an antifungal agent. The company has a clinical trial collaboration with Merck & Co., Inc.; CytomX Therapeutics, Inc.; and an agreement with BANDAI NAMCO Entertainment Inc. for the development of smartphone exercise support application. It also has strategic research alliance with Harvard University for the research and development of therapeutics and technologies of mutual interest; and research collaboration with Actinium Pharmaceuticals, Inc. to develop targeted radiotherapies using its Antibody Warhead Enabling technology platforms. Astellas Pharma Inc. was founded in 1923 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "YPHA.F": {
        "short_name": "ASTELLAS PHARMA UNSP.ADR",
        "long_name": "Astellas Pharma Inc.",
        "summary": "Astellas Pharma Inc. engages in the manufacture, marketing, import, and export of pharmaceuticals worldwide. It provides XTANDI, an androgen receptor signaling inhibitor for prostate cancer; XOSPATA, a FLT3 inhibitor for adult patients with relapsed or refractory acute myeloid leukemia with a FLT3 mutation-positive; PADCEV, a treatment solution for adult patients with locally advanced or metastatic urothelial cancer; Betanis/Myrbetriq/BETMIGA, a beta-3 adrenergic receptor agonist for the treatment of urgency, urinary frequency, and urge urinary incontinence; Evrenzo, an oral treatment for anemia associated with chronic kidney disease; and Prograf and Advagraf/Graceptor/ASTAGRAF, which are immunosuppressants used to suppress organ rejection following a transplant. The company also offers mirabegron for the treatment of neurogenic detrusor overactivity in pediatric patients; Vesicare for OAB treatment; Eligard to treat prostate cancer; Harnal/Omnic for benign prostatic hyperplasia treatment; and Funguard/MYCAMINE, an antifungal agent. The company has a clinical trial collaboration with Merck & Co., Inc.; CytomX Therapeutics, Inc.; and an agreement with BANDAI NAMCO Entertainment Inc. for the development of smartphone exercise support application. It also has strategic research alliance with Harvard University for the research and development of therapeutics and technologies of mutual interest; and research collaboration with Actinium Pharmaceuticals, Inc. to develop targeted radiotherapies using its Antibody Warhead Enabling technology platforms. Astellas Pharma Inc. was founded in 1923 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    }
}