{"3649.T": {"short_name": "FINDEX INC", "long_name": "FINDEX Inc.", "summary": "FINDEX Inc. engages in the research and development, manufacture, and sale of medical systems in Japan. The company's products include Claio, a medical imaging database management system for small, medium, and large size hospitals; and C-Note, a progress note system. It also offers DocuMaker, a document and data management system, which provides various input tools to enhance productivity in document creation; and GAP/GAP-screener, a gaze analyzing perimeter. In addition, the company develops applications for smart phone. It serves medical institutions, hospitals, and clinics. The company was formerly known as PSC Inc. and changed its name to FINDEX Inc. in November 2014. FINDEX Inc. was founded in 1985 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3671.T": {"short_name": "SOFTMAX CO LTD", "long_name": "Softmax Co., Ltd", "summary": "Softmax Co., Ltd provides Web type electronic medical charts and medical accounting systems in Japan. It offers Web type electronic medical record and ordering systems, health checkup systems, radiology department information systems, rehabilitation department systems, surgical department systems, and solution systems. The company was formerly known as Victor Keisanki Kyushu Hanbai Co., Ltd. and changed its name to Softmax Co., Ltd in 2001. Softmax Co., Ltd was founded in 1974 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3939.T": {"short_name": "KANAMIC NETWORK CO LTD", "long_name": "Kanamic Network Co.,LTD", "summary": "Kanamic Network Co.,LTD provides medical and elderly care information sharing system that promotes community comprehensive care in Japan. It offers medical care and elderly care communications system that provides cloud information sharing system, which offers collaboration among interdisciplinary and inter-organizational professionals in in-home care, nursing, and elderly care with care report, service calendar, and face sheet functions. The company also provides elderly care business management system, which offers a lineup of elderly care software that supports various elderly care services/business classifications, including elderly care facilities, community comprehensive support centers, and in-home care support facilities. In addition, it offers childcare support system that provides community-wide support for raising children comprising information distribution, consultation, and child growth record functions. Further, the company provides communication and application services for the elderly care and medical care fields; systems integration and solutions; website creation and operational services; management and systems consulting services; paid job placement services; and education and training services. Additionally, it is involved in the planning, production, and sale of web contents, videos, and various sales promotion tools; and planning and conducting of lectures, seminars, academic meetings, etc. Kanamic Network Co.,LTD was founded in 2000 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4172.T": {"short_name": "TOWA HI SYSTEM CO LTD", "long_name": "Towa Hi System Co., Ltd.", "summary": "TOWA Hi SYSTEM CO.,LTD. develops medical software solutions. It is involved in the research and development, sale, and support of dental electronic medical record integrated systems; and iPad and web applications, such as inspection/periodontal examination systems, interview systems, own expense estimation systems, and image management systems, etc. The company was founded in 1978 and is headquartered in Okayama, Japan.", "currency": "JPY", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Okayama"}, "4438.T": {"short_name": "WELBY INC", "long_name": "Welby Inc.", "summary": "Welby Inc. provides digital tools that assist patients and their family in medical treatment and prevention of progression of disease. The company offers marketing support services to pharmaceuticals; and health insurance society and government through its digital service platform and tool. It also provides Welby My Karte, an app for patients to share health data with health care professionals and family as a visualized chart, as well as offers medical data research services. The company was founded in 2011 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4480.T": {"short_name": "MEDLEY INC", "long_name": "Medley, Inc.", "summary": "Medley, Inc. operates platforms for recruitment and medical businesses in Japan. It operates through three segments: Recruitment Platform Business, Medical Platform Business, and New Services. The company handles JobMedley, a human resource recruitment systems for medical and healthcare, and related businesses; CLINICS Telemedicine, a telemedicine system for patients and medical institutions; CLINICS, a cloud medical support system; and MEDLEY, a medical information service for patients, as well as Kaigo-no Honne, a Website to search nursing care facilities. It also develops medical accounting software. Medley, Inc. was founded in 2009 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4483.T": {"short_name": "JMDC INC", "long_name": "JMDC Inc.", "summary": "JMDC Inc. provides medical statistics data services in Japan. The company offers medical field big data services; life insurance field big data services; support services for health insurance associations and local government health services; health data platform; and medical institution support services. It serves health insurance associations, pharmaceutical companies, life insurance companies, research institutions, etc. The company was founded in 2002 and is headquartered in Tokyo, Japan. JMDC Inc. is a subsidiary of Noritz Steel Machine Co., Ltd.", "currency": "JPY", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6095.T": {"short_name": "MEDPEER INC", "long_name": "MedPeer,Inc.", "summary": "MedPeer,Inc. provides services for doctors in Japan. Its services include clinical and career support for doctors; marketing support for enterprises and advertisement/research business; and health promotion and prevention support business for general. The company operates and manages a doctor-owned community site under the MedPeer name. It also provides online health consultation services; doctor research services; and operates MedPeer career, a doctor-specialized recruiting information portal site. The company was founded in 2004 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7079.T": {"short_name": "WDB COCO CO LTD", "long_name": "WDB coco Co., Ltd.", "summary": "WDB coco Co., Ltd. operates as a contracted drug development company. It supports the development of pharmaceuticals and medical devices with a focus on safety information management. The company was founded in 1984 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9UN.F": {"short_name": "MEDPEER INC.", "long_name": "MedPeer,Inc.", "summary": "MedPeer,Inc. provides services for doctors in Japan. Its services include clinical and career support for doctors; marketing support for enterprises and advertisement/research business; and health promotion and prevention support business for general. The company operates and manages a doctor-owned community site under the MedPeer name. It also provides online health consultation services; doctor research services; and operates MedPeer career, a doctor-specialized recruiting information portal site. The company was founded in 2004 and is based in Tokyo, Japan.", "currency": "EUR", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "MBO.F": {"short_name": "MTI LTD.", "long_name": "MTI Ltd.", "summary": "MTI Ltd. engages in the content distribution for mobile phones in Japan. The company operates Luna-Luna, a women's healthcare-related information Website; Boshimo, an application for digital management of childcare products and other information; Atleta, a condition management system that connects coaches and athletes; and CARADA, a physical data management application that connects consumers with companies, pharmacies, health examination institutions, and health insurance associations. It also offers MOBILE CONVERT, a service that optimizes PC Websites for smartphones; music.jp, an online store that offers music, movies, TV drama series, animations, books, and comics; AMY, an artificial intelligence solution that reduces operational loads of companies; and &Pay, a smartphone payment and transfer service. In addition, the company provides Life Ranger, a lifestyle-related information site that provides weather information, maps, train connection information, and navigation functions as a single service; and a site for entertainment services. MTI Ltd. was founded in 1996 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "MTHRF": {"short_name": "M3 INC", "long_name": "M3, Inc.", "summary": "M3, Inc. provides medical-related services primarily to physicians and other healthcare professionals through Internet. The company operates m3.com, a members-only Web site for providing information to the healthcare professionals; and MR-kun that delivers medical and drug information online through m3.com. It also provides MDLinx that offers the review of medical articles and theses in English for physicians in the United States; and MEDI:GATE, which provides various medical news and content, and features online discussion boards where doctors can exchange opinions and communicate with one another in South Korea. In addition, the company offers various Internet-based services for pharmaceutical and other medical-related companies, including marketing support services for medical solution providers and healthcare professionals, clinical trial services, clinical trial support services, market research services, and doctor and pharmacist recruiting support services. Further, it provides services for general public, such as the operation of AskDoctors, a Q and A site to consult doctors through the Internet; Ichie Websites comprising Ichie Breast Cancer and Ichie Menopause, which offers insights and solutions related to breast cancer and menopause; and iTicket Plus, a reservation system for clinics through mobile phones and the Internet. The company was formerly known as So-netM3, Inc. and changed its name to M3, Inc. in January 2010. M3, Inc. was founded in 2000 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "MTHRY": {"short_name": "M3 INC UNSPN ADS EACH REP 0.5 O", "long_name": "M3, Inc.", "summary": "M3, Inc. provides medical-related services primarily to physicians and other healthcare professionals through Internet. The company operates m3.com, a members-only Web site for providing information to the healthcare professionals; and MR-kun that delivers medical and drug information online through m3.com. It also provides MDLinx that offers the review of medical articles and theses in English for physicians in the United States; and MEDI:GATE, which provides various medical news and content, and features online discussion boards where doctors can exchange opinions and communicate with one another in South Korea. In addition, the company offers various Internet-based services for pharmaceutical and other medical-related companies, including marketing support services for medical solution providers and healthcare professionals, clinical trial services, clinical trial support services, market research services, and doctor and pharmacist recruiting support services. Further, it provides services for general public, such as the operation of AskDoctors, a Q and A site to consult doctors through the Internet; Ichie Websites comprising Ichie Breast Cancer and Ichie Menopause, which offers insights and solutions related to breast cancer and menopause; and iTicket Plus, a reservation system for clinics through mobile phones and the Internet. The company was formerly known as So-netM3, Inc. and changed its name to M3, Inc. in January 2010. M3, Inc. was founded in 2000 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}}