{
  "3046.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Medical Instruments & Supplies",
    "long_name": "JINS HOLDINGS Inc.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "JINS HOLDINGS INC",
    "state": null,
    "summary": "JINS HOLDINGS Inc., through its subsidiaries, engages in the planning, production, distribution, and sale of eyewear and fashion accessories in Japan. It offers eyewear, such as eye glasses and lenses; and JINS MEME that enables visualization of the user's physical and mental state. The company also provides men's and women's accessories, including bags, hats, and other items; and engages in contracting business for agriculture works. It operates retail outlets in Japan, China, the United States, Taiwan, and Hong Kong. The company was formerly known as JINS Inc. and changed its name to JINS HOLDINGS Inc. in July 2019. JINS HOLDINGS Inc. was founded in 1988 and is headquartered in Tokyo, Japan.",
    "website": "http://www.jinsholdings.com/jp/ja/",
    "zipcode": "102-0071"
  },
  "3154.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Medius Holdings Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "MEDIUS HLDG CO LTD",
    "state": null,
    "summary": "Medius Holdings Co., Ltd. operates in the medical care industry in Japan. The company sells medical equipment, such as syringes, gauze, other necessary medical consumables, and advanced medical system; and provides repair, after-sales, and maintenance services for medical equipment to hospitals and other medical facilities. It is also involved in the sale and rental of nursing care and welfare equipment to hospitals, nursing care facilities, and general individuals; and sale and rental of on-board medical instruments for ambulance, AEDs, and other emergency supplies and equipment with high social needs. The company was formerly known as Kyowa Medical Holdings, Inc. and changed its name to Medius Holdings Co., Ltd. in October 2010. Medius Holdings Co., Ltd. was founded in 2009 and is based in Tokyo, Japan.",
    "website": "http://www.medius.co.jp",
    "zipcode": "104-0031"
  },
  "3446.T": {
    "city": "Ibaraki",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Medical Instruments & Supplies",
    "long_name": "JTEC Corporation",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "JTEC CORPORATION",
    "state": null,
    "summary": "JTEC Corporation designs, manufactures, and sells X-ray mirrors for synchrotron facilities in Japan. Its X-ray mirrors are used for study in the pharmaceutical, electronic, material, food, beauty, and other fields. The company also designs, develops, manufactures, and sells automated cell culture systems, as well as automated systems in various fields. JTEC Corporation was founded in 1993 and is headquartered in Ibaraki, Japan.",
    "website": "http://www.j-tec.co.jp",
    "zipcode": "567-0086"
  },
  "3593.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Hogy Medical Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "HOGY MEDICAL CO",
    "state": null,
    "summary": "Hogy Medical Co.,Ltd. manufactures and sells expendable medical supplies to healthcare facilities in Japan and internationally. It offers kit products for surgery applications; all-in-one kits for pre/mid/post-surgery; non-woven products, including gowns, caps, underwear, drapes, packaged products, equipment covers, kurumu, towels, and accessories, as well as isolation gowns, caps, and masks for use in operating rooms, outpatient areas, hospital wards, and other areas; and Tigalyer, a multi-layer fabric. The company also provides sterilization products, such as hybrid Mekkin bags, hybrid Mekkin bags ID layered type, and autoclave forceps stand caps; Mekkin cards, which are detection cards used to judge the sterilization process when sterilizing in an autoclave; ethylene oxide gas cards that are detection cards used to judge the sterilization process when sterilizing using ethylene oxide gas; and indicator tapes for autoclave sterilization. In addition, it offers IC Tracer, a gauze control system that uses integrated circuit chips embedded in each gauze used during surgery, making each one traceable; ASRC, a product made of a foamed polyethylene sponge that provides flexibility and functionality for use in varying procedures and inosculations; and Securea, a polyurethane sponge for endoscopic surgery. The company was formerly known as Hogy Co., Ltd. and changed its name to Hogy Medical Co.,Ltd. in 1987. Hogy Medical Co.,Ltd. was founded in 1955 and is headquartered in Tokyo, Japan.",
    "website": "http://www.hogy.co.jp",
    "zipcode": "107-8615"
  },
  "3604.T": {
    "city": "Osaka",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Kawamoto Corporation",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "KAWAMOTO CORP",
    "state": null,
    "summary": "Kawamoto Corporation manufactures and supplies medical and hospital products primarily in Japan. The company offers surgical sponges for laparoscopic surgery; neurosurgical pads; oral care products, such as suction toothbrushes/sponges and oral care sponges; gauze swabs, laparotomy sponges, elastic net and tubular bandages, plaster of paris bandages, orthopedic bandages, and medical casting tapes; and adhesive plasters and pads, and plastic transparent and paper surgical tapes. It also provides disposable medical products, including syringes, needles, dental needles, scalp vein sets, infusion sets, stopcocks, cotton swabs, alcohol pads, and wooden tongue depressors; surgical blades, blood lancets, scalpels, guedel airways, resuscitation masks, urine drainage and leg bags, urine meters, and catheters; and surgical and examination gloves. In addition, the company offers medical equipment comprising sphygmomanometers, stethoscopes, and digital B.P. monitors; and sanitary and nursing products, hygiene and health-related products, baby's goods and toiletries, and light textile products. Kawamoto Corporation also exports its products to Asia, the Middle East, Africa, Europe, and North/South America. The company was formerly known as Kawamoto Bandage Material Co., Ltd. and changed its name to Kawamoto Corporation in 1996. Kawamoto Corporation was founded in 1914 and is headquartered in Osaka, Japan. Kawamoto Corporation is a subsidiary of Air Water Inc.",
    "website": "http://www.kawamoto-sangyo.co.jp",
    "zipcode": null
  },
  "4543.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Terumo Corporation",
    "market": "jp_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "TERUMO CORP",
    "state": null,
    "summary": "Terumo Corporation develops, manufactures, and distributes medical devices and services worldwide. The company operates through three segments: Cardiac and Vascular Company, General Hospital Company, and Blood and Cell Technologies Company. The Cardiac and Vascular Company segment offers angiographic guidewires, angiographic catheters, introducer sheaths, vascular closure devices, PTCA balloon catheters, coronary stents, self-expanding peripheral stent, intravascular ultrasound systems, drug-eluting stents, imaging catheters, and others; coils and stents for treating cerebral aneurysm, aspiration catheters and clot retrievers for treating ischemic stroke, and others; oxygenators, flow diverters, cardio-pulmonary bypass systems, and others; and artificial vascular and stent grafts. The General Hospital Company segment provides infusion pumps, syringe pumps, solution sets, syringes, I.V. solutions, pain management products, nutritious food, adhesion barriers, blood glucose monitoring systems, blood pressure monitors, digital thermometers, and others; and contract manufacturing of prefilled syringes, devices to pharmaceutical companies for use in drug kits, such as prefillable syringes, needles for pharmaceutical packaging business, and others. The Blood and Cell Technologies Company segment offers blood bags, automated blood collection systems, automated blood component processing systems, pathogen reduction technology, automated centrifugal apheresis systems, cell expansion system, and others. The company was formerly known as Sekisen Ken-onki Corporation and changed its name to Terumo Corporation in October 1974. Terumo Corporation was founded in 1921 and is headquartered in Tokyo, Japan.",
    "website": "http://www.terumo.co.jp",
    "zipcode": "151-0072"
  },
  "4556.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Medical Instruments & Supplies",
    "long_name": "KAINOS Laboratories, Inc.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "KAINOS LABORATORIES",
    "state": null,
    "summary": "KAINOS Laboratories, Inc. develops, manufactures, markets, distributes, and imports/exports pharmaceuticals, diagnostic reagents, related chemical products, physical and chemical measurement instruments, medical supplies, nutrition supplements, foodstuff, animal feed, and related products in Japan. The company offers various biochemical clinical testing reagents systems, such as Aqua-auto Kainos CRE-III plus Test Kit for automatic analyzer systems; Aqua-auto Kainos ALB Test Kit, a liquid form reagent kit; and Aqua-auto Kainos UN-II Test Kit, a liquid urea nitrogen measurement reagent kit. It also provides FGF-23 ELISA Kit, a two-site enzyme-linked immunosorbent assay kit for the measurement of FGF-23 in serum; Swiftgene Norovirus GI/GII Kainos for detecting noroviruses; Statmark FLUstick II for use in detecting type a and type b influenza virus antigens; and Statmark Strep A for detecting Group A beta-hemolytic streptococci. The company was formerly known as DOMS-IATRON Co., Ltd. and changed its name to KAINOS Laboratories, Inc. in July 1975. KAINOS Laboratories, Inc. was founded in 1975 and is headquartered in Tokyo, Japan.",
    "website": "http://www.kainos.co.jp",
    "zipcode": null
  },
  "5F3.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Medical Instruments & Supplies",
    "long_name": "JINS HOLDINGS Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "JINS HOLDINGS INC.",
    "state": null,
    "summary": "JINS HOLDINGS Inc., through its subsidiaries, engages in the planning, production, distribution, and sale of eyewear and fashion accessories in Japan. It offers eyewear, such as eye glasses and lenses; and JINS MEME that enables visualization of the user's physical and mental state. The company also provides men's and women's accessories, including bags, hats, and other items; and engages in contracting business for agriculture works. It operates retail outlets in Japan, China, the United States, Taiwan, and Hong Kong. The company was formerly known as JINS Inc. and changed its name to JINS HOLDINGS Inc. in July 2019. JINS HOLDINGS Inc. was founded in 1988 and is headquartered in Tokyo, Japan.",
    "website": "http://www.jinsholdings.com/jp/ja/",
    "zipcode": "102-0071"
  },
  "5FA.F": {
    "city": "Osaka",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Nipro Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "NIPRO CORP.",
    "state": null,
    "summary": "Nipro Corporation, together with its subsidiaries, engages in the medical devices, pharmaceuticals, and pharma packaging businesses. The company's Medical Device business develops, manufactures, and sells various disposable medical products comprising renal, intervention and anesthesiology, injection and infusion, dialysis, cardiopulmonary, diabetic, and cell cultures products; and sells artificial organ-related products, and generic and kit products. Its Pharmaceutical business provides pharmaceutical combination products, including dual chamber bags, pre-filled syringes, and half-type kits; and contract manufacturing services for orally administered drugs, injectables, and external preparations. The company's Pharma Packaging business offers glass vials, ampoules, syringes, and cartridges; glass tubes; glass forming machinery; glass bulbs for vacuum flasks; and other parts of pharmaceutical packaging, such as rubber plugs. Its Other business provides thermostable enzymes for clinical chemistry. The company also offers business management services. Nipro Corporation serves customers in Japan, the Americas, Europe, and rest of Asia. The company was founded in 1947 and is headquartered in Osaka, Japan.",
    "website": "http://www.nipro.co.jp",
    "zipcode": "531-8510"
  },
  "5FR.F": {
    "city": "Nagoya",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Menicon Co., Ltd.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "MENICON CO.LTD",
    "state": null,
    "summary": "Menicon Co., Ltd. manufactures and sells contact lenses and lens care products worldwide. It provides soft, GP, and specialty lenses. The company was incorporated in 1943 and is headquartered in Nagoya, Japan",
    "website": "http://www.menicon.co.jp",
    "zipcode": "460-0006"
  },
  "7716.T": {
    "city": "Kanuma",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Nakanishi Inc.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "NAKANISHI INC",
    "state": null,
    "summary": "Nakanishi Inc. manufactures and sells dental, industrial, and medical products worldwide. The company offers turbines; clinical micromotors; contra-angles; and built-in, mobile dentistry, oral hygiene, endodontic, surgical, dental laboratory, and hygiene and maintenance products. It also offers motor spindles, and micro gridlers and tools. The company serves automotive, micromechanics, electronics, medical, die/mold, aerospace, and energy industries. Nakanishi Inc. was founded in 1930 and is headquartered in Kanuma, Japan.",
    "website": "http://www.nsk-nakanishi.co.jp/industrial-eng",
    "zipcode": "322-8666"
  },
  "7733.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Olympus Corporation",
    "market": "jp_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "OLYMPUS CORPORATION",
    "state": null,
    "summary": "Olympus Corporation manufactures and sells precision machineries and instruments worldwide. The company operates through five segments: Endoscopic Solutions Business, Therapeutic Solutions Business, Scientific Solutions Business, Imaging Business, and Others. The Endoscopic Solutions Business segment offers gastrointestinal and surgical endoscopes, video and other endoscopes system, and repair services. The Therapeutic Solutions Business segment provides urology, gynecology, ear, nose, and throat products; endo-therapy and energy devices; and surgical single-use devices. The Scientific Solutions Business segment offers biological and industrial microscopes, industrial endoscopes and videoscopes, non-destructive testing equipment, and X-ray fluorescence (XRF) analyzers. The Imaging Business segment provides digital cameras, IC and voice recorders, mirrorless interchangeable-lens cameras, and interchangeable lenses. The Others segment offers biomedical materials. The company also offers medical devices, such as surgical microscopes, endoscope reprocessors, electrosurgical devices, and GI- and respiratory-endotherapy devices, as well as system integration and maintenance/services. The company was formerly known as Olympus Optical Co., Ltd. and changed its name to Olympus Corporation in October 2003. Olympus Corporation was founded in 1919 and is headquartered in Tokyo, Japan.",
    "website": "http://www.olympus-global.com",
    "zipcode": "163-0914"
  },
  "7741.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Medical Instruments & Supplies",
    "long_name": "HOYA Corporation",
    "market": "jp_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "HOYA CORP",
    "state": null,
    "summary": "HOYA Corporation operates as a med-tech company, and a supplier of high-tech and medical products worldwide. The company operates through three segments: Life Care, Information Technology, and Other. The Life Care segment offers healthcare products, including eyeglass and contact lenses; and medical products, such as medical endoscopes, laparoscopic surgical instruments, intraocular lenses, and prosthetic ceramic fillers and orthopedic implants. This segment also operates Eyecity', a chain of specialist contact lens stores. The Information Technology segment provides electronics products comprising mask blanks and photomasks for manufacturing semiconductor chips; photomasks for liquid crystal display panels; and glass disks for hard disk drives. This segment also offers imaging products that include optical glasses/optical lenses, colored glass filters, and laser equipment/UV light resources. The Other segment provides various IT solutions, which comprise system architecture and information processing, business application software, ERP solutions, and internet services; speech synthesis software; and cloud services. HOYA Corporation was founded in 1941 and is headquartered in Tokyo, Japan.",
    "website": "http://www.hoya.co.jp",
    "zipcode": "160-8347"
  },
  "7747.T": {
    "city": "Aichi",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Asahi Intecc Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "ASAHI INTECC CO LTD",
    "state": null,
    "summary": "Asahi Intecc Co., Ltd. develops, manufactures, and sells medical devices in Japan and internationally. The company provides percutaneous transluminal coronary angioplasty (PTCA) guide wires, PTCA guiding catheters, PTCA balloon catheters, and penetration catheters for cardiology; peripheral guide wires, IVR guide wires, micro catheters, and cerebrovascular system guide wires for peripheral vascular, abdominal vascular, and cerebrovascular systems; and guide wires and catheters for angiography. It also offers OEM services for medical devices; and medical and industrial components, such as element wires, stranded conductors, coils, tubes, terminal processing products, and other products, as well as ultra-fine stainless steel wire ropes, terminal processed products, etc. Asahi Intecc Co., Ltd. has business alliance agreement with Oncolys BioPharma. The company was formerly known as Asahi Mini Rope Sales Co., Ltd. and changed its name to Asahi Intecc Co., Ltd. in July 1988. Asahi Intecc Co., Ltd. was founded in 1976 and is headquartered in Aichi, Japan.",
    "website": "http://www.asahi-intecc.co.jp",
    "zipcode": "489-0071"
  },
  "7749.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Medikit Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "MEDIKIT CO LTD",
    "state": null,
    "summary": "Medikit Co.,Ltd. engages in the manufacture and sale of vascular access medical devices. The company offers IV catheters, such as supercath 5, supercath Z3V, and supercath Ztu-V for hospitals and emergency services; hemodialysis products, including supercath NEO and supercath CLS; and intervention products comprising Supersheath, Mongoose, and Meito Masamune. Its products are used in anesthetic departments, operating theaters, ICUs, and dialysis and cardiology units. The company markets its products through distributors in approximately 20 countries and territories in the European Union and on the American continent. Medikit Co.,Ltd. was founded in 1973 and is headquartered in Tokyo, Japan.",
    "website": "http://www.medikit.co.jp",
    "zipcode": "113-0034"
  },
  "7775.T": {
    "city": "Izumi",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Daiken Medical Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "DAIKEN MEDICAL CO LTD",
    "state": null,
    "summary": "Daiken Medical Co., Ltd. manufactures and distributes medical devices and equipment in Japan and internationally. The company's products include syringe pumps, disposable infusion pumps, portable disposable infusors, endobronchinal blocker tubes, suction containers, connecting tubes, suction tips, medical hand washing machines, disposable medical towels, and sterilize mats. It also trades in medical equipment. The company sells its products under the COOPDECH brand name. Daiken Medical Co., Ltd. was incorporated in 1968 and is headquartered in Izumi, Japan.",
    "website": "http://www.daiken-iki.co.jp",
    "zipcode": "594-1157"
  },
  "7780.T": {
    "city": "Nagoya",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Menicon Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "MENICON CO LTD",
    "state": null,
    "summary": "Menicon Co., Ltd. manufactures and sells contact lenses and lens care products worldwide. It provides soft, GP, and specialty lenses. The company was incorporated in 1943 and is headquartered in Nagoya, Japan",
    "website": "http://www.menicon.co.jp",
    "zipcode": "460-0006"
  },
  "7782.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Sincere Co., LTD.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "SINCERE CO LTD",
    "state": null,
    "summary": "Sincere Co., LTD. manufactures and sells contact lens in Japan. The company was founded in 2008 and is headquartered in Tokyo, Japan.",
    "website": "http://www.sincere-vision.com",
    "zipcode": "113-0033"
  },
  "7813.T": {
    "city": "Onojo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Platz Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "PLATZ CO LTD",
    "state": null,
    "summary": "Platz Co., Ltd. produces and sells care beds, mattresses, and other add-on equipment in Japan. The company's products include nursing care beds, hospital beds, care facility beds, reclining beds, mattress, and accessories, such as bed grip, side rail, table, floor protection carpet pads, and other related products. It serves retailers of medical devices and nursing care goods, as well as furniture shops. The company was formerly known as Kyushu Waken ltd. and changed its name to Platz Co., Ltd. in June 1995. Platz Co., Ltd. was founded in 1992 and is based in Onojo, Japan.",
    "website": "http://www.platz-ltd.co.jp",
    "zipcode": "816-0921"
  },
  "7817.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Paramount Bed Holdings Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "PARAMOUNT BED HOLDINGS CO LTD",
    "state": null,
    "summary": "Paramount Bed Holdings Co., Ltd. manufactures and sells hospital beds worldwide. The company offers mattresses and equipment for medical and nursing care environments; and home care products. It is also involved in the inspection and maintenance of Paramount bed products; and the leasing and wholesale of welfare care products. Paramount Bed Holdings Co., Ltd. was founded in 1947 and is headquartered in Tokyo, Japan.",
    "website": "http://www.paramount.co.jp",
    "zipcode": "136-8671"
  },
  "7979.T": {
    "city": "Kyoto",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Shofu Inc.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "SHOFU INC",
    "state": null,
    "summary": "Shofu Inc. manufactures and sells dental materials and equipment worldwide. Its products include artificial teeth, dental porcelains, dental abrasives and polishers, dental alloys, dental cements, restorative materials, dental waxes, dental investments/stones, orthodontic devices, and preventive infection control goods. The company was formerly known as Shofu Dental Mfg. Co., Ltd. and changed its name to Shofu Inc. in 1983. Shofu Inc. was founded in 1922 and is based in Kyoto, Japan.",
    "website": "http://www.shofu.co.jp",
    "zipcode": "605-0983"
  },
  "8086.T": {
    "city": "Osaka",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Nipro Corporation",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "NIPRO CORP",
    "state": null,
    "summary": "Nipro Corporation, together with its subsidiaries, engages in the medical devices, pharmaceuticals, and pharma packaging businesses. The company's Medical Device business develops, manufactures, and sells various disposable medical products comprising renal, intervention and anesthesiology, injection and infusion, dialysis, cardiopulmonary, diabetic, and cell cultures products; and sells artificial organ-related products, and generic and kit products. Its Pharmaceutical business provides pharmaceutical combination products, including dual chamber bags, pre-filled syringes, and half-type kits; and contract manufacturing services for orally administered drugs, injectables, and external preparations. The company's Pharma Packaging business offers glass vials, ampoules, syringes, and cartridges; glass tubes; glass forming machinery; glass bulbs for vacuum flasks; and other parts of pharmaceutical packaging, such as rubber plugs. Its Other business provides thermostable enzymes for clinical chemistry. The company also offers business management services. Nipro Corporation serves customers in Japan, the Americas, Europe, and rest of Asia. The company was founded in 1947 and is headquartered in Osaka, Japan.",
    "website": "http://www.nipro.co.jp",
    "zipcode": "531-8510"
  },
  "HOCPF": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Medical Instruments & Supplies",
    "long_name": "HOYA Corporation",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "HOYA CORP",
    "state": null,
    "summary": "HOYA Corporation operates as a med-tech company, and a supplier of high-tech and medical products worldwide. The company operates through three segments: Life Care, Information Technology, and Other. The Life Care segment offers healthcare products, including eyeglass and contact lenses; and medical products, such as medical endoscopes, laparoscopic surgical instruments, intraocular lenses, and prosthetic ceramic fillers and orthopedic implants. This segment also operates Eyecity', a chain of specialist contact lens stores. The Information Technology segment provides electronics products comprising mask blanks and photomasks for manufacturing semiconductor chips; photomasks for liquid crystal display panels; and glass disks for hard disk drives. This segment also offers imaging products that include optical glasses/optical lenses, colored glass filters, and laser equipment/UV light resources. The Other segment provides various IT solutions, which comprise system architecture and information processing, business application software, ERP solutions, and internet services; speech synthesis software; and cloud services. HOYA Corporation was founded in 1941 and is headquartered in Tokyo, Japan.",
    "website": "http://www.hoya.co.jp",
    "zipcode": "160-8347"
  },
  "HOCPY": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Medical Instruments & Supplies",
    "long_name": "HOYA Corporation",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "HOYA CORP",
    "state": null,
    "summary": "HOYA Corporation operates as a med-tech company, and a supplier of high-tech and medical products worldwide. The company operates through three segments: Life Care, Information Technology, and Other. The Life Care segment offers healthcare products, including eyeglass and contact lenses; and medical products, such as medical endoscopes, laparoscopic surgical instruments, intraocular lenses, and prosthetic ceramic fillers and orthopedic implants. This segment also operates Eyecity', a chain of specialist contact lens stores. The Information Technology segment provides electronics products comprising mask blanks and photomasks for manufacturing semiconductor chips; photomasks for liquid crystal display panels; and glass disks for hard disk drives. This segment also offers imaging products that include optical glasses/optical lenses, colored glass filters, and laser equipment/UV light resources. The Other segment provides various IT solutions, which comprise system architecture and information processing, business application software, ERP solutions, and internet services; speech synthesis software; and cloud services. HOYA Corporation was founded in 1941 and is headquartered in Tokyo, Japan.",
    "website": "http://www.hoya.co.jp",
    "zipcode": "160-8347"
  },
  "HYB.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Medical Instruments & Supplies",
    "long_name": "HOYA Corporation",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "HOYA CORP.",
    "state": null,
    "summary": "HOYA Corporation operates as a med-tech company, and a supplier of high-tech and medical products worldwide. The company operates through three segments: Life Care, Information Technology, and Other. The Life Care segment offers healthcare products, including eyeglass and contact lenses; and medical products, such as medical endoscopes, laparoscopic surgical instruments, intraocular lenses, and prosthetic ceramic fillers and orthopedic implants. This segment also operates Eyecity', a chain of specialist contact lens stores. The Information Technology segment provides electronics products comprising mask blanks and photomasks for manufacturing semiconductor chips; photomasks for liquid crystal display panels; and glass disks for hard disk drives. This segment also offers imaging products that include optical glasses/optical lenses, colored glass filters, and laser equipment/UV light resources. The Other segment provides various IT solutions, which comprise system architecture and information processing, business application software, ERP solutions, and internet services; speech synthesis software; and cloud services. HOYA Corporation was founded in 1941 and is headquartered in Tokyo, Japan.",
    "website": "http://www.hoya.co.jp",
    "zipcode": "160-8347"
  },
  "KA3.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Medical Instruments & Supplies",
    "long_name": "KAINOS Laboratories, Inc.",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "KAINOS LABORATORIES",
    "state": null,
    "summary": "KAINOS Laboratories, Inc. develops, manufactures, markets, distributes, and imports/exports pharmaceuticals, diagnostic reagents, related chemical products, physical and chemical measurement instruments, medical supplies, nutrition supplements, foodstuff, animal feed, and related products in Japan. The company offers various biochemical clinical testing reagents systems, such as Aqua-auto Kainos CRE-III plus Test Kit for automatic analyzer systems; Aqua-auto Kainos ALB Test Kit, a liquid form reagent kit; and Aqua-auto Kainos UN-II Test Kit, a liquid urea nitrogen measurement reagent kit. It also provides FGF-23 ELISA Kit, a two-site enzyme-linked immunosorbent assay kit for the measurement of FGF-23 in serum; Swiftgene Norovirus GI/GII Kainos for detecting noroviruses; Statmark FLUstick II for use in detecting type a and type b influenza virus antigens; and Statmark Strep A for detecting Group A beta-hemolytic streptococci. The company was formerly known as DOMS-IATRON Co., Ltd. and changed its name to KAINOS Laboratories, Inc. in July 1975. KAINOS Laboratories, Inc. was founded in 1975 and is headquartered in Tokyo, Japan.",
    "website": "http://www.kainos.co.jp",
    "zipcode": null
  },
  "MJJ.F": {
    "city": "Utsunomiya",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Mani, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "MANI INC.",
    "state": null,
    "summary": "Mani, Inc. engages in the research, development, manufacture, and distribution of medical devices and dental instruments in Japan and internationally. The company offers surgical instruments, such as maniplers, vessel knives, knives, stainless wire needles, and saws used in surgical operations for incision, cutting, and suture; and ophthalmic instruments, including ophthalmic sutures and knives, and trocar kits for eye surgeries, including cataract operations. It also provides surgical eyeless and eyed needles; and dental instruments, such as endodontic instruments, endodontic rotary instruments, root canal obturation, diamond and carbide burs, finishing and polishing instruments, sutures and surgical needles, endodontic micro-accessories, and endodontic accessories. In addition, the company imports and sells medical devices. Mani, Inc. was founded in 1956 and is headquartered in Utsunomiya, Japan.",
    "website": "http://www.mani.co.jp",
    "zipcode": "321-3231"
  },
  "OCPNY": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Olympus Corporation",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "OLYMPUS CORPORATION",
    "state": null,
    "summary": "Olympus Corporation manufactures and sells precision machineries and instruments worldwide. The company operates through five segments: Endoscopic Solutions Business, Therapeutic Solutions Business, Scientific Solutions Business, Imaging Business, and Others. The Endoscopic Solutions Business segment offers gastrointestinal and surgical endoscopes, video and other endoscopes system, and repair services. The Therapeutic Solutions Business segment provides urology, gynecology, ear, nose, and throat products; endo-therapy and energy devices; and surgical single-use devices. The Scientific Solutions Business segment offers biological and industrial microscopes, industrial endoscopes and videoscopes, non-destructive testing equipment, and X-ray fluorescence (XRF) analyzers. The Imaging Business segment provides digital cameras, IC and voice recorders, mirrorless interchangeable-lens cameras, and interchangeable lenses. The Others segment offers biomedical materials. The company also offers medical devices, such as surgical microscopes, endoscope reprocessors, electrosurgical devices, and GI- and respiratory-endotherapy devices, as well as system integration and maintenance/services. The company was formerly known as Olympus Optical Co., Ltd. and changed its name to Olympus Corporation in October 2003. Olympus Corporation was founded in 1919 and is headquartered in Tokyo, Japan.",
    "website": "http://www.olympus-global.com",
    "zipcode": "163-0914"
  },
  "OLY1.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Olympus Corporation",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "OLYMPUS CORP.",
    "state": null,
    "summary": "Olympus Corporation manufactures and sells precision machineries and instruments worldwide. The company operates through five segments: Endoscopic Solutions Business, Therapeutic Solutions Business, Scientific Solutions Business, Imaging Business, and Others. The Endoscopic Solutions Business segment offers gastrointestinal and surgical endoscopes, video and other endoscopes system, and repair services. The Therapeutic Solutions Business segment provides urology, gynecology, ear, nose, and throat products; endo-therapy and energy devices; and surgical single-use devices. The Scientific Solutions Business segment offers biological and industrial microscopes, industrial endoscopes and videoscopes, non-destructive testing equipment, and X-ray fluorescence (XRF) analyzers. The Imaging Business segment provides digital cameras, IC and voice recorders, mirrorless interchangeable-lens cameras, and interchangeable lenses. The Others segment offers biomedical materials. The company also offers medical devices, such as surgical microscopes, endoscope reprocessors, electrosurgical devices, and GI- and respiratory-endotherapy devices, as well as system integration and maintenance/services. The company was formerly known as Olympus Optical Co., Ltd. and changed its name to Olympus Corporation in October 2003. Olympus Corporation was founded in 1919 and is headquartered in Tokyo, Japan.",
    "website": "http://www.olympus-global.com",
    "zipcode": "163-0914"
  },
  "OLYS.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Olympus Corporation",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "OLYMPUS CORP. ADR",
    "state": null,
    "summary": "Olympus Corporation manufactures and sells precision machineries and instruments worldwide. The company operates through five segments: Endoscopic Solutions Business, Therapeutic Solutions Business, Scientific Solutions Business, Imaging Business, and Others. The Endoscopic Solutions Business segment offers gastrointestinal and surgical endoscopes, video and other endoscopes system, and repair services. The Therapeutic Solutions Business segment provides urology, gynecology, ear, nose, and throat products; endo-therapy and energy devices; and surgical single-use devices. The Scientific Solutions Business segment offers biological and industrial microscopes, industrial endoscopes and videoscopes, non-destructive testing equipment, and X-ray fluorescence (XRF) analyzers. The Imaging Business segment provides digital cameras, IC and voice recorders, mirrorless interchangeable-lens cameras, and interchangeable lenses. The Others segment offers biomedical materials. The company also offers medical devices, such as surgical microscopes, endoscope reprocessors, electrosurgical devices, and GI- and respiratory-endotherapy devices, as well as system integration and maintenance/services. The company was formerly known as Olympus Optical Co., Ltd. and changed its name to Olympus Corporation in October 2003. Olympus Corporation was founded in 1919 and is headquartered in Tokyo, Japan.",
    "website": "http://www.olympus-global.com",
    "zipcode": "163-0914"
  },
  "TRUMF": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Terumo Corporation",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "TERUMO CORP",
    "state": null,
    "summary": "Terumo Corporation develops, manufactures, and distributes medical devices and services worldwide. The company operates through three segments: Cardiac and Vascular Company, General Hospital Company, and Blood and Cell Technologies Company. The Cardiac and Vascular Company segment offers angiographic guidewires, angiographic catheters, introducer sheaths, vascular closure devices, PTCA balloon catheters, coronary stents, self-expanding peripheral stent, intravascular ultrasound systems, drug-eluting stents, imaging catheters, and others; coils and stents for treating cerebral aneurysm, aspiration catheters and clot retrievers for treating ischemic stroke, and others; oxygenators, flow diverters, cardio-pulmonary bypass systems, and others; and artificial vascular and stent grafts. The General Hospital Company segment provides infusion pumps, syringe pumps, solution sets, syringes, I.V. solutions, pain management products, nutritious food, adhesion barriers, blood glucose monitoring systems, blood pressure monitors, digital thermometers, and others; and contract manufacturing of prefilled syringes, devices to pharmaceutical companies for use in drug kits, such as prefillable syringes, needles for pharmaceutical packaging business, and others. The Blood and Cell Technologies Company segment offers blood bags, automated blood collection systems, automated blood component processing systems, pathogen reduction technology, automated centrifugal apheresis systems, cell expansion system, and others. The company was formerly known as Sekisen Ken-onki Corporation and changed its name to Terumo Corporation in October 1974. Terumo Corporation was founded in 1921 and is headquartered in Tokyo, Japan.",
    "website": "http://www.terumo.co.jp",
    "zipcode": "151-0072"
  },
  "TRUMY": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Terumo Corporation",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "TERUMO CORP",
    "state": null,
    "summary": "Terumo Corporation develops, manufactures, and distributes medical devices and services worldwide. The company operates through three segments: Cardiac and Vascular Company, General Hospital Company, and Blood and Cell Technologies Company. The Cardiac and Vascular Company segment offers angiographic guidewires, angiographic catheters, introducer sheaths, vascular closure devices, PTCA balloon catheters, coronary stents, self-expanding peripheral stent, intravascular ultrasound systems, drug-eluting stents, imaging catheters, and others; coils and stents for treating cerebral aneurysm, aspiration catheters and clot retrievers for treating ischemic stroke, and others; oxygenators, flow diverters, cardio-pulmonary bypass systems, and others; and artificial vascular and stent grafts. The General Hospital Company segment provides infusion pumps, syringe pumps, solution sets, syringes, I.V. solutions, pain management products, nutritious food, adhesion barriers, blood glucose monitoring systems, blood pressure monitors, digital thermometers, and others; and contract manufacturing of prefilled syringes, devices to pharmaceutical companies for use in drug kits, such as prefillable syringes, needles for pharmaceutical packaging business, and others. The Blood and Cell Technologies Company segment offers blood bags, automated blood collection systems, automated blood component processing systems, pathogen reduction technology, automated centrifugal apheresis systems, cell expansion system, and others. The company was formerly known as Sekisen Ken-onki Corporation and changed its name to Terumo Corporation in October 1974. Terumo Corporation was founded in 1921 and is headquartered in Tokyo, Japan.",
    "website": "http://www.terumo.co.jp",
    "zipcode": "151-0072"
  },
  "TUO.F": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Terumo Corporation",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "TERUMO CORP.",
    "state": null,
    "summary": "Terumo Corporation develops, manufactures, and distributes medical devices and services worldwide. The company operates through three segments: Cardiac and Vascular Company, General Hospital Company, and Blood and Cell Technologies Company. The Cardiac and Vascular Company segment offers angiographic guidewires, angiographic catheters, introducer sheaths, vascular closure devices, PTCA balloon catheters, coronary stents, self-expanding peripheral stent, intravascular ultrasound systems, drug-eluting stents, imaging catheters, and others; coils and stents for treating cerebral aneurysm, aspiration catheters and clot retrievers for treating ischemic stroke, and others; oxygenators, flow diverters, cardio-pulmonary bypass systems, and others; and artificial vascular and stent grafts. The General Hospital Company segment provides infusion pumps, syringe pumps, solution sets, syringes, I.V. solutions, pain management products, nutritious food, adhesion barriers, blood glucose monitoring systems, blood pressure monitors, digital thermometers, and others; and contract manufacturing of prefilled syringes, devices to pharmaceutical companies for use in drug kits, such as prefillable syringes, needles for pharmaceutical packaging business, and others. The Blood and Cell Technologies Company segment offers blood bags, automated blood collection systems, automated blood component processing systems, pathogen reduction technology, automated centrifugal apheresis systems, cell expansion system, and others. The company was formerly known as Sekisen Ken-onki Corporation and changed its name to Terumo Corporation in October 1974. Terumo Corporation was founded in 1921 and is headquartered in Tokyo, Japan.",
    "website": "http://www.terumo.co.jp",
    "zipcode": "151-0072"
  }
}
