{
    "3079.T": {
        "short_name": "DVX INC.",
        "long_name": "DVx Inc.",
        "summary": "DVx Inc. engages in the import/export of medical devices and related peripheral devices in Japan. The company sells arrhythmia-related products, such as cardiac pacemakers, implantable cardioverter defibrillators, electrode catheters, and ablation catheters. It also offers ischemia-related products, including excimer laser systems; RADPAD, which reduces scatter radiation exposure to medical personnel during fluoroscopy procedures; RADNEK that reduces scatter radiation exposure to the thyroid in medical personnel during fluoroscopy procedures; RADCAP, which reduces scatter radiation exposure to the head of medical personnel during fluoroscopy procedures; and resolution/resolution SD and wonder belt products. In addition, the company engages in the research, development, manufacture, sale, repair, and leasing of medical devices and related peripheral devices; provision of internal and external medical and medical device-related general consulting and services; and medical publishing and market research activities. DVx Inc. was founded in 1986 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "171-0033",
        "website": "http://www.dvx.jp",
        "market_cap": "Micro Cap"
    },
    "4548.T": {
        "short_name": "SEIKAGAKU CORP",
        "long_name": "Seikagaku Corporation",
        "summary": "Seikagaku Corporation manufactures and sells pharmaceuticals and medical devices primarily related to glycoconjugates in Japan and internationally. The company operates in two segments, Pharmaceuticals and LAL. It offers pharmaceuticals and medical devices, including intra-articular injections for improving joint functions under the brands of ARTZ, ARTZ Dispo, VISCO-3, and SUPARTZ FX; ophthalmic surgical aids under the OPEGAN, OPEGAN Hi, and SHELLGAN brands; surgical aids for endoscopic mucosal resection under the brand name of MucoUp; and cross-linked hyaluronate hydrogel for knee osteoarthritis under the brand name Gel-One, as well as HERNICORE for the treatment of lumbar disc herniation. The company also offers bulk products comprising sodium hyaluronate and sodium chondroitin sulfate for use in pharmaceuticals and cosmetics. In addition, it develops endotoxin-detecting reagents for use in quality control of injectable pharmaceuticals, biological products, medical devices, manufacturing processes, and water quality control of dialysate under the brands, such as Pyrochrome, ENDOSPECY, TOXICOLOR, etc. Further, the company develops and markets oral care products comprising mouthwash under the KINUSUI Spray brand. Additionally, its products under development include SI-6603 for lumbar disc herniation; SI-614, a modified hyaluronate for dry eyes; SI-613 for osteoarthritis; SI-613-ETP to treat enthesopathy; and SI-449, a powdered adhesion barrier. The company was formerly known as K.K. Seikagaku Kenkyusho and changed its name to Seikagaku Corporation in 1962. Seikagaku Corporation was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.seikagaku.co.jp",
        "market_cap": "Small Cap"
    },
    "4549.T": {
        "short_name": "EIKEN CHEMICAL CO",
        "long_name": "Eiken Chemical Co., Ltd.",
        "summary": "Eiken Chemical Co., Ltd. manufactures and sells clinical diagnostics and equipment in Japan. The company is involved in developing clinical diagnostic aids to various aspects of contemporary medicine, including biochemical, immunological, serological, dry chemical diagnosis, and automatic analyzers. It also develops and supplies OC-SENSOR, an automated immunochemical fecal test for detecting gastrointestinal bleeding associated with disorders, such as colorectal cancer, polyps, and diverticulitis. In addition, the company offers real-time turbidi meters, and homeothermal equipment; amplification kits and fluorescence detection reagents for research use; and detection kits. Further, it manufactures a range of products that are used in the field of microbiology; and provides other products comprising immunological and serological reagents. The company was formerly known as Nihon Eiyokagaku Co., Ltd. and changed its name to Eiken Chemical Co., Ltd. in 1969. Eiken Chemical Co., Ltd. was founded in 1939 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "110-8408",
        "website": "http://www.eiken.co.jp",
        "market_cap": "Small Cap"
    },
    "5187.T": {
        "short_name": "CREATE MEDIC CO",
        "long_name": "Create Medic Co., Ltd.",
        "summary": "Create Medic Co., Ltd. researches, manufactures, and sells medical appliances in Japan and internationally. The company offers disposable medical devices made of silicone resin. It provides various urology, gastroenterology, percutaneous endoscopic gastrostomy, and surgery products. The company also provides other products, such as CLINY tracheostomy tubes, endotracheal tubes, tracheostomy tubes, and micro catheters. In addition, it offers OEM products comprising multi-lumen tubes, ultrathin-walls, profile extrusions, and special structures; special shape and high-volume low-pressure cuff moldings; and hydrophilic coating and needles, as well as the technology on OEM basis. The company was formerly known as NASK Co., Ltd. and changed its name to Create Medic Co., Ltd. in July 1977. Create Medic Co., Ltd. was founded in 1974 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "224-0037",
        "website": "http://www.createmedic.co.jp",
        "market_cap": "Micro Cap"
    },
    "6823.T": {
        "short_name": "RION CO LTD",
        "long_name": "Rion Co., Ltd.",
        "summary": "Rion Co., Ltd. manufactures, sells, and maintains hearing instruments, medical equipment, sound and vibration measuring instruments, particle counters, and related parts and equipment in Japan and internationally. The company's audiological equipment includes hearing instruments, such as analog and digital BTE, trimmer digital BTE, in-the-ear ready and custom made, and analog body aid instruments, as well as waterproof hearing instruments; and medical equipment comprising audiometers and OAE screeners. Its sound and vibration measuring instruments include sound level meters, vibration meters, seismometers, frequency analyzers, microphones and accelerometers, recorders, and other products. The company's particle counters comprise air and liquid- borne particle counters, and viable particle counters. Its products are primarily used in the applications of environment-related administration, electronics, semiconductors, pharmaceutical, and food manufacturing industries. The company was formerly known as Kobayashi-Riken Seisakusho Ltd. and changed its name to Rion Co., Ltd. in 1960. Rion Co., Ltd. was incorporated in 1944 and is headquartered in Kokubunji, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kokubunji",
        "zipcode": "185-8533",
        "website": "http://www.rion.co.jp",
        "market_cap": "Micro Cap"
    },
    "6849.T": {
        "short_name": "NIHON KOHDEN CORP",
        "long_name": "Nihon Kohden Corporation",
        "summary": "Nihon Kohden Corporation develops, produces, and sells medical electronic equipment in Japan and internationally. It provides physiological measuring equipment, including electroencephalographs, electrocardiographs, evoked potential and electromyogram measuring systems, and polygraphs for cath labs, as well as diagnostic information systems and related consumables, such as recording papers, electrodes and catheters, and maintenance services. The company also offers patient monitors systems comprising central monitors, bedside monitors, wireless monitors, remote access software, and other equipment; and clinical information systems and related consumables and services, such as electrodes and sensors, and maintenance services. In addition, it provides treatment equipment, which include defibrillators, automated external defibrillators (AED), pacemakers, ventilators, anesthesia machines, cochlear implants, and related consumables and services, such as AED pads and batteries. Further, the company offers other medical equipment, including hematology analyzers, clinical chemistry analyzers, ultrasound diagnostic equipment, and equipment for research and others, as well as consumables, including test reagents, and installation and maintenance services. Nihon Kohden Corporation was founded in 1951 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "161-8560",
        "website": "http://www.nihonkohden.com",
        "market_cap": "Mid Cap"
    },
    "6960.T": {
        "short_name": "FUKUDA DENSHI CO",
        "long_name": "Fukuda Denshi Co., Ltd.",
        "summary": "Fukuda Denshi Co., Ltd. develops, manufactures, and sells medical electronic equipment worldwide. It provides resting electrocardiograph products; data management software; stress test products; Holter products and software; and patient monitoring systems, including central and bedside monitors, digital transmitters, and central viewer workstations. The company also offers defibrillator monitors; and ultrasound scanners, as well as vascular screening systems. Fukuda Denshi Co., Ltd. was founded in 1948 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "113-8420",
        "website": "http://www.fukuda.co.jp",
        "market_cap": "Small Cap"
    },
    "7575.T": {
        "short_name": "JAPAN LIFELINE CO",
        "long_name": "Japan Lifeline Co., Ltd.",
        "summary": "Japan Lifeline Co., Ltd., a medical device company, develops, produces, imports, distributes, and trades in cardiovascular related medical devices in Japan. Its cardiac rhythm management products include cardiac pacemakers, implantable cardioverter defibrillators, cardiac resynchronization therapy defibrillators and pacemakers, and automated external defibrillators; and electrophysiology/ablation products comprise electrophysiological and ablation catheters, irrigated tip ablation catheters, endoscopic balloon ablation systems, esophageal temperature monitoring systems, internal atrial cardioversion systems, and radio-frequency transseptal needles. The company's cardiovascular and vascular surgery products consist of vascular and open stent grafts, and abdominal stent-grafts; and transvascular intervention products include PTCA and PTA guide wires, PTCA balloon catheters, radiofrequency wires, and atrial septal defect closure devices. Japan Lifeline Co., Ltd. was incorporated in 1981 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "140-0002",
        "website": "http://www.japanlifeline.com",
        "market_cap": "Small Cap"
    },
    "7779.T": {
        "short_name": "CYBERDYNE INC",
        "long_name": "CYBERDYNE Inc.",
        "summary": "CYBERDYNE Inc. manufactures and sells medical devices in Japan. The company offers Hybrid Assistive Limb (HAL) for medical use for people who have disorders in the lower limb and leg weaknesses, as well as non-medical HAL; HAL peripherals; cleaning robots; transportation robots for various transportation tasks in factories, offices, and other indoor environments; and Acoustic X, a high speed light pulse LED array light source that enables real time photoacoustic imaging. It also provides HAL Therapy, a medical service to provide medical treatment for functional improvement of patients with cerebral, nervous, spinal cord injury, and cerebral embolism disorders; and non-medical services, such as HAL FIT and ROBO CARE training programs. The company operates 16 Neuro HALFIT service centers. CYBERDYNE Inc. has a strategic partnership with CellSource Co., Ltd. to jointly discover new treatment methods for patients with osteoarthritis of the knee caused by aging. The company was incorporated in 2004 and is headquartered in Tsukuba, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tsukuba",
        "zipcode": "305-0818",
        "website": "http://www.cyberdyne.jp",
        "market_cap": "Small Cap"
    },
    "7963.T": {
        "short_name": "KOKEN LTD",
        "long_name": "Koken Ltd.",
        "summary": "Koken Ltd., together with its subsidiaries, produces and sells occupational personal protective equipment in Japan and internationally. It operates in Mask-Related Business and Other Businesses segments. The company offers clean air solutions, including KOACH, an open clean zone creator; KOKENLAMINAR, a push-pull ventilation system; and LAMIKOACH, an air ventilation system as contamination source control. It also provides IMADEZE, a copper-based lactate antibacterial agent; masks for medical facilities and general consumers; and functional water production systems, such as electrolyzed water generators, endoscope washers/disinfectors, blood stain washer kits, and portable showers, as well as magnetic water treatment systems. In addition, the company offers respirators for industrial use, including particulate respirators, powered air-purifying respirators, supplied air respirators, chemical cartridge respirators, and gas masks; respirators for general consumers; equipment for accident and disaster countermeasures; and protective clothes, ear plugs, face shields, etc. Koken Ltd. was founded in 1943 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.koken-ltd.co.jp",
        "market_cap": "Micro Cap"
    },
    "8C4.F": {
        "short_name": "CYBERDYNE INC.",
        "long_name": "CYBERDYNE Inc.",
        "summary": "CYBERDYNE Inc. manufactures and sells medical devices in Japan. The company offers Hybrid Assistive Limb (HAL) for medical use for people who have disorders in the lower limb and leg weaknesses, as well as non-medical HAL; HAL peripherals; cleaning robots; transportation robots for various transportation tasks in factories, offices, and other indoor environments; and Acoustic X, a high speed light pulse LED array light source that enables real time photoacoustic imaging. It also provides HAL Therapy, a medical service to provide medical treatment for functional improvement of patients with cerebral, nervous, spinal cord injury, and cerebral embolism disorders; and non-medical services, such as HAL FIT and ROBO CARE training programs. The company operates 16 Neuro HALFIT service centers. CYBERDYNE Inc. has a strategic partnership with CellSource Co., Ltd. to jointly discover new treatment methods for patients with osteoarthritis of the knee caused by aging. The company was incorporated in 2004 and is headquartered in Tsukuba, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tsukuba",
        "zipcode": "305-0818",
        "website": "http://www.cyberdyne.jp",
        "market_cap": "Small Cap"
    },
    "CYBQF": {
        "short_name": "CYBERDYNE INC",
        "long_name": "CYBERDYNE Inc.",
        "summary": "CYBERDYNE Inc. manufactures and sells medical devices in Japan. The company offers Hybrid Assistive Limb (HAL) for medical use for people who have disorders in the lower limb and leg weaknesses, as well as non-medical HAL; HAL peripherals; cleaning robots; transportation robots for various transportation tasks in factories, offices, and other indoor environments; and Acoustic X, a high speed light pulse LED array light source that enables real time photoacoustic imaging. It also provides HAL Therapy, a medical service to provide medical treatment for functional improvement of patients with cerebral, nervous, spinal cord injury, and cerebral embolism disorders; and non-medical services, such as HAL FIT and ROBO CARE training programs. The company operates 16 Neuro HALFIT service centers. CYBERDYNE Inc. has a strategic partnership with CellSource Co., Ltd. to jointly discover new treatment methods for patients with osteoarthritis of the knee caused by aging. The company was incorporated in 2004 and is headquartered in Tsukuba, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tsukuba",
        "zipcode": "305-0818",
        "website": "http://www.cyberdyne.jp",
        "market_cap": "Small Cap"
    },
    "CYBQY": {
        "short_name": "CYBERDYNE INC",
        "long_name": "CYBERDYNE Inc.",
        "summary": "CYBERDYNE Inc. manufactures and sells medical devices in Japan. The company offers Hybrid Assistive Limb (HAL) for medical use for people who have disorders in the lower limb and leg weaknesses, as well as non-medical HAL; HAL peripherals; cleaning robots; transportation robots for various transportation tasks in factories, offices, and other indoor environments; and Acoustic X, a high speed light pulse LED array light source that enables real time photoacoustic imaging. It also provides HAL Therapy, a medical service to provide medical treatment for functional improvement of patients with cerebral, nervous, spinal cord injury, and cerebral embolism disorders; and non-medical services, such as HAL FIT and ROBO CARE training programs. The company operates 16 Neuro HALFIT service centers. CYBERDYNE Inc. has a strategic partnership with CellSource Co., Ltd. to jointly discover new treatment methods for patients with osteoarthritis of the knee caused by aging. The company was incorporated in 2004 and is headquartered in Tsukuba, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tsukuba",
        "zipcode": "305-0818",
        "website": "http://www.cyberdyne.jp",
        "market_cap": "Small Cap"
    },
    "DMTRF": {
        "short_name": "3-D MATRIX LTD",
        "long_name": "3-D Matrix, Ltd.",
        "summary": "3-D Matrix, Ltd. develops self-assembling peptide technology. It offers PuraMatrix, a self-assembling peptide hydrogel for use in the fields of regenerative medicine, cell therapy, drug delivery technology, and surgical treatment. The company was founded in 2004 and is based in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0083",
        "website": "http://www.3d-matrix.co.jp",
        "market_cap": "Micro Cap"
    },
    "JMD.F": {
        "short_name": "JP.MEDICAL DY.MARK.",
        "long_name": "Japan Medical Dynamic Marketing, INC.",
        "summary": "Japan Medical Dynamic Marketing, INC. develops, manufactures, imports, and sells medical devices in Japan. It provides trauma devices, including nails, screws, plates, and other products surgically implanted in the fracture site; joint prostheses, which replaces natural joints and restores functions damaged or lost due to disease or injury; spinal fixation devices for the use in spinal instability surgery; and artificial bone fillers for the treatment of bone fractures, tumors, and other defects. The company offers its products to medical professionals and hospitals. The company was founded in 1973 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "162-0066",
        "website": "http://www.jmdm.co.jp",
        "market_cap": "Small Cap"
    },
    "NHNKY": {
        "short_name": "NIHON KOHDEN CORP",
        "long_name": "Nihon Kohden Corporation",
        "summary": "Nihon Kohden Corporation develops, produces, and sells medical electronic equipment in Japan and internationally. It provides physiological measuring equipment, including electroencephalographs, electrocardiographs, evoked potential and electromyogram measuring systems, and polygraphs for cath labs, as well as diagnostic information systems and related consumables, such as recording papers, electrodes and catheters, and maintenance services. The company also offers patient monitors systems comprising central monitors, bedside monitors, wireless monitors, remote access software, and other equipment; and clinical information systems and related consumables and services, such as electrodes and sensors, and maintenance services. In addition, it provides treatment equipment, which include defibrillators, automated external defibrillators (AED), pacemakers, ventilators, anesthesia machines, cochlear implants, and related consumables and services, such as AED pads and batteries. Further, the company offers other medical equipment, including hematology analyzers, clinical chemistry analyzers, ultrasound diagnostic equipment, and equipment for research and others, as well as consumables, including test reagents, and installation and maintenance services. Nihon Kohden Corporation was founded in 1951 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "161-8560",
        "website": "http://www.nihonkohden.com",
        "market_cap": "Mid Cap"
    }
}