{
  "2664.T": {
    "city": "Oyama",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Cawachi Limited",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "CAWACHI LIMITED",
    "state": null,
    "summary": "Cawachi Limited manages drugstores in Japan. The company retails pharmaceuticals, health foods, child care products, cosmetics, daily miscellaneous goods, general food products, confectionery products, etc. It also involved in the insurance business. The company operates 346 drugstores. Cawachi Limited was founded in 1967 and is headquartered in Oyama, Japan.",
    "website": "http://www.cawachi.co.jp",
    "zipcode": "323-0061"
  },
  "2796.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Pharmarise Holdings Corporation",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "PHARMARISE HOLDINGS CORPORATION",
    "state": null,
    "summary": "Pharmarise Holdings Corporation manages dispensing pharmacies in Japan. Its dispensing pharmacies provide patients with dispensing services based on prescriptions drawn up by medical institutions. The company also manages drug stores and convenience stores; and sells cosmetics. In addition, it is involved in the storage and management of medical examination records of patients on behalf of medical institutions; operation of medical mall; and provision of temporary help, and stationery and office furniture. As of June 1, 2018, the company operated 308 pharmacies. Pharmarise Holdings Corporation was founded in 1984 and is headquartered in Tokyo, Japan.",
    "website": "http://www.pharmarise.com",
    "zipcode": "164-0011"
  },
  "2928.S": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "SAP",
    "industry": "Pharmaceutical Retailers",
    "long_name": "RIZAP GROUP, Inc.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "RIZAP GROUP INC",
    "state": null,
    "summary": "RIZAP GROUP, Inc. engages in beauty, health, and lifestyle related businesses in Japan. It is also involved in the body makeup business; production, wholesale, and retail business of interior goods; sales of cosmetics, beauty equipment, and health food; maternity/baby related business; franchise business for various miscellaneous goods; bag planning/manufacturing; wholesale and retail of recording media, mobile phone, music video software, audio-video related miscellaneous goods, etc.; and book, magazine, and newspaper publication businesses. In addition, the company provides medical institution consulting, marketing support, and medical peripheral services; contact, mailing, and logistics services; printing agency and multimedia advertising services; general commercial printing and special printing services; processes and sells electrical parts; produces and sells various packaging materials and display backlight condensers; and plans and sells sports equipment, such as soccer, futsal, athletics, running, basketball, rugby, baseball equipment, etc. Further, it engages in fitness, cafe, childcare, and soccer club management; wholesale of Japanese clothing, women's clothing, etc.; designing, manufacturing, and wholesale of twisted yarn; watch import and wholesale; real estate/general construction; internet mail order, general merchandise OEM, and production management businesses, as well as operates specialty chain stores that sells casual wear and miscellaneous goods. The company was formerly known as KenKou Corporation, Inc. and changed its name to RIZAP GROUP, Inc. in July 2016. RIZAP GROUP, Inc. was founded in 2003 and is headquartered in Tokyo, Japan.",
    "website": "http://www.rizapgroup.com",
    "zipcode": "169-0074"
  },
  "3034.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Qol Holdings Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "QOL HOLDINGS CO LTD",
    "state": null,
    "summary": "Qol Holdings Co., Ltd., together with its subsidiaries, engages in dispensing pharmacy and business process outsourcing contracting businesses in Japan. The company operates dispensing pharmacies through one-on-one store opening based on one-on-one trust relationships with medical institutions. It also undertakes sales and marketing research activities for pharmaceutical companies; and provides temporary staff dispatch for pharmacists, nurses, registered sellers, registered dietitians, etc. In addition, the company offers clinical trial support services for pharmaceuticals and food products; support, monitoring, and technician dispatch services of managers for various processes, from planning of trial execution plans to monitoring, secretariat support, statistical analysis, and the presentation of conference papers; and publishing related services. The company was formerly known as Qol Co., Ltd. and changed its name to Qol Holdings Co., Ltd. in October 2018. Qol Holdings Co., Ltd. was founded in 1992 and is headquartered in Tokyo, Japan.",
    "website": "http://www.qolhd.co.jp",
    "zipcode": "105-8452"
  },
  "3088.T": {
    "city": "Matsudo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Matsumotokiyoshi Holdings Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "MATSUMOTOKIYOSHI HOLDINGS CO LT",
    "state": null,
    "summary": "Matsumotokiyoshi Holdings Co., Ltd. operates a chain of drug stores and insurance dispensing pharmacies in Japan. The company also provides wholesale, as well as management support services. It operates through a network of 1,717 retail stores in 47 prefectures in Japan. The company also operates 31 branches in Thailand; and stores in Taiwan. Matsumotokiyoshi Holdings Co., Ltd. was founded in 1932 and is headquartered in Matsudo, Japan.",
    "website": "http://www.matsumotokiyoshi-hd.co.jp",
    "zipcode": "270-8511"
  },
  "3098.T": {
    "city": "Yokohama",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pharmaceutical Retailers",
    "long_name": "cocokara fine Inc.",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "COCOKARA FINE INC",
    "state": null,
    "summary": "cocokara fine Inc., through its subsidiaries, engages in the drugstore and pharmacy operations in Japan. It also provides nursing and at-home care services; and operates assisted living facilities. In addition, the company is involved in the retail of health and beauty care products; promotion of employment of people with disabilities; sale and leasing of nursing care equipment and remodel homes; and logistics and online shopping businesses. It operates approximately 1,300 stores. cocokara fine Inc. was founded in 2008 and is headquartered in Yokohama, Japan.",
    "website": "http://corp.cocokarafine.co.jp",
    "zipcode": "222-0033"
  },
  "3141.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Welcia Holdings Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "WELCIA HOLDINGS CO LTD",
    "state": null,
    "summary": "Welcia Holdings Co., Ltd., together with its subsidiaries, operates a chain of drug stores with dispensing pharmacies in Japan. Its stores primarily sells OTC and food, dispensing, cosmetics, household goods, and other products. The company also offers counseling services and long-term care services; and operates at-home care services and residential care facilities. It offers its products through an e-commerce site. As of March 1, 2020, the company operated 2,025 domestic and 7 overseas stores. Welcia Holdings Co., Ltd. was founded in 2008 and is headquartered in Tokyo, Japan. Welcia Holdings Co., Ltd. is a subsidiary of Aeon Co., Ltd.",
    "website": "http://www.welcia.co.jp",
    "zipcode": "101-0021"
  },
  "3148.T": {
    "city": "Yokohama",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Create SD Holdings Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "CREATE SD HOLDINGS CO LTD",
    "state": null,
    "summary": "Create SD Holdings Co., Ltd., through its subsidiaries, engages in drug store, dispensing pharmacy, and nursing care businesses in Japan. The company sells pharmaceuticals, cosmetics, food products, daily goods, etc. It also operates and manages nursing homes and functional training type day service centers, as well as provides cleaning services for shops and administrative assistance work, etc. The company was founded in 1998 and is headquartered in Yokohama, Japan.",
    "website": "http://www.createsdhd.co.jp",
    "zipcode": "225-0014"
  },
  "3391.T": {
    "city": "Sapporo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Tsuruha Holdings Inc.",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "TSURUHA HOLDINGS INC",
    "state": null,
    "summary": "Tsuruha Holdings Inc. operates drugstores in Japan. Its drugstores offer medicines and supplements, as well as health, beauty, and diet goods. The company operates approximately 1,600 stores. It also sells products through mail order and online shops. The company was founded in 1929 and is headquartered in Sapporo, Japan.",
    "website": "http://www.tsuruha-hd.co.jp",
    "zipcode": "065-0024"
  },
  "3417.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Ohki Healthcare Holdings Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "OHKI HEALTHCARE HOLDINGS CO LTD",
    "state": null,
    "summary": "Ohki Healthcare Holdings Co.,Ltd. distributes pharmaceutical products, health foods, dairy products, cosmetics, and daily necessities. The company imports, exports, and sells pharmaceuticals, quasi-drugs, medical equipment, cosmetics, poisons and deleterious substances, drugs, reagents, measuring instruments, optical instruments, electrical products, communication equipment, veterinary drugs, veterinary medical equipment, pet supplies, feed, feed additives, textile products, sanitary products, beauty and health equipment, sports equipment, leisure goods, nursing goods, nursing convenience goods, toys, stationery, homes supplies, daily necessities, groceries, food additives, alcoholic beverages, rice grains, salt, and cigarettes. It also provides chemicals, fertilizers, pesticides, gardening supplies, and agricultural supplies, as well as engages in the warehousing, information processing systems, distribution system equipment, and software development activities. In addition, the company engages in the pharmacy/drug store management and dispensing service, and nursing service businesses; manufacture and sale of pharmaceuticals, quasi-drugs, cosmetics, health foods, killing agents, medical and sanitary products, soft drinks, medical skin care, health food, and miscellaneous goods. Further, it is involved in the manufacture and wholesale of environmental conservation products; and wholesale of food and contact products, cosmetics, and miscellaneous goods, as well as license application agency business. The company was founded in 1658 and is headquartered in Tokyo, Japan.",
    "website": "http://www.ohki-net.co.jp",
    "zipcode": "112-0013"
  },
  "3544.T": {
    "city": "Sapporo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Satudora Holdings Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "SATUDORA HOLDINGS CO LTD",
    "state": null,
    "summary": "Satudora Holdings Co., Ltd. primarily operates drug stores under the Drugstore and Satsudra names in Japan. The company also operates realistic shops under the seatsudra name; and dispensing pharmacies. In addition, it develops, wholesales, imports, and exports goods, as well as purchases and sells daily goods, consumables, and miscellaneous goods. Further, the company is involved in the energy business. It serves individuals, stores, and corporations. The company operates seven dispensing pharmacies with drugstore. Satudora Holdings Co.,Ltd. was founded in 1972 and is headquartered in Sapporo, Japan.",
    "website": "http://satudora-hd.co.jp",
    "zipcode": "8003"
  },
  "3549.T": {
    "city": "Hakusan",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Kusuri No Aoki Holdings Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "KUSURI NO AOKI HOLDINGS CO LTD",
    "state": null,
    "summary": "Kusuri No Aoki Holdings Co., Ltd. engages in retailing and dispensing pharmaceuticals, cosmetics, and daily necessities in Japan. The company was founded in 1999 and is headquartered in Hakusan, Japan.",
    "website": "http://www.kusuri-aoki-hd.co.jp",
    "zipcode": "924-8510"
  },
  "4931.T": {
    "city": "Fukuoka City",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Shinnihonseiyaku Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "SHINNIHONSEIYAKU CO LTD",
    "state": null,
    "summary": "Shinnihonseiyaku Co., Ltd. provides cosmetics, pharmaceuticals, and health foods in Japan and internationally. It operates through Mail Order, Direct Store Sales/Wholesale, and Overseas Sales segments. The company provides skincare products under the Perfect One brand; and pharmaceutical products for various diseases and symptoms. It operates a network of 12 stores; and online shops. The company was formerly known as Shinnihonliving Co., Ltd. and changed its name to Shinnihonseiyaku Co., Ltd. in April 2002. Shinnihonseiyaku Co., Ltd. was founded in 1992 and is headquartered in Fukuoka City, Japan.",
    "website": "http://www.corporate.shinnihonseiyaku.co.jp/",
    "zipcode": "810-0074"
  },
  "4HN.F": {
    "city": "Yokohama",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pharmaceutical Retailers",
    "long_name": "cocokara fine Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "COCOKARA FINE INC.",
    "state": null,
    "summary": "cocokara fine Inc., through its subsidiaries, engages in the drugstore and pharmacy operations in Japan. It also provides nursing and at-home care services; and operates assisted living facilities. In addition, the company is involved in the retail of health and beauty care products; promotion of employment of people with disabilities; sale and leasing of nursing care equipment and remodel homes; and logistics and online shopping businesses. It operates approximately 1,300 stores. cocokara fine Inc. was founded in 2008 and is headquartered in Yokohama, Japan.",
    "website": "http://corp.cocokarafine.co.jp",
    "zipcode": "222-0033"
  },
  "7649.T": {
    "city": "Obu",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Sugi Holdings Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "SUGI HOLDINGS CO.LTD.",
    "state": null,
    "summary": "Sugi Holdings Co.,Ltd. operates drugstores in Japan. It also provides visiting nursing services and home care support services. As of June 1, 2019, the company operated 1,190 stores. Sugi Holdings Co.,Ltd. was founded in 1976 and is headquartered in Obu, Japan.",
    "website": "http://www.drug-sugi.co.jp/hd/index.html",
    "zipcode": "474-0011"
  },
  "7679.T": {
    "city": "Shiwa",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pharmaceutical Retailers",
    "long_name": "YAKUODO HOLDINGS Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "YAKUODO HLDGS CO LTD",
    "state": null,
    "summary": "YAKUODO HOLDINGS Co., Ltd., through its subsidiaries, engages in the management of drug stores and dispensing pharmacies in Japan. It operates 297 stores. The company was founded in 1978 and is headquartered in Shiwa, Japan.",
    "website": "http://www.yakuodo-hd.co.jp",
    "zipcode": "028-3621"
  },
  "8095.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Astena Holdings Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "ASTENA HOLDINGS CO LTD",
    "state": null,
    "summary": "Astena Holdings Co.,Ltd. manufactures and sells medicine-related products in Japan. The company's Fine Chemical division manufactures and sells active pharmaceutical ingredients and medical supplies for antipyretic, analgesic, anti-inflammatory, and vasoconstrictor areas. Its Medical division is involved in the biotechnology related business, such as the provision of drug development support services; and sale of medical equipment. The company's Health & Beauty Care, and Food division engages in the sale of over-the-counter drugs, food product materials, functional food product materials, and cosmetic ingredients; mail/Internet-ordered sales business; and OEM production of cosmetics. Its Industrial Chemicals division manufactures and sells surface finishing chemicals and other chemical products, such as products for PWBs, electronic devices, general platings, and semiconductors. The company was formerly known as Iwaki & Co., Ltd. and changed its name to Astena Holdings Co.,Ltd. in June 2021. Astena Holdings Co.,Ltd. was founded in 1914 and is headquartered in Tokyo, Japan.",
    "website": "http://www.astena-hd.com",
    "zipcode": "103-8403"
  },
  "9267.T": {
    "city": "Sakai",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Genky DrugStores Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "GENKY DRUGSTORES CO LTD",
    "state": null,
    "summary": "Genky DrugStores Co., Ltd. operates a chain of drug stores in Japan. The company was founded in 1988 and is headquartered in Sakai, Japan.",
    "website": "http://www.genkydrugstores.co.jp",
    "zipcode": "910-0332"
  },
  "9776.T": {
    "city": "Sapporo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Sapporo Clinical Laboratory Inc.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "SAPPORO CLINICAL LABORATORIES",
    "state": null,
    "summary": "Sapporo Clinical Laboratory Inc. operates dispensing pharmacies in Japan. The company offers laboratory testing, pathological examination, and holter inspection services. It also provides food hygiene environmental inspection, including food/processed product, facility hygiene, and food handler inspection services; and radiation management services. In addition, the company develops, sells, and maintains software, such as SCAN clinical testing systems; and offers support services for opening new clinics. Further, it provides HiWeb21 inspection result inquiry services. Sapporo Clinical Laboratory Inc. was founded in 1965 and is headquartered in Sapporo, Japan.",
    "website": "http://www.saturin.co.jp",
    "zipcode": "060-0005"
  },
  "9989.T": {
    "city": "Fuchu",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Sundrug Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "SUNDRUG CO LTD",
    "state": null,
    "summary": "Sundrug Co.,Ltd. operates and manages drug stores and dispensing pharmacies in Japan. It also operates discount stores that offers food, cosmetics, home appliances, clothing, car supplies, sports and goods, alcoholic beverages, and pharmaceutical products, as well as fresh food, kerosene, etc. The company was founded in 1957 and is headquartered in Fuchu, Japan.",
    "website": "http://www.sundrug.co.jp",
    "zipcode": "183-0005"
  },
  "SDGCF": {
    "city": "Fuchu",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Sundrug Co.,Ltd.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "SUNDRUG CO LTD",
    "state": null,
    "summary": "Sundrug Co.,Ltd. operates and manages drug stores and dispensing pharmacies in Japan. It also operates discount stores that offers food, cosmetics, home appliances, clothing, car supplies, sports and goods, alcoholic beverages, and pharmaceutical products, as well as fresh food, kerosene, etc. The company was founded in 1957 and is headquartered in Fuchu, Japan.",
    "website": "http://www.sundrug.co.jp",
    "zipcode": "183-0005"
  },
  "SGIPF": {
    "city": "Obu",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Sugi Holdings Co.,Ltd.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "SUGI HOLDINGS CO.LTD.",
    "state": null,
    "summary": "Sugi Holdings Co.,Ltd. operates drugstores in Japan. It also provides visiting nursing services and home care support services. As of June 1, 2019, the company operated 1,190 stores. Sugi Holdings Co.,Ltd. was founded in 1976 and is headquartered in Obu, Japan.",
    "website": "http://www.drug-sugi.co.jp/hd/index.html",
    "zipcode": "474-0011"
  },
  "TSUSF": {
    "city": "Sapporo",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Tsuruha Holdings Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "TSURUHA HOLDINGS INC",
    "state": null,
    "summary": "Tsuruha Holdings Inc. operates drugstores in Japan. Its drugstores offer medicines and supplements, as well as health, beauty, and diet goods. The company operates approximately 1,600 stores. It also sells products through mail order and online shops. The company was founded in 1929 and is headquartered in Sapporo, Japan.",
    "website": "http://www.tsuruha-hd.co.jp",
    "zipcode": "065-0024"
  },
  "UGI.F": {
    "city": "Obu",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Sugi Holdings Co.,Ltd.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "SUGI HOLDINGS CO. LTD.",
    "state": null,
    "summary": "Sugi Holdings Co.,Ltd. operates drugstores in Japan. It also provides visiting nursing services and home care support services. As of June 1, 2019, the company operated 1,190 stores. Sugi Holdings Co.,Ltd. was founded in 1976 and is headquartered in Obu, Japan.",
    "website": "http://www.drug-sugi.co.jp/hd/index.html",
    "zipcode": "474-0011"
  }
}
