{"1EC.F": {"short_name": "VENATOR MATERIALS DL-,001", "long_name": "Venator Materials PLC", "summary": "Venator Materials PLC manufactures and markets chemical products worldwide. It operates through two segments, Titanium Dioxide and Performance Additives. The Titanium Dioxide segment offers titanium dioxide (TiO2), such as rutile, anatase, and nano TiO2 products for use in coatings, plastics, paper, printing inks, fibers, and food and personal care products. The Performance Additives segment provides barium and zinc additives for use in coatings, films, pharmaceuticals, and paper and glass fiber reinforced plastics; colored inorganic pigments comprising iron oxides, ultramarines, specialty inorganics chemicals, and driers for construction, coating, plastic, and specialty markets; wood protection chemicals for use in residential and commercial applications; and water treatment chemicals for the municipal and industrial waste water treatment markets, as well as for the paper industry. Venator Materials PLC was founded in 2017 and is headquartered in Stockton-On-Tees, the United Kingdom.", "currency": "EUR", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Stockton-On-Tees"}, "1OY.SG": {"short_name": "VICTREX PLC Registered Shares L", "long_name": "Victrex plc", "summary": "Victrex plc, through its subsidiaries, manufactures and sells polymers worldwide. It offers PEEK and PAEK polymer materials; and specialist solutions for medical device manufacturers. It serves automotive, aerospace, energy, manufacturing and engineering, electronics, and medical markets. The company was incorporated in 1993 and is headquartered in Thornton Cleveleys, the United Kingdom.", "currency": "EUR", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "STU", "market": "dr_market", "country": "United Kingdom", "city": "Thornton-Cleveleys"}, "48P.F": {"short_name": "SCAPA GRP PLC  LS-,05", "long_name": "Scapa Group plc", "summary": "Scapa Group plc, together with its subsidiaries, manufactures and sells bonding products and adhesive components for applications in the healthcare and industrial markets in Europe, North America, and Asia. The company offers wound dressings and topical skin care solutions; first aid and personal care products; skin adhesives and medical-grade substrates; and customize adhesive formulations for various applications. It also provides adhesive systems for automotive wire harness systems; cable tapes and jointing components for applications in power, sub-sea, control, data, and fiber optic cables; self-adhesive tape solutions for the building and construction market; specialty products, such as technical adhesive tapes, and films and foams; and consumer tapes. In addition, the company offers PVC tapes under the Barnier brand name, polyethylene tapes under the Polyflex name, and hockey tapes under the Renfrew brand name. Scapa Group plc was founded in 1927 and is headquartered in Ashton-Under-Lyne, the United Kingdom.", "currency": "EUR", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Ashton-Under-Lyne"}, "6CMB.F": {"short_name": "CRODA INTL  LS -,10609756", "long_name": "Croda International Plc", "summary": "Croda International Plc creates, makes, and sells specialty chemicals in Europe, the Middle East, Africa, North America, Asia, and Latin America. The company operates in four segments: Personal Care, Life Sciences, Performance Technologies, and Industrial Chemicals. It offers adhesives; crop protection additives and adjuvants, seed enhancement and animal health chemicals, chemical bio-stimulants, and specialty additives for agricultural films; and lubricant additives, coatings and polymers, vehicle cleaning chemicals, and products for automotive textiles and fibers, as well as specialty additives for plastics, and battery and catalyst industries. The company also provides specialty ingredients for self-tanning, color cosmetics, bath and shower, deodorants, anti-perspirants, depilatories, men's grooming, and oral hygiene, as well as skin, hair, sun, body, and baby care applications; construction chemicals and bitumen additives; dietary supplements; and advanced materials, and polymer additives for electronics and devices. In addition, it provides chemistries, emulsifiers, fuel and power generation additives, and polymer additives; food additives; specialty polymer additives for furniture and wood applications; household, industrial, and institutional cleaning products; lubricants; oleochemicals; and packaging, print, and paper chemicals. Further, it provides paints and coatings; active pharmaceutical ingredients; thermal management products; plastic and rubber products for food packaging, carrier bags and toys, car bumpers, mobile phones, and home appliances; skin health products; hygiene and industrial nonwovens, botanical extracts, tissues, and textile auxiliaries; and water treatment chemicals. Additionally, the company offers bio-based phase change materials for buildings and ventilation, clothing and healthcare, electronics and devices, food and refrigeration, energy storage and recovery, temperature controlled packaging, and vehicles and automotive applications. Croda International Plc was founded in 1925 and is based in Goole, the United Kingdom.", "currency": "EUR", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Goole"}, "6HG.F": {"short_name": "HAYDALE GRAPH.INDUS.LS-02", "long_name": "Haydale Graphene Industries plc", "summary": "Haydale Graphene Industries plc, through its subsidiaries, functionalizes graphene and other nanomaterials in the United Kingdom, Europe, the United States, China, Thailand, South Korea, Japan, and internationally. It operates through Resins, Polymers, Composites & Inks; and Advanced Materials segments. The company offers composites; elastomers; graphene and silver-based complex fluids for radio frequency identification market; piezo resistive nanomaterial enhanced inks graphene-based sensor systems; flexible electronics; and test strips for self-diagnostic biomedical sensor device. It also provides silicon carbide whiskers for ceramic cutting tools, technical ceramics, protective coatings, ceramic and metal matrix coatings, fiber reinforced plastics, and plant cell transformation applications, as well as consulting services. The company was formerly known as Innovative Carbon Limited and changed its name to Haydale Graphene Industries PLC in March 2014. Haydale Graphene Industries PLC was incorporated in 2010 and is headquartered in Ammanford, the United Kingdom.", "currency": "EUR", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Ammanford"}, "7YC.F": {"short_name": "SYNTHOMER  LS -,10", "long_name": "Synthomer plc", "summary": "Synthomer plc operates as a speciality chemicals company in the United Kingdom, Germany, Italy, the Netherlands, France, Belgium, Malaysia, China, the United States, rest of Europe, rest of Asia, and internationally. It operates through three segments: Performance Elastomers, Functional Solutions, and Industrial Specialities. The company offers pressure-sensitive adhesives, acrylic polymers, acrylic dispersions, and other adhesives; latices for foamed bedding products and footwear; and binders for carpet applications. It also provides latices for medical and examination gloves applications; nitrile latex, which enhances the performance of industrial and fabric-supported gloves; and latices for medical devices, condoms, and balloons. In addition, the company offers binders, vinyl acetate copolymer dispersions, solvent-borne resins, and other products for various coatings applications; and synthetic binders for graphic, packaging, and specialty paper coating applications. Further, it provides compounds and aqueous curing pastes for carpets and other applications; coalescing agents for enhancing the properties of coatings; and acrylic monomers for enhancing the performance characteristics of polymer formulations. Additionally, the company offers liquid polybutadienes, polyvinyl alcohol suspending agents, polyvinyl acetates, thermosetting resins, butyl ethyl propanediol, and inorganic materials for various industrial applications; and specialty polymers, binders, and polymers for construction applications. It also provides impregnation binders, polymer dispersions, styrene butadiene copolymers, acrylic and styrene acrylic dispersions, coatings, and butadiene-based binders for textiles applications. The company was formerly known as Yule Catto & Co. plc and changed its name to Synthomer plc in 2012. Synthomer plc was founded in 1863 and is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "APGMF": {"short_name": "APPLIED GRAPHENE MATERIALS PLC", "long_name": "Applied Graphene Materials plc", "summary": "Applied Graphene Materials plc produces and sells graphene products primarily in the United Kingdom. It offers graphene nanoplatelets; and graphene powder in a range of polymer matrices, including thermoset and thermoplastic, as well as adhesives, elastomers, oils, and aqueous and non-aqueous solutions. The company provides its products for use in advanced composites and polymers; thermal management solutions; coatings; barriers and impermeable films; functional fluids, such as oils and lubricants; display materials and packaging; capacitors and batteries; and inks and 3D printed materials. Applied Graphene Materials plc was founded in 2010 and is based in Redcar, the United Kingdom.", "currency": "USD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Redcar"}, "COIHF": {"short_name": "CRODA INTERNATIONAL", "long_name": "Croda International Plc", "summary": "Croda International Plc creates, makes, and sells specialty chemicals in Europe, the Middle East, Africa, North America, Asia, and Latin America. The company operates in four segments: Personal Care, Life Sciences, Performance Technologies, and Industrial Chemicals. It offers adhesives; crop protection additives and adjuvants, seed enhancement and animal health chemicals, chemical bio-stimulants, and specialty additives for agricultural films; and lubricant additives, coatings and polymers, vehicle cleaning chemicals, and products for automotive textiles and fibers, as well as specialty additives for plastics, and battery and catalyst industries. The company also provides specialty ingredients for self-tanning, color cosmetics, bath and shower, deodorants, anti-perspirants, depilatories, men's grooming, and oral hygiene, as well as skin, hair, sun, body, and baby care applications; construction chemicals and bitumen additives; dietary supplements; and advanced materials, and polymer additives for electronics and devices. In addition, it provides chemistries, emulsifiers, fuel and power generation additives, and polymer additives; food additives; specialty polymer additives for furniture and wood applications; household, industrial, and institutional cleaning products; lubricants; oleochemicals; and packaging, print, and paper chemicals. Further, it provides paints and coatings; active pharmaceutical ingredients; thermal management products; plastic and rubber products for food packaging, carrier bags and toys, car bumpers, mobile phones, and home appliances; skin health products; hygiene and industrial nonwovens, botanical extracts, tissues, and textile auxiliaries; and water treatment chemicals. Additionally, the company offers bio-based phase change materials for buildings and ventilation, clothing and healthcare, electronics and devices, food and refrigeration, energy storage and recovery, temperature controlled packaging, and vehicles and automotive applications. Croda International Plc was founded in 1925 and is based in Goole, the United Kingdom.", "currency": "USD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Goole"}, "COIHY": {"short_name": "CRODA INTERNATIONAL", "long_name": "Croda International Plc", "summary": "Croda International Plc creates, makes, and sells specialty chemicals in Europe, the Middle East, Africa, North America, Asia, and Latin America. The company operates in four segments: Personal Care, Life Sciences, Performance Technologies, and Industrial Chemicals. It offers adhesives; crop protection additives and adjuvants, seed enhancement and animal health chemicals, chemical bio-stimulants, and specialty additives for agricultural films; and lubricant additives, coatings and polymers, vehicle cleaning chemicals, and products for automotive textiles and fibers, as well as specialty additives for plastics, and battery and catalyst industries. The company also provides specialty ingredients for self-tanning, color cosmetics, bath and shower, deodorants, anti-perspirants, depilatories, men's grooming, and oral hygiene, as well as skin, hair, sun, body, and baby care applications; construction chemicals and bitumen additives; dietary supplements; and advanced materials, and polymer additives for electronics and devices. In addition, it provides chemistries, emulsifiers, fuel and power generation additives, and polymer additives; food additives; specialty polymer additives for furniture and wood applications; household, industrial, and institutional cleaning products; lubricants; oleochemicals; and packaging, print, and paper chemicals. Further, it provides paints and coatings; active pharmaceutical ingredients; thermal management products; plastic and rubber products for food packaging, carrier bags and toys, car bumpers, mobile phones, and home appliances; skin health products; hygiene and industrial nonwovens, botanical extracts, tissues, and textile auxiliaries; and water treatment chemicals. Additionally, the company offers bio-based phase change materials for buildings and ventilation, clothing and healthcare, electronics and devices, food and refrigeration, energy storage and recovery, temperature controlled packaging, and vehicles and automotive applications. Croda International Plc was founded in 1925 and is based in Goole, the United Kingdom.", "currency": "USD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Goole"}, "CRDA.L": {"short_name": "CRODA INTERNATIONAL PLC ORD 10.", "long_name": "Croda International Plc", "summary": "Croda International Plc creates, makes, and sells specialty chemicals in Europe, the Middle East, Africa, North America, Asia, and Latin America. The company operates in four segments: Personal Care, Life Sciences, Performance Technologies, and Industrial Chemicals. It offers adhesives; crop protection additives and adjuvants, seed enhancement and animal health chemicals, chemical bio-stimulants, and specialty additives for agricultural films; and lubricant additives, coatings and polymers, vehicle cleaning chemicals, and products for automotive textiles and fibers, as well as specialty additives for plastics, and battery and catalyst industries. The company also provides specialty ingredients for self-tanning, color cosmetics, bath and shower, deodorants, anti-perspirants, depilatories, men's grooming, and oral hygiene, as well as skin, hair, sun, body, and baby care applications; construction chemicals and bitumen additives; dietary supplements; and advanced materials, and polymer additives for electronics and devices. In addition, it provides chemistries, emulsifiers, fuel and power generation additives, and polymer additives; food additives; specialty polymer additives for furniture and wood applications; household, industrial, and institutional cleaning products; lubricants; oleochemicals; and packaging, print, and paper chemicals. Further, it provides paints and coatings; active pharmaceutical ingredients; thermal management products; plastic and rubber products for food packaging, carrier bags and toys, car bumpers, mobile phones, and home appliances; skin health products; hygiene and industrial nonwovens, botanical extracts, tissues, and textile auxiliaries; and water treatment chemicals. Additionally, the company offers bio-based phase change materials for buildings and ventilation, clothing and healthcare, electronics and devices, food and refrigeration, energy storage and recovery, temperature controlled packaging, and vehicles and automotive applications. Croda International Plc was founded in 1925 and is based in Goole, the United Kingdom.", "currency": "GBp", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Goole"}, "ELMTY": {"short_name": "ELEMENTIS", "long_name": "Elementis plc", "summary": "Elementis plc operates as a specialty chemical company in North America, Europe, and internationally. It operates through five segments: Personal Care, Coatings, Talc, Chromium, and Energy. The Personal Care segment produces rheological modifiers and compounded products for antiperspirants/deodorants, bath and soap, color cosmetics, and hair and skin care products. The Coatings segment produces rheological modifiers and additives for industrial finishes, architectural coatings, construction, adhesives and sealants, inks, colorant dispersions, and specialty applications. The Talc segment produces and supplies talc for use in plastics, paints and coatings, food and pharmaceuticals, ceramics, polyester putties, paper, and pulp sectors. The Chromium segment produces chromium chemicals, such as chromic oxide, chromic acid, chrome sulfate, sodium dichromate, and sodium sulfate for use in pigments, cosmetics, refractories, chrome metal production, metal and plastic finishing, wood treatment, leather tanning, trivalent metal finishing, coatings, and metal passivation, as well as for making detergents, glasses, papers, and starches. The Energy segment produces rheological modifiers and additives for oil and gas drilling, lubrication, and stimulation activities. It also offers personal care products, waxes, additives and resins, organoclays, colourants, and other specialty additives. Elementis plc was founded in 1844 and is headquartered in London, the United Kingdom.", "currency": "USD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "EMNSF": {"short_name": "ELEMENTIS", "long_name": "Elementis plc", "summary": "Elementis plc operates as a specialty chemical company in North America, Europe, and internationally. It operates through five segments: Personal Care, Coatings, Talc, Chromium, and Energy. The Personal Care segment produces rheological modifiers and compounded products for antiperspirants/deodorants, bath and soap, color cosmetics, and hair and skin care products. The Coatings segment produces rheological modifiers and additives for industrial finishes, architectural coatings, construction, adhesives and sealants, inks, colorant dispersions, and specialty applications. The Talc segment produces and supplies talc for use in plastics, paints and coatings, food and pharmaceuticals, ceramics, polyester putties, paper, and pulp sectors. The Chromium segment produces chromium chemicals, such as chromic oxide, chromic acid, chrome sulfate, sodium dichromate, and sodium sulfate for use in pigments, cosmetics, refractories, chrome metal production, metal and plastic finishing, wood treatment, leather tanning, trivalent metal finishing, coatings, and metal passivation, as well as for making detergents, glasses, papers, and starches. The Energy segment produces rheological modifiers and additives for oil and gas drilling, lubrication, and stimulation activities. It also offers personal care products, waxes, additives and resins, organoclays, colourants, and other specialty additives. Elementis plc was founded in 1844 and is headquartered in London, the United Kingdom.", "currency": "USD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "ESNT.L": {"short_name": "ESSENTRA PLC ORD 25P", "long_name": "Essentra plc", "summary": "Essentra plc provides essential components and solutions worldwide. It operates through three divisions: Components, Packaging, and Filters. The Components division manufactures and distributes plastic injection molded, vinyl dip-molded, and metal items for equipment manufacturing, automotive, fabrication, electronics, and construction industries; and component solutions comprising caps and plugs, wire and cable management products, flange protection products, knobs, handles and grips, PCB and electronics hardware, and tools and precision instruments for a range of applications and industries that are used in protection and finish products. The Packaging division provides cartons, leaflets, self-adhesive labels, and printed foils for use in blister packs; and packaging and authentication solutions to the health and personal care sectors. The Filter division offers filters and packaging solutions to the roll your own segments; analytical laboratory services for ingredient measurement; and e-cigarette and heat not burn solutions for next generation products. Essentra plc is also involved in treasury, property, services, and leasing businesses. The company was formerly known as Filtrona plc and changed its name to Essentra plc in June 2013. Essentra plc was incorporated in 2005 and is headquartered in Milton Keynes, the United Kingdom.", "currency": "GBp", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Milton Keynes"}, "FLRAF": {"short_name": "ESSENTRA PLC", "long_name": "Essentra plc", "summary": "Essentra plc provides essential components and solutions worldwide. It operates through three divisions: Components, Packaging, and Filters. The Components division manufactures and distributes plastic injection molded, vinyl dip-molded, and metal items for equipment manufacturing, automotive, fabrication, electronics, and construction industries; and component solutions comprising caps and plugs, wire and cable management products, flange protection products, knobs, handles and grips, PCB and electronics hardware, and tools and precision instruments for a range of applications and industries that are used in protection and finish products. The Packaging division provides cartons, leaflets, self-adhesive labels, and printed foils for use in blister packs; and packaging and authentication solutions to the health and personal care sectors. The Filter division offers filters and packaging solutions to the roll your own segments; analytical laboratory services for ingredient measurement; and e-cigarette and heat not burn solutions for next generation products. Essentra plc is also involved in treasury, property, services, and leasing businesses. The company was formerly known as Filtrona plc and changed its name to Essentra plc in June 2013. Essentra plc was incorporated in 2005 and is headquartered in Milton Keynes, the United Kingdom.", "currency": "USD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Milton Keynes"}, "HAYD.L": {"short_name": "HAYDALE GRAPHENE INDUSTRIES PLC", "long_name": "Haydale Graphene Industries plc", "summary": "Haydale Graphene Industries plc, through its subsidiaries, functionalizes graphene and other nanomaterials in the United Kingdom, Europe, the United States, China, Thailand, South Korea, Japan, and internationally. It operates through Resins, Polymers, Composites & Inks; and Advanced Materials segments. The company offers composites; elastomers; graphene and silver-based complex fluids for radio frequency identification market; piezo resistive nanomaterial enhanced inks graphene-based sensor systems; flexible electronics; and test strips for self-diagnostic biomedical sensor device. It also provides silicon carbide whiskers for ceramic cutting tools, technical ceramics, protective coatings, ceramic and metal matrix coatings, fiber reinforced plastics, and plant cell transformation applications, as well as consulting services. The company was formerly known as Innovative Carbon Limited and changed its name to Haydale Graphene Industries PLC in March 2014. Haydale Graphene Industries PLC was incorporated in 2010 and is headquartered in Ammanford, the United Kingdom.", "currency": "GBp", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Ammanford"}, "HDD.L": {"short_name": "HARDIDE PLC ORD 4P", "long_name": "Hardide plc", "summary": "Hardide plc manufactures and sells tungsten carbide-based coatings for external and internal surfaces in the United Kingdom, Europe, North America, and internationally. The company offers custom coatings; and base material coatings for various steel and alloy materials, as well as coatings for seals. It provides its products for use in various industries and applications, including oil and gas, aerospace, valves, pumps, industrial diamond, power generation, motorsport, material processing, industrial tooling, and blades. The company was founded in 2000 and is headquartered in Bicester, the United Kingdom.", "currency": "GBp", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Bicester"}, "HDGHF": {"short_name": "HAYDALE GRAPHENE INDUSTRIES PLC", "long_name": "Haydale Graphene Industries plc", "summary": "Haydale Graphene Industries plc, through its subsidiaries, functionalizes graphene and other nanomaterials in the United Kingdom, Europe, the United States, China, Thailand, South Korea, Japan, and internationally. It operates through Resins, Polymers, Composites & Inks; and Advanced Materials segments. The company offers composites; elastomers; graphene and silver-based complex fluids for radio frequency identification market; piezo resistive nanomaterial enhanced inks graphene-based sensor systems; flexible electronics; and test strips for self-diagnostic biomedical sensor device. It also provides silicon carbide whiskers for ceramic cutting tools, technical ceramics, protective coatings, ceramic and metal matrix coatings, fiber reinforced plastics, and plant cell transformation applications, as well as consulting services. The company was formerly known as Innovative Carbon Limited and changed its name to Haydale Graphene Industries PLC in March 2014. Haydale Graphene Industries PLC was incorporated in 2010 and is headquartered in Ammanford, the United Kingdom.", "currency": "USD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Ammanford"}, "IF7.F": {"short_name": "IOFINA PLC  LS -,01", "long_name": "Iofina plc", "summary": "Iofina plc engages in the exploration and production of iodine, iodine specialty chemical derivatives, produced water, and natural gas in the United States and the United Kingdom. It offers halogen chemicals, disinfectants, electronic specialty gases, sanitizers, heat stabilizers, preservatives, and specialty intermediates, as well as animal health, mineral separation, and odor control products for use in electronics/semiconductor, pharmaceutical, food and beverage, personal care, paints and coatings, dairy, chemical intermediates, gemological, fish and wildlife, and nylon markets. The company also provides turnkey mid-stream fee based solutions to third party brine stream operators to extract iodine. Iofina plc was founded in 2005 and is based in London, the United Kingdom.", "currency": "EUR", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "IOF.L": {"short_name": "IOFINA PLC ORD 1P", "long_name": "Iofina plc", "summary": "Iofina plc engages in the exploration and production of iodine, iodine specialty chemical derivatives, produced water, and natural gas in the United States and the United Kingdom. It offers halogen chemicals, disinfectants, electronic specialty gases, sanitizers, heat stabilizers, preservatives, and specialty intermediates, as well as animal health, mineral separation, and odor control products for use in electronics/semiconductor, pharmaceutical, food and beverage, personal care, paints and coatings, dairy, chemical intermediates, gemological, fish and wildlife, and nylon markets. The company also provides turnkey mid-stream fee based solutions to third party brine stream operators to extract iodine. Iofina plc was founded in 2005 and is based in London, the United Kingdom.", "currency": "GBp", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "IOFNF": {"short_name": "IOFINA PLC", "long_name": "Iofina plc", "summary": "Iofina plc engages in the exploration and production of iodine, iodine specialty chemical derivatives, produced water, and natural gas in the United States and the United Kingdom. It offers halogen chemicals, disinfectants, electronic specialty gases, sanitizers, heat stabilizers, preservatives, and specialty intermediates, as well as animal health, mineral separation, and odor control products for use in electronics/semiconductor, pharmaceutical, food and beverage, personal care, paints and coatings, dairy, chemical intermediates, gemological, fish and wildlife, and nylon markets. The company also provides turnkey mid-stream fee based solutions to third party brine stream operators to extract iodine. Iofina plc was founded in 2005 and is based in London, the United Kingdom.", "currency": "USD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "JMAT.L": {"short_name": "JOHNSON MATTHEY PLC ORD 110 49/", "long_name": "Johnson Matthey Plc", "summary": "Johnson Matthey Plc provides specialty chemicals in the United States, Germany, rest of Europe, the United States, rest of North America, China, rest of Asia, and internationally. It operates through four segments: Clean Air, Efficient Natural Resources, Health, and New Markets. The Clean Air segment provides catalysts for gasoline and diesel light duty vehicles; and catalyst systems for diesel powered trucks, buses, non-road machinery, and stationary equipment. This segment serves car companies, heavy duty truck and engine manufacturers, Chinese producers, and others. The Efficient Natural Resources segment manufactures specialty catalysts and additives, as well as licenses process technology and delivers services to the oil and gas industry; refines, recycles, fabricates, and distributes platinum group metals (pgms); precious metals and enamels; and diagnostic services for the oil and gas industry. This segment serves chemical, oil, and gas companies; engineering contractors; industrial pgm users; end of life autocatalyst collectors; and automotive industry suppliers. The Health segment develops and manufactures active pharmaceutical ingredients (API) for various treatments; provides solutions for generic and innovator companies; and operates in the outsourced small molecule API market. The New Markets segment offers battery materials, battery systems, and fuel cell technologies; science and technology to develop the products for devices used in medical procedures; and catalysts to pharmaceutical and agricultural chemicals markets. This segment serves automotive and heavy duty vehicle companies; lithium ion cell manufacturers; fuel cell manufacturers; cordless tool and transport manufacturers; medical device companies; and pharmaceutical, fine chemical, and agrochemical companies. The company was formerly known as Johnson & Cock and changed its name to Johnson Matthey Plc in 1851. Johnson Matthey Plc was founded in 1817 and is based in London, the United Kingdom.", "currency": "GBp", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "JMPLF": {"short_name": "JOHNSON MATTHEY", "long_name": "Johnson Matthey Plc", "summary": "Johnson Matthey Plc provides specialty chemicals in the United States, Germany, rest of Europe, the United States, rest of North America, China, rest of Asia, and internationally. It operates through four segments: Clean Air, Efficient Natural Resources, Health, and New Markets. The Clean Air segment provides catalysts for gasoline and diesel light duty vehicles; and catalyst systems for diesel powered trucks, buses, non-road machinery, and stationary equipment. This segment serves car companies, heavy duty truck and engine manufacturers, Chinese producers, and others. The Efficient Natural Resources segment manufactures specialty catalysts and additives, as well as licenses process technology and delivers services to the oil and gas industry; refines, recycles, fabricates, and distributes platinum group metals (pgms); precious metals and enamels; and diagnostic services for the oil and gas industry. This segment serves chemical, oil, and gas companies; engineering contractors; industrial pgm users; end of life autocatalyst collectors; and automotive industry suppliers. The Health segment develops and manufactures active pharmaceutical ingredients (API) for various treatments; provides solutions for generic and innovator companies; and operates in the outsourced small molecule API market. The New Markets segment offers battery materials, battery systems, and fuel cell technologies; science and technology to develop the products for devices used in medical procedures; and catalysts to pharmaceutical and agricultural chemicals markets. This segment serves automotive and heavy duty vehicle companies; lithium ion cell manufacturers; fuel cell manufacturers; cordless tool and transport manufacturers; medical device companies; and pharmaceutical, fine chemical, and agrochemical companies. The company was formerly known as Johnson & Cock and changed its name to Johnson Matthey Plc in 1851. Johnson Matthey Plc was founded in 1817 and is based in London, the United Kingdom.", "currency": "USD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "JMPLY": {"short_name": "JOHNSON MATTHEY", "long_name": "Johnson Matthey Plc", "summary": "Johnson Matthey Plc provides specialty chemicals in the United States, Germany, rest of Europe, the United States, rest of North America, China, rest of Asia, and internationally. It operates through four segments: Clean Air, Efficient Natural Resources, Health, and New Markets. The Clean Air segment provides catalysts for gasoline and diesel light duty vehicles; and catalyst systems for diesel powered trucks, buses, non-road machinery, and stationary equipment. This segment serves car companies, heavy duty truck and engine manufacturers, Chinese producers, and others. The Efficient Natural Resources segment manufactures specialty catalysts and additives, as well as licenses process technology and delivers services to the oil and gas industry; refines, recycles, fabricates, and distributes platinum group metals (pgms); precious metals and enamels; and diagnostic services for the oil and gas industry. This segment serves chemical, oil, and gas companies; engineering contractors; industrial pgm users; end of life autocatalyst collectors; and automotive industry suppliers. The Health segment develops and manufactures active pharmaceutical ingredients (API) for various treatments; provides solutions for generic and innovator companies; and operates in the outsourced small molecule API market. The New Markets segment offers battery materials, battery systems, and fuel cell technologies; science and technology to develop the products for devices used in medical procedures; and catalysts to pharmaceutical and agricultural chemicals markets. This segment serves automotive and heavy duty vehicle companies; lithium ion cell manufacturers; fuel cell manufacturers; cordless tool and transport manufacturers; medical device companies; and pharmaceutical, fine chemical, and agrochemical companies. The company was formerly known as Johnson & Cock and changed its name to Johnson Matthey Plc in 1851. Johnson Matthey Plc was founded in 1817 and is based in London, the United Kingdom.", "currency": "USD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "LIN": {"short_name": "Linde plc", "long_name": "Linde plc", "summary": "Linde plc operates as an industrial gas company in North and South America, Europe, the Middle East, Africa, and the Asia Pacific. The company offers oxygen, nitrogen, argon, rare gases, carbon monoxide, carbon dioxide, helium, hydrogen, electronic gases, specialty gases, and acetylene. It also designs and constructs turnkey process plants, such as olefin, natural gas, air separation, and hydrogen and synthesis gas plants. The company serves healthcare, petroleum refining, manufacturing, food, beverage carbonation, fiber-optics, steel making, aerospace, chemicals, and water treatment industries. Linde plc was founded in 1879 and is based in Guildford, the United Kingdom.", "currency": "USD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "NYQ", "market": "us_market", "country": "United Kingdom", "city": "Guildford"}, "LINI.VI": {"short_name": "LINDE PLC", "long_name": "Linde plc", "summary": "Linde plc operates as an industrial gas company in North and South America, Europe, the Middle East, Africa, and the Asia Pacific. The company offers oxygen, nitrogen, argon, rare gases, carbon monoxide, carbon dioxide, helium, hydrogen, electronic gases, specialty gases, and acetylene. It also designs and constructs turnkey process plants, such as olefin, natural gas, air separation, and hydrogen and synthesis gas plants. The company serves healthcare, petroleum refining, manufacturing, food, beverage carbonation, fiber-optics, steel making, aerospace, chemicals, and water treatment industries. Linde plc was founded in 1879 and is based in Guildford, the United Kingdom.", "currency": "EUR", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "VIE", "market": "at_market", "country": "United Kingdom", "city": "Guildford"}, "MACP.L": {"short_name": "MARWYN ACQUISITION COMPANY PLC ", "long_name": "Marwyn Acquisition Company Plc", "summary": "Marwyn Acquisition Company Plc does not have significant operations. It intends to acquire assets in the industrials, manufacturing, engineering, construction, building products, or support services sectors. The company was founded in 2017 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "SCPA.L": {"short_name": "SCAPA GROUP PLC ORD 5P", "long_name": "Scapa Group plc", "summary": "Scapa Group plc, together with its subsidiaries, manufactures and sells bonding products and adhesive components for applications in the healthcare and industrial markets in Europe, North America, and Asia. The company offers wound dressings and topical skin care solutions; first aid and personal care products; skin adhesives and medical-grade substrates; and customize adhesive formulations for various applications. It also provides adhesive systems for automotive wire harness systems; cable tapes and jointing components for applications in power, sub-sea, control, data, and fiber optic cables; self-adhesive tape solutions for the building and construction market; specialty products, such as technical adhesive tapes, and films and foams; and consumer tapes. In addition, the company offers PVC tapes under the Barnier brand name, polyethylene tapes under the Polyflex name, and hockey tapes under the Renfrew brand name. Scapa Group plc was founded in 1927 and is headquartered in Ashton-Under-Lyne, the United Kingdom.", "currency": "GBp", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Ashton-Under-Lyne"}, "SXGAF": {"short_name": "SCAPA GROUP", "long_name": "Scapa Group plc", "summary": "Scapa Group plc, together with its subsidiaries, manufactures and sells bonding products and adhesive components for applications in the healthcare and industrial markets in Europe, North America, and Asia. The company offers wound dressings and topical skin care solutions; first aid and personal care products; skin adhesives and medical-grade substrates; and customize adhesive formulations for various applications. It also provides adhesive systems for automotive wire harness systems; cable tapes and jointing components for applications in power, sub-sea, control, data, and fiber optic cables; self-adhesive tape solutions for the building and construction market; specialty products, such as technical adhesive tapes, and films and foams; and consumer tapes. In addition, the company offers PVC tapes under the Barnier brand name, polyethylene tapes under the Polyflex name, and hockey tapes under the Renfrew brand name. Scapa Group plc was founded in 1927 and is headquartered in Ashton-Under-Lyne, the United Kingdom.", "currency": "USD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Ashton-Under-Lyne"}, "SYNT.L": {"short_name": "SYNTHOMER PLC ORD 10P", "long_name": "Synthomer plc", "summary": "Synthomer plc operates as a speciality chemicals company in the United Kingdom, Germany, Italy, the Netherlands, France, Belgium, Malaysia, China, the United States, rest of Europe, rest of Asia, and internationally. It operates through three segments: Performance Elastomers, Functional Solutions, and Industrial Specialities. The company offers pressure-sensitive adhesives, acrylic polymers, acrylic dispersions, and other adhesives; latices for foamed bedding products and footwear; and binders for carpet applications. It also provides latices for medical and examination gloves applications; nitrile latex, which enhances the performance of industrial and fabric-supported gloves; and latices for medical devices, condoms, and balloons. In addition, the company offers binders, vinyl acetate copolymer dispersions, solvent-borne resins, and other products for various coatings applications; and synthetic binders for graphic, packaging, and specialty paper coating applications. Further, it provides compounds and aqueous curing pastes for carpets and other applications; coalescing agents for enhancing the properties of coatings; and acrylic monomers for enhancing the performance characteristics of polymer formulations. Additionally, the company offers liquid polybutadienes, polyvinyl alcohol suspending agents, polyvinyl acetates, thermosetting resins, butyl ethyl propanediol, and inorganic materials for various industrial applications; and specialty polymers, binders, and polymers for construction applications. It also provides impregnation binders, polymer dispersions, styrene butadiene copolymers, acrylic and styrene acrylic dispersions, coatings, and butadiene-based binders for textiles applications. The company was formerly known as Yule Catto & Co. plc and changed its name to Synthomer plc in 2012. Synthomer plc was founded in 1863 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "TET.L": {"short_name": "TREATT PLC ORD 2P", "long_name": "Treatt plc", "summary": "Treatt plc manufactures and supplies various natural extracts and ingredients to the flavor, fragrance, beverage, and consumer product industries in the United Kingdom, Germany, Ireland, the United States, China, and internationally. It offers flavor ingredients, such as citrus, coffee, tea, health and wellness, and fruits and vegetables extracts; aroma, natural, and high impact chemicals; and herb, spice, and floral ingredients. The company also provides ingredient applications for beverage and household products; and fragrance ingredients, such as blends and ingredients. The company was founded in 1886 and is headquartered in Bury St. Edmunds, the United Kingdom.", "currency": "GBp", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Bury Saint Edmunds"}, "VCT.L": {"short_name": "VICTREX PLC ORD 1P", "long_name": "Victrex plc", "summary": "Victrex plc, through its subsidiaries, manufactures and sells polymers worldwide. It offers PEEK and PAEK polymer materials; and specialist solutions for medical device manufacturers. It serves automotive, aerospace, energy, manufacturing and engineering, electronics, and medical markets. The company was incorporated in 1993 and is headquartered in Thornton Cleveleys, the United Kingdom.", "currency": "GBp", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Thornton-Cleveleys"}, "VNTR": {"short_name": "Venator Materials PLC", "long_name": "Venator Materials PLC", "summary": "Venator Materials PLC manufactures and markets chemical products worldwide. It operates through two segments, Titanium Dioxide and Performance Additives. The Titanium Dioxide segment offers titanium dioxide (TiO2), such as rutile, anatase, and nano TiO2 products for use in coatings, plastics, paper, printing inks, fibers, and food and personal care products. The Performance Additives segment provides barium and zinc additives for use in coatings, films, pharmaceuticals, and paper and glass fiber reinforced plastics; colored inorganic pigments comprising iron oxides, ultramarines, specialty inorganics chemicals, and driers for construction, coating, plastic, and specialty markets; wood protection chemicals for use in residential and commercial applications; and water treatment chemicals for the municipal and industrial waste water treatment markets, as well as for the paper industry. Venator Materials PLC was founded in 2017 and is headquartered in Stockton-On-Tees, the United Kingdom.", "currency": "USD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "NYQ", "market": "us_market", "country": "United Kingdom", "city": "Stockton-On-Tees"}, "VRS.L": {"short_name": "VERSARIEN PLC ORD 1P", "long_name": "Versarien plc", "summary": "Versarien plc, an engineering materials company, provides engineering solutions for various industry sectors in the United Kingdom, rest of Europe, North America, and internationally. The company operates in two segments, Graphene and Plastic Products, and Hard Wear and Metallic Products. The Graphene and Plastic Products segment offers graphene products, such as Nanene, a few-layer graphene; Polygrene, a graphene enhanced polymer; Hexotene, a few-layer hexagonal boron nitride nano-platelet powder; and graphene-based nanomaterials for energy storage devices, as well as a range of electrically conductive graphene inks for various printing processes, substrates, and applications under the Graphinks name. The Hard Wear and Metallic Products segment provides graphene enhanced plastic products, including graphene enhanced mobile accessories, injection molding products, tool boxes, transit trays, PU foam tanks, and vacuum forming products. This segment also offers sintered tungsten carbide products comprising special inserts and blanks, cutting knives, wear-resistant parts, nozzles and valve inserts for flow control, and defense and aerospace tungsten carbide parts for use in arduous environmental applications; and micro-porous metals for the thermal management industry, as well as supplies extruded aluminum products, such as aluminum industrial products and aluminum heat sinks. It also manufactures, sells, and supplies antibacterial and anti-viral masks; and hospital beds and cot mattress panels, as well as visors. The company was founded in 2010 and is headquartered in Cheltenham, the United Kingdom.", "currency": "GBp", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Cheltenham"}, "VRSRF": {"short_name": "VERSARIEN PLC", "long_name": "Versarien plc", "summary": "Versarien plc, an engineering materials company, provides engineering solutions for various industry sectors in the United Kingdom, rest of Europe, North America, and internationally. The company operates in two segments, Graphene and Plastic Products, and Hard Wear and Metallic Products. The Graphene and Plastic Products segment offers graphene products, such as Nanene, a few-layer graphene; Polygrene, a graphene enhanced polymer; Hexotene, a few-layer hexagonal boron nitride nano-platelet powder; and graphene-based nanomaterials for energy storage devices, as well as a range of electrically conductive graphene inks for various printing processes, substrates, and applications under the Graphinks name. The Hard Wear and Metallic Products segment provides graphene enhanced plastic products, including graphene enhanced mobile accessories, injection molding products, tool boxes, transit trays, PU foam tanks, and vacuum forming products. This segment also offers sintered tungsten carbide products comprising special inserts and blanks, cutting knives, wear-resistant parts, nozzles and valve inserts for flow control, and defense and aerospace tungsten carbide parts for use in arduous environmental applications; and micro-porous metals for the thermal management industry, as well as supplies extruded aluminum products, such as aluminum industrial products and aluminum heat sinks. It also manufactures, sells, and supplies antibacterial and anti-viral masks; and hospital beds and cot mattress panels, as well as visors. The company was founded in 2010 and is headquartered in Cheltenham, the United Kingdom.", "currency": "USD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Cheltenham"}, "VTXPF": {"short_name": "VICTREX", "long_name": "Victrex plc", "summary": "Victrex plc, through its subsidiaries, manufactures and sells polymers worldwide. It offers PEEK and PAEK polymer materials; and specialist solutions for medical device manufacturers. It serves automotive, aerospace, energy, manufacturing and engineering, electronics, and medical markets. The company was incorporated in 1993 and is headquartered in Thornton Cleveleys, the United Kingdom.", "currency": "USD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Thornton-Cleveleys"}}