{
    "1128.HK": {
        "short_name": "WYNN MACAU",
        "long_name": "Wynn Macau, Limited",
        "summary": "Wynn Macau, Limited, together with its subsidiaries, develops, owns, and operates the Wynn Palace and Wynn Macau casino resorts in Macau. The company's Wynn Palace resort features approximately 424,000 square feet of casino space providing 24-hour gaming and various games comprising private gaming salons and sky casinos; a luxury hotel with a total of 1,706 guest rooms, suites, and villas; and 14 food and beverage outlets. Its Wynn Palace resort also consists of approximately 107,000 square feet of retail shopping; 37,000 square feet of meeting and convention space; recreation and leisure facilities consisting of a cable car ride, health club, spa, salon, and pool; and public entertainment attractions, including a lake, animated floral art displays, and fine art displays. In addition, the company's Wynn Macau resort features approximately 252,000 square feet of casino space offering 24-hour gaming and various games, including private gaming salons, sky casinos, and a poker pit; two hotel towers with 1,010 rooms and suites; 12 food and beverage outlets; and recreation and leisure facilities, such as two health clubs and spas, a salon, and a pool. Further, its Wynn Macau resort includes approximately 59,000 square feet of retail shopping and 31,000 square feet of meeting and convention space. The company was incorporated in 2009 and is headquartered in Macau. Wynn Macau, Limited is a subsidiary of Wynn Resorts, Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Macau",
        "state": null,
        "city": "Macau",
        "zipcode": null,
        "website": "http://www.wynnmacaulimited.com",
        "market_cap": 69762146304
    },
    "1183.HK": {
        "short_name": "MECOM POWER",
        "long_name": "MECOM Power and Construction Limited",
        "summary": "MECOM Power and Construction Limited, an investment holding company, operates as an integrated construction engineering contractor in Macau. The company operates through three segments: Construction and Fitting Out Works; High Voltage Power Substation Construction and Its System Installation Works; and Facilities Management Services. It provides steel structure erection services, including structural steelworks, concreting and builder works, and combination of various other services; civil engineering construction services, such as demolition, ground field investigation, site formation, and foundation works, as well as substructures and superstructures, roads, and drainage works; and fitting out and renovation works comprising alteration, renovation, and upgrading works. The company also undertakes high voltage power substation construction and its system installation works, including planning, scheduling, project management, and construction of customized high voltage substations and power transmission infrastructure with installation of high voltage power systems. In addition, it offers facilities operation and maintenance management, alteration, upgrading, maintenance works, and emergency repair of various buildings, properties, and their components, as well as high voltage power substations and related systems. The company was founded in 2000 and is headquartered in Macau. MECOM Power and Construction Limited is a subsidiary of MECOM Holding Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Macau",
        "state": null,
        "city": "Macau",
        "zipcode": null,
        "website": "http://www.mecommacau.com",
        "market_cap": 4552714240
    },
    "1408.HK": {
        "short_name": "MACAU E&M",
        "long_name": "Macau E&M Holding Limited",
        "summary": "Macau E&M Holding Limited, an investment holding company, offers electrical and mechanical engineering contract works in Macau. The company supplies and installs LV systems, such as cables, earthing, lighting systems, power cables, electrical wiring, switchboards, power outlets, and other related electrical equipment for power supply and distribution in a building; and HVAC systems, including variable refrigerant volume units, and ventilation and exhaust air systems for buildings, as well as related pipes, ducts, air-conditioning units, ventilation fans, and other related equipment. It also procures and installs ELV systems comprising telephones, CCTVs, and other systems in a building that require a transmission signal; and offers related testing and commissioning works. The company was founded in 2011 and is headquartered in Macau.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Macau",
        "state": null,
        "city": "Macau",
        "zipcode": null,
        "website": "http://www.macauem.com",
        "market_cap": 190000000
    },
    "1615.HK": {
        "short_name": "AB BUILDERS",
        "long_name": "AB Builders Group Limited",
        "summary": "AB Builders Group Limited, an investment holding company, provides structural and fitting-out works services in Macau. It also offers building construction and engineering services in Hong Kong. The company was founded in 1998 and is headquartered in Macau.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Macau",
        "state": null,
        "city": "Macau",
        "zipcode": null,
        "website": "http://www.abbuildersgroup.com",
        "market_cap": 138000000
    },
    "1680.HK": {
        "short_name": "MACAU LEGEND",
        "long_name": "Macau Legend Development Limited",
        "summary": "Macau Legend Development Limited, an investment holding company, owns entertainment and casino gaming facilities in Macau. The company operates through Gaming and Non-Gaming segments. Its properties include Macau Fisherman's Wharf, a waterfront integrated gaming, hotel, convention, and entertainment complex located on the outer harbor of the Macau Peninsula; and Savan Legend Resorts Hotel, an integrated resort, which engages in casino and hotel business in Lao People's Democratic Republic. The company also provides gaming services in the Legend Palace Casino, Babylon Casino, and Landmark Casino; and gaming related general management services. In addition, it offers building management, food and beverage, and other services; and retails clothing, footwear, and accessories. The company was incorporated in 2006 and is headquartered in Macau, Macau.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Macau",
        "state": null,
        "city": "Macau",
        "zipcode": null,
        "website": "http://www.macaulegend.com",
        "market_cap": 6511248896
    },
    "1722.HK": {
        "short_name": "KIN PANG HLDGS",
        "long_name": "Kin Pang Holdings Limited",
        "summary": "Kin Pang Holdings Limited, an investment holding company, engages in the civil engineering business in Macau and Hong Kong. It operates through Building and Ancillary Services, and Emergency Repair Services segments. The Building and Ancillary Services segment is involved in the foundation associated works, hard landscaping, alteration and addition works, road works, water pipe works, electrical and mechanical works, and other ancillary building works. The Emergency Repair Services segment provides repair services for infrastructure of electricity and water supply on a term contract basis. The company also engages in the management of machineries. The company was founded in 2006 and is headquartered in Macau. Kin Pang Holdings Limited is a subsidiary of Fortunate Year Investments Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Macau",
        "state": null,
        "city": "Macau",
        "zipcode": null,
        "website": "http://www.kinpang.com.mo",
        "market_cap": 114000000
    },
    "2296.HK": {
        "short_name": "HUARCHI GLOBAL",
        "long_name": "Huarchi Global Group Holdings Limited",
        "summary": "Huarchi Global Group Holdings Limited operates as a fitting-out contracting company in Macau. It offers fitting-out services to new and existing buildings; construction works, including foundation works, and buildings services systems installation; structural calculation and shop drawing, procurement of materials, site supervision, management of subcontractors, and project management services; and repair and maintenance services, including repair or replacement of interior decorative parts, and installation of CCTV and air-conditioning systems. The company was founded in 2003 and is headquartered in Macau. Huarchi Global Group Holdings Limited is a subsidiary Seong Wa Holdings Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Macau",
        "state": null,
        "city": "Macau",
        "zipcode": null,
        "website": "http://www.huarchi.com",
        "market_cap": 2580000000
    },
    "8033.HK": {
        "short_name": "VODATEL NETWORK",
        "long_name": "Vodatel Networks Holdings Limited",
        "summary": "Vodatel Networks Holdings Limited, an investment holding company, primarily engages in the design, sale, and implementation of network and systems infrastructure in Mainland China, Hong Kong, and Macau. It offers customer data automation, customization and integration, and technical support services; and IT, networks, and surveillance solutions for the public sectors, as well as the telecommunications, gaming, and hospitality sectors. The company also engages in the research and development of software solutions, and provision of related software consultancy services; and provision of wireless data communications and Internet related products and services. In addition, it offers computer software, hardware, and system integration services; and network management systems. Further, the company provides cyber security, cloud security, and Internet of Things security solutions; cloud data center automation solutions; multi-cloud solutions for smart city; and comprehensive enterprise solutions. Additionally, the company sells data networking systems and provides related engineering services; and provides warehouse services. Vodatel Networks Holdings Limited is headquartered in Taipa, Macau.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Macau",
        "state": null,
        "city": "Taipa",
        "zipcode": null,
        "website": "http://www.vodatelsys.com",
        "market_cap": 109983872
    },
    "DSWL": {
        "short_name": "Deswell Industries, Inc.",
        "long_name": "Deswell Industries, Inc.",
        "summary": "Deswell Industries, Inc. manufactures and sells injection-molded plastic parts and components, electronic products and subassemblies, and metallic molds and accessory parts for original equipment manufacturers and contract manufacturers. It operates in two segments, Plastic Injection Molding and Electronic Products Assembling. The company produces a range of plastic parts and components that are used in the manufacture of consumer and industrial products, which include plastic components for electronic entertainment products, power tools, accessories, and outdoor equipment; cases for flashlights, telephones, paging machines, projectors, and alarm clocks; toner cartridges and cases for photocopy and printer machines; and parts for electrical products, such as air-conditioning and ventilators, as well as parts for audio equipment, and cases and key tops for personal organizers and remote controls; double injection caps and baby products; parts for medical products comprising apparatus for blood tests; laser key caps; and automobile components. It also provides electronic products that consist of audio equipment, including digital and analogue mixing consoles, amplifiers, signal processors, audio interfaces, network audio equipment, and speaker enclosures; consumer audio products, such as multi-channel receivers-amplifiers, and wired and wireless audio streaming products; printed circuit board assemblies; and telecommunication products comprising VoIP keysets for business communications. The company sells its products primarily in China, the United States, the United Kingdom, Norway, Holland, Hong Kong, and Canada. Deswell Industries, Inc. was founded in 1987 and is based in Macau.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Macau",
        "state": null,
        "city": "Macau",
        "zipcode": null,
        "website": "http://www.deswell.com",
        "market_cap": 73209920
    },
    "DW2.F": {
        "short_name": "DESWELL INDS INC.  DL-,01",
        "long_name": "Deswell Industries, Inc.",
        "summary": "Deswell Industries, Inc. manufactures and sells injection-molded plastic parts and components, electronic products and subassemblies, and metallic molds and accessory parts for original equipment manufacturers and contract manufacturers. It operates in two segments, Plastic Injection Molding and Electronic Products Assembling. The company produces a range of plastic parts and components that are used in the manufacture of consumer and industrial products, which include plastic components for electronic entertainment products, power tools, accessories, and outdoor equipment; cases for flashlights, telephones, paging machines, projectors, and alarm clocks; toner cartridges and cases for photocopy and printer machines; and parts for electrical products, such as air-conditioning and ventilators, as well as parts for audio equipment, and cases and key tops for personal organizers and remote controls; double injection caps and baby products; parts for medical products comprising apparatus for blood tests; laser key caps; and automobile components. It also provides electronic products that consist of audio equipment, including digital and analogue mixing consoles, amplifiers, signal processors, audio interfaces, network audio equipment, and speaker enclosures; consumer audio products, such as multi-channel receivers-amplifiers, and wired and wireless audio streaming products; printed circuit board assemblies; and telecommunication products comprising VoIP keysets for business communications. The company sells its products primarily in China, the United States, the United Kingdom, Norway, Holland, Hong Kong, and Canada. Deswell Industries, Inc. was founded in 1987 and is based in Macau.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Macau",
        "state": null,
        "city": "Macau",
        "zipcode": null,
        "website": "http://www.deswell.com",
        "market_cap": 56458476
    },
    "GWIN": {
        "short_name": "GLORYWIN ENTERTAINMENT GROUP IN",
        "long_name": "Glorywin Entertainment Group, Inc.",
        "summary": "Glorywin Entertainment Group, Inc. engages in the manufacture and supply of wood pellets in Malaysia. The company is based in Macau.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Gambling",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Macau",
        "state": null,
        "city": "Macau",
        "zipcode": null,
        "website": null,
        "market_cap": 51068632
    },
    "LINUF": {
        "short_name": "LINIU TECHNOLOGY GROUP",
        "long_name": "LiNiu Technology Group",
        "summary": "LiNiu Technology Group, through its subsidiaries, engages in gaming related business. The company operates one VIP gaming room in one casino in Macau; and two casinos in Australia that are primarily focused on VIP baccarat. It also offers the LiNiu Network, a business to customer, customer to customer, and online to offline electronic trading platform focused on the Chinese agricultural industry. LiNiu Technology Group has a strategic cooperation agreement with The Peoples Insurance Company of China Limited's Guangzhou branch to develop insurance products for farmers, rural residents, and the agricultural industry. The company was formerly known as Iao Kun Group Holding Company Limited and changed its name to LiNiu Technology Group in April 2017. LiNiu Technology Group is based in Macau, Macau.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Macau",
        "state": null,
        "city": "Macau",
        "zipcode": null,
        "website": "http://ir.liniuyang.com",
        "market_cap": 99791
    },
    "M04.F": {
        "short_name": "MGM CHINA HLDGS LTD  HD 1",
        "long_name": "MGM China Holdings Limited",
        "summary": "MGM China Holdings Limited, an investment holding company, engages in the development, ownership, and operation of gaming and lodging resorts in the Greater China region. The company develops and operates casino games of chance and other casino games, and related hotel and resort facilities, as well as provides hotel management services; and develops integrated resorts in Macau. It owns and operates MGM Macau, an integrated resort that includes a casino with 638 slot machines and 279 gaming tables; a hotel with 582 hotel rooms, suites, and villas; and amenities, including eight restaurants, retail outlets, pool, and spa facilities, as well as a convention space. The company also owns MGM Cotai, a resort that consists of a casino with 655 slot machines and 273 gaming tables; a hotel with 1,390 hotel rooms, suites, and skylofts; twelve restaurants and bars; retail outlets; and a meeting space, as well as other non-gaming offerings. In addition, MGM China Holdings Limited is involved in the provision of outsourcing services, including information technology, accounting, human resources, hotel reservation, and convention consultation. The company was incorporated in 2010 and is headquartered in Macau. MGM China Holdings Limited is a subsidiary of MGM Resorts International.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Macau",
        "state": null,
        "city": "Macau",
        "zipcode": null,
        "website": "http://www.mgmchinaholdings.com",
        "market_cap": 4831129600
    },
    "MALDF": {
        "short_name": "MACAU LEGEND DEVELOPMENT LIMITE",
        "long_name": "Macau Legend Development Limited",
        "summary": "Macau Legend Development Limited, an investment holding company, owns entertainment and casino gaming facilities in Macau. The company operates through Gaming and Non-Gaming segments. Its properties include Macau Fisherman's Wharf, a waterfront integrated gaming, hotel, convention, and entertainment complex located on the outer harbor of the Macau Peninsula; and Savan Legend Resorts Hotel, an integrated resort, which engages in casino and hotel business in Lao People's Democratic Republic. The company also provides gaming services in the Legend Palace Casino, Babylon Casino, and Landmark Casino; and gaming related general management services. In addition, it offers building management, food and beverage, and other services; and retails clothing, footwear, and accessories. The company was incorporated in 2006 and is headquartered in Macau, Macau.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Macau",
        "state": null,
        "city": "Macau",
        "zipcode": null,
        "website": "http://www.macaulegend.com",
        "market_cap": 732908160
    },
    "MCHVF": {
        "short_name": "MGM CHINA HLDGS LTD",
        "long_name": "MGM China Holdings Limited",
        "summary": "MGM China Holdings Limited, an investment holding company, engages in the development, ownership, and operation of gaming and lodging resorts in the Greater China region. The company develops and operates casino games of chance and other casino games, and related hotel and resort facilities, as well as provides hotel management services; and develops integrated resorts in Macau. It owns and operates MGM Macau, an integrated resort that includes a casino with 638 slot machines and 279 gaming tables; a hotel with 582 hotel rooms, suites, and villas; and amenities, including eight restaurants, retail outlets, pool, and spa facilities, as well as a convention space. The company also owns MGM Cotai, a resort that consists of a casino with 655 slot machines and 273 gaming tables; a hotel with 1,390 hotel rooms, suites, and skylofts; twelve restaurants and bars; retail outlets; and a meeting space, as well as other non-gaming offerings. In addition, MGM China Holdings Limited is involved in the provision of outsourcing services, including information technology, accounting, human resources, hotel reservation, and convention consultation. The company was incorporated in 2010 and is headquartered in Macau. MGM China Holdings Limited is a subsidiary of MGM Resorts International.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Macau",
        "state": null,
        "city": "Macau",
        "zipcode": null,
        "website": "http://www.mgmchinaholdings.com",
        "market_cap": 5818808320
    },
    "MCHVY": {
        "short_name": "MGM CHINA HLDGS LTD",
        "long_name": "MGM China Holdings Limited",
        "summary": "MGM China Holdings Limited, an investment holding company, engages in the development, ownership, and operation of gaming and lodging resorts in the Greater China region. The company develops and operates casino games of chance and other casino games, and related hotel and resort facilities, as well as provides hotel management services; and develops integrated resorts in Macau. It owns and operates MGM Macau, an integrated resort that includes a casino with 638 slot machines and 279 gaming tables; a hotel with 582 hotel rooms, suites, and villas; and amenities, including eight restaurants, retail outlets, pool, and spa facilities, as well as a convention space. The company also owns MGM Cotai, a resort that consists of a casino with 655 slot machines and 273 gaming tables; a hotel with 1,390 hotel rooms, suites, and skylofts; twelve restaurants and bars; retail outlets; and a meeting space, as well as other non-gaming offerings. In addition, MGM China Holdings Limited is involved in the provision of outsourcing services, including information technology, accounting, human resources, hotel reservation, and convention consultation. The company was incorporated in 2010 and is headquartered in Macau. MGM China Holdings Limited is a subsidiary of MGM Resorts International.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Macau",
        "state": null,
        "city": "Macau",
        "zipcode": null,
        "website": "http://www.mgmchinaholdings.com",
        "market_cap": 6194206720
    },
    "SCHYF": {
        "short_name": "SANDS CHINA LTD",
        "long_name": "Sands China Ltd.",
        "summary": "Sands China Ltd., an investment holding company, develops, owns, and operates integrated resorts and casinos in Macao. It owns and operates The Venetian Macao-Resort-Hotel, the Londoner Macao, The Parisian Macao resort, The Plaza Macao, and Sands Macao casino; the Cotai Expo, an convention and exhibition hall; and the Cotai Arena, an entertainment venue, as well as Cotai Water Jet ferry for leisure and business travelers. As of December 31, 2020, the company had 12,005 hotel rooms and suites, 150 restaurants, 2.1 million square feet of retail malls, 1.7 million square feet of MICE space, 4 permanent theatres, a 15,000-seat arena, and casinos. It also offers ferry transportation and leasing services, and pontoon leasing; security services; human resources administration services; mall management services; travel and tourism agency services; customer development services; and procurement, marketing, and administrative services, as well as outsourcing services, including information technology, accounting, hotel management, and marketing. The company was incorporated in 2009 and is headquartered in Taipa, Macau. Sands China Ltd. is a subsidiary of Las Vegas Sands Corp.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Macau",
        "state": null,
        "city": "Taipa",
        "zipcode": null,
        "website": "http://www.sandschina.com",
        "market_cap": 38232637440
    },
    "SCHYY": {
        "short_name": "SANDS CHINA LTD",
        "long_name": "Sands China Ltd.",
        "summary": "Sands China Ltd., an investment holding company, develops, owns, and operates integrated resorts and casinos in Macao. It owns and operates The Venetian Macao-Resort-Hotel, the Londoner Macao, The Parisian Macao resort, The Plaza Macao, and Sands Macao casino; the Cotai Expo, an convention and exhibition hall; and the Cotai Arena, an entertainment venue, as well as Cotai Water Jet ferry for leisure and business travelers. As of December 31, 2020, the company had 12,005 hotel rooms and suites, 150 restaurants, 2.1 million square feet of retail malls, 1.7 million square feet of MICE space, 4 permanent theatres, a 15,000-seat arena, and casinos. It also offers ferry transportation and leasing services, and pontoon leasing; security services; human resources administration services; mall management services; travel and tourism agency services; customer development services; and procurement, marketing, and administrative services, as well as outsourcing services, including information technology, accounting, hotel management, and marketing. The company was incorporated in 2009 and is headquartered in Taipa, Macau. Sands China Ltd. is a subsidiary of Las Vegas Sands Corp.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Macau",
        "state": null,
        "city": "Taipa",
        "zipcode": null,
        "website": "http://www.sandschina.com",
        "market_cap": 38042980352
    },
    "WYNMF": {
        "short_name": "WYNN MACAU LTD",
        "long_name": "Wynn Macau, Limited",
        "summary": "Wynn Macau, Limited, together with its subsidiaries, develops, owns, and operates the Wynn Palace and Wynn Macau casino resorts in Macau. The company's Wynn Palace resort features approximately 424,000 square feet of casino space providing 24-hour gaming and various games comprising private gaming salons and sky casinos; a luxury hotel with a total of 1,706 guest rooms, suites, and villas; and 14 food and beverage outlets. Its Wynn Palace resort also consists of approximately 107,000 square feet of retail shopping; 37,000 square feet of meeting and convention space; recreation and leisure facilities consisting of a cable car ride, health club, spa, salon, and pool; and public entertainment attractions, including a lake, animated floral art displays, and fine art displays. In addition, the company's Wynn Macau resort features approximately 252,000 square feet of casino space offering 24-hour gaming and various games, including private gaming salons, sky casinos, and a poker pit; two hotel towers with 1,010 rooms and suites; 12 food and beverage outlets; and recreation and leisure facilities, such as two health clubs and spas, a salon, and a pool. Further, its Wynn Macau resort includes approximately 59,000 square feet of retail shopping and 31,000 square feet of meeting and convention space. The company was incorporated in 2009 and is headquartered in Macau. Wynn Macau, Limited is a subsidiary of Wynn Resorts, Limited.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Macau",
        "state": null,
        "city": "Macau",
        "zipcode": null,
        "website": "http://www.wynnmacaulimited.com",
        "market_cap": 8758562816
    },
    "WYNMY": {
        "short_name": "WYNN MACAU LTD",
        "long_name": "Wynn Macau, Limited",
        "summary": "Wynn Macau, Limited, together with its subsidiaries, develops, owns, and operates the Wynn Palace and Wynn Macau casino resorts in Macau. The company's Wynn Palace resort features approximately 424,000 square feet of casino space providing 24-hour gaming and various games comprising private gaming salons and sky casinos; a luxury hotel with a total of 1,706 guest rooms, suites, and villas; and 14 food and beverage outlets. Its Wynn Palace resort also consists of approximately 107,000 square feet of retail shopping; 37,000 square feet of meeting and convention space; recreation and leisure facilities consisting of a cable car ride, health club, spa, salon, and pool; and public entertainment attractions, including a lake, animated floral art displays, and fine art displays. In addition, the company's Wynn Macau resort features approximately 252,000 square feet of casino space offering 24-hour gaming and various games, including private gaming salons, sky casinos, and a poker pit; two hotel towers with 1,010 rooms and suites; 12 food and beverage outlets; and recreation and leisure facilities, such as two health clubs and spas, a salon, and a pool. Further, its Wynn Macau resort includes approximately 59,000 square feet of retail shopping and 31,000 square feet of meeting and convention space. The company was incorporated in 2009 and is headquartered in Macau. Wynn Macau, Limited is a subsidiary of Wynn Resorts, Limited.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Macau",
        "state": null,
        "city": "Macau",
        "zipcode": null,
        "website": "http://www.wynnmacaulimited.com",
        "market_cap": 9233125376
    }
}