{
    "1730.HK": {
        "short_name": "LHN",
        "long_name": "LHN Limited",
        "summary": "LHN Limited, an investment holding company, provides real estate management services in Singapore, Hong Kong, Indonesia, Thailand, Cambodia, Myanmar, and internationally. It operates through three segments: Space Optimisation Business, Facilities Management Business, and Logistics Services Business. The company leases and manages industrial spaces, such as industrial buildings, factories, warehouses, and land for open storage; commercial spaces consisting of traditional offices, suited offices, recreational spaces, sports facilities, and children enhanced spaces; and residential spaces. It also offers facilities management services, which include security management services; car park management services; and repair and maintenance, cleaning, landscaping, and amenities and utilities. In addition, the company operates a fleet of prime movers, trailers, oil tankers, ISO tankers, and trucks to handle the transportation of various types of oil, and oil-related and petrochemical products, as well as containers. Further, it provides container depot management services, which include container handling and storage, surveying, cleaning, and repair and maintenance services to shipping lines and container leasing companies. The company also engages in the food and beverage catering business. The company was founded in 1991 and is headquartered in Singapore. LHN Limited is a subsidiary of Fragrance Ltd.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "088702",
        "website": "http://www.lhngroup.com",
        "full_time_employees": 633
    },
    "1H2.SI": {
        "short_name": "$ Olive Tree",
        "long_name": "Olive Tree Estates Limited",
        "summary": "Olive Tree Estates Limited, a real estate company, engages in the property development activities in Singapore. It operates through three segments: Investment, property development, and property rental. The company develops and invests in two light industrial properties in Singapore under the Tagore 8 and One Commonwealth names. It also engages in the property management activities. Olive Tree Estates Limited is based in Singapore. Olive Tree Estates Limited is a subsidiary of Chiu Teng Enterprises Pte Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "049513",
        "website": "http://www.olivetreeestates.com",
        "full_time_employees": 8
    },
    "40V.SI": {
        "short_name": "$ Alset",
        "long_name": "Alset International Limited",
        "summary": "Alset International Limited, an investment holding company, engages in the property development, information technology (IT), biomedical, and investment businesses in Singapore, Australia, the United States, and the People's Republic of China. The company develops property projects and invests in property development projects. It is also involved in the research and development of IT hardware and software; provision of IT-related services to end-users, service providers, and other commercial users through multiple platforms; and e-commerce business. In addition, the company trades in quoted securities, commodities, and other derivatives and financial products; invests in various quoted and unquoted securities, such as investments ranging from pre-initial public offer investment, various forms of capital in companies, and funds with business growth and trade sale; undertakes businesses in incubation and angel investment; and offers corporate strategy and business development advisory services. Further, it develops, researches, tests, manufactures, licenses, and distributes biomedical products. Additionally, the company offers portfolio management and consulting services; and sells and markets mobile applications, as well as distributes health supplements. The company was formerly known as Singapore eDevelopment Limited and changed its name to Alset International Limited in September 2020. The company was incorporated in 2009 and is based in Singapore. Alset International Limited is a subsidiary of Hengfai Business Development Pte. Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "38987",
        "website": "http://www.alsetinternational.com",
        "full_time_employees": null
    },
    "41O.SI": {
        "short_name": "$ LHN",
        "long_name": "LHN Limited",
        "summary": "LHN Limited, an investment holding company, provides real estate management services in Singapore, Hong Kong, Indonesia, Thailand, Cambodia, Myanmar, and internationally. It operates through three segments: Space Optimisation Business, Facilities Management Business, and Logistics Services Business. The company leases and manages industrial spaces, such as industrial buildings, factories, warehouses, and land for open storage; commercial spaces consisting of traditional offices, suited offices, recreational spaces, sports facilities, and children enhanced spaces; and residential spaces. It also offers facilities management services, which include security management services; car park management services; and repair and maintenance, cleaning, landscaping, and amenities and utilities. In addition, the company operates a fleet of prime movers, trailers, oil tankers, ISO tankers, and trucks to handle the transportation of various types of oil, and oil-related and petrochemical products, as well as containers. Further, it provides container depot management services, which include container handling and storage, surveying, cleaning, and repair and maintenance services to shipping lines and container leasing companies. The company also engages in the food and beverage catering business. The company was founded in 1991 and is headquartered in Singapore. LHN Limited is a subsidiary of Fragrance Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "088702",
        "website": "http://www.lhngroup.com",
        "full_time_employees": 633
    },
    "584.SI": {
        "short_name": "$ OEL",
        "long_name": "OEL (Holdings) Limited",
        "summary": "OEL (Holdings) Limited, an investment holding company, engages in the property management business in Singapore. It is also involved in the rental of properties; and ship repairing business. The company was formerly known as Oakwell Engineering Limited and changed its name to OEL (Holdings) Limited in November 2013. OEL (Holdings) Limited was founded in 1984 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "038988",
        "website": "http://www.ohldg.com",
        "full_time_employees": 39
    },
    "5AE.SI": {
        "short_name": "$ Pollux Prop",
        "long_name": "Pollux Properties Ltd.",
        "summary": "Pollux Properties Ltd., an investment holding company, operates as a property developer in Singapore. It operates through Property Development and Property Investment segments. The Property Development segment acquires and develops residential and commercial properties for sale. The Property Investment segment is involved in renting of properties, as well as operating of serviced apartments. The company was formerly known as Shining Corporation Ltd. and changed its name to Pollux Properties Ltd. in June 2010. Pollux Properties Ltd. was incorporated in 1999 and is based in Singapore. Pollux Properties Ltd. is a subsidiary of Pollux Holdings Pte. Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "169639",
        "website": "http://pollux.com.sg",
        "full_time_employees": null
    },
    "5DM.SI": {
        "short_name": "Ying Li Intl",
        "long_name": "Ying Li International Real Estate Limited",
        "summary": "Ying Li International Real Estate Limited, an investment holding company, engages in the development, sale, rental, management, and ownership of commercial and residential properties in Singapore, Hong Kong, and the People's Republic of China. It operates through Property Development and Property Investment segments. The company primarily develops office space, retail mall, car park, and other projects. It is also involved in the provision of property consulting, selling, marketing, management, and leasing services, as well as corporate management consultancy services; and purchase of construction material and equipment. The company was founded in 1993 and is headquartered in Singapore. Ying Li International Real Estate Limited is a subsidiary of State Alpha Limited.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "38986",
        "website": "http://www.yingligj.com",
        "full_time_employees": null
    },
    "5F4.SI": {
        "short_name": "$ Figtree",
        "long_name": "Figtree Holdings Limited",
        "summary": "Figtree Holdings Limited, an investment holding company, designs and builds commercial and industrial facilities in Singapore and China. It operates through Design and Build, and Property Development segments. The company also constructs, develops, sells, and/or leases residential, commercial, and industrial properties; and provides design, project and construction management, and consulting services, as well as general building engineering services. In addition, it undertakes A&A works on existing buildings; and engages in the refurbishment and upgrading of existing buildings. Figtree Holdings Limited was incorporated in 2013 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "159351",
        "website": "http://www.figtreeasia.com",
        "full_time_employees": null
    },
    "5H0.SI": {
        "short_name": "SingHaiyi",
        "long_name": "SingHaiyi Group Ltd.",
        "summary": "SingHaiyi Group Ltd., an investment holding company, develops, owns, and manages real estate properties in Singapore, Malaysia, Australia, and the United States. It operates through Property Development; and Property and Property Related Investment segments. The company develops and sells residential properties; owns and manages residential, commercial, retail, and other properties; and leases Tri-County Mall. It also provides property development advisory services. The company was formerly known as SingXpress Land Ltd. and changed its name to SingHaiyi Group Ltd. in March 2013. SingHaiyi Group Ltd. was incorporated in 1988 and is headquartered in Singapore. SingHaiyi Group Ltd. is a subsidiary of Haiyi Holdings Pte Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068809",
        "website": "http://www.singhaiyi.com",
        "full_time_employees": null
    },
    "5JK.SI": {
        "short_name": "Hiap Hoe",
        "long_name": "Hiap Hoe Limited",
        "summary": "Hiap Hoe Limited, an investment holding company, operates as a real estate company that develops a portfolio of hospitality, retail, commercial, and residential assets in Australia, Singapore, and the United Kingdom. It develops luxury and mid-tier residential, and hotel-cum-commercial properties. It operates through Development Properties, Rental, Leisure, Hotel Operations, and Trading Investments segments. The Development Properties segment acquires land/property and develops them into residential/industrial/commercial properties for sale. The Rental segment engages in the business of renting space under the investment properties, as well as plant and equipment. The Leisure segment provides leisure and recreational facilities, including bowling, billiard, and amusement centers under the SuperBowl brand. The Hotel Operations segment operates hotels under the brand names of Ramada Singapore, Days Hotel Singapore, Holiday Inn Express Trafford City, Four Points by Sheraton Melbourne, and Aloft Perth. The Trading Investments segment trades in a portfolio of quoted and unquoted investments. The company is also involved in the provision of civil engineering, general road construction, and sub-contractor works. Hiap Hoe Limited was incorporated in 1994 and is based in Singapore. Hiap Hoe Limited is a subsidiary of Hiap Hoe Holdings Pte Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "329983",
        "website": "http://www.hiaphoe.com",
        "full_time_employees": null
    },
    "5PC.SI": {
        "short_name": "Goodland",
        "long_name": "Goodland Group Limited",
        "summary": "Goodland Group Limited, an investment holding company, develops real estate properties in Singapore and Malaysia. The company operates through Property Development, Construction, Property Investment, and Other segments. It develops and sells properties; constructs residential and commercial properties; and invests in properties and shares. The company also operates as a general building contractor. Goodland Group Limited was founded in 1993 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "537069",
        "website": "http://www.goodlandgroup.com.sg",
        "full_time_employees": null
    },
    "5RF.SI": {
        "short_name": "$ Mercurius",
        "long_name": "Mercurius Capital Investment Limited",
        "summary": "Mercurius Capital Investment Limited, an investment holding company, engages in the development and investment of properties in Malaysia. It is involved in the real estate-related investments; property-related activities; holding of investments in residential, hospitality, commercial, industrial, and mix development properties; and trading of properties. The company is based in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "68809",
        "website": "http://www.mercuriuscapital.com",
        "full_time_employees": null
    },
    "5UA.SI": {
        "short_name": "$ Luminor",
        "long_name": "Luminor Financial Holdings Limited",
        "summary": "Luminor Financial Holdings Limited, an investment holding company, engages principally in the development of integrated residential and commercial properties in the People's Republic of China and Singapore. It operates through Property Development, Property Management, and Rental segments. The company develops residential, commercial, and other properties; provides property management, and other services; and leases properties held for sale. Its property development and management activities include site selection, land acquisition, project conceptualization, construction, sale, completion, and after-sale services. The company is also involved in the wholesale, import, and export of chemical products, office furniture, and clothing; provision of consultancy services on the enterprise management and business information; and sale of construction materials, decoration materials, and low voltage electronic apparatus. The company was formerly known as Starland Holdings Limited and changed its name to Luminor Financial Holdings Limited in April 2021. The company was founded in 2008 and is based in Singapore. Luminor Financial Holdings Limited is a subsidiary of GRP Chongqing Land Pte Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "049319",
        "website": "http://www.starland.cc",
        "full_time_employees": null
    },
    "5UX.SI": {
        "short_name": "Oxley",
        "long_name": "Oxley Holdings Limited",
        "summary": "Oxley Holdings Limited, an investment holding company, invests in and develops properties. The company operates through Property Development, Property Investment, Hotel, and Construction segments. It develops residential, commercial, industrial, and hospitality projects. The company also leases properties; owns and operates hotels; invests in securities; and constructs commercial and residential properties. It operates in Singapore, the United Kingdom, Ireland, Cambodia, Malaysia, and Australia. Oxley Holdings Limited was incorporated in 2010 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068906",
        "website": "http://www.oxley.com.sg",
        "full_time_employees": null
    },
    "5WF.SI": {
        "short_name": "$ ISOTeam",
        "long_name": "ISOTeam Ltd.",
        "summary": "ISOTeam Ltd. operates in the building maintenance and estate upgrading industry in Singapore. The company operates through Repair and Redecoration; Addition and Alteration; Coatings and Paintings; and Others segments. It offers waterproofing and reroofing, improvement works, and routine maintenance services, as well as repainting, repair, and redecoration services; neighborhood renewal, hawker centers upgrading, estate upgrading, home improvement, and electrical load upgrading services; and interior design and fitting out, designing and building, home retrofit and fit-out, and property maintenance and enhancement services. The company also provides thermal insulating plasters, anti-slip floor coatings, green label intumescent fire proofing coatings, composite timber decking, renewable energy installation, and cockroaches and odor remover services; vertical gardens, horticultural, maintenance, floating wetlands, niche landscaping, and gardening and landscaping maintenance services; home care and upgrading, and general repairs and maintenance services; home painting services; and architectural and engineering solutions, including commercial addition and alteration works, building services, engineering works, architectural and commercial interior construction solutions, and advanced building technologies. In addition, it offers eco-friendly, architectural and protective, fireproofing, and industrial coating, as well as new build painting services; and electrical and mechanical ventilation works, air conditioning works, sanitary and plumbing, solar panel installation, and energy performance contract services. Further, the company leases boom, scissor, personnel, and forklifts, as well as telehandlers; and provides bike sharing services through a mobile app. It primarily serves town councils, government bodies, and private sector building owners. ISOTeam Ltd. was founded in 1998 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "498829",
        "website": "http://isoteam.com.sg",
        "full_time_employees": 366
    },
    "8OX1.SG": {
        "short_name": "Oxley Holdings Ltd. Registered ",
        "long_name": "Oxley Holdings Limited",
        "summary": "Oxley Holdings Limited, an investment holding company, invests in and develops properties. The company operates through Property Development, Property Investment, Hotel, and Construction segments. It develops residential, commercial, industrial, and hospitality projects. The company also leases properties; owns and operates hotels; invests in securities; and constructs commercial and residential properties. It operates in Singapore, the United Kingdom, Ireland, Cambodia, Malaysia, and Australia. Oxley Holdings Limited was incorporated in 2010 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068906",
        "website": "http://www.oxley.com.sg",
        "full_time_employees": null
    },
    "A17U.SI": {
        "short_name": "Ascendas Reit",
        "long_name": "Ascendas Real Estate Investment Trust",
        "summary": "Ascendas Real Estate Investment Trust (Ascendas Reit) is Singapore's first and largest listed business space and industrial real estate investment trust. It was listed on the Singapore Exchange Securities Trading Limited (SGX-ST) in November 2002. As at 31 December 2020, Ascendas Reit's investment properties under management stood at S$13.7 billion. The portfolio comprises 200 properties across the developed markets of Singapore, Australia, the United Kingdom and the United States. Ascendas Reit's portfolio includes business and science parks, suburban office properties, high-specifications industrial properties, light industrial properties, logistics and distribution centres, and integrated developments, amenities and retail properties. These properties house a tenant base of more than 1,450 international and local companies from a wide range of industries and activities, including research and development, life sciences, information technology, engineering, light manufacturing, logistics service providers, electronics, telecommunications, manufacturing services and back-room office support in service industries. Major tenants include Singtel, Stripe, DSO National Laboratories, Pinterest, DBS, CareFusion, Wesfarmers, Citibank and JPMorgan. Ascendas Reit is listed in several indices. These include the FTSE Straits Times Index, the Morgan Stanley Capital International, Inc (MSCI) Index, the European Public Real Estate Association/National Association of Real Estate Investment Trusts (EPRA/NAREIT) Global Real Estate Index and Global Property Research (GPR) Asia 250. Ascendas Reit has an issuer rating of Â\u0091A3' by Moody's Investors Service. Ascendas Reit is managed by Ascendas Funds Management (S) Limited, a wholly owned subsidiary of Singapore-listed CapitaLand Limited, one of Asia's largest diversified real estate groups.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068912",
        "website": "http://www.ascendas-reit.com",
        "full_time_employees": null
    },
    "A26.SI": {
        "short_name": "Sinarmas Land",
        "long_name": "Sinarmas Land Limited",
        "summary": "Sinarmas Land Limited, an investment holding company, engages in the property business in Indonesia, China, Malaysia, Singapore, and the United Kingdom. The company engages in the investment and development of township, residential, commercial, industrial, and hospitality-related properties; and ownership and management of hotels and resorts. It also develops resort properties; develops country clubs, golf clubs and courses, and recreational facilities; develops and operates toll roads; develops industrial estates; and provides financing, management and consultancy, educational, hotel and resort marketing agency, nominee, treasury management, and healthcare services. The company was formerly known as AFP Properties Limited and changed its name to Sinarmas Land Limited in April 2011. Sinarmas Land Limited was incorporated in 1994 and is headquartered in Singapore. Sinarmas Land Limited is a subsidiary of Flambo International Limited.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "118535",
        "website": "http://www.sinarmasland.com",
        "full_time_employees": null
    },
    "A30.SI": {
        "short_name": "Aspial",
        "long_name": "Aspial Corporation Limited",
        "summary": "Aspial Corporation Limited, an investment holding company, operates in the real estate, financial service, and jewelry businesses in Singapore, Australia, Malaysia, Hong Kong, Germany, and Ireland. It is involved in the provision of pawn broking and secured lending services; and retail and trading of pre-loved jewelry, timepieces, and bags, as well as branded merchandise. The company engages in the jewelry retail business under the brands of Lee Hwa Jewellery, Goldheart, and Niessing; and gold bullion broking and dealing activities. It is involved in the rental of properties; provision of management and other support services; and jewellery manufacturing and wholesaling activities; operates hotels, resorts, and serviced residences, as well as offers real estate consultancy services. The company was formerly known as Lee Hwa Holdings Ltd. and changed its name to Aspial Corporation Limited in 2001. Aspial Corporation Limited was founded in 1970 and is based in Singapore. Aspial Corporation Limited is a subsidiary of MLHS Holdings Pte. Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "408864",
        "website": "http://www.aspial.com",
        "full_time_employees": null
    },
    "ACDSF": {
        "short_name": "ASCENDAS REAL ESTATE INV TRUST",
        "long_name": "Ascendas Real Estate Investment Trust",
        "summary": "Ascendas Real Estate Investment Trust (Ascendas Reit) is Singapore's first and largest listed business space and industrial real estate investment trust. It was listed on the Singapore Exchange Securities Trading Limited (SGX-ST) in November 2002. As at 31 December 2020, Ascendas Reit's investment properties under management stood at S$13.7 billion. The portfolio comprises 200 properties across the developed markets of Singapore, Australia, the United Kingdom and the United States. Ascendas Reit's portfolio includes business and science parks, suburban office properties, high-specifications industrial properties, light industrial properties, logistics and distribution centres, and integrated developments, amenities and retail properties. These properties house a tenant base of more than 1,450 international and local companies from a wide range of industries and activities, including research and development, life sciences, information technology, engineering, light manufacturing, logistics service providers, electronics, telecommunications, manufacturing services and back-room office support in service industries. Major tenants include Singtel, Stripe, DSO National Laboratories, Pinterest, DBS, CareFusion, Wesfarmers, Citibank and JPMorgan. Ascendas Reit is listed in several indices. These include the FTSE Straits Times Index, the Morgan Stanley Capital International, Inc (MSCI) Index, the European Public Real Estate Association/National Association of Real Estate Investment Trusts (EPRA/NAREIT) Global Real Estate Index and Global Property Research (GPR) Asia 250. Ascendas Reit has an issuer rating of Â\u0091A3' by Moody's Investors Service. Ascendas Reit is managed by Ascendas Funds Management (S) Limited, a wholly owned subsidiary of Singapore-listed CapitaLand Limited, one of Asia's largest diversified real estate groups.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068912",
        "website": "http://www.ascendas-reit.com",
        "full_time_employees": null
    },
    "ACNDF": {
        "short_name": "ASCENDAS INDIA TRUST",
        "long_name": "Ascendas India Trust",
        "summary": "Ascendas India Trust (a-iTrust) was listed on the Singapore Exchange Securities Trading Limited (SGX-ST) in August 2007 as the first Indian property trust in Asia. Its principal objective is to own income-producing real estate used primarily as business space in India. a-iTrust may also develop and acquire land or uncompleted developments primarily to be used as business space, with the objective of holding the properties upon completion. As at 31 December 2019, a-iTrust's asset under management stands at S$2.1 billion. a-iTrust's portfolio comprises seven world-class IT business parks and one logistics park in India, namely the International Tech Park Bangalore, International Tech Park Chennai and CyberVale in Chennai, CyberPearl, The V and aVance in Hyderabad, aVance in Pune and Arshiya warehouses near Mumbai. a-iTrust is structured as a business trust, offering stable income distributions similar to a real estate investment trust. a-iTrust focuses on enhancing shareholder value by actively managing existing properties, developing vacant land in its portfolio, and acquiring new properties. a-iTrust is managed by Ascendas Property Fund Trustee Pte. Ltd. The trustee-manager is a wholly owned subsidiary of Singapore-listed CapitaLand Limited, one of Asia's largest diversified real estate groups.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "138522",
        "website": "http://www.a-itrust.com",
        "full_time_employees": null
    },
    "ACV.SI": {
        "short_name": "FRASERS HOSPITALITY TRUST",
        "long_name": "Frasers Hospitality Trust",
        "summary": "FHT is the first global hotel and serviced residence trust listed in Singapore on 14 July 2014, comprising FH-REIT and FH-BT. It is established with the principal strategy of investing globally, on a long-term basis, in income-producing real estate assets used primarily for hospitality purposes. FHT provides investors exposure to one of the largest international hospitality portfolios by number of keys. Its geographically diversified portfolio of 15 quality assets are in prime locations across 9 key cities in Asia, Australia and Europe. With a combined appraised value of S$2.25 billion (as at 30 September 2020), these 9 hotels and 6 serviced residences are: Novotel Melbourne on Collins, Novotel Sydney Darling Square, Sofitel Sydney Wentworth, Fraser Suites Sydney, InterContinental Singapore, Fraser Suites Singapore, ibis Styles London Gloucester Road, Park International London, Fraser Suites Edinburgh, Fraser Suites Glasgow, Fraser Suites Queens Gate, Fraser Place Canary Wharf, ANA Crowne Plaza Kobe, The Westin Kuala Lumpur and Maritim Hotel Dresden. Collectively, they have a total of 3,913 rooms comprising 3,071 hotel rooms and 842 serviced residence units. FHT is managed by Frasers Hospitality Asset Management Pte. Ltd., the manager of FH-REIT, and Frasers Hospitality Trust Management Pte. Ltd., the trustee-manager of FH-BT (collectively known as the Â\u0093ManagersÂ\u0094). The Managers are wholly-owned subsidiaries of Frasers Property Limited which is the sponsor of FHT.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Hotel & Motel",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "119958",
        "website": "http://www.frasersproperty.com/reits/fht",
        "full_time_employees": null
    },
    "ADN.SI": {
        "short_name": "First Sponsor",
        "long_name": "First Sponsor Group Limited",
        "summary": "First Sponsor Group Limited, an investment holding company, invests in, develops, and sells residential and commercial properties primarily in the People's Republic of China and Europe. The company operates through Property Development, Property Investment, Property Financing, and Hotel Operations segments. It also provides interest bearing loans to vendor financing arrangements and subscription of debt securities. In addition, the company owns and operates hotels. First Sponsor Group Limited was incorporated in 2007 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "048942",
        "website": "http://www.1st-sponsor.com.sg",
        "full_time_employees": 400
    },
    "AJBU.SI": {
        "short_name": "Keppel DC Reit",
        "long_name": "Keppel DC REIT",
        "summary": "Listed on 12 December 2014, Keppel DC REIT is the first pure-play data centre REIT listed in Asia and on the Singapore Exchange (SGX-ST). Keppel DC REIT's investment strategy is to principally invest, directly or indirectly, in a diversified portfolio of income-producing real estate assets which are used primarily for data centre purposes, as well as real estate related assets. As at 31 December 2020, its portfolio comprises 19 data centres strategically located in key data centre hubs. With an aggregate lettable area of approximately 2,089,085 sq ft, the portfolio spans 12 cities in eight countries across Asia Pacific and Europe. Keppel Telecommunications & Transportation Ltd (Keppel T&T), the Sponsor of the REIT, has also granted Rights of First Refusal (ROFR) to the REIT for future acquisition opportunities of its data centre assets. The REIT is managed by Keppel DC REIT Management Pte. Ltd.. Keppel Capital Holdings Pte. Ltd. (Keppel Capital) has a 50% interest in the Manager, with the remaining interest held by Keppel T&T. Keppel Capital is a premier asset manager in Asia with assets under management comprising real estate, infrastructure and data centre properties in key global markets. The Manager's key objectives are to provide the REIT's Unitholders with regular and stable distributions, as well as achieve long-term growth while maintaining an optimal capital structure.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "098632",
        "website": "http://www.keppeldcreit.com",
        "full_time_employees": null
    },
    "AU8U.SI": {
        "short_name": "CapLand China T",
        "long_name": "CapitaLand China Trust",
        "summary": "CapitaLand China Trust (CLCT), formerly known as CapitaLand Retail China Trust, is Singapore's largest China-focused real estate investment trust (REIT). Upon completion of the transformational acquisition of five business parks and balance 49% interest in Rock Square, CLCT's enlarged portfolio will comprise of 13 shopping malls and five business park properties. The geographically diversified portfolio has a total gross floor area (GFA) of approximately 1.8 million square metre (sq m), located across 11 leading Chinese cities. CLCT was listed on the Singapore Exchange Securities Trading Limited (SGX-ST) on 8 December 2006, and established with the objective of investing on a long-term basis in a diversified portfolio of income-producing real estate and real estate-related assets in mainland China, Hong Kong and Macau that are used primarily for retail, office and industrial purposes (including business parks, logistics facilities, data centres and integrated developments). CLCT's retail properties are strategically located in densely populated areas with good connectivity to public transport. The malls are positioned as one-stop family-oriented destinations housing a wide range of lifestyle offerings that cater to varied consumer preferences in shopping, dining and entertainment as well as essential services. CLCT's portfolio comprises a diverse mix of more than 2,000 leases, which include leading brands UNIQLO, Xiaomi, ZARA, Haidilao, Nike, Sephora, Starbucks Coffee and Swarovski. The malls are CapitaMall Xizhimen, CapitaMall Wangjing, CapitaMall Grand Canyon and CapitaMall Shuangjing in Beijing; Rock Square in Guangzhou; CapitaMall Xinnan in Chengdu; CapitaMall Qibao in Shanghai; CapitaMall Minzhongleyuan in Wuhan; CapitaMall Saihan and CapitaMall Nuohemule in Hohhot; CapitaMall Xuefu, CapitaMall Aidemengdun in Harbin and CapitaMall Yuhuating in Changsha. CLCT has a portfolio of five business parks situated in high-growth economic zones which house high quality and reputable domestic and multinational corporations operating in new economy sectors such as Electronics, Engineering, E-Commerce, Information and Communications Technology and Financial Services. The business parks exhibit excellent connectivity with close proximity to transportation hubs, and are easily accessible via various modes of transportation. The properties are Ascendas Xinsu Portfolio in Suzhou, Ascendas Innovation Towers and Ascendas Innovation Hub in Xi'an and Singapore-Hangzhou Science & Technology Park Phase I and Phase II in Hangzhou. CLCT is managed by CapitaLand China Trust Management Limited, a wholly owned subsidiary of Singapore-listed CapitaLand Limited, one of Asia's largest diversified real estate groups.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068912",
        "website": "http://www.clct.com.sg",
        "full_time_employees": null
    },
    "AW9U.SI": {
        "short_name": "First Reit",
        "long_name": "First Real Estate Investment Trust",
        "summary": "First Real Estate Investment Trust (Â\u0093First REITÂ\u0094) is a real estate investment trust constituted by the Trust Deed entered into on 19 October 2006 between First REIT Management Limited (formerly Bowsprit Capital Corporation Limited) as the Manager and HSBC Institutional Trust Services (Singapore) Limited as the Trustee. First REIT was listed on the Singapore Exchange Securities Trading Limited on 11 December 2006. On 1 March 2018, HSBC Institutional Trust Services (Singapore) Limited retired as the Trustee of First REIT in favour of Perpetual (Asia) Limited. First REIT is Singapore's first healthcare real estate investment trust that aims to invest in a diversified portfolio of income-producing real estate and / or real estate-related assets in Asia that are primarily used for healthcare and / or healthcare-related purposes. Managed by First REIT Management Limited,, First REIT's portfolio consists of 20 properties located in Indonesia, Singapore and South Korea, namely 1) Siloam Hospitals Lippo Village, 2) Siloam Hospitals Kebon Jeruk, 3) Siloam Hospitals Surabaya, 4) Imperial Aryaduta Hotel & Country Club, 5) Mochtar Riady Comprehensive Cancer Centre, 6) Siloam Hospitals Lippo Cikarang, 7) Siloam Hospitals Manado & Hotel Aryaduta Manado, 8) Siloam Hospitals Makassar, 9) Siloam Hospitals Bali, 10) Siloam Hospitals TB Simatupang, 11) Siloam Hospitals Purwakarta, 12) Siloam Sriwijaya, 13) Siloam Hospitals Kupang & Lippo Plaza Kupang, 14) Siloam Hospitals Labuan Bajo, 15) Siloam Hospitals Buton & Lippo Plaza Buton, 16) Siloam Hospitals Yogyakarta, 17) Pacific Healthcare Nursing Home @ Bukit Merah, 18) Pacific Healthcare Nursing Home II @ Bukit Panjang, 19) The Lentor Residence and 20) Sarang Hospital. Its hospital assets in Indonesia are operated by PT Siloam International Hospitals Tbk, a subsidiary of PT Lippo Karawaci Tbk, a strong brand name in the Indonesian healthcare industry supported by a team of international healthcare professionals whereas The Imperial Aryaduta Hotel & Country Club and Hotel Aryaduta Manado are operated by The Aryaduta Hotel and Resort Group. The Lippo Plaza Kupang and Lippo Plaza Buton are managed by PT Lippo Malls Indonesia. In Singapore, the nursing homes at Bukit Merah and Bukit Panjang are operated by Pacific Healthcare Nursing Home Pte. Ltd. and Pacific Eldercare and Nursing Pte. Ltd., respectively. The Lentor Residence is operated by The Lentor Residence Pte. Ltd. In South Korea, the Sarang Hospital is operated by a private doctor. Through First REIT, investors can participate in an asset class that has a focus towards Asia's growing healthcare sector, which is boosted by an increase in life expectancy in Indonesia and the rest of Southeast Asia.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Healthcare Facilities",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "49321",
        "website": "http://www.first-reit.com",
        "full_time_employees": null
    },
    "AWS.SI": {
        "short_name": "GYP Properties",
        "long_name": "GYP Properties Limited",
        "summary": "GYP Properties Limited, an investment holding company, invests in, develops, manages, and rents real estate properties in Singapore and New Zealand. It operates through Property and Others segments. The company has a property portfolio of 303,051 square meters of land comprising commercial, retail, and residential assets. Its principal projects include Remarkables Residences, Bellfield Estate, and Pakuranga Precinct. The company also invests in equity shares. The company was formerly known as Global Yellow Pages Limited and changed its name to GYP Properties Limited in October 2018. GYP Properties Limited was founded in 1967 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "319637",
        "website": "http://www.gypproperties.com",
        "full_time_employees": null
    },
    "AZA.SI": {
        "short_name": "IPC Corp",
        "long_name": "IPC Corporation Ltd",
        "summary": "IPC Corporation Ltd, an investment holding company, engages in property development and investment activities in Singapore and the People's Republic of China. It invests in and resells properties; and provides property consulting services. The company also provides hospitality services; and sells and distributes telecommunication products, and computer system boards and peripheral products. In addition, it offers hotel and club management services. IPC Corporation Ltd was incorporated in 1985 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "535224",
        "website": "http://www.ipc.com.sg",
        "full_time_employees": null
    },
    "B1W1.F": {
        "short_name": "BUKIT SEMBA. SUBDI.SD-,50",
        "long_name": "Bukit Sembawang Estates Limited",
        "summary": "Bukit Sembawang Estates Limited, an investment holding company, engages in the property development in Singapore. It operates through Property Development, Investment Holding, and Hospitality segments. The company develops and sells residential properties; and holds and manages office buildings. In addition, it operates serviced apartments. The company was founded in 1911 and is based in Singapore.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "159835",
        "website": "http://www.bukitsembawang.sg",
        "full_time_employees": null
    },
    "B61.SI": {
        "short_name": "Bukit Sembawang",
        "long_name": "Bukit Sembawang Estates Limited",
        "summary": "Bukit Sembawang Estates Limited, an investment holding company, engages in the property development in Singapore. It operates through Property Development, Investment Holding, and Hospitality segments. The company develops and sells residential properties; and holds and manages office buildings. In addition, it operates serviced apartments. The company was founded in 1911 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "159835",
        "website": "http://www.bukitsembawang.sg",
        "full_time_employees": null
    },
    "BHO.SI": {
        "short_name": "Top Global",
        "long_name": "Top Global Limited",
        "summary": "Top Global Limited, an investment holding company, engages in the real estate development activities in Singapore and Indonesia. The company operates through Property Development, Hospitality Management, Property Management, and Investment and Others segments. It is involved in the development of residential properties; and investment activities. The company also provides property management services for residential and commercial properties; facility management services; and management services for hostel and hotel operators. In addition, it engages in the golf and country club, hotel, hostel, and water theme park operations; development of information technology software; research, development, and wholesale of equipment; operation and management of serviced apartments; and sale of food and beverages. The company was incorporated in 1980 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "238862",
        "website": "http://www.topglobal.com.sg",
        "full_time_employees": null
    },
    "BMGU.SI": {
        "short_name": "BHG Retail Reit",
        "long_name": "BHG Retail REIT",
        "summary": "BHG Retail REIT is the first pure-play China Retail REIT sponsored by a leading China integrated retail group. The REIT was listed on the Main Board of the Singapore Exchange Securities Trading Limited on 11 December 2015. The principal investment strategy of BHG Retail REIT is to invest, directly or indirectly, in a diversified portfolio of income-producing real estate which is used primarily for retail purposes (whether either wholly or partially), as well as real estate-related assets in relation to the foregoing, with an initial focus on China. As at 30 June 2020, the REIT's portfolio comprises six retail properties, Beijing Wanliu (60%), Chengdu Konggang, Hefei Mengchenglu, Hefei Changjiangxilu, Xining Huayuan, Dalian Jinsanjiao located in Tier 1, Tier 2 and other cities of significant economic potential in China. The portfolio gross floor area of about 311,691 sqm, has a committed occupancy of 92.9% as at 30 June 2020.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "179101",
        "website": "http://www.bhgreit.com",
        "full_time_employees": null
    },
    "BTOU.SI": {
        "short_name": "ManulifeReit USD",
        "long_name": "Manulife US Real Estate Investment Trust",
        "summary": "Manulife US Real Estate Investment Trust (Â\u0093Manulife US REITÂ\u0094) is the first pure-play U.S. office REIT listed in Asia. It is a Singapore listed REIT established with the investment strategy principally to invest, directly or indirectly, in a portfolio of income-producing office real estate in key markets in the United States (Â\u0093U.S.Â\u0094), as well as real estate-related assets. Manulife US REIT's portfolio comprises nine prime, freehold and Trophy or Class A quality office properties strategically located in California, Atlanta, New Jersey and Washington D.C. Metro Area. The current portfolio valued at US$2.1 billion, has an aggregate Net Lettable Area of 4.7 million sq ft and an occupancy rate of 95.8% as at 31 December 2019.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "048424",
        "website": "http://www.manulifeusreit.sg",
        "full_time_employees": 17
    },
    "BUOU.SI": {
        "short_name": "FRASERS LOGISTICS & COM TRUST",
        "long_name": "Frasers Logistics & Commercial Trust",
        "summary": "Frasers Logistics & Commercial Trust (Â\u0093FLCTÂ\u0094) is a Singapore-listed real estate investment trust with a portfolio comprising 100 industrial and commercial properties, worth approximately S$6.2 billion, diversified across five major developed markets Â\u0096 Australia, Germany, Singapore, the United Kingdom and the Netherlands. FLCT was listed on the Mainboard of Singapore Exchange Securities Trading Limited (Â\u0093SGX-STÂ\u0094) on 20 June 2016 as Frasers Logistics & Industrial Trust and was subsequently renamed Frasers Logistics & Commercial Trust on 29 April 2020 following the completion of a merger with Frasers Commercial Trust. FLCT's investment strategy is to invest globally in a diversified portfolio of income-producing properties used predominantly for logistics or industrial purposes located globally, or commercial purposes (comprising primarily CBD office space) or business park purposes (comprising primarily non-CBD office space and/or research and development space) located in the Asia-Pacific region or in Europe (including the United Kingdom). FLCT is sponsored by Frasers Property Limited.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "119958",
        "website": "http://www.frasersproperty.com/reits/flct",
        "full_time_employees": 22
    },
    "BWCU.SI": {
        "short_name": "EC World Reit",
        "long_name": "EC World Real Estate Investment Trust",
        "summary": "Listed on 28 July 2016, EC World REIT is the first Chinese specialised logistics and e-commerce logistics REIT listed on Singapore Exchange Securities Trading Limited (Â\u0093SGX-STÂ\u0094). With its portfolio of eight quality properties located predominantly in one of the largest e-commerce clusters in the Yangtze River Delta, EC World REIT offers investors unique exposure to the logistics and e-commerce sectors in Hangzhou and Wuhan, the People's Republic of China (Â\u0093PRCÂ\u0094). EC World REIT's investment strategy is to invest principally, directly or indirectly, in a diversified portfolio of income-producing real estate which is used primarily for e-commerce, supply-chain management and logistics purposes, as well as real estate-related assets, with an initial geographical focus on the PRC. EC World REIT is listed in several indices. These include the FTSE ASEAN All-Share Index, FTSE ST All-Share Index, FTSE ST China Index and FTSE ST Singapore Shariah Index. EC World REIT is managed by EC World Asset Management Pte. Ltd., which is an indirect wholly-owned subsidiary of the Sponsor Â\u0096 Forchn Holdings Group Co., Ltd. Established in 1992 and headquartered in Shanghai, the Sponsor is a conglomerate with businesses in supply chain, intelligent manufacturing, medical care and healthcare, finance and other sectors.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "048619",
        "website": "http://www.ecwreit.com",
        "full_time_employees": null
    },
    "C09.SI": {
        "short_name": "CityDev",
        "long_name": "City Developments Limited",
        "summary": "City Developments Limited (CDL) is a leading global real estate operating company with a network spanning 103 locations in 29 countries and regions. Listed on the Singapore Exchange, the Group is one of the largest companies by market capitalisation. Its income-stable and geographically-diverse portfolio comprises residences, offices, hotels, serviced apartments, integrated developments and shopping malls. With a proven track record of over 55 years in real estate development, investment and management, CDL has developed over 43,000 homes and owns over 18 million square feet of lettable floor area globally. Its diversified global land bank offers 4.1 million square feet of developable gross floor area. The Group's London-based hotel arm, Millennium & Copthorne Hotels (M&C), is one of the world's largest hotel chains, with over 145 hotels worldwide, many in key gateway cities. Leveraging its deep expertise in developing and managing a diversified asset base, the Group is focused on enhancing the performance of its portfolio and strengthening its recurring income streams to deliver long-term sustainable value to shareholders. The Group is also developing a fund management business and targets to achieve US$5 billion in Assets Under Management (AUM) by 2023.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "048619",
        "website": "http://www.cdl.com.sg",
        "full_time_employees": null
    },
    "C29.SI": {
        "short_name": "Chip Eng Seng",
        "long_name": "Chip Eng Seng Corporation Ltd",
        "summary": "Chip Eng Seng Corporation Ltd, an investment holding company, engages in the construction, property development and investment, and hospitality businesses primarily in Singapore, Australia, Malaysia, and Maldives. The company operates through Construction, Property Developments, Property Investments, Hospitality, and Corporate and Others segments. The company constructs public housing projects, condominiums, executive condominiums, modular buildings, and industrial and commercial projects; develops residential, commercial, and industrial properties, as well as manages development projects; and provides real estate management and consultancy services. It also leases investment properties, such as shophouses, office buildings, and industrial properties; operates hotels and island resort; and invests in marketable securities. In addition, the company acts as general building contractor; manufactures and trades in precast products; and provides general building engineering, financial, and treasury services. Further, the company operates Repton-brand pre-school center in Singapore. Chip Eng Seng Corporation Ltd was incorporated in 1998 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "169877",
        "website": "http://www.chipengseng.com.sg",
        "full_time_employees": 772
    },
    "C2PU.SI": {
        "short_name": "ParkwayLife Reit",
        "long_name": "Parkway Life Real Estate Investment Trust",
        "summary": "Parkway Life Real Estate Investment Trust (Â\u0093PLife REITÂ\u0094) is one of Asia's largest listed healthcare REITs by asset size. It invests in income-producing real estate and real estate related assets that are used primarily for healthcare and healthcare-related purposes (including but are not limited to, hospitals, healthcare facilities and real estate and/or real estate assets used in connection with healthcare research, education, and the manufacture or storage of drugs, medicine and other healthcare goods and devices). PLife REIT owns a well-diversified portfolio of 54 properties located in the Asia Pacific region, with a total portfolio size of approximately S$2.02 billion3 as at 31 December 2020. It owns the largest portfolio of strategically-located private hospitals in Singapore comprising Mount Elizabeth Hospital, Gleneagles Hospital and Parkway East Hospital. In addition, it has 50 assets of high quality nursing home and care facility properties in various prefectures of Japan. It also owns strata-titled units/lots in MOB Specialist Clinics Kuala Lumpur in Malaysia.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Healthcare Facilities",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068898",
        "website": "http://www.plifereit.com",
        "full_time_employees": null
    },
    "C31.SI": {
        "short_name": "CapitaLand",
        "long_name": "CapitaLand Limited",
        "summary": "CapitaLand Limited, together with its subsidiaries, develops, owns, leases, manages, and sells real estate properties in Singapore, rest of Asia, North America, Europe, the United Kingdom, and internationally. The company operates through CapitaLand Singapore & International, CapitaLand China, CapitaLand India, CapitaLand Lodging, and CapitaLand Financial segments. Its real estate portfolio includes commercial and retail properties; business parks; shopping malls; offices; homes; industrial and logistics properties; integrated and urban developments; and lodging and residential properties, as well as real estate investment trusts (REITs), business trusts, and private funds. The company also invests in real estate financial products and assets; and provides investment advisory and management services, as well as real estate asset management and investment management services. In addition, it offers management support and consultancy services. The company was formerly known as Pidemco Land Limited and changed its name to CapitaLand Limited in November 2000. CapitaLand Limited was incorporated in 1989 and is headquartered in Singapore. CapitaLand Limited is a subsidiary of CLA Real Estate Holdings Pte Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068912",
        "website": "http://www.capitaland.com",
        "full_time_employees": 10473
    },
    "C33.SI": {
        "short_name": "Chuan Hup",
        "long_name": "Chuan Hup Holdings Limited",
        "summary": "Chuan Hup Holdings Limited, an investment holding company, engages in the electronics manufacturing business. It is also involved in the property development and investment activities. It operates in Singapore, Australia, the People's Republic of China, the United States, and Europe, as well as ASEAN countries and internationally. The company was founded in 1970 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "059818",
        "website": "http://www.chuanhup.com.sg",
        "full_time_employees": null
    },
    "C38U.SI": {
        "short_name": "CapLand IntCom T",
        "long_name": "CapitaLand Integrated Commercial Trust",
        "summary": "CapitaLand Integrated Commercial Trust (CICT) is the first and largest real estate investment trust (REIT) listed on Singapore Exchange Securities Trading Limited (SGX-ST) with a market capitalisation of S$14.0 billion as at 31 December 2020. It debuted on SGX-ST as CapitaLand Mall Trust in July 2002 and was renamed CICT in November 2020 following the merger with CapitaLand Commercial Trust. CICT owns and invests in quality income-producing assets primarily used for commercial (including retail and/or office) purpose, located predominantly in Singapore. As the largest proxy for Singapore commercial real estate, CICT's portfolio comprises 22 properties in Singapore and two in Frankfurt, Germany, with a total property value of S$22.3 billion as at 31 December 2020. CICT is managed by CapitaLand Integrated Commercial Trust Management Limited, which is a wholly owned subsidiary of Singapore-listed CapitaLand Limited, one of Asia's largest diversified real estate groups.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068912",
        "website": "http://www.cict.com.sg",
        "full_time_employees": 665
    },
    "CDE.F": {
        "short_name": "CITY DEV.  SD-,50",
        "long_name": "City Developments Limited",
        "summary": "City Developments Limited (CDL) is a leading global real estate operating company with a network spanning 103 locations in 29 countries and regions. Listed on the Singapore Exchange, the Group is one of the largest companies by market capitalisation. Its income-stable and geographically-diverse portfolio comprises residences, offices, hotels, serviced apartments, integrated developments and shopping malls. With a proven track record of over 55 years in real estate development, investment and management, CDL has developed over 43,000 homes and owns over 18 million square feet of lettable floor area globally. Its diversified global land bank offers 4.1 million square feet of developable gross floor area. The Group's London-based hotel arm, Millennium & Copthorne Hotels (M&C), is one of the world's largest hotel chains, with over 145 hotels worldwide, many in key gateway cities. Leveraging its deep expertise in developing and managing a diversified asset base, the Group is focused on enhancing the performance of its portfolio and strengthening its recurring income streams to deliver long-term sustainable value to shareholders. The Group is also developing a fund management business and targets to achieve US$5 billion in Assets Under Management (AUM) by 2023.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "048619",
        "website": "http://www.cdl.com.sg",
        "full_time_employees": null
    },
    "CDEVF": {
        "short_name": "CITY DEVELOPMENTS",
        "long_name": "City Developments Limited",
        "summary": "City Developments Limited (CDL) is a leading global real estate operating company with a network spanning 103 locations in 29 countries and regions. Listed on the Singapore Exchange, the Group is one of the largest companies by market capitalisation. Its income-stable and geographically-diverse portfolio comprises residences, offices, hotels, serviced apartments, integrated developments and shopping malls. With a proven track record of over 55 years in real estate development, investment and management, CDL has developed over 43,000 homes and owns over 18 million square feet of lettable floor area globally. Its diversified global land bank offers 4.1 million square feet of developable gross floor area. The Group's London-based hotel arm, Millennium & Copthorne Hotels (M&C), is one of the world's largest hotel chains, with over 145 hotels worldwide, many in key gateway cities. Leveraging its deep expertise in developing and managing a diversified asset base, the Group is focused on enhancing the performance of its portfolio and strengthening its recurring income streams to deliver long-term sustainable value to shareholders. The Group is also developing a fund management business and targets to achieve US$5 billion in Assets Under Management (AUM) by 2023.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "048619",
        "website": "http://www.cdl.com.sg",
        "full_time_employees": null
    },
    "CDEVY": {
        "short_name": "CITY DEVELOPMENTS",
        "long_name": "City Developments Limited",
        "summary": "City Developments Limited (CDL) is a leading global real estate operating company with a network spanning 103 locations in 29 countries and regions. Listed on the Singapore Exchange, the Group is one of the largest companies by market capitalisation. Its income-stable and geographically-diverse portfolio comprises residences, offices, hotels, serviced apartments, integrated developments and shopping malls. With a proven track record of over 55 years in real estate development, investment and management, CDL has developed over 43,000 homes and owns over 18 million square feet of lettable floor area globally. Its diversified global land bank offers 4.1 million square feet of developable gross floor area. The Group's London-based hotel arm, Millennium & Copthorne Hotels (M&C), is one of the world's largest hotel chains, with over 145 hotels worldwide, many in key gateway cities. Leveraging its deep expertise in developing and managing a diversified asset base, the Group is focused on enhancing the performance of its portfolio and strengthening its recurring income streams to deliver long-term sustainable value to shareholders. The Group is also developing a fund management business and targets to achieve US$5 billion in Assets Under Management (AUM) by 2023.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "048619",
        "website": "http://www.cdl.com.sg",
        "full_time_employees": null
    },
    "CEDU.SI": {
        "short_name": "Dasin Retail Tr",
        "long_name": "Dasin Retail Trust",
        "summary": "Dasin Retail Trust is the only China retail property trust providing direct exposure to the fast-growing Guangdong-Hong Kong-Macau Greater Bay Area listed on the Main Board of the Singapore Exchange Securities Trading Limited (the Â\u0093SGX-STÂ\u0094) on 20 January 2017. Dasin Retail Trust's principal investment mandate is to invest in, own or develop land, uncompleted developments and income-producing real estate in Greater China (comprising People's Republic of China (Â\u0093PRCÂ\u0094), Hong Kong and Macau), used primarily for retail purposes, as well as real estate-related assets, with an initial focus on retail malls. The portfolio of Dasin Retail Trust comprises seven retail malls strategically located in Foshan, Zhuhai and Zhongshan Cities in PRC2. Dasin Retail Trust is managed by Dasin Retail Trust Management Pte. Ltd. (the Â\u0093Trustee ManagerÂ\u0094). The Trustee-Manager's key objectives are to provide Unitholders of Dasin Retail Trust with an attractive rate of return on their investment through regular and stable distributions to Unitholders and to achieve long-term sustainable growth in DPU and net asset value per Unit, while maintaining an appropriate capital structure for Dasin Retail Trust.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "018981",
        "website": "http://dasintrust.com",
        "full_time_employees": null
    },
    "CLLDF": {
        "short_name": "CAPITALAND LTD",
        "long_name": "CapitaLand Limited",
        "summary": "CapitaLand Limited, together with its subsidiaries, develops, owns, leases, manages, and sells real estate properties in Singapore, rest of Asia, North America, Europe, the United Kingdom, and internationally. The company operates through CapitaLand Singapore & International, CapitaLand China, CapitaLand India, CapitaLand Lodging, and CapitaLand Financial segments. Its real estate portfolio includes commercial and retail properties; business parks; shopping malls; offices; homes; industrial and logistics properties; integrated and urban developments; and lodging and residential properties, as well as real estate investment trusts (REITs), business trusts, and private funds. The company also invests in real estate financial products and assets; and provides investment advisory and management services, as well as real estate asset management and investment management services. In addition, it offers management support and consultancy services. The company was formerly known as Pidemco Land Limited and changed its name to CapitaLand Limited in November 2000. CapitaLand Limited was incorporated in 1989 and is headquartered in Singapore. CapitaLand Limited is a subsidiary of CLA Real Estate Holdings Pte Ltd.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068912",
        "website": "http://www.capitaland.com",
        "full_time_employees": 10473
    },
    "CLLDY": {
        "short_name": "CAPITALAND LTD",
        "long_name": "CapitaLand Limited",
        "summary": "CapitaLand Limited, together with its subsidiaries, develops, owns, leases, manages, and sells real estate properties in Singapore, rest of Asia, North America, Europe, the United Kingdom, and internationally. The company operates through CapitaLand Singapore & International, CapitaLand China, CapitaLand India, CapitaLand Lodging, and CapitaLand Financial segments. Its real estate portfolio includes commercial and retail properties; business parks; shopping malls; offices; homes; industrial and logistics properties; integrated and urban developments; and lodging and residential properties, as well as real estate investment trusts (REITs), business trusts, and private funds. The company also invests in real estate financial products and assets; and provides investment advisory and management services, as well as real estate asset management and investment management services. In addition, it offers management support and consultancy services. The company was formerly known as Pidemco Land Limited and changed its name to CapitaLand Limited in November 2000. CapitaLand Limited was incorporated in 1989 and is headquartered in Singapore. CapitaLand Limited is a subsidiary of CLA Real Estate Holdings Pte Ltd.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068912",
        "website": "http://www.capitaland.com",
        "full_time_employees": 10473
    },
    "CLN.SI": {
        "short_name": "APAC Realty",
        "long_name": "APAC Realty Limited",
        "summary": "APAC Realty Limited, an investment holding company, provides real estate services in Singapore. It operates through Real estate brokerage income, Rental income, and Others segments. The company offers property brokerage services for primary and secondary home sales, as well as for the rental and resale of residential, commercial, and industrial properties under the ERA brand name. It also holds the ERA regional master franchise rights for 17 countries in the Asia Pacific; and franchise rights for Singapore for Coldwell Banker, a real estate office and franchising company in the United States. In addition, the company provides training programs and courses for real estate agents in preparation for professional certification exams; management services for real estate developments; and auction services for financial institutions and property owners, as well as undertakes valuation works on behalf of clients, such as financial institutions, government agencies, and property owners. Further, it engages in the rental of investment properties, workstations, lockers, and furniture products; and provision of professional indemnity insurance, administration, business conference, real estate consultancy, and miscellaneous services. The company was founded in 1982 and is headquartered in Singapore. APAC Realty Limited is a subsidiary of Asia Pacific Realty Holdings Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "319394",
        "website": "http://www.apacrealty.com.sg",
        "full_time_employees": 151
    },
    "CMOU.SI": {
        "short_name": "KepPacOakReitUSD",
        "long_name": "Keppel Pacific Oak US REIT",
        "summary": "Keppel Pacific Oak US REIT (KORE) is a distinctive office REIT listed on the main board of the Singapore Exchange Securities Trading Limited (SGX-ST) on 9 November 2017. KORE's investment strategy is to principally invest in a diversified portfolio of income-producing commercial assets and real estate-related assets in key growth markets of the United States (US) with positive economic and office fundamentals that generally outpace the US national average, and the average of the gateway cities, so as to provide sustainable distributions and strong total returns for Unitholders. KORE is managed by Keppel Pacific Oak US REIT Management Pte. Ltd., which is jointly owned by two Sponsors, Keppel Capital and KPA. KORE's portfolio comprises a balanced mix of 13 freehold office buildings and business campuses across eight key growth markets driven by innovation and technology in the US. The assets have a combined value of US$1.30 billion and an aggregate net lettable area of over 4.7 million sf. KORE has an extensive and diversified tenant base, some of which are from the growth and defensive sectors such as technology, as well as medical and healthcare, which will continue to support and drive growth. KORE is a technology-focused office REIT with over 50% of the portfolio located in the technology hubs of Seattle Â\u0096 Bellevue/Redmond, Austin and Denver. The remainder of the portfolio is located in the key growth markets of Houston, Dallas, Orlando, Sacramento and Atlanta.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "098632",
        "website": "http://www.koreusreit.com",
        "full_time_employees": 7
    },
    "CNNU.SI": {
        "short_name": "CromwellReit EUR",
        "long_name": "Cromwell European Real Estate Investment Trust",
        "summary": "Cromwell European Real Estate Investment Trust (Â\u0093Cromwell European REITÂ\u0094 or Â\u0093CEREIT') is a real estate investment trust (Â\u0093REITÂ\u0094) with the principal investment strategy of investing, directly or indirectly, in a diversified portfolio of income-producing real estate assets in Europe that are used primarily for office, light industrial / logistics and retail purposes. CEREIT's portfolio comprises 95 properties with an appraised value of approximately Â\u00802,082 million as at the date of this announcement in or close to major gateway cities in the Netherlands, Italy, France, Poland, Germany, Finland and Denmark, with a balanced focus on the office and light industrial / logistics sectors. CEREIT's portfolio has an aggregate lettable area of approximately 1.4 million square metres, around 800 tenant-customers and a WALE3 profile of approximately 5.0 years as at 30 September 2020. CEREIT is the first REIT with a diversified pan-European portfolio listed on the Singapore Exchange Limited. CEREIT is managed by Cromwell EREIT Management Pte. Ltd., a wholly-owned subsidiary of CEREIT's sponsor, Cromwell Property Group9, a real estate investor and manager with operations in 14 countries, listed on the Australian Securities Exchange Ltd.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "049321",
        "website": "http://www.cromwelleuropeanreit.com.sg",
        "full_time_employees": null
    },
    "CPAMF": {
        "short_name": "CAPITALAND INTEGRATED COM TRUST",
        "long_name": "CapitaLand Integrated Commercial Trust",
        "summary": "CapitaLand Integrated Commercial Trust (CICT) is the first and largest real estate investment trust (REIT) listed on Singapore Exchange Securities Trading Limited (SGX-ST) with a market capitalisation of S$14.0 billion as at 31 December 2020. It debuted on SGX-ST as CapitaLand Mall Trust in July 2002 and was renamed CICT in November 2020 following the merger with CapitaLand Commercial Trust. CICT owns and invests in quality income-producing assets primarily used for commercial (including retail and/or office) purpose, located predominantly in Singapore. As the largest proxy for Singapore commercial real estate, CICT's portfolio comprises 22 properties in Singapore and two in Frankfurt, Germany, with a total property value of S$22.3 billion as at 31 December 2020. CICT is managed by CapitaLand Integrated Commercial Trust Management Limited, which is a wholly owned subsidiary of Singapore-listed CapitaLand Limited, one of Asia's largest diversified real estate groups.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068912",
        "website": "http://www.cict.com.sg",
        "full_time_employees": 665
    },
    "CRPU.SI": {
        "short_name": "Sasseur Reit",
        "long_name": "Sasseur Real Estate Investment Trust",
        "summary": "Sasseur Real Estate Investment Trust invests in a portfolio of real estate and related assets. The company operates through four segments: Chongqing Outlets, Bishan Outlets, Hefei Outlets, and Kunming Outlets. Its property portfolio comprises four retail outlet malls covering a gross floor area of 377,737 square meters located in the People's Republic of China. The company is based in Singapore. Sasseur Real Estate Investment Trust is a subsidiary of Sasseur Cayman Holding II.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "038987",
        "website": "http://www.sasseurreit.com",
        "full_time_employees": null
    },
    "CY6U.SI": {
        "short_name": "Ascendas-iTrust",
        "long_name": "Ascendas India Trust",
        "summary": "Ascendas India Trust (a-iTrust) was listed on the Singapore Exchange Securities Trading Limited (SGX-ST) in August 2007 as the first Indian property trust in Asia. Its principal objective is to own income-producing real estate used primarily as business space in India. a-iTrust may also develop and acquire land or uncompleted developments primarily to be used as business space, with the objective of holding the properties upon completion. As at 31 December 2019, a-iTrust's asset under management stands at S$2.1 billion. a-iTrust's portfolio comprises seven world-class IT business parks and one logistics park in India, namely the International Tech Park Bangalore, International Tech Park Chennai and CyberVale in Chennai, CyberPearl, The V and aVance in Hyderabad, aVance in Pune and Arshiya warehouses near Mumbai. a-iTrust is structured as a business trust, offering stable income distributions similar to a real estate investment trust. a-iTrust focuses on enhancing shareholder value by actively managing existing properties, developing vacant land in its portfolio, and acquiring new properties. a-iTrust is managed by Ascendas Property Fund Trustee Pte. Ltd. The trustee-manager is a wholly owned subsidiary of Singapore-listed CapitaLand Limited, one of Asia's largest diversified real estate groups.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "138522",
        "website": "http://www.a-itrust.com",
        "full_time_employees": null
    },
    "D5IU.SI": {
        "short_name": "Lippo Malls Tr",
        "long_name": "Lippo Malls Indonesia Retail Trust",
        "summary": "LMIR Trust is a Singapore-based real estate investment trust established with the principal investment objective of owning and investing, on a long-term basis, in a diversified portfolio of income-producing real estate in Indonesia that are primarily used for retail and/or retail-related purposes. LMIR Trust's current asset portfolio comprises 21 retail malls (Â\u0093Retail MallsÂ\u0094) and seven retail spaces located within other retail malls (Â\u0093Retail SpacesÂ\u0094, and collectively with the Retail Malls, the Â\u0093PropertiesÂ\u0094). The Properties have a total net lettable area of 839,907 square metres and total valuation of Rp15,716.1 billion as at 31 July 2020, and are strategically located in major cities of Indonesia with large middle-income population. Tenants include leading names such as Matahari Department Store, Zara, M&S, H&M, Sogo, Giant, Hypermart, Carrefour, Ace Hardware, as well as international specialty tenants such as Victoria's Secret, Promod, McDonalds, Pizza Hut, Kentucky Fried Chicken, A&W, Fitness First and Starbucks.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068809",
        "website": "http://www.lmir-trust.com",
        "full_time_employees": null
    },
    "E8Z.SI": {
        "short_name": "Roxy-Pacific",
        "long_name": "Roxy-Pacific Holdings Limited",
        "summary": "Roxy-Pacific Holdings Limited, an investment holding company, operates in the property and hospitality businesses in the Asia-Pacific. It operates through Property Development, Property Investment, and Hotel Ownership segments. The company primarily owns and operates the Grand Mercure Singapore Roxy hotel with 576 guest rooms and suites located in Singapore. It develops and sells residential and commercial units, including apartments and condominiums. In addition, it owns boutique hotels, including Noku Kyoto with 81 rooms located in Kyoto; and Noku Osaka with 154 rooms in Osaka City, Japan, as well as operates Noku Maldives resort with 50 villas in Maldives. In addition, the company owns 52 retail shops at the Roxy Square Shopping Centre in Singapore. Roxy-Pacific Holdings Limited was founded in 1967 and is based in Singapore. Roxy-Pacific Holdings Limited is a subsidiary of Kian Lam Investment Pte Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "428769",
        "website": "http://www.roxypacific.com.sg",
        "full_time_employees": 243
    },
    "ER0.SI": {
        "short_name": "KSH",
        "long_name": "KSH Holdings Limited",
        "summary": "KSH Holdings Limited, an investment holding company, operates as a construction builder and contractor for public and private sectors. The company operates through Construction, and Property Development and Management segments. It constructs residential, commercial, hospitality, and mixed-use development projects; and rents and sells properties. The company also operates approximately 13 hotels. It operates in Singapore, the People's Republic of China, Malaysia, Japan, Australia, and the United Kingdom. KSH Holdings Limited was incorporated in 1979 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "758108",
        "website": "http://www.kimsengheng.com",
        "full_time_employees": null
    },
    "F17.SI": {
        "short_name": "GuocoLand",
        "long_name": "GuocoLand Limited",
        "summary": "GuocoLand Limited, an investment holding company, invests, develops, and manages various properties. It operates through GuocoLand Singapore, GuocoLand China, GuocoLand Malaysia, GuocoLand Vietnam, and Others segments. The company develops residential, hospitality, commercial, retail, mixed-use, and integrated properties; rents properties; and operates and manages hotels. It also offers management, marketing, and maintenance services. The company was formerly known as First Capital Corporation Ltd. and changed its name to GuocoLand Limited in November 2002. GuocoLand Limited was incorporated in 1976 and is headquartered in Singapore. GuocoLand Limited is a subsidiary of GuocoLand Assets Pte. Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "078881",
        "website": "http://www.guocoland.com.sg",
        "full_time_employees": null
    },
    "F1E.SI": {
        "short_name": "Low Keng Huat",
        "long_name": "Low Keng Huat (Singapore) Limited",
        "summary": "Low Keng Huat (Singapore) Limited, an investment holding company, engages in the property development, hotels, and investment activities in Singapore, Malaysia, China, Australia, and internationally. It develops and sells properties; invests in properties, and shares in quoted and unquoted equities. The company is also involved in the ownership and operation of deluxe hotel under the Duxton Hotel brand in Perth; and other hospitality-related business, such as food and beverage business under the Carnivore brand, as well as in the ownership and operation of restaurants. In addition, it engages in the property fund management business. The company was founded in 1969 and is based in Singapore. Low Keng Huat (Singapore) Limited is a subsidiary of Consistent Record Sdn. Bhd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "449269",
        "website": "http://www.lkhs.com.sg",
        "full_time_employees": null
    },
    "F31.SI": {
        "short_name": "Fragrance",
        "long_name": "Fragrance Group Limited",
        "summary": "Fragrance Group Limited, an investment holding company, operates as a property developer in Singapore, Australia, and the United Kingdom. The company operates through Property Development, Commercial Investment, Hotel Operations, and Hospitality Investment segments. The Property Development segment develops and sells residential and commercial properties. The Commercial Investment segment is involved in the investment and rental of properties. The Hotel Operations segment manages hotels. The Hospitality Investment segment leases hotels to operators. The company also develops, deals, and trades in properties. Fragrance Group Limited was incorporated in 2000 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "119962",
        "website": "http://www.fragrancegroup.com.sg",
        "full_time_employees": 1
    },
    "F86.SI": {
        "short_name": "MYP",
        "long_name": "MYP Ltd.",
        "summary": "MYP Ltd., an investment holding company, invests in real estate properties in Singapore. Its property portfolio includes commercial buildings and residential properties. The company was formerly known as Cougar Logistics Corporation Ltd. and changed its name to MYP Ltd. in December 2012. MYP Ltd. was incorporated in 2005 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "049910",
        "website": "http://www.myp.com.sg",
        "full_time_employees": null
    },
    "FESNF": {
        "short_name": "FIRST REIT",
        "long_name": "First Real Estate Investment Trust",
        "summary": "First Real Estate Investment Trust (Â\u0093First REITÂ\u0094) is a real estate investment trust constituted by the Trust Deed entered into on 19 October 2006 between First REIT Management Limited (formerly Bowsprit Capital Corporation Limited) as the Manager and HSBC Institutional Trust Services (Singapore) Limited as the Trustee. First REIT was listed on the Singapore Exchange Securities Trading Limited on 11 December 2006. On 1 March 2018, HSBC Institutional Trust Services (Singapore) Limited retired as the Trustee of First REIT in favour of Perpetual (Asia) Limited. First REIT is Singapore's first healthcare real estate investment trust that aims to invest in a diversified portfolio of income-producing real estate and / or real estate-related assets in Asia that are primarily used for healthcare and / or healthcare-related purposes. Managed by First REIT Management Limited,, First REIT's portfolio consists of 20 properties located in Indonesia, Singapore and South Korea, namely 1) Siloam Hospitals Lippo Village, 2) Siloam Hospitals Kebon Jeruk, 3) Siloam Hospitals Surabaya, 4) Imperial Aryaduta Hotel & Country Club, 5) Mochtar Riady Comprehensive Cancer Centre, 6) Siloam Hospitals Lippo Cikarang, 7) Siloam Hospitals Manado & Hotel Aryaduta Manado, 8) Siloam Hospitals Makassar, 9) Siloam Hospitals Bali, 10) Siloam Hospitals TB Simatupang, 11) Siloam Hospitals Purwakarta, 12) Siloam Sriwijaya, 13) Siloam Hospitals Kupang & Lippo Plaza Kupang, 14) Siloam Hospitals Labuan Bajo, 15) Siloam Hospitals Buton & Lippo Plaza Buton, 16) Siloam Hospitals Yogyakarta, 17) Pacific Healthcare Nursing Home @ Bukit Merah, 18) Pacific Healthcare Nursing Home II @ Bukit Panjang, 19) The Lentor Residence and 20) Sarang Hospital. Its hospital assets in Indonesia are operated by PT Siloam International Hospitals Tbk, a subsidiary of PT Lippo Karawaci Tbk, a strong brand name in the Indonesian healthcare industry supported by a team of international healthcare professionals whereas The Imperial Aryaduta Hotel & Country Club and Hotel Aryaduta Manado are operated by The Aryaduta Hotel and Resort Group. The Lippo Plaza Kupang and Lippo Plaza Buton are managed by PT Lippo Malls Indonesia. In Singapore, the nursing homes at Bukit Merah and Bukit Panjang are operated by Pacific Healthcare Nursing Home Pte. Ltd. and Pacific Eldercare and Nursing Pte. Ltd., respectively. The Lentor Residence is operated by The Lentor Residence Pte. Ltd. In South Korea, the Sarang Hospital is operated by a private doctor. Through First REIT, investors can participate in an asset class that has a focus towards Asia's growing healthcare sector, which is boosted by an increase in life expectancy in Indonesia and the rest of Southeast Asia.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Healthcare Facilities",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "49321",
        "website": "http://www.first-reit.com",
        "full_time_employees": null
    },
    "FRZCF": {
        "short_name": "FRASERS CENTREPOINT TRUST",
        "long_name": "Frasers Centrepoint Trust",
        "summary": "Frasers Centrepoint Trust (Â\u0093FCTÂ\u0094) is a leading developer-sponsored retail real estate investment trust (Â\u0093REITÂ\u0094) and one of the largest suburban retail mall owners in Singapore with total assets of approximately S$6.7 billion. FCT's current property portfolio comprises 11 retail malls9 and an office building located in the suburban regions of Singapore, near homes and within minutes to transportation amenities. The retail portfolio has over 2.3 million square feet of net lettable area with over 1,500 leases with a strong focus on providing for necessity spending, food & beverage and essential services. The portfolio comprises Causeway Point, Northpoint City North Wing (including Yishun 10 Retail Podium), Anchorpoint, YewTee Point, Changi City Point, Waterway Point (40%-interest), Tiong Bahru Plaza, White Sands, Hougang Mall, Century Square and Tampines 1) and an office property (Central Plaza). FCT's malls enjoy stable and recurring shopper footfall supported by commuter traffic and residential population in the catchment. FCT also holds a 31.15% stake in Hektar Real Estate Investment Trust, a retail-focused REIT in Malaysia listed on the Main Market of Bursa Malaysia Securities Berhad. FCT is index constituent of several benchmark indices including the FTSE EPRA/NAREIT Global Real Estate Index Series (Global Developed Index), FTSE ST Real Estate investment Trust Index, MSCI Singapore Small Cap Index and the SGX iEdge S-REIT Leaders Index. Listed on the Main Board of the Singapore Exchange Securities Trading Limited since 5 July 2006, FCT is managed by Frasers Centrepoint Asset Management Ltd., a real estate management company and a wholly-owned subsidiary of Frasers Property Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "119958",
        "website": "http://www.frasersproperty.com/reits/fct",
        "full_time_employees": null
    },
    "FS8.MU": {
        "short_name": "GUOCOLAND LTD.  SD 1",
        "long_name": "GuocoLand Limited",
        "summary": "GuocoLand Limited, an investment holding company, invests, develops, and manages various properties. It operates through GuocoLand Singapore, GuocoLand China, GuocoLand Malaysia, GuocoLand Vietnam, and Others segments. The company develops residential, hospitality, commercial, retail, mixed-use, and integrated properties; rents properties; and operates and manages hotels. It also offers management, marketing, and maintenance services. The company was formerly known as First Capital Corporation Ltd. and changed its name to GuocoLand Limited in November 2002. GuocoLand Limited was incorporated in 1976 and is headquartered in Singapore. GuocoLand Limited is a subsidiary of GuocoLand Assets Pte. Ltd.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "078881",
        "website": "http://www.guocoland.com.sg",
        "full_time_employees": null
    },
    "FSRPF": {
        "short_name": "FRASERS PROPERTY LIMITED",
        "long_name": "Frasers Property Limited",
        "summary": "Frasers Property Limited, an investment holding company, owns, develops, and manages an integrated portfolio of properties. The company's asset portfolio includes business parks; and residential, retail, commercial, and industrial and logistics properties in Australia, Europe, China, and Southeast Asia. It owns and/or operates serviced apartments and hotels in approximately 70 cities across Asia, Australia, Europe, the Middle East, and Africa. The company also acts as a sponsor of two real estate investment trusts (REITs) listed on the SGX-ST that comprises Frasers Centrepoint Trust, and Frasers Logistics & Commercial Trust focused on retail, commercial, and industrial properties; and one stapled trust listed on the SGX-ST that include Frasers Hospitality Trust focused on hospitality properties; and two REITs listed on the Stock Exchange of Thailand, which include Frasers Property (Thailand) Public Company Limited, a sponsor of Frasers Property Thailand Industrial Freehold & Leasehold REIT that focuses on industrial and logistics properties in Thailand, as well as Golden Ventures Leasehold Real Estate Investment Trust, which focuses on commercial properties. The company was formerly known as Frasers Centrepoint Limited and changed its name to Frasers Property Limited in February 2018. Frasers Property Limited was incorporated in 1963 and is headquartered in Singapore.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "119958",
        "website": "http://www.frasersproperty.com",
        "full_time_employees": 5664
    },
    "GPS.AX": {
        "short_name": "GPS FPO",
        "long_name": "GPS Alliance Holdings Limited",
        "summary": "GPS Alliance Holdings Limited provides real estate agency services in Singapore. It operates through the divisions Real Estate Agency Business, Property Development and Investment Business, and Home Solutions Business. The company offers various real estate services, including corporate leasing services, investment sales, commercial and industrial sales, en-bloc sales, full-time sales, training and seminars, and local and international project sales. It also provides consultancy services to investors and property developers; marketing and sales services; and property management services. Further, the company offers interior design and fit-out works, including kitchen and wardrobe cabinetry, partition work, and installation of false ceilings and fire doors. The company was founded in 2010 and is based in Singapore.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "629175",
        "website": "http://www.gpsalliance.com.au",
        "full_time_employees": null
    },
    "H13.SI": {
        "short_name": "Ho Bee Land",
        "long_name": "Ho Bee Land Limited",
        "summary": "Ho Bee Land Limited was listed on the Mainboard of the Singapore Exchange in 1999. Headquartered in Singapore, Ho Bee also has property investments and developments in Australia, China, United Kingdom and Europe. The real estate development and investment company has a portfolio that covers many quality residential, commercial and high-tech industrial projects since its establishment in 1987. In Singapore, apart from being the leading developer of luxury homes in the exclusive residential enclave of Sentosa Cove, its portfolio of investment properties includes the commercial landmark in the one-north precinct, The Metropolis. Other buildings in its portfolio of overseas investment properties include Ropemaker Place, 1 St Martin's Le Grand, 60 St Martin's Lane, 39 Victoria Street, 110 Park Street, Apollo & Lunar House and 67 Lombard Street in London.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "138588",
        "website": "http://hobee.com",
        "full_time_employees": null
    },
    "H19.SI": {
        "short_name": "Hwa Hong",
        "long_name": "Hwa Hong Corporation Limited",
        "summary": "Hwa Hong Corporation Limited, an investment holding company, engages in the investment, development, and rental of properties in Singapore and the United Kingdom. It operates in three segments: Rental, Investments, and Corporate and Others. The company is involved in the leasing of residential and commercial properties; provision of real estate investment advisory services; and ownership of warehouse for rental and storage, as well as packing and trading of edible oils. It also provides business management and consultancy services. The company was formerly known as Hwa Hong Manufacturing Company Limited and changed its name to Hwa Hong Corporation Limited in January 1985. Hwa Hong Corporation Limited was incorporated in 1952 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "058672",
        "website": "http://www.hwahongcorp.com",
        "full_time_employees": null
    },
    "H30.SI": {
        "short_name": "Hong Fok",
        "long_name": "Hong Fok Corporation Limited",
        "summary": "Hong Fok Corporation Limited, an investment holding company, engages in the investment, construction, development, and management of properties in Singapore and Hong Kong. The company develops residential and other properties; invests in office, shop, restaurant, retail, residential, and commercial properties; and provides property maintenance services. It also offers investment trading and investment management services. The company was incorporated in 1967 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "199555",
        "website": "http://www.hongfok.com.sg",
        "full_time_employees": null
    },
    "H8U.SG": {
        "short_name": "Ho Bee Land Ltd. Registered Sha",
        "long_name": "Ho Bee Land Limited",
        "summary": "Ho Bee Land Limited was listed on the Mainboard of the Singapore Exchange in 1999. Headquartered in Singapore, Ho Bee also has property investments and developments in Australia, China, United Kingdom and Europe. The real estate development and investment company has a portfolio that covers many quality residential, commercial and high-tech industrial projects since its establishment in 1987. In Singapore, apart from being the leading developer of luxury homes in the exclusive residential enclave of Sentosa Cove, its portfolio of investment properties includes the commercial landmark in the one-north precinct, The Metropolis. Other buildings in its portfolio of overseas investment properties include Ropemaker Place, 1 St Martin's Le Grand, 60 St Martin's Lane, 39 Victoria Street, 110 Park Street, Apollo & Lunar House and 67 Lombard Street in London.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "138588",
        "website": "http://hobee.com",
        "full_time_employees": null
    },
    "HMN.SI": {
        "short_name": "Ascott Trust",
        "long_name": "Ascott Residence Trust",
        "summary": "Ascott Residence Trust (ART) is the largest hospitality trust in Asia Pacific with an asset value of S$7.2 billion as at 31 December 2020. Having listed on the Singapore Exchange Securities Trading Limited (SGX-ST) since March 2006, ART's objective is to invest primarily in incomeproducing real estate and real estate-related assets which are used or predominantly used as serviced residences, hotels, rental housing properties and other hospitality assets in any country in the world. Ascott Real Estate Investment Trust's investment mandate will include student accommodation to be effected on 27 February 2021. ART is a constituent of the FTSE EPRA Nareit Global Real Estate Index Series (Global Developed Index). ART's international portfolio comprises 86 properties with more than 16,000 units in 38 cities across 15 countries in Asia Pacific, Europe and the United States of America as at 31 December 2020. ART's properties are mostly operated under the Ascott The Residence, Somerset, Quest and Citadines brands. They are mainly located in key gateway cities such as Barcelona, Berlin, Brussels, Hanoi, Ho Chi Minh City, Jakarta, Kuala Lumpur, London, Manila, Melbourne, Munich, New York, Paris, Perth, Seoul, Shanghai, Singapore and Tokyo. ART is a stapled group comprising Ascott Real Estate Investment Trust (Ascott Reit) and Ascott Business Trust (Ascott BT). ART is managed by Ascott Residence Trust Management Limited (as manager of Ascott Reit) and Ascott Business Trust Management Pte. Ltd. (as trustee-manager of Ascott BT), both of which are wholly-owned subsidiaries of Singapore-listed CapitaLand Limited, one of Asia's largest diversified real estate groups.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068912",
        "website": "http://www.ascottreit.com",
        "full_time_employees": null
    },
    "IPEN.F": {
        "short_name": "IPC CORP. -LOC.-",
        "long_name": "IPC Corporation Ltd",
        "summary": "IPC Corporation Ltd, an investment holding company, engages in property development and investment activities in Singapore and the People's Republic of China. It invests in and resells properties; and provides property consulting services. The company also provides hospitality services; and sells and distributes telecommunication products, and computer system boards and peripheral products. In addition, it offers hotel and club management services. IPC Corporation Ltd was incorporated in 1985 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "535224",
        "website": "http://www.ipc.com.sg",
        "full_time_employees": null
    },
    "J69U.SI": {
        "short_name": "FRASERS CENTREPOINT TRUST",
        "long_name": "Frasers Centrepoint Trust",
        "summary": "Frasers Centrepoint Trust (Â\u0093FCTÂ\u0094) is a leading developer-sponsored retail real estate investment trust (Â\u0093REITÂ\u0094) and one of the largest suburban retail mall owners in Singapore with total assets of approximately S$6.7 billion. FCT's current property portfolio comprises 11 retail malls9 and an office building located in the suburban regions of Singapore, near homes and within minutes to transportation amenities. The retail portfolio has over 2.3 million square feet of net lettable area with over 1,500 leases with a strong focus on providing for necessity spending, food & beverage and essential services. The portfolio comprises Causeway Point, Northpoint City North Wing (including Yishun 10 Retail Podium), Anchorpoint, YewTee Point, Changi City Point, Waterway Point (40%-interest), Tiong Bahru Plaza, White Sands, Hougang Mall, Century Square and Tampines 1) and an office property (Central Plaza). FCT's malls enjoy stable and recurring shopper footfall supported by commuter traffic and residential population in the catchment. FCT also holds a 31.15% stake in Hektar Real Estate Investment Trust, a retail-focused REIT in Malaysia listed on the Main Market of Bursa Malaysia Securities Berhad. FCT is index constituent of several benchmark indices including the FTSE EPRA/NAREIT Global Real Estate Index Series (Global Developed Index), FTSE ST Real Estate investment Trust Index, MSCI Singapore Small Cap Index and the SGX iEdge S-REIT Leaders Index. Listed on the Main Board of the Singapore Exchange Securities Trading Limited since 5 July 2006, FCT is managed by Frasers Centrepoint Asset Management Ltd., a real estate management company and a wholly-owned subsidiary of Frasers Property Limited.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "119958",
        "website": "http://www.frasersproperty.com/reits/fct",
        "full_time_employees": null
    },
    "J85.SI": {
        "short_name": "CDL HTrust",
        "long_name": "CDL Hospitality Trusts",
        "summary": "CDL Hospitality Trusts (Â\u0093CDLHTÂ\u0094) is one of Asia's leading hospitality trusts with assets under management of about S$2.9 billion as at 31 December 2020. CDLHT is a stapled group comprising CDL Hospitality Real Estate Investment Trust (Â\u0093H-REITÂ\u0094), a real estate investment trust, and CDL Hospitality Business Trust (Â\u0093HBTÂ\u0094), a business trust. CDLHT was listed on the Singapore Exchange Securities Trading Limited on 19 July 2006. M&C REIT Management Limited is the manager of H-REIT, the first hotel real estate investment trust in Singapore, and M&C Business Trust Management Limited is the trustee-manager of HBT.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Hotel & Motel",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "169662",
        "website": "http://www.cdlht.com",
        "full_time_employees": 1541
    },
    "J91U.SI": {
        "short_name": "ESR-REIT",
        "long_name": "ESR-REIT",
        "summary": "ESR-REIT has been listed on the Singapore Exchange Securities Trading Limited since 25 July 2006. ESR-REIT invests in quality income-producing industrial properties and as at 31 December 2020 holds interest in a diversified portfolio of 57 properties located across Singapore, with a total gross floor area of approximately 15.1 million square feet and an aggregate property value of S$3.1 billion6. The properties are in the following business sectors: Business Park, High-Specs Industrial, Logistics/Warehouse and General Industrial, and are located close to major transportation hubs and key industrial zones island-wide.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "048946",
        "website": "http://www.esr-reit.com.sg",
        "full_time_employees": null
    },
    "JYEU.SI": {
        "short_name": "Lendlease Reit",
        "long_name": "Lendlease Global Commercial REIT",
        "summary": "Listed on 2 October 2019, Lendlease Global Commercial REIT (Â\u0093LREITÂ\u0094) is established with the principal investment strategy of investing, directly or indirectly, in a diversified portfolio of stabilised income-producing real estate assets located globally, which are used primarily for retail and/or office purposes. Its initial portfolio comprises a leasehold interest in, 313@somerset, a retail property located in Singapore and a freehold interest in Sky Complex, which comprises three office buildings located in Milan. The portfolio has a total net lettable area of approximately 1.3 million square feet, with an appraised value of S$1.4 billion as at 30 June 2020. LREIT is managed by Lendlease Global Commercial Trust Management Pte. Ltd., an indirect wholly-owned subsidiary of Lendlease. Its key objectives are to provide Unitholders with regular and stable distributions, achieve long-term growth in distribution per unit and net asset value per unit, and maintain an appropriate capital structure.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "437161",
        "website": "http://www.lendleaseglobalcommercialreit.com",
        "full_time_employees": 47
    },
    "K2LU.SI": {
        "short_name": "ARA LOGOS Log Tr",
        "long_name": "ARA LOGOS Logistics Trust",
        "summary": "Listed on the Singapore Exchange on 12 April 2010, ARA LOGOS Logistics Trust (Â\u0093ALOGÂ\u0094) is a real estate investment trust (Â\u0093REITÂ\u0094) that invests in quality income-producing industrial real estate used for logistics purposes, as well as real estate-related assets in the Asia Pacific. ALOG is managed by ARA LOGOS Logistics Trust Management Limited. As at 31 December 2020, ALOG's portfolio comprises 27 high quality logistics warehouse properties strategically located in established logistics clusters in Singapore and Australia. The portfolio has a total gross floor area of approximately 9.0 million square feet valued at approximately S$1.28 billion.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "038985",
        "website": "http://www.aralogos-reit.com",
        "full_time_employees": null
    },
    "K71U.SI": {
        "short_name": "Keppel Reit",
        "long_name": "Keppel REIT",
        "summary": "Listed by way of an introduction on 28 April 2006, Keppel REIT is one of Asia's leading REITs with a portfolio of Grade A commercial assets in key business districts pan-Asia. Keppel REIT's objective is to generate stable income and long-term growth for Unitholders by owning and investing in a portfolio of quality income-producing commercial real estate and real estate-related assets in Singapore and pan-Asia. The REIT has assets under management of over $8 billion in Singapore, key Australian cities of Sydney, Melbourne, Brisbane and Perth, as well as Seoul, South Korea. Keppel REIT is sponsored by Keppel Land Limited, one of Asia's leading property companies. It is managed by Keppel REIT Management Limited, a wholly-owned subsidiary of Keppel Capital Holdings Pte Ltd (Keppel Capital). Keppel Capital is a premier asset manager in Asia with a diversified portfolio in real estate, infrastructure and data centre properties in key global markets.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "098632",
        "website": "http://www.keppelreit.com",
        "full_time_employees": 23
    },
    "KLO.AX": {
        "short_name": "KINGSLAND CDI 1:1",
        "long_name": "Kingsland Global Ltd.",
        "summary": "Kingsland Global Ltd. engages in the real estate development and related activities in Cambodia and Malaysia. It also provides business and management consultancy services. The company was founded in 1978 and is based in Singapore.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "628718",
        "website": "http://www.kingslandglobal.sg",
        "full_time_employees": null
    },
    "KREVF": {
        "short_name": "KEPPEL REIT",
        "long_name": "Keppel REIT",
        "summary": "Listed by way of an introduction on 28 April 2006, Keppel REIT is one of Asia's leading REITs with a portfolio of Grade A commercial assets in key business districts pan-Asia. Keppel REIT's objective is to generate stable income and long-term growth for Unitholders by owning and investing in a portfolio of quality income-producing commercial real estate and real estate-related assets in Singapore and pan-Asia. The REIT has assets under management of over $8 billion in Singapore, key Australian cities of Sydney, Melbourne, Brisbane and Perth, as well as Seoul, South Korea. Keppel REIT is sponsored by Keppel Land Limited, one of Asia's leading property companies. It is managed by Keppel REIT Management Limited, a wholly-owned subsidiary of Keppel Capital Holdings Pte Ltd (Keppel Capital). Keppel Capital is a premier asset manager in Asia with a diversified portfolio in real estate, infrastructure and data centre properties in key global markets.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "098632",
        "website": "http://www.keppelreit.com",
        "full_time_employees": 23
    },
    "LJ3.SI": {
        "short_name": "OUE",
        "long_name": "OUE Limited",
        "summary": "OUE Limited, an investment holding company, develops, owns, and operates various real estate properties in Singapore, the People's Republic of China, the United States, Japan, and internationally. The company operates through Property Investments, Hospitality, Property Development, Healthcare, and Consumer segments. It develops and manages assets across the commercial, hospitality, retail, residential, and healthcare sectors. The company also engages in the rental of investment properties; development and sale of residential and other properties; operation of hotels; provision of hotel management services; management of real estate investment trusts; and operation of food and beverage outlets. In addition, it develops medical real estate, healthcare-related assets, and integrated mixed-use developments; provides healthcare services; and management of healthcare investments trusts. Further, the company is involved in the restaurant and investment trading operations; and operation and management of healthcare facilities, including hospitals, clinics, and nursing homes. The company was formerly known as Overseas Union Enterprise Limited and changed its name to OUE Limited in August 2013. The company was incorporated in 1964 and is headquartered in Singapore. OUE Limited is a subsidiary of OUE Realty Pte. Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "049321",
        "website": "http://www.oue.com.sg",
        "full_time_employees": 930
    },
    "LPMDF": {
        "short_name": "LIPPO MALLS INDONESIA RETAIL TR",
        "long_name": "Lippo Malls Indonesia Retail Trust",
        "summary": "LMIR Trust is a Singapore-based real estate investment trust established with the principal investment objective of owning and investing, on a long-term basis, in a diversified portfolio of income-producing real estate in Indonesia that are primarily used for retail and/or retail-related purposes. LMIR Trust's current asset portfolio comprises 21 retail malls (Â\u0093Retail MallsÂ\u0094) and seven retail spaces located within other retail malls (Â\u0093Retail SpacesÂ\u0094, and collectively with the Retail Malls, the Â\u0093PropertiesÂ\u0094). The Properties have a total net lettable area of 839,907 square metres and total valuation of Rp15,716.1 billion as at 31 July 2020, and are strategically located in major cities of Indonesia with large middle-income population. Tenants include leading names such as Matahari Department Store, Zara, M&S, H&M, Sogo, Giant, Hypermart, Carrefour, Ace Hardware, as well as international specialty tenants such as Victoria's Secret, Promod, McDonalds, Pizza Hut, Kentucky Fried Chicken, A&W, Fitness First and Starbucks.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068809",
        "website": "http://www.lmir-trust.com",
        "full_time_employees": null
    },
    "M1GU.SI": {
        "short_name": "Sabana Reit",
        "long_name": "Sabana Shari'ah Compliant Industrial Real Estate Investment Trust",
        "summary": "Sabana REIT was listed on the SGX-ST on 26 November 2010. It was established principally to invest in income-producing real estate used for industrial purposes, as well as real estate-related assets, in line with Shari'ah investment principles. As at 30 June 2020, Sabana REIT has a diversified portfolio of 18 properties in Singapore, in the high-tech industrial, warehouse and logistics, chemical warehouse and logistics, as well as general industrial sectors. The total assets of the Group amount to approximately S$0.9 billion as at 30 June 2020. Sabana REIT is listed in several indices within the SGX S-REIT Index, Morgan Stanley Capital International, Inc (MSCI) Index and FTSE index. Sabana REIT is one of the constituents of the FTSE ST Singapore Shariah Index. Sabana REIT is managed by Sabana Real Estate Investment Management Pte. Ltd. (in its capacity as the Manager of Sabana REIT) in accordance with the terms of the trust deed dated 29 October 2010 (as amended). Sabana REIT is a real estate investment trust constituted on 29 October 2010 under the laws of Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "556741",
        "website": "http://www.sabana-reit.com",
        "full_time_employees": null
    },
    "M44U.SI": {
        "short_name": "Mapletree Log Tr",
        "long_name": "Mapletree Logistics Trust",
        "summary": "MLT, the first Asia-focused logistics REIT in Singapore, was listed on the SGX-ST main board on 28 July 2005. MLT's principal strategy is to invest in a diversified portfolio of income-producing logistics real estate and real estate-related assets. As at 31 December 2020, it has a portfolio of 156 logistics assets in Singapore, Hong Kong SAR, Japan, China, Australia, Malaysia, South Korea and Vietnam with assets under management of S$10.2 billion. MLT is managed by Mapletree Logistics Trust Management Ltd., a wholly-owned subsidiary of Mapletree Investments Pte Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "049320",
        "website": "http://www.mapletreelogisticstrust.com",
        "full_time_employees": null
    },
    "MAPIF": {
        "short_name": "MAPLETREE INDUSTRIAL TRUST",
        "long_name": "Mapletree Industrial Trust",
        "summary": "Mapletree Industrial Trust is a real estate investment trust (Â\u0093REITÂ\u0094) listed on the Main Board of Singapore Exchange. Its principal investment strategy is to invest in a diversified portfolio of income-producing real estate used primarily for industrial purposes in Singapore and income-producing real estate used primarily as data centres worldwide beyond Singapore, as well as real estate-related assets. As at 30 September 2020, MIT's total assets under management was S$6.6 billion, which comprised 84 properties in Singapore and 27 properties in North America (including 13 data centres held through the joint venture with Mapletree Investments Pte Ltd). MIT's property portfolio include Data Centres, Hi-Tech Buildings, Business Park Buildings, Flatted Factories, Stack-up/Ramp-up Buildings and Light Industrial Buildings. MIT is managed by Mapletree Industrial Trust Management Ltd. and sponsored by Mapletree Investments Pte Ltd.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "117438",
        "website": "http://www.mapletreeindustrialtrust.com",
        "full_time_employees": null
    },
    "ME8U.SI": {
        "short_name": "Mapletree Ind Tr",
        "long_name": "Mapletree Industrial Trust",
        "summary": "Mapletree Industrial Trust is a real estate investment trust (Â\u0093REITÂ\u0094) listed on the Main Board of Singapore Exchange. Its principal investment strategy is to invest in a diversified portfolio of income-producing real estate used primarily for industrial purposes in Singapore and income-producing real estate used primarily as data centres worldwide beyond Singapore, as well as real estate-related assets. As at 30 September 2020, MIT's total assets under management was S$6.6 billion, which comprised 84 properties in Singapore and 27 properties in North America (including 13 data centres held through the joint venture with Mapletree Investments Pte Ltd). MIT's property portfolio include Data Centres, Hi-Tech Buildings, Business Park Buildings, Flatted Factories, Stack-up/Ramp-up Buildings and Light Industrial Buildings. MIT is managed by Mapletree Industrial Trust Management Ltd. and sponsored by Mapletree Investments Pte Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "117438",
        "website": "http://www.mapletreeindustrialtrust.com",
        "full_time_employees": null
    },
    "MPCMF": {
        "short_name": "MAPLETREE COMMERCIAL TRUST TREA",
        "long_name": "Mapletree Commercial Trust",
        "summary": "Mapletree Commercial Trust is a Singapore-focused real estate investment trust (Â\u0093REITÂ\u0094) that invests on a long-term basis, directly or indirectly, in a diversified portfolio of income-producing real estate used primarily for office and/or retail purposes, whether wholly or partially, in Singapore, as well as real estate related assets. MCT's portfolio comprises VivoCity, MBC, PSA Building, Mapletree Anson and MLHF. These five assets have a total NLA of 5.0 million square feet with a total value of S$8.7 billion.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "117438",
        "website": "http://www.mapletreecommercialtrust.com",
        "full_time_employees": null
    },
    "MXNU.SI": {
        "short_name": "EliteComREIT GBP",
        "long_name": "Elite Commercial REIT",
        "summary": "Elite Commercial REIT operates as a real estate investment trust. The company primarily invests in commercial assets and real estate-related assets in the United Kingdom. Its investment properties comprise 96 freehold and 1 leasehold offices situated in England, Scotland, and Wales, which are primarily let to the UK Government. The company qualifies as a real estate investment trust for federal income tax purposes. Elite Commercial REIT Management Pte. Ltd. operates as the manager of Elite Commercial REIT. Elite Commercial REIT was founded in 2018 and is based in Singapore.",
        "currency": "GBP",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "038989",
        "website": "http://www.elitecreit.com",
        "full_time_employees": 72186
    },
    "N2IU.SI": {
        "short_name": "Mapletree Com Tr",
        "long_name": "Mapletree Commercial Trust",
        "summary": "Mapletree Commercial Trust is a Singapore-focused real estate investment trust (Â\u0093REITÂ\u0094) that invests on a long-term basis, directly or indirectly, in a diversified portfolio of income-producing real estate used primarily for office and/or retail purposes, whether wholly or partially, in Singapore, as well as real estate related assets. MCT's portfolio comprises VivoCity, MBC, PSA Building, Mapletree Anson and MLHF. These five assets have a total NLA of 5.0 million square feet with a total value of S$8.7 billion.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "117438",
        "website": "http://www.mapletreecommercialtrust.com",
        "full_time_employees": null
    },
    "O10.SI": {
        "short_name": "Far East Orchard",
        "long_name": "Far East Orchard Limited",
        "summary": "Far East Orchard Limited, an investment holding company, engages in the property development and investment activities in Singapore, Australia, New Zealand, the United Kingdom, and internationally. It primarily develops residential, commercial, hospitality, and purpose-built student accommodation properties. The company also owns and operates hospitality assets, including hotels. In addition, its portfolio includes medical suites in Novena Medical Center and Novena Specialist Center. The company was formerly known as Orchard Parade Holdings Limited and changed its name to Far East Orchard Limited in July 2012. The company was founded in 1967 and is headquartered in Singapore. Far East Orchard Limited is a subsidiary of Far East Organization Pte. Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "247905",
        "website": "http://www.fareastorchard.com.sg",
        "full_time_employees": null
    },
    "O3B.F": {
        "short_name": "YOMA STRAT.HLDG.-LOC-SD 1",
        "long_name": "Yoma Strategic Holdings Ltd.",
        "summary": "Yoma Strategic Holdings Ltd., an investment holding company, engages in the real estate, automotive and heavy equipment, consumer, financial, and investment businesses in Singapore, Myanmar, and the People's Republic of China. The company's Real Estate Development segment develops and sells land and properties. Its Real Estate Services segment provides project management, design, and estate management services, as well as property leasing services and operates golf estate. The company's Automotive & Heavy Equipment segment supplies and sells agriculture and construction equipment, passenger and commercial vehicles, and related parts, as well as offers maintenance services. Its Consumer segment engages in the operation of restaurants; bottling and distribution of beverages; food wholesale business; and provision of logistics services. The company's Financial Services segment provides vehicle financing; and invests in mobile financial services. Its Investments segment invests in the infrastructure, tourism, power agricultural, and other sectors, as well as leases investment properties. The company also engages in leasing automotive equipment. The company was formerly known as Sea View Hotel Limited. Yoma Strategic Holdings Ltd. was incorporated in 1962 and is based in Singapore.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "239002",
        "website": "http://www.yomastrategic.com",
        "full_time_employees": 4300
    },
    "O5P.F": {
        "short_name": "FAR EAST ORCHA.-LOC-SD-50",
        "long_name": "Far East Orchard Limited",
        "summary": "Far East Orchard Limited, an investment holding company, engages in the property development and investment activities in Singapore, Australia, New Zealand, the United Kingdom, and internationally. It primarily develops residential, commercial, hospitality, and purpose-built student accommodation properties. The company also owns and operates hospitality assets, including hotels. In addition, its portfolio includes medical suites in Novena Medical Center and Novena Specialist Center. The company was formerly known as Orchard Parade Holdings Limited and changed its name to Far East Orchard Limited in July 2012. The company was founded in 1967 and is headquartered in Singapore. Far East Orchard Limited is a subsidiary of Far East Organization Pte. Ltd.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "247905",
        "website": "http://www.fareastorchard.com.sg",
        "full_time_employees": null
    },
    "O5RU.SI": {
        "short_name": "AIMS APAC Reit",
        "long_name": "AIMS APAC REIT",
        "summary": "Managed by the Manager, AA REIT was established with the principal investment objective of owning and investing in a diversified portfolio of income-producing industrial, logistics and business park real estate, located throughout the Asia Pacific region. The real estate assets are utilised for a variety of purposes, including but not limited to warehousing and distribution activities, business park activities and manufacturing activities. AA REIT's existing portfolio consists of 28 properties, of which 26 properties are located throughout Singapore, a property located in Gold Coast, Queensland, Australia and a 49.0% interest in one business park property, Optus Centre, which is located in Macquarie Park, New South Wales, Australia.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "049145",
        "website": "http://www.aimsapacreit.com",
        "full_time_employees": null
    },
    "ODBU.SI": {
        "short_name": "UtdHampshReitUSD",
        "long_name": "United Hampshire US Real Estate Investment Trust",
        "summary": "United Hampshire US REIT is a Singapore real estate investment trust established with the principal investment strategy of investing in a diversified portfolio of stabilised income-producing (i) grocery-anchored and necessity-based retail properties (Â\u0093Grocery & Necessity PropertiesÂ\u0094), and (ii) modern, climate-controlled self-storage facilities (Â\u0093Self-Storage PropertiesÂ\u0094), located in the U.S. The tenants targeted by United Hampshire US REIT are tenants resilient to the impact of e-commerce, including but not limited to restaurants, home improvement stores, fitness centers, warehouse clubs and other uses with strong omni-channel platforms.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "048624",
        "website": "http://www.uhreit.com",
        "full_time_employees": null
    },
    "OUE1.F": {
        "short_name": "OUE SD-.20",
        "long_name": "OUE Limited",
        "summary": "OUE Limited, an investment holding company, develops, owns, and operates various real estate properties in Singapore, the People's Republic of China, the United States, Japan, and internationally. The company operates through Property Investments, Hospitality, Property Development, Healthcare, and Consumer segments. It develops and manages assets across the commercial, hospitality, retail, residential, and healthcare sectors. The company also engages in the rental of investment properties; development and sale of residential and other properties; operation of hotels; provision of hotel management services; management of real estate investment trusts; and operation of food and beverage outlets. In addition, it develops medical real estate, healthcare-related assets, and integrated mixed-use developments; provides healthcare services; and management of healthcare investments trusts. Further, the company is involved in the restaurant and investment trading operations; and operation and management of healthcare facilities, including hospitals, clinics, and nursing homes. The company was formerly known as Overseas Union Enterprise Limited and changed its name to OUE Limited in August 2013. The company was incorporated in 1964 and is headquartered in Singapore. OUE Limited is a subsidiary of OUE Realty Pte. Ltd.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "049321",
        "website": "http://www.oue.com.sg",
        "full_time_employees": 930
    },
    "OXMU.SI": {
        "short_name": "Prime US ReitUSD",
        "long_name": "Prime US REIT",
        "summary": "Prime US REIT (Â\u0093PRIMEÂ\u0094) is a diversified Singapore real estate investment trust (\"REIT\") with a focus on stabilised income-producing office assets in the United States (\"U.S.\"). PRIME offers investors a unique exposure to a high-quality portfolio of 12 prime and freehold office properties, strategically located in ten primary markets in the U.S., with a total appraised value of US$1.42 billion. With a geographically diversified portfolio of strategically-located prime office assets in key U.S. office markets, PRIME is well-positioned to achieve its key objectives to provide Unitholders with regular and stable distributions through long-term growth in distributions per unit and net asset value per unit growth while maintaining an appropriate capital structure.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "048616",
        "website": "http://www.primeusreit.com",
        "full_time_employees": null
    },
    "OYY.SI": {
        "short_name": "PropNex",
        "long_name": "PropNex Limited",
        "summary": "PropNex Limited provides real estate services in Singapore and internationally. It operates through five segments: Real Estate Agency Services, Real Estate Project Marketing Services, Administrative Support Services, Property Management Services, and Training Services. The Real Estate Agency Services segment engages in the sale and lease of public and private residential and commercial/industrial properties, including housing and development board flats and executive condominiums, private condominiums, landed properties, retail shops, offices, and factories. The Real Estate Project Marketing Services is involved in the sale of new private residential development projects for third-party property developers. The Administrative Support Services provides space and other ancillary services. The Property Management segment offers property management, building diagnostics, and facility management solutions, including property, M&E and facility maintenance, communal and lifestyle services, security management, defects resolution, project management, absentee landlord management system, contractors' accreditation, and facility management system. The Training Services segment offers real estate related courses and training programs to salespersons. The company was founded in 1996 and is headquartered in Singapore. PropNex Limited is a subsidiary of P&N Holdings Pte. Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "310480",
        "website": "http://www.propnex.com",
        "full_time_employees": null
    },
    "P40U.SI": {
        "short_name": "StarhillGbl Reit",
        "long_name": "Starhill Global Real Estate Investment Trust",
        "summary": "Starhill Global REIT is a Singapore-based real estate investment trust investing primarily in real estate used for retail and office purposes, both in Singapore and overseas. Since its listing on the Mainboard of the Singapore Exchange Securities Trading Limited (the Â\u0093SGX-STÂ\u0094) on 20 September 2005, Starhill Global REIT has grown its initial portfolio from interests in two landmark properties on Orchard Road in Singapore to 10 properties in Singapore, Australia, Malaysia, China and Japan, valued at about S$2.9 billion. These comprise interests in Wisma Atria and Ngee Ann City on Orchard Road in Singapore, Myer Centre Adelaide, David Jones Building and Plaza Arcade in Adelaide and Perth, Australia, The Starhill and Lot 10 in Kuala Lumpur, Malaysia, a retail property in Chengdu, China and two properties in Tokyo, Japan. Starhill Global REIT remains focused on sourcing attractive property assets in Singapore and overseas, while driving organic growth from its existing portfolio, through proactive leasing efforts and creative asset enhancements. Starhill Global REIT is managed by an external manager, YTL Starhill Global REIT Management Limited, of which all of its shares are indirectly held by YTL Corporation Berhad.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "238874",
        "website": "http://www.starhillglobalreit.com",
        "full_time_employees": 30
    },
    "PLF.F": {
        "short_name": "CAPITALAND LTD  SD1",
        "long_name": "CapitaLand Limited",
        "summary": "CapitaLand Limited, together with its subsidiaries, develops, owns, leases, manages, and sells real estate properties in Singapore, rest of Asia, North America, Europe, the United Kingdom, and internationally. The company operates through CapitaLand Singapore & International, CapitaLand China, CapitaLand India, CapitaLand Lodging, and CapitaLand Financial segments. Its real estate portfolio includes commercial and retail properties; business parks; shopping malls; offices; homes; industrial and logistics properties; integrated and urban developments; and lodging and residential properties, as well as real estate investment trusts (REITs), business trusts, and private funds. The company also invests in real estate financial products and assets; and provides investment advisory and management services, as well as real estate asset management and investment management services. In addition, it offers management support and consultancy services. The company was formerly known as Pidemco Land Limited and changed its name to CapitaLand Limited in November 2000. CapitaLand Limited was incorporated in 1989 and is headquartered in Singapore. CapitaLand Limited is a subsidiary of CLA Real Estate Holdings Pte Ltd.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068912",
        "website": "http://www.capitaland.com",
        "full_time_employees": 10473
    },
    "Q5T.SI": {
        "short_name": "Far East HTrust",
        "long_name": "Far East Hospitality Trust",
        "summary": "Far East H-Trust is a Singapore-Focused Hotel and Serviced Residence Hospitality Trust listed on the Main Board of The Singapore Exchange Securities Trading Limited (Â\u0093SGX-STÂ\u0094). Comprising Far East Hospitality Real Estate Investment Trust (Â\u0093Far East H-REITÂ\u0094) and Far East Hospitality Business Trust (Â\u0093Far East H-BTÂ\u0094), Far East H-Trust was listed on the SGX-ST on 27 August 2012 and has a portfolio of 13 properties totaling 3,143 hotel rooms and serviced residence units valued at approximately S$2.65 billion as at 31 December 2019. Managed by FEO Hospitality Asset Management Pte. Ltd. and FEO Hospitality Trust Management Pte. Ltd. (collectively, the Â\u0093ManagersÂ\u0094) and sponsored by members of Far East Organization Group (the Â\u0093SponsorÂ\u0094), Far East H-Trust seeks to provide Stapled Securityholders with regular, stable and growing distributions on a quarterly basis. Far East H-Trust is listed on the FTSE ST Mid Cap Index.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "247905",
        "website": "http://www.fareasthospitalitytrust.com",
        "full_time_employees": null
    },
    "QK5.SG": {
        "short_name": "Chip Eng Seng Corp. Ltd. Regist",
        "long_name": "Chip Eng Seng Corporation Ltd",
        "summary": "Chip Eng Seng Corporation Ltd, an investment holding company, engages in the construction, property development and investment, and hospitality businesses primarily in Singapore, Australia, Malaysia, and Maldives. The company operates through Construction, Property Developments, Property Investments, Hospitality, and Corporate and Others segments. The company constructs public housing projects, condominiums, executive condominiums, modular buildings, and industrial and commercial projects; develops residential, commercial, and industrial properties, as well as manages development projects; and provides real estate management and consultancy services. It also leases investment properties, such as shophouses, office buildings, and industrial properties; operates hotels and island resort; and invests in marketable securities. In addition, the company acts as general building contractor; manufactures and trades in precast products; and provides general building engineering, financial, and treasury services. Further, the company operates Repton-brand pre-school center in Singapore. Chip Eng Seng Corporation Ltd was incorporated in 1998 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "169877",
        "website": "http://www.chipengseng.com.sg",
        "full_time_employees": 772
    },
    "RW0U.SI": {
        "short_name": "Mapletree NAC Tr",
        "long_name": "Mapletree North Asia Commercial Trust",
        "summary": "Listed on the Singapore Exchange Securities Trading Limited (\"SGX-ST\") on 7 March 2013, Mapletree North Asia Commercial Trust (\"MNACT\") is the first real estate investment trust (Â\u0093REITÂ\u0094) that offers investors the opportunity to invest in best-in-class commercial properties situated in prime locations in China, in Hong Kong SAR, in Japan and in South Korea.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "117438",
        "website": "http://www.mapletreenorthasiacommercialtrust.com",
        "full_time_employees": null
    },
    "S3N.SI": {
        "short_name": "OKH Global",
        "long_name": "OKH Global Ltd.",
        "summary": "OKH Global Ltd., an investment holding company, engages in the integrated property development activities primarily focusing on logistics and industrial properties in Singapore. It operates through Construction Contractor, Property Development, and Property Investment segments. The Construction Contractor segment provides general builder and construction contractor, as well as general engineering services; and sells construction materials. The Property Development segment develops industrial properties. The Property Investment segment leases investment properties. OKH Global Ltd. was founded in 1998 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "387383",
        "website": "http://www.okh.com.sg",
        "full_time_employees": null
    },
    "S9B.SI": {
        "short_name": "Amcorp Global",
        "long_name": "Amcorp Global Limited",
        "summary": "Amcorp Global Limited, an investment holding company, operates as a real estate developer and investor in Singapore, New Zealand, Australia, Vietnam, and Malaysia. The company operates through three segments: Property Development, Hotel Operations, and Investment Properties. It undertakes residential, commercial, and industrial property development projects; invests in properties, such as hotels in Australia; and provides short-term accommodation and industrial space for rent in New Zealand. The company was formerly known as TEE Land Limited and changed its name to Amcorp Global Limited in April 2020. Amcorp Global Limited was incorporated in 2012 and is based in Singapore. Amcorp Global Limited is a subsidiary of Amcorp Supreme Pte. Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "659591",
        "website": "http://www.teeland.com.sg",
        "full_time_employees": null
    },
    "SBBSF": {
        "short_name": "SABANA SHARI'AH COMPLIANT REIT",
        "long_name": "Sabana Shari'ah Compliant Industrial Real Estate Investment Trust",
        "summary": "Sabana REIT was listed on the SGX-ST on 26 November 2010. It was established principally to invest in income-producing real estate used for industrial purposes, as well as real estate-related assets, in line with Shari'ah investment principles. As at 30 June 2020, Sabana REIT has a diversified portfolio of 18 properties in Singapore, in the high-tech industrial, warehouse and logistics, chemical warehouse and logistics, as well as general industrial sectors. The total assets of the Group amount to approximately S$0.9 billion as at 30 June 2020. Sabana REIT is listed in several indices within the SGX S-REIT Index, Morgan Stanley Capital International, Inc (MSCI) Index and FTSE index. Sabana REIT is one of the constituents of the FTSE ST Singapore Shariah Index. Sabana REIT is managed by Sabana Real Estate Investment Management Pte. Ltd. (in its capacity as the Manager of Sabana REIT) in accordance with the terms of the trust deed dated 29 October 2010 (as amended). Sabana REIT is a real estate investment trust constituted on 29 October 2010 under the laws of Singapore.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "556741",
        "website": "http://www.sabana-reit.com",
        "full_time_employees": null
    },
    "SIB.SG": {
        "short_name": "Ying Li Intl Real Estate Ltd. R",
        "long_name": "Ying Li International Real Estate Limited",
        "summary": "Ying Li International Real Estate Limited, an investment holding company, engages in the development, sale, rental, management, and ownership of commercial and residential properties in Singapore, Hong Kong, and the People's Republic of China. It operates through Property Development and Property Investment segments. The company primarily develops office space, retail mall, car park, and other projects. It is also involved in the provision of property consulting, selling, marketing, management, and leasing services, as well as corporate management consultancy services; and purchase of construction material and equipment. The company was founded in 1993 and is headquartered in Singapore. Ying Li International Real Estate Limited is a subsidiary of State Alpha Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "38986",
        "website": "http://www.yingligj.com",
        "full_time_employees": null
    },
    "SK6U.SI": {
        "short_name": "SPHREIT",
        "long_name": "SPH REIT",
        "summary": "SPH REIT is a Singapore-based real estate investment trust established principally to invest in a portfolio of income-producing real estate primarily for retail purposes in Asia-Pacific, as well as real estate-related assets. SPH REIT has a portfolio of five assets in Singapore and Australia. Its portfolio of properties in Singapore comprises a 99-year leasehold interest in Paragon, a 99-year leasehold interest in The Clementi Mall and a 99-year leasehold interest in The Rail Mall. These Singapore properties have an aggregate net lettable area of approximately 960,000 sq. ft. In Australia, SPH REIT owns a 50% freehold interest in Westfield Marion Shopping Centre, the largest regional shopping centre in Adelaide, South Australia. SPH REIT also owns an 85% interest in Figtree Grove Shopping Centre, a freehold sub-regional shopping centre in Wollongong, New South Wales, Australia. Both Australian properties have an aggregate gross lettable area of approximately 1.7 million sq. ft.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "318994",
        "website": "http://www.sphreit.com.sg",
        "full_time_employees": null
    },
    "SURVF": {
        "short_name": "SUNTEC REAL ESTATE INVESTMENT T",
        "long_name": "Suntec Real Estate Investment Trust",
        "summary": "Listed on 9 December 2004, Suntec REIT holds properties in Suntec City, Singapore's largest integrated commercial development (including one of Singapore's largest shopping Mall), a 66.3% interest in Suntec Singapore Convention & Exhibition Centre, a one-third interest in One Raffles Quay, a one-third interest in Marina Bay Financial Centre Towers 1 and 2 and the Marina Bay Link Mall, and a 30.0% interest in 9 Penang Road. Suntec REIT holds a 100% interest in a commercial building located at 177 Pacific Highway, Sydney, a 100% interest in a commercial building located at 21 Harris Street, Pyrmont, Sydney, a 50.0% interest in Southgate Complex, Melbourne, a 50.0% interest in a commercial building located at Olderfleet 477 Collins Street, Melbourne and a 100% interest in a commercial building located at 55 Currie Street, Adelaide, Australia. Suntec REIT also holds a 50.0% interest in Nova Properties located in London, United Kingdom. Its aim is to invest in income-producing real estate which is primarily used for office and/or retail purposes. Suntec REIT is managed by an external manager, ARA Trust Management (Suntec) Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "038985",
        "website": "http://www.suntecreit.com",
        "full_time_employees": null
    },
    "SXTN.F": {
        "short_name": "SINGHAIYI GROUP",
        "long_name": "SingHaiyi Group Ltd.",
        "summary": "SingHaiyi Group Ltd., an investment holding company, develops, owns, and manages real estate properties in Singapore, Malaysia, Australia, and the United States. It operates through Property Development; and Property and Property Related Investment segments. The company develops and sells residential properties; owns and manages residential, commercial, retail, and other properties; and leases Tri-County Mall. It also provides property development advisory services. The company was formerly known as SingXpress Land Ltd. and changed its name to SingHaiyi Group Ltd. in March 2013. SingHaiyi Group Ltd. was incorporated in 1988 and is headquartered in Singapore. SingHaiyi Group Ltd. is a subsidiary of Haiyi Holdings Pte Ltd.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068809",
        "website": "http://www.singhaiyi.com",
        "full_time_employees": null
    },
    "T24.SI": {
        "short_name": "Tuan Sing",
        "long_name": "Tuan Sing Holdings Limited",
        "summary": "Tuan Sing Holdings Limited, an investment holding company, engages in the property development and investment, hotels investment, and industrial services businesses in Singapore, Australia, China, Malaysia, and Indonesia. The company's Property segment develops and invests in residential, commercial, and industrial properties; and provides property management services. Its Hotels Investment segment owns two five-star hotels managed by Hyatt International in Melbourne and Perth, Australia. The company's Industrial Services segment trades in and markets various industrial commodities, including coal, rubber, and aluminum; and manufactures and markets polypropylene woven bags. Its Other Investments segment manufactures and sells printed circuit boards for customers in the automotive, computer peripheral, consumer electronics, telecommunication, healthcare, and instrument and control sectors; and retails golf-related lifestyle products, as well as deals in footwear. The company was formerly known as Hytex Limited and changed its name to Tuan Sing Holdings Limited in 1983. Tuan Sing Holdings Limited was founded in 1969 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "238697",
        "website": "http://www.tuansing.com",
        "full_time_employees": 551
    },
    "T82U.SI": {
        "short_name": "Suntec Reit",
        "long_name": "Suntec Real Estate Investment Trust",
        "summary": "Listed on 9 December 2004, Suntec REIT holds properties in Suntec City, Singapore's largest integrated commercial development (including one of Singapore's largest shopping Mall), a 66.3% interest in Suntec Singapore Convention & Exhibition Centre, a one-third interest in One Raffles Quay, a one-third interest in Marina Bay Financial Centre Towers 1 and 2 and the Marina Bay Link Mall, and a 30.0% interest in 9 Penang Road. Suntec REIT holds a 100% interest in a commercial building located at 177 Pacific Highway, Sydney, a 100% interest in a commercial building located at 21 Harris Street, Pyrmont, Sydney, a 50.0% interest in Southgate Complex, Melbourne, a 50.0% interest in a commercial building located at Olderfleet 477 Collins Street, Melbourne and a 100% interest in a commercial building located at 55 Currie Street, Adelaide, Australia. Suntec REIT also holds a 50.0% interest in Nova Properties located in London, United Kingdom. Its aim is to invest in income-producing real estate which is primarily used for office and/or retail purposes. Suntec REIT is managed by an external manager, ARA Trust Management (Suntec) Limited.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "038985",
        "website": "http://www.suntecreit.com",
        "full_time_employees": null
    },
    "TQ5.SI": {
        "short_name": "FRASERS PROPERTY LIMITED",
        "long_name": "Frasers Property Limited",
        "summary": "Frasers Property Limited, an investment holding company, owns, develops, and manages an integrated portfolio of properties. The company's asset portfolio includes business parks; and residential, retail, commercial, and industrial and logistics properties in Australia, Europe, China, and Southeast Asia. It owns and/or operates serviced apartments and hotels in approximately 70 cities across Asia, Australia, Europe, the Middle East, and Africa. The company also acts as a sponsor of two real estate investment trusts (REITs) listed on the SGX-ST that comprises Frasers Centrepoint Trust, and Frasers Logistics & Commercial Trust focused on retail, commercial, and industrial properties; and one stapled trust listed on the SGX-ST that include Frasers Hospitality Trust focused on hospitality properties; and two REITs listed on the Stock Exchange of Thailand, which include Frasers Property (Thailand) Public Company Limited, a sponsor of Frasers Property Thailand Industrial Freehold & Leasehold REIT that focuses on industrial and logistics properties in Thailand, as well as Golden Ventures Leasehold Real Estate Investment Trust, which focuses on commercial properties. The company was formerly known as Frasers Centrepoint Limited and changed its name to Frasers Property Limited in February 2018. Frasers Property Limited was incorporated in 1963 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "119958",
        "website": "http://www.frasersproperty.com",
        "full_time_employees": 5664
    },
    "TS0U.SI": {
        "short_name": "OUE Com Reit",
        "long_name": "OUE Commercial Real Estate Investment Trust",
        "summary": "OUE C-REIT is a real estate investment trust listed on the Main Board of Singapore Exchange Securities Trading Limited since 27 January 2014. OUE C-REIT completed the merger with OUE Hospitality Trust in September 2019 to become one of the largest diversified REITs with total assets of S$6.8 billion. With seven properties across the commercial and hospitality segments in Singapore and Shanghai, OUE C-REIT's property portfolio comprises approximately 2.2 million sq ft of prime office and retail space, and 1,640 upscale hotel rooms. OUE C-REIT invests in income-producing real estate used primarily for commercial purposes (including real estate used primarily for office and/or retail purposes) in financial and business hubs, and/or hospitality and/or hospitality-related purposes, as well as real estate-related assets. OUE C-REIT is managed by OUE Commercial REIT Management Pte. Ltd., which is a wholly-owned subsidiary of OUE Limited.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "049321",
        "website": "http://www.ouect.com",
        "full_time_employees": 72
    },
    "TUS.F": {
        "short_name": "TUAN SING HLDGS-LOC.SD-01",
        "long_name": "Tuan Sing Holdings Limited",
        "summary": "Tuan Sing Holdings Limited, an investment holding company, engages in the property development and investment, hotels investment, and industrial services businesses in Singapore, Australia, China, Malaysia, and Indonesia. The company's Property segment develops and invests in residential, commercial, and industrial properties; and provides property management services. Its Hotels Investment segment owns two five-star hotels managed by Hyatt International in Melbourne and Perth, Australia. The company's Industrial Services segment trades in and markets various industrial commodities, including coal, rubber, and aluminum; and manufactures and markets polypropylene woven bags. Its Other Investments segment manufactures and sells printed circuit boards for customers in the automotive, computer peripheral, consumer electronics, telecommunication, healthcare, and instrument and control sectors; and retails golf-related lifestyle products, as well as deals in footwear. The company was formerly known as Hytex Limited and changed its name to Tuan Sing Holdings Limited in 1983. Tuan Sing Holdings Limited was founded in 1969 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "238697",
        "website": "http://www.tuansing.com",
        "full_time_employees": 551
    },
    "U06.SI": {
        "short_name": "SingaporeLandGrp",
        "long_name": "Singapore Land Group Limited",
        "summary": "United Industrial Corporation Limited, an investment holding company, engages in the development of properties for investment and trading in Singapore and internationally. The company operates through Property Investment, Property Trading, Hotel Operations, Technology Operations, and Others segments. It develops and leases commercial office, retail space, and residential properties. The company also offers property management services; invests in and operates hotels; invests in retail centers; distributes computers and related products; retails computer hardware and software; and provides information technology, systems integration, and networking infrastructure services. In addition, it invests in shares, and provides marketing management and other related services. The company was incorporated in 1963 and is based in Singapore. United Industrial Corporation Limited is a subsidiary of UOL Group Limited.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "048621",
        "website": "http://www.uic.com.sg",
        "full_time_employees": null
    },
    "U14.SI": {
        "short_name": "UOL",
        "long_name": "UOL Group Limited",
        "summary": "UOL Group Limited primarily engages in the property development and investment, and hotel businesses. Its property development projects include residential units, office towers and shopping malls, and hotels and serviced suites. The company also owns and/or manages approximately 30 hotels, resorts, and services suites under the Pan Pacific, PARKROYAL COLLECTION, and PARKROYAL names in Asia, Oceania, and North America with approximately 10,000 rooms in its portfolio. In addition, it is involved in the rental and management of serviced suites; lease of commercial offices and retail malls; operation of restaurants; and management and operation of health and beauty retreats and facilities. Further, the company engages in the retail of computer hardware and software, as well as provision of systems integration and networking infrastructure services; property trading business; management and licensing of trademarks; and business development activity. Additionally, it provides treasury, retail management consultancy, project and property management, property management agency, and trustee services; technical, accounting, and marketing and related services to hotels and serviced suites; and information technology related products and services, as well as invests in quoted and unquoted financial assets. It has operations in Singapore, Australia, Vietnam, Malaysia, the People's Republic of China, Myanmar, the United Kingdom, and internationally. The company was formerly known as United Overseas Land Limited and changed its name to UOL Group Limited in 2006. UOL Group Limited was founded in 1963 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "307591",
        "website": "http://www.uol.com.sg",
        "full_time_employees": 2000
    },
    "U1O.F": {
        "short_name": "UOL GROUP LTD.  SD 1",
        "long_name": "UOL Group Limited",
        "summary": "UOL Group Limited primarily engages in the property development and investment, and hotel businesses. Its property development projects include residential units, office towers and shopping malls, and hotels and serviced suites. The company also owns and/or manages approximately 30 hotels, resorts, and services suites under the Pan Pacific, PARKROYAL COLLECTION, and PARKROYAL names in Asia, Oceania, and North America with approximately 10,000 rooms in its portfolio. In addition, it is involved in the rental and management of serviced suites; lease of commercial offices and retail malls; operation of restaurants; and management and operation of health and beauty retreats and facilities. Further, the company engages in the retail of computer hardware and software, as well as provision of systems integration and networking infrastructure services; property trading business; management and licensing of trademarks; and business development activity. Additionally, it provides treasury, retail management consultancy, project and property management, property management agency, and trustee services; technical, accounting, and marketing and related services to hotels and serviced suites; and information technology related products and services, as well as invests in quoted and unquoted financial assets. It has operations in Singapore, Australia, Vietnam, Malaysia, the People's Republic of China, Myanmar, the United Kingdom, and internationally. The company was formerly known as United Overseas Land Limited and changed its name to UOL Group Limited in 2006. UOL Group Limited was founded in 1963 and is based in Singapore.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "307591",
        "website": "http://www.uol.com.sg",
        "full_time_employees": 2000
    },
    "UD1U.SI": {
        "short_name": "IREIT Global",
        "long_name": "IREIT Global",
        "summary": "IREIT Global (Â\u0093IREITÂ\u0094) is the first Singapore-listed real estate investment trust with the investment strategy of principally investing, directly or indirectly, in a portfolio of income-producing real estate in Europe which is used primarily for office, retail and industrial (including logistics) purposes, as well as real estate-related assets. IREIT's portfolio comprises five freehold office properties in Germany and four freehold office properties in Spain, with a total attributable lettable area of c.230,000 sqm and c.4,000 parking spaces. As at 31 December 2019, the portfolio has an occupancy rate of 94.6% and a valuation of Â\u0080630.2 million. IREIT is managed by IREIT Global Group Pte. Ltd., which is jointly owned by Tikehau Capital and City Developments Limited (Â\u0093CDLÂ\u0094). Tikehau Capital is an asset management and investment group listed in France, while CDL is a leading global real estate company listed in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "078881",
        "website": "http://www.ireitglobal.com",
        "full_time_employees": null
    },
    "UILCF": {
        "short_name": "SINGAPORE LAND GRP LTD",
        "long_name": "Singapore Land Group Limited",
        "summary": "United Industrial Corporation Limited, an investment holding company, engages in the development of properties for investment and trading in Singapore and internationally. The company operates through Property Investment, Property Trading, Hotel Operations, Technology Operations, and Others segments. It develops and leases commercial office, retail space, and residential properties. The company also offers property management services; invests in and operates hotels; invests in retail centers; distributes computers and related products; retails computer hardware and software; and provides information technology, systems integration, and networking infrastructure services. In addition, it invests in shares, and provides marketing management and other related services. The company was incorporated in 1963 and is based in Singapore. United Industrial Corporation Limited is a subsidiary of UOL Group Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "048621",
        "website": "http://www.uic.com.sg",
        "full_time_employees": null
    },
    "UOLGF": {
        "short_name": "UOL GROUP LIMITED",
        "long_name": "UOL Group Limited",
        "summary": "UOL Group Limited primarily engages in the property development and investment, and hotel businesses. Its property development projects include residential units, office towers and shopping malls, and hotels and serviced suites. The company also owns and/or manages approximately 30 hotels, resorts, and services suites under the Pan Pacific, PARKROYAL COLLECTION, and PARKROYAL names in Asia, Oceania, and North America with approximately 10,000 rooms in its portfolio. In addition, it is involved in the rental and management of serviced suites; lease of commercial offices and retail malls; operation of restaurants; and management and operation of health and beauty retreats and facilities. Further, the company engages in the retail of computer hardware and software, as well as provision of systems integration and networking infrastructure services; property trading business; management and licensing of trademarks; and business development activity. Additionally, it provides treasury, retail management consultancy, project and property management, property management agency, and trustee services; technical, accounting, and marketing and related services to hotels and serviced suites; and information technology related products and services, as well as invests in quoted and unquoted financial assets. It has operations in Singapore, Australia, Vietnam, Malaysia, the People's Republic of China, Myanmar, the United Kingdom, and internationally. The company was formerly known as United Overseas Land Limited and changed its name to UOL Group Limited in 2006. UOL Group Limited was founded in 1963 and is based in Singapore.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "307591",
        "website": "http://www.uol.com.sg",
        "full_time_employees": 2000
    },
    "UOLGY": {
        "short_name": "UOL GROUP LIMITED",
        "long_name": "UOL Group Limited",
        "summary": "UOL Group Limited primarily engages in the property development and investment, and hotel businesses. Its property development projects include residential units, office towers and shopping malls, and hotels and serviced suites. The company also owns and/or manages approximately 30 hotels, resorts, and services suites under the Pan Pacific, PARKROYAL COLLECTION, and PARKROYAL names in Asia, Oceania, and North America with approximately 10,000 rooms in its portfolio. In addition, it is involved in the rental and management of serviced suites; lease of commercial offices and retail malls; operation of restaurants; and management and operation of health and beauty retreats and facilities. Further, the company engages in the retail of computer hardware and software, as well as provision of systems integration and networking infrastructure services; property trading business; management and licensing of trademarks; and business development activity. Additionally, it provides treasury, retail management consultancy, project and property management, property management agency, and trustee services; technical, accounting, and marketing and related services to hotels and serviced suites; and information technology related products and services, as well as invests in quoted and unquoted financial assets. It has operations in Singapore, Australia, Vietnam, Malaysia, the People's Republic of China, Myanmar, the United Kingdom, and internationally. The company was formerly known as United Overseas Land Limited and changed its name to UOL Group Limited in 2006. UOL Group Limited was founded in 1963 and is based in Singapore.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "307591",
        "website": "http://www.uol.com.sg",
        "full_time_employees": 2000
    },
    "UV1.SI": {
        "short_name": "Regal Intl",
        "long_name": "Regal International Group Ltd.",
        "summary": "Regal International Group Ltd., an investment holding company, engages in the property development activities in Malaysia and Singapore. It operates through Property Development, Construction, Trading, and Others segments. It is involved in the development and sale of shophouses, terrace houses, apartments, landed properties, corporate parks, residential properties, condominiums, and commercial and industrial units. The company also engages in construction works and property investment activities. In addition, it provides mortgage consultancy, real estate and property management, sales commission, painting work, real estate agency and valuation, and asset and portfolio management services; develops, constructs, and trades in construction materials; supplies concrete and concrete products; and rents machinery and properties. Further, the company engages in steelworks and supplies. The company was incorporated in 2005 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "729484",
        "website": "http://www.regalinternational.com.sg",
        "full_time_employees": null
    },
    "W05.SI": {
        "short_name": "Wing Tai",
        "long_name": "Wing Tai Holdings Limited",
        "summary": "Wing Tai Holdings Limited, an investment holding company, engages in the property investment and development, lifestyle retail, and hospitality management businesses in Singapore, Malaysia, Australia, Japan, and the People's Republic of China. The company develops and sells residential and commercial properties; and invests in and manages serviced residences under the Lanson Place brand name, as well as manages a boutique hotel in Hong Kong. It is also involved in the retail of garments; the provision of IT consultancy, and consultancy and advisory services; and project management and property maintenance activities, as well as development of e-commerce applications. The company was founded in 1955 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "239519",
        "website": "http://www.wingtaiasia.com.sg",
        "full_time_employees": null
    },
    "XEUA.F": {
        "short_name": "KSH HOLDINGS LTD",
        "long_name": "KSH Holdings Limited",
        "summary": "KSH Holdings Limited, an investment holding company, operates as a construction builder and contractor for public and private sectors. The company operates through Construction, and Property Development and Management segments. It constructs residential, commercial, hospitality, and mixed-use development projects; and rents and sells properties. The company also operates approximately 13 hotels. It operates in Singapore, the People's Republic of China, Malaysia, Japan, Australia, and the United Kingdom. KSH Holdings Limited was incorporated in 1979 and is based in Singapore.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "758108",
        "website": "http://www.kimsengheng.com",
        "full_time_employees": null
    },
    "XZL.SI": {
        "short_name": "ARA HTrust USD",
        "long_name": "ARA US Hospitality Trust",
        "summary": "Listed on the Singapore Exchange on 9 May 2019, ARA US Hospitality Trust is a hospitality stapled group comprising ARA US Hospitality Property Trust (Â\u0093ARA H-REITÂ\u0094) and ARA US Hospitality Management Trust (Â\u0093ARA H-BTÂ\u0094). ARA US Hospitality Trust invests in income-producing real estate assets used primarily for hospitality purposes located in the United States. ARA US Hospitality Trust's portfolio currently comprises 41 select-service hotels with a total of 5,340 rooms across 22 states in the United States. ARA US Hospitality Trust is managed by ARA Trust Management (USH) Pte. Ltd. and ARA Business Trust Management (USH) Pte. Ltd., (collectively known as the Â\u0093ManagersÂ\u0094). The Managers are indirect wholly-owned subsidiaries of ARA Asset Management Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Hotel & Motel",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "38985",
        "website": "http://www.araushotels.com",
        "full_time_employees": null
    },
    "YLG.SG": {
        "short_name": "Yanlord Land Group Ltd. Registe",
        "long_name": "Yanlord Land Group Limited",
        "summary": "Yanlord Land Group Limited, an investment holding company, engages in the property development activities in the People's Republic of China. The company operates through Property Development, Property Investment and Hotel Operations, Property Management, and Others segments. It develops residential properties, including apartment complexes and villas; and commercial and integrated properties, such as offices, serviced apartments, and shopping malls for sale and lease. The company also offers property management services for residential properties comprising security, building, equipment maintenance and repair, facilities management, child-care, and other ancillary services, as well as organizes social and residential community functions. In addition, it is involved in the leasing of properties and operation of hotels; hotels and serviced apartment management; trading of building materials and hardware; operation of kindergarten; installation, maintenance, sale, and repair of elevators; project and business management; agribusiness exhibition and trade emporium center; manufacture of electronic components and connectors; die casting and precision engineering; mineral sand mining; transplant technology; and production of seedlings and bio-electronic products. Further, the company provides landscaping and gardening, investment management, city redevelopment, food and beverage, leisure and fitness, tourism investment, asset management, information technology, education and training, cultural and art performance, construction engineering, tourism and travel, financial, and consultancy services. Additionally, it is involved in the civil, electrical, and mechanical engineering and contract businesses; supply, delivery, testing, and commissioning of telecommunication equipment and after-sales service; and supply and installation of building materials, industrial laundry, and automotive parts and equipment. The company was founded in 1993 and is based in Singapore.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "038989",
        "website": "http://www.yanlordland.com",
        "full_time_employees": null
    },
    "YMAIF": {
        "short_name": "YOMA STRATEGIC HOLDINGS LIMITED",
        "long_name": "Yoma Strategic Holdings Ltd.",
        "summary": "Yoma Strategic Holdings Ltd., an investment holding company, engages in the real estate, automotive and heavy equipment, consumer, financial, and investment businesses in Singapore, Myanmar, and the People's Republic of China. The company's Real Estate Development segment develops and sells land and properties. Its Real Estate Services segment provides project management, design, and estate management services, as well as property leasing services and operates golf estate. The company's Automotive & Heavy Equipment segment supplies and sells agriculture and construction equipment, passenger and commercial vehicles, and related parts, as well as offers maintenance services. Its Consumer segment engages in the operation of restaurants; bottling and distribution of beverages; food wholesale business; and provision of logistics services. The company's Financial Services segment provides vehicle financing; and invests in mobile financial services. Its Investments segment invests in the infrastructure, tourism, power agricultural, and other sectors, as well as leases investment properties. The company also engages in leasing automotive equipment. The company was formerly known as Sea View Hotel Limited. Yoma Strategic Holdings Ltd. was incorporated in 1962 and is based in Singapore.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "239002",
        "website": "http://www.yomastrategic.com",
        "full_time_employees": 4300
    },
    "Z25.SI": {
        "short_name": "Yanlord Land",
        "long_name": "Yanlord Land Group Limited",
        "summary": "Yanlord Land Group Limited, an investment holding company, engages in the property development activities in the People's Republic of China. The company operates through Property Development, Property Investment and Hotel Operations, Property Management, and Others segments. It develops residential properties, including apartment complexes and villas; and commercial and integrated properties, such as offices, serviced apartments, and shopping malls for sale and lease. The company also offers property management services for residential properties comprising security, building, equipment maintenance and repair, facilities management, child-care, and other ancillary services, as well as organizes social and residential community functions. In addition, it is involved in the leasing of properties and operation of hotels; hotels and serviced apartment management; trading of building materials and hardware; operation of kindergarten; installation, maintenance, sale, and repair of elevators; project and business management; agribusiness exhibition and trade emporium center; manufacture of electronic components and connectors; die casting and precision engineering; mineral sand mining; transplant technology; and production of seedlings and bio-electronic products. Further, the company provides landscaping and gardening, investment management, city redevelopment, food and beverage, leisure and fitness, tourism investment, asset management, information technology, education and training, cultural and art performance, construction engineering, tourism and travel, financial, and consultancy services. Additionally, it is involved in the civil, electrical, and mechanical engineering and contract businesses; supply, delivery, testing, and commissioning of telecommunication equipment and after-sales service; and supply and installation of building materials, industrial laundry, and automotive parts and equipment. The company was founded in 1993 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "038989",
        "website": "http://www.yanlordland.com",
        "full_time_employees": null
    },
    "Z59.SI": {
        "short_name": "Yoma Strategic",
        "long_name": "Yoma Strategic Holdings Ltd.",
        "summary": "Yoma Strategic Holdings Ltd., an investment holding company, engages in the real estate, automotive and heavy equipment, consumer, financial, and investment businesses in Singapore, Myanmar, and the People's Republic of China. The company's Real Estate Development segment develops and sells land and properties. Its Real Estate Services segment provides project management, design, and estate management services, as well as property leasing services and operates golf estate. The company's Automotive & Heavy Equipment segment supplies and sells agriculture and construction equipment, passenger and commercial vehicles, and related parts, as well as offers maintenance services. Its Consumer segment engages in the operation of restaurants; bottling and distribution of beverages; food wholesale business; and provision of logistics services. The company's Financial Services segment provides vehicle financing; and invests in mobile financial services. Its Investments segment invests in the infrastructure, tourism, power agricultural, and other sectors, as well as leases investment properties. The company also engages in leasing automotive equipment. The company was formerly known as Sea View Hotel Limited. Yoma Strategic Holdings Ltd. was incorporated in 1962 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "239002",
        "website": "http://www.yomastrategic.com",
        "full_time_employees": 4300
    }
}