{
  "40V.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "Alset International Limited",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Real Estate",
    "short_name": "$ Alset",
    "state": null,
    "summary": "Alset International Limited, an investment holding company, engages in the property development, information technology (IT), biomedical, and investment businesses in Singapore, Australia, the United States, and the People's Republic of China. The company develops property projects and invests in property development projects. It is also involved in the research and development of IT hardware and software; provision of IT-related services to end-users, service providers, and other commercial users through multiple platforms; and e-commerce business. In addition, the company trades in quoted securities, commodities, and other derivatives and financial products; invests in various quoted and unquoted securities, such as investments ranging from pre-initial public offer investment, various forms of capital in companies, and funds with business growth and trade sale; undertakes businesses in incubation and angel investment; and offers corporate strategy and business development advisory services. Further, it develops, researches, tests, manufactures, licenses, and distributes biomedical products. Additionally, the company offers portfolio management and consulting services; and sells and markets mobile applications, as well as distributes health supplements. The company was formerly known as Singapore eDevelopment Limited and changed its name to Alset International Limited in September 2020. The company was incorporated in 2009 and is based in Singapore. Alset International Limited is a subsidiary of Hengfai Business Development Pte. Ltd.",
    "website": "http://www.alsetinternational.com",
    "zipcode": "38987"
  },
  "5AE.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "Pollux Properties Ltd.",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Real Estate",
    "short_name": "$ Pollux Prop",
    "state": null,
    "summary": "Pollux Properties Ltd., an investment holding company, operates as a property developer in Singapore. It operates through Property Development and Property Investment segments. The Property Development segment acquires and develops residential and commercial properties for sale. The Property Investment segment is involved in renting of properties, as well as operating of serviced apartments. The company was formerly known as Shining Corporation Ltd. and changed its name to Pollux Properties Ltd. in June 2010. Pollux Properties Ltd. was incorporated in 1999 and is based in Singapore. Pollux Properties Ltd. is a subsidiary of Pollux Holdings Pte. Ltd.",
    "website": "http://pollux.com.sg",
    "zipcode": "169639"
  },
  "5F4.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "Figtree Holdings Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "$ Figtree",
    "state": null,
    "summary": "Figtree Holdings Limited, an investment holding company, designs and builds commercial and industrial facilities in Singapore and China. It operates through Design and Build, and Property Development segments. The company also constructs, develops, sells, and/or leases residential, commercial, and industrial properties; and provides design, project and construction management, and consulting services, as well as general building engineering services. In addition, it undertakes A&A works on existing buildings; and engages in the refurbishment and upgrading of existing buildings. Figtree Holdings Limited was incorporated in 2013 and is based in Singapore.",
    "website": "http://www.figtreeasia.com",
    "zipcode": "159351"
  },
  "5H0.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "SingHaiyi Group Ltd.",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Real Estate",
    "short_name": "SingHaiyi",
    "state": null,
    "summary": "SingHaiyi Group Ltd., an investment holding company, develops, owns, and manages real estate properties in Singapore, Malaysia, Australia, and the United States. It operates through Property Development; and Property and Property Related Investment segments. The company develops and sells residential properties; owns and manages residential, commercial, retail, and other properties; and leases Tri-County Mall. It also provides property development advisory services. The company was formerly known as SingXpress Land Ltd. and changed its name to SingHaiyi Group Ltd. in March 2013. SingHaiyi Group Ltd. was incorporated in 1988 and is headquartered in Singapore. SingHaiyi Group Ltd. is a subsidiary of Haiyi Holdings Pte Ltd.",
    "website": "http://www.singhaiyi.com",
    "zipcode": "068809"
  },
  "5PC.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "Goodland Group Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "Goodland",
    "state": null,
    "summary": "Goodland Group Limited, an investment holding company, develops real estate properties in Singapore and Malaysia. The company operates through Property Development, Construction, Property Investment, and Other segments. It develops and sells properties; constructs residential and commercial properties; and invests in properties and shares. The company also operates as a general building contractor. Goodland Group Limited was founded in 1993 and is headquartered in Singapore.",
    "website": "http://www.goodlandgroup.com.sg",
    "zipcode": "537069"
  },
  "5UA.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "Luminor Financial Holdings Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "$ Luminor",
    "state": null,
    "summary": "Luminor Financial Holdings Limited, an investment holding company, engages principally in the development of integrated residential and commercial properties in the People's Republic of China and Singapore. It operates through Property Development, Property Management, and Rental segments. The company develops residential, commercial, and other properties; provides property management, and other services; and leases properties held for sale. Its property development and management activities include site selection, land acquisition, project conceptualization, construction, sale, completion, and after-sale services. The company is also involved in the wholesale, import, and export of chemical products, office furniture, and clothing; provision of consultancy services on the enterprise management and business information; and sale of construction materials, decoration materials, and low voltage electronic apparatus. The company was formerly known as Starland Holdings Limited and changed its name to Luminor Financial Holdings Limited in April 2021. The company was founded in 2008 and is based in Singapore. Luminor Financial Holdings Limited is a subsidiary of GRP Chongqing Land Pte Ltd.",
    "website": "http://www.starland.cc",
    "zipcode": "049319"
  },
  "5UX.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "Oxley Holdings Limited",
    "market": "sg_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "Oxley",
    "state": null,
    "summary": "Oxley Holdings Limited, an investment holding company, invests in and develops properties. The company operates through Property Development, Property Investment, Hotel, and Construction segments. It develops residential, commercial, industrial, and hospitality projects. The company also leases properties; owns and operates hotels; invests in securities; and constructs commercial and residential properties. It operates in Singapore, the United Kingdom, Ireland, Cambodia, Malaysia, and Australia. Oxley Holdings Limited was incorporated in 2010 and is headquartered in Singapore.",
    "website": "http://www.oxley.com.sg",
    "zipcode": "068906"
  },
  "8OX1.SG": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Real Estate - Development",
    "long_name": "Oxley Holdings Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "Oxley Holdings Ltd. Registered ",
    "state": null,
    "summary": "Oxley Holdings Limited, an investment holding company, invests in and develops properties. The company operates through Property Development, Property Investment, Hotel, and Construction segments. It develops residential, commercial, industrial, and hospitality projects. The company also leases properties; owns and operates hotels; invests in securities; and constructs commercial and residential properties. It operates in Singapore, the United Kingdom, Ireland, Cambodia, Malaysia, and Australia. Oxley Holdings Limited was incorporated in 2010 and is headquartered in Singapore.",
    "website": "http://www.oxley.com.sg",
    "zipcode": "068906"
  },
  "A26.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "Sinarmas Land Limited",
    "market": "sg_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "Sinarmas Land",
    "state": null,
    "summary": "Sinarmas Land Limited, an investment holding company, engages in the property business in Indonesia, China, Malaysia, Singapore, and the United Kingdom. The company engages in the investment and development of township, residential, commercial, industrial, and hospitality-related properties; and ownership and management of hotels and resorts. It also develops resort properties; develops country clubs, golf clubs and courses, and recreational facilities; develops and operates toll roads; develops industrial estates; and provides financing, management and consultancy, educational, hotel and resort marketing agency, nominee, treasury management, and healthcare services. The company was formerly known as AFP Properties Limited and changed its name to Sinarmas Land Limited in April 2011. Sinarmas Land Limited was incorporated in 1994 and is headquartered in Singapore. Sinarmas Land Limited is a subsidiary of Flambo International Limited.",
    "website": "http://www.sinarmasland.com",
    "zipcode": "118535"
  },
  "ADN.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "First Sponsor Group Limited",
    "market": "sg_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "First Sponsor",
    "state": null,
    "summary": "First Sponsor Group Limited, an investment holding company, invests in, develops, and sells residential and commercial properties primarily in the People's Republic of China and Europe. The company operates through Property Development, Property Investment, Property Financing, and Hotel Operations segments. It also provides interest bearing loans to vendor financing arrangements and subscription of debt securities. In addition, the company owns and operates hotels. First Sponsor Group Limited was incorporated in 2007 and is based in Singapore.",
    "website": "http://www.1st-sponsor.com.sg",
    "zipcode": "048942"
  },
  "B1W1.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Real Estate - Development",
    "long_name": "Bukit Sembawang Estates Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "BUKIT SEMBA. SUBDI.SD-,50",
    "state": null,
    "summary": "Bukit Sembawang Estates Limited, an investment holding company, engages in the property development in Singapore. It operates through Property Development, Investment Holding, and Hospitality segments. The company develops and sells residential properties; and holds and manages office buildings. In addition, it operates serviced apartments. The company was founded in 1911 and is based in Singapore.",
    "website": "http://www.bukitsembawang.sg",
    "zipcode": "159835"
  },
  "B61.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "Bukit Sembawang Estates Limited",
    "market": "sg_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "Bukit Sembawang",
    "state": null,
    "summary": "Bukit Sembawang Estates Limited, an investment holding company, engages in the property development in Singapore. It operates through Property Development, Investment Holding, and Hospitality segments. The company develops and sells residential properties; and holds and manages office buildings. In addition, it operates serviced apartments. The company was founded in 1911 and is based in Singapore.",
    "website": "http://www.bukitsembawang.sg",
    "zipcode": "159835"
  },
  "BHO.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "Top Global Limited",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Real Estate",
    "short_name": "Top Global",
    "state": null,
    "summary": "Top Global Limited, an investment holding company, engages in the real estate development activities in Singapore and Indonesia. The company operates through Property Development, Hospitality Management, Property Management, and Investment and Others segments. It is involved in the development of residential properties; and investment activities. The company also provides property management services for residential and commercial properties; facility management services; and management services for hostel and hotel operators. In addition, it engages in the golf and country club, hotel, hostel, and water theme park operations; development of information technology software; research, development, and wholesale of equipment; operation and management of serviced apartments; and sale of food and beverages. The company was incorporated in 1980 and is headquartered in Singapore.",
    "website": "http://www.topglobal.com.sg",
    "zipcode": "238862"
  },
  "C09.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "City Developments Limited",
    "market": "sg_market",
    "market_cap": "Mid Cap",
    "sector": "Real Estate",
    "short_name": "CityDev",
    "state": null,
    "summary": "City Developments Limited (CDL) is a leading global real estate operating company with a network spanning 103 locations in 29 countries and regions. Listed on the Singapore Exchange, the Group is one of the largest companies by market capitalisation. Its income-stable and geographically-diverse portfolio comprises residences, offices, hotels, serviced apartments, integrated developments and shopping malls. With a proven track record of over 55 years in real estate development, investment and management, CDL has developed over 43,000 homes and owns over 18 million square feet of lettable floor area globally. Its diversified global land bank offers 4.1 million square feet of developable gross floor area. The Group's London-based hotel arm, Millennium & Copthorne Hotels (M&C), is one of the world's largest hotel chains, with over 145 hotels worldwide, many in key gateway cities. Leveraging its deep expertise in developing and managing a diversified asset base, the Group is focused on enhancing the performance of its portfolio and strengthening its recurring income streams to deliver long-term sustainable value to shareholders. The Group is also developing a fund management business and targets to achieve US$5 billion in Assets Under Management (AUM) by 2023.",
    "website": "http://www.cdl.com.sg",
    "zipcode": "048619"
  },
  "C29.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "Chip Eng Seng Corporation Ltd",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Real Estate",
    "short_name": "Chip Eng Seng",
    "state": null,
    "summary": "Chip Eng Seng Corporation Ltd, an investment holding company, engages in the construction, property development and investment, and hospitality businesses primarily in Singapore, Australia, Malaysia, and Maldives. The company operates through Construction, Property Developments, Property Investments, Hospitality, and Corporate and Others segments. The company constructs public housing projects, condominiums, executive condominiums, modular buildings, and industrial and commercial projects; develops residential, commercial, and industrial properties, as well as manages development projects; and provides real estate management and consultancy services. It also leases investment properties, such as shophouses, office buildings, and industrial properties; operates hotels and island resort; and invests in marketable securities. In addition, the company acts as general building contractor; manufactures and trades in precast products; and provides general building engineering, financial, and treasury services. Further, the company operates Repton-brand pre-school center in Singapore. Chip Eng Seng Corporation Ltd was incorporated in 1998 and is headquartered in Singapore.",
    "website": "http://www.chipengseng.com.sg",
    "zipcode": "169877"
  },
  "C31.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "CapitaLand Limited",
    "market": "sg_market",
    "market_cap": "Large Cap",
    "sector": "Real Estate",
    "short_name": "CapitaLand",
    "state": null,
    "summary": "CapitaLand Limited, together with its subsidiaries, develops, owns, leases, manages, and sells real estate properties in Singapore, rest of Asia, North America, Europe, the United Kingdom, and internationally. The company operates through CapitaLand Singapore & International, CapitaLand China, CapitaLand India, CapitaLand Lodging, and CapitaLand Financial segments. Its real estate portfolio includes commercial and retail properties; business parks; shopping malls; offices; homes; industrial and logistics properties; integrated and urban developments; and lodging and residential properties, as well as real estate investment trusts (REITs), business trusts, and private funds. The company also invests in real estate financial products and assets; and provides investment advisory and management services, as well as real estate asset management and investment management services. In addition, it offers management support and consultancy services. The company was formerly known as Pidemco Land Limited and changed its name to CapitaLand Limited in November 2000. CapitaLand Limited was incorporated in 1989 and is headquartered in Singapore. CapitaLand Limited is a subsidiary of CLA Real Estate Holdings Pte Ltd.",
    "website": "http://www.capitaland.com",
    "zipcode": "068912"
  },
  "C33.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "Chuan Hup Holdings Limited",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Real Estate",
    "short_name": "Chuan Hup",
    "state": null,
    "summary": "Chuan Hup Holdings Limited, an investment holding company, engages in the electronics manufacturing business. It is also involved in the property development and investment activities. It operates in Singapore, Australia, the People's Republic of China, the United States, and Europe, as well as ASEAN countries and internationally. The company was founded in 1970 and is based in Singapore.",
    "website": "http://www.chuanhup.com.sg",
    "zipcode": "059818"
  },
  "CDE.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Real Estate - Development",
    "long_name": "City Developments Limited",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Real Estate",
    "short_name": "CITY DEV.  SD-,50",
    "state": null,
    "summary": "City Developments Limited (CDL) is a leading global real estate operating company with a network spanning 103 locations in 29 countries and regions. Listed on the Singapore Exchange, the Group is one of the largest companies by market capitalisation. Its income-stable and geographically-diverse portfolio comprises residences, offices, hotels, serviced apartments, integrated developments and shopping malls. With a proven track record of over 55 years in real estate development, investment and management, CDL has developed over 43,000 homes and owns over 18 million square feet of lettable floor area globally. Its diversified global land bank offers 4.1 million square feet of developable gross floor area. The Group's London-based hotel arm, Millennium & Copthorne Hotels (M&C), is one of the world's largest hotel chains, with over 145 hotels worldwide, many in key gateway cities. Leveraging its deep expertise in developing and managing a diversified asset base, the Group is focused on enhancing the performance of its portfolio and strengthening its recurring income streams to deliver long-term sustainable value to shareholders. The Group is also developing a fund management business and targets to achieve US$5 billion in Assets Under Management (AUM) by 2023.",
    "website": "http://www.cdl.com.sg",
    "zipcode": "048619"
  },
  "CDEVF": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "City Developments Limited",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Real Estate",
    "short_name": "CITY DEVELOPMENTS",
    "state": null,
    "summary": "City Developments Limited (CDL) is a leading global real estate operating company with a network spanning 103 locations in 29 countries and regions. Listed on the Singapore Exchange, the Group is one of the largest companies by market capitalisation. Its income-stable and geographically-diverse portfolio comprises residences, offices, hotels, serviced apartments, integrated developments and shopping malls. With a proven track record of over 55 years in real estate development, investment and management, CDL has developed over 43,000 homes and owns over 18 million square feet of lettable floor area globally. Its diversified global land bank offers 4.1 million square feet of developable gross floor area. The Group's London-based hotel arm, Millennium & Copthorne Hotels (M&C), is one of the world's largest hotel chains, with over 145 hotels worldwide, many in key gateway cities. Leveraging its deep expertise in developing and managing a diversified asset base, the Group is focused on enhancing the performance of its portfolio and strengthening its recurring income streams to deliver long-term sustainable value to shareholders. The Group is also developing a fund management business and targets to achieve US$5 billion in Assets Under Management (AUM) by 2023.",
    "website": "http://www.cdl.com.sg",
    "zipcode": "048619"
  },
  "CDEVY": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "City Developments Limited",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Real Estate",
    "short_name": "CITY DEVELOPMENTS",
    "state": null,
    "summary": "City Developments Limited (CDL) is a leading global real estate operating company with a network spanning 103 locations in 29 countries and regions. Listed on the Singapore Exchange, the Group is one of the largest companies by market capitalisation. Its income-stable and geographically-diverse portfolio comprises residences, offices, hotels, serviced apartments, integrated developments and shopping malls. With a proven track record of over 55 years in real estate development, investment and management, CDL has developed over 43,000 homes and owns over 18 million square feet of lettable floor area globally. Its diversified global land bank offers 4.1 million square feet of developable gross floor area. The Group's London-based hotel arm, Millennium & Copthorne Hotels (M&C), is one of the world's largest hotel chains, with over 145 hotels worldwide, many in key gateway cities. Leveraging its deep expertise in developing and managing a diversified asset base, the Group is focused on enhancing the performance of its portfolio and strengthening its recurring income streams to deliver long-term sustainable value to shareholders. The Group is also developing a fund management business and targets to achieve US$5 billion in Assets Under Management (AUM) by 2023.",
    "website": "http://www.cdl.com.sg",
    "zipcode": "048619"
  },
  "CEDU.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "Dasin Retail Trust",
    "market": "sg_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "Dasin Retail Tr",
    "state": null,
    "summary": "Dasin Retail Trust is the only China retail property trust providing direct exposure to the fast-growing Guangdong-Hong Kong-Macau Greater Bay Area listed on the Main Board of the Singapore Exchange Securities Trading Limited (the SGX-ST) on 20 January 2017. Dasin Retail Trust's principal investment mandate is to invest in, own or develop land, uncompleted developments and income-producing real estate in Greater China (comprising People's Republic of China (PRC), Hong Kong and Macau), used primarily for retail purposes, as well as real estate-related assets, with an initial focus on retail malls. The portfolio of Dasin Retail Trust comprises seven retail malls strategically located in Foshan, Zhuhai and Zhongshan Cities in PRC2. Dasin Retail Trust is managed by Dasin Retail Trust Management Pte. Ltd. (the Trustee Manager). The Trustee-Manager's key objectives are to provide Unitholders of Dasin Retail Trust with an attractive rate of return on their investment through regular and stable distributions to Unitholders and to achieve long-term sustainable growth in DPU and net asset value per Unit, while maintaining an appropriate capital structure for Dasin Retail Trust.",
    "website": "http://dasintrust.com",
    "zipcode": "018981"
  },
  "CLLDF": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "CapitaLand Limited",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Real Estate",
    "short_name": "CAPITALAND LTD",
    "state": null,
    "summary": "CapitaLand Limited, together with its subsidiaries, develops, owns, leases, manages, and sells real estate properties in Singapore, rest of Asia, North America, Europe, the United Kingdom, and internationally. The company operates through CapitaLand Singapore & International, CapitaLand China, CapitaLand India, CapitaLand Lodging, and CapitaLand Financial segments. Its real estate portfolio includes commercial and retail properties; business parks; shopping malls; offices; homes; industrial and logistics properties; integrated and urban developments; and lodging and residential properties, as well as real estate investment trusts (REITs), business trusts, and private funds. The company also invests in real estate financial products and assets; and provides investment advisory and management services, as well as real estate asset management and investment management services. In addition, it offers management support and consultancy services. The company was formerly known as Pidemco Land Limited and changed its name to CapitaLand Limited in November 2000. CapitaLand Limited was incorporated in 1989 and is headquartered in Singapore. CapitaLand Limited is a subsidiary of CLA Real Estate Holdings Pte Ltd.",
    "website": "http://www.capitaland.com",
    "zipcode": "068912"
  },
  "CLLDY": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "CapitaLand Limited",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Real Estate",
    "short_name": "CAPITALAND LTD",
    "state": null,
    "summary": "CapitaLand Limited, together with its subsidiaries, develops, owns, leases, manages, and sells real estate properties in Singapore, rest of Asia, North America, Europe, the United Kingdom, and internationally. The company operates through CapitaLand Singapore & International, CapitaLand China, CapitaLand India, CapitaLand Lodging, and CapitaLand Financial segments. Its real estate portfolio includes commercial and retail properties; business parks; shopping malls; offices; homes; industrial and logistics properties; integrated and urban developments; and lodging and residential properties, as well as real estate investment trusts (REITs), business trusts, and private funds. The company also invests in real estate financial products and assets; and provides investment advisory and management services, as well as real estate asset management and investment management services. In addition, it offers management support and consultancy services. The company was formerly known as Pidemco Land Limited and changed its name to CapitaLand Limited in November 2000. CapitaLand Limited was incorporated in 1989 and is headquartered in Singapore. CapitaLand Limited is a subsidiary of CLA Real Estate Holdings Pte Ltd.",
    "website": "http://www.capitaland.com",
    "zipcode": "068912"
  },
  "E8Z.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "Roxy-Pacific Holdings Limited",
    "market": "sg_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "Roxy-Pacific",
    "state": null,
    "summary": "Roxy-Pacific Holdings Limited, an investment holding company, operates in the property and hospitality businesses in the Asia-Pacific. It operates through Property Development, Property Investment, and Hotel Ownership segments. The company primarily owns and operates the Grand Mercure Singapore Roxy hotel with 576 guest rooms and suites located in Singapore. It develops and sells residential and commercial units, including apartments and condominiums. In addition, it owns boutique hotels, including Noku Kyoto with 81 rooms located in Kyoto; and Noku Osaka with 154 rooms in Osaka City, Japan, as well as operates Noku Maldives resort with 50 villas in Maldives. In addition, the company owns 52 retail shops at the Roxy Square Shopping Centre in Singapore. Roxy-Pacific Holdings Limited was founded in 1967 and is based in Singapore. Roxy-Pacific Holdings Limited is a subsidiary of Kian Lam Investment Pte Ltd.",
    "website": "http://www.roxypacific.com.sg",
    "zipcode": "428769"
  },
  "ER0.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "KSH Holdings Limited",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Real Estate",
    "short_name": "KSH",
    "state": null,
    "summary": "KSH Holdings Limited, an investment holding company, operates as a construction builder and contractor for public and private sectors. The company operates through Construction, and Property Development and Management segments. It constructs residential, commercial, hospitality, and mixed-use development projects; and rents and sells properties. The company also operates approximately 13 hotels. It operates in Singapore, the People's Republic of China, Malaysia, Japan, Australia, and the United Kingdom. KSH Holdings Limited was incorporated in 1979 and is based in Singapore.",
    "website": "http://www.kimsengheng.com",
    "zipcode": "758108"
  },
  "F1E.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "Low Keng Huat (Singapore) Limited",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Real Estate",
    "short_name": "Low Keng Huat",
    "state": null,
    "summary": "Low Keng Huat (Singapore) Limited, an investment holding company, engages in the property development, hotels, and investment activities in Singapore, Malaysia, China, Australia, and internationally. It develops and sells properties; invests in properties, and shares in quoted and unquoted equities. The company is also involved in the ownership and operation of deluxe hotel under the Duxton Hotel brand in Perth; and other hospitality-related business, such as food and beverage business under the Carnivore brand, as well as in the ownership and operation of restaurants. In addition, it engages in the property fund management business. The company was founded in 1969 and is based in Singapore. Low Keng Huat (Singapore) Limited is a subsidiary of Consistent Record Sdn. Bhd.",
    "website": "http://www.lkhs.com.sg",
    "zipcode": "449269"
  },
  "F31.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "Fragrance Group Limited",
    "market": "sg_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "Fragrance",
    "state": null,
    "summary": "Fragrance Group Limited, an investment holding company, operates as a property developer in Singapore, Australia, and the United Kingdom. The company operates through Property Development, Commercial Investment, Hotel Operations, and Hospitality Investment segments. The Property Development segment develops and sells residential and commercial properties. The Commercial Investment segment is involved in the investment and rental of properties. The Hotel Operations segment manages hotels. The Hospitality Investment segment leases hotels to operators. The company also develops, deals, and trades in properties. Fragrance Group Limited was incorporated in 2000 and is based in Singapore.",
    "website": "http://www.fragrancegroup.com.sg",
    "zipcode": "119962"
  },
  "KLO.AX": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Real Estate - Development",
    "long_name": "Kingsland Global Ltd.",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "KINGSLAND CDI 1:1",
    "state": null,
    "summary": "Kingsland Global Ltd. engages in the real estate development and related activities in Cambodia and Malaysia. It also provides business and management consultancy services. The company was founded in 1978 and is based in Singapore.",
    "website": "http://www.kingslandglobal.sg",
    "zipcode": "628718"
  },
  "O10.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "Far East Orchard Limited",
    "market": "sg_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "Far East Orchard",
    "state": null,
    "summary": "Far East Orchard Limited, an investment holding company, engages in the property development and investment activities in Singapore, Australia, New Zealand, the United Kingdom, and internationally. It primarily develops residential, commercial, hospitality, and purpose-built student accommodation properties. The company also owns and operates hospitality assets, including hotels. In addition, its portfolio includes medical suites in Novena Medical Center and Novena Specialist Center. The company was formerly known as Orchard Parade Holdings Limited and changed its name to Far East Orchard Limited in July 2012. The company was founded in 1967 and is headquartered in Singapore. Far East Orchard Limited is a subsidiary of Far East Organization Pte. Ltd.",
    "website": "http://www.fareastorchard.com.sg",
    "zipcode": "247905"
  },
  "O3B.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Real Estate - Development",
    "long_name": "Yoma Strategic Holdings Ltd.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "YOMA STRAT.HLDG.-LOC-SD 1",
    "state": null,
    "summary": "Yoma Strategic Holdings Ltd., an investment holding company, engages in the real estate, automotive and heavy equipment, consumer, financial, and investment businesses in Singapore, Myanmar, and the People's Republic of China. The company's Real Estate Development segment develops and sells land and properties. Its Real Estate Services segment provides project management, design, and estate management services, as well as property leasing services and operates golf estate. The company's Automotive & Heavy Equipment segment supplies and sells agriculture and construction equipment, passenger and commercial vehicles, and related parts, as well as offers maintenance services. Its Consumer segment engages in the operation of restaurants; bottling and distribution of beverages; food wholesale business; and provision of logistics services. The company's Financial Services segment provides vehicle financing; and invests in mobile financial services. Its Investments segment invests in the infrastructure, tourism, power agricultural, and other sectors, as well as leases investment properties. The company also engages in leasing automotive equipment. The company was formerly known as Sea View Hotel Limited. Yoma Strategic Holdings Ltd. was incorporated in 1962 and is based in Singapore.",
    "website": "http://www.yomastrategic.com",
    "zipcode": "239002"
  },
  "O5P.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Real Estate - Development",
    "long_name": "Far East Orchard Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "FAR EAST ORCHA.-LOC-SD-50",
    "state": null,
    "summary": "Far East Orchard Limited, an investment holding company, engages in the property development and investment activities in Singapore, Australia, New Zealand, the United Kingdom, and internationally. It primarily develops residential, commercial, hospitality, and purpose-built student accommodation properties. The company also owns and operates hospitality assets, including hotels. In addition, its portfolio includes medical suites in Novena Medical Center and Novena Specialist Center. The company was formerly known as Orchard Parade Holdings Limited and changed its name to Far East Orchard Limited in July 2012. The company was founded in 1967 and is headquartered in Singapore. Far East Orchard Limited is a subsidiary of Far East Organization Pte. Ltd.",
    "website": "http://www.fareastorchard.com.sg",
    "zipcode": "247905"
  },
  "PLF.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Real Estate - Development",
    "long_name": "CapitaLand Limited",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Real Estate",
    "short_name": "CAPITALAND LTD  SD1",
    "state": null,
    "summary": "CapitaLand Limited, together with its subsidiaries, develops, owns, leases, manages, and sells real estate properties in Singapore, rest of Asia, North America, Europe, the United Kingdom, and internationally. The company operates through CapitaLand Singapore & International, CapitaLand China, CapitaLand India, CapitaLand Lodging, and CapitaLand Financial segments. Its real estate portfolio includes commercial and retail properties; business parks; shopping malls; offices; homes; industrial and logistics properties; integrated and urban developments; and lodging and residential properties, as well as real estate investment trusts (REITs), business trusts, and private funds. The company also invests in real estate financial products and assets; and provides investment advisory and management services, as well as real estate asset management and investment management services. In addition, it offers management support and consultancy services. The company was formerly known as Pidemco Land Limited and changed its name to CapitaLand Limited in November 2000. CapitaLand Limited was incorporated in 1989 and is headquartered in Singapore. CapitaLand Limited is a subsidiary of CLA Real Estate Holdings Pte Ltd.",
    "website": "http://www.capitaland.com",
    "zipcode": "068912"
  },
  "QK5.SG": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Real Estate - Development",
    "long_name": "Chip Eng Seng Corporation Ltd",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Real Estate",
    "short_name": "Chip Eng Seng Corp. Ltd. Regist",
    "state": null,
    "summary": "Chip Eng Seng Corporation Ltd, an investment holding company, engages in the construction, property development and investment, and hospitality businesses primarily in Singapore, Australia, Malaysia, and Maldives. The company operates through Construction, Property Developments, Property Investments, Hospitality, and Corporate and Others segments. The company constructs public housing projects, condominiums, executive condominiums, modular buildings, and industrial and commercial projects; develops residential, commercial, and industrial properties, as well as manages development projects; and provides real estate management and consultancy services. It also leases investment properties, such as shophouses, office buildings, and industrial properties; operates hotels and island resort; and invests in marketable securities. In addition, the company acts as general building contractor; manufactures and trades in precast products; and provides general building engineering, financial, and treasury services. Further, the company operates Repton-brand pre-school center in Singapore. Chip Eng Seng Corporation Ltd was incorporated in 1998 and is headquartered in Singapore.",
    "website": "http://www.chipengseng.com.sg",
    "zipcode": "169877"
  },
  "S9B.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "Amcorp Global Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "Amcorp Global",
    "state": null,
    "summary": "Amcorp Global Limited, an investment holding company, operates as a real estate developer and investor in Singapore, New Zealand, Australia, Vietnam, and Malaysia. The company operates through three segments: Property Development, Hotel Operations, and Investment Properties. It undertakes residential, commercial, and industrial property development projects; invests in properties, such as hotels in Australia; and provides short-term accommodation and industrial space for rent in New Zealand. The company was formerly known as TEE Land Limited and changed its name to Amcorp Global Limited in April 2020. Amcorp Global Limited was incorporated in 2012 and is based in Singapore. Amcorp Global Limited is a subsidiary of Amcorp Supreme Pte. Ltd.",
    "website": "http://www.teeland.com.sg",
    "zipcode": "659591"
  },
  "SXTN.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Real Estate - Development",
    "long_name": "SingHaiyi Group Ltd.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Real Estate",
    "short_name": "SINGHAIYI GROUP",
    "state": null,
    "summary": "SingHaiyi Group Ltd., an investment holding company, develops, owns, and manages real estate properties in Singapore, Malaysia, Australia, and the United States. It operates through Property Development; and Property and Property Related Investment segments. The company develops and sells residential properties; owns and manages residential, commercial, retail, and other properties; and leases Tri-County Mall. It also provides property development advisory services. The company was formerly known as SingXpress Land Ltd. and changed its name to SingHaiyi Group Ltd. in March 2013. SingHaiyi Group Ltd. was incorporated in 1988 and is headquartered in Singapore. SingHaiyi Group Ltd. is a subsidiary of Haiyi Holdings Pte Ltd.",
    "website": "http://www.singhaiyi.com",
    "zipcode": "068809"
  },
  "U14.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "UOL Group Limited",
    "market": "sg_market",
    "market_cap": "Mid Cap",
    "sector": "Real Estate",
    "short_name": "UOL",
    "state": null,
    "summary": "UOL Group Limited primarily engages in the property development and investment, and hotel businesses. Its property development projects include residential units, office towers and shopping malls, and hotels and serviced suites. The company also owns and/or manages approximately 30 hotels, resorts, and services suites under the Pan Pacific, PARKROYAL COLLECTION, and PARKROYAL names in Asia, Oceania, and North America with approximately 10,000 rooms in its portfolio. In addition, it is involved in the rental and management of serviced suites; lease of commercial offices and retail malls; operation of restaurants; and management and operation of health and beauty retreats and facilities. Further, the company engages in the retail of computer hardware and software, as well as provision of systems integration and networking infrastructure services; property trading business; management and licensing of trademarks; and business development activity. Additionally, it provides treasury, retail management consultancy, project and property management, property management agency, and trustee services; technical, accounting, and marketing and related services to hotels and serviced suites; and information technology related products and services, as well as invests in quoted and unquoted financial assets. It has operations in Singapore, Australia, Vietnam, Malaysia, the People's Republic of China, Myanmar, the United Kingdom, and internationally. The company was formerly known as United Overseas Land Limited and changed its name to UOL Group Limited in 2006. UOL Group Limited was founded in 1963 and is based in Singapore.",
    "website": "http://www.uol.com.sg",
    "zipcode": "307591"
  },
  "U1O.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Real Estate - Development",
    "long_name": "UOL Group Limited",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Real Estate",
    "short_name": "UOL GROUP LTD.  SD 1",
    "state": null,
    "summary": "UOL Group Limited primarily engages in the property development and investment, and hotel businesses. Its property development projects include residential units, office towers and shopping malls, and hotels and serviced suites. The company also owns and/or manages approximately 30 hotels, resorts, and services suites under the Pan Pacific, PARKROYAL COLLECTION, and PARKROYAL names in Asia, Oceania, and North America with approximately 10,000 rooms in its portfolio. In addition, it is involved in the rental and management of serviced suites; lease of commercial offices and retail malls; operation of restaurants; and management and operation of health and beauty retreats and facilities. Further, the company engages in the retail of computer hardware and software, as well as provision of systems integration and networking infrastructure services; property trading business; management and licensing of trademarks; and business development activity. Additionally, it provides treasury, retail management consultancy, project and property management, property management agency, and trustee services; technical, accounting, and marketing and related services to hotels and serviced suites; and information technology related products and services, as well as invests in quoted and unquoted financial assets. It has operations in Singapore, Australia, Vietnam, Malaysia, the People's Republic of China, Myanmar, the United Kingdom, and internationally. The company was formerly known as United Overseas Land Limited and changed its name to UOL Group Limited in 2006. UOL Group Limited was founded in 1963 and is based in Singapore.",
    "website": "http://www.uol.com.sg",
    "zipcode": "307591"
  },
  "UOLGF": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "UOL Group Limited",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Real Estate",
    "short_name": "UOL GROUP LIMITED",
    "state": null,
    "summary": "UOL Group Limited primarily engages in the property development and investment, and hotel businesses. Its property development projects include residential units, office towers and shopping malls, and hotels and serviced suites. The company also owns and/or manages approximately 30 hotels, resorts, and services suites under the Pan Pacific, PARKROYAL COLLECTION, and PARKROYAL names in Asia, Oceania, and North America with approximately 10,000 rooms in its portfolio. In addition, it is involved in the rental and management of serviced suites; lease of commercial offices and retail malls; operation of restaurants; and management and operation of health and beauty retreats and facilities. Further, the company engages in the retail of computer hardware and software, as well as provision of systems integration and networking infrastructure services; property trading business; management and licensing of trademarks; and business development activity. Additionally, it provides treasury, retail management consultancy, project and property management, property management agency, and trustee services; technical, accounting, and marketing and related services to hotels and serviced suites; and information technology related products and services, as well as invests in quoted and unquoted financial assets. It has operations in Singapore, Australia, Vietnam, Malaysia, the People's Republic of China, Myanmar, the United Kingdom, and internationally. The company was formerly known as United Overseas Land Limited and changed its name to UOL Group Limited in 2006. UOL Group Limited was founded in 1963 and is based in Singapore.",
    "website": "http://www.uol.com.sg",
    "zipcode": "307591"
  },
  "UOLGY": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "UOL Group Limited",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Real Estate",
    "short_name": "UOL GROUP LIMITED",
    "state": null,
    "summary": "UOL Group Limited primarily engages in the property development and investment, and hotel businesses. Its property development projects include residential units, office towers and shopping malls, and hotels and serviced suites. The company also owns and/or manages approximately 30 hotels, resorts, and services suites under the Pan Pacific, PARKROYAL COLLECTION, and PARKROYAL names in Asia, Oceania, and North America with approximately 10,000 rooms in its portfolio. In addition, it is involved in the rental and management of serviced suites; lease of commercial offices and retail malls; operation of restaurants; and management and operation of health and beauty retreats and facilities. Further, the company engages in the retail of computer hardware and software, as well as provision of systems integration and networking infrastructure services; property trading business; management and licensing of trademarks; and business development activity. Additionally, it provides treasury, retail management consultancy, project and property management, property management agency, and trustee services; technical, accounting, and marketing and related services to hotels and serviced suites; and information technology related products and services, as well as invests in quoted and unquoted financial assets. It has operations in Singapore, Australia, Vietnam, Malaysia, the People's Republic of China, Myanmar, the United Kingdom, and internationally. The company was formerly known as United Overseas Land Limited and changed its name to UOL Group Limited in 2006. UOL Group Limited was founded in 1963 and is based in Singapore.",
    "website": "http://www.uol.com.sg",
    "zipcode": "307591"
  },
  "UV1.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "Regal International Group Ltd.",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "Regal Intl",
    "state": null,
    "summary": "Regal International Group Ltd., an investment holding company, engages in the property development activities in Malaysia and Singapore. It operates through Property Development, Construction, Trading, and Others segments. It is involved in the development and sale of shophouses, terrace houses, apartments, landed properties, corporate parks, residential properties, condominiums, and commercial and industrial units. The company also engages in construction works and property investment activities. In addition, it provides mortgage consultancy, real estate and property management, sales commission, painting work, real estate agency and valuation, and asset and portfolio management services; develops, constructs, and trades in construction materials; supplies concrete and concrete products; and rents machinery and properties. Further, the company engages in steelworks and supplies. The company was incorporated in 2005 and is based in Singapore.",
    "website": "http://www.regalinternational.com.sg",
    "zipcode": "729484"
  },
  "XEUA.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Real Estate - Development",
    "long_name": "KSH Holdings Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Real Estate",
    "short_name": "KSH HOLDINGS LTD",
    "state": null,
    "summary": "KSH Holdings Limited, an investment holding company, operates as a construction builder and contractor for public and private sectors. The company operates through Construction, and Property Development and Management segments. It constructs residential, commercial, hospitality, and mixed-use development projects; and rents and sells properties. The company also operates approximately 13 hotels. It operates in Singapore, the People's Republic of China, Malaysia, Japan, Australia, and the United Kingdom. KSH Holdings Limited was incorporated in 1979 and is based in Singapore.",
    "website": "http://www.kimsengheng.com",
    "zipcode": "758108"
  },
  "YLG.SG": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Real Estate - Development",
    "long_name": "Yanlord Land Group Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "Yanlord Land Group Ltd. Registe",
    "state": null,
    "summary": "Yanlord Land Group Limited, an investment holding company, engages in the property development activities in the People's Republic of China. The company operates through Property Development, Property Investment and Hotel Operations, Property Management, and Others segments. It develops residential properties, including apartment complexes and villas; and commercial and integrated properties, such as offices, serviced apartments, and shopping malls for sale and lease. The company also offers property management services for residential properties comprising security, building, equipment maintenance and repair, facilities management, child-care, and other ancillary services, as well as organizes social and residential community functions. In addition, it is involved in the leasing of properties and operation of hotels; hotels and serviced apartment management; trading of building materials and hardware; operation of kindergarten; installation, maintenance, sale, and repair of elevators; project and business management; agribusiness exhibition and trade emporium center; manufacture of electronic components and connectors; die casting and precision engineering; mineral sand mining; transplant technology; and production of seedlings and bio-electronic products. Further, the company provides landscaping and gardening, investment management, city redevelopment, food and beverage, leisure and fitness, tourism investment, asset management, information technology, education and training, cultural and art performance, construction engineering, tourism and travel, financial, and consultancy services. Additionally, it is involved in the civil, electrical, and mechanical engineering and contract businesses; supply, delivery, testing, and commissioning of telecommunication equipment and after-sales service; and supply and installation of building materials, industrial laundry, and automotive parts and equipment. The company was founded in 1993 and is based in Singapore.",
    "website": "http://www.yanlordland.com",
    "zipcode": "038989"
  },
  "YMAIF": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Real Estate - Development",
    "long_name": "Yoma Strategic Holdings Ltd.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Real Estate",
    "short_name": "YOMA STRATEGIC HOLDINGS LIMITED",
    "state": null,
    "summary": "Yoma Strategic Holdings Ltd., an investment holding company, engages in the real estate, automotive and heavy equipment, consumer, financial, and investment businesses in Singapore, Myanmar, and the People's Republic of China. The company's Real Estate Development segment develops and sells land and properties. Its Real Estate Services segment provides project management, design, and estate management services, as well as property leasing services and operates golf estate. The company's Automotive & Heavy Equipment segment supplies and sells agriculture and construction equipment, passenger and commercial vehicles, and related parts, as well as offers maintenance services. Its Consumer segment engages in the operation of restaurants; bottling and distribution of beverages; food wholesale business; and provision of logistics services. The company's Financial Services segment provides vehicle financing; and invests in mobile financial services. Its Investments segment invests in the infrastructure, tourism, power agricultural, and other sectors, as well as leases investment properties. The company also engages in leasing automotive equipment. The company was formerly known as Sea View Hotel Limited. Yoma Strategic Holdings Ltd. was incorporated in 1962 and is based in Singapore.",
    "website": "http://www.yomastrategic.com",
    "zipcode": "239002"
  },
  "Z25.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "Yanlord Land Group Limited",
    "market": "sg_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "Yanlord Land",
    "state": null,
    "summary": "Yanlord Land Group Limited, an investment holding company, engages in the property development activities in the People's Republic of China. The company operates through Property Development, Property Investment and Hotel Operations, Property Management, and Others segments. It develops residential properties, including apartment complexes and villas; and commercial and integrated properties, such as offices, serviced apartments, and shopping malls for sale and lease. The company also offers property management services for residential properties comprising security, building, equipment maintenance and repair, facilities management, child-care, and other ancillary services, as well as organizes social and residential community functions. In addition, it is involved in the leasing of properties and operation of hotels; hotels and serviced apartment management; trading of building materials and hardware; operation of kindergarten; installation, maintenance, sale, and repair of elevators; project and business management; agribusiness exhibition and trade emporium center; manufacture of electronic components and connectors; die casting and precision engineering; mineral sand mining; transplant technology; and production of seedlings and bio-electronic products. Further, the company provides landscaping and gardening, investment management, city redevelopment, food and beverage, leisure and fitness, tourism investment, asset management, information technology, education and training, cultural and art performance, construction engineering, tourism and travel, financial, and consultancy services. Additionally, it is involved in the civil, electrical, and mechanical engineering and contract businesses; supply, delivery, testing, and commissioning of telecommunication equipment and after-sales service; and supply and installation of building materials, industrial laundry, and automotive parts and equipment. The company was founded in 1993 and is based in Singapore.",
    "website": "http://www.yanlordland.com",
    "zipcode": "038989"
  },
  "Z59.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Real Estate - Development",
    "long_name": "Yoma Strategic Holdings Ltd.",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Real Estate",
    "short_name": "Yoma Strategic",
    "state": null,
    "summary": "Yoma Strategic Holdings Ltd., an investment holding company, engages in the real estate, automotive and heavy equipment, consumer, financial, and investment businesses in Singapore, Myanmar, and the People's Republic of China. The company's Real Estate Development segment develops and sells land and properties. Its Real Estate Services segment provides project management, design, and estate management services, as well as property leasing services and operates golf estate. The company's Automotive & Heavy Equipment segment supplies and sells agriculture and construction equipment, passenger and commercial vehicles, and related parts, as well as offers maintenance services. Its Consumer segment engages in the operation of restaurants; bottling and distribution of beverages; food wholesale business; and provision of logistics services. The company's Financial Services segment provides vehicle financing; and invests in mobile financial services. Its Investments segment invests in the infrastructure, tourism, power agricultural, and other sectors, as well as leases investment properties. The company also engages in leasing automotive equipment. The company was formerly known as Sea View Hotel Limited. Yoma Strategic Holdings Ltd. was incorporated in 1962 and is based in Singapore.",
    "website": "http://www.yomastrategic.com",
    "zipcode": "239002"
  }
}
