{
    "1730.HK": {
        "short_name": "LHN",
        "long_name": "LHN Limited",
        "summary": "LHN Limited, an investment holding company, provides real estate management services in Singapore, Hong Kong, Indonesia, Thailand, Cambodia, Myanmar, and internationally. It operates through three segments: Space Optimisation Business, Facilities Management Business, and Logistics Services Business. The company leases and manages industrial spaces, such as industrial buildings, factories, warehouses, and land for open storage; commercial spaces consisting of traditional offices, suited offices, recreational spaces, sports facilities, and children enhanced spaces; and residential spaces. It also offers facilities management services, which include security management services; car park management services; and repair and maintenance, cleaning, landscaping, and amenities and utilities. In addition, the company operates a fleet of prime movers, trailers, oil tankers, ISO tankers, and trucks to handle the transportation of various types of oil, and oil-related and petrochemical products, as well as containers. Further, it provides container depot management services, which include container handling and storage, surveying, cleaning, and repair and maintenance services to shipping lines and container leasing companies. The company also engages in the food and beverage catering business. The company was founded in 1991 and is headquartered in Singapore. LHN Limited is a subsidiary of Fragrance Ltd.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "088702",
        "website": "http://www.lhngroup.com",
        "full_time_employees": 633
    },
    "41O.SI": {
        "short_name": "$ LHN",
        "long_name": "LHN Limited",
        "summary": "LHN Limited, an investment holding company, provides real estate management services in Singapore, Hong Kong, Indonesia, Thailand, Cambodia, Myanmar, and internationally. It operates through three segments: Space Optimisation Business, Facilities Management Business, and Logistics Services Business. The company leases and manages industrial spaces, such as industrial buildings, factories, warehouses, and land for open storage; commercial spaces consisting of traditional offices, suited offices, recreational spaces, sports facilities, and children enhanced spaces; and residential spaces. It also offers facilities management services, which include security management services; car park management services; and repair and maintenance, cleaning, landscaping, and amenities and utilities. In addition, the company operates a fleet of prime movers, trailers, oil tankers, ISO tankers, and trucks to handle the transportation of various types of oil, and oil-related and petrochemical products, as well as containers. Further, it provides container depot management services, which include container handling and storage, surveying, cleaning, and repair and maintenance services to shipping lines and container leasing companies. The company also engages in the food and beverage catering business. The company was founded in 1991 and is headquartered in Singapore. LHN Limited is a subsidiary of Fragrance Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "088702",
        "website": "http://www.lhngroup.com",
        "full_time_employees": 633
    },
    "584.SI": {
        "short_name": "$ OEL",
        "long_name": "OEL (Holdings) Limited",
        "summary": "OEL (Holdings) Limited, an investment holding company, engages in the property management business in Singapore. It is also involved in the rental of properties; and ship repairing business. The company was formerly known as Oakwell Engineering Limited and changed its name to OEL (Holdings) Limited in November 2013. OEL (Holdings) Limited was founded in 1984 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "038988",
        "website": "http://www.ohldg.com",
        "full_time_employees": 39
    },
    "5DM.SI": {
        "short_name": "Ying Li Intl",
        "long_name": "Ying Li International Real Estate Limited",
        "summary": "Ying Li International Real Estate Limited, an investment holding company, engages in the development, sale, rental, management, and ownership of commercial and residential properties in Singapore, Hong Kong, and the People's Republic of China. It operates through Property Development and Property Investment segments. The company primarily develops office space, retail mall, car park, and other projects. It is also involved in the provision of property consulting, selling, marketing, management, and leasing services, as well as corporate management consultancy services; and purchase of construction material and equipment. The company was founded in 1993 and is headquartered in Singapore. Ying Li International Real Estate Limited is a subsidiary of State Alpha Limited.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "38986",
        "website": "http://www.yingligj.com",
        "full_time_employees": null
    },
    "5JK.SI": {
        "short_name": "Hiap Hoe",
        "long_name": "Hiap Hoe Limited",
        "summary": "Hiap Hoe Limited, an investment holding company, operates as a real estate company that develops a portfolio of hospitality, retail, commercial, and residential assets in Australia, Singapore, and the United Kingdom. It develops luxury and mid-tier residential, and hotel-cum-commercial properties. It operates through Development Properties, Rental, Leisure, Hotel Operations, and Trading Investments segments. The Development Properties segment acquires land/property and develops them into residential/industrial/commercial properties for sale. The Rental segment engages in the business of renting space under the investment properties, as well as plant and equipment. The Leisure segment provides leisure and recreational facilities, including bowling, billiard, and amusement centers under the SuperBowl brand. The Hotel Operations segment operates hotels under the brand names of Ramada Singapore, Days Hotel Singapore, Holiday Inn Express Trafford City, Four Points by Sheraton Melbourne, and Aloft Perth. The Trading Investments segment trades in a portfolio of quoted and unquoted investments. The company is also involved in the provision of civil engineering, general road construction, and sub-contractor works. Hiap Hoe Limited was incorporated in 1994 and is based in Singapore. Hiap Hoe Limited is a subsidiary of Hiap Hoe Holdings Pte Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "329983",
        "website": "http://www.hiaphoe.com",
        "full_time_employees": null
    },
    "5WF.SI": {
        "short_name": "$ ISOTeam",
        "long_name": "ISOTeam Ltd.",
        "summary": "ISOTeam Ltd. operates in the building maintenance and estate upgrading industry in Singapore. The company operates through Repair and Redecoration; Addition and Alteration; Coatings and Paintings; and Others segments. It offers waterproofing and reroofing, improvement works, and routine maintenance services, as well as repainting, repair, and redecoration services; neighborhood renewal, hawker centers upgrading, estate upgrading, home improvement, and electrical load upgrading services; and interior design and fitting out, designing and building, home retrofit and fit-out, and property maintenance and enhancement services. The company also provides thermal insulating plasters, anti-slip floor coatings, green label intumescent fire proofing coatings, composite timber decking, renewable energy installation, and cockroaches and odor remover services; vertical gardens, horticultural, maintenance, floating wetlands, niche landscaping, and gardening and landscaping maintenance services; home care and upgrading, and general repairs and maintenance services; home painting services; and architectural and engineering solutions, including commercial addition and alteration works, building services, engineering works, architectural and commercial interior construction solutions, and advanced building technologies. In addition, it offers eco-friendly, architectural and protective, fireproofing, and industrial coating, as well as new build painting services; and electrical and mechanical ventilation works, air conditioning works, sanitary and plumbing, solar panel installation, and energy performance contract services. Further, the company leases boom, scissor, personnel, and forklifts, as well as telehandlers; and provides bike sharing services through a mobile app. It primarily serves town councils, government bodies, and private sector building owners. ISOTeam Ltd. was founded in 1998 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "498829",
        "website": "http://isoteam.com.sg",
        "full_time_employees": 366
    },
    "A30.SI": {
        "short_name": "Aspial",
        "long_name": "Aspial Corporation Limited",
        "summary": "Aspial Corporation Limited, an investment holding company, operates in the real estate, financial service, and jewelry businesses in Singapore, Australia, Malaysia, Hong Kong, Germany, and Ireland. It is involved in the provision of pawn broking and secured lending services; and retail and trading of pre-loved jewelry, timepieces, and bags, as well as branded merchandise. The company engages in the jewelry retail business under the brands of Lee Hwa Jewellery, Goldheart, and Niessing; and gold bullion broking and dealing activities. It is involved in the rental of properties; provision of management and other support services; and jewellery manufacturing and wholesaling activities; operates hotels, resorts, and serviced residences, as well as offers real estate consultancy services. The company was formerly known as Lee Hwa Holdings Ltd. and changed its name to Aspial Corporation Limited in 2001. Aspial Corporation Limited was founded in 1970 and is based in Singapore. Aspial Corporation Limited is a subsidiary of MLHS Holdings Pte. Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "408864",
        "website": "http://www.aspial.com",
        "full_time_employees": null
    },
    "ACNDF": {
        "short_name": "ASCENDAS INDIA TRUST",
        "long_name": "Ascendas India Trust",
        "summary": "Ascendas India Trust (a-iTrust) was listed on the Singapore Exchange Securities Trading Limited (SGX-ST) in August 2007 as the first Indian property trust in Asia. Its principal objective is to own income-producing real estate used primarily as business space in India. a-iTrust may also develop and acquire land or uncompleted developments primarily to be used as business space, with the objective of holding the properties upon completion. As at 31 December 2019, a-iTrust's asset under management stands at S$2.1 billion. a-iTrust's portfolio comprises seven world-class IT business parks and one logistics park in India, namely the International Tech Park Bangalore, International Tech Park Chennai and CyberVale in Chennai, CyberPearl, The V and aVance in Hyderabad, aVance in Pune and Arshiya warehouses near Mumbai. a-iTrust is structured as a business trust, offering stable income distributions similar to a real estate investment trust. a-iTrust focuses on enhancing shareholder value by actively managing existing properties, developing vacant land in its portfolio, and acquiring new properties. a-iTrust is managed by Ascendas Property Fund Trustee Pte. Ltd. The trustee-manager is a wholly owned subsidiary of Singapore-listed CapitaLand Limited, one of Asia's largest diversified real estate groups.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "138522",
        "website": "http://www.a-itrust.com",
        "full_time_employees": null
    },
    "AZA.SI": {
        "short_name": "IPC Corp",
        "long_name": "IPC Corporation Ltd",
        "summary": "IPC Corporation Ltd, an investment holding company, engages in property development and investment activities in Singapore and the People's Republic of China. It invests in and resells properties; and provides property consulting services. The company also provides hospitality services; and sells and distributes telecommunication products, and computer system boards and peripheral products. In addition, it offers hotel and club management services. IPC Corporation Ltd was incorporated in 1985 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "535224",
        "website": "http://www.ipc.com.sg",
        "full_time_employees": null
    },
    "CLN.SI": {
        "short_name": "APAC Realty",
        "long_name": "APAC Realty Limited",
        "summary": "APAC Realty Limited, an investment holding company, provides real estate services in Singapore. It operates through Real estate brokerage income, Rental income, and Others segments. The company offers property brokerage services for primary and secondary home sales, as well as for the rental and resale of residential, commercial, and industrial properties under the ERA brand name. It also holds the ERA regional master franchise rights for 17 countries in the Asia Pacific; and franchise rights for Singapore for Coldwell Banker, a real estate office and franchising company in the United States. In addition, the company provides training programs and courses for real estate agents in preparation for professional certification exams; management services for real estate developments; and auction services for financial institutions and property owners, as well as undertakes valuation works on behalf of clients, such as financial institutions, government agencies, and property owners. Further, it engages in the rental of investment properties, workstations, lockers, and furniture products; and provision of professional indemnity insurance, administration, business conference, real estate consultancy, and miscellaneous services. The company was founded in 1982 and is headquartered in Singapore. APAC Realty Limited is a subsidiary of Asia Pacific Realty Holdings Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "319394",
        "website": "http://www.apacrealty.com.sg",
        "full_time_employees": 151
    },
    "CY6U.SI": {
        "short_name": "Ascendas-iTrust",
        "long_name": "Ascendas India Trust",
        "summary": "Ascendas India Trust (a-iTrust) was listed on the Singapore Exchange Securities Trading Limited (SGX-ST) in August 2007 as the first Indian property trust in Asia. Its principal objective is to own income-producing real estate used primarily as business space in India. a-iTrust may also develop and acquire land or uncompleted developments primarily to be used as business space, with the objective of holding the properties upon completion. As at 31 December 2019, a-iTrust's asset under management stands at S$2.1 billion. a-iTrust's portfolio comprises seven world-class IT business parks and one logistics park in India, namely the International Tech Park Bangalore, International Tech Park Chennai and CyberVale in Chennai, CyberPearl, The V and aVance in Hyderabad, aVance in Pune and Arshiya warehouses near Mumbai. a-iTrust is structured as a business trust, offering stable income distributions similar to a real estate investment trust. a-iTrust focuses on enhancing shareholder value by actively managing existing properties, developing vacant land in its portfolio, and acquiring new properties. a-iTrust is managed by Ascendas Property Fund Trustee Pte. Ltd. The trustee-manager is a wholly owned subsidiary of Singapore-listed CapitaLand Limited, one of Asia's largest diversified real estate groups.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "138522",
        "website": "http://www.a-itrust.com",
        "full_time_employees": null
    },
    "F86.SI": {
        "short_name": "MYP",
        "long_name": "MYP Ltd.",
        "summary": "MYP Ltd., an investment holding company, invests in real estate properties in Singapore. Its property portfolio includes commercial buildings and residential properties. The company was formerly known as Cougar Logistics Corporation Ltd. and changed its name to MYP Ltd. in December 2012. MYP Ltd. was incorporated in 2005 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "049910",
        "website": "http://www.myp.com.sg",
        "full_time_employees": null
    },
    "GPS.AX": {
        "short_name": "GPS FPO",
        "long_name": "GPS Alliance Holdings Limited",
        "summary": "GPS Alliance Holdings Limited provides real estate agency services in Singapore. It operates through the divisions Real Estate Agency Business, Property Development and Investment Business, and Home Solutions Business. The company offers various real estate services, including corporate leasing services, investment sales, commercial and industrial sales, en-bloc sales, full-time sales, training and seminars, and local and international project sales. It also provides consultancy services to investors and property developers; marketing and sales services; and property management services. Further, the company offers interior design and fit-out works, including kitchen and wardrobe cabinetry, partition work, and installation of false ceilings and fire doors. The company was founded in 2010 and is based in Singapore.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "629175",
        "website": "http://www.gpsalliance.com.au",
        "full_time_employees": null
    },
    "H19.SI": {
        "short_name": "Hwa Hong",
        "long_name": "Hwa Hong Corporation Limited",
        "summary": "Hwa Hong Corporation Limited, an investment holding company, engages in the investment, development, and rental of properties in Singapore and the United Kingdom. It operates in three segments: Rental, Investments, and Corporate and Others. The company is involved in the leasing of residential and commercial properties; provision of real estate investment advisory services; and ownership of warehouse for rental and storage, as well as packing and trading of edible oils. It also provides business management and consultancy services. The company was formerly known as Hwa Hong Manufacturing Company Limited and changed its name to Hwa Hong Corporation Limited in January 1985. Hwa Hong Corporation Limited was incorporated in 1952 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "058672",
        "website": "http://www.hwahongcorp.com",
        "full_time_employees": null
    },
    "H30.SI": {
        "short_name": "Hong Fok",
        "long_name": "Hong Fok Corporation Limited",
        "summary": "Hong Fok Corporation Limited, an investment holding company, engages in the investment, construction, development, and management of properties in Singapore and Hong Kong. The company develops residential and other properties; invests in office, shop, restaurant, retail, residential, and commercial properties; and provides property maintenance services. It also offers investment trading and investment management services. The company was incorporated in 1967 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "199555",
        "website": "http://www.hongfok.com.sg",
        "full_time_employees": null
    },
    "IPEN.F": {
        "short_name": "IPC CORP. -LOC.-",
        "long_name": "IPC Corporation Ltd",
        "summary": "IPC Corporation Ltd, an investment holding company, engages in property development and investment activities in Singapore and the People's Republic of China. It invests in and resells properties; and provides property consulting services. The company also provides hospitality services; and sells and distributes telecommunication products, and computer system boards and peripheral products. In addition, it offers hotel and club management services. IPC Corporation Ltd was incorporated in 1985 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "535224",
        "website": "http://www.ipc.com.sg",
        "full_time_employees": null
    },
    "OYY.SI": {
        "short_name": "PropNex",
        "long_name": "PropNex Limited",
        "summary": "PropNex Limited provides real estate services in Singapore and internationally. It operates through five segments: Real Estate Agency Services, Real Estate Project Marketing Services, Administrative Support Services, Property Management Services, and Training Services. The Real Estate Agency Services segment engages in the sale and lease of public and private residential and commercial/industrial properties, including housing and development board flats and executive condominiums, private condominiums, landed properties, retail shops, offices, and factories. The Real Estate Project Marketing Services is involved in the sale of new private residential development projects for third-party property developers. The Administrative Support Services provides space and other ancillary services. The Property Management segment offers property management, building diagnostics, and facility management solutions, including property, M&E and facility maintenance, communal and lifestyle services, security management, defects resolution, project management, absentee landlord management system, contractors' accreditation, and facility management system. The Training Services segment offers real estate related courses and training programs to salespersons. The company was founded in 1996 and is headquartered in Singapore. PropNex Limited is a subsidiary of P&N Holdings Pte. Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "310480",
        "website": "http://www.propnex.com",
        "full_time_employees": null
    },
    "S3N.SI": {
        "short_name": "OKH Global",
        "long_name": "OKH Global Ltd.",
        "summary": "OKH Global Ltd., an investment holding company, engages in the integrated property development activities primarily focusing on logistics and industrial properties in Singapore. It operates through Construction Contractor, Property Development, and Property Investment segments. The Construction Contractor segment provides general builder and construction contractor, as well as general engineering services; and sells construction materials. The Property Development segment develops industrial properties. The Property Investment segment leases investment properties. OKH Global Ltd. was founded in 1998 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "387383",
        "website": "http://www.okh.com.sg",
        "full_time_employees": null
    },
    "SIB.SG": {
        "short_name": "Ying Li Intl Real Estate Ltd. R",
        "long_name": "Ying Li International Real Estate Limited",
        "summary": "Ying Li International Real Estate Limited, an investment holding company, engages in the development, sale, rental, management, and ownership of commercial and residential properties in Singapore, Hong Kong, and the People's Republic of China. It operates through Property Development and Property Investment segments. The company primarily develops office space, retail mall, car park, and other projects. It is also involved in the provision of property consulting, selling, marketing, management, and leasing services, as well as corporate management consultancy services; and purchase of construction material and equipment. The company was founded in 1993 and is headquartered in Singapore. Ying Li International Real Estate Limited is a subsidiary of State Alpha Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "38986",
        "website": "http://www.yingligj.com",
        "full_time_employees": null
    },
    "T24.SI": {
        "short_name": "Tuan Sing",
        "long_name": "Tuan Sing Holdings Limited",
        "summary": "Tuan Sing Holdings Limited, an investment holding company, engages in the property development and investment, hotels investment, and industrial services businesses in Singapore, Australia, China, Malaysia, and Indonesia. The company's Property segment develops and invests in residential, commercial, and industrial properties; and provides property management services. Its Hotels Investment segment owns two five-star hotels managed by Hyatt International in Melbourne and Perth, Australia. The company's Industrial Services segment trades in and markets various industrial commodities, including coal, rubber, and aluminum; and manufactures and markets polypropylene woven bags. Its Other Investments segment manufactures and sells printed circuit boards for customers in the automotive, computer peripheral, consumer electronics, telecommunication, healthcare, and instrument and control sectors; and retails golf-related lifestyle products, as well as deals in footwear. The company was formerly known as Hytex Limited and changed its name to Tuan Sing Holdings Limited in 1983. Tuan Sing Holdings Limited was founded in 1969 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "238697",
        "website": "http://www.tuansing.com",
        "full_time_employees": 551
    },
    "TUS.F": {
        "short_name": "TUAN SING HLDGS-LOC.SD-01",
        "long_name": "Tuan Sing Holdings Limited",
        "summary": "Tuan Sing Holdings Limited, an investment holding company, engages in the property development and investment, hotels investment, and industrial services businesses in Singapore, Australia, China, Malaysia, and Indonesia. The company's Property segment develops and invests in residential, commercial, and industrial properties; and provides property management services. Its Hotels Investment segment owns two five-star hotels managed by Hyatt International in Melbourne and Perth, Australia. The company's Industrial Services segment trades in and markets various industrial commodities, including coal, rubber, and aluminum; and manufactures and markets polypropylene woven bags. Its Other Investments segment manufactures and sells printed circuit boards for customers in the automotive, computer peripheral, consumer electronics, telecommunication, healthcare, and instrument and control sectors; and retails golf-related lifestyle products, as well as deals in footwear. The company was formerly known as Hytex Limited and changed its name to Tuan Sing Holdings Limited in 1983. Tuan Sing Holdings Limited was founded in 1969 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "238697",
        "website": "http://www.tuansing.com",
        "full_time_employees": 551
    }
}