{"1H2.SI": {"short_name": "$ Olive Tree", "long_name": "Olive Tree Estates Limited", "summary": "Olive Tree Estates Limited, a real estate company, engages in the property development activities in Singapore. It operates through three segments: Investment, property development, and property rental. The company develops and invests in two light industrial properties in Singapore under the Tagore 8 and One Commonwealth names. It also engages in the property management activities. Olive Tree Estates Limited is based in Singapore. Olive Tree Estates Limited is a subsidiary of Chiu Teng Enterprises Pte Ltd.", "currency": "SGD", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "5RF.SI": {"short_name": "$ Mercurius", "long_name": "Mercurius Capital Investment Limited", "summary": "Mercurius Capital Investment Limited, an investment holding company, engages in the development and investment of properties in Malaysia. It is involved in the real estate-related investments; property-related activities; holding of investments in residential, hospitality, commercial, industrial, and mix development properties; and trading of properties. The company is based in Singapore.", "currency": "SGD", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "AWS.SI": {"short_name": "GYP Properties", "long_name": "GYP Properties Limited", "summary": "GYP Properties Limited, an investment holding company, invests in, develops, manages, and rents real estate properties in Singapore and New Zealand. It operates through Property and Others segments. The company has a property portfolio of 303,051 square meters of land comprising commercial, retail, and residential assets. Its principal projects include Remarkables Residences, Bellfield Estate, and Pakuranga Precinct. The company also invests in equity shares. The company was formerly known as Global Yellow Pages Limited and changed its name to GYP Properties Limited in October 2018. GYP Properties Limited was founded in 1967 and is headquartered in Singapore.", "currency": "SGD", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "F17.SI": {"short_name": "GuocoLand", "long_name": "GuocoLand Limited", "summary": "GuocoLand Limited, an investment holding company, invests, develops, and manages various properties. It operates through GuocoLand Singapore, GuocoLand China, GuocoLand Malaysia, GuocoLand Vietnam, and Others segments. The company develops residential, hospitality, commercial, retail, mixed-use, and integrated properties; rents properties; and operates and manages hotels. It also offers management, marketing, and maintenance services. The company was formerly known as First Capital Corporation Ltd. and changed its name to GuocoLand Limited in November 2002. GuocoLand Limited was incorporated in 1976 and is headquartered in Singapore. GuocoLand Limited is a subsidiary of GuocoLand Assets Pte. Ltd.", "currency": "SGD", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "FS8.MU": {"short_name": "GUOCOLAND LTD.  SD 1", "long_name": "GuocoLand Limited", "summary": "GuocoLand Limited, an investment holding company, invests, develops, and manages various properties. It operates through GuocoLand Singapore, GuocoLand China, GuocoLand Malaysia, GuocoLand Vietnam, and Others segments. The company develops residential, hospitality, commercial, retail, mixed-use, and integrated properties; rents properties; and operates and manages hotels. It also offers management, marketing, and maintenance services. The company was formerly known as First Capital Corporation Ltd. and changed its name to GuocoLand Limited in November 2002. GuocoLand Limited was incorporated in 1976 and is headquartered in Singapore. GuocoLand Limited is a subsidiary of GuocoLand Assets Pte. Ltd.", "currency": "EUR", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "MUN", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "LJ3.SI": {"short_name": "OUE", "long_name": "OUE Limited", "summary": "OUE Limited, an investment holding company, develops, owns, and operates various real estate properties in Singapore, the People's Republic of China, the United States, Japan, and internationally. The company operates through Property Investments, Hospitality, Property Development, Healthcare, and Consumer segments. It develops and manages assets across the commercial, hospitality, retail, residential, and healthcare sectors. The company also engages in the rental of investment properties; development and sale of residential and other properties; operation of hotels; provision of hotel management services; management of real estate investment trusts; and operation of food and beverage outlets. In addition, it develops medical real estate, healthcare-related assets, and integrated mixed-use developments; provides healthcare services; and management of healthcare investments trusts. Further, the company is involved in the restaurant and investment trading operations; and operation and management of healthcare facilities, including 12 nursing homes. The company was formerly known as Overseas Union Enterprise Limited and changed its name to OUE Limited in August 2013. The company was incorporated in 1964 and is based in Singapore. OUE Limited is a subsidiary of OUE Realty Pte. Ltd.", "currency": "SGD", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "OUE1.F": {"short_name": "OUE SD-.20", "long_name": "OUE Limited", "summary": "OUE Limited, an investment holding company, develops, owns, and operates various real estate properties in Singapore, the People's Republic of China, the United States, Japan, and internationally. The company operates through Property Investments, Hospitality, Property Development, Healthcare, and Consumer segments. It develops and manages assets across the commercial, hospitality, retail, residential, and healthcare sectors. The company also engages in the rental of investment properties; development and sale of residential and other properties; operation of hotels; provision of hotel management services; management of real estate investment trusts; and operation of food and beverage outlets. In addition, it develops medical real estate, healthcare-related assets, and integrated mixed-use developments; provides healthcare services; and management of healthcare investments trusts. Further, the company is involved in the restaurant and investment trading operations; and operation and management of healthcare facilities, including 12 nursing homes. The company was formerly known as Overseas Union Enterprise Limited and changed its name to OUE Limited in August 2013. The company was incorporated in 1964 and is based in Singapore. OUE Limited is a subsidiary of OUE Realty Pte. Ltd.", "currency": "EUR", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "FRA", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "TQ5.SI": {"short_name": "FRASERS PROPERTY LIMITED", "long_name": "Frasers Property Limited", "summary": "Frasers Property Limited, an investment holding company, owns, develops, and manages an integrated portfolio of properties. The company's asset portfolio includes business parks; and residential, retail, commercial, and industrial and logistics properties in Australia, Europe, China, and Southeast Asia. It owns and/or operates serviced apartments and hotels in approximately 70 cities across Asia, Australia, Europe, the Middle East, and Africa. The company also acts as a sponsor of two real estate investment trusts (REITs) listed on the SGX-ST that comprises Frasers Centrepoint Trust, and Frasers Logistics & Commercial Trust focused on retail, commercial, and industrial properties; and one stapled trust listed on the SGX-ST that include Frasers Hospitality Trust focused on hospitality properties; and two REITs listed on the Stock Exchange of Thailand, which include Frasers Property (Thailand) Public Company Limited, a sponsor of Frasers Property Thailand Industrial Freehold & Leasehold REIT that focuses on industrial and logistics properties in Thailand, as well as Golden Ventures Leasehold Real Estate Investment Trust, which focuses on commercial properties. The company was formerly known as Frasers Centrepoint Limited and changed its name to Frasers Property Limited in February 2018. Frasers Property Limited was incorporated in 1963 and is headquartered in Singapore.", "currency": "SGD", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "UILCF": {"short_name": "UNITED INDUSTRIAL CORPORATION (", "long_name": "United Industrial Corporation Limited", "summary": "United Industrial Corporation Limited, an investment holding company, develops properties for investment and trading purposes in Singapore and internationally. The company operates through five segments: Property Investment, Property Trading, Hotel Operations, Technology Operations, and Others. It develops commercial office, commercial retail, and residential properties. The company also offers property management, project management, and marketing services; invests in and operates hotels; invests in retail centers; trades in computers and related products; retails computer hardware and software; and provides information technology, systems integration, and networking infrastructure services. In addition, it invests in shares and provides marketing, management and other related services. United Industrial Corporation Limited was incorporated in 1963 and is based in Singapore.", "currency": "USD", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "PNK", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "W05.SI": {"short_name": "Wing Tai", "long_name": "Wing Tai Holdings Limited", "summary": "Wing Tai Holdings Limited, an investment holding company, engages in the property investment and development, lifestyle retail, and hospitality management businesses in Singapore, Malaysia, Australia, Japan, and the People's Republic of China. The company develops and sells residential and commercial properties; and invests in and manages serviced residences under the Lanson Place brand name, as well as manages a boutique hotel in Hong Kong. It is also involved in the retail of garments; the provision of IT consultancy, and consultancy and advisory services; and project management and property maintenance activities, as well as development of e-commerce applications. The company was founded in 1955 and is headquartered in Singapore.", "currency": "SGD", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}}