{
    "CMOU.SI": {
        "short_name": "KepPacOakReitUSD",
        "long_name": "Keppel Pacific Oak US REIT",
        "summary": "Keppel Pacific Oak US REIT (KORE) is a distinctive office REIT listed on the main board of the Singapore Exchange Securities Trading Limited (SGX-ST) on 9 November 2017. KORE's investment strategy is to principally invest in a diversified portfolio of income-producing commercial assets and real estate-related assets in key growth markets of the United States (US) with positive economic and office fundamentals that generally outpace the US national average, and the average of the gateway cities, so as to provide sustainable distributions and strong total returns for Unitholders. KORE is managed by Keppel Pacific Oak US REIT Management Pte. Ltd., which is jointly owned by two Sponsors, Keppel Capital and KPA. KORE's portfolio comprises a balanced mix of 13 freehold office buildings and business campuses across eight key growth markets driven by innovation and technology in the US. The assets have a combined value of US$1.27 billion and an aggregate net lettable area of over 4.7 million sf. KORE has an extensive and diversified tenant base, some of which are from the growth and defensive sectors such as technology, as well as medical and healthcare, which will continue to support and drive growth. KORE is a technology-focused office REIT with over 50% of the portfolio located in the technology hubs of Seattle, Denver and Austin. The remainder of the portfolio is located in the key growth markets of Houston, Dallas, Orlando, Sacramento and Atlanta.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "CNNU.SI": {
        "short_name": "CromwellReit EUR",
        "long_name": "Cromwell European Real Estate Investment Trust",
        "summary": "Cromwell European Real Estate Investment Trust (Â\u0093Cromwell European REITÂ\u0094 or Â\u0093CEREIT') is a real estate investment trust (Â\u0093REITÂ\u0094) with the principal investment strategy of investing, directly or indirectly, in a diversified portfolio of income-producing real estate assets in Europe that are used primarily for office, light industrial / logistics and retail purposes. CEREIT's portfolio comprises 95 properties with an appraised value of approximately Â\u00802,082 million as at the date of this announcement in or close to major gateway cities in the Netherlands, Italy, France, Poland, Germany, Finland and Denmark, with a balanced focus on the office and light industrial / logistics sectors. CEREIT's portfolio has an aggregate lettable area of approximately 1.4 million square metres, around 800 tenant-customers and a WALE3 profile of approximately 5.0 years as at 30 September 2020. CEREIT is the first REIT with a diversified pan-European portfolio listed on the Singapore Exchange Limited. CEREIT is managed by Cromwell EREIT Management Pte. Ltd., a wholly-owned subsidiary of CEREIT's sponsor, Cromwell Property Group9, a real estate investor and manager with operations in 14 countries, listed on the Australian Securities Exchange Ltd.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "HMN.SI": {
        "short_name": "Ascott Trust",
        "long_name": "Ascott Residence Trust",
        "summary": "Ascott Residence Trust (ART) is the largest hospitality trust in Asia Pacific with an asset value of S$7.6 billion as at 30 June 2020. Having listed on the Singapore Exchange Securities Trading Limited (SGX-ST) since March 2006, ART's objective is to invest primarily in income-producing real estate and real estate-related assets which are used or predominantly used as serviced residences, hotels, rental housing properties and other hospitality assets in any country in the world. ART is a constituent of the FTSE EPRA Nareit Global Real Estate Index Series (Global Developed Index). ART's international portfolio comprises 88 properties with more than 16,000 units in 39 cities across 15 countries in Asia Pacific, Europe and the United States of America as at 30 June 2020. ART's properties are mostly operated under the Ascott The Residence, Somerset, Quest and Citadines brands. They are mainly located in key gateway cities such as Barcelona, Berlin, Brussels, Guangzhou, Hanoi, Ho Chi Minh City, Jakarta, Kuala Lumpur, London, Manila, Melbourne, Munich, New York, Paris, Perth, Seoul, Shanghai, Singapore and Tokyo. ART is a stapled group comprising Ascott Real Estate Investment Trust (Ascott Reit) and Ascott Business Trust (Ascott BT). ART is managed by Ascott Residence Trust Management Limited (as manager of Ascott Reit) and Ascott Business Trust Management Pte. Ltd. (as trustee-manager of Ascott BT), both of which are wholly owned subsidiaries of Singapore-listed CapitaLand Limited, one of Asia's largest diversified real estate groups.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "JYEU.SI": {
        "short_name": "Lendlease Reit",
        "long_name": "Lendlease Global Commercial REIT",
        "summary": "Listed on 2 October 2019, Lendlease Global Commercial REIT (Â\u0093LREITÂ\u0094) is established with the principal investment strategy of investing, directly or indirectly, in a diversified portfolio of stabilised income-producing real estate assets located globally, which are used primarily for retail and/or office purposes. Its initial portfolio comprises a leasehold interest in, 313@somerset, a retail property located in Singapore and a freehold interest in Sky Complex, which comprises three office buildings located in Milan. The portfolio has a total net lettable area of approximately 1.3 million square feet, with an appraised value of S$1.4 billion as at 30 June 2020. LREIT is managed by Lendlease Global Commercial Trust Management Pte. Ltd., an indirect wholly-owned subsidiary of Lendlease. Its key objectives are to provide Unitholders with regular and stable distributions, achieve long-term growth in distribution per unit and net asset value per unit, and maintain an appropriate capital structure.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "SURVF": {
        "short_name": "SUNTEC REAL ESTATE INVESTMENT T",
        "long_name": "Suntec Real Estate Investment Trust",
        "summary": "Listed on 9 December 2004, Suntec REIT holds properties in Suntec City, Singapore's largest integrated commercial development (including one of Singapore's largest shopping Mall), a 60.8% interest in Suntec Singapore Convention & Exhibition Centre, a one-third interest in One Raffles Quay, a one-third interest in Marina Bay Financial Centre Towers 1 and 2 and the Marina Bay Link Mall, and a 30.0% interest in 9 Penang Road. Suntec REIT holds a 100% interest in a commercial building located at 177 Pacific Highway, Sydney, a 100% interest in a commercial building located at 21 Harris Street, Pyrmont, Sydney, a 50.0% interest in Southgate Complex, Melbourne, a 50.0% interest in a commercial building located at Olderfleet 477 Collins Street, Melbourne and a 100% interest in a commercial building located at 55 Currie Street, Adelaide, Australia. Its aim is to invest in income-producing real estate which is primarily used for office and/or retail purposes. Suntec REIT is managed by an external manager, ARA Trust Management (Suntec) Limited..",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "T82U.SI": {
        "short_name": "Suntec Reit",
        "long_name": "Suntec Real Estate Investment Trust",
        "summary": "Listed on 9 December 2004, Suntec REIT holds properties in Suntec City, Singapore's largest integrated commercial development (including one of Singapore's largest shopping Mall), a 60.8% interest in Suntec Singapore Convention & Exhibition Centre, a one-third interest in One Raffles Quay, a one-third interest in Marina Bay Financial Centre Towers 1 and 2 and the Marina Bay Link Mall, and a 30.0% interest in 9 Penang Road. Suntec REIT holds a 100% interest in a commercial building located at 177 Pacific Highway, Sydney, a 100% interest in a commercial building located at 21 Harris Street, Pyrmont, Sydney, a 50.0% interest in Southgate Complex, Melbourne, a 50.0% interest in a commercial building located at Olderfleet 477 Collins Street, Melbourne and a 100% interest in a commercial building located at 55 Currie Street, Adelaide, Australia. Its aim is to invest in income-producing real estate which is primarily used for office and/or retail purposes. Suntec REIT is managed by an external manager, ARA Trust Management (Suntec) Limited..",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    }
}