{
  "ACV.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "REIT - Hotel & Motel",
    "long_name": "Frasers Hospitality Trust",
    "market": "sg_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "FRASERS HOSPITALITY TRUST",
    "state": null,
    "summary": "FHT is the first global hotel and serviced residence trust listed in Singapore on 14 July 2014, comprising FH-REIT and FH-BT. It is established with the principal strategy of investing globally, on a long-term basis, in income-producing real estate assets used primarily for hospitality purposes. FHT provides investors exposure to one of the largest international hospitality portfolios by number of keys. Its geographically diversified portfolio of 15 quality assets are in prime locations across 9 key cities in Asia, Australia and Europe. With a combined appraised value of S$2.25 billion (as at 30 September 2020), these 9 hotels and 6 serviced residences are: Novotel Melbourne on Collins, Novotel Sydney Darling Square, Sofitel Sydney Wentworth, Fraser Suites Sydney, InterContinental Singapore, Fraser Suites Singapore, ibis Styles London Gloucester Road, Park International London, Fraser Suites Edinburgh, Fraser Suites Glasgow, Fraser Suites Queens Gate, Fraser Place Canary Wharf, ANA Crowne Plaza Kobe, The Westin Kuala Lumpur and Maritim Hotel Dresden. Collectively, they have a total of 3,913 rooms comprising 3,071 hotel rooms and 842 serviced residence units. FHT is managed by Frasers Hospitality Asset Management Pte. Ltd., the manager of FH-REIT, and Frasers Hospitality Trust Management Pte. Ltd., the trustee-manager of FH-BT (collectively known as the Managers). The Managers are wholly-owned subsidiaries of Frasers Property Limited which is the sponsor of FHT.",
    "website": "http://www.frasersproperty.com/reits/fht",
    "zipcode": "119958"
  },
  "J85.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "REIT - Hotel & Motel",
    "long_name": "CDL Hospitality Trusts",
    "market": "sg_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "CDL HTrust",
    "state": null,
    "summary": "CDL Hospitality Trusts (CDLHT) is one of Asia's leading hospitality trusts with assets under management of about S$2.9 billion as at 31 December 2020. CDLHT is a stapled group comprising CDL Hospitality Real Estate Investment Trust (H-REIT), a real estate investment trust, and CDL Hospitality Business Trust (HBT), a business trust. CDLHT was listed on the Singapore Exchange Securities Trading Limited on 19 July 2006. M&C REIT Management Limited is the manager of H-REIT, the first hotel real estate investment trust in Singapore, and M&C Business Trust Management Limited is the trustee-manager of HBT.",
    "website": "http://www.cdlht.com",
    "zipcode": "169662"
  },
  "XZL.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "USD",
    "exchange": "SES",
    "industry": "REIT - Hotel & Motel",
    "long_name": "ARA US Hospitality Trust",
    "market": "sg_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "ARA HTrust USD",
    "state": null,
    "summary": "Listed on the Singapore Exchange on 9 May 2019, ARA US Hospitality Trust is a hospitality stapled group comprising ARA US Hospitality Property Trust (ARA H-REIT) and ARA US Hospitality Management Trust (ARA H-BT). ARA US Hospitality Trust invests in income-producing real estate assets used primarily for hospitality purposes located in the United States. ARA US Hospitality Trust's portfolio currently comprises 41 select-service hotels with a total of 5,340 rooms across 22 states in the United States. ARA US Hospitality Trust is managed by ARA Trust Management (USH) Pte. Ltd. and ARA Business Trust Management (USH) Pte. Ltd., (collectively known as the Managers). The Managers are indirect wholly-owned subsidiaries of ARA Asset Management Limited.",
    "website": "http://www.araushotels.com",
    "zipcode": "38985"
  }
}
