{
    "MKS.F": {
        "short_name": "MERKO EHITUS (ASUT.) O.N.",
        "long_name": "AS Merko Ehitus",
        "summary": "AS Merko Ehitus, through its subsidiaries, engages in the construction and real estate development activities in the Republic of Estonia, Latvia, Lithuania, Norway, and Finland. It operates through Construction Service and Real Estate Development segments. The company constructs various buildings, including commercial and office buildings, retail and entertainment centers, hotels, and spas, as well as public buildings, dwellings, and specific industrial buildings. It also designs and constructs various infrastructure facilities, such as port, waste handling, and road infrastructure, including bridges, tunnels, overpasses, and roads; environment protection facilities; drinking water and waste water treatment facilities; water and sewerage mains; and other engineering and technical sites. In addition, the company provides electrical construction services comprising medium and high voltage substation, and cable line engineering configuration and construction; road maintenance and repair services; and machinery repair services. Further, it undertakes supervision of excavation works and condition of roads; and concrete works that include buildings and infrastructure constructed of prefabricated or concrete panels. Additionally, the company develops apartment projects, long-term real estate investments, and real estate projects for business purposes; and maintains and leases real estate properties. The company was founded in 1990 and is based in Tallinn, the Republic of Estonia. AS Merko Ehitus is a subsidiary of AS Riverito.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "11314",
        "website": "http://group.merko.ee",
        "full_time_employees": 592
    },
    "MRK1T.TL": {
        "short_name": "Merko Ehitus",
        "long_name": "AS Merko Ehitus",
        "summary": "AS Merko Ehitus, through its subsidiaries, engages in the construction and real estate development activities in the Republic of Estonia, Latvia, Lithuania, Norway, and Finland. It operates through Construction Service and Real Estate Development segments. The company constructs various buildings, including commercial and office buildings, retail and entertainment centers, hotels, and spas, as well as public buildings, dwellings, and specific industrial buildings. It also designs and constructs various infrastructure facilities, such as port, waste handling, and road infrastructure, including bridges, tunnels, overpasses, and roads; environment protection facilities; drinking water and waste water treatment facilities; water and sewerage mains; and other engineering and technical sites. In addition, the company provides electrical construction services comprising medium and high voltage substation, and cable line engineering configuration and construction; road maintenance and repair services; and machinery repair services. Further, it undertakes supervision of excavation works and condition of roads; and concrete works that include buildings and infrastructure constructed of prefabricated or concrete panels. Additionally, the company develops apartment projects, long-term real estate investments, and real estate projects for business purposes; and maintains and leases real estate properties. The company was founded in 1990 and is based in Tallinn, the Republic of Estonia. AS Merko Ehitus is a subsidiary of AS Riverito.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "11314",
        "website": "http://group.merko.ee",
        "full_time_employees": 592
    },
    "NCN1T.TL": {
        "short_name": "Nordecon",
        "long_name": "Nordecon AS",
        "summary": "Nordecon AS operates as a construction company in Estonia, Sweden, Finland, and Ukraine. It is involved in the general contracting and project management of buildings and infrastructure construction. The company engages in building office and industrial buildings, warehouses, non-residential buildings, and apartment buildings, as well as various storage facilities and tanks for agricultural purposes; and the design and preparation of concrete works, including complete loadbearing structure and basement solutions, concrete floors, frameworks, roofs, and ceilings. It also provides general contracting and project management services in the field of civil engineering works, including road construction and maintenance, engineering and environmental construction, rental of building equipment, and production of road construction materials, as well as rents, sells, and maintains road construction and earthworks machines. In addition, the company engages in designing and building concrete works, including bridges, overpasses, viaducts, tunnels, basements, and reinforced concrete frameworks for buildings, as well as railway base structures and erections; and building ports, berths, breakwaters, and bank protections, as well as in the construction of utility, water, and other civil engineering projects. Further, it is involved in traffic management operations; geodetic surveys; and coordination and development of the work of the construction material quarries. The company was formerly known as Nordecon International AS and changed its name to Nordecon AS in January 2011. Nordecon AS was founded in 1989 and is based in Tallinn, Estonia. Nordecon AS is a subsidiary of AS Nordic Contractors.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "10133",
        "website": "http://www.nordecon.com",
        "full_time_employees": 708
    }
}