{
    "CTVA.MX": {
        "short_name": "CORTEVA INC",
        "long_name": "Corteva, Inc.",
        "summary": "Corteva, Inc. operates in the agriculture business. It operates through two segments, Seed and Crop Protection. The Seed segment develops and supplies advanced germplasm and traits that produce optimum yield for farms. It offers trait technologies that enhance resistance to weather, disease, insects, and weeds, as well as food and nutritional characteristics. This segment also provides digital solutions that assist farmer decision-making with a view to optimize product selection, and maximize yield and profitability. The Crop Protection segment offers products that protect against weeds, insects and other pests, and disease, as well as enhances crop health above and below ground through nitrogen management and seed-applied technologies. This segment provides herbicides, insecticides, below-ground nitrogen stabilizers, and pasture and range management herbicides. It serves agricultural input industry. The company operates in the United States, Canada, Latin America, the Asia Pacific, Europe, the Middle East, and Africa. Corteva, Inc. is headquartered in Wilmington, Delaware.",
        "currency": "MXN",
        "sector": "Basic Materials",
        "industry": "Agricultural Chemicals",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Wilmington"
    },
    "GROG": {
        "short_name": "GROGENESIS INC",
        "long_name": "GroGenesis, Inc.",
        "summary": "GroGenesis, Inc., an agricultural services company, manufactures and sells plant growth surfactants in the United States and Canada. The company's flagship product is AgraBurstPRO, an organic input which enhances the uptake of various agricultural input applied to various plants. It serves farmers, fertilizer manufacturers, and commercial lawn and turf companies. The company was formerly known as Lisboa Leisure, Inc. and changed its name to GroGenesis, Inc. in November 2013. GroGenesis, Inc. was founded in 2010 and is headquartered in Sioux Falls, South Dakota.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Sioux Falls"
    },
    "NTRN.MX": {
        "short_name": "NUTRIEN LTD",
        "long_name": "Nutrien Ltd.",
        "summary": "Nutrien Ltd. provides crop inputs and services. The company offers potash, nitrogen, phosphate, and sulfate products. It also distributes crop nutrients, crop protection products, seeds, and merchandise products through operating approximately 2,000 retail locations. The company was incorporated in 2017 and is headquartered in Saskatoon, Canada.",
        "currency": "MXN",
        "sector": "Basic Materials",
        "industry": "Agricultural Chemicals",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Canada",
        "city": "Saskatoon"
    },
    "SPIR.AT": {
        "short_name": "THE HOUSE OF AGRICULTURE SPI",
        "long_name": "The House of Agriculture Spiroy S.A.",
        "summary": "The House of Agriculture Spiroy S.A. researches, produces, processes, and markets vegetable propagating materials. The company provides cotton, corn, alfalfa, cucumber, endive, watermelon, pumpkin, cauliflower, onion, cabbage, lettuce, eggplant, and broccoli seeds. It offers its products in Greece, Albania, Macedonia, Bulgaria, Romania, Spain, Africa, Turkey, the Middle East, Ukraine, Russia, Kazakhstan, and Moldova. The company was founded in 1947 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Agricultural Chemicals",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    }
}