{
    "000655.SZ": {
        "short_name": "SHANDONG JINLING M",
        "long_name": "Shandong Jinling Mining Co., Ltd.",
        "summary": "Shandong Jinling Mining Co., Ltd. engages in the mining of iron ore. The company produces and sells iron, copper, and cobalt powder. It also offers single rope cages and YPC hydraulic hammers; and engages in machining, power generation, and goods export activities. The company is based in Zibo, China. Shandong Jinling Mining Co., Ltd. is a subsidiary of Shandong Jinling Iron Mine.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zibo",
        "zipcode": null,
        "website": "http://www.sdjlky.com",
        "market_cap": 6358231552
    },
    "0276.HK": {
        "short_name": "MONGOLIA ENERGY",
        "long_name": "Mongolia Energy Corporation Limited",
        "summary": "Mongolia Energy Corporation Limited, an investment holding company, engages in the coal mining, processing, and other resources related operations in the People's Republic of China and Mongolia. It sells coking and thermal coal. The company's principal project is the Khushuut coking coal project in Western Mongolia. It holds approximately 13,981 hectares of exploration and mining concession areas for coal and ferrous resources in Western Mongolia at Khovd, Gobi Altay, Olon Bulag, and Bayan-Ulgii. The company is also involved in the provision of management services, and secretarial and nominee services, as well as mining and exploration advisory service; trading of coal; and operation of coal washing plants. Mongolia Energy Corporation Limited is based in Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.mongolia-energy.com",
        "market_cap": 210701120
    },
    "0639.HK": {
        "short_name": "SHOUGANG RES",
        "long_name": "Shougang Fushan Resources Group Limited",
        "summary": "Shougang Fushan Resources Group Limited, an investment holding company, engages in the mining and exploration of coal resources, and production and sale of raw and clean coking coal in the People's Republic of China. The company owns and operates the Xingwu coal mine covering an area of approximately 11.63 sq. km; the Jinjiazhuang coal mine covering an area of approximately 6.35 sq. km; and the Zhaiyadi coal mine covering an area of approximately 13.91 sq. km located in the Liulin County, Shanxi Province. It primarily serves steel manufacturers. The company was formerly known as Fushan International Energy Group Limited and changed its name to Shougang Fushan Resources Group Limited in May 2011. Shougang Fushan Resources Group Limited is based in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.shougang-resources.com.hk",
        "market_cap": 11972859904
    },
    "0975.HK": {
        "short_name": "MONGOL MINING",
        "long_name": "Mongolian Mining Corporation",
        "summary": "Mongolian Mining Corporation engages in the mining, processing, transportation, and sale of coking coal products. It owns and operates the Ukhaa Khudag and the Baruun Naran open-pit coking coal mines located in South Gobi province of Mongolia. The company also engages in the railway project management, airport operation and management, water exploration and supply management, and power supply project management activities; and trading of coal and machinery equipment. It sells its products primarily in China. The company was incorporated in 2010 and is headquartered in Ulaanbaatar, Mongolia.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Mongolia",
        "state": null,
        "city": "Ulaanbaatar",
        "zipcode": "14200",
        "website": "http://www.mmc.mn",
        "market_cap": 2747910656
    },
    "0QE.F": {
        "short_name": "CORON.GL.RES. CDIS/10/1",
        "long_name": "Coronado Global Resources Inc.",
        "summary": "Coronado Global Resources Inc., together with its subsidiaries, produces, markets, and exports metallurgical coal. It owns a portfolio of operating mines and development projects, including the Curragh mine complex located in the Bowen Basin of Australia; and the Buchanan, Logan, Greenbrier, Pangburn-Shaner-Fallowfield, Russell County, and Amonate mine complexes located in the Central Appalachian region of the United States. Coronado Global Resources Inc. was founded in 2011 and is headquartered in Brisbane, Australia. Coronado Global Resources Inc. operates as a subsidiary of Coronado Group LLC.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Brisbane",
        "zipcode": "4000",
        "website": "http://coronadoglobal.com.au",
        "market_cap": 596965056
    },
    "25U.F": {
        "short_name": "COKAL LTD",
        "long_name": "Cokal Limited",
        "summary": "Cokal Limited engages in the identification, exploration, and development of metallurgical coal. It has interests in four projects, including the Bumi Barito Mineral, Borneo Bara Prima, and Anugerah Alam Katingan projects, as well as an exploration tenement in Central Kalimantan, Indonesia. Cokal Limited was incorporated in 1998 and is based in Sydney, Australia.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.cokal.com.au",
        "market_cap": 39231120
    },
    "2798.HK": {
        "short_name": "PER ENERGY",
        "long_name": "Perennial Energy Holdings Limited",
        "summary": "Perennial Energy Holdings Limited, an investment holding company, operates as a coal mining company in the People's Republic of China. The company principally engages in the exploration and mining of coking coal and coal refinery. It operates three underground coal mines comprising Hongguo Mine with a licensed area of 3.0225 sq. km; Baogushan Mine covering a licensed area of 2.4736 sq. km; and Xiejiahegou Mine with a licensed area of 1.0135 sq. km located in Panzhou City, Guizhou Province. The company was founded in 1990 and is headquartered in Liupanshui, China. Perennial Energy Holdings Limited is a subsidiary of Spring Snow Management Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Liupanshui",
        "zipcode": null,
        "website": "http://www.perennialenergy.hk",
        "market_cap": 3600000000
    },
    "29X2.F": {
        "short_name": "MONGOLIAN MINING CRP.REGS",
        "long_name": "Mongolian Mining Corporation",
        "summary": "Mongolian Mining Corporation engages in the mining, processing, transportation, and sale of coking coal products. It owns and operates the Ukhaa Khudag and the Baruun Naran open-pit coking coal mines located in South Gobi province of Mongolia. The company also engages in the railway project management, airport operation and management, water exploration and supply management, and power supply project management activities; and trading of coal and machinery equipment. It sells its products primarily in China. The company was incorporated in 2010 and is headquartered in Ulaanbaatar, Mongolia.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Mongolia",
        "state": null,
        "city": "Ulaanbaatar",
        "zipcode": "14200",
        "website": "http://www.mmc.mn",
        "market_cap": 272072128
    },
    "2GF.F": {
        "short_name": "TERRACOM LTD",
        "long_name": "TerraCom Limited",
        "summary": "TerraCom Limited engages in the exploration, extraction, and production of coal in Australia and South Africa. It explores for hard and soft coking, thermal, and PCI coal. The company holds interests in the Northern Galilee project comprising the Hughenden and the Pentland projects covering an area of approximately 2,160 square kilometers, as well as the Clyde Park project that covers an area of approximately 133 square kilometers located in the Galilee Basin, Queensland; the Blair Athol Coal Mine project; and the Springsure project covering an area of approximately 1,178 square kilometers situated in the Central-Western Bowen basin coal mining district, Queensland. It also holds interests in the Kangala Colliery property; the New Clydesdale Colliery project; the Berenice Project; Ubuntu Colliery; North Block Complex Colliery; Cygnus project; and Eloff Project located in South Africa.The company was formerly known as Guildford Coal Limited and changed its name to TerraCom Limited in November 2015. TerraCom Limited was founded in 2009 and is based in Clermont, Australia.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Clermont",
        "zipcode": "4721",
        "website": "http://www.terracomresources.com",
        "market_cap": 60831512
    },
    "3315.T": {
        "short_name": "NIPPON COKE & ENGINEERING CO LT",
        "long_name": "Nippon Coke & Engineering Company, Limited",
        "summary": "Nippon Coke & Engineering Company, Limited manufactures and sells coke worldwide. The company also imports and sells coal; and manufactures and sells chemical engineering machinery and equipment. In addition, it processes industrial wastes; provides clean solutions for coal and coke combustion, and chemical machinery technologies; and operates port facilities that offers cargo handling services. The company was formerly known as Mitsui Mining Co., Ltd. and changed its name to Nippon Coke & Engineering Company, Limited in April 2009. Nippon Coke & Engineering Company, Limited was founded in 1889 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "135-6007",
        "website": "http://www.n-coke.com",
        "market_cap": 30558044160
    },
    "3CF.F": {
        "short_name": "CANAF INVESTMENTS",
        "long_name": "Canaf Investments Inc.",
        "summary": "Canaf Investments Inc., together with its subsidiaries, processes anthracite coal into de-volatized anthracite in Canada and South Africa. The company offers calcined anthracite to steel and ferromanganese manufacturers as a substitute product for coke. It also acquires, redevelops, and rents real estate properties primarily targeting the student and affordable housing market. The company was formerly known as Canaf Group Inc. and changed its name to Canaf Investments Inc. in July 2018. Canaf Investments Inc. was founded in 1996 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 3V6",
        "website": "http://www.canafinvestments.com",
        "market_cap": 4184073
    },
    "4RC1.F": {
        "short_name": "CORSA COAL CORP.",
        "long_name": "Corsa Coal Corp.",
        "summary": "Corsa Coal Corp. operates as a coal mining company. It is involved in the mining, processing, and selling metallurgical coal; and exploring, acquiring, and developing resource properties. The company produces and sells low volatile metallurgical coal used for the production of coke from its mines located in the Northern Appalachia coal region of the United States. It serves steel and coke producers. The company markets and sells its coal to customers in North America, South America, Asia, and Europe. Corsa Coal Corp. is headquartered in Friedens, Pennsylvania.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "PA",
        "city": "Friedens",
        "zipcode": "15541",
        "website": "http://www.corsacoal.com",
        "market_cap": 26491986
    },
    "5PM.F": {
        "short_name": "PRAIRIE MINING LTD.",
        "long_name": "Prairie Mining Limited",
        "summary": "Prairie Mining Limited, a coal development company, engages in the exploration, evaluation, appraisal, and development of resource projects in Australia and Poland. It develops and operates Jan Karski semi-soft coking coal mine in the Lublin Coal Basin, as well as Debiensko hard coking coal mine in Upper Silesia. The company was formerly known as Prairie Downs Metals Limited and changed its name to Prairie Mining Limited in June 2014. Prairie Mining Limited was incorporated in 1957 and is based in Perth, Australia.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6000",
        "website": "http://www.pdz.com.au",
        "market_cap": 39601652
    },
    "5R0.F": {
        "short_name": "RAMACO RES. INC.  DL-,01",
        "long_name": "Ramaco Resources, Inc.",
        "summary": "Ramaco Resources, Inc. produces and sells metallurgical coal. The company's development portfolio includes the Elk Creek project consisting of approximately 20,166 acres of controlled mineral and 25 seams located in southern West Virginia; the Berwind property comprising approximately 31,200 acres of controlled mineral and an area of Squire Jim seam coal deposits, which is situated on the border of West Virginia and Virginia; the Knox Creek property consisting of approximately 62,100 acres of controlled mineral that is located in Virginia; and the RAM Mine property comprising approximately 1,570 acres of controlled mineral, which is situated in southwestern Pennsylvania. The company serves blast furnace steel mills and coke plants in the United States, as well as international metallurgical coal consumers. The company was founded in 2015 and is headquartered in Lexington, Kentucky.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "KY",
        "city": "Lexington",
        "zipcode": "40507",
        "website": "http://www.ramacoresources.com",
        "market_cap": 208529424
    },
    "600397.SS": {
        "short_name": "ANYUAN COAL INDUSTRY GROUP CO L",
        "long_name": "Anyuan Coal Industry Group Co., Ltd.",
        "summary": "Anyuan Coal Industry Group Co., Ltd. engages in the coal mining and operation business. The company offers coal products, including smelting refined, washed steam, blended, sieved blended, washed fine, lump, etc. for use in iron and steel, thermal power, and coking plants. It is also involved thermal and refined coal, and mining material trading business. The company was formerly known as Anyuan Industrial Co., Ltd. and changed its name to Anyuan Coal Industry Group Co., Ltd. in August 2012. Anyuan Coal Industry Group Co., Ltd. was founded in 1999 and is based in Nanchang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanchang",
        "zipcode": "330025",
        "website": "http://www.jxcgc.com",
        "market_cap": 2801586688
    },
    "600408.SS": {
        "short_name": "SHANXI ANTAI GROUP",
        "long_name": "Shanxi Antai Group Co., Ltd.",
        "summary": "Shanxi Antai Group Co., Ltd. manufactures and sells coke, cement, pig iron, coal tar, ammonium sulfate, and benzole in China. It also engages in coal washing activities; and production and sale of power. The company was founded in 1993 and is based in Jiexiu, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jiexiu",
        "zipcode": null,
        "website": "http://www.antaigroup.com",
        "market_cap": 3705024000
    },
    "600740.SS": {
        "short_name": "SHANXI COKING COAL GROUP CO LTD",
        "long_name": "Shanxi Coking Co., Ltd.",
        "summary": "Shanxi Coking Co., Ltd. engages in the production and sale of coke and coke products in China. It offers methanol, carbon black, ammonium sulfate, industrial naphthalene, modified asphalt, pure benzene, etc.; and metallurgical coke and by-products. The company was founded in 1996 and is headquartered in Linfen, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Linfen",
        "zipcode": "041606",
        "website": "http://www.sxjh.com.cn",
        "market_cap": 10603227136
    },
    "600997.SS": {
        "short_name": "KAILUAN ENERGY CHEMICAL CO. LTD",
        "long_name": "Kailuan Energy Chemical Co.,Ltd.",
        "summary": "Kailuan Energy Chemical Co.,Ltd. engages in coal, coal chemical, and other businesses. It engages in coal mining, raw coal washing, and processing; and coking and coal chemical product production and sales activities. The company was formerly known as Kailuan Coal Co., Ltd. Kailuan Energy Chemical Co.,Ltd. was founded in 2001 and is based in Tangshan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tangshan",
        "zipcode": "063018",
        "website": "http://www.kkcc.com.cn",
        "market_cap": 12575376384
    },
    "601011.SS": {
        "short_name": "BAOTAILONG NEW MATERIALS CO LTD",
        "long_name": "Baotailong New Materials Co., Ltd.",
        "summary": "Baotailong New Materials Co., Ltd. provides coal chemical, clean energy, new material, and other products in China. The company produces coal tar, coke, coarse benzene, ammonium sulfate, washing foams, graphite papers, methanol, LPG, liquid oxygen and nitrogen, hydrocarbon, asphalt harmony products, graphene oxide powder and slurry, and graphene electrothermal films, as well as needle coke and building blocks. It is also involved in power and heat supply activities. The company was formerly known as Qitaihe Baotailong Coal & Coal Chemicals Public Co., Ltd. and changed its name to Baotailong New Materials Co., Ltd. in June 2016. Baotailong New Materials Co., Ltd. was founded in 2003 and is based in Qitaihe, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qitaihe",
        "zipcode": null,
        "website": "http://www.btlgf.com",
        "market_cap": 6836490752
    },
    "6885.HK": {
        "short_name": "JINMA ENERGY",
        "long_name": "Henan Jinma Energy Company Limited",
        "summary": "Henan Jinma Energy Company Limited, together with its subsidiaries, operates in the coking chemical industry in the People's Republic of China. The company's Coke segment produces and sells coke. Its Coking by-products segment produces and sells ammonium sulphater. The company's Refined Chemicals segment processes and sells benzene based and coal tar-based chemicals. Its Energy Products segment is involved in processing and sale of coke oven crude gas into coal gas; and extraction of LNG (liquefied natural gas) from coal gas, as well as hydrogen. The company's Trading segment trades in coal, coke, LNG, refined oil, coal mining equipment, and nonferrous materials. Its Other Services segment provides railway related storage and logistics, water, catering, and fire prevention and management services. The company is also involved in the research and development of environmental protection technology; project investment and investment management; and provision of multimodal transportation, warehouse, and railway freight transportation services. Henan Jinma Energy Company Limited was founded in 2003 and is based in Jiyuan, China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Jiyuan",
        "zipcode": "459000",
        "website": "http://www.hnjmny.com",
        "market_cap": 1927515520
    },
    "AHQ.AX": {
        "short_name": "ALLEGIANCE FPO",
        "long_name": "Allegiance Coal Limited",
        "summary": "Allegiance Coal Limited engages in the acquisition, exploration, and development of coal tenements. It holds interests in the New Elk metallurgical coal project located in Las Animas County, in southeast Colorado; Telkwa metallurgical coal project located in British Columbia, Canada; Kilmain Project located in the Bowen Basin; and The Back Creek Project located in the in the Surat Basin. The company was incorporated in 2011 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.allegiancecoal.com.au",
        "market_cap": 165688528
    },
    "AJL.AX": {
        "short_name": "AJ LUCAS FPO",
        "long_name": "AJ Lucas Group Limited",
        "summary": "AJ Lucas Group Limited, together with its subsidiaries, provides drilling services in Australia. The company operates in two segments: Drilling, and Oil and Gas. The Drilling segment offers drilling services primarily to the coal and coal seam gas industries for the degasification of coal mines and associated services, as well as commercial extraction of gas. This segment also provides a range of engineering services, including design of wells, drilling optimization, professional steering services, and specialized equipment for directional drilling programs. The Oil and Gas segment engages in the exploration, development, and commercialization of unconventional and conventional hydrocarbons in the United Kingdom. It serves energy, mining, and infrastructure sectors. The company was incorporated in 1993 and is headquartered in North Sydney, Australia. AJ Lucas Group Limited is a subsidiary of Kerogen Investments No. 1 (HK) Limited.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "North Sydney",
        "zipcode": "2060",
        "website": "http://www.lucas.com.au",
        "market_cap": 35888700
    },
    "AKM.AX": {
        "short_name": "ASPIRE FPO",
        "long_name": "Aspire Mining Limited",
        "summary": "Aspire Mining Limited engages in the exploration and development of metallurgical coal assets in Mongolia. The company primarily holds a 100% interest in the Ovoot coking coal project that consists of one mining license and two contiguous exploration licences across 130 square kilometers located in Northern Mongolia. It also holds a 90% interest in the Nuurstei coking coal project, as well as builds and operates rail from the town of Erdenet to the Ovoot Coking Coal Railway in northern Mongolia. Aspire Mining Limited was incorporated in 2006 and is based in Perth, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6000",
        "website": "http://www.aspiremininglimited.com",
        "market_cap": 42641508
    },
    "AMR": {
        "short_name": "Alpha Metallurgical Resources, ",
        "long_name": "Alpha Metallurgical Resources, Inc.",
        "summary": "Alpha Metallurgical Resources, Inc. operates as a mining company. It produces, processes, and sells met coal and thermal coal in Virginia and West Virginia. It operates through two segments, Met and CAPP-Thermal. The Met segments operates five active mines and two preparation plants in Virginia; and seventeen active mines and five preparation plants in West Virginia. The CAPP - Thermal segments operates one active mine and one preparation plant in West Virginia. The company was formerly known as Contura Energy, Inc. and changed its name to Alpha Metallurgical Resources, Inc. in February 2021. Alpha Metallurgical Resources, Inc. was incorporated in 2016 and is based in Bristol, Tennessee.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TN",
        "city": "Bristol",
        "zipcode": "37620",
        "website": "http://www.alphametresources.com",
        "market_cap": 278962656
    },
    "APF.L": {
        "short_name": "ANGLO PACIFIC GROUP PLC ORD 2P",
        "long_name": "Anglo Pacific Group plc",
        "summary": "Anglo Pacific Group plc operates as a natural resources royalty and streaming company. The company, together with its subsidiaries, engages in securing natural resources royalties and streams by acquisition and through investment in mining and exploration interests in coking and thermal coal, cobalt, iron ore, copper, vanadium, uranium, gold, silver, nickel, and anthracite properties primarily in Australia, North and South America, and Europe. Anglo Pacific Group plc was incorporated in 1967 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W1S 3JR",
        "website": "http://www.anglopacificgroup.com",
        "market_cap": 316378816
    },
    "APY.TO": {
        "short_name": "ANGLO PACIFIC GROUP PLC",
        "long_name": "Anglo Pacific Group plc",
        "summary": "Anglo Pacific Group plc operates as a natural resources royalty and streaming company. The company, together with its subsidiaries, engages in securing natural resources royalties and streams by acquisition and through investment in mining and exploration interests in coking and thermal coal, cobalt, iron ore, copper, vanadium, uranium, gold, silver, nickel, and anthracite properties primarily in Australia, North and South America, and Europe. Anglo Pacific Group plc was incorporated in 1967 and is headquartered in London, the United Kingdom.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W1S 3JR",
        "website": "http://www.anglopacificgroup.com",
        "market_cap": 499696960
    },
    "AREC": {
        "short_name": "American Resources Corporation",
        "long_name": "American Resources Corporation",
        "summary": "American Resources Corporation supplies raw materials for the global infrastructure marketplace. The company offers metallurgical coal and coal used in pulverized coal injection that are essential building blocks in the steel manufacturing process. It has a portfolio of operations located in the Central Appalachian basin of eastern Kentucky and southern West Virginia. The company was founded in 2006 and is headquartered in Fishers, Indiana.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "IN",
        "city": "Fishers",
        "zipcode": "46038",
        "website": "http://www.americanresourcescorp.com",
        "market_cap": 153428688
    },
    "ATU.AX": {
        "short_name": "ATRUM COAL FPO",
        "long_name": "Atrum Coal Limited",
        "summary": "Atrum Coal Limited explores for and develops metallurgical coal properties. It primarily offers coking coal for steel industry. The company's flagship asset is the 100%-owned Elan Hard coking coal project located in the Crowsnest Pass area of southern Alberta, Canada. It also explores for anthracite in British Columbia, Canada. The company was incorporated in 2011 and is based in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3000",
        "website": "http://www.atrumcoal.com",
        "market_cap": 25283928
    },
    "B0R.F": {
        "short_name": "BATHURST RESOURCES LTD.",
        "long_name": "Bathurst Resources Limited",
        "summary": "Bathurst Resources Limited, together with its subsidiaries, engages in the exploration, development, and production of coal in New Zealand. The company holds interests in the Canterbury Coal mine located in the west of Christchurch; the Stockton mine located in the north of Westport; and the Takitimu mine located in the Northwest of Invercargill. It also has interests in the Maramarua and Rotowaro mines in the Waikato region; and the Cascade and Escarpment mines near Westport. The company also exports coal. The company was formerly known as Bathurst Resources (New Zealand) Limited and changed its name to Bathurst Resources Limited in December 2013. The company was incorporated in 2013 and is based in Wellington, New Zealand.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "New Zealand",
        "state": null,
        "city": "Wellington",
        "zipcode": "6011",
        "website": "http://www.bathurst.co.nz",
        "market_cap": 33988448
    },
    "BCB.AX": {
        "short_name": "BOWENCOAL FPO",
        "long_name": "Bowen Coking Coal Limited",
        "summary": "Bowen Coking Coal Limited engages in the exploration and development of coal project with primary focus on metallurgical coal. It holds 100% interests in the Isaac River Project that covers an area of 14 square kilometers located in the Bowen Basin in Central Queensland; the Cooroorah Project located north of Blackwater; the Carborough project; and the Comet Ridge Project located South of the township of Comet, as well as 90% interests the Hillalong Coking Coal Project comprising of 31 sub-blocks covering an area of approximately 99 km2 located in the northern Bowen Basin. The company also holds interest in the Broadmeadow East coking coal project. Bowen Coking Coal Limited was incorporated in 1994 and is headquartered in Brisbane, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Brisbane",
        "zipcode": "4000",
        "website": "http://www.bowencokingcoal.com.au",
        "market_cap": 63423492
    },
    "BRL.AX": {
        "short_name": "BATHURST FPO",
        "long_name": "Bathurst Resources Limited",
        "summary": "Bathurst Resources Limited, together with its subsidiaries, engages in the exploration, development, and production of coal in New Zealand. The company holds interests in the Canterbury Coal mine located in the west of Christchurch; the Stockton mine located in the north of Westport; and the Takitimu mine located in the Northwest of Invercargill. It also has interests in the Maramarua and Rotowaro mines in the Waikato region; and the Cascade and Escarpment mines near Westport. The company also exports coal. The company was formerly known as Bathurst Resources (New Zealand) Limited and changed its name to Bathurst Resources Limited in December 2013. The company was incorporated in 2013 and is based in Wellington, New Zealand.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "New Zealand",
        "state": null,
        "city": "Wellington",
        "zipcode": "6011",
        "website": "http://www.bathurst.co.nz",
        "market_cap": 53741292
    },
    "BRNE": {
        "short_name": "BORNEO RESOURCE INVESTMENTS LTD",
        "long_name": "Borneo Resource Investments Ltd.",
        "summary": "Borneo Resource Investments Ltd. engages in the mineral exploration activities in the Republic of Indonesia. It primarily develops gold mines. The company holds interests in the Ratatotok South property covering approximately 8.6 hectares; and Ratatotok Southeast property covering approximately 14.7 hectare, which are located in the North Sulawesi area of the Indonesian archipelago. Borneo Resource Investments Ltd. was founded in 2009 and is headquartered in Admiralty, Hong Kong.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.borneore.com",
        "market_cap": 24159
    },
    "CAD.V": {
        "short_name": "COLONIAL COAL INTERNATIONAL COR",
        "long_name": "Colonial Coal International Corp.",
        "summary": "Colonial Coal International Corp., an exploration stage company, engages in the acquisition, exploration, and development of coal properties in Canada. It owns a 100% interest in the Huguenot coal project, which is a coking coal project with seventeen licenses covering an area of 9,531 hectares; and Gordon Creek metallurgical coal project comprising eight licenses covering an area of 9,607 hectares in the Liard Mining Division, northeastern British Columbia. The company was incorporated in 2007 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2T5",
        "website": "http://www.ccoal.ca",
        "market_cap": 111531520
    },
    "CAF.V": {
        "short_name": "CANAF INVESTMENTS INC",
        "long_name": "Canaf Investments Inc.",
        "summary": "Canaf Investments Inc., together with its subsidiaries, processes anthracite coal into de-volatized anthracite in Canada and South Africa. The company offers calcined anthracite to steel and ferromanganese manufacturers as a substitute product for coke. It also acquires, redevelops, and rents real estate properties primarily targeting the student and affordable housing market. The company was formerly known as Canaf Group Inc. and changed its name to Canaf Investments Inc. in July 2018. Canaf Investments Inc. was founded in 1996 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 3V6",
        "website": "http://www.canafinvestments.com",
        "market_cap": 5691144
    },
    "CCARF": {
        "short_name": "COLONIAL COAL INTL CORP",
        "long_name": "Colonial Coal International Corp.",
        "summary": "Colonial Coal International Corp., an exploration stage company, engages in the acquisition, exploration, and development of coal properties in Canada. It owns a 100% interest in the Huguenot coal project, which is a coking coal project with seventeen licenses covering an area of 9,531 hectares; and Gordon Creek metallurgical coal project comprising eight licenses covering an area of 9,607 hectares in the Liard Mining Division, northeastern British Columbia. The company was incorporated in 2007 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2T5",
        "website": "http://www.ccoal.ca",
        "market_cap": 80079560
    },
    "CKA.AX": {
        "short_name": "COKAL FPO",
        "long_name": "Cokal Limited",
        "summary": "Cokal Limited engages in the identification, exploration, and development of metallurgical coal. It has interests in four projects, including the Bumi Barito Mineral, Borneo Bara Prima, and Anugerah Alam Katingan projects, as well as an exploration tenement in Central Kalimantan, Indonesia. Cokal Limited was incorporated in 1998 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.cokal.com.au",
        "market_cap": 52701176
    },
    "COX.F": {
        "short_name": "COLONIAL COAL INTL CORP.",
        "long_name": "Colonial Coal International Corp.",
        "summary": "Colonial Coal International Corp., an exploration stage company, engages in the acquisition, exploration, and development of coal properties in Canada. It owns a 100% interest in the Huguenot coal project, which is a coking coal project with seventeen licenses covering an area of 9,531 hectares; and Gordon Creek metallurgical coal project comprising eight licenses covering an area of 9,607 hectares in the Liard Mining Division, northeastern British Columbia. The company was incorporated in 2007 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2T5",
        "website": "http://www.ccoal.ca",
        "market_cap": 75942008
    },
    "CRN.AX": {
        "short_name": "CORONADO CDI FORUS",
        "long_name": "Coronado Global Resources Inc.",
        "summary": "Coronado Global Resources Inc., together with its subsidiaries, produces, markets, and exports metallurgical coal. It owns a portfolio of operating mines and development projects, including the Curragh mine complex located in the Bowen Basin of Australia; and the Buchanan, Logan, Greenbrier, Pangburn-Shaner-Fallowfield, Russell County, and Amonate mine complexes located in the Central Appalachian region of the United States. Coronado Global Resources Inc. was founded in 2011 and is headquartered in Brisbane, Australia. Coronado Global Resources Inc. operates as a subsidiary of Coronado Group LLC.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Brisbane",
        "zipcode": "4000",
        "website": "http://coronadoglobal.com.au",
        "market_cap": 1294439552
    },
    "CRSXF": {
        "short_name": "CORSA COAL CORPORATION",
        "long_name": "Corsa Coal Corp.",
        "summary": "Corsa Coal Corp. operates as a coal mining company. It is involved in the mining, processing, and selling metallurgical coal; and exploring, acquiring, and developing resource properties. The company produces and sells low volatile metallurgical coal used for the production of coke from its mines located in the Northern Appalachia coal region of the United States. It serves steel and coke producers. The company markets and sells its coal to customers in North America, South America, Asia, and Europe. Corsa Coal Corp. is headquartered in Friedens, Pennsylvania.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Friedens",
        "zipcode": "15541",
        "website": "http://www.corsacoal.com",
        "market_cap": 29218118
    },
    "CSO.V": {
        "short_name": "CORSA COAL CORP",
        "long_name": "Corsa Coal Corp.",
        "summary": "Corsa Coal Corp. operates as a coal mining company. It is involved in the mining, processing, and selling metallurgical coal; and exploring, acquiring, and developing resource properties. The company produces and sells low volatile metallurgical coal used for the production of coke from its mines located in the Northern Appalachia coal region of the United States. It serves steel and coke producers. The company markets and sells its coal to customers in North America, South America, Asia, and Europe. Corsa Coal Corp. is headquartered in Friedens, Pennsylvania.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "United States",
        "state": "PA",
        "city": "Friedens",
        "zipcode": "15541",
        "website": "http://www.corsacoal.com",
        "market_cap": 37903680
    },
    "CVH4.F": {
        "short_name": "CST GRP LTD CONS.",
        "long_name": "CST Group Limited",
        "summary": "CST Group Limited, an investment holding company, engages in the exploration, development, mining, processing, and sale of coal in Canada. It operates through five segments: Mining Business, Investment in Financial Instruments, Property Investment, and Money Lending. The company is involved in the securities and property investment, money lending, and aircraft and vessel holding businesses; and provision of secretarial services. It operates in the People's Republic of China, Hong Kong, Canada, the United Kingdom, Singapore, and internationally. The company was formerly known as NetMind Financial Holdings Limited and changed its name to CST Group Limited in September 2017. CST Group Limited was founded in 1993 and is headquartered in Wanchai, Hong Kong.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wanchai",
        "zipcode": null,
        "website": "http://www.cstgrouphk.com",
        "market_cap": 99224216
    },
    "FU7.F": {
        "short_name": "SHOUGANG FUS.RES.GR.",
        "long_name": "Shougang Fushan Resources Group Limited",
        "summary": "Shougang Fushan Resources Group Limited, an investment holding company, engages in the mining and exploration of coal resources, and production and sale of raw and clean coking coal in the People's Republic of China. The company owns and operates the Xingwu coal mine covering an area of approximately 11.63 sq. km; the Jinjiazhuang coal mine covering an area of approximately 6.35 sq. km; and the Zhaiyadi coal mine covering an area of approximately 13.91 sq. km located in the Liulin County, Shanxi Province. It primarily serves steel manufacturers. The company was formerly known as Fushan International Energy Group Limited and changed its name to Shougang Fushan Resources Group Limited in May 2011. Shougang Fushan Resources Group Limited is based in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.shougang-resources.com.hk",
        "market_cap": 1290384256
    },
    "FW9.F": {
        "short_name": "AJ LUCAS GROUP LTD",
        "long_name": "AJ Lucas Group Limited",
        "summary": "AJ Lucas Group Limited, together with its subsidiaries, provides drilling services in Australia. The company operates in two segments: Drilling, and Oil and Gas. The Drilling segment offers drilling services primarily to the coal and coal seam gas industries for the degasification of coal mines and associated services, as well as commercial extraction of gas. This segment also provides a range of engineering services, including design of wells, drilling optimization, professional steering services, and specialized equipment for directional drilling programs. The Oil and Gas segment engages in the exploration, development, and commercialization of unconventional and conventional hydrocarbons in the United Kingdom. It serves energy, mining, and infrastructure sectors. The company was incorporated in 1993 and is headquartered in North Sydney, Australia. AJ Lucas Group Limited is a subsidiary of Kerogen Investments No. 1 (HK) Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "NSW",
        "city": "North Sydney",
        "zipcode": "2060",
        "website": "http://www.lucas.com.au",
        "market_cap": 21501520
    },
    "HCC": {
        "short_name": "Warrior Met Coal, Inc.",
        "long_name": "Warrior Met Coal, Inc.",
        "summary": "Warrior Met Coal, Inc. produces and exports non-thermal metallurgical coal for the steel industry. It operates two underground mines located in Alabama. The company sells its metallurgical coal to a customer base of blast furnace steel producers located primarily in Europe, South America, and Asia. It also sells natural gas, which is extracted as a byproduct from coal production. Warrior Met Coal, Inc. was founded in 2015 and is headquartered in Brookwood, Alabama.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "AL",
        "city": "Brookwood",
        "zipcode": "35444",
        "website": "http://warriormetcoal.com",
        "market_cap": 863671168
    },
    "HGR.F": {
        "short_name": "ANGLO PACIFIC GRP  LS-,02",
        "long_name": "Anglo Pacific Group plc",
        "summary": "Anglo Pacific Group plc operates as a natural resources royalty and streaming company. The company, together with its subsidiaries, engages in securing natural resources royalties and streams by acquisition and through investment in mining and exploration interests in coking and thermal coal, cobalt, iron ore, copper, vanadium, uranium, gold, silver, nickel, and anthracite properties primarily in Australia, North and South America, and Europe. Anglo Pacific Group plc was incorporated in 1967 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W1S 3JR",
        "website": "http://www.anglopacificgroup.com",
        "market_cap": 361167456
    },
    "J2S.F": {
        "short_name": "JASTRZEBSKA SPOL.WEGL.ZY5",
        "long_name": "Jastrzebska Spólka Weglowa S.A.",
        "summary": "Jastrzebska SpÃ³lka Weglowa S.A. engages in the extraction, production, and sale of coal, coke, and hydrocarbons. It consists of five coal mines, including Borynia-ZofiÃ³wka, Budryk, Jastrzebie-Bzie, KnurÃ³w-Szczyglowice, and PniÃ³wek. The company provides inspection and repair services for internal transport equipment; and technical research services, chemical and physiochemical analyses of minerals, solid liquid, and gaseous materials and products. It is also involved in the provision of railway lines; maintenance of railway infrastructure and equipment; construction and repairs of railway systems and facilities; building security and auxiliary services; and water and sewage-related services, discharge of salt water, supply of industrial water, reclamation activity and production of salt. In addition, the company provides computer hardware consulting and data processing services; insurance intermediation and administration services; tourist and hotel services; rail siding; transportation and general construction services; mechanic, electric repair, renovation, and maintenance of automation technology; and post-mining waste disposal and reclamation services. Further, it manufactures spare parts, assemblies, devices, steel structures, technical equipment, tools, and instruments; renovates, maintains, and upkeeps machinery and equipment; produces machinery for mining, quarrying, and construction; and provides mining, architectural and engineering, machinery leasing services, as well as engages in the designing and execution of vertical and horizontal mine workings and tunnels. The company serves energy companies, and heat and power plants in Poland, Germany, Austria, the Czech Republic, Slovakia, Switzerland, Spain, Romania, France, Belgium, Norway, Luxembourg, Sweden, and other countries. Jastrzebska SpÃ³lka Weglowa S.A. was founded in 1993 and is based in Jastrzebie-ZdrÃ³j, Poland.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Poland",
        "state": null,
        "city": "Jastrzebie-ZdrÃ³j",
        "zipcode": "44-330",
        "website": "http://www.jsw.pl",
        "market_cap": 877381376
    },
    "JAL.AX": {
        "short_name": "JAMESON FPO",
        "long_name": "Jameson Resources Limited",
        "summary": "Jameson Resources Limited engages in the exploration and development of coal projects in Western Canada. The company explores for coking and thermal coal. Its flagship project is the Crown Mountain project with ten granted coal licenses covering an area of 5,630 hectares located in the Elk Valley coal field in south eastern British Columbia. The company was founded in 2007 and is headquartered in West Perth, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Brisbane",
        "zipcode": "4065",
        "website": "http://www.jamesonresources.com.au",
        "market_cap": 28816540
    },
    "METC": {
        "short_name": "Ramaco Resources, Inc.",
        "long_name": "Ramaco Resources, Inc.",
        "summary": "Ramaco Resources, Inc. produces and sells metallurgical coal. The company's development portfolio includes the Elk Creek project consisting of approximately 20,166 acres of controlled mineral and 25 seams located in southern West Virginia; the Berwind property comprising approximately 31,200 acres of controlled mineral and an area of Squire Jim seam coal deposits, which is situated on the border of West Virginia and Virginia; the Knox Creek property consisting of approximately 62,100 acres of controlled mineral that is located in Virginia; and the RAM Mine property comprising approximately 1,570 acres of controlled mineral, which is situated in southwestern Pennsylvania. The company serves blast furnace steel mills and coke plants in the United States, as well as international metallurgical coal consumers. The company was founded in 2015 and is headquartered in Lexington, Kentucky.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "KY",
        "city": "Lexington",
        "zipcode": "40507",
        "website": "http://www.ramacoresources.com",
        "market_cap": 195054288
    },
    "MOAEF": {
        "short_name": "MONGOLIA ENERGY CORP LTD",
        "long_name": "Mongolia Energy Corporation Limited",
        "summary": "Mongolia Energy Corporation Limited, an investment holding company, engages in the coal mining, processing, and other resources related operations in the People's Republic of China and Mongolia. It sells coking and thermal coal. The company's principal project is the Khushuut coking coal project in Western Mongolia. It holds approximately 13,981 hectares of exploration and mining concession areas for coal and ferrous resources in Western Mongolia at Khovd, Gobi Altay, Olon Bulag, and Bayan-Ulgii. The company is also involved in the provision of management services, and secretarial and nominee services, as well as mining and exploration advisory service; trading of coal; and operation of coal washing plants. Mongolia Energy Corporation Limited is based in Hong Kong.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.mongolia-energy.com",
        "market_cap": 25782654
    },
    "MOGLF": {
        "short_name": "MONGOLIAN MINING CORP",
        "long_name": "Mongolian Mining Corporation",
        "summary": "Mongolian Mining Corporation engages in the mining, processing, transportation, and sale of coking coal products. It owns and operates the Ukhaa Khudag and the Baruun Naran open-pit coking coal mines located in South Gobi province of Mongolia. The company also engages in the railway project management, airport operation and management, water exploration and supply management, and power supply project management activities; and trading of coal and machinery equipment. It sells its products primarily in China. The company was incorporated in 2010 and is headquartered in Ulaanbaatar, Mongolia.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Mongolia",
        "state": null,
        "city": "Ulaanbaatar",
        "zipcode": "14200",
        "website": "http://www.mmc.mn",
        "market_cap": 356167168
    },
    "MR1.AX": {
        "short_name": "MONTEM FPO",
        "long_name": "Montem Resources Limited",
        "summary": "Montem Resources Limited operates as a steelmaking coal development company in Canada. It owns interests in the Tent Mountain mine re-start project; Chinook project; and Greenfield projects comprising Isola, 4-Stack, and Oldman properties, which are located in the Crowsnest Pass area of southwest Alberta and southeast British Columbia. The company was incorporated in 2017 and is based in South Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "South Melbourne",
        "zipcode": "3205",
        "website": "http://montem-resources.com",
        "market_cap": 23419700
    },
    "NJ2.F": {
        "short_name": "NIPPON COKE+ENGINE.CO.LTD",
        "long_name": "Nippon Coke & Engineering Company, Limited",
        "summary": "Nippon Coke & Engineering Company, Limited manufactures and sells coke worldwide. The company also imports and sells coal; and manufactures and sells chemical engineering machinery and equipment. In addition, it processes industrial wastes; provides clean solutions for coal and coke combustion, and chemical machinery technologies; and operates port facilities that offers cargo handling services. The company was formerly known as Mitsui Mining Co., Ltd. and changed its name to Nippon Coke & Engineering Company, Limited in April 2009. Nippon Coke & Engineering Company, Limited was founded in 1889 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "135-6007",
        "website": "http://www.n-coke.com",
        "market_cap": 228625760
    },
    "PAK.AX": {
        "short_name": "PACIFICAM FPO",
        "long_name": "Pacific American Holdings Limited",
        "summary": "Pacific American Holdings Limited focuses on the production, development, and exploration of metallurgical coal assets in Canada and Australia. The company's flagship property is the Elko coking coal project covering an area of 8,824 acres located in Kootenay, British Columbia, Canada. It also has exploration licenses in the metallurgical coal region of the Arkoma Basin in Oklahoma; and focuses on the development of hydro projects within Australia and the South Pacific Region, as well as holds an agreement to earn up to a 60% equity interest in the Porphyry North Gold Project in Western Australia. The company was formerly known as Pacific American Coal Limited and changed its name to Pacific American Holdings Limited in May 2019. Pacific American Holdings Limited is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.pacificamerican.com.au",
        "market_cap": 6690284
    },
    "PDZ.AX": {
        "short_name": "PRAIRIE FPO",
        "long_name": "Prairie Mining Limited",
        "summary": "Prairie Mining Limited, a coal development company, engages in the exploration, evaluation, appraisal, and development of resource projects in Australia and Poland. It develops and operates Jan Karski semi-soft coking coal mine in the Lublin Coal Basin, as well as Debiensko hard coking coal mine in Upper Silesia. The company was formerly known as Prairie Downs Metals Limited and changed its name to Prairie Mining Limited in June 2014. Prairie Mining Limited was incorporated in 1957 and is based in Perth, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6000",
        "website": "http://www.pdz.com.au",
        "market_cap": 57088752
    },
    "PDZ.L": {
        "short_name": "PRAIRIE MINING LIMITED ORD NPV ",
        "long_name": "Prairie Mining Limited",
        "summary": "Prairie Mining Limited, a coal development company, engages in the exploration, evaluation, appraisal, and development of resource projects in Australia and Poland. It develops and operates Jan Karski semi-soft coking coal mine in the Lublin Coal Basin, as well as Debiensko hard coking coal mine in Upper Silesia. The company was formerly known as Prairie Downs Metals Limited and changed its name to Prairie Mining Limited in June 2014. Prairie Mining Limited was incorporated in 1957 and is based in Perth, Australia.",
        "currency": "GBp",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6000",
        "website": "http://www.pdz.com.au",
        "market_cap": 34242080
    },
    "PEZ.F": {
        "short_name": "PERENNIAL ENERGY  HD-,01",
        "long_name": "Perennial Energy Holdings Limited",
        "summary": "Perennial Energy Holdings Limited, an investment holding company, operates as a coal mining company in the People's Republic of China. The company principally engages in the exploration and mining of coking coal and coal refinery. It operates three underground coal mines comprising Hongguo Mine with a licensed area of 3.0225 sq. km; Baogushan Mine covering a licensed area of 2.4736 sq. km; and Xiejiahegou Mine with a licensed area of 1.0135 sq. km located in Panzhou City, Guizhou Province. The company was founded in 1990 and is headquartered in Liupanshui, China. Perennial Energy Holdings Limited is a subsidiary of Spring Snow Management Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Liupanshui",
        "zipcode": null,
        "website": "http://www.perennialenergy.hk",
        "market_cap": 372280704
    },
    "RASP.ME": {
        "short_name": "RASPADSKAYA PJSC",
        "long_name": "Public Joint Stock Company Raspadskaya",
        "summary": "Public Joint Stock Company Raspadskaya, together with its subsidiaries, engages in the mining of coking coal and anthracites. It holds various coal assets located in the Kemerovo region, Russia, including three underground mines, two open-pit operations, a coal preparation plant, and coal transportation and production facilities. The company's principal asset is the Raspadskaya Mine. It supplies its products to the smelters in Russia, as well as exports to Ukraine, Romania, Hungary, and Bulgaria. The company was founded in 1973 and is based in Mezhdurechensk, Russia. Public Joint Stock Company Raspadskaya is a subsidiary of EVRAZ plc.",
        "currency": "RUB",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Mezhdurechensk",
        "zipcode": "652870",
        "website": "http://www.raspadskaya.com",
        "market_cap": 168871034880
    },
    "SXC": {
        "short_name": "SunCoke Energy, Inc.",
        "long_name": "SunCoke Energy, Inc.",
        "summary": "SunCoke Energy, Inc. operates as an independent producer of coke in the Americas and Brazil. The company operates through three segments: Domestic Coke, Brazil Coke, and Logistics. It offers metallurgical and thermal coal. The company also provides handling and/or mixing services to steel, coke, electric utility, coal producing, and other manufacturing based customers. In addition, it owns and operates five cokemaking facilities in the United States and one in Brazil. SunCoke Energy, Inc. was founded in 1960 and is headquartered in Lisle, Illinois.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Lisle",
        "zipcode": "60532",
        "website": "http://www.suncoke.com",
        "market_cap": 635195904
    },
    "TER.AX": {
        "short_name": "TERRACOM FPO",
        "long_name": "TerraCom Limited",
        "summary": "TerraCom Limited engages in the exploration, extraction, and production of coal in Australia and South Africa. It explores for hard and soft coking, thermal, and PCI coal. The company holds interests in the Northern Galilee project comprising the Hughenden and the Pentland projects covering an area of approximately 2,160 square kilometers, as well as the Clyde Park project that covers an area of approximately 133 square kilometers located in the Galilee Basin, Queensland; the Blair Athol Coal Mine project; and the Springsure project covering an area of approximately 1,178 square kilometers situated in the Central-Western Bowen basin coal mining district, Queensland. It also holds interests in the Kangala Colliery property; the New Clydesdale Colliery project; the Berenice Project; Ubuntu Colliery; North Block Complex Colliery; Cygnus project; and Eloff Project located in South Africa.The company was formerly known as Guildford Coal Limited and changed its name to TerraCom Limited in November 2015. TerraCom Limited was founded in 2009 and is based in Clermont, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Clermont",
        "zipcode": "4721",
        "website": "http://www.terracomresources.com",
        "market_cap": 94201000
    },
    "WJ4.F": {
        "short_name": "WARRIOR MET COAL  DL -,01",
        "long_name": "Warrior Met Coal, Inc.",
        "summary": "Warrior Met Coal, Inc. produces and exports non-thermal metallurgical coal for the steel industry. It operates two underground mines located in Alabama. The company sells its metallurgical coal to a customer base of blast furnace steel producers located primarily in Europe, South America, and Asia. It also sells natural gas, which is extracted as a byproduct from coal production. Warrior Met Coal, Inc. was founded in 2015 and is headquartered in Brookwood, Alabama.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "AL",
        "city": "Brookwood",
        "zipcode": "35444",
        "website": "http://warriormetcoal.com",
        "market_cap": 820921600
    },
    "WKU.F": {
        "short_name": "ASPIRE MINING LTD",
        "long_name": "Aspire Mining Limited",
        "summary": "Aspire Mining Limited engages in the exploration and development of metallurgical coal assets in Mongolia. The company primarily holds a 100% interest in the Ovoot coking coal project that consists of one mining license and two contiguous exploration licences across 130 square kilometers located in Northern Mongolia. It also holds a 90% interest in the Nuurstei coking coal project, as well as builds and operates rail from the town of Erdenet to the Ovoot Coking Coal Railway in northern Mongolia. Aspire Mining Limited was incorporated in 2006 and is based in Perth, Australia.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6000",
        "website": "http://www.aspiremininglimited.com",
        "market_cap": 26830090
    }
}