{
  "0MDP.L": {
    "city": "Bogotá",
    "country": "Colombia",
    "currency": "USD",
    "exchange": "LSE",
    "industry": "Independent Oil & Gas",
    "long_name": "GeoPark Limited",
    "market": "gb_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "GEOPARK LTD GEOPARK ORD SHS",
    "state": null,
    "summary": "GeoPark Limited engages in the exploration, development, and production of oil and gas reserves in Chile, Colombia, Brazil, Argentina, Peru, and Ecuador. As of December 31, 2019, the company had working and/or economic interests in 31 hydrocarbons blocks, as well as shallow-offshore concession in Brazil that includes the Manati Field. It had net proved reserves of 124.0 million barrels of oil equivalent. GeoPark Limited has a strategic partnership with ONGC Videsh to jointly acquire, invest in, and create value from upstream oil and gas projects across Latin America. The company was formerly known as GeoPark Holdings Limited and changed its name to GeoPark Limited in July 2013. GeoPark Limited was founded in 2002 and is based in Santiago, Chile.",
    "website": "http://www.geo-park.com",
    "zipcode": null
  },
  "AEDC": {
    "city": "New York",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Independent Oil & Gas",
    "long_name": "American Energy Development Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "AMERICAN ENERGY DEVELOPMENT COR",
    "state": "NY",
    "summary": "American Energy Development Corp. operates as an independent energy company, develops oil and gas basins in the United States. It holds interest in Dansville prospects that consist of 1,343 acre located in Ingham County, Michigan. The company was formerly known as LJM Energy Corp. and changed its name to American Energy Development Corp. in July 2011. American Energy Development Corp. was founded in 2010 and is based in New York, New York.",
    "website": null,
    "zipcode": "10020"
  },
  "FECN.MX": {
    "city": "Toronto",
    "country": "Canada",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Independent Oil & Gas",
    "long_name": "Frontera Energy Corporation",
    "market": "mx_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "FRONTERA ENERGY CORPORATION",
    "state": "ON",
    "summary": "Frontera Energy Corporation explores for, develops, and produces crude oil and natural gas in South America. The company has a portfolio of assets, which consists of interests in 40 exploration and production blocks in Colombia, Ecuador, and Guyana; and in pipeline and port facilities in Colombia. As of December 31, 2020, it had total proved plus probable reserves of 166.4 million barrels of oil equivalent. The company was formerly known as Pacific Exploration & Production Corporation and changed its name to Frontera Energy Corporation in June 2017. Frontera Energy Corporation was incorporated in 1985 and is headquartered in Toronto, Canada.",
    "website": "http://www.fronteraenergy.ca",
    "zipcode": "M5H 2R2"
  },
  "NORX": {
    "city": "Southlake",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Independent Oil & Gas",
    "long_name": "Norstra Energy, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "NORSTRA ENERGY INC",
    "state": "TX",
    "summary": "Norstra Energy, Inc., an exploration stage company, focuses on the exploration and development of oil and gas properties in the United States. The company was formerly known as Norstra Inc. and changed its name to Norstra Energy Inc. in November 2011. Norstra Energy, Inc. was founded in 2010 and is based in Southlake, Texas.",
    "website": null,
    "zipcode": "78041"
  },
  "OGNG": {
    "city": "Las Vegas",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Independent Oil & Gas",
    "long_name": "Bravo Enterprises Ltd.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "BRAVO ENTERPRISES LTD",
    "state": "NV",
    "summary": "Bravo Enterprises Ltd., a development stage company, holds manufacturing, distribution, and marketing rights for the air-to-water harvesters. The air-to-water harvesters extract moisture from the air through a dehumidification process, then filters and purify the water for consumption. It has strategic alliance with Sapec-Eco and Regenedyne LLC to provide clean drinking water solutions to small villages and towns. The company was formerly known as Organa Gardens International Inc. and changed its name to Bravo Enterprises Ltd. in June 2012. Bravo Enterprises Ltd. was founded in 1983 and is headquartered in Las Vegas, Nevada.",
    "website": null,
    "zipcode": "89146"
  },
  "ZAZA": {
    "city": "Houston",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Independent Oil & Gas",
    "long_name": "ZaZa Energy Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "ZAZA ENERGY CORP",
    "state": "TX",
    "summary": "ZaZa Energy Corporation, an independent oil and gas company, focuses on the exploration and production of unconventional and conventional oil and gas assets in the United States. The company's properties include the Eagle Ford East Trend comprising approximately 41,000 net acres in Houston, Leon, Madison, Grimes, Walker, Trinity, and Montgomery counties in East Texas; and Eagle Ford Trend covering approximately 3,700 net acres located in DeWitt and Lavaca counties in South Texas. As of December 31, 2014, it owned 45,000 net acres with proved reserves of approximately 1,011 thousand barrels of oil equivalent. ZaZa Energy Corporation is headquartered in Houston, Texas.",
    "website": "http://www.zazaenergy.com",
    "zipcode": "77010"
  }
}
