{"0MDP.L": {"short_name": "GEOPARK LTD GEOPARK ORD SHS", "long_name": "GeoPark Limited", "summary": "GeoPark Limited engages in the exploration, development, and production of oil and gas reserves in Chile, Colombia, Brazil, Argentina, Peru, and Ecuador. As of December 31, 2019, the company had working and/or economic interests in 31 hydrocarbons blocks, as well as shallow-offshore concession in Brazil that includes the Manati Field. It had net proved reserves of 124.0 million barrels of oil equivalent. GeoPark Limited has a strategic partnership with ONGC Videsh to jointly acquire, invest in, and create value from upstream oil and gas projects across Latin America. The company was formerly known as GeoPark Holdings Limited and changed its name to GeoPark Limited in July 2013. GeoPark Limited was founded in 2002 and is based in Santiago, Chile.", "currency": "USD", "sector": "Basic Materials", "industry": "Independent Oil & Gas", "exchange": "LSE", "market": "gb_market", "country": "Chile", "city": "Santiago de Chile"}, "AEDC": {"short_name": "AMERICAN ENERGY DEVELOPMENT COR", "long_name": "American Energy Development Corp.", "summary": "American Energy Development Corp. operates as an independent energy company, develops oil and gas basins in the United States. It holds interest in Dansville prospects that consist of 1,343 acre located in Ingham County, Michigan. The company was formerly known as LJM Energy Corp. and changed its name to American Energy Development Corp. in July 2011. American Energy Development Corp. was founded in 2010 and is based in New York, New York.", "currency": "USD", "sector": "Basic Materials", "industry": "Independent Oil & Gas", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "New York"}, "CNEN.MX": {"short_name": "CANACOL ENERGY LTD", "long_name": "Canacol Energy Ltd", "summary": "Canacol Energy Ltd. primarily explores for, develops, and produces petroleum and natural gas in Colombia. As of December 31, 2019, it has a total proved plus probable reserves of 109,431 one thousand barrels of oil equivalent. The company is headquartered in Calgary, Canada.", "currency": "MXN", "sector": "Basic Materials", "industry": "Independent Oil & Gas", "exchange": "MEX", "market": "mx_market", "country": "Canada", "city": "Calgary"}, "EOPT": {"short_name": "EOS PETRO INC", "long_name": "Eos Petro, Inc.", "summary": "Eos Petro, Inc. engages in the acquisition, exploration, and development of oil and gas-related assets. The company holds a 100% interest in the Works Property that includes five oil and gas leases in an approximately 510 acre tract of land located in the Albion in Edwards County, Illinois. As of December 31, 2016, it had eight productive oil wells covering an area of approximately 700 acres, including 496 net and gross developed acres, and 200 net and gross undeveloped acres. The company was founded in 1996 and is based in Los Angeles, California. Eos Petro, Inc. is a subsidiary of Plethora Enterprises, LLC.", "currency": "USD", "sector": "Basic Materials", "industry": "Independent Oil & Gas", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Los Angeles"}, "FECN.MX": {"short_name": "FRONTERA ENERGY CORPORATION", "long_name": "Frontera Energy Corporation", "summary": "Frontera Energy Corporation explores for, develops, and produces crude oil and natural gas in South America. As of December 31, 2019, it had total proved plus probable reserves of 157.7 million barrels of oil equivalent. The company was formerly known as Pacific Exploration & Production Corporation and changed its name to Frontera Energy Corporation in June 2017. Frontera Energy Corporation was incorporated in 1985 and is headquartered in Toronto, Canada.", "currency": "MXN", "sector": "Basic Materials", "industry": "Independent Oil & Gas", "exchange": "MEX", "market": "mx_market", "country": "Canada", "city": "Toronto"}, "NORX": {"short_name": "NORSTRA ENERGY INC", "long_name": "Norstra Energy, Inc.", "summary": "Norstra Energy, Inc., an exploration stage company, focuses on the exploration and development of oil and gas properties in the United States. The company was formerly known as Norstra Inc. and changed its name to Norstra Energy Inc. in November 2011. Norstra Energy, Inc. was founded in 2010 and is based in Southlake, Texas.", "currency": "USD", "sector": "Basic Materials", "industry": "Independent Oil & Gas", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Southlake"}, "OGNG": {"short_name": "BRAVO ENTERPRISES LTD", "long_name": "Bravo Enterprises Ltd.", "summary": "Bravo Enterprises Ltd., a development stage company, holds manufacturing, distribution, and marketing rights for the air-to-water harvesters. The air-to-water harvesters extract moisture from the air through a dehumidification process, then filters and purify the water for consumption. It has strategic alliance with Sapec-Eco and Regenedyne LLC to provide clean drinking water solutions to small villages and towns. The company was formerly known as Organa Gardens International Inc. and changed its name to Bravo Enterprises Ltd. in June 2012. Bravo Enterprises Ltd. was founded in 1983 and is headquartered in Las Vegas, Nevada.", "currency": "USD", "sector": "Basic Materials", "industry": "Independent Oil & Gas", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Las Vegas"}, "OXY1.MX": {"short_name": "OCCIDENTAL PETROLEUM CORP", "long_name": "Occidental Petroleum Corporation", "summary": "Occidental Petroleum Corporation, together with its subsidiaries, engages in the acquisition, exploration, and development of oil and gas properties in the United States, the Middle East, and Latin America. The company operates through three segments: Oil and Gas, Chemical, and Marketing and Midstream. The Oil and Gas segment explores for, develops, and produces oil and condensate, natural gas liquids (NGLs), and natural gas. The Chemical segment manufactures and markets basic chemicals, including chlorine, caustic soda, chlorinated organics, potassium chemicals, ethylene dichloride, chlorinated isocyanurates, sodium silicates, and calcium chloride; vinyls comprising vinyl chloride monomer, polyvinyl chloride, and ethylene. The Midstream and Marketing segment gathers, processes, transports, stores, purchases, and markets oil, condensate, NGLs, natural gas, carbon dioxide, and power. This segment also trades around its assets consisting of transportation and storage capacity; and invests in entities. Occidental Petroleum Corporation was founded in 1920 and is headquartered in Houston, Texas.", "currency": "MXN", "sector": "Basic Materials", "industry": "Independent Oil & Gas", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Houston"}, "PXD.MX": {"short_name": "PIONEER NATURAL RESOURCES CO", "long_name": "Pioneer Natural Resources Company", "summary": "Pioneer Natural Resources Company operates as an independent oil and gas exploration and production company in the United States. The company explores for, develops, and produces oil, natural gas liquids (NGLs), and gas. It has operations primarily in the Permian Basin in West Texas. As of December 31, 2019, the company had proved undeveloped reserves and proved developed non-producing reserves of 39 million barrels of oil, 16 million barrels of NGLs, and 83 billion cubic feet of gas; and owned interests in 11 gas processing plants. Pioneer Natural Resources Company was founded in 1997 and is headquartered in Irving, Texas.", "currency": "MXN", "sector": "Basic Materials", "industry": "Independent Oil & Gas", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Irving"}, "TNP.TO": {"short_name": "TRANSATLANTIC PETROLEUM LTD.", "long_name": "TransAtlantic Petroleum Ltd.", "summary": "TransAtlantic Petroleum Ltd., an oil and natural gas company, engages in the acquisition, exploration, development, and production of oil and natural gas properties in Turkey and Bulgaria. As of December 31, 2019, it had interests in 4 onshore exploration licenses and 20 onshore production leases covering an area of 436,388 net acres with a total net proved reserves of 10,259 thousand barrels of oil and 2,466 million cubic feet of natural gas located in Turkey, as well as a production concession covering an area of approximately 162,800 net undeveloped acres located in Bulgaria. The company was incorporated in 1985 and is based in Addison, Texas. As of December 18, 2020, TransAtlantic Petroleum Ltd. was taken private.", "currency": "CAD", "sector": "Basic Materials", "industry": "Independent Oil & Gas", "exchange": "TOR", "market": "ca_market", "country": "United States", "city": "Addison"}}