{
    "000180.KS": {
        "short_name": "SCEHoldings",
        "long_name": "Sungchang Enterprise Holdings Limited",
        "summary": "Sungchang Enterprise Holdings Limited engages in the development of various plant species and forest restoration activities in South Korea. The company is also involved in the planting of trees, such as pine tree, as well as owns a botanical garden. In addition, it manufactures and sells a range of plywood products, including interior plywood for interior purposes; standard plywood for building frames, inner walls, and interiors; plywood for concrete casts, building exteriors, and exposed concrete construction; eco-friendly plywood for exterior applications; and custom plywood for automobile, ship, and flooring applications, as well as flooring products under the Lieu brand. Further, the company produces and sells particle boards, particle board materials, wood chips, and Bio-SRF; and engages in importing and selling wood pellet, and PKS, as well as sawdust and recycling activities. It owns and manages 8,140HA of fields. Sungchang Enterprise Holdings Limited was founded in 1916 and is headquartered in Busan, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Busan",
        "zipcode": "49526",
        "website": "http://www.sce.co.kr",
        "market_cap": "Small Cap"
    },
    "000592.SZ": {
        "short_name": "ZHONGFU STRAITS (P",
        "long_name": "Zhongfu Straits (Pingtan) Development Company Limited",
        "summary": "Zhongfu Straits (Pingtan) Development Company Limited provides wood products under the Zhongfu brand in China and internationally. The company offers fir products, wet pine, cold-tolerant eucalyptus, golden lotus, etc.; fiberboards, laminated timber, finger jointed boards, and fine wood board products for use in furniture, household appliances, audio housings, pianos, sports equipment, handicrafts, vehicles, and ships; and financin and pledge financing services for corporate legal persons and individuals. It is also involved in the processing and sale of forest products; cultivation of seedlings; tree planting; and garden landscape design and construction activities. In addition, the company engages in the investment, construction, and operation management of sewage treatment and water plants; and concrete mixing franchise business. The company was formerly known as Fujian Zhongfu Industries Co., Ltd and changed its name to Zhongfu Straits (Pingtan) Development Company Limited in May 2014. Zhongfu Straits (Pingtan) Development Company Limited is based in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": "350001",
        "website": "http://www.000592.com",
        "market_cap": "Small Cap"
    },
    "000663.SZ": {
        "short_name": "FUJIAN YONGAN FRST",
        "long_name": "Fujian Yongan Forestry (Group) Joint-Stock Co., Ltd.",
        "summary": "Fujian Yongan Forestry (Group) Joint-Stock Co., Ltd. provides various forest products in China. Its products include fir, pine, eucalyptus, hardwood, and other wood products; medium-density fiberboards; furniture; laminate flooring; formaldehyde; adhesives; and seedlings. The company was founded in 1994 and is based in Yong'an, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yong'an",
        "zipcode": "366000",
        "website": "http://www.yonglin.com",
        "market_cap": "Small Cap"
    },
    "000910.SZ": {
        "short_name": "DARE POWER DEKOR H",
        "long_name": "Dare Power Dekor Home Co.,Ltd.",
        "summary": "Dare Power Dekor Home Co.,Ltd. engages in the wood-based panel and flooring businesses. The company offers Shengxiang branded flooring and Daya branded wood-based panels. The company was formerly known as Dare Technology Co., Ltd. and changed its name to Dare Power Dekor Home Co.,Ltd. in October 2016. Dare Power Dekor Home Co.,Ltd. was founded in 1999 and is based in Danyang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Danyang",
        "zipcode": null,
        "website": "http://www.dareglobal.com.cn",
        "market_cap": "Small Cap"
    },
    "002043.SZ": {
        "short_name": "DEHUA TB NEW DECOR",
        "long_name": "DeHua TB New Decoration Material Co.,Ltd",
        "summary": "DeHua TB New Decoration Material Co.,Ltd produces and markets decorative plywood in China. The company offers plywood, flooring, and veneer products, as well as wooden doors. It operates 753 franchised stores. The company also exports its products to the Americas, Europe, Australia, the Middle East, and internationally. DeHua TB New Decoration Material Co.,Ltd was founded in 1993 and is based in Deqing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Deqing",
        "zipcode": "313200",
        "website": "http://www.dhwooden.com",
        "market_cap": "Small Cap"
    },
    "002240.SZ": {
        "short_name": "SHENZHEN CHENGXIN",
        "long_name": "Shenzhen Chengxin Lithium Group Co.,Ltd.",
        "summary": "Shenzhen Chengxin Lithium Group Co.,Ltd. manufactures and sells fiberboard products in China. The company provides medium (high) density fiberboards used in furniture, door, and reinforcement Wood flooring, and decoration industries. It is also involved in forest planting and sales activities. The company was founded in 1997 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.gdweihua.cn",
        "market_cap": "Mid Cap"
    },
    "002679.SZ": {
        "short_name": "FUJIAN JINSEN FORE",
        "long_name": "Fujian Jinsen Forestry Co.,Ltd",
        "summary": "Fujian Jinsen Forestry Co.,Ltd engages in the afforestation activities in China. The company manages forests; and engages in the green seedlings, sale of wood, and Chinese herbal medicine fields. It also provides bamboo and primary agriculture products; and invests in forestry and agriculture projects. The company was founded in 2007 and is based in Sanming, China. Fujian Jinsen Forestry Co.,Ltd is a subsidiary of Fujian Jiangle Forestry Corporation.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Sanming",
        "zipcode": null,
        "website": "http://www.jinsenforestry.com",
        "market_cap": "Small Cap"
    },
    "008250.KS": {
        "short_name": "EagonInd",
        "long_name": "Eagon Industrial Co., Ltd.",
        "summary": "Eagon Industrial Co., Ltd. supplies building materials in South Korea and internationally. It offers aluminum, PVC, and wood windows and doors; curtain walls; explosion and bullet proof windows; glasses; building integrated photovoltaic and photovoltaic solutions; floors; removable dividers and doors; plywood; housing materials, such as sheathing materials, OSB, and engineered and deck wood; landscape products; guard rail products; and logistics products, such as green and plastic pellets, clip-lok, and C-box. The company was founded in 1972 and is based in Incheon, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Incheon",
        "zipcode": null,
        "website": "http://www.eagon.com/eng/index.asp",
        "market_cap": "Small Cap"
    },
    "0094.HK": {
        "short_name": "GREENHEART GP",
        "long_name": "Greenheart Group Limited",
        "summary": "Greenheart Group Limited, an investment holding company, engages in forestry business worldwide. It operates in two segments, Suriname and New Zealand. The company is involved in hardwood log harvesting and timber processing, as well as the marketing, sale, and trading of logs and timber products. It offers softwood products, such as radiata pine logs for sawn timber and plywood and veneer; and hardwood products used for furniture, flooring, decking, windows/doors, outdoor timber/heavy construction, interior decoration, and marine applications. As of December 31, 2020, the company managed radiata pine plantation forest assets with a total freehold title land base of approximately 12,700 hectares located in Northland region of New Zealand, as well as approximately 340,000 hectares of concessions and cutting rights in Suriname, South America. It also provides corporate, administrative and management, forest management, and shipping services; holds timber concessions, and harvests and sells logs and timber products; manufactures and sells pallets; and administers forestry operations. The company was formerly known as Omnicorp Limited and changed its name to Greenheart Group Limited in December 2010. The company was incorporated in 1991 and is headquartered in Wanchai, Hong Kong. Greenheart Group Limited is a subsidiary of Newforest Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.greenheartgroup.com",
        "market_cap": "Small Cap"
    },
    "1069.HK": {
        "short_name": "BOZZA DEVELOP",
        "long_name": "China Bozza Development Holdings Limited",
        "summary": "China Bozza Development Holdings Limited, an investment holding company, engages in forestry management, container house, and money lending businesses in the People's Republic of China and Hong Kong. As of December 31, 2019, the company owned approximately 1,403 hectares in Muma Town of Jiange County; 642 hectares in Zhengxing Town of Jiange County; 881 hectares in Yixing Town of Jiange County; and 2,044 hectares in Longyuanzhen, Houshiziang, and Dianzixiang towns of Jiange County, Sichuan Province, as well as 2,854 hectares in Kaifeng Town, Yingshui village, Guangping village, and Zheba village of Jiange County of Sichuan Province. It also harvests timber logs; and manages, leases, sells, and installs container houses. The company was formerly known as China Agroforestry Low-Carbon Holdings Limited and changed its name to China Bozza Development Holdings Limited in January 2020. China Bozza Development Holdings Limited was incorporated in 2009 and is headquartered in Shenzhen, China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.chinacaflc.com",
        "market_cap": "Small Cap"
    },
    "1D8.F": {
        "short_name": "ACCSYS TECH.PLC  EO -,05",
        "long_name": "Accsys Technologies PLC",
        "summary": "Accsys Technologies PLC, together with its subsidiaries, produces and sells Accoya solid wood and Tricoya wood elements in the United Kingdom, Ireland, Benelux, rest of Europe, the Americas, the Asia-Pacific, and internationally. The company offers Accoya wood for use in windows and doors, decking, cladding, bridges, and exterior structures and applications; and Tricoya wood elements for facades and cladding, soffits and eaves, exterior joinery, wet interiors, door skins, flooring, signage, and marine uses, as well as kitchen carcasses, art installations, and window components. It also provides technical and engineering services to licensees; and sells acetic acid, a by-product from the manufacturing process. The company is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "WC2E 7EN",
        "website": "http://www.accsysplc.com",
        "market_cap": "Small Cap"
    },
    "1J7.SI": {
        "short_name": "$ Jawala",
        "long_name": "Jawala Inc.",
        "summary": "Jawala Inc., a forest resource company, focuses on industrial tree plantations located in Sabah. The company engages in the management of forestry resources, and the planting and extraction of timber, as well as cultivation of industrial tree plantations. It is also involved in the harvesting, processing, distribution, and sale of timber. The company was incorporated in 2017 and is headquartered in Kota Kinabalu, Malaysia.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kota Kinabalu",
        "zipcode": "88300",
        "website": "http://jawalainc.com",
        "market_cap": "Small Cap"
    },
    "2D2.F": {
        "short_name": "SCAND.INV.GR.NAM.B DK 0,5",
        "long_name": "Scandinavian Investment Group A/S",
        "summary": "Scandinavian Investment Group A/S invests in real estate properties in Denmark. It also invests in and operates portfolio of companies in Scandinavia. The company was founded in 1908 and is based in Herlev, Denmark.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Denmark",
        "state": null,
        "city": "Herlev",
        "zipcode": "2730",
        "website": "http://www.sca-inv-group.dk",
        "market_cap": "Small Cap"
    },
    "2HW.F": {
        "short_name": "BERGS TIMBER AB B  SK 5",
        "long_name": "Bergs Timber AB (publ)",
        "summary": "Bergs Timber AB (publ) produces, distributes, and sells sawn and processed timber products in Sweden, the United Kingdom, and internationally. It offers structural timber in spruce and pine forms; treated timber products; and gardening products, windows, doors, and prefabricated houses. The company also provides cellulose chips and sawdust for the production of paper pulp, heat, and energy; and forestry services. In addition, it operates sawmills; and sells by-products from manufacture to the pulp and particle board industries. The company was formerly known as CF Berg & Co. Bergs Timber AB (publ) was founded in 1919 and is headquartered in Vimmerby, Sweden.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Sweden",
        "state": null,
        "city": "Vimmerby",
        "zipcode": "598 37",
        "website": "http://www.bergstimber.se",
        "market_cap": "Small Cap"
    },
    "5CA.F": {
        "short_name": "CONIFEX TIMBER INC.",
        "long_name": "Conifex Timber Inc.",
        "summary": "Conifex Timber Inc. primarily manufactures and sells lumber products in the United States, China, Canada, Japan, and internationally. It is involved in the timber harvesting, reforestation, and forest management activities; manufacture of finished softwood lumber from spruce, pine, and fir logs; manufacture, sale, and distribution of dimension lumber; processing logs into lumber and wood chips, as well as by-products or residues, such as trim blocks, sawdust, shavings, and barks; and providing value added lumber finishing services. The company also develops bioenergy and bio products; and operates a 36 megawatt biomass power generation plant, which produces renewable energy for commercial sale. The company was formerly known as West Fourth Capital Inc. and changed its name to Conifex Timber Inc. in June 2010. Conifex Timber Inc. was incorporated in 2007 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V7Y 1B6",
        "website": "http://www.conifex.com",
        "market_cap": "Small Cap"
    },
    "600076.SS": {
        "short_name": "KANGXIN NEW MATERIALS CO LTD",
        "long_name": "Kangxin New Materials Co., Ltd.",
        "summary": "Kangxin New Materials Co., Ltd. engages in the afforestation, processing, design, and production of construction structural lumber products in China. Its principal products include poplar wood products, mountain forest woods, and COSB oriented structural boards, as well as series of solid wood composite boards for container floors, EP decorative boards, construction plywood, etc.; and poplar and urban landscape seedlings. The company also produces wooden houses. Kangxin New Materials Co., Ltd. was founded in 1998 and is headquartered in Xiaogan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiaogan",
        "zipcode": null,
        "website": "http://www.hbkangxin.com.cn",
        "market_cap": "Small Cap"
    },
    "600265.SS": {
        "short_name": "YUNNAN JINGU FORESTRY",
        "long_name": "Yunnan Jinggu Forestry Co.,Ltd",
        "summary": "Yunnan Jinggu Forestry Co.,Ltd engages in timber processing business in China and internationally. The company also manufactures and distributes forest chemical products. It offers gum rosin, gum turpentine oil, alpha-pinene, beta-pinene, wood boards, and other products. The company is also involved in forest cultivation, cutting, transportation, and processing of timbers, as well as the research and development of forest technology. Yunnan Jinggu Forestry Co.,Ltd is based in Puer, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Puer",
        "zipcode": "666499",
        "website": "http://www.jgly.cn",
        "market_cap": "Small Cap"
    },
    "601996.SS": {
        "short_name": "GUANGXI FENGLIN WOOD INDUSTRY G",
        "long_name": "Guangxi Fenglin Wood Industry Group Co.,Ltd",
        "summary": "Guangxi Fenglin Wood Industry Group Co.,Ltd manufactures and sells engineering boards in China and internationally. It offers medium density fiber boards and particle boards primarily for use in furniture, doors, flooring, and car, as well as construction and decoration, and electronic industries. The company was founded in 2000 and is based in Nanning, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanning",
        "zipcode": "530031",
        "website": "http://www.fenglingroup.com",
        "market_cap": "Small Cap"
    },
    "6655.TW": {
        "short_name": "KEDING ENTERPRISES CO LTD",
        "long_name": "Keding Enterprises Co., Ltd.",
        "summary": "Keding Enterprises Co., Ltd. produces and sells wood products worldwide. It offers prefinished furnishings, wood veneered panels, wood floorings, and interior wood doors. Keding Enterprises Co., Ltd. was founded in 2002 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "241",
        "website": "http://www.twkd.com",
        "market_cap": "Small Cap"
    },
    "7426.T": {
        "short_name": "YAMADAI CORP",
        "long_name": "Yamadai Corporation",
        "summary": "Yamadai Corporation provides residential materials. Its residential materials include wood, building materials, residential equipment, plywood, etc. The company is also involved in the wood processing; anti-corrosion processing; manual drying processing; forest plantation; real estate rental; and residential buildings design, construction, and supervision businesses. Yamadai Corporation was founded in 1964 and is based in Ishinomaki, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Ishinomaki",
        "zipcode": "986-0842",
        "website": "http://www.yamadai.com",
        "market_cap": "Small Cap"
    },
    "7808.T": {
        "short_name": "C.S. LUMBER CO INC",
        "long_name": "C.S. Lumber Co., Inc",
        "summary": "C.S. Lumber Co., Inc manufactures and sells timber, building materials, and sub-materials in Japan. It also operates as a general wooden building contractor; constructs standard wooden houses; transports pre-cut products; leases and manages real estate properties; and provides real estate brokerage services. The company was founded in 1984 and is headquartered in Chiba, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Chiba",
        "zipcode": "262-0033",
        "website": "http://www.c-s-lumber.co.jp",
        "market_cap": "Small Cap"
    },
    "7815.T": {
        "short_name": "TOKYO BOARD INDUSTRIES CO LTD",
        "long_name": "Tokyo Board Industries Co., Ltd.",
        "summary": "Tokyo Board Industries Co., Ltd. processes, manufactures, and sells wood chips using industrial and general waste in Japan. The company offers particle boards and plywood products. It is also involved in the collection and transportation of industrial waste; and general freight vehicle transportation business, as well as development and operation of commercial facilities. The company was founded in 1942 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "136-0082",
        "website": "http://www.t-b-i.co.jp",
        "market_cap": "Small Cap"
    },
    "7897.T": {
        "short_name": "HOKUSHIN CO LTD",
        "long_name": "Hokushin Co., Ltd.",
        "summary": "Hokushin Co., Ltd. manufactures and sells wood materials. The company was founded in 1931 and is headquartered in Kishiwada, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kishiwada",
        "zipcode": "596-8521",
        "website": "http://www.hokushinmdf.co.jp",
        "market_cap": "Small Cap"
    },
    "7961.T": {
        "short_name": "KANEMATSU SUSTECH CORPORATION",
        "long_name": "Kanematsu Sustech Corporation",
        "summary": "Kanematsu Sustech Corporation provides ground stabilization services through various methods of construction. The company operates through Geo-Tech, Wood & Housing Materials, and CCTV System divisions. The Geo-Tech division offers ground stabilization services, such as ground resurfacing, cement foundation pile repairs, steel foundation pile repairs, and ecological lumber piles. This division also provides various types of ground inspections and sinkage repair services. The Wood & Housing Materials division offers preservative treated wood foundations, structural laminated lumber, and structural plywood, as well as outdoor products, support lumber, and LC-polyphenol treated lumber. This division also provides wood preservation treatment services; eco wood piles that are wooden piles to stabilize the foundations of structures; and household matchboxes. The CCTV System division distributes security monitoring devices and others under the WISENET name in Japan. The company was formerly known as Kanematsu-NNK Corporation and changed its name to Kanematsu Sustech Corporation in October 2016. Kanematsu Sustech Corporation was founded in 1934 and is headquartered in Tokyo, Japan. Kanematsu Sustech Corporation is a subsidiary of Kanematsu Corporation.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0007",
        "website": "http://www.knn.co.jp",
        "market_cap": "Small Cap"
    },
    "8277.HK": {
        "short_name": "STEEDORIENTAL",
        "long_name": "Steed Oriental (Holdings) Company Limited",
        "summary": "Steed Oriental (Holdings) Company Limited, an investment holding company, sources, manufactures, and sells plywood and other wooden products in Japan, Mainland China, Thailand, Hong Kong, and internationally. The company provides general plywood used for manufacture of furniture for home and office; packing plywood used for packaging; structural panels for house construction; floor base products for flooring applications; supplementary materials used for construction; and other wooden products It sells its plywood products to construction materials trading companies and wholesalers; retailers, including supermarkets; flooring and furniture manufacturers; and individual or corporate end-users. Steed Oriental (Holdings) Company Limited was incorporated in 2013 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.steedoriental.com.hk",
        "market_cap": "Small Cap"
    },
    "8IF1.F": {
        "short_name": "INTERFOR CORP.",
        "long_name": "Interfor Corporation",
        "summary": "Interfor Corporation, together with its subsidiaries, produces and sells wood products in Canada, the United States, Japan, China, Taiwan, and internationally. The company offers lumber products for decking, fascia and trims, framings, furniture, industrial packaging, Japan Zairai, millworks, paneling, sidings, trusses, and windows and doors. It also provides logs, wood chips, and other residuals. The company was formerly known as International Forest Products Limited and changed its name to Interfor Corporation in May 2014. Interfor Corporation was founded in 1963 and is headquartered in Burnaby, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Burnaby",
        "zipcode": "V5H 4N2",
        "website": "http://www.interfor.com",
        "market_cap": "Small Cap"
    },
    "9E5.F": {
        "short_name": "SAMKO TIMBER LTD",
        "long_name": "Samko Timber Limited",
        "summary": "Samko Timber Limited, an integrated wood resource processor, provides primary and secondary processed timber products for residential, commercial, and industrial applications. The company operates through two segment, SGS and ST divisions. The SGS division manufactures and sells primary processed timber products, such as general plywood and laminated veneer lumber; and secondary processed timber products, including truck, piano body parts, and decking products. The ST division trades in various types of timber products; and produces secondary timber products comprising doors and windows. The company is also involved in the wholesale of plywood, sawn timber, logs, and related products; and production of wood panels and flooring products, as well as other wood based furniture. The company's plantation areas cover 1,397 hectares located in Java and Sulawesi, Indonesia. It primarily operates in Indonesia, North Asia, Malaysia, Singapore, the Middle East, Europe, the United States, Australia, South East Asia, and internationally. The company was founded in 1978 and is based in Singapore. Samko Timber Limited is a subsidiary of Sampoerna Forestry Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "199591",
        "website": "http://www.sampoernakayoe.co.id",
        "market_cap": "Small Cap"
    },
    "ACAZF": {
        "short_name": "ACADIAN TIMBER CORP",
        "long_name": "Acadian Timber Corp.",
        "summary": "Acadian Timber Corp. supplies primary forest products in Eastern Canada and the Northeastern United States. The company operates through two segments, NB Timberlands and Maine Timberlands. Its products include softwood and hardwood sawlogs, pulpwood, and biomass by-products. The company owns and manages approximately 1.1 million acres of freehold timberlands in New Brunswick and Maine; and provides timber services relating to approximately 1.3 million acres of Crown licensed timberlands in New Brunswick. Acadian Timber Corp. is headquartered in New Brunswick, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "NB",
        "city": "Edmundston",
        "zipcode": "E3V 1W2",
        "website": "http://www.acadiantimber.com",
        "market_cap": "Small Cap"
    },
    "ADN.TO": {
        "short_name": "ACADIAN TIMBER CORP",
        "long_name": "Acadian Timber Corp.",
        "summary": "Acadian Timber Corp. supplies primary forest products in Eastern Canada and the Northeastern United States. The company operates through two segments, NB Timberlands and Maine Timberlands. Its products include softwood and hardwood sawlogs, pulpwood, and biomass by-products. The company owns and manages approximately 1.1 million acres of freehold timberlands in New Brunswick and Maine; and provides timber services relating to approximately 1.3 million acres of Crown licensed timberlands in New Brunswick. Acadian Timber Corp. is headquartered in New Brunswick, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "NB",
        "city": "Edmundston",
        "zipcode": "E3V 1W2",
        "website": "http://www.acadiantimber.com",
        "market_cap": "Small Cap"
    },
    "ALCOG.PA": {
        "short_name": "COGRA",
        "long_name": "Cogra 48 Société Anonyme",
        "summary": "Cogra 48 SociÃ©tÃ© Anonyme produces and sells wood pellets and stoves. It also provides consulting, project planning, and assistance services in project management; and technical advice, boiler room layout, project design and dimensioning, power and distribution study, silo design study, and guaranteed supply services. The company distributes its pellets through a network of retailers in France and other European countries. Cogra 48 SociÃ©tÃ© Anonyme was founded in 1982 and is based in Mende, France.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "Mende",
        "zipcode": "48000",
        "website": "http://www.cogra.fr",
        "market_cap": "Small Cap"
    },
    "ALEO2.PA": {
        "short_name": "EO2",
        "long_name": "Eo2 Société Anonyme",
        "summary": "Eo2 SociÃ©tÃ© Anonyme designs, produces, and distributes wood heating products under the EO2 and PIKS brands in France. It wood pellets, distri'pellets, densified wood logs, and bulk wood pellets. The company was founded in 2006 and is based in Malakoff, France.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "Malakoff",
        "zipcode": "92240",
        "website": "http://www.eo2.fr",
        "market_cap": "Small Cap"
    },
    "ALMOU.PA": {
        "short_name": "MOULINVEST",
        "long_name": "Moulinvest SA",
        "summary": "Moulinvest SA produces and sells wood products in France. It manufactures wood panels, pellets, and lumbers; and generates electricity using cogeneration from biomass. The company also offers construction lumber and prefabricated solid wood walls. In addition, it provides structural cutting, laminated wood, glued wood, and CLT under the MassifBois brand; and outdoor landscaping and equestrian products, as well as stakes for arboriculture and viticulture under the Decovert brand name. The company was founded in 1916 and is based in DuniÃ¨res, France.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "DuniÃ¨res",
        "zipcode": "43220",
        "website": "http://www.moulinvest.com",
        "market_cap": "Small Cap"
    },
    "ARB.NZ": {
        "short_name": "ArborGen Holdings Limited Ordin",
        "long_name": "ArborGen Holdings Limited",
        "summary": "ArborGen Holdings Limited engages in the forestry genetics business. It produces and sells tree seedlings with a focus on pine, radiate, and eucalyptus species. The company provides its tree seedlings under the ArborGen brand name to forest land owners and managers primarily in the United States, Brazil, and Australasia. The company was formerly known as Rubicon Limited and changed its name to ArborGen Holdings Limited in September 2019. ArborGen Holdings Limited is based in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "10",
        "website": "http://www.rubicon-nz.com",
        "market_cap": "Small Cap"
    },
    "ARCHIDPLY.NS": {
        "short_name": "ARCHIDPLY IND LTD",
        "long_name": "Archidply Industries Limited",
        "summary": "Archidply Industries Limited manufactures and sells wood and paper based products in India. It offers decorative laminates; archidply, monarchply, silvi, and ojus plywoods; and PVC boards, WPC board, and hybrid WPC board. The company also manufactures tea under the Bordhumsa Tea brand name. It sells its products to banks and insurance, educational institutes, airports, government projects, hospitals, hotels, multiplexes, corporates, apartment complexes, retails, universities, and builders. The company also exports its products to 20 countries. Archidply Industries Limited was founded in 1976 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110015",
        "website": "http://www.archidply.com",
        "market_cap": "Small Cap"
    },
    "AS4.F": {
        "short_name": "CORT.AMORIM SGPS NAM.EO 1",
        "long_name": "Corticeira Amorim, S.G.P.S., S.A.",
        "summary": "Corticeira Amorim, S.G.P.S., S.A. manufactures and sells cork and cork related products worldwide. The company operates through Raw Materials, Cork Stoppers, Floor and Wall Coverings, Composite Cork, and Insulation Cork segments. It offers wine, champagne and sparkling wine, and capsulated cork stoppers; cork floor and wall coverings, and stone and wood floorings; and cork composite solutions. The company also provides expanded insulation corkboards for use in exterior and interior walls, double walls, paving slabs, flat and sloping roofs, and under floor heating; MDFachada, an expanded insulation corkboard for use in exterior wall cladding, and interior walls and ceilings; LambourdÃ©, a system for quick assembly designed for insulation solutions in new construction and building renovation; Corkoco, a solution for acoustic insulation in ceilings, walls, and floors; Coco, a solution of hard fibers for insulation; expanded cork granulate, a lightweight filling solution with acoustic insulation properties used in floor leveling products, floors, and interior double walls; and Corksorb, a cork based absorbent to absorbs oils, hydrocarbons, and their derivatives without absorbing water. It serves the wine and spirits, construction and infrastructure, architecture and design, aerospace, transportation and energy, sports, and other industries. The company was founded in 1870 and is headquartered in Mozelos, Portugal.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Portugal",
        "state": null,
        "city": "Mozelos",
        "zipcode": "4536-902",
        "website": "http://www.corticeiraamorim.com",
        "market_cap": "Small Cap"
    },
    "AXS.AS": {
        "short_name": "ACCSYS",
        "long_name": "Accsys Technologies PLC",
        "summary": "Accsys Technologies PLC, together with its subsidiaries, produces and sells Accoya solid wood and Tricoya wood elements in the United Kingdom, Ireland, Benelux, rest of Europe, the Americas, the Asia-Pacific, and internationally. The company offers Accoya wood for use in windows and doors, decking, cladding, bridges, and exterior structures and applications; and Tricoya wood elements for facades and cladding, soffits and eaves, exterior joinery, wet interiors, door skins, flooring, signage, and marine uses, as well as kitchen carcasses, art installations, and window components. It also provides technical and engineering services to licensees; and sells acetic acid, a by-product from the manufacturing process. The company is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "AMS",
        "market": "nl_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "WC2E 7EN",
        "website": "http://www.accsysplc.com",
        "market_cap": "Small Cap"
    },
    "AZFL": {
        "short_name": "AMAZONAS FLORESTAL LTD",
        "long_name": "Amazonas Florestal, Ltd",
        "summary": "Amazonas Florestal, Ltd operates and manages timber tracts. The company was incorporated in 2008 and is based in Miami, Florida. Amazonas Florestal, Ltd was formerly known as Ecologic Systems, Inc and changed its name to Amazonas Florestal, Ltd in 2012. Amazonas Florestal, Ltd operates as a subsidiary of Peartrack Security Systems, Inc.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Miami",
        "zipcode": "33131",
        "website": "http://www.azflus.com",
        "market_cap": "Small Cap"
    },
    "BC0.F": {
        "short_name": "BOISE CASCADE CO. DL -,01",
        "long_name": "Boise Cascade Company",
        "summary": "Boise Cascade Company manufactures wood products and distributes building materials in the United States and Canada. It operates in two segments, Wood Products and Building Materials Distribution. The Wood Products segment manufactures laminated veneer lumber and laminated beams used in headers and beams; I-joists for residential and commercial flooring and roofing systems, and other structural applications; and structural, appearance, and industrial plywood panels. This segment's products are used in new residential construction, residential repair-and-remodeling markets, light commercial construction, and industrial applications. It sells its products to wholesalers, home improvement centers, retail lumberyards, and industrial converters. The Building Materials Distribution segment distributes a line of building materials, including oriented strand boards, plywood, and lumber; general line items, such as siding, composite decking, doors, metal products, insulation, and roofing; and engineered wood products. This segment sells its products to retail lumberyards, home improvement centers, and specialty distributors. The company was founded in 2004 and is headquartered in Boise, Idaho.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "ID",
        "city": "Boise",
        "zipcode": "83702-5389",
        "website": "http://www.bc.com",
        "market_cap": "Mid Cap"
    },
    "BCC": {
        "short_name": "Boise Cascade, L.L.C.",
        "long_name": "Boise Cascade Company",
        "summary": "Boise Cascade Company manufactures wood products and distributes building materials in the United States and Canada. It operates in two segments, Wood Products and Building Materials Distribution. The Wood Products segment manufactures laminated veneer lumber and laminated beams used in headers and beams; I-joists for residential and commercial flooring and roofing systems, and other structural applications; and structural, appearance, and industrial plywood panels. This segment's products are used in new residential construction, residential repair-and-remodeling markets, light commercial construction, and industrial applications. It sells its products to wholesalers, home improvement centers, retail lumberyards, and industrial converters. The Building Materials Distribution segment distributes a line of building materials, including oriented strand boards, plywood, and lumber; general line items, such as siding, composite decking, doors, metal products, insulation, and roofing; and engineered wood products. This segment sells its products to retail lumberyards, home improvement centers, and specialty distributors. The company was founded in 2004 and is headquartered in Boise, Idaho.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "ID",
        "city": "Boise",
        "zipcode": "83702-5389",
        "website": "http://www.bc.com",
        "market_cap": "Mid Cap"
    },
    "BEI.SI": {
        "short_name": "LHT",
        "long_name": "LHT Holdings Limited",
        "summary": "LHT Holdings Limited manufactures and trades in wooden pallets and timber-related products in Singapore, Malaysia, and internationally. It operates through four segments: Pallet/Packaging, Timber Related Products, Technical Wood and Related Products, and Pallet Rental and Others. The Pallet/Packaging segment manufactures and supplies wooden pallets and cases for the packing of industrial products. The Timber Related Products segment trades in raw timber related products. The Technical Wood and Related Products segment manufactures Technical Wood, Technical Wood flooring, and wood waste collection products. The Pallet Rental and Others segment engages in pallet-leasing business. The company also operates as a timber merchant; saw miller; commission agent; and dealer in wood products, pallets, and packaging, as well as recycles and recovers wood waste. In addition, it manufactures, imports, and exports green products and woodchips, as well as provides industrial packaging and heat treatment services. The company was founded in 1977 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "729335",
        "website": "http://www.lht.com.sg",
        "market_cap": "Small Cap"
    },
    "BMSPF": {
        "short_name": "BIOMASS SECURE POWER INC",
        "long_name": "Biomass Secure Power Inc.",
        "summary": "Biomass Secure Power Inc. engages in the production and supply of torrefied biomass briquettes from forest residuals and waste for use as a substitute for coal in Canada. The company is headquartered in Natchitoches, Louisiana.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "LA",
        "city": "Natchitoches",
        "zipcode": "71411",
        "website": "http://www.biomasssecurepower.ca",
        "market_cap": "Small Cap"
    },
    "BQ3.F": {
        "short_name": "BIG RIVER INDS LTD",
        "long_name": "Big River Industries Limited",
        "summary": "Big River Industries Limited, together with its subsidiaries, engages in the manufacture, distribution, and retail of timber products and building supplies in Australia and New Zealand. The company offers builders hardware products, including nails, brackets, fixings, builders plastic products and adhesives, saw blades, hardwood pegs, silicone products, and door handles and locks, as well as formwork accessories and reinforcing products; building products, pine framing, fiber cement, hardwood for structural and decorative purposes, plywood, sheet materials, particle board flooring, landscaping and fencing supplies, doors, door furniture, and external timber cladding products; LVL, I-beams, and laminated beams; timber flooring, decking, and molding products; and formwork, insulation, and other products. It also provides formwork products, such as armourform formply, LVL formwork, armourdeck steel decking, steel reinforcing, and PVC wall system, as well as formwork accessories; bridge products, including engineered plywood bridge decking, girder beams, and structural kerbing. In addition, the company offers flooring products comprising prefinished and uncoated engineered timber, and T&G and engineered oak flooring products; engineered wood panels and stair tread coverings; and flooring accessories consisting of trims/beading/scotia, foam and rubber flooring underlays, aluminum trims, floor coatings, adhesives, fixings/nails, and other products. Further, it provides plywood products, such as sound barrier, and T&G ply flooring and roofing products; V-grooved, hardwood, anti-slip, structural, structural appearance grade, and structural bridge decking plywood products; autoclaved aerated concrete flooring products; and walling panels. It serves residential, commercial, civil, and infrastructure construction industries. Big River Industries Limited was incorporated in 2015 and is based in Junction Hill, Australia.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Junction Hill",
        "zipcode": "2460",
        "website": "http://bigriverindustries.com.au",
        "market_cap": "Small Cap"
    },
    "BRG-B.ST": {
        "short_name": "Bergs Timber AB ser. B",
        "long_name": "Bergs Timber AB (publ)",
        "summary": "Bergs Timber AB (publ) produces, distributes, and sells sawn and processed timber products in Sweden, the United Kingdom, and internationally. It offers structural timber in spruce and pine forms; treated timber products; and gardening products, windows, doors, and prefabricated houses. The company also provides cellulose chips and sawdust for the production of paper pulp, heat, and energy; and forestry services. In addition, it operates sawmills; and sells by-products from manufacture to the pulp and particle board industries. The company was formerly known as CF Berg & Co. Bergs Timber AB (publ) was founded in 1919 and is headquartered in Vimmerby, Sweden.",
        "currency": "SEK",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "state": null,
        "city": "Vimmerby",
        "zipcode": "598 37",
        "website": "http://www.bergstimber.se",
        "market_cap": "Small Cap"
    },
    "BRI.AX": {
        "short_name": "BIG RIVER FPO",
        "long_name": "Big River Industries Limited",
        "summary": "Big River Industries Limited, together with its subsidiaries, engages in the manufacture, distribution, and retail of timber products and building supplies in Australia and New Zealand. The company offers builders hardware products, including nails, brackets, fixings, builders plastic products and adhesives, saw blades, hardwood pegs, silicone products, and door handles and locks, as well as formwork accessories and reinforcing products; building products, pine framing, fiber cement, hardwood for structural and decorative purposes, plywood, sheet materials, particle board flooring, landscaping and fencing supplies, doors, door furniture, and external timber cladding products; LVL, I-beams, and laminated beams; timber flooring, decking, and molding products; and formwork, insulation, and other products. It also provides formwork products, such as armourform formply, LVL formwork, armourdeck steel decking, steel reinforcing, and PVC wall system, as well as formwork accessories; bridge products, including engineered plywood bridge decking, girder beams, and structural kerbing. In addition, the company offers flooring products comprising prefinished and uncoated engineered timber, and T&G and engineered oak flooring products; engineered wood panels and stair tread coverings; and flooring accessories consisting of trims/beading/scotia, foam and rubber flooring underlays, aluminum trims, floor coatings, adhesives, fixings/nails, and other products. Further, it provides plywood products, such as sound barrier, and T&G ply flooring and roofing products; V-grooved, hardwood, anti-slip, structural, structural appearance grade, and structural bridge decking plywood products; autoclaved aerated concrete flooring products; and walling panels. It serves residential, commercial, civil, and infrastructure construction industries. Big River Industries Limited was incorporated in 2015 and is based in Junction Hill, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Junction Hill",
        "zipcode": "2460",
        "website": "http://bigriverindustries.com.au",
        "market_cap": "Small Cap"
    },
    "BSTO": {
        "short_name": "BLUE STAR OPPORTUNITIES CORP",
        "long_name": "Blue Star Opportunities Corp.",
        "summary": "Blue Star Opportunities Corp., a window marketing company, produces and supplies flooring and other components used in renovation and construction of office, commercial, retail space, and multi-unit dwellings under the Duro Design brand name in the United States and Canada. The company offers bamboo, cork, maple, oak, tamarindo, and eucalyptus products, as well as hickory and various other wood flooring products. It serves architects, designers, real estate managers, institutions, museums, churches, retail chains, and individual homeowners through a network of value added resellers and independent agents, as well as directly to consumers through Duro Design factory outlets. The company was formerly known as Green Zap Inc. and changed its name to Blue Star Opportunities Corp. in July 2008. Blue Star Opportunities Corp. was incorporated in 1986 and is based in Laval, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "QC",
        "city": "Laval",
        "zipcode": "H7P 5P2",
        "website": "http://www.bstocorp.com",
        "market_cap": "Small Cap"
    },
    "BTTL3.SA": {
        "short_name": "BATTISTELLA ON",
        "long_name": "Embpar Participacoes S.A.",
        "summary": "Battistella AdministraÃ§Ã£o e ParticipaÃ§Ãµes S.A., together with its subsidiaries, engages in trading heavy vehicles under the Scania brand. It offers trucks, buses, and accessories; and technical services through authorized dealers, as well as operates a service station across 246 municipalities in the State of ParanÃ¡. The company also engages in the manufacture and sale of pine lumber, woodchips, sawdust, and pine timber products for use in pallet components, furniture, and packing applications. It exports its wood products to approximately 50 countries in Central America, North America, Asia, and the Middle East. Battistella AdministraÃ§Ã£o e ParticipaÃ§Ãµes S.A. was formerly known as Battistella AdministraÃ§Ã£o e ParticipaÃ§Ãµes S/A Â\u0096 APABA and it changed its name to Battistella AdministraÃ§Ã£o e ParticipaÃ§Ãµes S.A. in April 2008. The company was founded in 1949 and is based in SÃ£o JosÃ© dos Pinhais, Brazil. Battistella AdministraÃ§Ã£o e ParticipaÃ§Ãµes S.A. is a subsidiary of AlianÃ§a Battistella e AgropecuÃ¡ria e AdministraÃ§Ã£o de Bens S.A.",
        "currency": "BRL",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "state": "PR",
        "city": "SÃ£o JosÃ© dos Pinhais",
        "zipcode": "83015-140",
        "website": "http://www.battistella.com.br",
        "market_cap": "Small Cap"
    },
    "CFF.TO": {
        "short_name": "CONIFEX TIMBER INC",
        "long_name": "Conifex Timber Inc.",
        "summary": "Conifex Timber Inc. primarily manufactures and sells lumber products in the United States, China, Canada, Japan, and internationally. It is involved in the timber harvesting, reforestation, and forest management activities; manufacture of finished softwood lumber from spruce, pine, and fir logs; manufacture, sale, and distribution of dimension lumber; processing logs into lumber and wood chips, as well as by-products or residues, such as trim blocks, sawdust, shavings, and barks; and providing value added lumber finishing services. The company also develops bioenergy and bio products; and operates a 36 megawatt biomass power generation plant, which produces renewable energy for commercial sale. The company was formerly known as West Fourth Capital Inc. and changed its name to Conifex Timber Inc. in June 2010. Conifex Timber Inc. was incorporated in 2007 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V7Y 1B6",
        "website": "http://www.conifex.com",
        "market_cap": "Small Cap"
    },
    "CFP.TO": {
        "short_name": "CANFOR CORP",
        "long_name": "Canfor Corporation",
        "summary": "Canfor Corporation operates as an integrated forest products company in Canada, Asia, the United States, Europe, and internationally. It operates through Lumber, and Pulp and Paper segments. The company manufactures and sells finger-jointed lumber, higher-grade MSR lumber, premium one-inch boards, engineered wood products, wood chips, wood pellets, logs, strength-rated trusses, beams, and tongue-and-groove timber, as well as generates green energy. It also produces and sells pulp and paper products, including northern bleached softwood kraft pulp, bleached and unbleached kraft paper, and bleached chemi-thermo mechanical pulp; and purchases and sells residual fiber products. Canfor Corporation was incorporated in 1966 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6P 6G2",
        "website": "http://www.canfor.com",
        "market_cap": "Mid Cap"
    },
    "CFPZF": {
        "short_name": "CANFOR CORP NEW",
        "long_name": "Canfor Corporation",
        "summary": "Canfor Corporation operates as an integrated forest products company in Canada, Asia, the United States, Europe, and internationally. It operates through Lumber, and Pulp and Paper segments. The company manufactures and sells finger-jointed lumber, higher-grade MSR lumber, premium one-inch boards, engineered wood products, wood chips, wood pellets, logs, strength-rated trusses, beams, and tongue-and-groove timber, as well as generates green energy. It also produces and sells pulp and paper products, including northern bleached softwood kraft pulp, bleached and unbleached kraft paper, and bleached chemi-thermo mechanical pulp; and purchases and sells residual fiber products. Canfor Corporation was incorporated in 1966 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6P 6G2",
        "website": "http://www.canfor.com",
        "market_cap": "Mid Cap"
    },
    "CFXTF": {
        "short_name": "CONIFEX TIMBER INC",
        "long_name": "Conifex Timber Inc.",
        "summary": "Conifex Timber Inc. primarily manufactures and sells lumber products in the United States, China, Canada, Japan, and internationally. It is involved in the timber harvesting, reforestation, and forest management activities; manufacture of finished softwood lumber from spruce, pine, and fir logs; manufacture, sale, and distribution of dimension lumber; processing logs into lumber and wood chips, as well as by-products or residues, such as trim blocks, sawdust, shavings, and barks; and providing value added lumber finishing services. The company also develops bioenergy and bio products; and operates a 36 megawatt biomass power generation plant, which produces renewable energy for commercial sale. The company was formerly known as West Fourth Capital Inc. and changed its name to Conifex Timber Inc. in June 2010. Conifex Timber Inc. was incorporated in 2007 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V7Y 1B6",
        "website": "http://www.conifex.com",
        "market_cap": "Small Cap"
    },
    "COR.LS": {
        "short_name": "CORTICEIRA AMORIM",
        "long_name": "Corticeira Amorim, S.G.P.S., S.A.",
        "summary": "Corticeira Amorim, S.G.P.S., S.A. manufactures and sells cork and cork related products worldwide. The company operates through Raw Materials, Cork Stoppers, Floor and Wall Coverings, Composite Cork, and Insulation Cork segments. It offers wine, champagne and sparkling wine, and capsulated cork stoppers; cork floor and wall coverings, and stone and wood floorings; and cork composite solutions. The company also provides expanded insulation corkboards for use in exterior and interior walls, double walls, paving slabs, flat and sloping roofs, and under floor heating; MDFachada, an expanded insulation corkboard for use in exterior wall cladding, and interior walls and ceilings; LambourdÃ©, a system for quick assembly designed for insulation solutions in new construction and building renovation; Corkoco, a solution for acoustic insulation in ceilings, walls, and floors; Coco, a solution of hard fibers for insulation; expanded cork granulate, a lightweight filling solution with acoustic insulation properties used in floor leveling products, floors, and interior double walls; and Corksorb, a cork based absorbent to absorbs oils, hydrocarbons, and their derivatives without absorbing water. It serves the wine and spirits, construction and infrastructure, architecture and design, aerospace, transportation and energy, sports, and other industries. The company was founded in 1870 and is headquartered in Mozelos, Portugal.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "LIS",
        "market": "pt_market",
        "country": "Portugal",
        "state": null,
        "city": "Mozelos",
        "zipcode": "4536-902",
        "website": "http://www.corticeiraamorim.com",
        "market_cap": "Small Cap"
    },
    "DLX.DE": {
        "short_name": "DELIGNIT AG  INH.O.N.",
        "long_name": "Delignit AG",
        "summary": "Delignit AG develops, manufactures, and sells ecological and wood-based materials and system solutions based on natural, renewable, and CO2 neutral raw material wood in Germany. The company offers manufacture and sale of cargo bay protection systems and security systems; original equipment manufacturers: retrofit equipment; cargo bay; floors, walls, and partition walls; cabinet systems; and trunk covers for light commercial vehicles, motor caravans, and passenger cars. It also provides flooring solutions for automotive manufacturing plants, as well as for goods distribution centers; beech-based plywood; highly and medium compressed materials that are used in plant construction, machine construction, and transformer construction applications; and manufactures rail vehicles with floor system solutions for fire protection and sound insulation concepts Delignit AG offers its products and solutions under the Delignit, VANYCARE, Carbonwood, Dunacore, Feinholz, Festholz, and Panzerholz brand names. The company was founded in 1799 and is based in Blomberg, Germany.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "GER",
        "market": "de_market",
        "country": "Germany",
        "state": null,
        "city": "Blomberg",
        "zipcode": "32825",
        "website": "http://www.delignit-ag.de",
        "market_cap": "Small Cap"
    },
    "DLX.F": {
        "short_name": "DELIGNIT AG  INH.O.N.",
        "long_name": "Delignit AG",
        "summary": "Delignit AG develops, manufactures, and sells ecological and wood-based materials and system solutions based on natural, renewable, and CO2 neutral raw material wood in Germany. The company offers manufacture and sale of cargo bay protection systems and security systems; original equipment manufacturers: retrofit equipment; cargo bay; floors, walls, and partition walls; cabinet systems; and trunk covers for light commercial vehicles, motor caravans, and passenger cars. It also provides flooring solutions for automotive manufacturing plants, as well as for goods distribution centers; beech-based plywood; highly and medium compressed materials that are used in plant construction, machine construction, and transformer construction applications; and manufactures rail vehicles with floor system solutions for fire protection and sound insulation concepts Delignit AG offers its products and solutions under the Delignit, VANYCARE, Carbonwood, Dunacore, Feinholz, Festholz, and Panzerholz brand names. The company was founded in 1799 and is based in Blomberg, Germany.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Germany",
        "state": null,
        "city": "Blomberg",
        "zipcode": "32825",
        "website": "http://www.delignit-ag.de",
        "market_cap": "Small Cap"
    },
    "DTEX3.SA": {
        "short_name": "DURATEX     ON      NM",
        "long_name": "Duratex S.A.",
        "summary": "Duratex S.A., together with its subsidiaries, produces and sells industrialized wood panels in Brazil. It operates through three business divisions Wood, Deca, and Ceramic Tiles. The company sells wood laminate floors and vinyl flooring products under the Durafloor brand name; and manufactures and sells raw and coated MDP and MDF panels used in the furniture and civil construction industries under the Duratex brand name. It also manufactures and sells washbasins and sinks, toilets, electric and gas showers, flush valves for toilets, faucets, and other products under the Deca and Hydra brands for commercial and residential bathrooms and kitchens; and produces polished porcelain used in the driest rooms of houses, such as living rooms, corridors, and bedrooms, as well as tiles and special coating products under the Ceusa and Portinari brands. The company was formerly known as Satipel Industrial S.A. and changed its name to Duratex S.A. in September 2009. Duratex S.A. was founded in 1951 and is headquartered in SÃ£o Paulo, Brazil. Duratex S.A. operates as a subsidiary of ItaÃºsa - Investimentos ItaÃº S.A.",
        "currency": "BRL",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "state": "SP",
        "city": "SÃ£o Paulo",
        "zipcode": "01310-942",
        "website": "http://www.duratex.com.br",
        "market_cap": "Mid Cap"
    },
    "E6R.SI": {
        "short_name": "Samko Timber",
        "long_name": "Samko Timber Limited",
        "summary": "Samko Timber Limited, an integrated wood resource processor, provides primary and secondary processed timber products for residential, commercial, and industrial applications. The company operates through two segment, SGS and ST divisions. The SGS division manufactures and sells primary processed timber products, such as general plywood and laminated veneer lumber; and secondary processed timber products, including truck, piano body parts, and decking products. The ST division trades in various types of timber products; and produces secondary timber products comprising doors and windows. The company is also involved in the wholesale of plywood, sawn timber, logs, and related products; and production of wood panels and flooring products, as well as other wood based furniture. The company's plantation areas cover 1,397 hectares located in Java and Sulawesi, Indonesia. It primarily operates in Indonesia, North Asia, Malaysia, Singapore, the Middle East, Europe, the United States, Australia, South East Asia, and internationally. The company was founded in 1978 and is based in Singapore. Samko Timber Limited is a subsidiary of Sampoerna Forestry Limited.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "199591",
        "website": "http://www.sampoernakayoe.co.id",
        "market_cap": "Small Cap"
    },
    "EMEXF": {
        "short_name": "EMERALD PLANTATION HLDGS LTD",
        "long_name": "Emerald Plantation Holdings Limited",
        "summary": "Emerald Plantation Holdings Limited operates as a forest plantation company primarily in China. The company produces and sells standing timber and logs, wood panels, blockboards, plywood cabinetry, and other products that are used for the construction of buildings and infrastructure, and furniture and interior decorative fixtures. It also offers engineered-wood flooring products, sawn timber, and finger-joint boards, as well as plywood and veneer products. In addition, the company is involved in greenery nursery operations; and supplying and managing landscaping products for property developers, local governments, and other organizations. Emerald Plantation Holdings Limited was founded in 1994 and is based in Wanchai, Hong Kong.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wanchai",
        "zipcode": null,
        "website": "http://www.emeraldplantationholdings.com",
        "market_cap": "Small Cap"
    },
    "EO4.F": {
        "short_name": "EO2  EO 1",
        "long_name": "Eo2 Société Anonyme",
        "summary": "Eo2 SociÃ©tÃ© Anonyme designs, produces, and distributes wood heating products under the EO2 and PIKS brands in France. It wood pellets, distri'pellets, densified wood logs, and bulk wood pellets. The company was founded in 2006 and is based in Malakoff, France.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "France",
        "state": null,
        "city": "Malakoff",
        "zipcode": "92240",
        "website": "http://www.eo2.fr",
        "market_cap": "Small Cap"
    },
    "EVA": {
        "short_name": "Enviva Partners, LP",
        "long_name": "Enviva Partners, LP",
        "summary": "Enviva Partners, LP produces and sells utility-grade wood pellets. The company's products are used as a substitute for coal in power generation, and combined heat and power plants. It serves power generators in the United Kingdom, Europe, and Japan. Enviva Partners GP, LLC operates as the general partner of the company. Enviva Partners, LP was founded in 2013 and is headquartered in Bethesda, Maryland.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MD",
        "city": "Bethesda",
        "zipcode": "20814",
        "website": "http://www.envivabiomass.com",
        "market_cap": "Small Cap"
    },
    "EXRG": {
        "short_name": "ECOLOGIX RESOURCES GROUP INC",
        "long_name": "EcoLogix Resource Group, Inc.",
        "summary": "Ecologix Resource Group, Inc., a natural resource company, focuses on harvesting and marketing timber. The company engages in harvesting various species of hardwood. It also involves in the production of alternative energy solutions, such as ethanol and biodiesel. The company was formerly known as Battery Control Corp. and changed its name to Ecologix Resource Group, Inc. on July 14, 2009. Ecologix Resource Group, Inc. was founded in 2007 and is based in Beverly Hills, California.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Beverly Hills",
        "zipcode": "90212",
        "website": null,
        "market_cap": "Small Cap"
    },
    "GDL.TO": {
        "short_name": "GOODFELLOW INC",
        "long_name": "Goodfellow Inc.",
        "summary": "Goodfellow Inc. engages in the wholesale distribution of lumber products, building materials, and hardwood flooring products to the retail trade, industrial, and manufacturing sectors in Canada and the United States. It is also involved in the remanufacturing and distribution of lumber and wood products. The company's decking products include accessories, composite, and wood products for outdoor spaces; and flooring products comprise planks and tiles, engineered wood floors, hardwood floors, laminates, sub-floors and accessories, wood-plastic composite, and stone product composite. It also provides insulation and sound-proofing products; lumber products comprising cedar, Douglas fir, engineered wood, glued-laminated timber, hardwood, Hemlock timber, pine, and treated wood products, as well as lumber products for the mining industry; and panels consisting of construction and hardwood plywood panels, medium and high density fiber boards, oriented strand board panels, particleboards, and melamine panels and accessories. In addition, the company offers siding products, including accessories, engineered wood sidings, and wood siding boards; cedar, asphalt, or polymer roofing products; and wall concepts, such as laminate and wood planks. Further, it offers ceiling, hardware, and solid surface, as well as interior materials. Additionally, the company provides custom timber fabrication, engineering, container and van loading, and export prep and packaging services. The company was formerly known as Goodfellow Lumber Ltd. and changed its name to Goodfellow Inc. in October 1984. Goodfellow Inc. was founded in 1898 and is headquartered in Delson, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Delson",
        "zipcode": "J5B 1V5",
        "website": "http://www.goodfellowinc.com",
        "market_cap": "Small Cap"
    },
    "GREENPLY.NS": {
        "short_name": "GREENPLY INDUSTRIE",
        "long_name": "Greenply Industries Limited",
        "summary": "Greenply Industries Limited, an interior infrastructure company, manufactures, markets, trades in, and distributes plywood and allied products in India and internationally. The company provides plywood and block boards, decorative veneers, flush doors, wood floors, and PVC foam boards and sheets. It markets its products through a network of distributors, dealers, and retailers. The company was formerly known as Mittal Laminates Private Limited and changed its name to Greenply Industries Limited in 1995. Greenply Industries Limited was founded in 1990 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700027",
        "website": "http://www.greenply.com",
        "market_cap": "Small Cap"
    },
    "HMTC": {
        "short_name": "HOMASOTE CO",
        "long_name": "Homasote Company",
        "summary": "Homasote Company manufactures and sells building and industrial products for the construction and manufacturing industries in the United States. The company operates in two divisions, Millboard and Industrial. The Millboard division provides wall and floor sound insulation products, roof and floor deckings, concrete expansion joints and forming boards, and finished interior panels. The Industrial division offers various shapes and coated strips for product separation and breakage reduction that protects customer's products during interplant transport primarily for use in glass, paper, and metal industries, as well as provides packaging products to end-users, appliance manufacturers, and office furniture makers. The company's products are applied in various applications that include sound control, basement and concrete slab conversions, cathedral ceilings, fire-rated products, concrete forming, decorative/tackable panels, floors, floor and surface protection products, hobbies, house and workshops, ice rink conversions, roofs and ceilings, shock absorptions, and thermal insulations, as well as construction and renovation of multi-family dwellings, commercial office buildings, educational facilities, single-family dwellings, and retail establishments. It serves building material wholesalers and contractors, and industrial manufacturers. The company also exports its products to Canada and internationally. Homasote Company was founded in 1909 and is based in West Trenton, New Jersey.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "West Trenton",
        "zipcode": "08628-0240",
        "website": "http://www.homasote.com",
        "market_cap": "Small Cap"
    },
    "IFII.JK": {
        "short_name": "Indonesia Fibreboard Industry T",
        "long_name": "PT Indonesia Fibreboard Industry Tbk",
        "summary": "PT Indonesia Fibreboard Industry Tbk manufactures and sells wood products in Indonesia, the Middle East, Japan, Southeast Asia, Korea, China, and Taiwan. Its products include high, medium, and low density fiberboards; high moisture resistance wood products; plywood and plywood medium density fiberboard (MDF) products; MDF laminate paper; and veneer wood products. The company was founded in 2007 and is headquartered in Jakarta Utara, Indonesia. PT Indonesia Fibreboard Industry Tbk is a subsidiary of PT Adrindo Intiperkasa.",
        "currency": "IDR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Utara",
        "zipcode": "14440",
        "website": "http://www.pt-ifi.com",
        "market_cap": "Small Cap"
    },
    "IFP.TO": {
        "short_name": "INTERFOR CORPORATION",
        "long_name": "Interfor Corporation",
        "summary": "Interfor Corporation, together with its subsidiaries, produces and sells wood products in Canada, the United States, Japan, China, Taiwan, and internationally. The company offers lumber products for decking, fascia and trims, framings, furniture, industrial packaging, Japan Zairai, millworks, paneling, sidings, trusses, and windows and doors. It also provides logs, wood chips, and other residuals. The company was formerly known as International Forest Products Limited and changed its name to Interfor Corporation in May 2014. Interfor Corporation was founded in 1963 and is headquartered in Burnaby, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Burnaby",
        "zipcode": "V5H 4N2",
        "website": "http://www.interfor.com",
        "market_cap": "Small Cap"
    },
    "IFSPF": {
        "short_name": "INTERFOR CORP",
        "long_name": "Interfor Corporation",
        "summary": "Interfor Corporation, together with its subsidiaries, produces and sells wood products in Canada, the United States, Japan, China, Taiwan, and internationally. The company offers lumber products for decking, fascia and trims, framings, furniture, industrial packaging, Japan Zairai, millworks, paneling, sidings, trusses, and windows and doors. It also provides logs, wood chips, and other residuals. The company was formerly known as International Forest Products Limited and changed its name to Interfor Corporation in May 2014. Interfor Corporation was founded in 1963 and is headquartered in Burnaby, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Burnaby",
        "zipcode": "V5H 4N2",
        "website": "http://www.interfor.com",
        "market_cap": "Mid Cap"
    },
    "JCTCF": {
        "short_name": "Jewett-Cameron Trading Company",
        "long_name": "Jewett-Cameron Trading Company Ltd.",
        "summary": "Jewett-Cameron Trading Company Ltd., through its subsidiaries, manufactures and distributes specialty metal products and distributes wood products to home centers and other retailers primarily in the United States. The company operates through three segments: Industrial Wood Products; Lawn, Garden, Pet and Other; and Seed Processing and Sales. The Industrial Wood Products segment processes and distributes industrial wood products. It offers treated plywood to the transportation industry. The Lawn, Garden, Pet and Other segment is involved in the wholesale of wood products, such as fencing and landscape timbers; and manufacture and distribution of specialty metal products comprising dog kennels, proprietary gate support systems, perimeter fencings, and greenhouses. The Seed Processing and Sales segment processes and distributes agricultural seeds to distributors, as well as cleaning seeds. The company was founded in 1953 and is based in North Plains, Oregon.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "OR",
        "city": "North Plains",
        "zipcode": "97133",
        "website": "http://www.jewettcameron.com",
        "market_cap": "Small Cap"
    },
    "KAYU.JK": {
        "short_name": "Darmi Bersaudara Tbk.",
        "long_name": "PT Darmi Bersaudara Tbk",
        "summary": "PT Darmi Bersaudara Tbk primarily engages in the trading of processed wood products in Indonesia. It offers raw wood, as well as various types of processed wood, such as Merbau, Bengkirai, Kampoor, Keruing, and Meranti for use in decking, E2E, T&G, flooring, door jamb, post beam, finger joint, and window jamb applications. The company also exports its products to China, Nepal, India, Australia, and Europe. PT Darmi Bersaudara Tbk was founded in 1998 and is based in Surabaya, Indonesia.",
        "currency": "IDR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Surabaya",
        "zipcode": "60118",
        "website": "http://www.darbewood.com",
        "market_cap": "Small Cap"
    },
    "KEWL": {
        "short_name": "KEWEENAW LAND ASSOCIATIN",
        "long_name": "Keweenaw Land Association, Limited",
        "summary": "Keweenaw Land Association, Limited operates as a land and timber management company in the United States. It provides pulpwood, pallet sawbolts, sawtimber, and veneer for consuming mills. The company also sells real estate properties, and sand and gravel; and offers recreational and mineral rights leasing services, as well as wood scaling and inventory management services for various customers. As of December 31, 2020, it had 182,399 acres of surface land and 401,532 acres of subsurface mineral rights located in the western Upper Peninsula of Michigan and northern Wisconsin. The company was founded in 1865 and is headquartered in Ironwood, Michigan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MI",
        "city": "Ironwood",
        "zipcode": "49938",
        "website": "http://www.keweenaw.com",
        "market_cap": "Small Cap"
    },
    "KPT.AX": {
        "short_name": "KANGISLAND FPO",
        "long_name": "Kangaroo Island Plantation Timbers Limited",
        "summary": "Kangaroo Island Plantation Timbers Limited, together with its subsidiaries, engages in the forestry management activities in Australia. The company is also involved in the management of hardwood and softwood, and timber plantations, as well as milling operation activities. It owns approximately 25,000 hectares of Kangaroo Island land. The company was formerly known as RuralAus Investments Limited and changed its name to Kangaroo Island Plantation Timbers Limited in July 2013. Kangaroo Island Plantation Timbers Limited was incorporated in 2000 and is headquartered in Adelaide, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "SA",
        "city": "Adelaide",
        "zipcode": "5000",
        "website": "http://www.kipt.com.au",
        "market_cap": "Small Cap"
    },
    "LF9.F": {
        "short_name": "PT SLJ GLOBAL  RP 1000",
        "long_name": "PT SLJ Global Tbk",
        "summary": "PT SLJ Global Tbk, together with its subsidiaries, engages in the timber manufacturing, power, and logging businesses in the United States, Indonesia, East Asia, Europe, Australia, and Southeast Asia. It operates through Timber manufacturing, and power plant and logging segments. It manages six natural forest concessions of 770,455 hectares. The company also engages in the industrial plywood and medium density fibre board, as well as mining businesses. In addition, it operates a power plant with a total capacity of 22.5 megawatts. The company was formerly known as PT Sumalindo Lestari Jaya Tbk and changed its name to PT SLJ Global Tbk in December 2012. PT SLJ Global Tbk was founded in 1980 and is headquartered in South Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12950",
        "website": "http://www.sljglobal.com",
        "market_cap": "Small Cap"
    },
    "LF9.MU": {
        "short_name": "PT SLJ GLOBAL  RP 1000",
        "long_name": "PT SLJ Global Tbk",
        "summary": "PT SLJ Global Tbk, together with its subsidiaries, engages in the timber manufacturing, power, and logging businesses in the United States, Indonesia, East Asia, Europe, Australia, and Southeast Asia. It operates through Timber manufacturing, and power plant and logging segments. It manages six natural forest concessions of 770,455 hectares. The company also engages in the industrial plywood and medium density fibre board, as well as mining businesses. In addition, it operates a power plant with a total capacity of 22.5 megawatts. The company was formerly known as PT Sumalindo Lestari Jaya Tbk and changed its name to PT SLJ Global Tbk in December 2012. PT SLJ Global Tbk was founded in 1980 and is headquartered in South Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12950",
        "website": "http://www.sljglobal.com",
        "market_cap": "Small Cap"
    },
    "MANGTIMBER.NS": {
        "short_name": "MANGALAM TIMBER",
        "long_name": "Mangalam Timber Products Limited",
        "summary": "Mangalam Timber Products Limited engages in the manufacture and sale of medium density fiberboards (MDF) in India. The company offers plain interior and exterior, as well as pre-laminated interior and exterior grade MDFs; and high density fiber boards. Its products are used in computer tables and workstations, TV tables, audio cabinets, beds and sofas, shop counters and shelves, wardrobes and cupboards, kitchen cabinets and suites, decorative doors and panels, sculptures and moldings, tables and desktops, packing boxes, toys and slates, photo laminations, and whiteboards. The company markets its products primarily under Duratuff brand. Mangalam Timber Products Limited was incorporated in 1982 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700001",
        "website": "http://www.mangalamtimber.com",
        "market_cap": "Small Cap"
    },
    "MASISA.SN": {
        "short_name": "MASISA S.A.",
        "long_name": "Masisa S.A.",
        "summary": "Masisa S.A. manufactures and sells wooden boards for furniture solutions and interior architecture in Latin America. The company offers medium density particleboards (MDP); medium density fiberboards (MDF); and melamine and painted boards. It also provides ceiling and wall coatings, as well as flooring solutions. Masisa S.A. also exports its products. The company was formerly known as Terranova SA and changed its name to Masisa S.A. in 2005. Masisa S.A. was founded in 1960 and is based in Santiago, Chile.",
        "currency": "CLP",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "Chile",
        "state": null,
        "city": "Santiago",
        "zipcode": null,
        "website": "http://www.masisa.com",
        "market_cap": "Small Cap"
    },
    "MI6.F": {
        "short_name": "MIDWAY LTD",
        "long_name": "Midway Limited",
        "summary": "Midway Limited, together with its subsidiaries, processes, sells, markets, and exports woodfibre to the pulp and paper industries in Australia, Japan, China, and South East Asia. It operates through Wood Processing, Forestry Logistics, and Plantation Management segments. The company offers hardwood and softwood woodchips, as well as biomass woodchips and sawdust. It also provides planation management services; and support services to third parties engaged in growing woodfibre, including harvest, infield chipping, and haulage. In addition, the company markets third party wood fiber. The company was founded in 1980 and is headquartered in North Geelong, Australia.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "VIC",
        "city": "North Geelong",
        "zipcode": "3215",
        "website": "http://www.midwaylimited.com.au",
        "market_cap": "Small Cap"
    },
    "MJDA.F": {
        "short_name": null,
        "long_name": "M-Resources Group Limited",
        "summary": "M-Resources Group Limited, an investment holding company, primarily engages in forestry and agricultural, financial services, cultural, and logistics businesses in the People's Republic of China and Hong Kong. It is involved in timber logging, as well as the plantation and sale of wood and agricultural products. The company also plants and cultivates rubber trees for latex production; and distributes agricultural products. In addition, it provides securities brokerage and trading services; underwriting and placing services; asset management services; and loan financing services. Further, the company develops and upgrades Chinese cultural related online application. It owns three forests measuring 31,000 hectares in Kratie Province, the Kingdom of Cambodia. The company was formerly known as IR Resources Limited and changed its name to M-Resources Group Limited in April 2021. M-Resources Group Limited is based in Lai Chi Kok, Hong Kong.",
        "currency": null,
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Lai Chi Kok",
        "zipcode": null,
        "website": "http://www.m-resources.com.hk",
        "market_cap": null
    },
    "MSPA3.SA": {
        "short_name": "MELHOR SP   ON",
        "long_name": "Companhia Melhoramentos de São Paulo",
        "summary": "Companhia Melhoramentos de SÃ£o Paulo primarily engages in publishing business in Brazil. It offers children's literature, such as youth and school books; and customized books for companies. The company also engages in developing and managing forests; and conducting reforestation activities of pines and eucalyptus. In addition, it is involved in the production of thermo ground wood, bleached thermo ground wood, and neolux fibers used in the production of paperboard, tissue and special papers. The company is also involved in real estate development business. The company was formerly known as Companhia Melhoramentos de SÃ£o Paulo Ind. de Papel and changed its name to Companhia Melhoramentos de SÃ£o Paulo in August 1994. Companhia Melhoramentos de SÃ£o Paulo was founded in 1890 and is headquartered in SÃ£o Paulo, Brazil.",
        "currency": "BRL",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "state": "SP",
        "city": "SÃ£o Paulo",
        "zipcode": "05051-000",
        "website": "http://www.melhoramentos.com.br",
        "market_cap": "Small Cap"
    },
    "MWY.AX": {
        "short_name": "MIDWAY FPO",
        "long_name": "Midway Limited",
        "summary": "Midway Limited, together with its subsidiaries, processes, sells, markets, and exports woodfibre to the pulp and paper industries in Australia, Japan, China, and South East Asia. It operates through Wood Processing, Forestry Logistics, and Plantation Management segments. The company offers hardwood and softwood woodchips, as well as biomass woodchips and sawdust. It also provides planation management services; and support services to third parties engaged in growing woodfibre, including harvest, infield chipping, and haulage. In addition, the company markets third party wood fiber. The company was founded in 1980 and is headquartered in North Geelong, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "North Geelong",
        "zipcode": "3215",
        "website": "http://www.midwaylimited.com.au",
        "market_cap": "Small Cap"
    },
    "NKC.F": {
        "short_name": "CANFOR CORP.",
        "long_name": "Canfor Corporation",
        "summary": "Canfor Corporation operates as an integrated forest products company in Canada, Asia, the United States, Europe, and internationally. It operates through Lumber, and Pulp and Paper segments. The company manufactures and sells finger-jointed lumber, higher-grade MSR lumber, premium one-inch boards, engineered wood products, wood chips, wood pellets, logs, strength-rated trusses, beams, and tongue-and-groove timber, as well as generates green energy. It also produces and sells pulp and paper products, including northern bleached softwood kraft pulp, bleached and unbleached kraft paper, and bleached chemi-thermo mechanical pulp; and purchases and sells residual fiber products. Canfor Corporation was incorporated in 1966 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6P 6G2",
        "website": "http://www.canfor.com",
        "market_cap": "Mid Cap"
    },
    "NWF.F": {
        "short_name": "WESTERN FOREST PRODUCTS",
        "long_name": "Western Forest Products Inc.",
        "summary": "Western Forest Products Inc. operates as an integrated softwood forest products company. It is involved in the timber harvesting, sawmilling logs into specialty lumber, value-added lumber remanufacturing, and lumber purchasing and wholesaling. The company offers various products for outdoor living space, such as structures, decking, landscaping, and fencing; home components, including appearance and structural timbers, Japanese housing, and framing, as well as siding, paneling, trim, and soffits; and furniture, moldings, and decorative purpose, as well as doors, windows, and stair components. It also provides its products for cross arms and transmission arms, mat stock, bridges, docks and railway ties, and packaging and crating; and architectural fixtures, lam stock, and timbers. The company sells its products in Canada, the United States, China, Japan, Europe, and internationally. Western Forest Products Inc. was incorporated in 2004 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 3P3",
        "website": "http://www.westernforest.com",
        "market_cap": "Small Cap"
    },
    "NWF.SG": {
        "short_name": "Western Forest Products Inc. Re",
        "long_name": "Western Forest Products Inc.",
        "summary": "Western Forest Products Inc. operates as an integrated softwood forest products company. It is involved in the timber harvesting, sawmilling logs into specialty lumber, value-added lumber remanufacturing, and lumber purchasing and wholesaling. The company offers various products for outdoor living space, such as structures, decking, landscaping, and fencing; home components, including appearance and structural timbers, Japanese housing, and framing, as well as siding, paneling, trim, and soffits; and furniture, moldings, and decorative purpose, as well as doors, windows, and stair components. It also provides its products for cross arms and transmission arms, mat stock, bridges, docks and railway ties, and packaging and crating; and architectural fixtures, lam stock, and timbers. The company sells its products in Canada, the United States, China, Japan, Europe, and internationally. Western Forest Products Inc. was incorporated in 2004 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 3P3",
        "website": "http://www.westernforest.com",
        "market_cap": "Small Cap"
    },
    "PKNOF": {
        "short_name": "PROTEAK UNO SAB DE CV",
        "long_name": "Proteak Uno, S.A.B. de C.V.",
        "summary": "Proteak Uno, S.A.B. de C.V. manufactures and sells teak wood products primarily in Mexico. It operates through three segments: Teak Production and Marketing, Eucalyptus Production and Marketing, and Medium Density Fiberboard Production. The company offers teak logs, teak finished products, and wood boards. It owns and operates teak plantations covering an area of 225,000 hectares in Latin America and Central America. The company's products are used in furniture, home decoration, and flooring, as well as veneering. It also exports its products primarily to Asia. Proteak Uno, S.A.B. de C.V. was founded in 2000 and is based in Mexico City, Mexico.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Mexico",
        "state": "DF",
        "city": "Mexico City",
        "zipcode": "11000",
        "website": "http://www.proteak.com",
        "market_cap": "Small Cap"
    },
    "PPY.AX": {
        "short_name": "PAPYRUS FPO",
        "long_name": "Papyrus Australia Limited",
        "summary": "Papyrus Australia Limited develops a technology that converts the waste trunk of the banana palm into forest wood products. Its products include panels, hardboards, and veneers for use in the paper, packaging, furniture, building, construction, and other industries. The company was founded in 1995 and is headquartered in Adelaide, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "SA",
        "city": "Adelaide",
        "zipcode": "5031",
        "website": "http://www.papyrusaustralia.com.au",
        "market_cap": "Small Cap"
    },
    "RUBNF": {
        "short_name": "ARBORGEN HOLDINGS LIMITED",
        "long_name": "ArborGen Holdings Limited",
        "summary": "ArborGen Holdings Limited engages in the forestry genetics business. It produces and sells tree seedlings with a focus on pine, radiate, and eucalyptus species. The company provides its tree seedlings under the ArborGen brand name to forest land owners and managers primarily in the United States, Brazil, and Australasia. The company was formerly known as Rubicon Limited and changed its name to ArborGen Holdings Limited in September 2019. ArborGen Holdings Limited is based in Auckland, New Zealand.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "10",
        "website": "http://www.rubicon-nz.com",
        "market_cap": "Small Cap"
    },
    "S4LB.F": {
        "short_name": "SONAE INDUSTRIA NAM. O.N.",
        "long_name": "Sonae Indústria, S.G.P.S., S.A.",
        "summary": "Sonae IndÃºstria, S.G.P.S., S.A., together with its subsidiaries, produces and sells wood based panels and derivative products in Europe and internationally. It offers raw and technical products, including particleboards, medium density fiberboards, and oriented strand boards; value added products, such as melamine faced boards, accoustic panels, and others; laminates and components; and decorative products. The company also provides chemical products. It serves furniture, construction, and interior design industries. The company was formerly known as Sonae 3P Â\u0096 Panels, Pulp and Paper, SGPS, SA and changed its name to Sonae IndÃºstria, S.G.P.S., S.A. in December 2005. Sonae IndÃºstria, S.G.P.S., S.A. was founded in 1959 and is headquartered in Maia, Portugal.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Portugal",
        "state": null,
        "city": "Maia",
        "zipcode": "4470-177",
        "website": "http://www.sonaeindustria.com",
        "market_cap": "Small Cap"
    },
    "SCA-A.ST": {
        "short_name": "Svenska Cellulosa AB SCA ser. A",
        "long_name": "Svenska Cellulosa Aktiebolaget SCA (publ)",
        "summary": "Svenska Cellulosa Aktiebolaget SCA (publ), a forest products company, develops, produces, and sells forest, wood, pulp, and containerboard products worldwide. The company offers various wood products, industrial components, standard wood products, and raw materials, as well as logistic, warehouse, and IT solutions for the wood industry. It also provides decking, carcassing, softwood PSE, door lining and casing, softwood molding, composite decking, sheet material, and MDF molding wood products for use in homes. In addition, the company offers pulp products under the Pure, Star, and Cirrus names; coated and uncoated papers; and Kraftliner products for consumer durables, electronics, hazardous goods, industrial products, fruit and vegetables, frozen foods, etc. Further, it provides forwarding services for various transport modes, such as truck, rail, and barge, as well as marine and road and rail transport; and liquid biofuels, solid biofuels, pellets, stall pellets, and wind energy. Additionally, the company engages in the distribution and wholesale of wood products; and production of Kraft and chemical thermomechanical pulps, and containerboards. Svenska Cellulosa Aktiebolaget SCA (publ) was founded in 1929 and is headquartered in Sundsvall, Sweden.",
        "currency": "SEK",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "state": null,
        "city": "Sundsvall",
        "zipcode": "851 88",
        "website": "http://www.sca.com",
        "market_cap": "Large Cap"
    },
    "SCA-B.ST": {
        "short_name": "Svenska Cellulosa AB SCA ser. B",
        "long_name": "Svenska Cellulosa Aktiebolaget SCA (publ)",
        "summary": "Svenska Cellulosa Aktiebolaget SCA (publ), a forest products company, develops, produces, and sells forest, wood, pulp, and containerboard products worldwide. The company offers various wood products, industrial components, standard wood products, and raw materials, as well as logistic, warehouse, and IT solutions for the wood industry. It also provides decking, carcassing, softwood PSE, door lining and casing, softwood molding, composite decking, sheet material, and MDF molding wood products for use in homes. In addition, the company offers pulp products under the Pure, Star, and Cirrus names; coated and uncoated papers; and Kraftliner products for consumer durables, electronics, hazardous goods, industrial products, fruit and vegetables, frozen foods, etc. Further, it provides forwarding services for various transport modes, such as truck, rail, and barge, as well as marine and road and rail transport; and liquid biofuels, solid biofuels, pellets, stall pellets, and wind energy. Additionally, the company engages in the distribution and wholesale of wood products; and production of Kraft and chemical thermomechanical pulps, and containerboards. Svenska Cellulosa Aktiebolaget SCA (publ) was founded in 1929 and is headquartered in Sundsvall, Sweden.",
        "currency": "SEK",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "state": null,
        "city": "Sundsvall",
        "zipcode": "851 88",
        "website": "http://www.sca.com",
        "market_cap": "Large Cap"
    },
    "SCA.F": {
        "short_name": "SVENSKA CELL.B FRIA  SK10",
        "long_name": "Svenska Cellulosa Aktiebolaget SCA (publ)",
        "summary": "Svenska Cellulosa Aktiebolaget SCA (publ), a forest products company, develops, produces, and sells forest, wood, pulp, and containerboard products worldwide. The company offers various wood products, industrial components, standard wood products, and raw materials, as well as logistic, warehouse, and IT solutions for the wood industry. It also provides decking, carcassing, softwood PSE, door lining and casing, softwood molding, composite decking, sheet material, and MDF molding wood products for use in homes. In addition, the company offers pulp products under the Pure, Star, and Cirrus names; coated and uncoated papers; and Kraftliner products for consumer durables, electronics, hazardous goods, industrial products, fruit and vegetables, frozen foods, etc. Further, it provides forwarding services for various transport modes, such as truck, rail, and barge, as well as marine and road and rail transport; and liquid biofuels, solid biofuels, pellets, stall pellets, and wind energy. Additionally, the company engages in the distribution and wholesale of wood products; and production of Kraft and chemical thermomechanical pulps, and containerboards. Svenska Cellulosa Aktiebolaget SCA (publ) was founded in 1929 and is headquartered in Sundsvall, Sweden.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Sweden",
        "state": null,
        "city": "Sundsvall",
        "zipcode": "851 88",
        "website": "http://www.sca.com",
        "market_cap": "Large Cap"
    },
    "SCA1.F": {
        "short_name": "SVENSKA CELL.A FR.SK 3,33",
        "long_name": "Svenska Cellulosa Aktiebolaget SCA (publ)",
        "summary": "Svenska Cellulosa Aktiebolaget SCA (publ), a forest products company, develops, produces, and sells forest, wood, pulp, and containerboard products worldwide. The company offers various wood products, industrial components, standard wood products, and raw materials, as well as logistic, warehouse, and IT solutions for the wood industry. It also provides decking, carcassing, softwood PSE, door lining and casing, softwood molding, composite decking, sheet material, and MDF molding wood products for use in homes. In addition, the company offers pulp products under the Pure, Star, and Cirrus names; coated and uncoated papers; and Kraftliner products for consumer durables, electronics, hazardous goods, industrial products, fruit and vegetables, frozen foods, etc. Further, it provides forwarding services for various transport modes, such as truck, rail, and barge, as well as marine and road and rail transport; and liquid biofuels, solid biofuels, pellets, stall pellets, and wind energy. Additionally, the company engages in the distribution and wholesale of wood products; and production of Kraft and chemical thermomechanical pulps, and containerboards. Svenska Cellulosa Aktiebolaget SCA (publ) was founded in 1929 and is headquartered in Sundsvall, Sweden.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Sweden",
        "state": null,
        "city": "Sundsvall",
        "zipcode": "851 88",
        "website": "http://www.sca.com",
        "market_cap": "Large Cap"
    },
    "SGTM": {
        "short_name": "SUSTAINABLE GREEN TEAM LTD",
        "long_name": "Sustainable Green Team, Ltd.",
        "summary": "Sustainable Green Team, Ltd., through its subsidiaries, provides storm/disaster recovery services. It offers tree, debris hauling and removal, and biomass recycling services. The company also manufactures, packages, and sells mulch to landscapers, installers, and garden centers. It serves governmental, residential, and commercial customers. The company was formerly known as National Storm Recovery Inc. and changed its name to Sustainable Green Team, Ltd. in July 2020. Sustainable Green Team, Ltd. is based in Apopka, Florida.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Apopka",
        "zipcode": "32703",
        "website": "http://www.thesustainablegreenteam.com",
        "market_cap": "Small Cap"
    },
    "SIG.CO": {
        "short_name": "Scandinavian Investment Group A",
        "long_name": "Scandinavian Investment Group A/S",
        "summary": "Scandinavian Investment Group A/S invests in real estate properties in Denmark. It also invests in and operates portfolio of companies in Scandinavia. The company was founded in 1908 and is based in Herlev, Denmark.",
        "currency": "DKK",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "CPH",
        "market": "dk_market",
        "country": "Denmark",
        "state": null,
        "city": "Herlev",
        "zipcode": "2730",
        "website": "http://www.sca-inv-group.dk",
        "market_cap": "Small Cap"
    },
    "SINI.JK": {
        "short_name": "Singaraja Putra Tbk.",
        "long_name": "PT Singaraja Putra Tbk",
        "summary": "PT Singaraja Putra Tbk engages in the wood and accommodation services businesses in Indonesia, the Netherlands, France, Belgium, and the United States. It is also involved in the trading business. The company was founded in 2005 and is based in Bekasi, Indonesia.",
        "currency": "IDR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Bekasi",
        "zipcode": "17550",
        "website": "http://www.singarajaputra.com",
        "market_cap": "Small Cap"
    },
    "SJ.TO": {
        "short_name": "STELLA JONES INC",
        "long_name": "Stella-Jones Inc.",
        "summary": "Stella-Jones Inc. produces and markets pressure-treated wood products in Canada and the United States. It offers railway ties and timbers for railroad operators; and utility poles for electrical utilities and telecommunication companies. The company also provides residential lumber and accessories to retailers for outdoor applications; industrial products, including pilings, wharf and bridge timbers, crane mats, railway crossings, and laminated poles; construction timbers; and coal tar-based products. The company was incorporation in 1992 and is based in Saint-Laurent, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Saint-Laurent",
        "zipcode": "H4R 2J8",
        "website": "http://www.stella-jones.com",
        "market_cap": "Mid Cap"
    },
    "SKN-R.BK": {
        "short_name": "S.KIJCHAI ENTERPRISE PUBLIC COM",
        "long_name": "S.Kijchai Enterprise Public Company Limited",
        "summary": "S.Kijchai Enterprise Public Company Limited manufactures and distributes wood substitute products with medium density fiber boards in Thailand. The company's products include furniture, flooring, and interior products, as well as doors. It also offers glue, chemical, rubber, sawmill, and plywood products, as well as fuel briquettes. The company was founded in 2010 and is headquartered in Rayong, Thailand. S.Kijchai Enterprise Public Company Limited is a subsidiary of S.Kijchai Capital Co.,Ltd.",
        "currency": "THB",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Rayong",
        "zipcode": "21110",
        "website": "http://www.skn.co.th",
        "market_cap": "Small Cap"
    },
    "SKN.BK": {
        "short_name": "S.KIJCHAI ENTERPRISE PUBLIC COM",
        "long_name": "S.Kijchai Enterprise Public Company Limited",
        "summary": "S.Kijchai Enterprise Public Company Limited manufactures and distributes wood substitute products with medium density fiber boards in Thailand. The company's products include furniture, flooring, and interior products, as well as doors. It also offers glue, chemical, rubber, sawmill, and plywood products, as well as fuel briquettes. The company was founded in 2010 and is headquartered in Rayong, Thailand. S.Kijchai Enterprise Public Company Limited is a subsidiary of S.Kijchai Capital Co.,Ltd.",
        "currency": "THB",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Rayong",
        "zipcode": "21110",
        "website": "http://www.skn.co.th",
        "market_cap": "Small Cap"
    },
    "SMA1R.RG": {
        "short_name": "PATA Saldus",
        "long_name": "AS PATA Saldus",
        "summary": "AS PATA Saldus produces and sells forestry products in Latvia and Russia. The company operates through Logging, Timber Processing, Transport, and Other segments. It offers round and sawn timber; loggings; and timber and wood transportation services. The company is also involved in the production of board lumber; and wood working and real estate activities. In addition, it offers commercial timber preparation and related services, as well as engages in other sports activities. The company was formerly known as Saldus mezrupnieciba and changed its name to AS PATA Saldus in October 2015. The company was incorporated in 1991 and is based in Saldus, Latvia. AS PATA Saldus is a subsidiary of SIA Â\u0091PATA'.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "RIS",
        "market": "rg_market",
        "country": "Latvia",
        "state": null,
        "city": "Saldus",
        "zipcode": "3801",
        "website": "http://patasaldus.lv",
        "market_cap": "Small Cap"
    },
    "SONI.LS": {
        "short_name": "SONAE IND.SGPS",
        "long_name": "Sonae Indústria, S.G.P.S., S.A.",
        "summary": "Sonae IndÃºstria, S.G.P.S., S.A., together with its subsidiaries, produces and sells wood based panels and derivative products in Europe and internationally. It offers raw and technical products, including particleboards, medium density fiberboards, and oriented strand boards; value added products, such as melamine faced boards, accoustic panels, and others; laminates and components; and decorative products. The company also provides chemical products. It serves furniture, construction, and interior design industries. The company was formerly known as Sonae 3P Â\u0096 Panels, Pulp and Paper, SGPS, SA and changed its name to Sonae IndÃºstria, S.G.P.S., S.A. in December 2005. Sonae IndÃºstria, S.G.P.S., S.A. was founded in 1959 and is headquartered in Maia, Portugal.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "LIS",
        "market": "pt_market",
        "country": "Portugal",
        "state": null,
        "city": "Maia",
        "zipcode": "4470-177",
        "website": "http://www.sonaeindustria.com",
        "market_cap": "Small Cap"
    },
    "ST5.DE": {
        "short_name": "STEICO SE",
        "long_name": "STEICO SE",
        "summary": "STEICO SE develops, produces, and markets ecological construction products made of renewable raw materials worldwide. The company offers flexible and stable wood fiber insulation panels, composite thermal insulation systems, and insulation panels, as well as cavity wall insulation made of wood fibers and cellulose. Its wood fiber insulation products include expansion joint fillers, wood fiber insulation wedges for window sills, flexible wood thermal insulation products, floor insulation systems, hardboards for general purposes, multi-purpose rigid insulation boards and bituminous rigid insulation boards, insulation boards for renovations, insulation products for attic floors, and sarking and sheathing boards, as well as underlays for parquet and laminate flooring, and modern vinyl and design floors. The company also provides construction products, such as I-joists and laminated veneer lumber products; and sealing systems, such as tapes, airtight membranes, sarking membranes, roofing underlayment products, vapour barriers, ETICS joint adhesives, primers, adhesive sealants, and vapour control layers; and air injected insulation products. In addition, it is involved in the timber wholesale business; and provision of seminar services to train craftsmen, architects, and trade representatives, as well as people building their own homes. The company was founded in 1986 and is based in Feldkirchen, Germany. STEICO SE is a subsidiary of Schramek GmbH.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "GER",
        "market": "de_market",
        "country": "Germany",
        "state": null,
        "city": "Feldkirchen",
        "zipcode": "85622",
        "website": "http://www.steico.com",
        "market_cap": "Small Cap"
    },
    "ST5.F": {
        "short_name": "STEICO SE",
        "long_name": "STEICO SE",
        "summary": "STEICO SE develops, produces, and markets ecological construction products made of renewable raw materials worldwide. The company offers flexible and stable wood fiber insulation panels, composite thermal insulation systems, and insulation panels, as well as cavity wall insulation made of wood fibers and cellulose. Its wood fiber insulation products include expansion joint fillers, wood fiber insulation wedges for window sills, flexible wood thermal insulation products, floor insulation systems, hardboards for general purposes, multi-purpose rigid insulation boards and bituminous rigid insulation boards, insulation boards for renovations, insulation products for attic floors, and sarking and sheathing boards, as well as underlays for parquet and laminate flooring, and modern vinyl and design floors. The company also provides construction products, such as I-joists and laminated veneer lumber products; and sealing systems, such as tapes, airtight membranes, sarking membranes, roofing underlayment products, vapour barriers, ETICS joint adhesives, primers, adhesive sealants, and vapour control layers; and air injected insulation products. In addition, it is involved in the timber wholesale business; and provision of seminar services to train craftsmen, architects, and trade representatives, as well as people building their own homes. The company was founded in 1986 and is based in Feldkirchen, Germany. STEICO SE is a subsidiary of Schramek GmbH.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Germany",
        "state": null,
        "city": "Feldkirchen",
        "zipcode": "85622",
        "website": "http://www.steico.com",
        "market_cap": "Small Cap"
    },
    "SULI.JK": {
        "short_name": "SLJ Global Tbk.",
        "long_name": "PT SLJ Global Tbk",
        "summary": "PT SLJ Global Tbk, together with its subsidiaries, engages in the timber manufacturing, power, and logging businesses in the United States, Indonesia, East Asia, Europe, Australia, and Southeast Asia. It operates through Timber manufacturing, and power plant and logging segments. It manages six natural forest concessions of 770,455 hectares. The company also engages in the industrial plywood and medium density fibre board, as well as mining businesses. In addition, it operates a power plant with a total capacity of 22.5 megawatts. The company was formerly known as PT Sumalindo Lestari Jaya Tbk and changed its name to PT SLJ Global Tbk in December 2012. PT SLJ Global Tbk was founded in 1980 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12950",
        "website": "http://www.sljglobal.com",
        "market_cap": "Small Cap"
    },
    "SUMAS.IS": {
        "short_name": "SUMAS SUNI TAHTA",
        "long_name": "Sumas Suni Tahta ve Mobilya Sanayi A.S.",
        "summary": "Sumas Suni Tahta ve Mobilya Sanayi A.S. produces and sells chipboards in Turkey. The company offers OSB resistant sheets, chipboards, and fire resistant boards. Its products are used in various applications, including roof covering, shingle plate, floor covering, and combined and single applications; vehicle body manufacturing; interior decoration and packaging applications; in store, shop construction and decoration, and Baraka and prefabricated buildings interior parts; construction of warehouses, stages, gyms, and schools; construction of moisture resistant, flat, and insulated surfaces; carrier floors, walls, and partition structures; and wall coverings. Sumas Suni Tahta ve Mobilya Sanayi A.S. was founded in 1978 and is based in Balikesir, Turkey.",
        "currency": "TRY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Balikesir",
        "zipcode": null,
        "website": "http://www.sumas.com.tr/v2/",
        "market_cap": "Small Cap"
    },
    "SVCBF": {
        "short_name": "SVENSKA CELLULOSA AB-SCA",
        "long_name": "Svenska Cellulosa Aktiebolaget SCA (publ)",
        "summary": "Svenska Cellulosa Aktiebolaget SCA (publ), a forest products company, develops, produces, and sells forest, wood, pulp, and containerboard products worldwide. The company offers various wood products, industrial components, standard wood products, and raw materials, as well as logistic, warehouse, and IT solutions for the wood industry. It also provides decking, carcassing, softwood PSE, door lining and casing, softwood molding, composite decking, sheet material, and MDF molding wood products for use in homes. In addition, the company offers pulp products under the Pure, Star, and Cirrus names; coated and uncoated papers; and Kraftliner products for consumer durables, electronics, hazardous goods, industrial products, fruit and vegetables, frozen foods, etc. Further, it provides forwarding services for various transport modes, such as truck, rail, and barge, as well as marine and road and rail transport; and liquid biofuels, solid biofuels, pellets, stall pellets, and wind energy. Additionally, the company engages in the distribution and wholesale of wood products; and production of Kraft and chemical thermomechanical pulps, and containerboards. Svenska Cellulosa Aktiebolaget SCA (publ) was founded in 1929 and is headquartered in Sundsvall, Sweden.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Sweden",
        "state": null,
        "city": "Sundsvall",
        "zipcode": "851 88",
        "website": "http://www.sca.com",
        "market_cap": "Large Cap"
    },
    "TCOR": {
        "short_name": "TREECON RESOURCES INC",
        "long_name": "TreeCon Resources, Inc.",
        "summary": "TreeCon Resources, Inc., through its subsidiaries, distributes, leases, and finances industrial and logging equipment in the United States. It is also involved in sawmill operations; and producing water-based fluids for the oil and gas industry. The company was formerly known as Overhill Corporation. TreeCon Resources, Inc. was incorporated in 1963 and is based in Lufkin, Texas.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Lufkin",
        "zipcode": "75901",
        "website": "http://treeconresources.com",
        "market_cap": "Small Cap"
    },
    "TEAKCPO.MX": {
        "short_name": "PROTEAK UNO SAB DE CV",
        "long_name": "Proteak Uno, S.A.B. de C.V.",
        "summary": "Proteak Uno, S.A.B. de C.V. manufactures and sells teak wood products primarily in Mexico. It operates through three segments: Teak Production and Marketing, Eucalyptus Production and Marketing, and Medium Density Fiberboard Production. The company offers teak logs, teak finished products, and wood boards. It owns and operates teak plantations covering an area of 225,000 hectares in Latin America and Central America. The company's products are used in furniture, home decoration, and flooring, as well as veneering. It also exports its products primarily to Asia. Proteak Uno, S.A.B. de C.V. was founded in 2000 and is based in Mexico City, Mexico.",
        "currency": "MXN",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Mexico",
        "state": "DF",
        "city": "Mexico City",
        "zipcode": "11000",
        "website": "http://www.proteak.com",
        "market_cap": "Small Cap"
    },
    "TIRT.JK": {
        "short_name": "Tirta Mahakam Resources Tbk",
        "long_name": "PT Tirta Mahakam Resources Tbk",
        "summary": "PT Tirta Mahakam Resources Tbk manufactures and sells plywood and related wood products in Indonesia. The company offers general and polyester plywood, blockboard polyester, and floorbase products, as well as structured panels and blockboards. It also exports its products to the United States, Japan, and Europe. The company was formerly known as PT Tirta Mahakam Plywood Industry. The company was founded in 1981 and is headquartered in South Jakarta, Indonesia. PT Tirta Mahakam Resources Tbk is a subsidiary of PT Harita Jayaraya.",
        "currency": "IDR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12210",
        "website": "http://www.tirtamahakam.com",
        "market_cap": "Small Cap"
    },
    "UFPI": {
        "short_name": "UFP Industries, Inc.",
        "long_name": "UFP Industries, Inc.",
        "summary": "UFP Industries, Inc., through its subsidiaries, designs, manufactures, and markets wood and wood-alternative products in North America, Europe, Asia, and Australia. The company offers preserved and unpreserved dimensional lumber; outdoor living products, including wood and wood composite decking and related accessories, and decorative lawn and garden products; and engineered wood components, which include roof and floor trusses, wall panels, engineered floor systems, I-joists, and lumber packages. It also provides pallets, specialty crates, wooden boxes, and other containers and products that are used for packaging, shipping, and material handling applications; designs, manufactures, and installs interior fixtures that are used in retail and commercial structures; and provides lumber cut and shaped, plywood, oriented strand board, and dimensional lumber products for use in the construction of manufactured housings. In addition, the company supplies siding, electrical, and plumbing products to manufactured housing and recreational vehicle customers; and wood forms and related products to set or form concrete for various structures, such as parking garages, stadiums, and bridges. Further, it provides framing services; and specialty wood packaging, components, and packing materials for various industries. The company primarily sells its products under the roWood, Deckorators, UFP-Edge, Outdoor Essentials, Dimensions, and ProWood FR trademarks.  The company was formerly known as Universal Forest Products, Inc. and changed its name to UFP Industries, Inc. in April 2020. UFP Industries, Inc. was founded in 1955 and is headquartered in Grand Rapids, Michigan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "MI",
        "city": "Grand Rapids",
        "zipcode": "49525",
        "website": "http://www.ufpi.com",
        "market_cap": "Mid Cap"
    },
    "UNIPLY.NS": {
        "short_name": "UNIPLY INDUSTRIES",
        "long_name": "Uniply Industries Limited",
        "summary": "Uniply Industries Limited manufactures and sells plywood and related products in India and internationally. The company also offers blockboards, doors, decorative veneers, laminates, liners, flooring, adhesives, and furniture and furnishing products. It also provides architecture and design; civil development; mechanical, electrical, and plumbing; interior solutions for commercial and residential spaces; and furniture and furnishing services. The company was incorporated in 1996 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400078",
        "website": "http://www.uniply.in",
        "market_cap": "Small Cap"
    },
    "VNG-R.BK": {
        "short_name": "VANACHAI GROUP PUBLIC COMPANY L",
        "long_name": "Vanachai Group Public Company Limited",
        "summary": "Vanachai Group Public Company Limited, together with its subsidiaries, produces and distributes wood plates, MDF boards, particle boards, and doorskin and melamine on wood plates in Thailand and internationally. The company's products include laminated flooring, laminated particleboards, and laminated veneer. It also manufactures glue and melamine impregnated paper products, and resin, as well as veneer on MDF boards; and generates electricity from biomass. The company was formerly known as MDF Planner Co., Ltd. and changed its name to Vanachai Group Public Company Limited. The company was founded in 1943 and is based in Bangkok, Thailand. Vanachai Group Public Company Limited is a subsidiary of Vanachai Group of Companies Co., Ltd.",
        "currency": "THB",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10800",
        "website": "http://www.vanachai.com",
        "market_cap": "Small Cap"
    },
    "VNG.BK": {
        "short_name": "VANACHAI GROUP PUBLIC COMPANY L",
        "long_name": "Vanachai Group Public Company Limited",
        "summary": "Vanachai Group Public Company Limited, together with its subsidiaries, produces and distributes wood plates, MDF boards, particle boards, and doorskin and melamine on wood plates in Thailand and internationally. The company's products include laminated flooring, laminated particleboards, and laminated veneer. It also manufactures glue and melamine impregnated paper products, and resin, as well as veneer on MDF boards; and generates electricity from biomass. The company was formerly known as MDF Planner Co., Ltd. and changed its name to Vanachai Group Public Company Limited. The company was founded in 1943 and is based in Bangkok, Thailand. Vanachai Group Public Company Limited is a subsidiary of Vanachai Group of Companies Co., Ltd.",
        "currency": "THB",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10800",
        "website": "http://www.vanachai.com",
        "market_cap": "Small Cap"
    },
    "VRD-H.V": {
        "short_name": "VIRIDIS HOLDINGS CORP",
        "long_name": "Viridis Holdings Corp.",
        "summary": "Viridis Holdings Corp. does not have significant operations. Previously, it was engaged in the manufacture and distribution of wood pellets and shavings for residential and industrial customers. The company was formerly known as Viridis Energy Inc. and changed its name to Viridis Holdings Corp. in August 2018. Viridis Holdings Corp. was incorporated in 1998 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "VRDSF": {
        "short_name": "VIRIDIS HOLDINGS CORP",
        "long_name": "Viridis Holdings Corp.",
        "summary": "Viridis Holdings Corp. does not have significant operations. Previously, it was engaged in the manufacture and distribution of wood pellets and shavings for residential and industrial customers. The company was formerly known as Viridis Energy Inc. and changed its name to Viridis Holdings Corp. in August 2018. Viridis Holdings Corp. was incorporated in 1998 and is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "WBI.L": {
        "short_name": "WOODBOIS LIMITED ORD 1P",
        "long_name": "Woodbois Limited",
        "summary": "Woodbois Limited, together with its subsidiaries, engages in the forestry, timber projects, and timber trading businesses in Africa. The company is also involved in shared services and property holding activities; forestry activities; and the production, trading, and distribution of timber. It offers lumber used for making doors, windows and frames, decking, flooring, housing construction, railway sleepers, cabinet making, furniture, and high end interior finishes; veneers, which is used in the production of plywood for construction and boat-building industries; and plywood used for concrete shuttering. It operates approximately 100,000 hectares of natural forest concessions in Gabon and approximately 300,000 hectares of concessions in Mozambique. The company was formerly known as Obtala Limited and changed its name to Woodbois Limited in March 2019. Woodbois Limited was incorporated in 2007 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W1J 7NW",
        "website": "http://www.woodbois.com",
        "market_cap": null
    },
    "WEF.TO": {
        "short_name": "WESTERN FOREST PRODUCTS INC.",
        "long_name": "Western Forest Products Inc.",
        "summary": "Western Forest Products Inc. operates as an integrated softwood forest products company. It is involved in the timber harvesting, sawmilling logs into specialty lumber, value-added lumber remanufacturing, and lumber purchasing and wholesaling. The company offers various products for outdoor living space, such as structures, decking, landscaping, and fencing; home components, including appearance and structural timbers, Japanese housing, and framing, as well as siding, paneling, trim, and soffits; and furniture, moldings, and decorative purpose, as well as doors, windows, and stair components. It also provides its products for cross arms and transmission arms, mat stock, bridges, docks and railway ties, and packaging and crating; and architectural fixtures, lam stock, and timbers. The company sells its products in Canada, the United States, China, Japan, Europe, and internationally. Western Forest Products Inc. was incorporated in 2004 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 3P3",
        "website": "http://www.westernforest.com",
        "market_cap": "Small Cap"
    },
    "WFC.F": {
        "short_name": "WEST FRASER TIMBER CO.LTD",
        "long_name": "West Fraser Timber Co. Ltd.",
        "summary": "West Fraser Timber Co. Ltd., a diversified wood products company, produces and sells lumber, panels, and pulp and papers in western Canada and the southern United States. It offers spruce-pine-fir, Douglas Fir-Larch, Hem-Fir tree, and southern yellow pine lumber; treated wood products; and newsprint, wood chips, and other residuals and energy products, as well as bioproducts. The company also provides medium density fiberboard panels and plywood; laminated veneer lumber wood products; and northern bleached softwood Kraft pulp used to produce various paper products, including printing and writing papers, specialty grades, and various tissue products. In addition, it offers bleached chemical thermo-mechanical pulp that is used to produce coated board grades, printing and writing paper, and paper towel/napkin grades, as well as specialty papers and tissue grades. The company also exports lumber to the Far East, Asia, the Caribbean, Europe, the Middle East, and South America. West Fraser Timber Co. Ltd. was founded in 1955 and is based in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 1C1",
        "website": "http://www.westfraser.com",
        "market_cap": "Mid Cap"
    },
    "WFG": {
        "short_name": "West Fraser Timber Co. Ltd",
        "long_name": "West Fraser Timber Co. Ltd.",
        "summary": "West Fraser Timber Co. Ltd., a diversified wood products company, produces and sells lumber, panels, and pulp and papers in western Canada and the southern United States. It offers spruce-pine-fir, Douglas Fir-Larch, Hem-Fir tree, and southern yellow pine lumber; treated wood products; and newsprint, wood chips, and other residuals and energy products, as well as bioproducts. The company also provides medium density fiberboard panels and plywood; laminated veneer lumber wood products; and northern bleached softwood Kraft pulp used to produce various paper products, including printing and writing papers, specialty grades, and various tissue products. In addition, it offers bleached chemical thermo-mechanical pulp that is used to produce coated board grades, printing and writing paper, and paper towel/napkin grades, as well as specialty papers and tissue grades. The company also exports lumber to the Far East, Asia, the Caribbean, Europe, the Middle East, and South America. West Fraser Timber Co. Ltd. was founded in 1955 and is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 1C1",
        "website": "http://www.westfraser.com",
        "market_cap": "Large Cap"
    },
    "WFG.TO": {
        "short_name": "WEST FRASER TIMBER CO LTD",
        "long_name": "West Fraser Timber Co. Ltd.",
        "summary": "West Fraser Timber Co. Ltd., a diversified wood products company, produces and sells lumber, panels, and pulp and papers in western Canada and the southern United States. It offers spruce-pine-fir, Douglas Fir-Larch, Hem-Fir tree, and southern yellow pine lumber; treated wood products; and newsprint, wood chips, and other residuals and energy products, as well as bioproducts. The company also provides medium density fiberboard panels and plywood; laminated veneer lumber wood products; and northern bleached softwood Kraft pulp used to produce various paper products, including printing and writing papers, specialty grades, and various tissue products. In addition, it offers bleached chemical thermo-mechanical pulp that is used to produce coated board grades, printing and writing paper, and paper towel/napkin grades, as well as specialty papers and tissue grades. The company also exports lumber to the Far East, Asia, the Caribbean, Europe, the Middle East, and South America. West Fraser Timber Co. Ltd. was founded in 1955 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 1C1",
        "website": "http://www.westfraser.com",
        "market_cap": "Large Cap"
    },
    "WFSTF": {
        "short_name": "WESTERN FOREST PRODUCTS INC",
        "long_name": "Western Forest Products Inc.",
        "summary": "Western Forest Products Inc. operates as an integrated softwood forest products company. It is involved in the timber harvesting, sawmilling logs into specialty lumber, value-added lumber remanufacturing, and lumber purchasing and wholesaling. The company offers various products for outdoor living space, such as structures, decking, landscaping, and fencing; home components, including appearance and structural timbers, Japanese housing, and framing, as well as siding, paneling, trim, and soffits; and furniture, moldings, and decorative purpose, as well as doors, windows, and stair components. It also provides its products for cross arms and transmission arms, mat stock, bridges, docks and railway ties, and packaging and crating; and architectural fixtures, lam stock, and timbers. The company sells its products in Canada, the United States, China, Japan, Europe, and internationally. Western Forest Products Inc. was incorporated in 2004 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 3P3",
        "website": "http://www.westernforest.com",
        "market_cap": "Small Cap"
    },
    "WIPL.NS": {
        "short_name": "THE WESTERN INDIA",
        "long_name": "The Western India Plywoods Limited",
        "summary": "The Western India Plywoods Limited manufactures and sells plywood, hard boards, densified wood, and other wood products in India. The company offers fire retardant and resin surfaced shuttering plywood for applications in industrial filters, and paneling and ceiling substrates in hotels, hospitals, theatres, etc.; marine plywood for boat building, and load and stress bearing industrial applications; and boiling water resistant plywood for use in furniture, structural work in interior design, auto motive coach building, and match-plates in foundries. It also provides standard hardboards for applications in automotive interior trims, shoe heel manufacture, fiber drum lid manufacture, clock backing, photo frame backing, furniture elements, partitions, etc.; oil tempered hardboards for shoe heel manufacture, automobile interior trims, and improving resistance to weathering; and perforated hardboards. In addition, the company offers densified wood laminates for specific heavy duty applications in various industries; pre-compressed pressboards for the high voltage and extra high voltage transformer industry; molded plywood furniture; and wooden floorings. It also exports its products. The Western India Plywoods Limited was founded in 1945 and is based in Kannur, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kannur",
        "zipcode": "670010",
        "website": "http://www.wipltd.in",
        "market_cap": "Small Cap"
    },
    "YRK.JO": {
        "short_name": "York Timber Holdings Ltd",
        "long_name": "York Timber Holdings Limited",
        "summary": "York Timber Holdings Limited, an investment holding company, engages in the forestry, sawmilling, plywood, wholesale, and hospitality industry businesses. It operates through three segments: Processing Plants, Forestry and Fleet, and Wholesale. The Processing Plants segment operates four sawmills, which produces and sells a range of structural and industrial sawn timber products; and a plywood plant that offers plywood timber products. The Forestry and Fleet segment owns plantations, which grows pine and eucalyptus trees in the Mpumalanga Province; and engages in the provision of fleet solutions that owns heavy motor vehicles used to transport logs. This segment sells its products to processing segment and external customers. The Wholesale segment has eight distribution centers, which sells timber-related products from the sawmills, plywood plants, and external suppliers in Pretoria, Germiston, Polokwane, Bloemfontein, Port Elizabeth, Durban, Upington, and Cape Town. The company was formerly known as The York Timber Organisation Limited and changed its name to York Timber Holdings Limited in May 2009. York Timber Holdings Limited was founded in 1916 and is headquartered in Sabie, South Africa.",
        "currency": "ZAc",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Sabie",
        "zipcode": "1260",
        "website": "http://www.york.co.za",
        "market_cap": null
    }
}