{
    "ELPE.AT": {
        "short_name": "HELLENIC PETROLEUM S.A. (CR)",
        "long_name": "Hellenic Petroleum S.A.",
        "summary": "Hellenic Petroleum S.A., together with its subsidiaries, operates in the energy sector primarily in Greece, South Eastern Europe, and the East Mediterranean. It operates through the Refining, Marketing, Exploration and Production of Hydrocarbons, Petro-chemicals, Gas and Power, and Other segments. The company engages in the refining, supply, and trading of petroleum products; marketing of fuels; production and trading of petrochemicals/chemicals; exploration and production of oil and gas; and generation and trading of power. It is also involved in the production, distribution, and trading of renewable energy sources; provision of financing and other financial services; retail trade of liquid fuels and LPG; operation of tankers; exploration and production of hydrocarbons; trade, distribution, and storage of oil products; and construction and operation of crude oil pipelines. In addition, the company engages in the owning of vessels; production and marketing of lubricants, polypropylene, and solvents; trading of imported plastics and chemicals; production and trade of BOPP films; construction and operation of fuel storage facilities; and provision of treasury, consulting, and engineering services. It operates a network of 1,703 service stations, 15 fuel storage and distribution facilities, 24 aircraft refueling stations in the Greek airports, 2 LPG bottling plants, and 1 lubricant production and packing site in Greece. Hellenic Petroleum S.A. was founded in 1998 and is headquartered in Maroussi, Greece.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Major Integrated Oil & Gas",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Marousi"
    },
    "OGZD.BA": {
        "short_name": "GAZPROM PJSC",
        "long_name": "Public Joint Stock Company Gazprom",
        "summary": "Public Joint Stock Company Gazprom, an integrated energy company, engages in the geological exploration, production, processing, storage, transportation, and sale of gas, gas condensates, and oil in Russia and internationally. The company operates through Production of Gas, Transportation of Gas, Distribution of Gas, Gas Storage, Production of Crude Oil and Gas Condensate, Refining, and Electric and Heat Energy Generation and Sales segments. It also produces coalbed methane; and owns Unified Gas Supply System, a gas transmission system totaling approximately 175.2 kilometers that comprises 254 compressor stations with a total capacity of 46.8 megawatts in Russia. In addition, the company operates underground gas storage facilities; operates oil refining and petrochemical complexes; generates and sells electric and heat energy; produces crude oil and gas condensate; and produces other goods, as well as provides other works and rendering of other services. Further, it offers oil, gas condensate, and other hydrocarbons; and sells refined products. Public Joint Stock Company Gazprom was founded in 1993 and is headquartered in Moscow, Russia.",
        "currency": "ARS",
        "sector": "Basic Materials",
        "industry": "Major Integrated Oil & Gas",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "Russia",
        "city": "Moscow"
    },
    "REPA.DE": {
        "short_name": "REPSOL S.A. EO 1 ADR 1",
        "long_name": "Repsol, S.A.",
        "summary": "Repsol, S.A. operates as an integrated energy company worldwide. Its Exploration and Production segment engages in the exploration, development, and production of crude oil and natural gas reserves. The company's Industrial segment is involved in refining and petrochemicals; trading and transportation of crude oil and oil products; and the sale, transportation, and regasification of natural gas and liquefied natural gas (LNG). Its Commercial and Renewables segment engages in the low carbon power generation and renewable sources; sale of gas and power; mobility and sale of oil products; and liquified petroleum gas activities. The company also offers asphalt products; installs, operates, and manages service stations; provides maritime services; constructs and operates oil refineries; refines and markets hydrocarbons; provides human resource services; distributes and supplies electricity; and develops new energy source, solar, and wind projects, as well as produces and markets chemical products, lubricants, and biofuels. Further, it is involved in fuel and special products marketing, research, trading and transport, insurance and reinsurance, technology development, and financing activities; develops nanoparticles and nanofibers for material, energy, and biomedicine applications; provides blockchain technology for retail, energy, and automotive sectors; produces synthetic oil cloths; invests in liquefaction plant project; and offers water treatment technology management services. The company was formerly known as Repsol YPF, S.A. and changed its name to Repsol, S.A. in May 2012. Repsol, S.A. was founded in 1927 and is headquartered in Madrid, Spain.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Major Integrated Oil & Gas",
        "exchange": "GER",
        "market": "de_market",
        "country": "Spain",
        "city": "Madrid"
    },
    "REPSN.MX": {
        "short_name": "REPSOL SA",
        "long_name": "Repsol, S.A.",
        "summary": "Repsol, S.A. operates as an integrated energy company worldwide. Its Exploration and Production segment engages in the exploration, development, and production of crude oil and natural gas reserves. The company's Industrial segment is involved in refining and petrochemicals; trading and transportation of crude oil and oil products; and the sale, transportation, and regasification of natural gas and liquefied natural gas (LNG). Its Commercial and Renewables segment engages in the low carbon power generation and renewable sources; sale of gas and power; mobility and sale of oil products; and liquified petroleum gas activities. The company also offers asphalt products; installs, operates, and manages service stations; provides maritime services; constructs and operates oil refineries; refines and markets hydrocarbons; provides human resource services; distributes and supplies electricity; and develops new energy source, solar, and wind projects, as well as produces and markets chemical products, lubricants, and biofuels. Further, it is involved in fuel and special products marketing, research, trading and transport, insurance and reinsurance, technology development, and financing activities; develops nanoparticles and nanofibers for material, energy, and biomedicine applications; provides blockchain technology for retail, energy, and automotive sectors; produces synthetic oil cloths; invests in liquefaction plant project; and offers water treatment technology management services. The company was formerly known as Repsol YPF, S.A. and changed its name to Repsol, S.A. in May 2012. Repsol, S.A. was founded in 1927 and is headquartered in Madrid, Spain.",
        "currency": "MXN",
        "sector": "Basic Materials",
        "industry": "Major Integrated Oil & Gas",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Spain",
        "city": "Madrid"
    },
    "TKN.MX": {
        "short_name": "TEEKAY CORPORATION",
        "long_name": "Teekay Corporation",
        "summary": "Teekay Corporation operates as a marine energy transportation company. The company offers pool management, fuel services, oil and clean product STS transfers, LNG STS and terminal management, and tanker services. As of March 18, 2021, it operated 47 liquefied natural gas (LNG) carriers, 23 mid-size liquefied petroleum gas carriers, and seven multi-gas carriers. The company serves energy and utility companies, oil traders, large oil and LNG consumers, petroleum product producers, government agencies, and various other entities worldwide. Teekay Corporation was founded in 1973 and is headquartered in Hamilton, Bermuda.",
        "currency": "MXN",
        "sector": "Basic Materials",
        "industry": "Major Integrated Oil & Gas",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Bermuda",
        "city": "Hamilton"
    }
}