{"DTRO": {"short_name": "DELTRON INC", "long_name": "Deltron, Inc.", "summary": "Deltron, Inc. does not have significant operations. It intends to seek a suitable merger or acquisition partner. Previously, the company engaged in the manufacture and sale of polyurethane products and rebreather systems. Deltron, Inc. was founded in 1979 and is based in Clearwater, Florida.", "currency": "USD", "sector": "Basic Materials", "industry": "Oil & Gas Equipment & Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Clearwater"}, "MLJSA.PA": {"short_name": "JSA TECHNOLOGY", "long_name": "Jsa Technology Société anonyme", "summary": "None", "currency": "EUR", "sector": "Basic Materials", "industry": "Oil & Gas Equipment & Services", "exchange": "PAR", "market": "fr_market", "country": "France", "city": "Paris"}, "NWE.V": {"short_name": "NEW WEST ENERGY SERVICES INC", "long_name": "New West Energy Services Inc.", "summary": "New West Energy Services Inc. provides waste management and environmental services to the drilling, completions, and production sectors of the oil and gas industry in Canada. The company operates through two business segments: Vacuum and Water Truck Services, and Environmental Services. Its environmental services cover drilling waste testing, disposal, and treatment; mud system management; disposal management and coordination; pipeline crossings project management; sump suitability assessments; spill response and management; pre-disturbance environmental assessments and approvals; and drilling and completions water management, including TDL application, sourcing, monitoring, and usage tracking. The company was formerly known as Lexacal Investment Corp. and changed its name to New West Energy Services Inc. in October 2007. New West Energy Services Inc. was incorporated in 1986 and is headquartered in Calgary, Canada.", "currency": "CAD", "sector": "Basic Materials", "industry": "Oil & Gas Equipment & Services", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Calgary"}}