{
    "ELIN.AT": {
        "short_name": "ELINOIL S.A. (CR)",
        "long_name": "Elinoil Hellenic Petroleum Company S.A.",
        "summary": "Elinoil Hellenic Petroleum Company S.A. engages in the supply of liquid and solid fuels, and lubricants worldwide. The company offers fuels, including gasoline, diesel fuel, diesel crystal, and heating oil products; crystal fuels; gasoline and diesel engine lubricants; and solid fuels for road, sea, industrial, transport, construction, shipping, and yachting applications, as well as heating oil thermo crystals for home through distribution facilities. It also operates petrol stations. The company was formerly known as D. Diamantidis - Ch. Courouclis & Associates. Elinoil Hellenic Petroleum Company S.A. was founded in 1954 and is headquartered in Kifissia, Greece.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Kifissia"
    },
    "MOH.AT": {
        "short_name": "MOTOR OIL HELLAS S.A. (CR)",
        "long_name": "Motor Oil (Hellas) Corinth Refineries S.A.",
        "summary": "Motor Oil (Hellas) Corinth Refineries S.A. engages in oil refining and oil products trading in Greece and internationally. It operates through three segments: Refinery's Activities, Sales to/from Gas Stations, and Services. The company produces and sells liquid fuels, lubricants, and asphalt for transportation, industrial, and household use. It also markets and distributes a range of oil products, including gasoline, fuel oil, diesel, and lubricants through a retail network of approximately 763 stations under the SHELL name; retail service comprising 29 SHELL branded fuel sites; and operates 486 gas stations under AVIN brand name and 116 gas stations under CYCLON brand. In addition, the company engages in the trading, transportation, storage, and agency of petroleum products; collection and trading of used lubricants; research, exploration, and trading of crude oil; and marketing and distribution of natural gas, as well as operates aircraft fuel supply system and the storage facilities at the Athens International Airport at Spata of Attica. Further, it is involved in the purchase, sale, exploitation, and development of real estate properties; and provision of liquefied petroleum gas, facilities management services, and financial services, as well as systems of alternative management of lubricant wastes. The company was founded in 1970 and is headquartered in Maroussi, Greece.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Marousi"
    },
    "REVOIL.AT": {
        "short_name": "REVOIL S.A",
        "long_name": "Revoil S.A.",
        "summary": "Revoil S.A. engages in the marketing of petroleum products for use in automobiles, homes, and vessels in Greece. It offers gasoline, fuel oil, petrol, and diesel; and a range of lubricants for engines, hydraulic systems, gears, and agricultural machinery. The company also provides lamps, windscreen wipers, car deodorants, and mobile accessories; and car and moto wash, lubricant change, and other services. It trades in fuels and lubricants through a network of 528 petrol stations in Greece, as well as for heating oil retailers. The company was founded in 1982 and is headquartered in Vari, Greece.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Vari"
    }
}