{
    "DAGI.IS": {
        "short_name": "DAGI GIYIM",
        "long_name": "Dagi Giyim Sanayi ve Ticaret A.S.",
        "summary": "Dagi Giyim Sanayi ve Ticaret A.S. operates in the garment industry in Turkey and internationally. It primarily produces and sells underwear, nighties, dresses, T-shirts, trousers, capri, shorts, sweatshirts, sportswear, thermal bottom and tops, maternity nightgowns, swimsuits, socks, and beach and household products for men, women, and children. The company sells its products through online and retail stores. Dagi Giyim Sanayi ve Ticaret A.S. was founded in 1984 and is based in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": null,
        "website": "http://www.dagi.com.tr",
        "market_cap": "Nano Cap"
    },
    "DERHL.IS": {
        "short_name": "DERLUKS YATIRIM HOLDING",
        "long_name": "Derluks Yatirim Holding Anonim Sirketi",
        "summary": "Derluks Deri Sanayi ve Ticaret Anonim Sirketi engages in the manufacture, buying, sale, import, and export of leather garments, leather accessories, and use products for men, women, and children. The company markets its products in Asia, Europe, America, and the Far East. Derluks Deri Sanayi ve Ticaret Anonim Sirketi was founded in 2002 and is based in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34020",
        "website": "http://www.derluksleather.com",
        "market_cap": "Nano Cap"
    },
    "RODRG.IS": {
        "short_name": "RODRIGO TEKSTIL",
        "long_name": "Rodrigo Tekstil Sanayi ve Ticaret A.S.",
        "summary": "Rodrigo Tekstil Sanayi ve Ticaret A.S. provides apparel for men and women; footwear, and accessories for men in Turkey. Its apparel products include T-shirts, polo shirts, shirts, sweats, sweaters, knit wares, jeans trousers, trousers, tracksuits, jackets, raincoats, coats, vests, blouse, skirt, tights, dresses, shorts, bags, and track suits. The company also offers casual and sports shoes; and accessories, including boxers, wallets, belts, socks, bags, shorts, and perfumes. It also operates retail stores, as well as sells online. The company was formerly known as Rodrigo Tekstil Turizm Insaat Gida Ticaret ve Sanayi Anonim Sirketi and changed its name to Rodrigo Tekstil Sanayi ve Ticaret A.S. in July 2012. Rodrigo Tekstil Sanayi ve Ticaret A.S. was founded in 1993 and is based in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": null,
        "website": "http://www.rodrigo.com",
        "market_cap": "Nano Cap"
    }
}