{
  "ATLAS.IS": {
    "city": "Istanbul",
    "country": "Turkey",
    "currency": "TRY",
    "exchange": "IST",
    "industry": "Capital Markets",
    "long_name": "Atlas Menkul Kiymetler Yatirim Ortakligi A.S.",
    "market": "tr_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "ATLAS YAT. ORT.",
    "state": null,
    "summary": "Atlas Menkul Kiymetler Yatirim Ortakligi A.S. engages in the portfolio management activities related to securities traded on national and international exchanges. The company was founded in 1994 and is based in Istanbul, Turkey.",
    "website": "http://www.atlasyo.com.tr",
    "zipcode": null
  },
  "EUHOL.IS": {
    "city": "Istanbul",
    "country": "Turkey",
    "currency": "TRY",
    "exchange": "IST",
    "industry": "Capital Markets",
    "long_name": "Euro Yatirim Holding A.S.",
    "market": "tr_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "EURO YATIRIM HOLDING",
    "state": null,
    "summary": "Euro Yatirim Holding A.S. provides financial services. The company offers various financial services, such as trading of derivatives, stocks, and bond-bills; repo and reverse repo transactions; credit securities trading services; public offering; and investment consultancy. It also provides portfolio management services to individuals and corporates. The company was founded in 1996 and is headquartered in Istanbul, Turkey.",
    "website": "http://www.euroyatirim.com.tr",
    "zipcode": "34394"
  },
  "GEDIK.IS": {
    "city": "Istanbul",
    "country": "Turkey",
    "currency": "TRY",
    "exchange": "IST",
    "industry": "Capital Markets",
    "long_name": "Gedik Yatirim Menkul Degerler A.S.",
    "market": "tr_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "GEDIK Y. MEN. DEG.",
    "state": null,
    "summary": "Gedik Yatirim Menkul Degerler A.S. provides investment banking advisory and brokerage services to individual and institutional investors in Turkey and internationally. It provides services in private placements, initial and secondary public offerings, private-sector bond issues, and bill issuances, as well as various borrowing instruments. The company also offers brokerage services to investors in the equity market, bonds and bills market, repo/reverse repo market, derivatives market, international bonds and bills market, international depository receipt market, and leveraged purchases and sales transactions. In addition, it provides investment research and advisory, discretionary portfolio management, asset management, and derivatives market services. The company's investment and trading platforms include Gedik Online Stock Exchange, Gedik Mobile, Investment Center, Gedik private, Gedik trader, and Gedik universal. Gedik Yatirim Menkul Degerler A.S. was founded in 1991 and is based in Istanbul, Turkey. Gedik Yatirim Menkul Degerler A.S. operates as a subsidiary of Inveo Yatirim Holding A.S.",
    "website": "http://www.gedik.com",
    "zipcode": "34337"
  },
  "GLBMD.IS": {
    "city": "Istanbul",
    "country": "Turkey",
    "currency": "TRY",
    "exchange": "IST",
    "industry": "Capital Markets",
    "long_name": "Global Menkul Degerler Anonim Sirketi",
    "market": "tr_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "GLOBAL MEN. DEG.",
    "state": null,
    "summary": "Global Menkul Degerler Anonim Sirketi provides capital market brokerage services to individuals, financial institutions, and local and international investors. It operates through a network of three branches. The company was founded in 1990 and is headquartered in Istanbul, Turkey. Global Menkul Degerler Anonim Sirketi operates as a subsidiary of Global Yatirim Holding A.S.",
    "website": "http://www.global.com.tr",
    "zipcode": "34418"
  },
  "INFO.IS": {
    "city": "Istanbul",
    "country": "Turkey",
    "currency": "TRY",
    "exchange": "IST",
    "industry": "Capital Markets",
    "long_name": "Info Yatirim Menkul Degerler A.S.",
    "market": "tr_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "INFO YATIRIM",
    "state": null,
    "summary": "Info Yatirim Menkul Degerler A.S. operates in the field of capital market in Turkey. The company provides investment consultancy, portfolio management, and corporate finance services to individual and institutional investors, as well as the brokerage of capital market instruments; and brokerage services in the equity market, debt securities market, and futures and options market. It also offers stocks and VIOP, forex trading, and option transaction services. The company was founded in 1990 and is headquartered in Istanbul, Turkey.",
    "website": "http://www.infoyatirim.com",
    "zipcode": "34387"
  },
  "INVEO.IS": {
    "city": "Istanbul",
    "country": "Turkey",
    "currency": "TRY",
    "exchange": "IST",
    "industry": "Capital Markets",
    "long_name": "Inveo Yatirim Holding A.S.",
    "market": "tr_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "INVEO YATIRIM HOLDING",
    "state": null,
    "summary": "Gedik Yatirim Holding A.S. invests in companies with technical planning, programming, budgeting, projecting, and financial businesses. It also invests in securities, cash, precious metals, and commodities. The company was founded in 1998 and is headquartered in Istanbul, Turkey. Inveo Yatirim Holding A.S. was formerly a subsidiary of Gedik Yatirim Menkul Degerler A.S.",
    "website": "http://www.inveo.co",
    "zipcode": null
  },
  "ISMEN.IS": {
    "city": "Istanbul",
    "country": "Turkey",
    "currency": "TRY",
    "exchange": "IST",
    "industry": "Capital Markets",
    "long_name": "Is Yatirim Menkul Degerler Anonim Sirketi",
    "market": "tr_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "IS Y. MEN. DEG.",
    "state": null,
    "summary": "Is Yatirim Menkul Degerler Anonim Sirketi, through its subsidiaries, provides capital market solutions to individual and institutional investors in Turkey and internationally. The company offers corporate finance services, such as equity public offerings, private sector debt securities issuances, mergers and acquisitions, private sector advisory, project finance consultancy and venture capital advisory, private equity advisory, and debt and equity capital market services; investment advisory services; asset management services; and institutional sale, market making, and liquidity providing services, as well as traditional Brokerage services. It also provides fixed income securities; repo products; investment funds; foreign exchange products; warrants; and structured products, as well as services in stocks, derivatives, and international markets. The company serves customers through a network of 21 branches. The company was founded in 1996 and is headquartered in Istanbul, Turkey. Is Yatirim Menkul Degerler Anonim Sirketi operates as a subsidiary of Türkiye Is Bankasi AS.",
    "website": "http://www.isyatirim.com.tr",
    "zipcode": "34330"
  },
  "OSMEN.IS": {
    "city": "Istanbul",
    "country": "Turkey",
    "currency": "TRY",
    "exchange": "IST",
    "industry": "Capital Markets",
    "long_name": "Osmanli Yatirim Menkul Degerler A.S.",
    "market": "tr_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "OSMANLI MENKUL",
    "state": null,
    "summary": "Osmanli Yatirim Menkul Degerler A.S. provides asset management and custody services in capital markets in Turkey. The company offers investment consultancy; and operates online capital market trading platforms. Its product range includes stocks, warrants, futures and options, forex, mutual funds, pension funds, government and private sector bonds and bills, public offering of bonds, and structured derivative instruments. The company is headquartered in Istanbul, Turkey.",
    "website": "http://www.osmanlimenkul.com.tr",
    "zipcode": null
  }
}
