{
    "ARENA.IS": {
        "short_name": "ARENA BILGISAYAR",
        "long_name": "Arena Bilgisayar Sanayi ve Ticaret A.S.",
        "summary": "Arena Bilgisayar Sanayi ve Ticaret A.S. engages in the distribution of technology products in Turkey. It offers desktops, notebooks, printers, supplies, monitors, projections, memory cards, USB flash drives, SSDs, external and internal disc, DVD RWs, motherboards, graphic cards, workstations, thin client computers, wireless networks and ADSL, PC memory products, and accessories. The company also offers Bulutum.com, an end-to-end cloud services platform with pre-sales and post-sales technical support, training, and payment facilities that helps business partners to create business opportunities at software and managed services; Pencere.com, a communication and interaction portal; Paynet that provides payment, collection, and financial solutions to B2B, B2B2C, and B2C companies in various sectors, such as construction materials, marine materials, paint, health equipment, musical instruments, machinery, spare automotive parts, and others; and financial solutions. In addition, it provides Tencer-e.com, a communication and interaction portal that manages technical services and current account operations; and automation and IOT services. Further, the company is involved in the wholesale trading of mobile phones and other mobile devices; and online electronics retail and marketplace businesses. Arena Bilgisayar Sanayi ve Ticaret A.S. was founded in 1991 and is headquartered in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34077",
        "website": "http://www.arena.com.tr",
        "full_time_employees": 265
    },
    "ARMDA.IS": {
        "short_name": "ARMADA BILGISAYAR",
        "long_name": "Armada Bilgisayar Sistemleri Sanayi ve Ticaret A.S.",
        "summary": "Armada Bilgisayar Sistemleri Sanayi ve Ticaret A.S. operates as a distributor in the information technology sector in Turkey. It offers IT products and solutions to end users through business partners. The company was founded in 1989 and is based in Istanbul, Turkey. Armada Bilgisayar Sistemleri Sanayi ve Ticaret A.S. is a subsidiary of Aptec Holdings Limited.",
        "currency": "TRY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34030",
        "website": "http://www.armada.com.tr",
        "full_time_employees": 165
    },
    "DESPC.IS": {
        "short_name": "DESPEC BILGISAYAR",
        "long_name": "Despec Bilgisayar Pazarlama ve Ticaret Anonim Sirketi",
        "summary": "Despec Bilgisayar Pazarlama ve Ticaret Anonim Sirketi distributes ICT consumables in Turkey and internationally. It offers toners, ink cartridges, and tape backup and paper products; and IT accessories and mobile products. The company was founded in 1998 and is headquartered in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34485",
        "website": "http://www.despec.com.tr",
        "full_time_employees": 27
    }
}