{
    "BAKAB.IS": {
        "short_name": "BAK AMBALAJ",
        "long_name": "Bak Ambalaj Sanayi ve Ticaret A.S.",
        "summary": "Bak Ambalaj Sanayi ve Ticaret A.S. produces and sells printed, unprinted, and laminated flexible packaging products for various sectors worldwide. The company offers its packaging products for snack foods, biscuits, sugar and chocolate confectionaries, breads and fresh foods, instant foods and drinks, dried foods and pastas, coffee and tea products, chemicals and hygiene products, and other products. Bak Ambalaj Sanayi ve Ticaret A.S. was founded in 1973 and is based in Izmir, Turkey.",
        "currency": "TRY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Izmir",
        "zipcode": "35620",
        "website": "http://www.bakambalaj.com.tr",
        "market_cap": "Small Cap"
    },
    "BNTAS.IS": {
        "short_name": "BANTAS AMBALAJ",
        "long_name": "Bantas Bandirma Ambalaj Sanayi ve Ticaret A.S.",
        "summary": "Bantas Bandirma Ambalaj Sanayi ve Ticaret A.S. engages in tin packaging production activities. The company offers tin cans for olives, cheese, pickles, and olive and vegetable oils. It also serves the mineral oil, and paint industries. In addition, the company exports its products worldwide. The company was founded in 1986 and is based in Balikesir, Turkey.",
        "currency": "TRY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Balikesir",
        "zipcode": null,
        "website": "http://www.bantas.com.tr",
        "market_cap": "Small Cap"
    },
    "DURDO.IS": {
        "short_name": "DURAN DOGAN BASIM",
        "long_name": "Duran Dogan Basim ve Ambalaj Sanayi A.S.",
        "summary": "Duran Dogan Basim ve Ambalaj Sanayi A.S., together with its subsidiaries, provides packaging products in Turkey. It offers chocolate and confectionary, food, spirits, personal care and cosmetics, OTC, and nonfood packaging products; and rigid-setup boxes. The company also exports its products to the United Kingdom, Ireland, Belgium, France, the United States, and Russia. Duran Dogan Basim ve Ambalaj Sanayi A.S. was founded in 1953 and is based in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34555",
        "website": "http://www.ddpack.com.tr",
        "market_cap": "Small Cap"
    },
    "EMNIS.IS": {
        "short_name": "EMINIS AMBALAJ",
        "long_name": "Eminis Ambalaj Sanayi ve Ticaret A.S.",
        "summary": "Eminis Ambalaj Sanayi ve Ticaret A.S. manufactures and sells plastic and metal packaging solutions in Turkey and internationally. Its products are used for paints, glues, lube oils, chemicals, ice creams, yoghurts, cheese, frozen foods, honey, jams, olives, hazelnut cocoa-butter, candies, spices/powder, drinks, hair gel, and cosmetic products. The company serves for paint, chemicals, and food sectors. The company was founded in 1970 and is based in Dilovasi, Turkey.",
        "currency": "TRY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Dilovasi",
        "zipcode": "41455",
        "website": "http://www.eminisambalaj.com",
        "market_cap": "Small Cap"
    },
    "KAPLM.IS": {
        "short_name": "KAPLAMIN",
        "long_name": "Kaplamin Ambalaj Sanayi ve Ticaret A.S.",
        "summary": "Kaplamin Ambalaj Sanayi ve Ticaret A.S. produces and sells packaging materials in Turkey. It provides corrugated boards for food, durable, chemical and cleaning, automotive, heavy duty, ceramic tiles and sanitary ware, and YSM packaging applications. The company was founded in 1976 and is based in Izmir, Turkey.",
        "currency": "TRY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Izmir",
        "zipcode": "35710",
        "website": "http://www.kaplaminambalaj.com.tr",
        "market_cap": "Small Cap"
    },
    "KARTN.IS": {
        "short_name": "KARTONSAN",
        "long_name": "Kartonsan Karton Sanayi ve Ticaret A.S.",
        "summary": "Kartonsan Karton Sanayi ve Ticaret A.S. manufactures and trades in coated cardboards in Turkey. It offers normprint, exprint, and luxtriplex multi-coated cardboards from recycled paper. The company's products are used for the packaging of food, pharmaceuticals, detergents, matches, cosmetics, textiles, stationary, glassware and small appliances, book and notebook covers, and corrugated lamination. It also exports its products to approximately 20 countries, including Bulgaria, Greece, Spain, Portugal, the United Kingdom, Romania, and Egypt. The company was founded in 1967 and is headquartered in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34349",
        "website": "http://www.kartonsan.com.tr",
        "market_cap": "Mid Cap"
    },
    "OLMIP.IS": {
        "short_name": "OLMUKSAN-IP",
        "long_name": "Olmuksan International Paper Ambalaj Sanayi ve Ticaret A.S.",
        "summary": "Olmuksan International Paper Ambalaj Sanayi ve Ticaret A.S. produces and sells various corrugated boxes and other custom manufacturing goods in Turkey and internationally. It provides fruit and vegetable, transport, shelf-ready, heavy-duty, meat, poultry, seafood, and e-commerce packaging products to food, agricultural, and other industrial sectors. The company was formerly known as Olmuksa International Paper - Sabanci Ambalaj Sanayi ve Ticaret A.S. and changed its name to Olmuksan International Paper Ambalaj Sanayi ve Ticaret A.S. in March 2013. Olmuksan International Paper Ambalaj Sanayi ve Ticaret A.S. was founded in 1958 and is headquartered in Istanbul, Turkey. Olmuksan International Paper Ambalaj Sanayi ve Ticaret A.S. is a subsidiary of International Paper Company.",
        "currency": "TRY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "343941",
        "website": "http://www.olmuksan-ipaper.com",
        "market_cap": "Small Cap"
    },
    "OZRDN.IS": {
        "short_name": "OZERDEN PLASTIK",
        "long_name": "Özerden Plastik Sanayi ve Ticaret A.S.",
        "summary": "Ã\u0096zerden Plastik Sanayi ve Ticaret A.S. produces and sells packaging products. The company offers insulated packaging and construction insulation products comprising bizofol; protective packaging products, such as air bubble film and bag, bubble wrap, and air bed; and in-box packaging systems, including airsafe and Ranpak paper cushioning systems. It also provides food packaging products, which consists of chocolate pad; metal packaging products; and supplementary products, such as PE foams, air dunnage, stretch film, box tapes, aluminium and reinforced tapes, masking tapes, PE film, reinforced PE films, protective films, invoice pockets, wrapping ropes, corrugated cardboards, straps, and removal boxes. The company was founded in 1958 and is headquartered in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34485",
        "website": "http://www.ozerden.com/en/",
        "market_cap": "Small Cap"
    },
    "SEKUR.IS": {
        "short_name": "SEKURO PLASTIK",
        "long_name": "Sekuro Plastik Ambalaj Sanayi A.S.",
        "summary": "Sekuro Plastik Ambalaj Sanayi A.S. manufactures and sells plastic packaging products in Turkey and internationally. It offers PE air bubble films, such as standard bubble films, opaque protection products, and insulation products; PE shrink films; PE general packaging films; bag and sheet products; and technical films. The company was founded in 1997 and is headquartered in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34810",
        "website": "http://www.sekuro.com.tr",
        "market_cap": "Small Cap"
    },
    "TIRE.IS": {
        "short_name": "MONDI TIRE KUTSAN",
        "long_name": "Mondi Tire Kutsan Kagit ve Ambalaj Sanayi A.S.",
        "summary": "Mondi Tire Kutsan Kagit ve Ambalaj Sanayi A.S. engages in the production and sale of corrugated cardboard box paper and scrap paper in Turkey and internationally. The company was founded in 1974 and is headquartered in Istanbul, Turkey. Mondi Tire Kutsan Kagit ve Ambalaj Sanayi A.S. operates as a subsidiary of Mondi Corrugated B.V.",
        "currency": "TRY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": null,
        "website": "http://www.mondigroup.com.tr",
        "market_cap": "Small Cap"
    }
}