{
    "ARDYZ.IS": {
        "short_name": "ARD BILISIM TEKNOLOJILERI",
        "long_name": "ARD Grup Bilisim Teknolojileri Anonim Sirketi",
        "summary": "ARD Grup Bilisim Teknolojileri A.S. engages in the software, information technology, communication, and telecommunication businesses in Turkey. The company provides E-Invoice, a solution for preparation and sharing of invoices used in enterprises in a digital environment; E-Archive that allows to store, submit, and report invoices in electronic media; national law software solutions; cloud solutions; cyber security software and systems; health system solutions, such as sterilization, patient, baby, hospital textile, hospital fixtures, medical equipment, and hospital warehouse tracking systems; and SAP solutions, including SAP ERP, business analytics, mobile, business management solution, and CRM solutions. It also offers enterprise software solutions, such as corporate information and access management systems, corporate identity systems, enterprise equipment tracking systems, e-government projects, RFID-based software and integration solutions, vehicle tracking and security control systems, logistic warehouse and container tracking systems, textile tracking and process management solutions, and social media tracking systems, as well as staff, visitor, and person tracking systems. In addition, the company provides cyber security and information system solutions, which include server and data storage, information infrastructure and data security, virtualization, disaster recovery center, and gateway security solutions, as well as system integration projects, high security data bearing equipment, traceability and process management applications, and components supply of enterprise information systems. Further, it offers command center and security, and smart technology solutions. The company was founded in 2011 and is based in Ankara, Turkey. ARD Grup Bilisim Teknolojileri A.S. is a subsidiary of Ard Grup Holding Anonim Sirketi.",
        "currency": "TRY",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Ankara",
        "zipcode": "06800",
        "website": "http://www.ardbilisim.com.tr",
        "full_time_employees": 59
    },
    "SMART.IS": {
        "short_name": "SMARTIKS YAZILIM",
        "long_name": "Smartiks Yazilim A.S.",
        "summary": "Smartiks Yazilim A.S. provides business solution, software development, and consulting services in Turkey. The company's solutions include Oracle Human Resources, Oracle Siebel CRM, Oracle customer experience, corporate software development, Internet of Things, and SmartXperience solutions. It serves health, insurance, banking and finance, retail, automotive, public, and telecom sectors. The company was incorporated in 2006 and is headquartered in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34000",
        "website": "http://www.smartiks.com.tr",
        "full_time_employees": 148
    }
}