{
    "AYEN.IS": {
        "short_name": "AYEN ENERJI",
        "long_name": "Ayen Enerji A.S.",
        "summary": "Ayen Enerji A.S., together with its subsidiaries, engages in the production, distribution, and trade of electricity in Turkey and internationally. Its electricity generation include 591.944.352 kWh electricity from hydroelectric, and 256.706.740 kWh electricity wind sources. The company was incorporated in 1990 and is based in Ankara, Turkey. Ayen Enerji A.S. is a subsidiary of Aydiner Insaat AS.",
        "currency": "TRY",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Ankara",
        "zipcode": "06700",
        "website": "http://www.ayen.com.tr",
        "market_cap": 1345874944
    },
    "CANTE.IS": {
        "short_name": "CAN2 TERMIK",
        "long_name": "Çan2 Termik A.S.",
        "summary": "Ã\u0087an2 Termik A.S. engages in the operation of a coal fired thermal power plant in Turkey. Its power plant has an installed capacity of 340 MWm/330 MW. The company was founded in 2003 and is based in Istanbul, Turkey. As of September 10, 2013, Ã\u0087an2 Termik A.S. operates as a subsidiary of Odas Elektrik Ã\u009cretim Sanayi Ticaret A.S.",
        "currency": "TRY",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34746",
        "website": "http://www.odasenerji.com.tr/en/uretim",
        "market_cap": null
    },
    "TRCAS.IS": {
        "short_name": "TURCAS PETROL",
        "long_name": "Turcas Petrol A.S.",
        "summary": "Turcas Petrol A.S., through its subsidiaries, operates in the fuel retail and lubricants, conventional energy, and renewable energy fields primarily in Turkey. The company engages in the operation of Shell-branded fuel stations that offer fuel products and lubricants. It operates a network of approximately 1,000 Shell branded fuel stations in Turkey. The company also produces, sells, and markets various lubricant products to the automotive industry; and energy, iron and steel, construction, mining, and general manufacturing sectors. In addition, it owns and operates eight fuel oil terminals and two LPG filling and storage facilities. Further, the company is involved in the power generation and natural gas wholesale businesses. It operates natural gas and geothermal power plants. The company was founded in 1931 and is headquartered in Istanbul, Turkey. Turcas Petrol A.S. is a subsidiary of Aksoy Holding A.S.",
        "currency": "TRY",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34398",
        "website": "http://www.turcas.com.tr",
        "market_cap": 956466560
    }
}