{"0270.HK": {"short_name": "GUANGDONG INV", "long_name": "Guangdong Investment Limited", "summary": "Guangdong Investment Limited, together with its subsidiaries, engages in water resources, property investment and development, department store, electric power generation, energy project operation, road and bridge operation, and hotel businesses. The Water Resources segment provides water distribution and sewage treatment services, as well as constructs water supply and sewage treatment infrastructure in Mainland China and Hong Kong. The Property Investment and Development segment invests in various properties, such as shopping malls, office buildings, and hotels in Hong Kong and Mainland China; and develops and sells properties in Mainland China. This segment also provides property management services for various commercial properties. The Department Stores segment operates department stores that sales goods and concessionaire in Mainland China. The Electric Power Generation segment operates coal-fired power plants that supply electricity and steam in the Guangdong province, Mainland China. The Hotel Operation and Management segment operate hotels and manages third parties' hotels in Hong Kong and Mainland China. As of December 31, 2019, this segment managed 35 hotels, including three in Hong Kong, one in Macau, and 31 in Mainland China. The Road and Bridge segment invests in various road and bridge projects, which engages in the toll road operation, and construction and road management in Mainland China. It also provides treasury services in Hong Kong and Mainland China, as well as corporate, finance, and infrastructure services. The company was formerly known as Union Globe Development Limited and changed its name to Guangdong Investment Limited in January 1987. The company was incorporated in 1973 and is headquartered in Central, Hong Kong. Guangdong Investment Limited is a subsidiary of GDH Limited.", "currency": "HKD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "0362.HK": {"short_name": "XINYANG MAOJIAN", "long_name": "Xinyang Maojian Group Limited", "summary": "Xinyang Maojian Group Limited, an investment holding company, generates and supplies heat and power in the People's Republic of China. The company supplies heat for residential use; produces and sells calcium carbide, vinyl acetate, and polyvinyl-chloride; and distributes and supplies tea leaves under the Xinyang Maojian Tea Leaves brand through the e-commerce platform. It also engages in the construction and monitoring of public facilities; and provision of municipal engineering construction, and administrative and consultancy services, as well as sells beverages. The company was formerly known as China Zenith Chemical Group Limited and changed its name to Xinyang Maojian Group Limited in October 2018. Xinyang Maojian Group Limited is headquartered in Wanchai, Hong Kong.", "currency": "HKD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "0371.HK": {"short_name": "BJ ENT WATER", "long_name": "Beijing Enterprises Water Group Limited", "summary": "Beijing Enterprises Water Group Limited, together with its subsidiaries, provides water services and environmental protection services. The company offers construction services for water treatment plants and renovation projects, as well as provides sewage and reclaimed water treatment; seawater desalination; and technical and consultancy services. In addition, it distributes and sells piped water; and machineries for sewage treatment, as well as licenses technical know-how related to sewage treatment. The company provides its services in the People's Republic of China, Malaysia, Australia, Singapore, Portugal, New Zealand, and the Republic of Botswana. The company was formerly known as Shang Hua Holdings Ltd. and changed its name to Beijing Enterprises Water Group Limited in March 2008. Beijing Enterprises Water Group Limited is headquartered in Wanchai, Hong Kong.", "currency": "HKD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "0527.HK": {"short_name": "RUIFENG RENEW", "long_name": "China Ruifeng Renewable Energy Holdings Limited", "summary": "China Ruifeng Renewable Energy Holdings Limited, an investment holding company, generates wind power in the People's Republic of China. The company operates wind farms; produces wind turbine blades and components; offers electrical and mechanical equipment maintenance services; and financing and leasing, and money lending services. It also produces healthy products; and provides management and administration services. The company was formerly known as China Ruifeng Galaxy Renewable Energy Holdings Limited and changed its name to China Ruifeng Renewable Energy Holdings Limited in June 2013. China Ruifeng Renewable Energy Holdings Limited was incorporated in 2005 and is based in Wanchai, Hong Kong.", "currency": "HKD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "0855.HK": {"short_name": "CHINA WATER", "long_name": "China Water Affairs Group Limited", "summary": "China Water Affairs Group Limited, an investment holding company, engages in the water supply, sewage treatment, and property businesses in the People's Republic of China. It operates through City Water Supply Operation and Construction, Environmental Protection, and Property Development and Investment segments. The City Water Supply Operation and Construction segment is involved in the provision of water supply operation and construction services. The Environmental Protection segment engages in the sewage treatment and drainage operation and construction, solid waste and hazardous waste, environmental sanitation, and water environment management businesses. The Property Development and Investment segment develops properties for sale and invests in properties. It is also involved in the development and infrastructure of sightseeing area; provision of water environmental renovation infrastructure; and investment, construction, and operation of water conservation and hydropower related projects, as well as energy conservation and environmental protection and hotel operations. The company was formerly known as China Silver Dragon Group Limited and changed its name to China Water Affairs Group Limited in December 2004. China Water Affairs Group Limited is headquartered in Wan Chai, Hong Kong.", "currency": "HKD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "0882.HK": {"short_name": "TIANJIN DEV", "long_name": "Tianjin Development Holdings Limited", "summary": "Tianjin Development Holdings Limited, through its subsidiaries, supplies electricity, water, heat, and thermal power to industrial, commercial, and residential customers in the Tianjin Economic and Technological Development Area, the People's Republic of China. It operates through six segments: Utilities, Pharmaceutical, Hotel, Electrical and Mechanical, Port Services, and Elevators and Escalators. The company has an installed transmission capacity of approximately 946,000 kVA; daily water supply capacity of approximately 425,000 tons; and steam transmission pipelines of approximately 462 kilometers, 120 processing stations, and daily distribution capacity of approximately 30,000 tons. It also provides services in relation to construction of electricity supply network, application of technology related to new energy and renewable energy, and related technical services; and offers services in installation and maintenance of water pipes, and technical consultancy, as well as engages in the retail and wholesale of water pipes and related parts. In addition, the company is involved in the manufacture and sale of presses, and mechanical and hydroelectric equipment, as well as large scale pump units. Further, it operates Courtyard by Marriott Hong Kong, a four-star hotel; researches and develops medicine technology and products; manufactures and sells chemical drugs; manufactures and prints pharmaceutical packaging products, as well as sells other paper-based packaging materials; manufactures and sells elevators and escalators; and provides port services. The company is based in Central, Hong Kong. Tianjin Development Holdings Limited is a subsidiary of Tsinlien Group Co., Ltd.", "currency": "HKD", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "1083.HK": {"short_name": "TOWNGAS CHINA", "long_name": "Towngas China Company Limited", "summary": "Towngas China Company Limited, an investment holding company, sells and distributes piped gas in the People's Republic of China. The company operates through two segments, Sales and Distribution of Piped Gas and Related Products, and Gas Connection. It engages in the provision of piped gas; construction of gas pipelines; operation of city gas pipeline network; operation of gas fuel automobile refilling stations; and sale of gas household appliances. The company also offers financing services; provides engineering works services; and operates vehicle gas refilling stations. It serves approximately 13.44 million customers. The company was formerly known as Panva Gas Holdings Limited and changed its name to Towngas China Company Limited in May 2007. The company was founded in 1998 and is headquartered in North Point, Hong Kong. Towngas China Company Limited is a subsidiary of The Hong Kong and China Gas Company Limited.", "currency": "HKD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "North Point"}, "2886.HK": {"short_name": "BINHAI INV", "long_name": "Binhai Investment Company Limited", "summary": "Binhai Investment Company Limited, an investment holding company, engages in the construction of gas pipeline networks, provision of connection services, and sale of liquefied petroleum gas (LPG) and piped gas in Hong Kong. The company operates through Sales of Piped Natural Gas, Construction and Gas Pipeline Installation Service, Gas Passing through Service, and Sales of Bottled Natural Gas segments. It also sells piped and bottled natural gas through its pipeline networks to residential and industrial users. In addition, the company is involved in the construction of gas pipelines and installation of appliances to connect customers to pipeline networks under connection contracts to industrial and commercial customers, property developers, and property management companies. As of December 31, 2019, it had a gas pipeline network of approximately 3,048 kilometers. The company was founded in 1994 and is headquartered in Causeway Bay, Hong Kong. Binhai Investment Company Limited is a subsidiary of Teda Hong Kong Property Company Limited.", "currency": "HKD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Causeway Bay"}, "8326.HK": {"short_name": "TK NEW ENERGY", "long_name": "Tonking New Energy Group Holdings Limited", "summary": "Tonking New Energy Group Holdings Limited, an investment holding company, engages in the renewable energy business in the People's Republic of China and Hong Kong. It is involved in the research and development of solar power technology; sale of photovoltaic mounting and tracking system materials; and sale of electricity. The company was formerly known as JC Group Holdings Limited and changed its name to Tonking New Energy Group Holdings Limited in May 2016. Tonking New Energy Group Holdings Limited was founded in 2004 and is headquartered in Hong Kong, Hong Kong.", "currency": "HKD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Tsim Sha Tsui"}, "AAGEF": {"short_name": "AAG ENERGY HOLDINGS LIMITED", "long_name": "AAG Energy Holdings Limited", "summary": "AAG Energy Holdings Limited engages in the exploration, development, production, and sale of coalbed methane in the People's Republic of China. It holds interests in the Panzhuang concession covering an area of 141.8 square kilometers in the southern area of Qinshui Basin; and the Mabi concession extending over an area of 898.2 square kilometers in the southern Qinshui Basin in Shanxi province under production sharing contracts. The company was founded in 1994 and is headquartered in Central, Hong Kong. AAG Energy Holdings Limited is a subsidiary of Liming Holding Limited.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "BJWTF": {"short_name": "BEIJING ENTERPRISES WATER GP LT", "long_name": "Beijing Enterprises Water Group Limited", "summary": "Beijing Enterprises Water Group Limited, together with its subsidiaries, provides water services and environmental protection services. The company offers construction services for water treatment plants and renovation projects, as well as provides sewage and reclaimed water treatment; seawater desalination; and technical and consultancy services. In addition, it distributes and sells piped water; and machineries for sewage treatment, as well as licenses technical know-how related to sewage treatment. The company provides its services in the People's Republic of China, Malaysia, Australia, Singapore, Portugal, New Zealand, and the Republic of Botswana. The company was formerly known as Shang Hua Holdings Ltd. and changed its name to Beijing Enterprises Water Group Limited in March 2008. Beijing Enterprises Water Group Limited is headquartered in Wanchai, Hong Kong.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Wan Chai"}, "CGASY": {"short_name": "CHINA RESOURCES GAS GROUP LTD.", "long_name": "China Resources Gas Group Limited", "summary": "China Resources Gas Group Limited, an investment holding company, engages in the sale of liquefied gas and connection of gas pipelines in the People's Republic of China and Hong Kong. It operates through Sale and Distribution of Gas Fuel and Related Products, Gas Connection, Sale of Gas Appliances, Design and Construction Services, and Gas Stations segments. The Sale and Distribution of Gas Fuel and Related Products segment sells natural gas and liquefied petroleum gas for residential, commercial, and industrial use. The Gas Connection segment constructs gas pipeline networks under gas connection contracts. The Sale of Gas Appliances segment sells gas appliances and related products. The Design and Construction Services segment provides design, construction, consultancy, and management services for gas connection projects. The Gas Stations segment sells gas fuel in natural gas filling stations. As of December 31, 2019, it operated 251 city gas projects in 22 provinces in the People's Republic of China. The company is headquartered in Wanchai, Hong Kong, and is considered a Red Chip company due to its listing on the Hong Kong Stock Exchange. China Resources Gas Group Limited is a subsidiary of China Resources (Holdings) Company Limited.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Wan Chai"}, "CGHLY": {"short_name": "CHINA GAS HOLDINGS", "long_name": "China Gas Holdings Limited", "summary": "China Gas Holdings Limited, an investment holding company, operates as a gas operator and service provider in the People's Republic of China and Hong Kong. The company invests in, constructs, operates, and maintains city and town gas pipeline infrastructure facilities, gas terminals, storage and transportation facilities, and gas logistics systems; transmits natural gas and liquefied petroleum gas (LPG) to residential, industrial, and commercial customers; constructs and operates compressed natural gas/liquefied natural gas refilling stations; and develops and applies technologies related to natural gas and LPG. It is also involved in the investment in petrochemical facilities of storage and transportation, and fundamental facilities of pier; producing and storing LPG and chemical products, as well as propane and butane; CBM business; exploration and production of coal bed methane; and gas station construction, management, and consultancy services. In addition, the company offers treasury, management, consultancy, goods transportation and agency, technical advisory, and procurement services; and smart home products and gas insurance agency services, as well as wall-mounted gas heaters and kitchen appliances under the Gasbo brand. Further, it is involved in the development and investment in clean energy; wholesale and trading of natural gas and liquefied natural gas; sale of electricity; purchase and sale of gas; and sale of gas meters, pressure regulators, corrugated pipes, gas alarms, and bottled water. Additionally, the company engages in the research, development, wholesale, retail, installation, and maintenance of household equipment, electric appliances, and kitchen appliances. As of March 31, 2020, it served 14,678 industrial and 233,687 commercial customers; 35,105,524 residential customers; and operates 556 CNG/LNG refilling stations for vehicles and vessels. The company was incorporated in 1995 and is headquartered in Wan Chai, Hong Kong.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Wan Chai"}, "CGHOF": {"short_name": "CHINA GAS HOLDINGS", "long_name": "China Gas Holdings Limited", "summary": "China Gas Holdings Limited, an investment holding company, operates as a gas operator and service provider in the People's Republic of China and Hong Kong. The company invests in, constructs, operates, and maintains city and town gas pipeline infrastructure facilities, gas terminals, storage and transportation facilities, and gas logistics systems; transmits natural gas and liquefied petroleum gas (LPG) to residential, industrial, and commercial customers; constructs and operates compressed natural gas/liquefied natural gas refilling stations; and develops and applies technologies related to natural gas and LPG. It is also involved in the investment in petrochemical facilities of storage and transportation, and fundamental facilities of pier; producing and storing LPG and chemical products, as well as propane and butane; CBM business; exploration and production of coal bed methane; and gas station construction, management, and consultancy services. In addition, the company offers treasury, management, consultancy, goods transportation and agency, technical advisory, and procurement services; and smart home products and gas insurance agency services, as well as wall-mounted gas heaters and kitchen appliances under the Gasbo brand. Further, it is involved in the development and investment in clean energy; wholesale and trading of natural gas and liquefied natural gas; sale of electricity; purchase and sale of gas; and sale of gas meters, pressure regulators, corrugated pipes, gas alarms, and bottled water. Additionally, the company engages in the research, development, wholesale, retail, installation, and maintenance of household equipment, electric appliances, and kitchen appliances. As of March 31, 2020, it served 14,678 industrial and 233,687 commercial customers; 35,105,524 residential customers; and operates 556 CNG/LNG refilling stations for vehicles and vessels. The company was incorporated in 1995 and is headquartered in Wan Chai, Hong Kong.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Wan Chai"}, "CKISF": {"short_name": "CK INFRASTRUCTURE HOLDINGS LIMI", "long_name": "CK Infrastructure Holdings Limited", "summary": "CK Infrastructure Holdings Limited, an infrastructure company, develops, invests, and operates infrastructure businesses in Hong Kong, Mainland China, the United Kingdom, Continental Europe, Australia, New Zealand, and Canada. The company invests in energy infrastructure, transportation infrastructure, water infrastructure, waste management, waste-to-energy, household infrastructure, and infrastructure related businesses. It is also involved in the production and laying of asphalt; manufacture, distribution, and sale of cement; property investment and project management businesses; and investment in securities, as well as provision of waste management services. The company was formerly known as Cheung Kong Infrastructure Holdings Limited and changed its name to CK Infrastructure Holdings Limited in May 2017. The company was incorporated in 1996 and is based in Central, Hong Kong. CK Infrastructure Holdings Limited is a subsidiary of Hutchison Infrastructure Holdings Limited.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "CKISY": {"short_name": "CK INFRASTRUCTURE HOLDINGS LIMI", "long_name": "CK Infrastructure Holdings Limited", "summary": "CK Infrastructure Holdings Limited, an infrastructure company, develops, invests, and operates infrastructure businesses in Hong Kong, Mainland China, the United Kingdom, Continental Europe, Australia, New Zealand, and Canada. The company invests in energy infrastructure, transportation infrastructure, water infrastructure, waste management, waste-to-energy, household infrastructure, and infrastructure related businesses. It is also involved in the production and laying of asphalt; manufacture, distribution, and sale of cement; property investment and project management businesses; and investment in securities, as well as provision of waste management services. The company was formerly known as Cheung Kong Infrastructure Holdings Limited and changed its name to CK Infrastructure Holdings Limited in May 2017. The company was incorporated in 1996 and is based in Central, Hong Kong. CK Infrastructure Holdings Limited is a subsidiary of Hutchison Infrastructure Holdings Limited.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "CLPHF": {"short_name": "CLP HOLDINGS LTD", "long_name": "CLP Holdings Limited", "summary": "CLP Holdings Limited, an investment holding company, engages in the generation, transmission, and distribution of electricity in Hong Kong, Mainland China, India, Southeast Asia, Taiwan, and Australia. The company generates electricity through coal, gas, nuclear, wind, hydro, solar, and oil sources. It serves 5.11 million retail customers in Hong Kong and Australia. The company is also involved in the provision of pumped storage services, and energy and infrastructure solutions; property investment activities; and retail of electricity and gas. It has approximately 15,900 kilometers of transmission and high voltage distribution lines. CLP Holdings Limited was founded in 1901 and is based in Hung Hom, Hong Kong.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Hung Hom"}, "CLPHY": {"short_name": "CLP HOLDINGS LTD", "long_name": "CLP Holdings Limited", "summary": "CLP Holdings Limited, an investment holding company, engages in the generation, transmission, and distribution of electricity in Hong Kong, Mainland China, India, Southeast Asia, Taiwan, and Australia. The company generates electricity through coal, gas, nuclear, wind, hydro, solar, and oil sources. It serves 5.11 million retail customers in Hong Kong and Australia. The company is also involved in the provision of pumped storage services, and energy and infrastructure solutions; property investment activities; and retail of electricity and gas. It has approximately 15,900 kilometers of transmission and high voltage distribution lines. CLP Holdings Limited was founded in 1901 and is based in Hung Hom, Hong Kong.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Hung Hom"}, "CRGGF": {"short_name": "CHINA RESOURCES GAS GROUP LTD.", "long_name": "China Resources Gas Group Limited", "summary": "China Resources Gas Group Limited, an investment holding company, engages in the sale of liquefied gas and connection of gas pipelines in the People's Republic of China and Hong Kong. It operates through Sale and Distribution of Gas Fuel and Related Products, Gas Connection, Sale of Gas Appliances, Design and Construction Services, and Gas Stations segments. The Sale and Distribution of Gas Fuel and Related Products segment sells natural gas and liquefied petroleum gas for residential, commercial, and industrial use. The Gas Connection segment constructs gas pipeline networks under gas connection contracts. The Sale of Gas Appliances segment sells gas appliances and related products. The Design and Construction Services segment provides design, construction, consultancy, and management services for gas connection projects. The Gas Stations segment sells gas fuel in natural gas filling stations. As of December 31, 2019, it operated 251 city gas projects in 22 provinces in the People's Republic of China. The company is headquartered in Wanchai, Hong Kong, and is considered a Red Chip company due to its listing on the Hong Kong Stock Exchange. China Resources Gas Group Limited is a subsidiary of China Resources (Holdings) Company Limited.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Wan Chai"}, "CRPJY": {"short_name": "CHINA RESOURCES POWER HLDGS CO", "long_name": "China Resources Power Holdings Company Limited", "summary": "China Resources Power Holdings Company Limited, an investment holding company, invests in, develops, operates, and manages power plants and coal mines in the People's Republic of China. The company operates in two segments, Thermal Power and Renewable Energy. It operates and manages coal- and gas-fired power plants, wind farms, photovoltaic power projects, hydro-electric projects, and other clean and renewable energy projects. As of December 31, 2019, the company had 36 coal-fired power plants, 96 wind farms, 21 photovoltaic power plants, 2 hydroelectric plants, and 3 gas-fired plants with total attributable operational generation capacity of 40,392 MW. It also engages in coal mining activities; and undertakes heat and power co-generation, coal-electricity integration, and other projects. In addition, the company is involved in the power sale, distribution network construction and operation, distributed energy resource, and other businesses. Further, it provides various energy solutions. The company was founded in 2001 and is based in Wanchai, Hong Kong. China Resources Power Holdings Company Limited is a subsidiary of CRH (Power) Limited.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Independent Power Producers", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Wan Chai"}, "CUBB.F": {"short_name": "CHINA WAT.AFF.GRP NEW", "long_name": "China Water Affairs Group Limited", "summary": "China Water Affairs Group Limited, an investment holding company, engages in the water supply, sewage treatment, and property businesses in the People's Republic of China. It operates through City Water Supply Operation and Construction, Environmental Protection, and Property Development and Investment segments. The City Water Supply Operation and Construction segment is involved in the provision of water supply operation and construction services. The Environmental Protection segment engages in the sewage treatment and drainage operation and construction, solid waste and hazardous waste, environmental sanitation, and water environment management businesses. The Property Development and Investment segment develops properties for sale and invests in properties. It is also involved in the development and infrastructure of sightseeing area; provision of water environmental renovation infrastructure; and investment, construction, and operation of water conservation and hydropower related projects, as well as energy conservation and environmental protection and hotel operations. The company was formerly known as China Silver Dragon Group Limited and changed its name to China Water Affairs Group Limited in December 2004. China Water Affairs Group Limited is headquartered in Wan Chai, Hong Kong.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Wan Chai"}, "CWAFF": {"short_name": "CHINA WATER AFFAIR GROUP LTD", "long_name": "China Water Affairs Group Limited", "summary": "China Water Affairs Group Limited, an investment holding company, engages in the water supply, sewage treatment, and property businesses in the People's Republic of China. It operates through City Water Supply Operation and Construction, Environmental Protection, and Property Development and Investment segments. The City Water Supply Operation and Construction segment is involved in the provision of water supply operation and construction services. The Environmental Protection segment engages in the sewage treatment and drainage operation and construction, solid waste and hazardous waste, environmental sanitation, and water environment management businesses. The Property Development and Investment segment develops properties for sale and invests in properties. It is also involved in the development and infrastructure of sightseeing area; provision of water environmental renovation infrastructure; and investment, construction, and operation of water conservation and hydropower related projects, as well as energy conservation and environmental protection and hotel operations. The company was formerly known as China Silver Dragon Group Limited and changed its name to China Water Affairs Group Limited in December 2004. China Water Affairs Group Limited is headquartered in Wan Chai, Hong Kong.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Wan Chai"}, "CWPWF": {"short_name": "CONCORD NEW ENERGY GROUP LIMITE", "long_name": "Concord New Energy Group Limited", "summary": "Concord New Energy Group Limited, an investment holding company, engages in the generation of power in the People's Republic of China, the United States, Hong Kong, and internationally. The company operates through Power Generation and Others segments. It is involved in the investment, engineering, procurement, construction, operation, and maintenance of wind and solar power plants; and provision of design, technical, and consultancy services. The company also engages in the sale of solar and new energy equipment; design, research, and exploitation of power systems; leasing of equipment; and investment and operation of solar and wind power plants. In addition, it provides finance lease services and energy internet services. The company sells its electric power to external power grid companies. As of December 31, 2019, it had 78 grid-connected wind and photovoltaic power plants with a total installed capacity of approximately 3,446 megawatts, which include 59 wind power plants with an installed capacity of 3,113 megawatts, as well as 19 photovoltaic power plants with an installed capacity of 332 megawatts. The company was formerly known as China Windpower Group Limited and changed its name to Concord New Energy Group Limited in March 2015. Concord New Energy Group Limited was founded in 2006 and is headquartered in Admiralty, Hong Kong.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Admiralty"}, "EBZ.F": {"short_name": "CHINA GAS HLDGS  HD-,01", "long_name": "China Gas Holdings Limited", "summary": "China Gas Holdings Limited, an investment holding company, operates as a gas operator and service provider in the People's Republic of China and Hong Kong. The company invests in, constructs, operates, and maintains city and town gas pipeline infrastructure facilities, gas terminals, storage and transportation facilities, and gas logistics systems; transmits natural gas and liquefied petroleum gas (LPG) to residential, industrial, and commercial customers; constructs and operates compressed natural gas/liquefied natural gas refilling stations; and develops and applies technologies related to natural gas and LPG. It is also involved in the investment in petrochemical facilities of storage and transportation, and fundamental facilities of pier; producing and storing LPG and chemical products, as well as propane and butane; CBM business; exploration and production of coal bed methane; and gas station construction, management, and consultancy services. In addition, the company offers treasury, management, consultancy, goods transportation and agency, technical advisory, and procurement services; and smart home products and gas insurance agency services, as well as wall-mounted gas heaters and kitchen appliances under the Gasbo brand. Further, it is involved in the development and investment in clean energy; wholesale and trading of natural gas and liquefied natural gas; sale of electricity; purchase and sale of gas; and sale of gas meters, pressure regulators, corrugated pipes, gas alarms, and bottled water. Additionally, the company engages in the research, development, wholesale, retail, installation, and maintenance of household equipment, electric appliances, and kitchen appliances. As of March 31, 2020, it served 14,678 industrial and 233,687 commercial customers; 35,105,524 residential customers; and operates 556 CNG/LNG refilling stations for vehicles and vessels. The company was incorporated in 1995 and is headquartered in Wan Chai, Hong Kong.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Wan Chai"}, "GGDVF": {"short_name": "GUANGDONG INVESTMENT", "long_name": "Guangdong Investment Limited", "summary": "Guangdong Investment Limited, together with its subsidiaries, engages in water resources, property investment and development, department store, electric power generation, energy project operation, road and bridge operation, and hotel businesses. The Water Resources segment provides water distribution and sewage treatment services, as well as constructs water supply and sewage treatment infrastructure in Mainland China and Hong Kong. The Property Investment and Development segment invests in various properties, such as shopping malls, office buildings, and hotels in Hong Kong and Mainland China; and develops and sells properties in Mainland China. This segment also provides property management services for various commercial properties. The Department Stores segment operates department stores that sales goods and concessionaire in Mainland China. The Electric Power Generation segment operates coal-fired power plants that supply electricity and steam in the Guangdong province, Mainland China. The Hotel Operation and Management segment operate hotels and manages third parties' hotels in Hong Kong and Mainland China. As of December 31, 2019, this segment managed 35 hotels, including three in Hong Kong, one in Macau, and 31 in Mainland China. The Road and Bridge segment invests in various road and bridge projects, which engages in the toll road operation, and construction and road management in Mainland China. It also provides treasury services in Hong Kong and Mainland China, as well as corporate, finance, and infrastructure services. The company was formerly known as Union Globe Development Limited and changed its name to Guangdong Investment Limited in January 1987. The company was incorporated in 1973 and is headquartered in Central, Hong Kong. Guangdong Investment Limited is a subsidiary of GDH Limited.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "GGDVY": {"short_name": "GUANGDONG INVESTMENT", "long_name": "Guangdong Investment Limited", "summary": "Guangdong Investment Limited, together with its subsidiaries, engages in water resources, property investment and development, department store, electric power generation, energy project operation, road and bridge operation, and hotel businesses. The Water Resources segment provides water distribution and sewage treatment services, as well as constructs water supply and sewage treatment infrastructure in Mainland China and Hong Kong. The Property Investment and Development segment invests in various properties, such as shopping malls, office buildings, and hotels in Hong Kong and Mainland China; and develops and sells properties in Mainland China. This segment also provides property management services for various commercial properties. The Department Stores segment operates department stores that sales goods and concessionaire in Mainland China. The Electric Power Generation segment operates coal-fired power plants that supply electricity and steam in the Guangdong province, Mainland China. The Hotel Operation and Management segment operate hotels and manages third parties' hotels in Hong Kong and Mainland China. As of December 31, 2019, this segment managed 35 hotels, including three in Hong Kong, one in Macau, and 31 in Mainland China. The Road and Bridge segment invests in various road and bridge projects, which engages in the toll road operation, and construction and road management in Mainland China. It also provides treasury services in Hong Kong and Mainland China, as well as corporate, finance, and infrastructure services. The company was formerly known as Union Globe Development Limited and changed its name to Guangdong Investment Limited in January 1987. The company was incorporated in 1973 and is headquartered in Central, Hong Kong. Guangdong Investment Limited is a subsidiary of GDH Limited.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Water", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "HCG.F": {"short_name": "H.K. CHINA GAS", "long_name": "The Hong Kong and China Gas Company Limited", "summary": "The Hong Kong and China Gas Company Limited, together with its subsidiaries, produces, distributes, and markets gas in Hong Kong and Mainland China. It is involved in the provision of liquefied natural gas, methanol, and coal and other chemicals; conversion and utilization of biomass, and industrial and agricultural waste; and operation of natural gas refilling stations, piped city-gas projects, upstream and midstream developments, water and wastewater treatment projects, energy exploration and utilization ventures, and aviation fuel facilities. The company supplies town gas to approximately 1.9 million customers. It also provides network connectivity, and data center and cloud computing services; and engages in the software development, solution implementation, and systems integration activities. In addition, the company offers consultancy and engineering contractor services, including utilities installation, infrastructure construction, and civil and building services engineering for public and private projects; and designs and manufactures gas meters and metering systems. Further, it is involved in water supply and wastewater treatment serving 2.4 million customers. Additionally, the company manufactures polyethylene piping and fittings; and engages in the customers center, cafÃ©, restaurant, retail sale, automatic meter reading system development, laboratory testing, payment gateway and related, project management, landfill gas project, financing, logistics, oil, research and development, property development, and securities investment activities. The Hong Kong and China Gas Company Limited was founded in 1862 and is headquartered in North Point, Hong Kong.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "North Point"}, "HCGS.F": {"short_name": "H.K. CHINA GAS HD-,25 ADR", "long_name": "The Hong Kong and China Gas Company Limited", "summary": "The Hong Kong and China Gas Company Limited, together with its subsidiaries, produces, distributes, and markets gas in Hong Kong and Mainland China. It is involved in the provision of liquefied natural gas, methanol, and coal and other chemicals; conversion and utilization of biomass, and industrial and agricultural waste; and operation of natural gas refilling stations, piped city-gas projects, upstream and midstream developments, water and wastewater treatment projects, energy exploration and utilization ventures, and aviation fuel facilities. The company supplies town gas to approximately 1.9 million customers. It also provides network connectivity, and data center and cloud computing services; and engages in the software development, solution implementation, and systems integration activities. In addition, the company offers consultancy and engineering contractor services, including utilities installation, infrastructure construction, and civil and building services engineering for public and private projects; and designs and manufactures gas meters and metering systems. Further, it is involved in water supply and wastewater treatment serving 2.4 million customers. Additionally, the company manufactures polyethylene piping and fittings; and engages in the customers center, cafÃ©, restaurant, retail sale, automatic meter reading system development, laboratory testing, payment gateway and related, project management, landfill gas project, financing, logistics, oil, research and development, property development, and securities investment activities. The Hong Kong and China Gas Company Limited was founded in 1862 and is headquartered in North Point, Hong Kong.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "North Point"}, "HEH.F": {"short_name": "POWER ASSETS HLDG.LTD.", "long_name": "Power Assets Holdings Limited", "summary": "Power Assets Holdings Limited, an investment holding company, generates, transmits, and distributes electricity in Hong Kong, the United Kingdom, Australia, Mainland China, and internationally. The company generates energy from thermal, wind, and waste sources. It also distributes gas; transmits oil; holds property; and provides consulting, financing, trust administration, and management services. The company has a generation capacity of 1,731 MW renewable energy/energy from waste, 3,968 MW gas fired, and 4,607 MW coal/oil fired; and operates 112,300 km of gas/oil pipeline, as well as 399,100 km of power network serving 19,083,000 customers. Power Assets Holdings Limited was incorporated in 1976 and is based in Central, Hong Kong.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Independent Power Producers", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Central"}, "HGKGF": {"short_name": "POWER ASSETS HOLDINGS LTD.", "long_name": "Power Assets Holdings Limited", "summary": "Power Assets Holdings Limited, an investment holding company, generates, transmits, and distributes electricity in Hong Kong, the United Kingdom, Australia, Mainland China, and internationally. The company generates energy from thermal, wind, and waste sources. It also distributes gas; transmits oil; holds property; and provides consulting, financing, trust administration, and management services. The company has a generation capacity of 1,731 MW renewable energy/energy from waste, 3,968 MW gas fired, and 4,607 MW coal/oil fired; and operates 112,300 km of gas/oil pipeline, as well as 399,100 km of power network serving 19,083,000 customers. Power Assets Holdings Limited was incorporated in 1976 and is based in Central, Hong Kong.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Independent Power Producers", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "HGKGY": {"short_name": "POWER ASSETS HOLDINGS LTD.", "long_name": "Power Assets Holdings Limited", "summary": "Power Assets Holdings Limited, an investment holding company, generates, transmits, and distributes electricity in Hong Kong, the United Kingdom, Australia, Mainland China, and internationally. The company generates energy from thermal, wind, and waste sources. It also distributes gas; transmits oil; holds property; and provides consulting, financing, trust administration, and management services. The company has a generation capacity of 1,731 MW renewable energy/energy from waste, 3,968 MW gas fired, and 4,607 MW coal/oil fired; and operates 112,300 km of gas/oil pipeline, as well as 399,100 km of power network serving 19,083,000 customers. Power Assets Holdings Limited was incorporated in 1976 and is based in Central, Hong Kong.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Independent Power Producers", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "HKT.F": {"short_name": "HK ELECTR.INV.+HK EL.I.ST", "long_name": "HK Electric Investments and HK Electric Investments Limited", "summary": "HK Electric Investments and HK Electric Investments Limited, a vertically integrated power utility, generates, transmits, distributes, and supplies electricity in Hong Kong Island and Lamma Island. The company operates 6 coal-fired units, 5 oil-fired gas turbine units, 2 gas-fired combined-cycle units, 1 solar power system, and 1 wind turbine with an installed capacity of 3,237 MW. It also operates a transmission and distribution network of 6,540 kilometers serving 581,000 residential, commercial, and industrial customers. The company was founded in 1889 and is headquartered in Hong Kong, Hong Kong.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Hong Kong"}, "HOKCF": {"short_name": "HONGKONG & CHINA GAS CO. LTD.", "long_name": "The Hong Kong and China Gas Company Limited", "summary": "The Hong Kong and China Gas Company Limited, together with its subsidiaries, produces, distributes, and markets gas in Hong Kong and Mainland China. It is involved in the provision of liquefied natural gas, methanol, and coal and other chemicals; conversion and utilization of biomass, and industrial and agricultural waste; and operation of natural gas refilling stations, piped city-gas projects, upstream and midstream developments, water and wastewater treatment projects, energy exploration and utilization ventures, and aviation fuel facilities. The company supplies town gas to approximately 1.9 million customers. It also provides network connectivity, and data center and cloud computing services; and engages in the software development, solution implementation, and systems integration activities. In addition, the company offers consultancy and engineering contractor services, including utilities installation, infrastructure construction, and civil and building services engineering for public and private projects; and designs and manufactures gas meters and metering systems. Further, it is involved in water supply and wastewater treatment serving 2.4 million customers. Additionally, the company manufactures polyethylene piping and fittings; and engages in the customers center, cafÃ©, restaurant, retail sale, automatic meter reading system development, laboratory testing, payment gateway and related, project management, landfill gas project, financing, logistics, oil, research and development, property development, and securities investment activities. The Hong Kong and China Gas Company Limited was founded in 1862 and is headquartered in North Point, Hong Kong.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "North Point"}, "HOKCY": {"short_name": "HONGKONG & CHINA GAS CO. LTD.", "long_name": "The Hong Kong and China Gas Company Limited", "summary": "The Hong Kong and China Gas Company Limited, together with its subsidiaries, produces, distributes, and markets gas in Hong Kong and Mainland China. It is involved in the provision of liquefied natural gas, methanol, and coal and other chemicals; conversion and utilization of biomass, and industrial and agricultural waste; and operation of natural gas refilling stations, piped city-gas projects, upstream and midstream developments, water and wastewater treatment projects, energy exploration and utilization ventures, and aviation fuel facilities. The company supplies town gas to approximately 1.9 million customers. It also provides network connectivity, and data center and cloud computing services; and engages in the software development, solution implementation, and systems integration activities. In addition, the company offers consultancy and engineering contractor services, including utilities installation, infrastructure construction, and civil and building services engineering for public and private projects; and designs and manufactures gas meters and metering systems. Further, it is involved in water supply and wastewater treatment serving 2.4 million customers. Additionally, the company manufactures polyethylene piping and fittings; and engages in the customers center, cafÃ©, restaurant, retail sale, automatic meter reading system development, laboratory testing, payment gateway and related, project management, landfill gas project, financing, logistics, oil, research and development, property development, and securities investment activities. The Hong Kong and China Gas Company Limited was founded in 1862 and is headquartered in North Point, Hong Kong.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "North Point"}, "HPD.F": {"short_name": "CHINA POWER INTL DEV.", "long_name": "China Power International Development Limited", "summary": "China Power International Development Limited, an investment holding company, develops, constructs, owns, operates, and manages power plants in the People's Republic of China. The company operates through Coal-Fired Electricity, Hydropower Electricity, Wind Power Electricity, and Photovoltaic Power Electricity segments. It generates, distributes, and sells electricity through coal-fired, hydropower, wind, and photovoltaic power plants. The company provides logistic, IT, and repair and maintenance services; and owns and operates hotels. China Power International Development Limited was incorporated in 2004 and is based in Wan Chai, Hong Kong. China Power International Development Limited is considered as a Red Chip company due to its listing on the Hong Kong Stock Exchange.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Wan Chai"}, "LGX1.F": {"short_name": "CN RES GAS GR.LTD. HD-,10", "long_name": "China Resources Gas Group Limited", "summary": "China Resources Gas Group Limited, an investment holding company, engages in the sale of liquefied gas and connection of gas pipelines in the People's Republic of China and Hong Kong. It operates through Sale and Distribution of Gas Fuel and Related Products, Gas Connection, Sale of Gas Appliances, Design and Construction Services, and Gas Stations segments. The Sale and Distribution of Gas Fuel and Related Products segment sells natural gas and liquefied petroleum gas for residential, commercial, and industrial use. The Gas Connection segment constructs gas pipeline networks under gas connection contracts. The Sale of Gas Appliances segment sells gas appliances and related products. The Design and Construction Services segment provides design, construction, consultancy, and management services for gas connection projects. The Gas Stations segment sells gas fuel in natural gas filling stations. As of December 31, 2019, it operated 251 city gas projects in 22 provinces in the People's Republic of China. The company is headquartered in Wanchai, Hong Kong, and is considered a Red Chip company due to its listing on the Hong Kong Stock Exchange. China Resources Gas Group Limited is a subsidiary of China Resources (Holdings) Company Limited.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Wan Chai"}, "PGJ.F": {"short_name": "TOWNGAS CHINA CO.  HD-,10", "long_name": "Towngas China Company Limited", "summary": "Towngas China Company Limited, an investment holding company, sells and distributes piped gas in the People's Republic of China. The company operates through two segments, Sales and Distribution of Piped Gas and Related Products, and Gas Connection. It engages in the provision of piped gas; construction of gas pipelines; operation of city gas pipeline network; operation of gas fuel automobile refilling stations; and sale of gas household appliances. The company also offers financing services; provides engineering works services; and operates vehicle gas refilling stations. It serves approximately 13.44 million customers. The company was formerly known as Panva Gas Holdings Limited and changed its name to Towngas China Company Limited in May 2007. The company was founded in 1998 and is headquartered in North Point, Hong Kong. Towngas China Company Limited is a subsidiary of The Hong Kong and China Gas Company Limited.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "North Point"}, "SMTLF": {"short_name": "GCL NEW ENERGY HOLDINGS LIMITED", "long_name": "GCL New Energy Holdings Limited", "summary": "GCL New Energy Holdings Limited, an investment holding company, develops, constructs, operates, and manages solar power plants in the People's Republic of China, Japan, the United States, and internationally. As of December 31, 2019, it owned and operated 211 solar power plants with an aggregate installed capacity of 7,011 megawatts. The company was formerly known as Same Time Holdings Limited and changed its name to GCL New Energy Holdings Limited in May 2014. GCL New Energy Holdings Limited was founded in 1982 and is based in Kowloon, Hong Kong. GCL New Energy Holdings Limited is a subsidiary of GCL-Poly Energy Holdings Limited.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Kowloon"}, "TGASF": {"short_name": "TOWNGAS CHINA COMPANY LIMITED", "long_name": "Towngas China Company Limited", "summary": "Towngas China Company Limited, an investment holding company, sells and distributes piped gas in the People's Republic of China. The company operates through two segments, Sales and Distribution of Piped Gas and Related Products, and Gas Connection. It engages in the provision of piped gas; construction of gas pipelines; operation of city gas pipeline network; operation of gas fuel automobile refilling stations; and sale of gas household appliances. The company also offers financing services; provides engineering works services; and operates vehicle gas refilling stations. It serves approximately 13.44 million customers. The company was formerly known as Panva Gas Holdings Limited and changed its name to Towngas China Company Limited in May 2007. The company was founded in 1998 and is headquartered in North Point, Hong Kong. Towngas China Company Limited is a subsidiary of The Hong Kong and China Gas Company Limited.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "North Point"}, "TJID.F": {"short_name": "GCL NEW ENERGY  HD-,00416", "long_name": "GCL New Energy Holdings Limited", "summary": "GCL New Energy Holdings Limited, an investment holding company, develops, constructs, operates, and manages solar power plants in the People's Republic of China, Japan, the United States, and internationally. As of December 31, 2019, it owned and operated 211 solar power plants with an aggregate installed capacity of 7,011 megawatts. The company was formerly known as Same Time Holdings Limited and changed its name to GCL New Energy Holdings Limited in May 2014. GCL New Energy Holdings Limited was founded in 1982 and is based in Kowloon, Hong Kong. GCL New Energy Holdings Limited is a subsidiary of GCL-Poly Energy Holdings Limited.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Kowloon"}, "TJN.F": {"short_name": "TIANJIN DEV. HLDGS", "long_name": "Tianjin Development Holdings Limited", "summary": "Tianjin Development Holdings Limited, through its subsidiaries, supplies electricity, water, heat, and thermal power to industrial, commercial, and residential customers in the Tianjin Economic and Technological Development Area, the People's Republic of China. It operates through six segments: Utilities, Pharmaceutical, Hotel, Electrical and Mechanical, Port Services, and Elevators and Escalators. The company has an installed transmission capacity of approximately 946,000 kVA; daily water supply capacity of approximately 425,000 tons; and steam transmission pipelines of approximately 462 kilometers, 120 processing stations, and daily distribution capacity of approximately 30,000 tons. It also provides services in relation to construction of electricity supply network, application of technology related to new energy and renewable energy, and related technical services; and offers services in installation and maintenance of water pipes, and technical consultancy, as well as engages in the retail and wholesale of water pipes and related parts. In addition, the company is involved in the manufacture and sale of presses, and mechanical and hydroelectric equipment, as well as large scale pump units. Further, it operates Courtyard by Marriott Hong Kong, a four-star hotel; researches and develops medicine technology and products; manufactures and sells chemical drugs; manufactures and prints pharmaceutical packaging products, as well as sells other paper-based packaging materials; manufactures and sells elevators and escalators; and provides port services. The company is based in Central, Hong Kong. Tianjin Development Holdings Limited is a subsidiary of Tsinlien Group Co., Ltd.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Diversified", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Central"}, "WS7A.F": {"short_name": "BINHAI INVESTM.CO. HD-,10", "long_name": "Binhai Investment Company Limited", "summary": "Binhai Investment Company Limited, an investment holding company, engages in the construction of gas pipeline networks, provision of connection services, and sale of liquefied petroleum gas (LPG) and piped gas in Hong Kong. The company operates through Sales of Piped Natural Gas, Construction and Gas Pipeline Installation Service, Gas Passing through Service, and Sales of Bottled Natural Gas segments. It also sells piped and bottled natural gas through its pipeline networks to residential and industrial users. In addition, the company is involved in the construction of gas pipelines and installation of appliances to connect customers to pipeline networks under connection contracts to industrial and commercial customers, property developers, and property management companies. As of December 31, 2019, it had a gas pipeline network of approximately 3,048 kilometers. The company was founded in 1994 and is headquartered in Causeway Bay, Hong Kong. Binhai Investment Company Limited is a subsidiary of Teda Hong Kong Property Company Limited.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Regulated Gas", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Causeway Bay"}}