{"0527.HK": {"short_name": "RUIFENG RENEW", "long_name": "China Ruifeng Renewable Energy Holdings Limited", "summary": "China Ruifeng Renewable Energy Holdings Limited, an investment holding company, generates wind power in the People's Republic of China. The company operates wind farms; produces wind turbine blades and components; offers electrical and mechanical equipment maintenance services; and financing and leasing, and money lending services. It also produces healthy products; and provides management and administration services. The company was formerly known as China Ruifeng Galaxy Renewable Energy Holdings Limited and changed its name to China Ruifeng Renewable Energy Holdings Limited in June 2013. China Ruifeng Renewable Energy Holdings Limited was incorporated in 2005 and is based in Wanchai, Hong Kong.", "currency": "HKD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "8326.HK": {"short_name": "TK NEW ENERGY", "long_name": "Tonking New Energy Group Holdings Limited", "summary": "Tonking New Energy Group Holdings Limited, an investment holding company, engages in the renewable energy business in the People's Republic of China and Hong Kong. It is involved in the research and development of solar power technology; sale of photovoltaic mounting and tracking system materials; and sale of electricity. The company was formerly known as JC Group Holdings Limited and changed its name to Tonking New Energy Group Holdings Limited in May 2016. Tonking New Energy Group Holdings Limited was founded in 2004 and is headquartered in Hong Kong, Hong Kong.", "currency": "HKD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Tsim Sha Tsui"}, "CWPWF": {"short_name": "CONCORD NEW ENERGY GROUP LIMITE", "long_name": "Concord New Energy Group Limited", "summary": "Concord New Energy Group Limited, an investment holding company, engages in the generation of power in the People's Republic of China, the United States, Hong Kong, and internationally. The company operates through Power Generation and Others segments. It is involved in the investment, engineering, procurement, construction, operation, and maintenance of wind and solar power plants; and provision of design, technical, and consultancy services. The company also engages in the sale of solar and new energy equipment; design, research, and exploitation of power systems; leasing of equipment; and investment and operation of solar and wind power plants. In addition, it provides finance lease services and energy internet services. The company sells its electric power to external power grid companies. As of December 31, 2019, it had 78 grid-connected wind and photovoltaic power plants with a total installed capacity of approximately 3,446 megawatts, which include 59 wind power plants with an installed capacity of 3,113 megawatts, as well as 19 photovoltaic power plants with an installed capacity of 332 megawatts. The company was formerly known as China Windpower Group Limited and changed its name to Concord New Energy Group Limited in March 2015. Concord New Energy Group Limited was founded in 2006 and is headquartered in Admiralty, Hong Kong.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Admiralty"}, "HPD.F": {"short_name": "CHINA POWER INTL DEV.", "long_name": "China Power International Development Limited", "summary": "China Power International Development Limited, an investment holding company, develops, constructs, owns, operates, and manages power plants in the People's Republic of China. The company operates through Coal-Fired Electricity, Hydropower Electricity, Wind Power Electricity, and Photovoltaic Power Electricity segments. It generates, distributes, and sells electricity through coal-fired, hydropower, wind, and photovoltaic power plants. The company provides logistic, IT, and repair and maintenance services; and owns and operates hotels. China Power International Development Limited was incorporated in 2004 and is based in Wan Chai, Hong Kong. China Power International Development Limited is considered as a Red Chip company due to its listing on the Hong Kong Stock Exchange.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Wan Chai"}, "SMTLF": {"short_name": "GCL NEW ENERGY HOLDINGS LIMITED", "long_name": "GCL New Energy Holdings Limited", "summary": "GCL New Energy Holdings Limited, an investment holding company, develops, constructs, operates, and manages solar power plants in the People's Republic of China, Japan, the United States, and internationally. As of December 31, 2019, it owned and operated 211 solar power plants with an aggregate installed capacity of 7,011 megawatts. The company was formerly known as Same Time Holdings Limited and changed its name to GCL New Energy Holdings Limited in May 2014. GCL New Energy Holdings Limited was founded in 1982 and is based in Kowloon, Hong Kong. GCL New Energy Holdings Limited is a subsidiary of GCL-Poly Energy Holdings Limited.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Kowloon"}, "TJID.F": {"short_name": "GCL NEW ENERGY  HD-,00416", "long_name": "GCL New Energy Holdings Limited", "summary": "GCL New Energy Holdings Limited, an investment holding company, develops, constructs, operates, and manages solar power plants in the People's Republic of China, Japan, the United States, and internationally. As of December 31, 2019, it owned and operated 211 solar power plants with an aggregate installed capacity of 7,011 megawatts. The company was formerly known as Same Time Holdings Limited and changed its name to GCL New Energy Holdings Limited in May 2014. GCL New Energy Holdings Limited was founded in 1982 and is based in Kowloon, Hong Kong. GCL New Energy Holdings Limited is a subsidiary of GCL-Poly Energy Holdings Limited.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Kowloon"}}