{
    "0008.HK": {
        "short_name": "PCCW",
        "long_name": "PCCW Limited",
        "summary": "PCCW Limited provides telecommunications and related services in Hong Kong, Mainland and other parts of China, Japan, and internationally. The company's services include local telephony, local data and broadband, mobile and international telecommunications, and satellite-based and network-based telecommunications services; and outsourcing, consulting, and contact center services. It also provides technical support, electronics and communications engineering, and products and solutions, as well as free television, pay television program, and interactive multimedia services; sells advertising in various telephone directories and on the Internet; publishes directories; and sells mobile handsets and accessories. In addition, the company offers broadcasting and related services, management and engineering support services, customer relationship management and customer contact management solutions, content for various media, outsourced call center, and data center services; and over-the-top video services under the Viu brand, as well as sells customer premises equipment and related solutions. Further, it engages in the sale, distribution, and marketing of telecommunication products; supply of broadband internet access solutions and web services; provision of data services; and software development, systems integration, consulting, and informatization activities; the provision of computer and IP/IT related value-added services to business customers; property investment, development, management, and leasing, as well as hotel management activities; and ski operations. Additionally, the company offers digital, IT and business process outsourcing, cloud computing, hosting, managed, e-commerce, and IoT solutions. PCCW Limited was founded in 1925 and is headquartered in Quarry Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.pccw.com",
        "market_cap": "Mid Cap"
    },
    "0018.HK": {
        "short_name": "ORIENTAL PRESS",
        "long_name": "Oriental Press Group Limited",
        "summary": "Oriental Press Group Limited, an investment holding company, engages in the publication of newspapers in Hong Kong and Australia. The company operates through two segments, Publication of Newspapers and Money Lending Business. The company's flagship publication includes Oriental Daily News, a daily newspaper; and on.cc, a news portal. Its online publications also comprise Oriental Daily News ePaper, Supplement ePaper, on Racing, on Football, Life, Wacky, and Property18. In addition, the company operates Money 18, which provides real-time financial information; ontv, an online television service portal; on.cc Superstar, an entertainment mobile application; orientaldaily.on.cc and on.cc Baby portals; and Ireport, an online blog service. Further, the company engages in the canteen operation, transportation, Website contents production, building management, treasury, human resources services, printing, advertising agency, property holding and investment, and hotel property investment businesses, as well as acts as a Website service provider. Oriental Press Group Limited was founded in 1969 and is headquartered in Tai Po, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tai Po",
        "zipcode": null,
        "website": "http://opg.on.cc/tc",
        "market_cap": "Small Cap"
    },
    "0150.HK": {
        "short_name": "HYPEBEAST",
        "long_name": "Hypebeast Limited",
        "summary": "Hypebeast Limited, through its subsidiaries, operates as a digital media and e-commerce company in Hong Kong, the People's Republic of China, Japan, the United States, the United Kingdom, and internationally. It operates through Digital Media and E-commerce segments. The company produces and distributes youth focused digital content, which reports the latest trends on fashion, lifestyle, technology, entertainment, culture, and music to its visitors and followers, as well as offers agency services under Hypemaker brand. It also engages in online retail of third-party branded footwear, apparel, and accessories on its e-commerce platform; provision of advertising spaces; and publication of magazines. The company was founded in 2005 and is headquartered in Kwai Chung, Hong Kong. Hypebeast Limited is a subsidiary of CORE Capital Group Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.hypebeast.com",
        "market_cap": "Small Cap"
    },
    "0164.HK": {
        "short_name": "CHINA BAOLI TEC",
        "long_name": "China Baoli Technologies Holdings Limited",
        "summary": "China Baoli Technologies Holdings Limited, an investment holding company, engages in the mobile technology and leisure related business in Hong Kong and the People's Republic of China. The company operates through Mobile Technologies Business, Tourism and Hospitality Business, Gamma Ray Irradiation Services, and Other Operations segments. It is involved in the research and development, production, distribution, and sale of dual-screen mobile handsets; and provision of an online travel product booking platform, leasing and management services for a cruise ship, and irradiation services through gamma ray technologies. The company also engages in the provision of securities trading and investment, asset management, and travel and travel related services. In addition, it is involved in the wholesale, import, and export of telecommunication equipment, and electronic and digital products; and computer software, hardware, and auxiliary equipment, as well as commission agency services. The company was formerly known as REX Global Entertainment Holdings Limited and changed its name to China Baoli Technologies Holdings Limited in May 2016. China Baoli Technologies Holdings Limited is based in Quarry Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.chinabaolitech.com",
        "market_cap": "Small Cap"
    },
    "0205.HK": {
        "short_name": "SEEC MEDIA",
        "long_name": "SEEC Media Group Limited",
        "summary": "SEEC Media Group Limited, an investment holding company, provides advertising agency services in the People's Republic of China. It also distributes books and magazines; offers securities broking services, including brokerage, financing, underwriting, and placement; and provides money lending and e-commerce platform services. The company is based in Yau Ma Tei, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Yau Ma Tei",
        "zipcode": null,
        "website": "http://www.seec-media.com.hk",
        "market_cap": "Small Cap"
    },
    "0215.HK": {
        "short_name": "HUTCHTEL HK",
        "long_name": "Hutchison Telecommunications Hong Kong Holdings Limited",
        "summary": "Hutchison Telecommunications Hong Kong Holdings Limited, an investment holding company, provides mobile communication services. It offers provides 5G, 4G long term evolution, 3G, and GSM dual-band mobile telecommunications under the 3 brand. The company also provides mobile telecommunications services and products include local voice, SMS, MMS, international direct dialing, and international roaming; and data services and applications, such as direct carrier billing offerings, mobile device security management, eBooks, music downloads, movies-on-demand, mobile social networking applications, and FinTech, as well as Wi-Fi and other value-added services. In addition, the company is involved in the provision of marketing, advertising, and promotional services; and telecommunications retail operations. As of December 31, 2020, it served approximately 3.3 million customers in Hong Kong and Macau. The company was incorporated in 2007 and is headquartered in Central, Hong Kong. Hutchison Telecommunications Hong Kong Holdings Limited is a subsidiary of CK Hutchison Holdings Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hthkh.com",
        "market_cap": "Small Cap"
    },
    "0315.HK": {
        "short_name": "SMARTONE TELE",
        "long_name": "SmarTone Telecommunications Holdings Limited",
        "summary": "SmarTone Telecommunications Holdings Limited, an investment holding company, provides telecommunication services in Hong Kong and Macau. The company offers voice, multimedia, and mobile and fixed fiber broadband services for the consumer and corporate markets. It is also involved in the sale of handsets and accessories; issuance of guaranteed notes; and provision of customer support and telemarketing services. The company was founded in 1992 and is headquartered in Kwun Tong, Hong Kong. SmarTone Telecommunications Holdings Limited is a subsidiary of Sun Hung Kai Properties Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.smartoneholdings.com",
        "market_cap": "Small Cap"
    },
    "0343.HK": {
        "short_name": "CULTURECOM HOLD",
        "long_name": "Culturecom Holdings Limited",
        "summary": "Culturecom Holdings Limited, an investment holding company, engages in publishing comic books and digital marketing business in Hong Kong and the People's Republic of China. The company operates through Publishing and Intellectual Properties Licensing, Online and Social Business, Digital Marketing, and Retailing and Wholesales segments. The Publishing and Intellectual Properties Licensing segment publishes comic books, as well as licenses intellectual properties of comic books. This segment owns approximately 200 comic titles across various genres, including martial arts action and contemporary romance. The Online and Social Business segment engages in the operation of digital cinemas; and production of films. The Digital Marketing segment provides digital marketing and communication services; and intellectual property digitalization and agency services. The Retailing and Wholesales segment is involved in the retail of wine. It also engages in securities trading activities; and the provision of multimedia services. Culturecom Holdings Limited is headquartered in Admiralty, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.culturecom.com.hk",
        "market_cap": "Small Cap"
    },
    "0511.HK": {
        "short_name": "TVB",
        "long_name": "Television Broadcasts Limited",
        "summary": "Television Broadcasts Limited, together with its subsidiaries, engages in terrestrial television broadcasting, program production, and other television-related activities. It operates through Hong Kong TV Broadcasting, myTV SUPER, Big Big Channel and E-Commerce Business, Programme Licensing and Distribution, Overseas pay TV and TVB Anywhere, and Other Activities segments. The Hong Kong TV Broadcasting segment is involved in the broadcasting of television programs and commercials on terrestrial TV platforms; production of programs; and co-production of dramas. The myTV SUPER segment provides over-the-top services; and operates website portals. The Big Big Channel and E-Commerce Business segment operates an online social media and e-commerce platform; and provides music entertainment, event, and digital marketing services. The Programme Licensing and Distribution segment distributes television programs and channels to telecast, video, and media operators. The Overseas pay TV and TVB Anywhere segment offers pay television and OTT services to subscribers. The Other Activities segment engages in property investment and other activities. The company also offers agency services on design, production, and exhibition of advertisements; film rights and program licensing; provides consultancy, management, and agency services to artistes; and produces, publishes, and licenses musical works and sells sound recordings, as well as offers corporate finance services. In addition, it produces motion pictures for theatrical release and distribution; provides satellite and subscription television programs; and licenses and distributes films. Further, the company engages in production of programs and provision of marketing materials; and provision of programming and channel services. It operates in Hong Kong, Mainland China, Malaysia, Singapore, the United States, Canada, Vietnam, Australia, Europe, and internationally. The company was founded in 1967 and is headquartered in Kowloon, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.corporate.tvb.com",
        "market_cap": "Small Cap"
    },
    "0547.HK": {
        "short_name": "DIGITAL DOMAIN",
        "long_name": "Digital Domain Holdings Limited",
        "summary": "Digital Domain Holdings Limited, an investment holding company, engages in the media entertainment business in Hong Kong, the People's Republic of China, the United States, Canada, the United Kingdom, and internationally. The company offers augmented reality (AR), immersive reality, and virtual reality (VR) technology services using 360 degree digital capture technology and computer graphics (CG); and researches, develops, and sells VR and AR, hardware, smart wearable devices, VR software development kits, and other related products. It also provides visual effects (VFX) production and post-production services, such as visualization, previsualization, post-visualization, CG, animation, motion capture, virtual production, and design for various motion picture studios, networks, streaming services, advertisers, brands, and games. In addition, the company offers VFX production and post-production services for commercials, TV drama series, and feature films comprising offline and online editing, compositing, color grading, design, music and audio, and CG and VFX production, as well as production services for the making of commercials, VR/360 degree videos, and feature films. Further, it researches and develops virtual human technology; co-produces feature films and episodes series; invests in real estate properties; provides management, consultancy, trading, and securities investment services, as well as virtual reality content services; researches and develops software; and manages intellectual property licenses and trademarks. The company was formerly known as Sun Innovation Holdings Limited and changed its name to Digital Domain Holdings Limited in December 2013. Digital Domain Holdings Limited was incorporated in 1992 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.digitaldomain.com",
        "market_cap": "Small Cap"
    },
    "0571.HK": {
        "short_name": "ESUN HOLDINGS",
        "long_name": "eSun Holdings Limited",
        "summary": "eSun Holdings Limited, an investment holding company, primarily operates in the media and entertainment industry in Hong Kong, Mainland China, and internationally. The company's Media and Entertainment segment invests in and produces entertainment events, as well as provides related adverting and artiste management services; sells and distributes albums; licenses music; and trades gaming products. Its Film Production and Distribution segment invests in, produces, sells, and distributes television programs and films, as well as provides advertising related services; and distributes video format products. The company's Cinema Operation segment operates cinemas. eSun Holdings Limited provides consultancy services for cultural, entertainment, and live performance projects; and management, performance agency, and video duplication services. It also translates and subtitles television programs; licenses film products and rights; and produces, publishes, and distributes music. The company operates 11 cinemas in Hong Kong, and 3 cinemas in Mainland China. eSun Holdings Limited was founded in 1947 and is headquartered in Central, Hong Kong. eSun Holdings Limited is a subsidiary of Lai Sun Development Company Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.esun.com/esun-holdings/en-US/Pages/home",
        "market_cap": "Small Cap"
    },
    "0762.HK": {
        "short_name": "CHINA UNICOM",
        "long_name": "China Unicom (Hong Kong) Limited",
        "summary": "China Unicom (Hong Kong) Limited, an investment holding company, provides cellular and fixed-line voice, and related value-added services in the People's Republic of China. It also provides broadband and other Internet-related, information communications technology, and business and data communications services. In addition, the company offers communications technology training, technical, and Internet information and value-added telecommunications services; telecommunications network construction, planning, and technical consulting services; and consultancy, survey, design, and contract services relating to information and construction projects. Further, it provides customer, project design consultation and monitoring, property management, e-payment, venture capital investment, communications technology development and promotion, auto informatization, financial, data processing, and tourism and information services; advertising design, production, agency, and publication services; technology development, transfer, and consulting services; and technology promotion service of intelligent transportation system's products. Additionally, the company offers technology development and consultation, and other services; technology research and development, consultation, and services of TV video and mobile video; internet of things technology, and online data processing and transaction services; and big data, and cloud computation and infrastructure services. It also provides online video and reading materials; network music; financing leasing; and data analysis, processing, and application services, as well as sells handsets and telecommunication equipment. It has approximately 270 million 4G and 5G subscribers, 86 million fixed-line broadband subscribers, and 47 million fixed-line local access subscribers. The company was incorporated in 2000 and is based in Central, Hong Kong. China Unicom (Hong Kong) Limited is a subsidiary of China Unicom (BVI) Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.chinaunicom.com.hk",
        "market_cap": "Large Cap"
    },
    "0888.HK": {
        "short_name": "BISON FINANCE",
        "long_name": "Bison Finance Group Limited",
        "summary": "Bison Finance Group Limited, an investment holding company, engages in design and production of advertisements for transit vehicle exteriors and interiors, online portals, mobile apps, shelters, billboards, and outdoor signages in Hong Kong and Mainland China. The company also engages in media sales; and bus-body, bus-interior, bus-shelter, and billboards advertising services. In addition, it provides investment advisory services; securities brokerage and securities margin financing services; asset management services; securities underwriting and placing services; fund management and loan financing services; and insurance brokerage services. Further, the company is involved in the provision of employment agency services; events production business; integrated marketing services for advertising platforms; and management services. The company was formerly known as RoadShow Holdings Limited and changed its name to Bison Finance Group Limited in March 2018. The company was incorporated in 2000 and is based in North Point, Hong Kong. Bison Finance Group Limited is a subsidiary of Bliss Chance Global Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "North Point",
        "zipcode": null,
        "website": "http://www.bison.com.hk",
        "market_cap": "Small Cap"
    },
    "1003.HK": {
        "short_name": "HUANXI MEDIA",
        "long_name": "Huanxi Media Group Limited",
        "summary": "Huanxi Media Group Limited, an investment holding company, engages in the media and entertainment, and related businesses in the People's Republic of China. The company develops and/or invests in films and television drama series; and provides property agency, project consulting, and related services. It also develops an online streaming platform; and offers securities trading and investment, as well as Internet audio-visual programs services. The company was formerly known as 21 Holdings Limited and changed its name to Huanxi Media Group Limited in October 2015. Huanxi Media Group Limited is headquartered in Admiralty, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.huanximedia.com",
        "market_cap": "Small Cap"
    },
    "1060.HK": {
        "short_name": "ALI PICTURES",
        "long_name": "Alibaba Pictures Group Limited",
        "summary": "Alibaba Pictures Group Limited, an investment holding company, operates an Internet-driven integrated platform primarily in the People's Republic of China. The company operates through three segments: Internet-Based Promotion and Distribution, Content Production, and Integrated Development. Its platform covers content production, promotion and distribution, intellectual property licensing and integrated management, cinema ticketing management, and data services for the entertainment industry. The company is also involved in the production of broadcasting and television programs; exchanging and planning of screen-based cultural and art events; and films and TV copyrights investment, production, and distribution, as well as performance brokerage activities. In addition, it engages in the organization of cultural and art exchange events; design, production, agency sale, and release of advertisements; development, consultation, service, and transfer of network technologies; and software production activities. Further, the company offers technical-promotion, computer system, and software design services; advertises and sells entertainment related merchandise and derivatives; constructs, operates, and manages cinemas; manages and leases commercial facilities; and sells and leases audio and visual, cultural, and entertainment facilities. Additionally, it is involved in the provision of talent and ticketing agency, investment management and consultancy, exhibition, Internet information, and marketing services; and industrial investment and e-commerce activities. The company was formerly known as ChinaVision Media Group Limited and changed its name to Alibaba Pictures Group Limited in June 2014. Alibaba Pictures Group Limited is headquartered in Causeway Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.alibabapictures.com",
        "market_cap": "Mid Cap"
    },
    "1105.HK": {
        "short_name": "SING TAO",
        "long_name": "Sing Tao News Corporation Limited",
        "summary": "Sing Tao News Corporation Limited publishes and distributes newspapers, magazines, and books to readers in Hong Kong, Mainland China, Canada, the United States, Europe, Australia, and New Zealand. The company publishes Chinese and English newspapers; and magazines that primarily focuses on current affairs and entertainment, lifestyle and trends. It also publishes books in various categories, including parenting, travel, health, self-improvement, and lifestyle. In addition, the company offers a multi-media platform for recruitment advertising under the JobMarket, HeadlineJobs.hk, and The StandardJobs titles; education advertising under the EDUplus.com.hk title; and an online recruitment medium for professionals through A-Performers.com. Further, it sells and distributes repackaged information and content created by its various media businesses, as well as third party content providers; and engages in the radio broadcasting, printing, securities trading and investment, and software development activities. Additionally, the company engages in the property holding activities; distribution of print-media publications; and operation of a Website. Sing Tao News Corporation Limited was founded in 1938 and is headquartered in Tseung Kwan O, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tseung Kwan O",
        "zipcode": null,
        "website": "http://www.singtaonewscorp.com",
        "market_cap": "Small Cap"
    },
    "1159.HK": {
        "short_name": "STARLIGHT CUL",
        "long_name": "Starlight Culture Entertainment Group Limited",
        "summary": "Starlight Culture Entertainment Group Limited, an investment holding company, engages in the media and culture business in the United States, Mainland China, Australia, and Panama. The company operates through three segments: Media and Culture Business; Entertainment and Gaming Business; and Chemical Products, and Energy Conservation and Environmental Protection Products. The Media and Culture Business segment engages in the investment, production, and distribution of entertainment content, such as films and television series. The Entertainment and gaming business segment provides casino entertainment and gaming promotion services. The Chemical products, and Energy Conservation and Environmental Protection Products segment trades in the chemical products, and energy conservation and environmental protection products. The company was formerly known as Jimei International Entertainment Group Limited and changed its name to Starlight Culture Entertainment Group Limited in August 2017. Starlight Culture Entertainment Group Limited is headquartered in Hong Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.starlightcul.com.hk",
        "market_cap": "Small Cap"
    },
    "1310.HK": {
        "short_name": "HKBN",
        "long_name": "HKBN Ltd.",
        "summary": "HKBN Ltd., an investment holding company, provides fixed telecommunications network, international telecommunications, and mobile services to residential and enterprise customers primarily in Hong Kong. The company offers a range of information and communications technology services, such as broadband, Wi-Fi, mobile, data connectivity, cloud, data processing/center, information security, business continuity, and system integration services. It provides over-the-top entertainment, music streaming, administrative support services, enterprise systems development, technical services, and business referrals and consultancy services; e-business services; outsourcing; property investment; engages in the sale of various products and wholesale of computer software; and holding of licenses, as well as distributes email and related products. HKBN Ltd. was founded in 1992 and is headquartered in Kwai Chung, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.hkbn.net",
        "market_cap": "Small Cap"
    },
    "1326.HK": {
        "short_name": "TRANSMIT ENT",
        "long_name": "Transmit Entertainment Limited",
        "summary": "Transmit Entertainment Limited, an investment holding company, operates as a media and entertainment company in the Hong Kong, Macau, the People's republic of China, South East Asia region, and internationally. The company operates through four segments: Film and TV series Production and Distribution; Film Exhibition; Post-Production; and Advertising and Marketing. The company is involved in the production of Chinese films and TV series; and operation of five Hong Kong based cinemas, one Mainland China based cinema, and one post-production company. It also distributes films and TV series; and offers film advertising and promotion services, and printed and digital media publication services. In addition, it offers cinema, screenwriter, artiste, and director management; and Internet celebrity agency services, as well as engages in the e-commerce business. The company was formerly known as Pegasus Entertainment Holdings Limited and changed its name to Transmit Entertainment Limited in February 2018. The company was founded in 2009 and is headquartered in Wanchai, Hong Kong. Transmit Entertainment Limited is a subsidiary of Nice Rich Group Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.transmit-ent.com",
        "market_cap": "Small Cap"
    },
    "1566.HK": {
        "short_name": "CA CULTURAL",
        "long_name": "CA Cultural Technology Group Limited",
        "summary": "CA Cultural Technology Group Limited, an investment holding company, engages in the sales of animation derivative products, establishment and operation of indoor theme parks, and multimedia animation entertainment businesses in the People's Republic of China, Japan, Hong Kong, and Cambodia. It offers animation derivative products, including plastic toys, such as animation figures; fine toys comprising popcorn cases; and provides advisory on quality control and product design. The company also owns IPs, such as The King of Tibetan Antelope, Project Egg, Animal Conference on the Environment, HanBaGui, Violet; virtual reality (VR) games, and online games. In addition, it operates indoor amusement parks and VR theme parks under the CA SEGA JOYPOLIS brand. The company was formerly known as China Animation Characters Company Limited and changed its name to CA Cultural Technology Group Limited in January 2020. The company was incorporated in 2013 and is based in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.animatechina.com",
        "market_cap": "Small Cap"
    },
    "1716.HK": {
        "short_name": "MOST KWAI CHUNG",
        "long_name": "Most Kwai Chung Limited",
        "summary": "Most Kwai Chung Limited, an investment holding company, provides integrated advertising and media services in Hong Kong. The company operates in three segments: Digital Media Services, Print Media Services, and Other Media Services. It offers digital media services, such as video, online banner, newsfeed, and advertorial advertising through digital media platforms, third parties' TV channels, and Internet and physical advertising spaces. The company also provides print media services, including advertorial production and advertisement placement services; and publication of periodicals and books. In addition, it offers events organization and artistes management, multimedia, and advertising campaign and promotion services. The company was incorporated in 2017 and is headquartered in Kwai Chung, Hong Kong. Most Kwai Chung Limited is a subsidiary of Blackpaper Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.mostkwaichung.com",
        "market_cap": "Small Cap"
    },
    "1740.HK": {
        "short_name": "VALUES CULTURAL",
        "long_name": "Values Cultural Investment Limited",
        "summary": "Values Cultural Investment Limited, an investment holding company, engages in the production, distribution, and licensing of broadcasting rights of television (TV) and Web series in Mainland China. The company produces, licenses, and distributes various TV series covering a range of genres for TV stations companies that are engaged in the business of distribution of TV series, executive producers, and copyright owners of the TV series. It also invests in TV series as a non-executive producer. The company was founded in 2013 and is headquartered in Tsuen Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsuen Wan",
        "zipcode": null,
        "website": "http://www.yuanshimedia.com",
        "market_cap": "Small Cap"
    },
    "1993.HK": {
        "short_name": "ASIARAY",
        "long_name": "Asiaray Media Group Limited",
        "summary": "Asiaray Media Group Limited, an investment holding company, operates as an out-of-home media company in Mainland China and Hong Kong. It operates through Airports Business, and Metro and Billboards Business segments. The company develops and operates out-of-home advertising media, including advertising in airports, metro lines, and billboards and building solutions. It also provides design, consultancy, construction, and maintenance services; and advertising production, installation, and dismantling services. The company was founded in 1993 and is headquartered in Quarry Bay, Hong Kong. Asiaray Media Group Limited is a subsidiary of Media Cornerstone Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.asiaray.com",
        "market_cap": "Small Cap"
    },
    "2230.HK": {
        "short_name": "MEDIALINK GROUP",
        "long_name": "Medialink Group Limited",
        "summary": "Medialink Group Limited distributes third-party owned media content primarily in Mainland China, Hong Kong, the United States, Japan, Taiwan, the United Kingdom, Thailand, France, Philippines, and internationally. The company operates in two segments, Media Content Distribution and Brand Licensing. The Media Content Distribution segment distributes media content acquired from media content licensors, which include content relating to animation series, variety shows, drama series, animated and live-action feature films. and other video content. The Brand Licensing segment is involved in licensing and sub-licensing various rights in relation to brands owned by brand licensors comprising merchandising rights for use in the toys, apparels and footwear, health and beauty products, and food and beverage; location-based entertainment rights for events, theme parks, shopping malls, cafes, and restaurants; and brand collaboration rights for promotion campaigns and activities. It also invests in media content production. The company was founded in 2000 and is headquartered in Tsim Sha Tsui East, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.medialink.com.hk",
        "market_cap": "Small Cap"
    },
    "2HK.F": {
        "short_name": "HKBN LTD  HD -,0001",
        "long_name": "HKBN Ltd.",
        "summary": "HKBN Ltd., an investment holding company, provides fixed telecommunications network, international telecommunications, and mobile services to residential and enterprise customers primarily in Hong Kong. The company offers a range of information and communications technology services, such as broadband, Wi-Fi, mobile, data connectivity, cloud, data processing/center, information security, business continuity, and system integration services. It provides over-the-top entertainment, music streaming, administrative support services, enterprise systems development, technical services, and business referrals and consultancy services; e-business services; outsourcing; property investment; engages in the sale of various products and wholesale of computer software; and holding of licenses, as well as distributes email and related products. HKBN Ltd. was founded in 1992 and is headquartered in Kwai Chung, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.hkbn.net",
        "market_cap": "Small Cap"
    },
    "3888.HK": {
        "short_name": "KINGSOFT",
        "long_name": "Kingsoft Corporation Limited",
        "summary": "Kingsoft Corporation Limited, an investment holding company, operates as a software and internet service company in Mainland China, Hong Kong, and internationally. It operates in two segments, Entertainment Software and Others, and Office Software and Services. The Entertainment Software segment engages in the research and development of games; and provision of online games, mobile games, and casual game services. The Office Software and Services and Others segment designs, researches and develops, sells, and markets office software products and services of WPS Office. It also engages in the operation and distribution of games; marketing and operation of SMS, and wireless service of online games and application software; sale and operation of office application software; marketing and operation of entertainment software products; and research, development, and distribution of consumer application software. Kingsoft Corporation Limited was founded in 1988 and is headquartered in Kowloon, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": "100085",
        "website": "http://www.kingsoft.com",
        "market_cap": "Mid Cap"
    },
    "3K1.F": {
        "short_name": "KINGSOFT COR.LTD DL-,0005",
        "long_name": "Kingsoft Corporation Limited",
        "summary": "Kingsoft Corporation Limited, an investment holding company, operates as a software and internet service company in Mainland China, Hong Kong, and internationally. It operates in two segments, Entertainment Software and Others, and Office Software and Services. The Entertainment Software segment engages in the research and development of games; and provision of online games, mobile games, and casual game services. The Office Software and Services and Others segment designs, researches and develops, sells, and markets office software products and services of WPS Office. It also engages in the operation and distribution of games; marketing and operation of SMS, and wireless service of online games and application software; sale and operation of office application software; marketing and operation of entertainment software products; and research, development, and distribution of consumer application software. Kingsoft Corporation Limited was founded in 1988 and is headquartered in Kowloon, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": "100085",
        "website": "http://www.kingsoft.com",
        "market_cap": "Mid Cap"
    },
    "6823.HK": {
        "short_name": "HKT-SS",
        "long_name": "HKT Trust and HKT Limited",
        "summary": "HKT Trust and HKT Limited provides telecommunications services in Hong Kong, Mainland China, and internationally. It operates through Telecommunications Services, Mobile, Pay TV, and Other Businesses segments. The Telecommunications Services segment offers telecommunications and related services, including local telephony, local data and broadband, and international telecommunications, as well as enterprise solutions; and other telecommunications businesses, such as customer premises equipment sales, outsourcing, consulting, and contact centers. The Mobile segment provides mobile telecommunications services. The Pay TV segment offers interactive pay-TV services. The Other Businesses segment provides financial services, such as mobile payment, merchant services, O2O solutions, and a mobile financing platform; and The Club, a loyalty program. The company also offers 5G, cloud computing, Internet of Things, and artificial intelligence solutions to enterprises; web services; network-based telecommunications and satellite-based services; outsourced call center services; customer and consultancy services; customer relationship and customer contact management solutions and services; telecommunications call center services; and insurance and reinsurance services. In addition, it provides system integration, software development, and technical consultancy services; and sells mobile handsets and accessories, as well as telecommunication products and services. The company was incorporated in 2011 and is headquartered in Quarry Bay, Hong Kong. HKT Trust and HKT Limited is a subsidiary of PCCW Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.hkt.com",
        "market_cap": "Large Cap"
    },
    "8006.HK": {
        "short_name": "SINO SPLENDID",
        "long_name": "Sino Splendid Holdings Limited",
        "summary": "Sino Splendid Holdings Limited, an investment holding company, engages in publishing and events organizing business in Singapore and Hong Kong. It operates in five segments: Travel Media Business, Financial Magazine Business, Securities Investment, Money Lending, and Virtual Reality. The Travel Media Business segment provides advertising services through the internet and travel magazines; organizes events; and publishes magazines. The Financial Magazine Business segment offers contents and advertising services in a financial magazine distributed in the People's Republic of China. The Securities Investment segment invests in securities. The Money Lending segment provides funds to clients and receives loan interest income in return. The Virtual Reality segment operates virtual reality shop. The company was formerly known as China.com Inc. and changed its name to Sino Splendid Holdings Limited in October 2013. Sino Splendid Holdings Limited was founded in 1974 and is headquartered in Sheung Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sheung Wan",
        "zipcode": null,
        "website": "http://www.sinosplendid.com",
        "market_cap": "Small Cap"
    },
    "8091.HK": {
        "short_name": "OOH HOLDINGS",
        "long_name": "OOH Holdings Limited",
        "summary": "OOH Holdings Limited provides out-of-home advertising space and services in Hong Kong and Taiwan. It offers advertising display services on minibuses, taxis, and inside hospitals, clinics, and health and beauty retail stores, as well as digital and online media platforms, and self-pickup lockers platforms. The company also provides design and production, advertisement logistics, installation, and dismantling services on various advertising platforms; and printing services. In addition, it sells food and beverage products under the Mizimamei brand name. The company serves customers in various markets, such as pharmaceutical, healthcare, beauty, food and beverage, home design and furniture industries, etc. The company was founded in 2004 and is based in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://mediasavvy.com.hk",
        "market_cap": "Small Cap"
    },
    "8130.HK": {
        "short_name": "DADI INTL GROUP",
        "long_name": "Dadi International Group Limited",
        "summary": "Dadi International Group Limited, an investment holding company, provides advertising and media related services in the People's Republic of China. It operates through Advertising and Media Related Services; Financial Leasing and Other Financial Services; and Publication, Purchase and Distribution of Books segments. The company engages in the designing, production, and placement of advertisements; and provision of information consulting and marketing planning services, as well as advertisement agency services. It is also involved in securities investment activities. The company was formerly known as Zhi Cheng Holdings Limited and changed its name to Dadi International Group Limited in May 2019. Dadi International Group Limited was incorporated in 2001 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://dadi-international.com.hk",
        "market_cap": "Small Cap"
    },
    "8153.HK": {
        "short_name": "FARNOVA GROUP",
        "long_name": "Farnova Group Holdings Limited",
        "summary": "Farnova Group Holdings Limited, an investment holding company, provides advertising, and movie production and distribution services in the People's Republic of China. The company operates through three segments: Advertising, Money Lending, and Securities Investments. It offers short-term personal and property mortgage loans, as well as invests and trades in securities. The company was formerly known as Code Agriculture (Holdings) Limited and changed its name to Farnova Group Holdings Limited in May 2020. Farnova Group Holdings Limited was founded in 2000 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.code-hk.com",
        "market_cap": "Small Cap"
    },
    "8167.HK": {
        "short_name": "NEO TELEMEDIA",
        "long_name": "Neo Telemedia Limited",
        "summary": "Neo Telemedia Limited, an investment holding company, engages in the sale of telecommunication products and services in the People's Republic of China and other Asian countries. It operates through Provision of Data Centre Services; and Trading of Telecommunication Products segments. The company offers data center services to its customers through self-developed data centers and server cabinets leased from third parties; and Internet of Things (IoT) products, such as IoT data transfer units, smart locks, smart cloud locks, and communication application ICs, as well as IC solutions, IoT management platforms, and IoT applications. It also engages in the internet finance platform business; provision of bus services, system integration, insurance brokerage, and software development services; leasing of properties; and operation of commercial WIFI platform. The company was formerly known as Big Media Group Limited and changed its name to Neo Telemedia Limited in November 2009. Neo Telemedia Limited is headquartered in Tsim Sha Tsui, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.neo-telemedia.com",
        "market_cap": "Small Cap"
    },
    "8172.HK": {
        "short_name": "LAJIN ENT",
        "long_name": "Lajin Entertainment Network Group Limited",
        "summary": "Lajin Entertainment Network Group Limited, an investment holding company, provides movies, TV program, and internet contents services in Mainland China. The company operates through three segments: Artiste Management; Movies, TV Programmes and Internet Contents; and New Media E-Commerce. It is also involved in the investment, production, and distribution of movies and TV programs; investment in Internet contents; and promotion and demonstration through live video on the website, as well as digital technology business. In addition, the company engages in the business of cultural and entertainment media contents, as well as sourcing and production of media contents. The company was formerly known as China Star Cultural Media Group Limited and changed its name to Lajin Entertainment Network Group Limited in August 2015. Lajin Entertainment Network Group Limited was incorporated in 2001 and is headquartered in Admiralty, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "8220.HK": {
        "short_name": "BINGO GROUP",
        "long_name": "Bingo Group Holdings Limited",
        "summary": "Bingo Group Holdings Limited, an investment holding company, engages in the cinema investment and management business in the People's Republic of China and internationally. The company operates through two segments, Cinema Investment and Management; and Filmed Entertainment, New Media Exploitations and Licensing Businesses. It engages in movie production; licensing and derivatives; crossover marketing; the provision of interactive contents; artist development; last miles engagement; and cartoon and movie production activities. The company is headquartered in Hong Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.bingogroup.com.hk",
        "market_cap": "Small Cap"
    },
    "8282.HK": {
        "short_name": "GAMEONE",
        "long_name": "Gameone Holdings Limited",
        "summary": "Gameone Holdings Limited, an investment holding company, engages in the developing, operating, publishing, and distributing online PC and mobile games in Hong Kong, the People's Republic of China, and Taiwan. It serves game players. The company was founded in 1999 and is headquartered in North Point, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "North Point",
        "zipcode": null,
        "website": "http://www.gameone.com.hk",
        "market_cap": "Small Cap"
    },
    "8337.HK": {
        "short_name": "DIRECTEL",
        "long_name": "Directel Holdings Limited",
        "summary": "Directel Holdings Limited, a mobile virtual network operator, provides mobile telecommunication and value-added services in Hong Kong, Mainland China, and Singapore. The company operates through two segments, Telecommunications Services and Distribution Business. It is involved in distributing mobile phones and electronic products; trading airtime and mobile data sourced from various mobile network operators; and selling airtime and mobile data to dealers and users. The company also offers telesales dealership and other services; and SIM cards. Directel Holdings Limited was incorporated in 2009 and is headquartered in Hong Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.directel.hk",
        "market_cap": "Small Cap"
    },
    "8429.HK": {
        "short_name": "ICICLE GROUP",
        "long_name": "Icicle Group Holdings Limited",
        "summary": "Icicle Group Holdings Limited, an investment holding company, provides marketing production services in Hong Kong, the People's Republic of China, and internationally. It offers brand identity and brand asset development; design and art direction for various media formats; print and packaging design and engineering services; gifts and promotional items; confidential data printing and direct mailing services; eDM and e-newsletter solutions; e-commerce solutions; and digital brand asset production services. The company also designs, develops, and implements Web and mobile UX/UI; creates and designs materials and content for visual merchandising, retail merchandising, and venue decoration; and designs and produces window displays, signs, interior displays, and special promotional displays. In addition, it provides video and photography solutions, as well as social media marketing solutions. Further, the company operates multi-brand lifestyle platform for women's; creates, produces, and licenses TV contents, formats, and intellectual property rights; and operates a cafÃ©. It serves brand owners, including global financial institutions, luxury brand retailers, and local retail chain stores. The company was incorporated in 2017 and is headquartered in Chai Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Chai Wan",
        "zipcode": null,
        "website": "http://www.iciclegroup.com",
        "market_cap": "Small Cap"
    },
    "8446.HK": {
        "short_name": "ITP HOLDINGS",
        "long_name": "In Technical Productions Holdings Limited",
        "summary": "In Technical Productions Holdings Limited, an investment holding company, provides visual display solutions for concerts and events in Hong Kong, Macau, the People's Republic of China, Taiwan, and internationally. It rents LED panels, projectors, video control units, and other equipment; and offers stage design and equipment installation services. The company is also involved in the import, export, and wholesale of video equipment and parts, as well as provides related support services. In Technical Productions Holdings Limited was founded in 2009 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.intechproductions.com",
        "market_cap": "Small Cap"
    },
    "ASEJF": {
        "short_name": "APT SATELLITE HLDG",
        "long_name": "APT Satellite Holdings Limited",
        "summary": "APT Satellite Holdings Limited, an investment holding company, maintains, operates, and provides satellite transponder capacity and related services, satellite-based broadcasting and telecommunications services, and other services. It offers a range of C-band and Ku-band transponder leasing services to its broadcast and telecommunication customers; satellite TV broadcasting and uplink services; and teleport and network services, including hub-based and single channel per carrier services. The company also provides data center services that comprise rack leasing, server and equipment hosting, cloud management, IP gateway transit, and customized managed services; offers OTT services; and holds rights on the licensing of Chinese TV channel content and 25 TV channels of APT Satellite packages. It operates in-orbit satellites consisting of APSTAR-5C, APSTAR-6C, APSTAR-7, and APSTAR-9 in Asia, Australia, the Middle East, Africa, Europe, and the Pacific region. In addition, the company engages in property holding activities; and the provision of management and project management consultancy services. The company was founded in 1992 and is headquartered in Tai Po, Hong Kong. APT Satellite Holdings Limited is a subsidiary of APT Satellite International Company Limited.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tai Po",
        "zipcode": null,
        "website": "http://www.apstar.com",
        "market_cap": "Small Cap"
    },
    "AY8.SG": {
        "short_name": "APT SATELLITE HOLDINGS LTD. Reg",
        "long_name": "APT Satellite Holdings Limited",
        "summary": "APT Satellite Holdings Limited, an investment holding company, maintains, operates, and provides satellite transponder capacity and related services, satellite-based broadcasting and telecommunications services, and other services. It offers a range of C-band and Ku-band transponder leasing services to its broadcast and telecommunication customers; satellite TV broadcasting and uplink services; and teleport and network services, including hub-based and single channel per carrier services. The company also provides data center services that comprise rack leasing, server and equipment hosting, cloud management, IP gateway transit, and customized managed services; offers OTT services; and holds rights on the licensing of Chinese TV channel content and 25 TV channels of APT Satellite packages. It operates in-orbit satellites consisting of APSTAR-5C, APSTAR-6C, APSTAR-7, and APSTAR-9 in Asia, Australia, the Middle East, Africa, Europe, and the Pacific region. In addition, the company engages in property holding activities; and the provision of management and project management consultancy services. The company was founded in 1992 and is headquartered in Tai Po, Hong Kong. APT Satellite Holdings Limited is a subsidiary of APT Satellite International Company Limited.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tai Po",
        "zipcode": null,
        "website": "http://www.apstar.com",
        "market_cap": "Small Cap"
    },
    "B7O.F": {
        "short_name": "CITIC TELECOM INTL.HLDGS.",
        "long_name": "CITIC Telecom International Holdings Limited",
        "summary": "CITIC Telecom International Holdings Limited, an investment holding company, provides telecommunications services worldwide. The company provides carrier services, such as mobile roaming signaling SCCP, single IMSI multiple number, pre-paid roaming, mobile virtual network enabler, GMVNO, USSD, IP network solutions, and SMS firewall; Internet services; and international voice services, including voice hubbing service in handling roaming service for mobile and fixed line operators and data roaming services for mobile operators; SMS services; datamall; big data; and Internet of Things services. It also offers enterprise solutions, including network connectivity, data center, cloud computing, information security, enterprise mobile services, and voice and information services; and Internet-based communication services, such as Communication Platform as a Service for handset manufacturers and OTT operators. In addition, the company builds the infrastructure and applications of Digital Macau; and provides communications services for local airports, entertainment facilities, and events, such as the Macau Grand Prix, as well as offers local and roaming communications services to individual customers. Further, it offers mobile services, which includes, local 4G, roaming, greater bay, and OOT TV services; local and international fixed line telephone; sales of headsets; and WIFI hotspots and home broadband services. The company was formerly known as CITIC 1616 Holdings Limited and changed its name to CITIC Telecom International Holdings Limited in 2010. CITIC Telecom International Holdings Limited was incorporated in 1997 and is headquartered in Kwai Chung, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.citictel.com",
        "market_cap": "Small Cap"
    },
    "CBW.F": {
        "short_name": "ALIBABA PICTURES GR.HD-25",
        "long_name": "Alibaba Pictures Group Limited",
        "summary": "Alibaba Pictures Group Limited, an investment holding company, operates an Internet-driven integrated platform primarily in the People's Republic of China. The company operates through three segments: Internet-Based Promotion and Distribution, Content Production, and Integrated Development. Its platform covers content production, promotion and distribution, intellectual property licensing and integrated management, cinema ticketing management, and data services for the entertainment industry. The company is also involved in the production of broadcasting and television programs; exchanging and planning of screen-based cultural and art events; and films and TV copyrights investment, production, and distribution, as well as performance brokerage activities. In addition, it engages in the organization of cultural and art exchange events; design, production, agency sale, and release of advertisements; development, consultation, service, and transfer of network technologies; and software production activities. Further, the company offers technical-promotion, computer system, and software design services; advertises and sells entertainment related merchandise and derivatives; constructs, operates, and manages cinemas; manages and leases commercial facilities; and sells and leases audio and visual, cultural, and entertainment facilities. Additionally, it is involved in the provision of talent and ticketing agency, investment management and consultancy, exhibition, Internet information, and marketing services; and industrial investment and e-commerce activities. The company was formerly known as ChinaVision Media Group Limited and changed its name to Alibaba Pictures Group Limited in June 2014. Alibaba Pictures Group Limited is headquartered in Causeway Bay, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.alibabapictures.com",
        "market_cap": "Mid Cap"
    },
    "CQSN.F": {
        "short_name": "CHINA STAR ENTERT. HD-,01",
        "long_name": "China Star Entertainment Limited",
        "summary": "China Star Entertainment Limited, an investment holding company, engages in the investment, production, distribution, and licensing of films and television drama series in Hong Kong, Macau, the People's Republic of China, and internationally. The company operates through three segments: Film Related Business Operations; Property Development and Investment Operations; and Restaurant Operations. It is also involved in the provision of other film related services, including artist management services; and investment and development of properties, as well as provision of catering services through a restaurant under the Obba Bar brand. In addition, the company offers corporate planning, props and equipment rental, and dramatic creation; art piece investment and rental; property and construction project management; motion pictures and video rights distribution; film production controlling, direction, and producing; nominee; and song rights, trademarks, and copyrights holding and licensing services. Further, it provides agency and management services, as well as holds cable rights. China Star Entertainment Limited is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "CTM.F": {
        "short_name": "CHINA MOBILE LTD.",
        "long_name": "China Mobile Limited",
        "summary": "China Mobile Limited provides telecommunications services in Mainland China and Hong Kong. Its businesses primarily consist of mobile voice and data business, wireline broadband, and other information and communications services. As of December 31, 2020, the company served a total of 942 million mobile customers and 210 million wireline broadband customers. It also offers telecommunications network planning, design, and consulting services; roaming clearance, IT system operation, and technology support services; value-added platform development and maintenance services; mobile data, and system integration and development services; network construction and maintenance, network planning and optimizing, and training services; non-banking financial services; and electronic communication products design services, as well as sells related products. In addition, the company provides mobile cloud research and development services; call center services; e-payment, e-commerce, and Internet finance services; and mobile Internet digital content services, as well as operates a network and business coordination center. The company was formerly known as China Mobile (Hong Kong) Limited and changed its name to China Mobile Limited in May 2006. The company was incorporated in 1997 and is based in Central, Hong Kong. China Mobile Limited is a subsidiary of China Mobile Hong Kong (BVI) Limited.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.chinamobileltd.com",
        "market_cap": "Large Cap"
    },
    "CUH2.F": {
        "short_name": "CULTURECOM HLDGS  HD -,01",
        "long_name": "Culturecom Holdings Limited",
        "summary": "Culturecom Holdings Limited, an investment holding company, engages in publishing comic books and digital marketing business in Hong Kong and the People's Republic of China. The company operates through Publishing and Intellectual Properties Licensing, Online and Social Business, Digital Marketing, and Retailing and Wholesales segments. The Publishing and Intellectual Properties Licensing segment publishes comic books, as well as licenses intellectual properties of comic books. This segment owns approximately 200 comic titles across various genres, including martial arts action and contemporary romance. The Online and Social Business segment engages in the operation of digital cinemas; and production of films. The Digital Marketing segment provides digital marketing and communication services; and intellectual property digitalization and agency services. The Retailing and Wholesales segment is involved in the retail of wine. It also engages in securities trading activities; and the provision of multimedia services. Culturecom Holdings Limited is headquartered in Admiralty, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.culturecom.com.hk",
        "market_cap": "Small Cap"
    },
    "EIH.F": {
        "short_name": "CA CULTURAL TECH.GR.HD-10",
        "long_name": "CA Cultural Technology Group Limited",
        "summary": "CA Cultural Technology Group Limited, an investment holding company, engages in the sales of animation derivative products, establishment and operation of indoor theme parks, and multimedia animation entertainment businesses in the People's Republic of China, Japan, Hong Kong, and Cambodia. It offers animation derivative products, including plastic toys, such as animation figures; fine toys comprising popcorn cases; and provides advisory on quality control and product design. The company also owns IPs, such as The King of Tibetan Antelope, Project Egg, Animal Conference on the Environment, HanBaGui, Violet; virtual reality (VR) games, and online games. In addition, it operates indoor amusement parks and VR theme parks under the CA SEGA JOYPOLIS brand. The company was formerly known as China Animation Characters Company Limited and changed its name to CA Cultural Technology Group Limited in January 2020. The company was incorporated in 2013 and is based in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.animatechina.com",
        "market_cap": "Small Cap"
    },
    "GVMH.L": {
        "short_name": "GRAND VISION MEDIA HOLDINGS PLC",
        "long_name": "Grand Vision Media Holdings Plc",
        "summary": "Grand Vision Media Holdings Plc, together with its subsidiaries, operates as an integrated out-door digital media and advertising company in the Peoples Republic of China. It offers out-of-home advertising, 3D panel advertising, and content production services; digital marketing campaigns, such as social media marketing services; and events and exhibitions. The company was founded in 2014 and is headquartered in Hong Kong, Hong Kong.",
        "currency": "GBp",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.gvmh.co.uk",
        "market_cap": null
    },
    "HKTTF": {
        "short_name": "HKT TRUST AND HKT LTD",
        "long_name": "HKT Trust and HKT Limited",
        "summary": "HKT Trust and HKT Limited provides telecommunications services in Hong Kong, Mainland China, and internationally. It operates through Telecommunications Services, Mobile, Pay TV, and Other Businesses segments. The Telecommunications Services segment offers telecommunications and related services, including local telephony, local data and broadband, and international telecommunications, as well as enterprise solutions; and other telecommunications businesses, such as customer premises equipment sales, outsourcing, consulting, and contact centers. The Mobile segment provides mobile telecommunications services. The Pay TV segment offers interactive pay-TV services. The Other Businesses segment provides financial services, such as mobile payment, merchant services, O2O solutions, and a mobile financing platform; and The Club, a loyalty program. The company also offers 5G, cloud computing, Internet of Things, and artificial intelligence solutions to enterprises; web services; network-based telecommunications and satellite-based services; outsourced call center services; customer and consultancy services; customer relationship and customer contact management solutions and services; telecommunications call center services; and insurance and reinsurance services. In addition, it provides system integration, software development, and technical consultancy services; and sells mobile handsets and accessories, as well as telecommunication products and services. The company was incorporated in 2011 and is headquartered in Quarry Bay, Hong Kong. HKT Trust and HKT Limited is a subsidiary of PCCW Limited.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.hkt.com",
        "market_cap": "Large Cap"
    },
    "HKTTY": {
        "short_name": "HKT TRUST AND HKT LTD",
        "long_name": "HKT Trust and HKT Limited",
        "summary": "HKT Trust and HKT Limited provides telecommunications services in Hong Kong, Mainland China, and internationally. It operates through Telecommunications Services, Mobile, Pay TV, and Other Businesses segments. The Telecommunications Services segment offers telecommunications and related services, including local telephony, local data and broadband, and international telecommunications, as well as enterprise solutions; and other telecommunications businesses, such as customer premises equipment sales, outsourcing, consulting, and contact centers. The Mobile segment provides mobile telecommunications services. The Pay TV segment offers interactive pay-TV services. The Other Businesses segment provides financial services, such as mobile payment, merchant services, O2O solutions, and a mobile financing platform; and The Club, a loyalty program. The company also offers 5G, cloud computing, Internet of Things, and artificial intelligence solutions to enterprises; web services; network-based telecommunications and satellite-based services; outsourced call center services; customer and consultancy services; customer relationship and customer contact management solutions and services; telecommunications call center services; and insurance and reinsurance services. In addition, it provides system integration, software development, and technical consultancy services; and sells mobile handsets and accessories, as well as telecommunication products and services. The company was incorporated in 2011 and is headquartered in Quarry Bay, Hong Kong. HKT Trust and HKT Limited is a subsidiary of PCCW Limited.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.hkt.com",
        "market_cap": "Large Cap"
    },
    "HTCTF": {
        "short_name": "HUTCHISON TELECOMMUNICATIONS HK",
        "long_name": "Hutchison Telecommunications Hong Kong Holdings Limited",
        "summary": "Hutchison Telecommunications Hong Kong Holdings Limited, an investment holding company, provides mobile communication services. It offers provides 5G, 4G long term evolution, 3G, and GSM dual-band mobile telecommunications under the 3 brand. The company also provides mobile telecommunications services and products include local voice, SMS, MMS, international direct dialing, and international roaming; and data services and applications, such as direct carrier billing offerings, mobile device security management, eBooks, music downloads, movies-on-demand, mobile social networking applications, and FinTech, as well as Wi-Fi and other value-added services. In addition, the company is involved in the provision of marketing, advertising, and promotional services; and telecommunications retail operations. As of December 31, 2020, it served approximately 3.3 million customers in Hong Kong and Macau. The company was incorporated in 2007 and is headquartered in Central, Hong Kong. Hutchison Telecommunications Hong Kong Holdings Limited is a subsidiary of CK Hutchison Holdings Limited.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hthkh.com",
        "market_cap": "Small Cap"
    },
    "HUTCY": {
        "short_name": "HUTCHISON TELECOMMUNICATIONS HK",
        "long_name": "Hutchison Telecommunications Hong Kong Holdings Limited",
        "summary": "Hutchison Telecommunications Hong Kong Holdings Limited, an investment holding company, provides mobile communication services. It offers provides 5G, 4G long term evolution, 3G, and GSM dual-band mobile telecommunications under the 3 brand. The company also provides mobile telecommunications services and products include local voice, SMS, MMS, international direct dialing, and international roaming; and data services and applications, such as direct carrier billing offerings, mobile device security management, eBooks, music downloads, movies-on-demand, mobile social networking applications, and FinTech, as well as Wi-Fi and other value-added services. In addition, the company is involved in the provision of marketing, advertising, and promotional services; and telecommunications retail operations. As of December 31, 2020, it served approximately 3.3 million customers in Hong Kong and Macau. The company was incorporated in 2007 and is headquartered in Central, Hong Kong. Hutchison Telecommunications Hong Kong Holdings Limited is a subsidiary of CK Hutchison Holdings Limited.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hthkh.com",
        "market_cap": "Small Cap"
    },
    "I9CA.F": {
        "short_name": "ICLICK INT.ASIA ADR/0,5 A",
        "long_name": "iClick Interactive Asia Group Limited",
        "summary": "iClick Interactive Asia Group Limited, together with its subsidiaries, provides online marketing services in the People's Republic of China and internationally. It offers iAudience, an audience identification solution that allows marketers to search, identify, and customize their targeted audience to generate or enhance brand awareness; iAccess and iActivation, an audience engagement and activation solution tailored for brand awareness-driven and performance-driven campaigns; iExpress, the lite version of iAccess solution for small and medium-sized enterprises; iNsights, an online campaign results monitoring and measurement solution; and iExperience, a content creation solution. The company also provides mobile marketing solutions, which are non-search engine marketing solutions to identify, engage, and activate audience on mobile apps, as well as monitor and measure the results of online marketing activities on such channels; and other solutions that focuses on identifying, engaging, and activating audience on non-mobile app content distribution channels comprising PC banner displays, PC video advertisements, and search engine marketing. In addition, it offers enterprise solutions that help clients collate information from various consumer touchpoints and integrate them into a single data management platform to drive sales and marketing decisions to new retail, online education, real estate, and other sectors. The company sells its solutions by entering into sales contracts with entities or marketing agencies, including marketing campaign contracts. It has a strategic collaboration with Tencent International Business Group to co-develop Smart Retail and Smart Travel SaaS solutions. The company was formerly known as Optimix Media Asia Limited and changed its name to iClick Interactive Asia Group Limited in March 2017. iClick Interactive Asia Group Limited was founded in 2009 and is headquartered in Quarry Bay, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.i-click.com",
        "market_cap": "Small Cap"
    },
    "I9CA.SG": {
        "short_name": "IClick Interactive Asia Group R",
        "long_name": "iClick Interactive Asia Group Limited",
        "summary": "iClick Interactive Asia Group Limited, together with its subsidiaries, provides online marketing services in the People's Republic of China and internationally. It offers iAudience, an audience identification solution that allows marketers to search, identify, and customize their targeted audience to generate or enhance brand awareness; iAccess and iActivation, an audience engagement and activation solution tailored for brand awareness-driven and performance-driven campaigns; iExpress, the lite version of iAccess solution for small and medium-sized enterprises; iNsights, an online campaign results monitoring and measurement solution; and iExperience, a content creation solution. The company also provides mobile marketing solutions, which are non-search engine marketing solutions to identify, engage, and activate audience on mobile apps, as well as monitor and measure the results of online marketing activities on such channels; and other solutions that focuses on identifying, engaging, and activating audience on non-mobile app content distribution channels comprising PC banner displays, PC video advertisements, and search engine marketing. In addition, it offers enterprise solutions that help clients collate information from various consumer touchpoints and integrate them into a single data management platform to drive sales and marketing decisions to new retail, online education, real estate, and other sectors. The company sells its solutions by entering into sales contracts with entities or marketing agencies, including marketing campaign contracts. It has a strategic collaboration with Tencent International Business Group to co-develop Smart Retail and Smart Travel SaaS solutions. The company was formerly known as Optimix Media Asia Limited and changed its name to iClick Interactive Asia Group Limited in March 2017. iClick Interactive Asia Group Limited was founded in 2009 and is headquartered in Quarry Bay, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.i-click.com",
        "market_cap": "Small Cap"
    },
    "IB5A.F": {
        "short_name": "I-CABLE COMMNCTNS",
        "long_name": "i-CABLE Communications Limited",
        "summary": "i-CABLE Communications Limited, an investment holding company, provides integrated communications services in Hong Kong. The company operates through Media, and Telecommunications segments. Its Media segment offers television subscription, domestic free television program, advertising, channel carriage, television relay, program licensing, theatrical release, and other related services. The company's Telecommunications segment includes operations related to broadband internet access, portal operations, and mobile content licensing; and telephony, network leasing, network construction, and mobile agency services, as well as other related businesses. It owns and operates wireline telecommunications network, which provides media and telecommunications services to approximately two million households. The company also produces television and multimedia content focusing on news, information, sports, and entertainment. In addition, it provides technical services; and film production, distribution, and licensing services. The company was incorporated in 1999 and is based in Tsuen Wan, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsuen Wan",
        "zipcode": null,
        "website": "http://www.i-cablecomm.com",
        "market_cap": "Small Cap"
    },
    "ICABY": {
        "short_name": "I-CABLE COMMUNICATIONS",
        "long_name": "i-CABLE Communications Limited",
        "summary": "i-CABLE Communications Limited, an investment holding company, provides integrated communications services in Hong Kong. The company operates through Media, and Telecommunications segments. Its Media segment offers television subscription, domestic free television program, advertising, channel carriage, television relay, program licensing, theatrical release, and other related services. The company's Telecommunications segment includes operations related to broadband internet access, portal operations, and mobile content licensing; and telephony, network leasing, network construction, and mobile agency services, as well as other related businesses. It owns and operates wireline telecommunications network, which provides media and telecommunications services to approximately two million households. The company also produces television and multimedia content focusing on news, information, sports, and entertainment. In addition, it provides technical services; and film production, distribution, and licensing services. The company was incorporated in 1999 and is based in Tsuen Wan, Hong Kong.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsuen Wan",
        "zipcode": null,
        "website": "http://www.i-cablecomm.com",
        "market_cap": "Small Cap"
    },
    "ICLK": {
        "short_name": "iClick Interactive Asia Group L",
        "long_name": "iClick Interactive Asia Group Limited",
        "summary": "iClick Interactive Asia Group Limited, together with its subsidiaries, provides online marketing services in the People's Republic of China and internationally. It offers iAudience, an audience identification solution that allows marketers to search, identify, and customize their targeted audience to generate or enhance brand awareness; iAccess and iActivation, an audience engagement and activation solution tailored for brand awareness-driven and performance-driven campaigns; iExpress, the lite version of iAccess solution for small and medium-sized enterprises; iNsights, an online campaign results monitoring and measurement solution; and iExperience, a content creation solution. The company also provides mobile marketing solutions, which are non-search engine marketing solutions to identify, engage, and activate audience on mobile apps, as well as monitor and measure the results of online marketing activities on such channels; and other solutions that focuses on identifying, engaging, and activating audience on non-mobile app content distribution channels comprising PC banner displays, PC video advertisements, and search engine marketing. In addition, it offers enterprise solutions that help clients collate information from various consumer touchpoints and integrate them into a single data management platform to drive sales and marketing decisions to new retail, online education, real estate, and other sectors. The company sells its solutions by entering into sales contracts with entities or marketing agencies, including marketing campaign contracts. It has a strategic collaboration with Tencent International Business Group to co-develop Smart Retail and Smart Travel SaaS solutions. The company was formerly known as Optimix Media Asia Limited and changed its name to iClick Interactive Asia Group Limited in March 2017. iClick Interactive Asia Group Limited was founded in 2009 and is headquartered in Quarry Bay, Hong Kong.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NGM",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.i-click.com",
        "market_cap": "Small Cap"
    },
    "KSFTF": {
        "short_name": "KINGSOFT CORP",
        "long_name": "Kingsoft Corporation Limited",
        "summary": "Kingsoft Corporation Limited, an investment holding company, operates as a software and internet service company in Mainland China, Hong Kong, and internationally. It operates in two segments, Entertainment Software and Others, and Office Software and Services. The Entertainment Software segment engages in the research and development of games; and provision of online games, mobile games, and casual game services. The Office Software and Services and Others segment designs, researches and develops, sells, and markets office software products and services of WPS Office. It also engages in the operation and distribution of games; marketing and operation of SMS, and wireless service of online games and application software; sale and operation of office application software; marketing and operation of entertainment software products; and research, development, and distribution of consumer application software. Kingsoft Corporation Limited was founded in 1988 and is headquartered in Kowloon, Hong Kong.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": "100085",
        "website": "http://www.kingsoft.com",
        "market_cap": "Mid Cap"
    },
    "LDSN": {
        "short_name": "LUDUSON G INC",
        "long_name": "Luduson G Inc.",
        "summary": "Luduson G Inc., a gaming technology company, provides events marketing strategies with digital interactive solutions and content production services in Hong Kong. The company operates in two segments, Digital Marketing and Entertainment. It develops right-to-use digital entertainment solutions; interactive game software; and provides system development consultancy and maintenance services to customers and interactive games installations in shopping mall events, exhibitions, and brand promotions. The company also offer customized device box with a library of self-developed interactive game contents, such as sport-themed social games; motion-sensing action games; logic and puzzle games; original IP characters education game for children, etc. In addition, the company provides event planning services. Luduson G Inc. is based in Wan Chai, Hong Kong.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.luduson.com",
        "market_cap": "Small Cap"
    },
    "MOXC": {
        "short_name": "Moxian, Inc.",
        "long_name": "Moxian, Inc.",
        "summary": "Moxian, Inc. operates a social network platform that integrates social media and business into a single platform in China. The company's products and services focuses on creating interaction between users and merchant clients by allowing merchant clients to study consumer behavior. It serves small and medium sized enterprises. The company was formerly known as Moxian China, Inc. and changed its name to Moxian, Inc. in July 2015. Moxian, Inc. was founded in 2010 and is based in Hong Kong, Hong Kong.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.moxianglobal.com",
        "market_cap": "Small Cap"
    },
    "NWCN": {
        "short_name": "NETWORK CN INC",
        "long_name": "Network CN Inc.",
        "summary": "Network CN Inc., together with its subsidiaries, provides out-of-home advertising services to corporate customers in the People's Republic of China. It operates an advertising network of roadside light emitting diode (LED) digital video panels, mega-size LED digital video billboards, and light boxes. The company also offers administrative and management services. It provides its services through direct sales force and advertising agencies. The company was formerly known as Teda Travel Group Inc. and changed its name to Network CN Inc. in August 2006. Network CN Inc. is headquartered in Wan Chai, Hong Kong.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.ncnmedia.com",
        "market_cap": "Small Cap"
    },
    "OPQ.F": {
        "short_name": "ORIENTAL PRESS GRP",
        "long_name": "Oriental Press Group Limited",
        "summary": "Oriental Press Group Limited, an investment holding company, engages in the publication of newspapers in Hong Kong and Australia. The company operates through two segments, Publication of Newspapers and Money Lending Business. The company's flagship publication includes Oriental Daily News, a daily newspaper; and on.cc, a news portal. Its online publications also comprise Oriental Daily News ePaper, Supplement ePaper, on Racing, on Football, Life, Wacky, and Property18. In addition, the company operates Money 18, which provides real-time financial information; ontv, an online television service portal; on.cc Superstar, an entertainment mobile application; orientaldaily.on.cc and on.cc Baby portals; and Ireport, an online blog service. Further, the company engages in the canteen operation, transportation, Website contents production, building management, treasury, human resources services, printing, advertising agency, property holding and investment, and hotel property investment businesses, as well as acts as a Website service provider. Oriental Press Group Limited was founded in 1969 and is headquartered in Tai Po, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tai Po",
        "zipcode": null,
        "website": "http://opg.on.cc/tc",
        "market_cap": "Small Cap"
    },
    "PCCWY": {
        "short_name": "PCCW LIMITED",
        "long_name": "PCCW Limited",
        "summary": "PCCW Limited provides telecommunications and related services in Hong Kong, Mainland and other parts of China, Japan, and internationally. The company's services include local telephony, local data and broadband, mobile and international telecommunications, and satellite-based and network-based telecommunications services; and outsourcing, consulting, and contact center services. It also provides technical support, electronics and communications engineering, and products and solutions, as well as free television, pay television program, and interactive multimedia services; sells advertising in various telephone directories and on the Internet; publishes directories; and sells mobile handsets and accessories. In addition, the company offers broadcasting and related services, management and engineering support services, customer relationship management and customer contact management solutions, content for various media, outsourced call center, and data center services; and over-the-top video services under the Viu brand, as well as sells customer premises equipment and related solutions. Further, it engages in the sale, distribution, and marketing of telecommunication products; supply of broadband internet access solutions and web services; provision of data services; and software development, systems integration, consulting, and informatization activities; the provision of computer and IP/IT related value-added services to business customers; property investment, development, management, and leasing, as well as hotel management activities; and ski operations. Additionally, the company offers digital, IT and business process outsourcing, cloud computing, hosting, managed, e-commerce, and IoT solutions. PCCW Limited was founded in 1925 and is headquartered in Quarry Bay, Hong Kong.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.pccw.com",
        "market_cap": "Mid Cap"
    },
    "PCWLF": {
        "short_name": "PCCW LIMITED",
        "long_name": "PCCW Limited",
        "summary": "PCCW Limited provides telecommunications and related services in Hong Kong, Mainland and other parts of China, Japan, and internationally. The company's services include local telephony, local data and broadband, mobile and international telecommunications, and satellite-based and network-based telecommunications services; and outsourcing, consulting, and contact center services. It also provides technical support, electronics and communications engineering, and products and solutions, as well as free television, pay television program, and interactive multimedia services; sells advertising in various telephone directories and on the Internet; publishes directories; and sells mobile handsets and accessories. In addition, the company offers broadcasting and related services, management and engineering support services, customer relationship management and customer contact management solutions, content for various media, outsourced call center, and data center services; and over-the-top video services under the Viu brand, as well as sells customer premises equipment and related solutions. Further, it engages in the sale, distribution, and marketing of telecommunication products; supply of broadband internet access solutions and web services; provision of data services; and software development, systems integration, consulting, and informatization activities; the provision of computer and IP/IT related value-added services to business customers; property investment, development, management, and leasing, as well as hotel management activities; and ski operations. Additionally, the company offers digital, IT and business process outsourcing, cloud computing, hosting, managed, e-commerce, and IoT solutions. PCCW Limited was founded in 1925 and is headquartered in Quarry Bay, Hong Kong.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.pccw.com",
        "market_cap": "Mid Cap"
    },
    "PPK.F": {
        "short_name": "NEXT DIGITAL LTD.",
        "long_name": "Next Digital Limited",
        "summary": "Next Digital Limited, an investment holding company, operates as a multimedia company. It operates through Digital Business and Print Business segments. The Digital Business segment provides Internet advertising, online subscription, and content services, as well as develops mobile games and apps in Hong Kong, Taiwan, and North America. The Print Business segment sells newspapers, books, and magazines; and provides newspapers, books, and magazines printing and advertising services in Hong Kong, Taiwan, North America, Europe, and Australasia. It is also involved in the mobile, platform development, movie production, and mobile commerce businesses, as well as provides promotion and management services. The company was formerly known as Next Media Limited and changed its name to Next Digital Limited in October 2015. Next Digital Limited was incorporated in 1981 and is based in Tseung Kwan O, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tseung Kwan O",
        "zipcode": null,
        "website": "http://www.nextdigital.com.hk",
        "market_cap": "Small Cap"
    },
    "PVGB.F": {
        "short_name": "SING TAO NEWS CORP. CONS.",
        "long_name": "Sing Tao News Corporation Limited",
        "summary": "Sing Tao News Corporation Limited publishes and distributes newspapers, magazines, and books to readers in Hong Kong, Mainland China, Canada, the United States, Europe, Australia, and New Zealand. The company publishes Chinese and English newspapers; and magazines that primarily focuses on current affairs and entertainment, lifestyle and trends. It also publishes books in various categories, including parenting, travel, health, self-improvement, and lifestyle. In addition, the company offers a multi-media platform for recruitment advertising under the JobMarket, HeadlineJobs.hk, and The StandardJobs titles; education advertising under the EDUplus.com.hk title; and an online recruitment medium for professionals through A-Performers.com. Further, it sells and distributes repackaged information and content created by its various media businesses, as well as third party content providers; and engages in the radio broadcasting, printing, securities trading and investment, and software development activities. Additionally, the company engages in the property holding activities; distribution of print-media publications; and operation of a Website. Sing Tao News Corporation Limited was founded in 1938 and is headquartered in Tseung Kwan O, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tseung Kwan O",
        "zipcode": null,
        "website": "http://www.singtaonewscorp.com",
        "market_cap": "Small Cap"
    },
    "RECC.F": {
        "short_name": "KK CULTURE HLDGS  HD-,20",
        "long_name": "KK Culture Holdings Limited",
        "summary": "KK Culture Holdings Limited, an investment holding company, provides recruitment advertising services in and Hong Kong. It operates through two segments, Advertising; and Sales Of Medical and Health Products. The Advertising segment provides advertisement services on various publications and magazines, and other advertising media products. The Sales of Medical and Health Products segment sells various types of medical and health products, including reagents for health checks; and offers COVID-19, hormone, genetic, and sports testing services for corporate and government-funded institutes. The company also provides tutoring and education services, publishing and investment trading, and website development and information technology services. It is also involved in the property investment business. The company was formerly known as Cinderella Media Group Limited and changed its name to KK Culture Holdings Limited in August 2017. KK Culture Holdings Limited was founded in 1992 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.kk-culture.com",
        "market_cap": "Small Cap"
    },
    "SMA.F": {
        "short_name": "SMARTONE TEL.HLDGS HD-,10",
        "long_name": "SmarTone Telecommunications Holdings Limited",
        "summary": "SmarTone Telecommunications Holdings Limited, an investment holding company, provides telecommunication services in Hong Kong and Macau. The company offers voice, multimedia, and mobile and fixed fiber broadband services for the consumer and corporate markets. It is also involved in the sale of handsets and accessories; issuance of guaranteed notes; and provision of customer support and telemarketing services. The company was founded in 1992 and is headquartered in Kwun Tong, Hong Kong. SmarTone Telecommunications Holdings Limited is a subsidiary of Sun Hung Kai Properties Limited.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.smartoneholdings.com",
        "market_cap": "Small Cap"
    },
    "TBCN.F": {
        "short_name": "TELEVISION BROAD. (BL100)",
        "long_name": "Television Broadcasts Limited",
        "summary": "Television Broadcasts Limited, together with its subsidiaries, engages in terrestrial television broadcasting, program production, and other television-related activities. It operates through Hong Kong TV Broadcasting, myTV SUPER, Big Big Channel and E-Commerce Business, Programme Licensing and Distribution, Overseas pay TV and TVB Anywhere, and Other Activities segments. The Hong Kong TV Broadcasting segment is involved in the broadcasting of television programs and commercials on terrestrial TV platforms; production of programs; and co-production of dramas. The myTV SUPER segment provides over-the-top services; and operates website portals. The Big Big Channel and E-Commerce Business segment operates an online social media and e-commerce platform; and provides music entertainment, event, and digital marketing services. The Programme Licensing and Distribution segment distributes television programs and channels to telecast, video, and media operators. The Overseas pay TV and TVB Anywhere segment offers pay television and OTT services to subscribers. The Other Activities segment engages in property investment and other activities. The company also offers agency services on design, production, and exhibition of advertisements; film rights and program licensing; provides consultancy, management, and agency services to artistes; and produces, publishes, and licenses musical works and sells sound recordings, as well as offers corporate finance services. In addition, it produces motion pictures for theatrical release and distribution; provides satellite and subscription television programs; and licenses and distributes films. Further, the company engages in production of programs and provision of marketing materials; and provision of programming and channel services. It operates in Hong Kong, Mainland China, Malaysia, Singapore, the United States, Canada, Vietnam, Australia, Europe, and internationally. The company was founded in 1967 and is headquartered in Kowloon, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.corporate.tvb.com",
        "market_cap": "Small Cap"
    },
    "TH3B.F": {
        "short_name": "PCCW LTD CONS.",
        "long_name": "PCCW Limited",
        "summary": "PCCW Limited provides telecommunications and related services in Hong Kong, Mainland and other parts of China, Japan, and internationally. The company's services include local telephony, local data and broadband, mobile and international telecommunications, and satellite-based and network-based telecommunications services; and outsourcing, consulting, and contact center services. It also provides technical support, electronics and communications engineering, and products and solutions, as well as free television, pay television program, and interactive multimedia services; sells advertising in various telephone directories and on the Internet; publishes directories; and sells mobile handsets and accessories. In addition, the company offers broadcasting and related services, management and engineering support services, customer relationship management and customer contact management solutions, content for various media, outsourced call center, and data center services; and over-the-top video services under the Viu brand, as well as sells customer premises equipment and related solutions. Further, it engages in the sale, distribution, and marketing of telecommunication products; supply of broadband internet access solutions and web services; provision of data services; and software development, systems integration, consulting, and informatization activities; the provision of computer and IP/IT related value-added services to business customers; property investment, development, management, and leasing, as well as hotel management activities; and ski operations. Additionally, the company offers digital, IT and business process outsourcing, cloud computing, hosting, managed, e-commerce, and IoT solutions. PCCW Limited was founded in 1925 and is headquartered in Quarry Bay, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.pccw.com",
        "market_cap": "Mid Cap"
    },
    "TQC.F": {
        "short_name": "TOM GROUP LTD.  HD-,10",
        "long_name": "TOM Group Limited",
        "summary": "TOM Group Limited, an investment holding company, operates as a technology and media company in Hong Kong, Mainland China, Taiwan, and other Asian countries. The company operates through the five segments: E-Commerce Group, Mobile Internet Group, Social Network Group, Publishing Group, and Advertising Group. The company's E-Commerce Group segment provides services to users using the mobile and Internet-based marketplace; and technical services for e-commerce/retail operations. Its Mobile Internet Group segment offers mobile Internet services, online advertising services, and commercial enterprise solutions. The company's Social Network Group segment provides services of online community and social networking websites, and related online advertising. Its Publishing Group segment is involved in the magazine and book publishing and circulation activities; and sale of advertising and other related products. The company's Advertising Group segment provides outdoor media services; and media sales, event production, and marketing services. This segment is also involved in the advertising sale of outdoor media assets. The company also holds trademarks and domain names; operates a mobile and Internet-based C2C marketplace; provides Internet content, online advertising, telecom value-added, management, and email services; and owns and operates a website, an e-marketplace for agricultural products. In addition, it is involved in the development of software, electronics, and computer network systems; supply of online community and social networking websites; publishing, distribution, and retail of books and magazines; and event management and media buying businesses. The company was formerly known as TOM.COM LIMITED and changed its name to TOM Group Limited in 2004. TOM Group Limited was incorporated in 1999 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.tomgroup.com",
        "market_cap": "Small Cap"
    },
    "TVBCF": {
        "short_name": "TELEVISION BROADCASTS",
        "long_name": "Television Broadcasts Limited",
        "summary": "Television Broadcasts Limited, together with its subsidiaries, engages in terrestrial television broadcasting, program production, and other television-related activities. It operates through Hong Kong TV Broadcasting, myTV SUPER, Big Big Channel and E-Commerce Business, Programme Licensing and Distribution, Overseas pay TV and TVB Anywhere, and Other Activities segments. The Hong Kong TV Broadcasting segment is involved in the broadcasting of television programs and commercials on terrestrial TV platforms; production of programs; and co-production of dramas. The myTV SUPER segment provides over-the-top services; and operates website portals. The Big Big Channel and E-Commerce Business segment operates an online social media and e-commerce platform; and provides music entertainment, event, and digital marketing services. The Programme Licensing and Distribution segment distributes television programs and channels to telecast, video, and media operators. The Overseas pay TV and TVB Anywhere segment offers pay television and OTT services to subscribers. The Other Activities segment engages in property investment and other activities. The company also offers agency services on design, production, and exhibition of advertisements; film rights and program licensing; provides consultancy, management, and agency services to artistes; and produces, publishes, and licenses musical works and sells sound recordings, as well as offers corporate finance services. In addition, it produces motion pictures for theatrical release and distribution; provides satellite and subscription television programs; and licenses and distributes films. Further, the company engages in production of programs and provision of marketing materials; and provision of programming and channel services. It operates in Hong Kong, Mainland China, Malaysia, Singapore, the United States, Canada, Vietnam, Australia, Europe, and internationally. The company was founded in 1967 and is headquartered in Kowloon, Hong Kong.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.corporate.tvb.com",
        "market_cap": "Small Cap"
    },
    "TVBCY": {
        "short_name": "TELEVISION BROADCASTS",
        "long_name": "Television Broadcasts Limited",
        "summary": "Television Broadcasts Limited, together with its subsidiaries, engages in terrestrial television broadcasting, program production, and other television-related activities. It operates through Hong Kong TV Broadcasting, myTV SUPER, Big Big Channel and E-Commerce Business, Programme Licensing and Distribution, Overseas pay TV and TVB Anywhere, and Other Activities segments. The Hong Kong TV Broadcasting segment is involved in the broadcasting of television programs and commercials on terrestrial TV platforms; production of programs; and co-production of dramas. The myTV SUPER segment provides over-the-top services; and operates website portals. The Big Big Channel and E-Commerce Business segment operates an online social media and e-commerce platform; and provides music entertainment, event, and digital marketing services. The Programme Licensing and Distribution segment distributes television programs and channels to telecast, video, and media operators. The Overseas pay TV and TVB Anywhere segment offers pay television and OTT services to subscribers. The Other Activities segment engages in property investment and other activities. The company also offers agency services on design, production, and exhibition of advertisements; film rights and program licensing; provides consultancy, management, and agency services to artistes; and produces, publishes, and licenses musical works and sells sound recordings, as well as offers corporate finance services. In addition, it produces motion pictures for theatrical release and distribution; provides satellite and subscription television programs; and licenses and distributes films. Further, the company engages in production of programs and provision of marketing materials; and provision of programming and channel services. It operates in Hong Kong, Mainland China, Malaysia, Singapore, the United States, Canada, Vietnam, Australia, Europe, and internationally. The company was founded in 1967 and is headquartered in Kowloon, Hong Kong.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.corporate.tvb.com",
        "market_cap": "Small Cap"
    },
    "UCL": {
        "short_name": "uCloudlink Group Inc.",
        "long_name": "uCloudlink Group Inc.",
        "summary": "uCloudlink Group Inc. operates as a mobile data traffic sharing marketplace in the telecommunications industry. It provides uCloudlink 1.0, a model that focuses on cross-border travelers that need mobile data connectivity services in various countries; and operates portable Wi-Fi services under the Roamingman name in China and Malaysia, which provides global mobile data connectivity services, as well as offers GlocalMe portable Wi-Fi terminals and cloud SIM architecture for mobile virtual network operators (MVNOs), mobile network operators (MNOs), and portable Wi-Fi terminal rental companies. The company also offers uCloudlink 2.0, a model that provides mobile data connectivity services to local users through various MNOs; GlocalMe Inside, an implementation solutions for smartphones and other smart hardware products, which enables them to access its cloud SIM architecture and SIM card pool; and GlocalMe, a world phone series. In addition, it provides uCloudlink 3.0, including B2C retail, B2B2C wholesale, and platform-as-a-service/ software-as-a-service platform-based connectivity ecosystem. Further, the company provides IoT modules with GlocalMe Inside implementation to meet the demand for mobile data from various terminals, as well as provides integrated network solutions to its customers; SIM cards with prepaid data packages; and value added services, such as advertisement. Additionally, it's platform-as-a-service/ software-as-a-service offers modules, such as customer relationship management, operations and business support system, and SIM card enterprise resource planning and management. The company was incorporated in 2014 and is headquartered in Kowloon, Hong Kong.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.ucloudlink.com",
        "market_cap": "Small Cap"
    },
    "XCI.F": {
        "short_name": "CN UNICOM(HK)LTD.",
        "long_name": "China Unicom (Hong Kong) Limited",
        "summary": "China Unicom (Hong Kong) Limited, an investment holding company, provides cellular and fixed-line voice, and related value-added services in the People's Republic of China. It also provides broadband and other Internet-related, information communications technology, and business and data communications services. In addition, the company offers communications technology training, technical, and Internet information and value-added telecommunications services; telecommunications network construction, planning, and technical consulting services; and consultancy, survey, design, and contract services relating to information and construction projects. Further, it provides customer, project design consultation and monitoring, property management, e-payment, venture capital investment, communications technology development and promotion, auto informatization, financial, data processing, and tourism and information services; advertising design, production, agency, and publication services; technology development, transfer, and consulting services; and technology promotion service of intelligent transportation system's products. Additionally, the company offers technology development and consultation, and other services; technology research and development, consultation, and services of TV video and mobile video; internet of things technology, and online data processing and transaction services; and big data, and cloud computation and infrastructure services. It also provides online video and reading materials; network music; financing leasing; and data analysis, processing, and application services, as well as sells handsets and telecommunication equipment. It has approximately 270 million 4G and 5G subscribers, 86 million fixed-line broadband subscribers, and 47 million fixed-line local access subscribers. The company was incorporated in 2000 and is based in Central, Hong Kong. China Unicom (Hong Kong) Limited is a subsidiary of China Unicom (BVI) Limited.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.chinaunicom.com.hk",
        "market_cap": "Large Cap"
    },
    "ZCH.F": {
        "short_name": "CHINA TELECOM H  YC 1",
        "long_name": "China Telecom Corporation Limited",
        "summary": "China Telecom Corporation Limited, together with its subsidiaries, provides wireline and mobile telecommunications services primarily in the People's Republic of China. It offers wireline voice services, including local wireline telephone services and long distance wireline services; CDMA mobile voice services, such as local calls, domestic and international long distance calls, intra-provincial roaming, and inter-provincial and international roaming; wireline Internet access services comprising dial-up and broadband services; wireless Internet access services; and wireline, Internet, and mobile value-added services. The company also provides integrated information application services consisting of Best Tone information services; and information technology-based integrated solutions, such as system integration, outsourcing, special advisory, information application, knowledge, and software development services. In addition, it offers managed data services that include digital data network, frame relay, and asynchronous transfer mode services for government agencies, large corporations, and institutions; and leased line services, as well as sells, repairs, and maintains customer-end equipment. Further, the company provides international telecommunications services, including network, Internet access and transit, Internet data center, and mobile virtual network services in various countries, including the Asia Pacific, Europe, Africa, South America, and North America; and e-commerce, music production and related information, instant messenger, finance leasing, and capital and financial management services, as well as sells telecommunications terminals. As of December 31, 2020, it had approximately 351 million mobile subscribers; 159 million wireline broadband subscribers; and 108 million access lines in service. The company was incorporated in 2002 and is based in Wan Chai, Hong Kong. China Telecom Corporation Limited is a subsidiary of China Telecommunications Corporation.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.chinatelecom-h.com/en/global/home.php",
        "market_cap": "Large Cap"
    },
    "ZZLL": {
        "short_name": "ZZLL INFORMATION TECHNOLOGY INC",
        "long_name": "ZZLL Information Technology, Inc.",
        "summary": "ZZLL Information Technology, Inc., through its subsidiaries, provides consumer-to-consumer, business-to-consumer, and business-to-business-sales services via web portals. Its online media syndicates video in a cloud-based, multimedia conduit serving a growing, global community of content creators, news outlets, and leading brands. ZZLL Information Technology, Inc. is based in North Point, Hong Kong.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "North Point",
        "zipcode": null,
        "website": "http://www.zzlliti.com",
        "market_cap": "Small Cap"
    }
}