{
    "PXSTF": {
        "short_name": "PHOENIX MEDIA INV (HLDGS) LTD",
        "long_name": "Phoenix Media Investment (Holdings) Limited",
        "summary": "Phoenix Media Investment (Holdings) Limited, an investment holding company, provides satellite television broadcasting services in the People's Republic of China and internationally. The company operates in five segments: Television Broadcasting, Internet Media, Outdoor Media, Real Estate, and Other Activities. The Television Broadcasting segment engages in broadcasting television programs and commercials; and provision of promotion activities through the operation of Phoenix Chinese and Phoenix InfoNews channels, as well as Phoenix Movies, Phoenix North America Chinese, Phoenix Chinese News and Entertainment, Phoenix Hong Kong, and other channels. The Internet Media segment offers website portal and value-added telecommunication services. The Outdoor Media segment provides outdoor advertising services. The Real Estate segment is involved in the property development and investment activities. The Other Activities segment offers program production and ancillary services, merchandising services, magazine publication and distribution, and other related services. It also provides radio broadcasting; research and development; cultural development; software and games development; trademark and property holding; hotel management; publishing and distributing periodicals; technical and financial consulting; aircraft chartering; exhibition; data technology; technology promotion; programme production; mobile value-add; capital market; and management and related services. Phoenix Media Investment (Holdings) Limited was founded in 1996 and is headquartered in Tai Po, Hong Kong.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Tai Po"
    },
    "TBCN.F": {
        "short_name": "TELEVISION BROAD. (BL100)",
        "long_name": "Television Broadcasts Limited",
        "summary": "Television Broadcasts Limited, together with its subsidiaries, engages in terrestrial television broadcasting, program production, and other television-related activities. It operates through Hong Kong TV Broadcasting, myTV SUPER, Big Big Channel Business, Programme Licensing and Distribution, Overseas pay TV and TVB Anywhere, and Other Activities segments. The Hong Kong TV Broadcasting segment is involved in the broadcasting of television programs and commercials on terrestrial TV platforms; production of programs; and co-production of dramas. The myTV SUPER segment provides over-the-top services; and operates website portals. The Big Big Channel Business segment operates an online social media and e-commerce platform; and provides music entertainment, event, and marketing services. The Programme Licensing and Distribution segment distributes television programs and channels to telecast, video, and media operators. The Overseas pay TV and TVB Anywhere segment offers pay television and OTT services to subscribers. The Other Activities segment engages in property investment and other activities. The company also offers agency services on design, production, and exhibition of advertisements; film rights and program licensing; provides consultancy, management, and agency services to artistes; and produces, publishes, and licenses musical works and sells sound recordings, as well as offers corporate finance services. In addition, it produces motion pictures for theatrical release and distribution; provides satellite and subscription television programs; and licenses and distributes films. Further, the company engages in production of programs and provision of marketing materials; and provision of programming and channel services. It operates in Hong Kong, Mainland China, Malaysia, Singapore, the United States, Canada, Vietnam, Australia, Europe, and internationally. The company was founded in 1967 and is headquartered in Kowloon, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Kowloon"
    },
    "TVBCY": {
        "short_name": "TELEVISION BROADCASTS",
        "long_name": "Television Broadcasts Limited",
        "summary": "Television Broadcasts Limited, together with its subsidiaries, engages in terrestrial television broadcasting, program production, and other television-related activities. It operates through Hong Kong TV Broadcasting, myTV SUPER, Big Big Channel Business, Programme Licensing and Distribution, Overseas pay TV and TVB Anywhere, and Other Activities segments. The Hong Kong TV Broadcasting segment is involved in the broadcasting of television programs and commercials on terrestrial TV platforms; production of programs; and co-production of dramas. The myTV SUPER segment provides over-the-top services; and operates website portals. The Big Big Channel Business segment operates an online social media and e-commerce platform; and provides music entertainment, event, and marketing services. The Programme Licensing and Distribution segment distributes television programs and channels to telecast, video, and media operators. The Overseas pay TV and TVB Anywhere segment offers pay television and OTT services to subscribers. The Other Activities segment engages in property investment and other activities. The company also offers agency services on design, production, and exhibition of advertisements; film rights and program licensing; provides consultancy, management, and agency services to artistes; and produces, publishes, and licenses musical works and sells sound recordings, as well as offers corporate finance services. In addition, it produces motion pictures for theatrical release and distribution; provides satellite and subscription television programs; and licenses and distributes films. Further, the company engages in production of programs and provision of marketing materials; and provision of programming and channel services. It operates in Hong Kong, Mainland China, Malaysia, Singapore, the United States, Canada, Vietnam, Australia, Europe, and internationally. The company was founded in 1967 and is headquartered in Kowloon, Hong Kong.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Broadcasting",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Kowloon"
    }
}