{
    "0547.HK": {
        "short_name": "DIGITAL DOMAIN",
        "long_name": "Digital Domain Holdings Limited",
        "summary": "Digital Domain Holdings Limited, an investment holding company, engages in the media entertainment business in Hong Kong, the People's Republic of China, the United States, Canada, the United Kingdom, and internationally. The company offers augmented reality (AR), immersive reality, and virtual reality (VR) technology services using 360 degree digital capture technology and computer graphics (CG); and researches, develops, and sells VR and AR, hardware, smart wearable devices, VR software development kits, and other related products. It also provides visual effects (VFX) production and post-production services, such as visualization, previsualization, post-visualization, CG, animation, motion capture, virtual production, and design for various motion picture studios, networks, streaming services, advertisers, brands, and games. In addition, the company offers VFX production and post-production services for commercials, TV drama series, and feature films comprising offline and online editing, compositing, color grading, design, music and audio, and CG and VFX production, as well as production services for the making of commercials, VR/360 degree videos, and feature films. Further, it researches and develops virtual human technology; co-produces feature films and episodes series; invests in real estate properties; provides management, consultancy, trading, and securities investment services, as well as virtual reality content services; researches and develops software; and manages intellectual property licenses and trademarks. The company was formerly known as Sun Innovation Holdings Limited and changed its name to Digital Domain Holdings Limited in December 2013. Digital Domain Holdings Limited was incorporated in 1992 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.digitaldomain.com",
        "market_cap": "Small Cap"
    },
    "0571.HK": {
        "short_name": "ESUN HOLDINGS",
        "long_name": "eSun Holdings Limited",
        "summary": "eSun Holdings Limited, an investment holding company, primarily operates in the media and entertainment industry in Hong Kong, Mainland China, and internationally. The company's Media and Entertainment segment invests in and produces entertainment events, as well as provides related adverting and artiste management services; sells and distributes albums; licenses music; and trades gaming products. Its Film Production and Distribution segment invests in, produces, sells, and distributes television programs and films, as well as provides advertising related services; and distributes video format products. The company's Cinema Operation segment operates cinemas. eSun Holdings Limited provides consultancy services for cultural, entertainment, and live performance projects; and management, performance agency, and video duplication services. It also translates and subtitles television programs; licenses film products and rights; and produces, publishes, and distributes music. The company operates 11 cinemas in Hong Kong, and 3 cinemas in Mainland China. eSun Holdings Limited was founded in 1947 and is headquartered in Central, Hong Kong. eSun Holdings Limited is a subsidiary of Lai Sun Development Company Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.esun.com/esun-holdings/en-US/Pages/home",
        "market_cap": "Micro Cap"
    },
    "1003.HK": {
        "short_name": "HUANXI MEDIA",
        "long_name": "Huanxi Media Group Limited",
        "summary": "Huanxi Media Group Limited, an investment holding company, engages in the media and entertainment, and related businesses in the People's Republic of China. The company develops and/or invests in films and television drama series; and provides property agency, project consulting, and related services. It also develops an online streaming platform; and offers securities trading and investment, as well as Internet audio-visual programs services. The company was formerly known as 21 Holdings Limited and changed its name to Huanxi Media Group Limited in October 2015. Huanxi Media Group Limited is headquartered in Admiralty, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.huanximedia.com",
        "market_cap": "Small Cap"
    },
    "1060.HK": {
        "short_name": "ALI PICTURES",
        "long_name": "Alibaba Pictures Group Limited",
        "summary": "Alibaba Pictures Group Limited, an investment holding company, operates an Internet-driven integrated platform primarily in the People's Republic of China. The company operates through three segments: Internet-Based Promotion and Distribution, Content Production, and Integrated Development. Its platform covers content production, promotion and distribution, intellectual property licensing and integrated management, cinema ticketing management, and data services for the entertainment industry. The company is also involved in the production of broadcasting and television programs; exchanging and planning of screen-based cultural and art events; and films and TV copyrights investment, production, and distribution, as well as performance brokerage activities. In addition, it engages in the organization of cultural and art exchange events; design, production, agency sale, and release of advertisements; development, consultation, service, and transfer of network technologies; and software production activities. Further, the company offers technical-promotion, computer system, and software design services; advertises and sells entertainment related merchandise and derivatives; constructs, operates, and manages cinemas; manages and leases commercial facilities; and sells and leases audio and visual, cultural, and entertainment facilities. Additionally, it is involved in the provision of talent and ticketing agency, investment management and consultancy, exhibition, Internet information, and marketing services; and industrial investment and e-commerce activities. The company was formerly known as ChinaVision Media Group Limited and changed its name to Alibaba Pictures Group Limited in June 2014. Alibaba Pictures Group Limited is headquartered in Causeway Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.alibabapictures.com",
        "market_cap": "Mid Cap"
    },
    "1159.HK": {
        "short_name": "STARLIGHT CUL",
        "long_name": "Starlight Culture Entertainment Group Limited",
        "summary": "Starlight Culture Entertainment Group Limited, an investment holding company, engages in the media and culture business in the United States, Mainland China, Australia, and Panama. The company operates through three segments: Media and Culture Business; Entertainment and Gaming Business; and Chemical Products, and Energy Conservation and Environmental Protection Products. The Media and Culture Business segment engages in the investment, production, and distribution of entertainment content, such as films and television series. The Entertainment and gaming business segment provides casino entertainment and gaming promotion services. The Chemical products, and Energy Conservation and Environmental Protection Products segment trades in the chemical products, and energy conservation and environmental protection products. The company was formerly known as Jimei International Entertainment Group Limited and changed its name to Starlight Culture Entertainment Group Limited in August 2017. Starlight Culture Entertainment Group Limited is headquartered in Hong Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.starlightcul.com.hk",
        "market_cap": "Micro Cap"
    },
    "1326.HK": {
        "short_name": "TRANSMIT ENT",
        "long_name": "Transmit Entertainment Limited",
        "summary": "Transmit Entertainment Limited, an investment holding company, operates as a media and entertainment company in the Hong Kong, Macau, the People's republic of China, South East Asia region, and internationally. The company operates through four segments: Film and TV series Production and Distribution; Film Exhibition; Post-Production; and Advertising and Marketing. The company is involved in the production of Chinese films and TV series; and operation of five Hong Kong based cinemas, one Mainland China based cinema, and one post-production company. It also distributes films and TV series; and offers film advertising and promotion services, and printed and digital media publication services. In addition, it offers cinema, screenwriter, artiste, and director management; and Internet celebrity agency services, as well as engages in the e-commerce business. The company was formerly known as Pegasus Entertainment Holdings Limited and changed its name to Transmit Entertainment Limited in February 2018. The company was founded in 2009 and is headquartered in Wanchai, Hong Kong. Transmit Entertainment Limited is a subsidiary of Nice Rich Group Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.transmit-ent.com",
        "market_cap": "Nano Cap"
    },
    "1566.HK": {
        "short_name": "CA CULTURAL",
        "long_name": "CA Cultural Technology Group Limited",
        "summary": "CA Cultural Technology Group Limited, an investment holding company, engages in the sales of animation derivative products, establishment and operation of indoor theme parks, and multimedia animation entertainment businesses in the People's Republic of China, Japan, Hong Kong, and Cambodia. It offers animation derivative products, including plastic toys, such as animation figures; fine toys comprising popcorn cases; and provides advisory on quality control and product design. The company also owns IPs, such as The King of Tibetan Antelope, Project Egg, Animal Conference on the Environment, HanBaGui, Violet; virtual reality (VR) games, and online games. In addition, it operates indoor amusement parks and VR theme parks under the CA SEGA JOYPOLIS brand. The company was formerly known as China Animation Characters Company Limited and changed its name to CA Cultural Technology Group Limited in January 2020. The company was incorporated in 2013 and is based in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.animatechina.com",
        "market_cap": "Small Cap"
    },
    "1740.HK": {
        "short_name": "VALUES CULTURAL",
        "long_name": "Values Cultural Investment Limited",
        "summary": "Values Cultural Investment Limited, an investment holding company, engages in the production, distribution, and licensing of broadcasting rights of television (TV) and Web series in Mainland China. The company produces, licenses, and distributes various TV series covering a range of genres for TV stations companies that are engaged in the business of distribution of TV series, executive producers, and copyright owners of the TV series. It also invests in TV series as a non-executive producer. The company was founded in 2013 and is headquartered in Tsuen Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsuen Wan",
        "zipcode": null,
        "website": "http://www.yuanshimedia.com",
        "market_cap": "Nano Cap"
    },
    "2230.HK": {
        "short_name": "MEDIALINK GROUP",
        "long_name": "Medialink Group Limited",
        "summary": "Medialink Group Limited distributes third-party owned media content primarily in Mainland China, Hong Kong, the United States, Japan, Taiwan, the United Kingdom, Thailand, France, Philippines, and internationally. The company operates in two segments, Media Content Distribution and Brand Licensing. The Media Content Distribution segment distributes media content acquired from media content licensors, which include content relating to animation series, variety shows, drama series, animated and live-action feature films. and other video content. The Brand Licensing segment is involved in licensing and sub-licensing various rights in relation to brands owned by brand licensors comprising merchandising rights for use in the toys, apparels and footwear, health and beauty products, and food and beverage; location-based entertainment rights for events, theme parks, shopping malls, cafes, and restaurants; and brand collaboration rights for promotion campaigns and activities. It also invests in media content production. The company was founded in 2000 and is headquartered in Tsim Sha Tsui East, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.medialink.com.hk",
        "market_cap": "Micro Cap"
    },
    "8172.HK": {
        "short_name": "LAJIN ENT",
        "long_name": "Lajin Entertainment Network Group Limited",
        "summary": "Lajin Entertainment Network Group Limited, an investment holding company, provides movies, TV program, and internet contents services in Mainland China. The company operates through three segments: Artiste Management; Movies, TV Programmes and Internet Contents; and New Media E-Commerce. It is also involved in the investment, production, and distribution of movies and TV programs; investment in Internet contents; and promotion and demonstration through live video on the website, as well as digital technology business. In addition, the company engages in the business of cultural and entertainment media contents, as well as sourcing and production of media contents. The company was formerly known as China Star Cultural Media Group Limited and changed its name to Lajin Entertainment Network Group Limited in August 2015. Lajin Entertainment Network Group Limited was incorporated in 2001 and is headquartered in Admiralty, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": null,
        "market_cap": "Micro Cap"
    },
    "8220.HK": {
        "short_name": "BINGO GROUP",
        "long_name": "Bingo Group Holdings Limited",
        "summary": "Bingo Group Holdings Limited, an investment holding company, engages in the cinema investment and management business in the People's Republic of China and internationally. The company operates through two segments, Cinema Investment and Management; and Filmed Entertainment, New Media Exploitations and Licensing Businesses. It engages in movie production; licensing and derivatives; crossover marketing; the provision of interactive contents; artist development; last miles engagement; and cartoon and movie production activities. The company is headquartered in Hong Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.bingogroup.com.hk",
        "market_cap": "Nano Cap"
    },
    "8446.HK": {
        "short_name": "ITP HOLDINGS",
        "long_name": "In Technical Productions Holdings Limited",
        "summary": "In Technical Productions Holdings Limited, an investment holding company, provides visual display solutions for concerts and events in Hong Kong, Macau, the People's Republic of China, Taiwan, and internationally. It rents LED panels, projectors, video control units, and other equipment; and offers stage design and equipment installation services. The company is also involved in the import, export, and wholesale of video equipment and parts, as well as provides related support services. In Technical Productions Holdings Limited was founded in 2009 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.intechproductions.com",
        "market_cap": "Nano Cap"
    },
    "CBW.F": {
        "short_name": "ALIBABA PICTURES GR.HD-25",
        "long_name": "Alibaba Pictures Group Limited",
        "summary": "Alibaba Pictures Group Limited, an investment holding company, operates an Internet-driven integrated platform primarily in the People's Republic of China. The company operates through three segments: Internet-Based Promotion and Distribution, Content Production, and Integrated Development. Its platform covers content production, promotion and distribution, intellectual property licensing and integrated management, cinema ticketing management, and data services for the entertainment industry. The company is also involved in the production of broadcasting and television programs; exchanging and planning of screen-based cultural and art events; and films and TV copyrights investment, production, and distribution, as well as performance brokerage activities. In addition, it engages in the organization of cultural and art exchange events; design, production, agency sale, and release of advertisements; development, consultation, service, and transfer of network technologies; and software production activities. Further, the company offers technical-promotion, computer system, and software design services; advertises and sells entertainment related merchandise and derivatives; constructs, operates, and manages cinemas; manages and leases commercial facilities; and sells and leases audio and visual, cultural, and entertainment facilities. Additionally, it is involved in the provision of talent and ticketing agency, investment management and consultancy, exhibition, Internet information, and marketing services; and industrial investment and e-commerce activities. The company was formerly known as ChinaVision Media Group Limited and changed its name to Alibaba Pictures Group Limited in June 2014. Alibaba Pictures Group Limited is headquartered in Causeway Bay, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.alibabapictures.com",
        "market_cap": "Mid Cap"
    },
    "CQSN.F": {
        "short_name": "CHINA STAR ENTERT. HD-,01",
        "long_name": "China Star Entertainment Limited",
        "summary": "China Star Entertainment Limited, an investment holding company, engages in the investment, production, distribution, and licensing of films and television drama series in Hong Kong, Macau, the People's Republic of China, and internationally. The company operates through three segments: Film Related Business Operations; Property Development and Investment Operations; and Restaurant Operations. It is also involved in the provision of other film related services, including artist management services; and investment and development of properties, as well as provision of catering services through a restaurant under the Obba Bar brand. In addition, the company offers corporate planning, props and equipment rental, and dramatic creation; art piece investment and rental; property and construction project management; motion pictures and video rights distribution; film production controlling, direction, and producing; nominee; and song rights, trademarks, and copyrights holding and licensing services. Further, it provides agency and management services, as well as holds cable rights. China Star Entertainment Limited is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "EIH.F": {
        "short_name": "CA CULTURAL TECH.GR.HD-10",
        "long_name": "CA Cultural Technology Group Limited",
        "summary": "CA Cultural Technology Group Limited, an investment holding company, engages in the sales of animation derivative products, establishment and operation of indoor theme parks, and multimedia animation entertainment businesses in the People's Republic of China, Japan, Hong Kong, and Cambodia. It offers animation derivative products, including plastic toys, such as animation figures; fine toys comprising popcorn cases; and provides advisory on quality control and product design. The company also owns IPs, such as The King of Tibetan Antelope, Project Egg, Animal Conference on the Environment, HanBaGui, Violet; virtual reality (VR) games, and online games. In addition, it operates indoor amusement parks and VR theme parks under the CA SEGA JOYPOLIS brand. The company was formerly known as China Animation Characters Company Limited and changed its name to CA Cultural Technology Group Limited in January 2020. The company was incorporated in 2013 and is based in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.animatechina.com",
        "market_cap": "Small Cap"
    },
    "IB5A.F": {
        "short_name": "I-CABLE COMMNCTNS",
        "long_name": "i-CABLE Communications Limited",
        "summary": "i-CABLE Communications Limited, an investment holding company, provides integrated communications services in Hong Kong. The company operates through Media, and Telecommunications segments. Its Media segment offers television subscription, domestic free television program, advertising, channel carriage, television relay, program licensing, theatrical release, and other related services. The company's Telecommunications segment includes operations related to broadband internet access, portal operations, and mobile content licensing; and telephony, network leasing, network construction, and mobile agency services, as well as other related businesses. It owns and operates wireline telecommunications network, which provides media and telecommunications services to approximately two million households. The company also produces television and multimedia content focusing on news, information, sports, and entertainment. In addition, it provides technical services; and film production, distribution, and licensing services. The company was incorporated in 1999 and is based in Tsuen Wan, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsuen Wan",
        "zipcode": null,
        "website": "http://www.i-cablecomm.com",
        "market_cap": "Micro Cap"
    },
    "ICABY": {
        "short_name": "I-CABLE COMMUNICATIONS",
        "long_name": "i-CABLE Communications Limited",
        "summary": "i-CABLE Communications Limited, an investment holding company, provides integrated communications services in Hong Kong. The company operates through Media, and Telecommunications segments. Its Media segment offers television subscription, domestic free television program, advertising, channel carriage, television relay, program licensing, theatrical release, and other related services. The company's Telecommunications segment includes operations related to broadband internet access, portal operations, and mobile content licensing; and telephony, network leasing, network construction, and mobile agency services, as well as other related businesses. It owns and operates wireline telecommunications network, which provides media and telecommunications services to approximately two million households. The company also produces television and multimedia content focusing on news, information, sports, and entertainment. In addition, it provides technical services; and film production, distribution, and licensing services. The company was incorporated in 1999 and is based in Tsuen Wan, Hong Kong.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsuen Wan",
        "zipcode": null,
        "website": "http://www.i-cablecomm.com",
        "market_cap": "Micro Cap"
    },
    "LDSN": {
        "short_name": "LUDUSON G INC",
        "long_name": "Luduson G Inc.",
        "summary": "Luduson G Inc., a gaming technology company, provides events marketing strategies with digital interactive solutions and content production services in Hong Kong. The company operates in two segments, Digital Marketing and Entertainment. It develops right-to-use digital entertainment solutions; interactive game software; and provides system development consultancy and maintenance services to customers and interactive games installations in shopping mall events, exhibitions, and brand promotions. The company also offer customized device box with a library of self-developed interactive game contents, such as sport-themed social games; motion-sensing action games; logic and puzzle games; original IP characters education game for children, etc. In addition, the company provides event planning services. Luduson G Inc. is based in Wan Chai, Hong Kong.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.luduson.com",
        "market_cap": "Small Cap"
    }
}