{
    "0008.HK": {
        "short_name": "PCCW",
        "long_name": "PCCW Limited",
        "summary": "PCCW Limited provides telecommunications and related services in Hong Kong, Mainland and other parts of China, Japan, and internationally. The company's services include local telephony, local data and broadband, mobile and international telecommunications, and satellite-based and network-based telecommunications services; and outsourcing, consulting, and contact center services. It also provides technical support, electronics and communications engineering, and products and solutions, as well as free television, pay television program, and interactive multimedia services; sells advertising in various telephone directories and on the Internet; publishes directories; and sells mobile handsets and accessories. In addition, the company offers broadcasting and related services, management and engineering support services, customer relationship management and customer contact management solutions, content for various media, outsourced call center, and data center services; and over-the-top video services under the Viu brand, as well as sells customer premises equipment and related solutions. Further, it engages in the sale, distribution, and marketing of telecommunication products; supply of broadband internet access solutions and web services; provision of data services; and software development, systems integration, consulting, and informatization activities; the provision of computer and IP/IT related value-added services to business customers; property investment, development, management, and leasing, as well as hotel management activities; and ski operations. Additionally, the company offers digital, IT and business process outsourcing, cloud computing, hosting, managed, e-commerce, and IoT solutions. PCCW Limited was founded in 1925 and is headquartered in Quarry Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.pccw.com",
        "market_cap": "Large Cap"
    },
    "0215.HK": {
        "short_name": "HUTCHTEL HK",
        "long_name": "Hutchison Telecommunications Hong Kong Holdings Limited",
        "summary": "Hutchison Telecommunications Hong Kong Holdings Limited, an investment holding company, provides mobile communication services. It offers provides 5G, 4G long term evolution, 3G, and GSM dual-band mobile telecommunications under the 3 brand. The company also provides mobile telecommunications services and products include local voice, SMS, MMS, international direct dialing, and international roaming; and data services and applications, such as direct carrier billing offerings, mobile device security management, eBooks, music downloads, movies-on-demand, mobile social networking applications, and FinTech, as well as Wi-Fi and other value-added services. In addition, the company is involved in the provision of marketing, advertising, and promotional services; and telecommunications retail operations. As of December 31, 2020, it served approximately 3.3 million customers in Hong Kong and Macau. The company was incorporated in 2007 and is headquartered in Central, Hong Kong. Hutchison Telecommunications Hong Kong Holdings Limited is a subsidiary of CK Hutchison Holdings Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hthkh.com",
        "market_cap": "Mid Cap"
    },
    "0315.HK": {
        "short_name": "SMARTONE TELE",
        "long_name": "SmarTone Telecommunications Holdings Limited",
        "summary": "SmarTone Telecommunications Holdings Limited, an investment holding company, provides telecommunication services in Hong Kong and Macau. The company offers voice, multimedia, and mobile and fixed fiber broadband services for the consumer and corporate markets. It is also involved in the sale of handsets and accessories; issuance of guaranteed notes; and provision of customer support and telemarketing services. The company was founded in 1992 and is headquartered in Kwun Tong, Hong Kong. SmarTone Telecommunications Holdings Limited is a subsidiary of Sun Hung Kai Properties Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.smartoneholdings.com",
        "market_cap": "Mid Cap"
    },
    "0762.HK": {
        "short_name": "CHINA UNICOM",
        "long_name": "China Unicom (Hong Kong) Limited",
        "summary": "China Unicom (Hong Kong) Limited, an investment holding company, provides cellular and fixed-line voice, and related value-added services in the People's Republic of China. It also provides broadband and other Internet-related, information communications technology, and business and data communications services. In addition, the company offers communications technology training, technical, and Internet information and value-added telecommunications services; telecommunications network construction, planning, and technical consulting services; and consultancy, survey, design, and contract services relating to information and construction projects. Further, it provides customer, project design consultation and monitoring, property management, e-payment, venture capital investment, communications technology development and promotion, auto informatization, financial, data processing, and tourism and information services; advertising design, production, agency, and publication services; technology development, transfer, and consulting services; and technology promotion service of intelligent transportation system's products. Additionally, the company offers technology development and consultation, and other services; technology research and development, consultation, and services of TV video and mobile video; internet of things technology, and online data processing and transaction services; and big data, and cloud computation and infrastructure services. It also provides online video and reading materials; network music; financing leasing; and data analysis, processing, and application services, as well as sells handsets and telecommunication equipment. It has approximately 270 million 4G and 5G subscribers, 86 million fixed-line broadband subscribers, and 47 million fixed-line local access subscribers. The company was incorporated in 2000 and is based in Central, Hong Kong. China Unicom (Hong Kong) Limited is a subsidiary of China Unicom (BVI) Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.chinaunicom.com.hk",
        "market_cap": "Large Cap"
    },
    "1310.HK": {
        "short_name": "HKBN",
        "long_name": "HKBN Ltd.",
        "summary": "HKBN Ltd., an investment holding company, provides fixed telecommunications network, international telecommunications, and mobile services to residential and enterprise customers primarily in Hong Kong. The company offers a range of information and communications technology services, such as broadband, Wi-Fi, mobile, data connectivity, cloud, data processing/center, information security, business continuity, and system integration services. It provides over-the-top entertainment, music streaming, administrative support services, enterprise systems development, technical services, and business referrals and consultancy services; e-business services; outsourcing; property investment; engages in the sale of various products and wholesale of computer software; and holding of licenses, as well as distributes email and related products. HKBN Ltd. was founded in 1992 and is headquartered in Kwai Chung, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.hkbn.net",
        "market_cap": "Large Cap"
    },
    "2HK.F": {
        "short_name": "HKBN LTD  HD -,0001",
        "long_name": "HKBN Ltd.",
        "summary": "HKBN Ltd., an investment holding company, provides fixed telecommunications network, international telecommunications, and mobile services to residential and enterprise customers primarily in Hong Kong. The company offers a range of information and communications technology services, such as broadband, Wi-Fi, mobile, data connectivity, cloud, data processing/center, information security, business continuity, and system integration services. It provides over-the-top entertainment, music streaming, administrative support services, enterprise systems development, technical services, and business referrals and consultancy services; e-business services; outsourcing; property investment; engages in the sale of various products and wholesale of computer software; and holding of licenses, as well as distributes email and related products. HKBN Ltd. was founded in 1992 and is headquartered in Kwai Chung, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.hkbn.net",
        "market_cap": "Small Cap"
    },
    "6823.HK": {
        "short_name": "HKT-SS",
        "long_name": "HKT Trust and HKT Limited",
        "summary": "HKT Trust and HKT Limited provides telecommunications services in Hong Kong, Mainland China, and internationally. It operates through Telecommunications Services, Mobile, Pay TV, and Other Businesses segments. The Telecommunications Services segment offers telecommunications and related services, including local telephony, local data and broadband, and international telecommunications, as well as enterprise solutions; and other telecommunications businesses, such as customer premises equipment sales, outsourcing, consulting, and contact centers. The Mobile segment provides mobile telecommunications services. The Pay TV segment offers interactive pay-TV services. The Other Businesses segment provides financial services, such as mobile payment, merchant services, O2O solutions, and a mobile financing platform; and The Club, a loyalty program. The company also offers 5G, cloud computing, Internet of Things, and artificial intelligence solutions to enterprises; web services; network-based telecommunications and satellite-based services; outsourced call center services; customer and consultancy services; customer relationship and customer contact management solutions and services; telecommunications call center services; and insurance and reinsurance services. In addition, it provides system integration, software development, and technical consultancy services; and sells mobile handsets and accessories, as well as telecommunication products and services. The company was incorporated in 2011 and is headquartered in Quarry Bay, Hong Kong. HKT Trust and HKT Limited is a subsidiary of PCCW Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.hkt.com",
        "market_cap": "Large Cap"
    },
    "8167.HK": {
        "short_name": "NEO TELEMEDIA",
        "long_name": "Neo Telemedia Limited",
        "summary": "Neo Telemedia Limited, an investment holding company, engages in the sale of telecommunication products and services in the People's Republic of China and other Asian countries. It operates through Provision of Data Centre Services; and Trading of Telecommunication Products segments. The company offers data center services to its customers through self-developed data centers and server cabinets leased from third parties; and Internet of Things (IoT) products, such as IoT data transfer units, smart locks, smart cloud locks, and communication application ICs, as well as IC solutions, IoT management platforms, and IoT applications. It also engages in the internet finance platform business; provision of bus services, system integration, insurance brokerage, and software development services; leasing of properties; and operation of commercial WIFI platform. The company was formerly known as Big Media Group Limited and changed its name to Neo Telemedia Limited in November 2009. Neo Telemedia Limited is headquartered in Tsim Sha Tsui, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.neo-telemedia.com",
        "market_cap": "Small Cap"
    },
    "8337.HK": {
        "short_name": "DIRECTEL",
        "long_name": "Directel Holdings Limited",
        "summary": "Directel Holdings Limited, a mobile virtual network operator, provides mobile telecommunication and value-added services in Hong Kong, Mainland China, and Singapore. The company operates through two segments, Telecommunications Services and Distribution Business. It is involved in distributing mobile phones and electronic products; trading airtime and mobile data sourced from various mobile network operators; and selling airtime and mobile data to dealers and users. The company also offers telesales dealership and other services; and SIM cards. Directel Holdings Limited was incorporated in 2009 and is headquartered in Hong Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.directel.hk",
        "market_cap": "Small Cap"
    },
    "ASEJF": {
        "short_name": "APT SATELLITE HLDG",
        "long_name": "APT Satellite Holdings Limited",
        "summary": "APT Satellite Holdings Limited, an investment holding company, maintains, operates, and provides satellite transponder capacity and related services, satellite-based broadcasting and telecommunications services, and other services. It offers a range of C-band and Ku-band transponder leasing services to its broadcast and telecommunication customers; satellite TV broadcasting and uplink services; and teleport and network services, including hub-based and single channel per carrier services. The company also provides data center services that comprise rack leasing, server and equipment hosting, cloud management, IP gateway transit, and customized managed services; offers OTT services; and holds rights on the licensing of Chinese TV channel content and 25 TV channels of APT Satellite packages. It operates in-orbit satellites consisting of APSTAR-5C, APSTAR-6C, APSTAR-7, and APSTAR-9 in Asia, Australia, the Middle East, Africa, Europe, and the Pacific region. In addition, the company engages in property holding activities; and the provision of management and project management consultancy services. The company was founded in 1992 and is headquartered in Tai Po, Hong Kong. APT Satellite Holdings Limited is a subsidiary of APT Satellite International Company Limited.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tai Po",
        "zipcode": null,
        "website": "http://www.apstar.com",
        "market_cap": "Small Cap"
    },
    "AY8.SG": {
        "short_name": "APT SATELLITE HOLDINGS LTD. Reg",
        "long_name": "APT Satellite Holdings Limited",
        "summary": "APT Satellite Holdings Limited, an investment holding company, maintains, operates, and provides satellite transponder capacity and related services, satellite-based broadcasting and telecommunications services, and other services. It offers a range of C-band and Ku-band transponder leasing services to its broadcast and telecommunication customers; satellite TV broadcasting and uplink services; and teleport and network services, including hub-based and single channel per carrier services. The company also provides data center services that comprise rack leasing, server and equipment hosting, cloud management, IP gateway transit, and customized managed services; offers OTT services; and holds rights on the licensing of Chinese TV channel content and 25 TV channels of APT Satellite packages. It operates in-orbit satellites consisting of APSTAR-5C, APSTAR-6C, APSTAR-7, and APSTAR-9 in Asia, Australia, the Middle East, Africa, Europe, and the Pacific region. In addition, the company engages in property holding activities; and the provision of management and project management consultancy services. The company was founded in 1992 and is headquartered in Tai Po, Hong Kong. APT Satellite Holdings Limited is a subsidiary of APT Satellite International Company Limited.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tai Po",
        "zipcode": null,
        "website": "http://www.apstar.com",
        "market_cap": "Small Cap"
    },
    "B7O.F": {
        "short_name": "CITIC TELECOM INTL.HLDGS.",
        "long_name": "CITIC Telecom International Holdings Limited",
        "summary": "CITIC Telecom International Holdings Limited, an investment holding company, provides telecommunications services worldwide. The company provides carrier services, such as mobile roaming signaling SCCP, single IMSI multiple number, pre-paid roaming, mobile virtual network enabler, GMVNO, USSD, IP network solutions, and SMS firewall; Internet services; and international voice services, including voice hubbing service in handling roaming service for mobile and fixed line operators and data roaming services for mobile operators; SMS services; datamall; big data; and Internet of Things services. It also offers enterprise solutions, including network connectivity, data center, cloud computing, information security, enterprise mobile services, and voice and information services; and Internet-based communication services, such as Communication Platform as a Service for handset manufacturers and OTT operators. In addition, the company builds the infrastructure and applications of Digital Macau; and provides communications services for local airports, entertainment facilities, and events, such as the Macau Grand Prix, as well as offers local and roaming communications services to individual customers. Further, it offers mobile services, which includes, local 4G, roaming, greater bay, and OOT TV services; local and international fixed line telephone; sales of headsets; and WIFI hotspots and home broadband services. The company was formerly known as CITIC 1616 Holdings Limited and changed its name to CITIC Telecom International Holdings Limited in 2010. CITIC Telecom International Holdings Limited was incorporated in 1997 and is headquartered in Kwai Chung, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.citictel.com",
        "market_cap": "Small Cap"
    },
    "CTM.F": {
        "short_name": "CHINA MOBILE LTD.",
        "long_name": "China Mobile Limited",
        "summary": "China Mobile Limited provides telecommunications services in Mainland China and Hong Kong. Its businesses primarily consist of mobile voice and data business, wireline broadband, and other information and communications services. As of December 31, 2020, the company served a total of 942 million mobile customers and 210 million wireline broadband customers. It also offers telecommunications network planning, design, and consulting services; roaming clearance, IT system operation, and technology support services; value-added platform development and maintenance services; mobile data, and system integration and development services; network construction and maintenance, network planning and optimizing, and training services; non-banking financial services; and electronic communication products design services, as well as sells related products. In addition, the company provides mobile cloud research and development services; call center services; e-payment, e-commerce, and Internet finance services; and mobile Internet digital content services, as well as operates a network and business coordination center. The company was formerly known as China Mobile (Hong Kong) Limited and changed its name to China Mobile Limited in May 2006. The company was incorporated in 1997 and is based in Central, Hong Kong. China Mobile Limited is a subsidiary of China Mobile Hong Kong (BVI) Limited.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.chinamobileltd.com",
        "market_cap": "Large Cap"
    },
    "HKTTF": {
        "short_name": "HKT TRUST AND HKT LTD",
        "long_name": "HKT Trust and HKT Limited",
        "summary": "HKT Trust and HKT Limited provides telecommunications services in Hong Kong, Mainland China, and internationally. It operates through Telecommunications Services, Mobile, Pay TV, and Other Businesses segments. The Telecommunications Services segment offers telecommunications and related services, including local telephony, local data and broadband, and international telecommunications, as well as enterprise solutions; and other telecommunications businesses, such as customer premises equipment sales, outsourcing, consulting, and contact centers. The Mobile segment provides mobile telecommunications services. The Pay TV segment offers interactive pay-TV services. The Other Businesses segment provides financial services, such as mobile payment, merchant services, O2O solutions, and a mobile financing platform; and The Club, a loyalty program. The company also offers 5G, cloud computing, Internet of Things, and artificial intelligence solutions to enterprises; web services; network-based telecommunications and satellite-based services; outsourced call center services; customer and consultancy services; customer relationship and customer contact management solutions and services; telecommunications call center services; and insurance and reinsurance services. In addition, it provides system integration, software development, and technical consultancy services; and sells mobile handsets and accessories, as well as telecommunication products and services. The company was incorporated in 2011 and is headquartered in Quarry Bay, Hong Kong. HKT Trust and HKT Limited is a subsidiary of PCCW Limited.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.hkt.com",
        "market_cap": "Large Cap"
    },
    "HKTTY": {
        "short_name": "HKT TRUST AND HKT LTD",
        "long_name": "HKT Trust and HKT Limited",
        "summary": "HKT Trust and HKT Limited provides telecommunications services in Hong Kong, Mainland China, and internationally. It operates through Telecommunications Services, Mobile, Pay TV, and Other Businesses segments. The Telecommunications Services segment offers telecommunications and related services, including local telephony, local data and broadband, and international telecommunications, as well as enterprise solutions; and other telecommunications businesses, such as customer premises equipment sales, outsourcing, consulting, and contact centers. The Mobile segment provides mobile telecommunications services. The Pay TV segment offers interactive pay-TV services. The Other Businesses segment provides financial services, such as mobile payment, merchant services, O2O solutions, and a mobile financing platform; and The Club, a loyalty program. The company also offers 5G, cloud computing, Internet of Things, and artificial intelligence solutions to enterprises; web services; network-based telecommunications and satellite-based services; outsourced call center services; customer and consultancy services; customer relationship and customer contact management solutions and services; telecommunications call center services; and insurance and reinsurance services. In addition, it provides system integration, software development, and technical consultancy services; and sells mobile handsets and accessories, as well as telecommunication products and services. The company was incorporated in 2011 and is headquartered in Quarry Bay, Hong Kong. HKT Trust and HKT Limited is a subsidiary of PCCW Limited.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.hkt.com",
        "market_cap": "Large Cap"
    },
    "HTCTF": {
        "short_name": "HUTCHISON TELECOMMUNICATIONS HK",
        "long_name": "Hutchison Telecommunications Hong Kong Holdings Limited",
        "summary": "Hutchison Telecommunications Hong Kong Holdings Limited, an investment holding company, provides mobile communication services. It offers provides 5G, 4G long term evolution, 3G, and GSM dual-band mobile telecommunications under the 3 brand. The company also provides mobile telecommunications services and products include local voice, SMS, MMS, international direct dialing, and international roaming; and data services and applications, such as direct carrier billing offerings, mobile device security management, eBooks, music downloads, movies-on-demand, mobile social networking applications, and FinTech, as well as Wi-Fi and other value-added services. In addition, the company is involved in the provision of marketing, advertising, and promotional services; and telecommunications retail operations. As of December 31, 2020, it served approximately 3.3 million customers in Hong Kong and Macau. The company was incorporated in 2007 and is headquartered in Central, Hong Kong. Hutchison Telecommunications Hong Kong Holdings Limited is a subsidiary of CK Hutchison Holdings Limited.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hthkh.com",
        "market_cap": "Small Cap"
    },
    "HUTCY": {
        "short_name": "HUTCHISON TELECOMMUNICATIONS HK",
        "long_name": "Hutchison Telecommunications Hong Kong Holdings Limited",
        "summary": "Hutchison Telecommunications Hong Kong Holdings Limited, an investment holding company, provides mobile communication services. It offers provides 5G, 4G long term evolution, 3G, and GSM dual-band mobile telecommunications under the 3 brand. The company also provides mobile telecommunications services and products include local voice, SMS, MMS, international direct dialing, and international roaming; and data services and applications, such as direct carrier billing offerings, mobile device security management, eBooks, music downloads, movies-on-demand, mobile social networking applications, and FinTech, as well as Wi-Fi and other value-added services. In addition, the company is involved in the provision of marketing, advertising, and promotional services; and telecommunications retail operations. As of December 31, 2020, it served approximately 3.3 million customers in Hong Kong and Macau. The company was incorporated in 2007 and is headquartered in Central, Hong Kong. Hutchison Telecommunications Hong Kong Holdings Limited is a subsidiary of CK Hutchison Holdings Limited.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hthkh.com",
        "market_cap": "Small Cap"
    },
    "PCCWY": {
        "short_name": "PCCW LIMITED",
        "long_name": "PCCW Limited",
        "summary": "PCCW Limited provides telecommunications and related services in Hong Kong, Mainland and other parts of China, Japan, and internationally. The company's services include local telephony, local data and broadband, mobile and international telecommunications, and satellite-based and network-based telecommunications services; and outsourcing, consulting, and contact center services. It also provides technical support, electronics and communications engineering, and products and solutions, as well as free television, pay television program, and interactive multimedia services; sells advertising in various telephone directories and on the Internet; publishes directories; and sells mobile handsets and accessories. In addition, the company offers broadcasting and related services, management and engineering support services, customer relationship management and customer contact management solutions, content for various media, outsourced call center, and data center services; and over-the-top video services under the Viu brand, as well as sells customer premises equipment and related solutions. Further, it engages in the sale, distribution, and marketing of telecommunication products; supply of broadband internet access solutions and web services; provision of data services; and software development, systems integration, consulting, and informatization activities; the provision of computer and IP/IT related value-added services to business customers; property investment, development, management, and leasing, as well as hotel management activities; and ski operations. Additionally, the company offers digital, IT and business process outsourcing, cloud computing, hosting, managed, e-commerce, and IoT solutions. PCCW Limited was founded in 1925 and is headquartered in Quarry Bay, Hong Kong.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.pccw.com",
        "market_cap": "Mid Cap"
    },
    "PCWLF": {
        "short_name": "PCCW LIMITED",
        "long_name": "PCCW Limited",
        "summary": "PCCW Limited provides telecommunications and related services in Hong Kong, Mainland and other parts of China, Japan, and internationally. The company's services include local telephony, local data and broadband, mobile and international telecommunications, and satellite-based and network-based telecommunications services; and outsourcing, consulting, and contact center services. It also provides technical support, electronics and communications engineering, and products and solutions, as well as free television, pay television program, and interactive multimedia services; sells advertising in various telephone directories and on the Internet; publishes directories; and sells mobile handsets and accessories. In addition, the company offers broadcasting and related services, management and engineering support services, customer relationship management and customer contact management solutions, content for various media, outsourced call center, and data center services; and over-the-top video services under the Viu brand, as well as sells customer premises equipment and related solutions. Further, it engages in the sale, distribution, and marketing of telecommunication products; supply of broadband internet access solutions and web services; provision of data services; and software development, systems integration, consulting, and informatization activities; the provision of computer and IP/IT related value-added services to business customers; property investment, development, management, and leasing, as well as hotel management activities; and ski operations. Additionally, the company offers digital, IT and business process outsourcing, cloud computing, hosting, managed, e-commerce, and IoT solutions. PCCW Limited was founded in 1925 and is headquartered in Quarry Bay, Hong Kong.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.pccw.com",
        "market_cap": "Mid Cap"
    },
    "SMA.F": {
        "short_name": "SMARTONE TEL.HLDGS HD-,10",
        "long_name": "SmarTone Telecommunications Holdings Limited",
        "summary": "SmarTone Telecommunications Holdings Limited, an investment holding company, provides telecommunication services in Hong Kong and Macau. The company offers voice, multimedia, and mobile and fixed fiber broadband services for the consumer and corporate markets. It is also involved in the sale of handsets and accessories; issuance of guaranteed notes; and provision of customer support and telemarketing services. The company was founded in 1992 and is headquartered in Kwun Tong, Hong Kong. SmarTone Telecommunications Holdings Limited is a subsidiary of Sun Hung Kai Properties Limited.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.smartoneholdings.com",
        "market_cap": "Small Cap"
    },
    "TH3B.F": {
        "short_name": "PCCW LTD CONS.",
        "long_name": "PCCW Limited",
        "summary": "PCCW Limited provides telecommunications and related services in Hong Kong, Mainland and other parts of China, Japan, and internationally. The company's services include local telephony, local data and broadband, mobile and international telecommunications, and satellite-based and network-based telecommunications services; and outsourcing, consulting, and contact center services. It also provides technical support, electronics and communications engineering, and products and solutions, as well as free television, pay television program, and interactive multimedia services; sells advertising in various telephone directories and on the Internet; publishes directories; and sells mobile handsets and accessories. In addition, the company offers broadcasting and related services, management and engineering support services, customer relationship management and customer contact management solutions, content for various media, outsourced call center, and data center services; and over-the-top video services under the Viu brand, as well as sells customer premises equipment and related solutions. Further, it engages in the sale, distribution, and marketing of telecommunication products; supply of broadband internet access solutions and web services; provision of data services; and software development, systems integration, consulting, and informatization activities; the provision of computer and IP/IT related value-added services to business customers; property investment, development, management, and leasing, as well as hotel management activities; and ski operations. Additionally, the company offers digital, IT and business process outsourcing, cloud computing, hosting, managed, e-commerce, and IoT solutions. PCCW Limited was founded in 1925 and is headquartered in Quarry Bay, Hong Kong.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.pccw.com",
        "market_cap": "Mid Cap"
    },
    "UCL": {
        "short_name": "uCloudlink Group Inc.",
        "long_name": "uCloudlink Group Inc.",
        "summary": "uCloudlink Group Inc. operates as a mobile data traffic sharing marketplace in the telecommunications industry. It provides uCloudlink 1.0, a model that focuses on cross-border travelers that need mobile data connectivity services in various countries; and operates portable Wi-Fi services under the Roamingman name in China and Malaysia, which provides global mobile data connectivity services, as well as offers GlocalMe portable Wi-Fi terminals and cloud SIM architecture for mobile virtual network operators (MVNOs), mobile network operators (MNOs), and portable Wi-Fi terminal rental companies. The company also offers uCloudlink 2.0, a model that provides mobile data connectivity services to local users through various MNOs; GlocalMe Inside, an implementation solutions for smartphones and other smart hardware products, which enables them to access its cloud SIM architecture and SIM card pool; and GlocalMe, a world phone series. In addition, it provides uCloudlink 3.0, including B2C retail, B2B2C wholesale, and platform-as-a-service/ software-as-a-service platform-based connectivity ecosystem. Further, the company provides IoT modules with GlocalMe Inside implementation to meet the demand for mobile data from various terminals, as well as provides integrated network solutions to its customers; SIM cards with prepaid data packages; and value added services, such as advertisement. Additionally, it's platform-as-a-service/ software-as-a-service offers modules, such as customer relationship management, operations and business support system, and SIM card enterprise resource planning and management. The company was incorporated in 2014 and is headquartered in Kowloon, Hong Kong.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.ucloudlink.com",
        "market_cap": "Small Cap"
    },
    "XCI.F": {
        "short_name": "CN UNICOM(HK)LTD.",
        "long_name": "China Unicom (Hong Kong) Limited",
        "summary": "China Unicom (Hong Kong) Limited, an investment holding company, provides cellular and fixed-line voice, and related value-added services in the People's Republic of China. It also provides broadband and other Internet-related, information communications technology, and business and data communications services. In addition, the company offers communications technology training, technical, and Internet information and value-added telecommunications services; telecommunications network construction, planning, and technical consulting services; and consultancy, survey, design, and contract services relating to information and construction projects. Further, it provides customer, project design consultation and monitoring, property management, e-payment, venture capital investment, communications technology development and promotion, auto informatization, financial, data processing, and tourism and information services; advertising design, production, agency, and publication services; technology development, transfer, and consulting services; and technology promotion service of intelligent transportation system's products. Additionally, the company offers technology development and consultation, and other services; technology research and development, consultation, and services of TV video and mobile video; internet of things technology, and online data processing and transaction services; and big data, and cloud computation and infrastructure services. It also provides online video and reading materials; network music; financing leasing; and data analysis, processing, and application services, as well as sells handsets and telecommunication equipment. It has approximately 270 million 4G and 5G subscribers, 86 million fixed-line broadband subscribers, and 47 million fixed-line local access subscribers. The company was incorporated in 2000 and is based in Central, Hong Kong. China Unicom (Hong Kong) Limited is a subsidiary of China Unicom (BVI) Limited.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.chinaunicom.com.hk",
        "market_cap": "Large Cap"
    },
    "ZCH.F": {
        "short_name": "CHINA TELECOM H  YC 1",
        "long_name": "China Telecom Corporation Limited",
        "summary": "China Telecom Corporation Limited, together with its subsidiaries, provides wireline and mobile telecommunications services primarily in the People's Republic of China. It offers wireline voice services, including local wireline telephone services and long distance wireline services; CDMA mobile voice services, such as local calls, domestic and international long distance calls, intra-provincial roaming, and inter-provincial and international roaming; wireline Internet access services comprising dial-up and broadband services; wireless Internet access services; and wireline, Internet, and mobile value-added services. The company also provides integrated information application services consisting of Best Tone information services; and information technology-based integrated solutions, such as system integration, outsourcing, special advisory, information application, knowledge, and software development services. In addition, it offers managed data services that include digital data network, frame relay, and asynchronous transfer mode services for government agencies, large corporations, and institutions; and leased line services, as well as sells, repairs, and maintains customer-end equipment. Further, the company provides international telecommunications services, including network, Internet access and transit, Internet data center, and mobile virtual network services in various countries, including the Asia Pacific, Europe, Africa, South America, and North America; and e-commerce, music production and related information, instant messenger, finance leasing, and capital and financial management services, as well as sells telecommunications terminals. As of December 31, 2020, it had approximately 351 million mobile subscribers; 159 million wireline broadband subscribers; and 108 million access lines in service. The company was incorporated in 2002 and is based in Wan Chai, Hong Kong. China Telecom Corporation Limited is a subsidiary of China Telecommunications Corporation.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.chinatelecom-h.com/en/global/home.php",
        "market_cap": "Large Cap"
    }
}