{
    "ULTRF": {
        "short_name": "ULTRAPETROL (BAHAMAS) LIMITED",
        "long_name": "Ultrapetrol (Bahamas) Limited",
        "summary": "Ultrapetrol (Bahamas) Limited, an industrial shipping company, provides marine transportation services in South America, Europe, Central America, North America, and Asia. The company operates in three segments: River Business, Offshore Supply Business, and Ocean Business. The River Business segment owns and operates dry and tanker barges, and push boats in the Hidrovia region of South America. Its dry barges transport agricultural and forestry products, iron ore, and other cargoes; and tanker barges carry petroleum products, vegetable oils, and other liquids. As of December 31, 2015, this segment had 681 barges with approximately 1.3 million dwt capacity; and 34 push boats. The Offshore Supply Business segment owns and operates vessels that provide logistical and transportation services for offshore petroleum exploration and production companies. It transports supplies, such as containerized equipment, drill casings, pipes, and heavy loads; fuel, water, drilling fluids, and bulk cement; and various other supplies to drilling rigs and platforms. This segment's fleet consisted of 13 platform supply vessels and 1 remotely operated vehicle. The Ocean Business segment owns and operates oceangoing vessels, which transports petroleum products, as well as a container line service in the Argentine cabotage trade. The company serves petroleum, agricultural, and mining companies. Ultrapetrol (Bahamas) Limited was founded in 1992 and is headquartered in Nassau, the Bahamas. Ultrapetrol (Bahamas) Limited is a subsidiary of Sparrow Capital Investments Ltd.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Bahamas",
        "state": null,
        "city": "Nassau",
        "zipcode": null,
        "website": "http://www.ultrapetrol.net",
        "market_cap": "Small Cap"
    }
}