{
    "AGROPHOS.NS": {
        "short_name": "AGRO PHOS INDIA LT",
        "long_name": "Agro Phos (India) Limited",
        "summary": "Agro Phos (India) Limited manufactures and sells fertilizers and agrochemical products in India. The company offers single super phosphate, nitrogen phosphate and potassium ferrous sulphate, copper and zinc sulphate, organic manure, and calcium sulphate. It also trades in diammoium phosphate, urea, ammonium sulphate, and other fertilizers. The company was incorporated in 2002 and is headquartered in Indore, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Indore",
        "zipcode": "452001",
        "website": "http://www.agrophos.com",
        "market_cap": 300056672
    },
    "ARIES.NS": {
        "short_name": "ARIES AGRO LTD",
        "long_name": "Aries Agro Limited",
        "summary": "Aries Agro Limited, together with its subsidiaries, manufactures and supplies micronutrients and other nutritional products for plants and animals in India. Its products include micronutrients, plant protection products, fishery and animal nutrition products, specialty nutrients, water soluble NPK fertilizers, and other products. The company was founded in 1969 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400043",
        "website": "http://www.ariesagro.com",
        "market_cap": 1699900160
    },
    "ASTEC.NS": {
        "short_name": "ASTEC LIFESCIENCES",
        "long_name": "Astec LifeSciences Limited",
        "summary": "Astec LifeSciences Limited, together with its subsidiaries, manufactures, distributes, and sells agrochemicals and pharmaceutical intermediates in India. The company manufactures a range of fungicides, insecticides, herbicides, and intermediates, such as triazole fungicides, heterocyclic herbicides, sulfonyl urea herbicides, synthetic pyrethroids, alkyl and aryl magnesium halides, mixed metal halides, and silane derivatives; fluorinated aromatic amines, pyridine derivatives, aromatic carboxylic acids, benzyl alcohols, ketones and benzophenones, and heterocyclic mercaptans; fluorinated aromatic, aliphatic, and heterocyclic intermediates; heterocyclic mercaptans, thiopyrimidines, aromatic mercaptans, heterocyclic sulfonyl chlorides, heterocyclic sulphonamides, heterocyclic carbamates, thiourium salts, alkyl and aryl chloroformates, substituted pyrimidine diones, and pyrazolones; and substituted 1,2- and 1,3- pyrimidines. Its products also comprise pyrazolyl aromatic ketones, morpholine derivatives, aromatic azo compounds, substituted triazines, imidate ethers, mesylated intermediates, substituted epoxides, ketals and bromo ketals, aromatic and aliphatic ethers, cyclopropyl ethers, cyclopropyl aldehydes and ketones, conjugated ketones, acetophenone derivatives, pinacolone derivatives, aliphatic and aromatic carboxylic acids, aliphatic and aromatic acid chlorides, halogenated and non-halogenated anhydrides, aliphatic alkenes, and halo alkanes; and aliphatic and aromatic brominated derivatives, cyanides, esters, carboxamides, amines, and alcohols and diols. The company also exports its products. Astec LifeSciences Limited was founded in 1994 and is based in Mumbai, India. Astec LifeSciences Limited is a subsidiary of Godrej Agrovet Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400079",
        "website": "http://www.astecls.com",
        "market_cap": 27198363648
    },
    "BAYERCROP.NS": {
        "short_name": "BAYER CROPSCIENCE",
        "long_name": "Bayer CropScience Limited",
        "summary": "Bayer CropScience Limited engages in the manufacture, sale, and distribution of insecticides, fungicides, herbicides, and various other agrochemical products in India. It also provides pharmaceutical products, such as prescription products primarily for cardiology, oncology, gynecology, hematology, and ophthalmology; and diagnostic imaging equipment and other contrast agents. In addition, the company offers consumer health products that are used as a daily health solutions to treat minor illness; and animal health solutions for the prevention and treatment of diseases in companion and farm animals, as well as sells and distributes hybrid seeds. It also exports its products. The company was incorporated in 1958 and is based in Thane, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Thane",
        "zipcode": "400 607",
        "website": "http://www.bayer.in",
        "market_cap": 245512880128
    },
    "BESTAGRO.NS": {
        "short_name": "Best Agrolife Limited",
        "long_name": "Best Agrolife Limited",
        "summary": "Best Agrolife Limited manufactures and trades in agrochemical and pesticide products in India. It offers insecticides, herbicides, fungicides, and plant growth regulator products under the Best brand, as well as liquid-based, granules based, and powder-based formulations. The company also provides fumigants, nematicides, and rodenticides to protect the crops from pest attacks during crop storage. In addition, it trades in PVC and plastic products. The company was formerly known as Sahyog Multibase Limited and changed its name to Best Agrolife Limited in October 2019. Best Agrolife Limited was incorporated in 1992 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110026",
        "website": "http://www.bestagrolife.com",
        "market_cap": 6566534144
    },
    "BHARATRAS.NS": {
        "short_name": "BHARAT RASAYAN LTD",
        "long_name": "Bharat Rasayan Limited",
        "summary": "Bharat Rasayan Limited manufactures and sells technical grade pesticides, intermediates, and bulk formulations in India. It offers insecticides, herbicides, fungicides, and plant growth regulators. The company also exports its products. Bharat Rasayan Limited was founded in 1989 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110008",
        "website": "http://www.bharatgroup.co.in",
        "market_cap": 53968453632
    },
    "BSHSL.NS": {
        "short_name": "Bombay Super Hybrid Seeds",
        "long_name": "Bombay Super Hybrid Seeds Limited",
        "summary": "Bombay Super Hybrid Seeds Limited engages in the research, production, processing, and marketing of hybrid agricultural seeds in India. It offers seeds of wheat, onion, groundnut, gram, bajra, coriander, fenugreek, beetroot, gum guar, black gram, sesame, guar, green gram, carrot, Lucerne, cumin, jowar, isabgol, mustard, toor, soybean, fennel, limabean, rajka bajri, chilly, brinjal, bhindi, ridge gourd, sponge gourd, bitter gourd, cauliflower, cucumber, cabbage, peas, tomato, papaya, watermelon, raddish and drumstick seeds. The company offers its seeds under the Kasturi and Bombay Super brands. It also imports and exports its seeds. The company was founded in 1983 and is based in Rajkot, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Rajkot",
        "zipcode": "360023",
        "website": "http://www.bombaysuperseeds.com",
        "market_cap": 2023185408
    },
    "CHAMBLFERT.NS": {
        "short_name": "CHAMBAL FERTILISER",
        "long_name": "Chambal Fertilisers and Chemicals Limited",
        "summary": "Chambal Fertilisers and Chemicals Limited, together with its subsidiaries, manufactures and sells fertilizers in India and internationally. It operates through Fertilisers and Other Agri Inputs, and Software & Others segments. The company offers urea; and other agri-inputs, including di-ammonium phosphate, murate of potash, single super phosphate, pesticides, and seeds, as well as insecticides, fungicides, herbicides, NPK fertilizers, agrochemicals, seeds, sulphur, micro-nutrients, complex fertilizers, and city compost primarily under the Uttam brand. It is also involved in designing, developing, marketing, and distribution of software products for the mortgage lending industry. The company was incorporated in 1985 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110025",
        "website": "http://www.chambalfertilisers.com",
        "market_cap": 119895834624
    },
    "COROMANDEL.NS": {
        "short_name": "COROMANDEL INTL",
        "long_name": "Coromandel International Limited",
        "summary": "Coromandel International Limited manufactures and sells farm inputs in India. The company operates in two segments, Nutrient and Other Allied Business; and Crop Protection. It offers phosphatic and fortified fertilizers; bio pesticide solutions; crop protection products, including insecticides, fungicides, herbicides, and plant bio stimulants; specialty nutrients, such as bentonite sulphur, water soluble and organic fertilizers, and micronutrients; and organic compost. The company also provides farming services, such as crop advisory, soil testing, and farm mechanization. In addition, it operates 750 rural retail outlets in Andhra Pradesh, Telangana, Karnataka, and Maharashtra. Coromandel International Limited also exports its products. The company was formerly known as Coromandel Fertilisers Ltd and changed its name to Coromandel International Limited in September 2009. The company was incorporated in 1961 and is based in Secunderabad, India. Coromandel International Limited is a subsidiary of E.I.D. Parry (India) Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Secunderabad",
        "zipcode": "500003",
        "website": "http://www.coromandel.biz",
        "market_cap": 249188319232
    },
    "DHANUKA.NS": {
        "short_name": "DHANUKA AGRITECH",
        "long_name": "Dhanuka Agritech Limited",
        "summary": "Dhanuka Agritech Limited manufactures and sells a range of agro-chemicals for plant protection in India. It offers herbicides, insecticides, fungicides, miticides, and plant growth regulators in various forms, such as liquid, dust, powder, and granules. The company also generates electricity. It operates through a network of distributors/dealers. The company also exports its products. Dhanuka Agritech Limited was incorporated in 1985 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122002",
        "website": "http://www.dhanuka.com",
        "market_cap": 44134948864
    },
    "FACT.NS": {
        "short_name": "FERTILIZERS & CHEM",
        "long_name": "The Fertilisers And Chemicals Travancore Limited",
        "summary": "The Fertilisers And Chemicals Travancore Limited manufactures and markets fertilizers in India. It operates through Fertiliser and Petrochemical segments. The company offers complex fertilizers, including ammonium phosphate sulphate and zincated factamfos; straight fertilizers, such as ammonium sulphate; organic fertilizers; bio-fertilizers comprising azospirillum, rhizobium, and phosphate solubilizing bacteria; and bagged gypsum. It also provides caprolactam for use in manufacturing nylon tyre cords, nylon filament yarns, engineering plastics, etc.; and by-products comprising carbon dioxide, gypsum, and sulphuric acid. It also imports fertilizers; and offers various services for farmers. In addition, the company engages in the engineering consultancy, design and fabrication, and erection of industrial equipment. The Fertilisers And Chemicals Travancore Limited was founded in 1943 and is based in Kochi, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kochi",
        "zipcode": "683501",
        "website": "http://www.fact.co.in",
        "market_cap": 82187632640
    },
    "GSFC.NS": {
        "short_name": "GUJARAT STATE FER",
        "long_name": "Gujarat State Fertilizers & Chemicals Limited",
        "summary": "Gujarat State Fertilizers & Chemicals Limited manufactures and sells fertilizers and industrial products in India. The company offers industrial products, such as anhydrous ammonia, argon gas, caprolactam, melamine, methanol, methyl ethyl ketoxime, nylon-6 chips, oleum, sulphuric acid, acetone cyanohydrine, anone-anol mixture, cyclohexane, cyclohexanone, hydroxylamine sulphate, methacrylic acid, methyl methacrylate, nitric acid, nylon-6 filament yarns, polymethyl methacrylate, GUJCON CRF and PRF polyamide-6 fibres, and technical grade urea. It also provides fertilizer products, including urea, ammonium sulphate, di-ammonium phosphate, ammonium phosphate sulphate, NPK, water soluble fertilizers, micro mixes, and gypsum, as well as agro products. In addition, the company is involved in the trading of chemicals, and fertilizers and agro products; and provision of agro services. Gujarat State Fertilizers & Chemicals Limited was founded in 1962 and is based in Vadodara, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Vadodara",
        "zipcode": "391750",
        "website": "http://www.gsfclimited.com",
        "market_cap": 47230468096
    },
    "HERANBA.NS": {
        "short_name": "Heranba Industries Ltd",
        "long_name": "Heranba Industries Limited",
        "summary": "Heranba Industries Limited manufactures and markets a range of agrochemicals in India. The company engages in the research and development, manufacturing, marketing, and distribution of a range of crop protection chemicals, public health, and animal health solutions. It offers various pesticides, including insecticides, herbicides, fungicides, and public health products for pest control. It also provides growth/spreader products, such as amino acids, gibberellic acid 0.001%L, and seaweed extracts. In addition, the company exports its products to approximately 60 countries. The company was formerly known as Heranba Industrial Chemicals Limited and changed its name to Heranba Industries Limited in July 1996. Heranba Industries Limited was incorporated in 1992 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400092",
        "website": "http://www.heranba.com",
        "market_cap": 30729318400
    },
    "INSECTICID.NS": {
        "short_name": "INSECTICIDES INDIA",
        "long_name": "Insecticides (India) Limited",
        "summary": "Insecticides (India) Limited manufactures and sells agro chemicals, pesticides, and technical products for agriculture purposes in India and internationally. The company offers insecticides, herbicides, fungicides, and PGRs and bio fertilizers. It also provides household, technical, and bulk products. The company sells its products through a network of approximately 5000 distributors and 60000 retailers under the Tractor brand name. Insecticides (India) Limited was incorporated in 1996 and is based in Delhi, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Delhi",
        "zipcode": "110033",
        "website": "http://www.insecticidesindia.com",
        "market_cap": 13089764352
    },
    "KRISHANA.NS": {
        "short_name": "Krishana Phoschem Limited",
        "long_name": "Krishana Phoschem Limited",
        "summary": "Krishana Phoschem Limited manufactures and sells fertilizers, intermediate dyes, and other allied chemical products in India. The company offers benefited rock phosphate, single super phosphate (SSP), granulated single super phosphate (GSSP), H-acid, intermediate dyes, sulphuric acid, chloro sulphonic acid, liquid SO3, and other allied chemicals. The company's SSP and GSSP products are used as fertilizer for crop. It also engages in the contract manufacturing of chemicals. The company was founded in 2004 and is based in Bhilwara, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bhilwara",
        "zipcode": "311001",
        "website": "http://www.krishnaphoschem.com",
        "market_cap": 2775105024
    },
    "MADRASFERT.NS": {
        "short_name": "MADRAS FERTILIZERS",
        "long_name": "Madras Fertilizers Limited",
        "summary": "Madras Fertilizers Limited manufactures and sells fertilizers in India. It operates in two segments, Fertilizers and Other Activities. The company offers ammonia, urea, and complex fertilizers; biofertilizers; organic fertilizers; and agrochemicals under the VIJAY brand name. Its chemical fertilizers include VIJAY Urea, a nitrogenous fertilizer for various crops and soil types; VIJAY complexes, which are granulated fertilizers consisting of nitrogen, phosphorous, and potash; and VIJAY 17:17:17 for early growth and vegetative phases of various crops. The company also provides bio-fertilizers, such as Azospirillum for paddy, plantation crops, and other crops; Rhizobium for groundnuts and pulses; and Phospho Bacteria and NP Bio for various crops. In addition, the company markets neem-based pesticides under the VIJAY NEEM brand name. It markets its products through a network of approximately 5785 dealers, co-operative marketing federations, Agro industries corporations, and other institutions. Madras Fertilizers Limited was incorporated in 1966 and is headquartered in Chennai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600068",
        "website": "http://www.madrasfert.co.in",
        "market_cap": 4986075648
    },
    "MANGCHEFER.NS": {
        "short_name": "MANGALORE CHEMICAL",
        "long_name": "Mangalore Chemicals & Fertilizers Limited",
        "summary": "Mangalore Chemicals and Fertilizers Limited manufactures, purchases, and sells nitrogenous and phosphatic fertilizers in India and internationally. The company offers urea, di-ammonium phosphate, ammonium bi-carbonate, and muriate of potash; and plant nutrition products, such as soil conditioners, organic products, micronutrients, specialty agri products, water soluble fertilizers, crop specific soil products, and wetting and spreading agents. It also provides plant protection chemicals comprising insecticides, fungicides, herbicides, and PP chemicals; and other products, such as ammonium bi carbonate, sulphonated naphthalene formaldehyde, and sulphuric acid products. The company was incorporated in 1966 and is based in Bengaluru, India. Mangalore Chemicals and Fertilizers Limited is a subsidiary of Zuari Agro chemicals Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560001",
        "website": "http://www.mangalorechemicals.com",
        "market_cap": 10288167936
    },
    "MBAPL.NS": {
        "short_name": "Madhya Bharat Agro P. Ltd",
        "long_name": "Madhya Bharat Agro Products Limited",
        "summary": "Madhya Bharat Agro Products Limited manufactures and sells fertilizers and chemicals in India. It offers beneficiated rock phosphate, sulphuric acid, single super phosphate, granulated single super phosphate, sulphur bentonite, phosphate rich organic manure, and oleum products. The company was founded in 1997 and is based in Bhilwara, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bhilwara",
        "zipcode": "311001",
        "website": "http://www.mbapl.com",
        "market_cap": 1839067392
    },
    "NACLIND.NS": {
        "short_name": "NACL INDUSTRIES LT",
        "long_name": "NACL Industries Limited",
        "summary": "NACL Industries Limited manufactures and sells agrochemicals in India. The company offers a range of technicals, including myclobutanil, propiconazole, profenofos, tricyclazole, and pretilachlors; and formulations, such as insecticides, fungicides, herbicides, and plant growth regulators and nematicides, as well as pesticides and acaricides. It also provides toll manufacturing services for various multinational companies. The company also exports its products to approximately 30 countries worldwide. It markets and sells its products through a network of retail dealers. The company was formerly known as Nagarjuna Agrichem Limited and changed its name to NACL Industries Limited in September 2017. The company was incorporated in 1986 and is based in Hyderabad, India. NACL Industries Limited is a subsidiary of KLR Products Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500082",
        "website": "http://www.naclind.com",
        "market_cap": 16959919104
    },
    "NAGAFERT.NS": {
        "short_name": "NAGARJUNA FERTILIZ",
        "long_name": "Nagarjuna Fertilizers and Chemicals Limited",
        "summary": "Nagarjuna Fertilizers and Chemicals Limited manufactures and markets fertilizers and micro irrigation equipment in India and internationally. It manufactures urea and anhydrous ammonia; and markets diammonium phosphate, muriate of potash, zinc sulphate heptahydrate, zinc sulphate mono-hydrate, chelated zinc, di-sodium octa borate tetra hydrate, and specialty fertilizers. The company also provides micro irrigation products and services, including head control units, water carrier system components, and water distribution system components that ensure slow, regular, and precise delivery of water and agricultural inputs to the crop; and operation, maintenance, project management, and other specialist services for the management of chemical process plants. In addition, it offers services to facilitate farm yield and profitability enhancement through agricultural technology transfer and critical information dissemination online and offline. Nagarjuna Fertilizers and Chemicals Limited was founded in 1985 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500082",
        "website": "http://www.nagarjunafertilizers.com",
        "market_cap": 5610243072
    },
    "NATHBIOGEN.NS": {
        "short_name": "NATH BIO-GENES (IN",
        "long_name": "Nath Bio-Genes (India) Limited",
        "summary": "Nath Bio-Genes (India) Limited engages in the production, processing, and marketing of hybrid and GM seeds in India and internationally. It operates in two segments, Agricultural Activities and Trading Activities. The company offers seeds for cereals, such as maize, paddy, pearl millet, wheat, and jowar; fiber and oil seeds, including cotton, mustard, and sunflower; and seeds for vegetables comprising chilli, okra, tomato, brinjal, bottle gourd, bitter gourd, sponge gourd, ridge gourd, cucumber, and coriander. It also provides nutritional supplements, such as BioEnergy for soil applications and foliar spray; and Win-Chi-Win growth enhancer. The company offers its products through a network of distributors, dealers, branch offices, and processing plants. Nath Bio-Genes (India) Limited was founded in 1979 and is based in Aurangabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Aurangabad",
        "zipcode": "431005",
        "website": "http://www.nathbiogenes.com",
        "market_cap": 7765984256
    },
    "NFL.NS": {
        "short_name": "NATIONAL FERTILIZE",
        "long_name": "National Fertilizers Limited",
        "summary": "National Fertilizers Limited produces and sells urea products, industrial products, and bio-fertilizers in India. It operates through Own Fertilizers, Fertilizers Trading, and Other Products & Services segments. The company offers Kisan urea for various types of crops, as well as for foliar sprays; neem coated urea and bentonite sulphur products; bio-fertilizers, including rhizobium, phosphate and zinc solubilizing bacteria, and azetobactor that are used to supplement chemical fertilizers, as well as to maintain soil fertility; and industrial products comprising nitric acid dilute, ammonium nitrate, anhydrous ammonia, and sodium nitrite and nitrate under the Kisan brand name, as well as certified seeds under the Kisan Beej brand name. The company also trades in compost products; and agrochemicals/pesticides comprising insecticides, herbicides, and fungicides, as well as potassium chloride, diammonium phosphate, and nitro phosphate. National Fertilizers Limited was incorporated in 1974 and is based in Noida, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201301",
        "website": "http://www.nationalfertilizers.com",
        "market_cap": 33653649408
    },
    "PIIND.NS": {
        "short_name": "PI INDUSTRIES",
        "long_name": "PI Industries Limited",
        "summary": "PI Industries Limited manufactures and distributes agro chemicals in India, rest of Asia, North America, Europe, and internationally. The company offers agrochemicals, including insecticides, fungicides, and herbicides; specialty products; and generic molecules, such as Profenofos, Ethion, and Phorate primarily under the NOMINEE GOLD, OSHEEN, BIOVITA, COSKO, ROKET, KEEFUN, ELITE, HUMESOL, AWKIRA, Vibrant, Header, and COSKO SC brands, as well as chemical and active intermediates. It also provides research and development (R&D) services comprising target discovery, molecule design, library synthesis, lead optimization, biological evaluation, and route synthesis services; and custom synthesis and manufacturing solutions consisting of process R&D, analytical method development, synthesis of reference standards, structure elucidation and synthesis of impurities, physio-chemical studies and 5-batch analysis under GLP conditions, scale-up studies, safety data generation, waste categorization and treatability studies, process/plant engineering, and large-scale commercial production. It sells its products through distributors/dealers and retailers. The company was formerly known as Mewar Oil & General Mills Ltd. PI Industries Limited was founded in 1946 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122009",
        "website": "http://www.piindustries.com",
        "market_cap": 430159462400
    },
    "RALLIS.NS": {
        "short_name": "RALLIS INDIA LTD",
        "long_name": "Rallis India Limited",
        "summary": "Rallis India Limited manufactures and markets agri inputs primarily in India. The company offers crop protection products, including insecticides, fungicides, and herbicides; seed treatment chemicals; soil conditioners; and seeds, such as hybrid rice, maize, pearl millet, sunflower, vegetable, cotton, paddy, mustard, wheat, etc. It also provides household products, such as Termex, an insecticide for termite control; Sentry, a synthetic pyrethroid insecticide; and Hippo, a household insecticide for control of houseflies and cockroaches. In addition, the company offers contract manufacturing services for crop protection chemicals, specialty chemicals, polymers, and intermediates; plant growth nutrients; and agri services, such as GeoGreen, Samrudha Krishi, Jetone knapsack sprayer, Macauto battery sprayer, Vannjet hi-tech sprayer, and system of rice intensification to the farming community. It sells its products through a network of dealers and retailers. The company also exports its products to approximately 70 countries in Europe, Asia, the Middle East, the Americas, Africa, and Oceania. Rallis India Limited was incorporated in 1948 and is based in Mumbai, India. Rallis India Limited is a subsidiary of Tata Chemicals Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400037",
        "website": "http://www.rallis.co.in",
        "market_cap": 66744012800
    },
    "RCF.NS": {
        "short_name": "RASHTRIYA CHEM & F",
        "long_name": "Rashtriya Chemicals and Fertilizers Limited",
        "summary": "Rashtriya Chemicals and Fertilizers Limited manufactures and sells fertilizers and industrial chemicals primarily in India. The company operates through Fertilizers, Industrial Chemicals, and Trading segments. It offers various fertilizers, including Suphala 15:15:15, a granular natural color fertilizer that is used in the cultivation of cash crops and fruit crops, as well as in improving the yield of plantation crops; Ujjwala neem coated urea, a chemical fertilizer; Biola, a bio-fertilizer that solubilizes the fixed phosphorus in the soil and makes it available to the crops; Sujala water soluble fertilizers that contain nitrogen, phosphorus, and potash for crops grown in green houses, as well as other field crops; and Microla micronutrients. The company also provides basic chemicals, such a methanol, ammonia, ammonium nitrate, sodium nitrate, sodium nitrite, ammonium bicarbonate, methylamines, dimethyl formamide and dimethyl acetamide, formic acid, and argon. In addition, it offers soil testing and farmer training services, as well as publishes RCF Sheti Patrika, a monthly farm magazine. Rashtriya Chemicals and Fertilizers Limited was incorporated in 1978 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400022",
        "website": "http://www.rcfltd.com",
        "market_cap": 45130985472
    },
    "SHARDACROP.NS": {
        "short_name": "SHARDA CROPCHEM",
        "long_name": "Sharda Cropchem Limited",
        "summary": "Sharda Cropchem Limited, a crop protection chemical company, provides various formulations and generic active ingredients worldwide. The company operates through Agrochemicals, and Belts segments. It offers agrochemical products, including insecticides, fungicides, herbicides, veterinary drugs, plant growth regulators, fumigants, regulators, rodenticides, metalaxyl, propiconazole, phenthoate, pendimethalin, and dithianon; and biocides. The company also provides conveyor belts, such as textile ply, rough top, steel cord, chevron/pattern, elevator, sidewall, pipe, and PVC/PVG solid woven conveyor belts, as well as cotton transmission belts, PVC and polyurethane light duty belting products, and V-belts for use in mining projects, steel plants, quarries, grain silos, cement manufacturing facilities, ports, tunneling projects, etc. In addition, it offers organic and inorganic chemicals used in water treatment, food and food ingredients, and other industrial applications; and dyes and dye intermediates, as well as general chemicals. Sharda Cropchem Limited was founded in 1987 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400056",
        "website": "http://www.shardacropchem.com",
        "market_cap": 33705011200
    },
    "SPIC.NS": {
        "short_name": "SOUTHERN PETROCHEM",
        "long_name": "Southern Petrochemical Industries Corporation Limited",
        "summary": "Southern Petrochemical Industries Corporation Limited manufactures and sells fertilizers in India and internationally. The company operates through Agro inputs - Urea Operations and Others - Agri Business segments. It provides chemical fertilizers, such as urea, di-ammonium phosphate, ammonium phosphate sulphate, urea ammonium phosphate, super phosphate, and ammonium chloride, as well as potassium schoenite; water soluble fertilizers; organic fertilizers; micro nutrients; plant growth regulators; and industrial products, including gypsum, aluminum fluoride, and silica. The company also engages in the tissue culture businesses. In addition, it offers agricultural services, including soil management, training center, journal, agri clinic, and SMS services for farmers. Southern Petrochemical Industries Corporation Limited was incorporated in 1969 and is headquartered in Chennai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600032",
        "website": "http://www.spic.in",
        "market_cap": 9323184128
    },
    "SUMICHEM.NS": {
        "short_name": "Sumitomo Chemical Ind Ltd",
        "long_name": "Sumitomo Chemical India Limited",
        "summary": "Sumitomo Chemical India Limited manufactures and sells household insecticides, agricultural pesticides, public health insecticides, and animal nutrition products in India and internationally. The company operates through two segments, Agro Chemicals and Others. It offers crop protection products, such as insecticides, herbicides, fungicides, and miticides; plant nutrition and plant growth regulators; household pesticides; animal nutrition products; fumigants and rodenticides; and bio-pesticides. The company was founded in 2000 and is headquartered in Mumbai, India. Sumitomo Chemical India Limited is a subsidiary of Sumitomo Chemical Company Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400063",
        "website": "http://www.sumichem.co.in",
        "market_cap": 181501476864
    },
    "UPL.NS": {
        "short_name": "UPL LIMITED",
        "long_name": "UPL Limited",
        "summary": "UPL Limited manufactures and markets crop solutions in India and internationally. It operates through two segments, Agro Activity and Non-agro Activity. The company offers sorghum, forages, corn, canola, sunflower, vegetable, rice, wheat, soya, pearl millet, oats, alfalfa, bio-fumigants, and mustard seeds. It also provides herbicides; fungicides; insecticides and acaricides; seed treatment products; adjuvants; and ProNutiva, a solution for crop protection. In addition, the company offers plant stress and stimulation solutions; post-harvest products; soil and water technologies; aquatic treatment solutions; and farmer advisory and education services, as well as farm services. Further, it manufactures and markets industrial chemicals and other non-agricultural related products. The company was formerly known as United Phosphorus Limited and changed its name to UPL Limited in October 2013. UPL Limited was founded in 1969 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.upl-ltd.com",
        "market_cap": 638092181504
    },
    "VIKASPROP.NS": {
        "short_name": "Vikas Prop & Granite Ltd",
        "long_name": "Vikas Proppant & Granite Limited",
        "summary": "Vikas Proppant & Granite Limited manufactures, grades in, and sells guar gum powder in India. The company is also involved in the grading of guar splits and its derivatives; mining of granite blocks; and manufacture of proppants. Its guar gum is used for various technical applications comprising pet food, oil drilling, textile printing, mining paper, etc. The company was formerly known as Vikas Granaries Limited and changed its name to Vikas Proppant & Granite Limited in February 2018. Vikas Proppant & Granite Limited was incorporated in 1994 and is based in Sri Ganganagar, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Sriganganagar",
        "zipcode": "335002",
        "website": "http://www.vpgl.in",
        "market_cap": 1240965632
    },
    "ZUARI.NS": {
        "short_name": "ZUARI AGRO CHEMICA",
        "long_name": "Zuari Agro Chemicals Limited",
        "summary": "Zuari Agro Chemicals Limited manufactures, trades in, and markets chemical fertilizers in India. It produces organic manure, micronutrients, seeds, pesticides, and specialty fertilizers; and DAP, ammonia, urea, and NPK A and NPK B fertilizers. The company is also involved in trading complex fertilizers, water soluble fertilizers, pesticides, and seeds. It markets its products under the Jai Kisaan brand to farmers through dealers. The company was formerly known as Zuari Holdings Limited and changed its name to Zuari Agro Chemicals Limited in September 2012. Zuari Agro Chemicals Limited was founded in 1967 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122002",
        "website": "http://www.zuari.in",
        "market_cap": 5266060800
    }
}