{
    "INDIGO.NS": {
        "short_name": "INTERGLOBE AVIATIO",
        "long_name": "InterGlobe Aviation Limited",
        "summary": "InterGlobe Aviation Limited provides air transportation services in India and internationally. The company primarily operates IndiGo passenger airline. It also offers ancillary products and services, such as cargo, service requests, ticket modification or cancellation, in-flight sales, and tours services. As of March 31, 2020, the company operated a fleet of 262 aircraft. InterGlobe Aviation Limited was incorporated in 2004 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Airlines",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gurugram"
    },
    "JETAIRWAYS.NS": {
        "short_name": "JET AIRWAYS INDIA",
        "long_name": "Jet Airways (India) Limited",
        "summary": "Jet Airways (India) Limited provides passenger and cargo air transportation services. It also provides aircraft leasing services. It operates flights to 66 destinations in India and international countries. As of November 22, 2018, the company had a fleet of 124 aircraft, comprising Boeing 777-300 ERs, Airbus A330-200/300, the latest Boeing 737 Max 8, Next Generation Boeing 737s, and ATR 72-500/600s. Jet Airways (India) Limited was founded in 1992 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Airlines",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "SPICEJET.NS": {
        "short_name": "SPICEJET LTD",
        "long_name": "SpiceJet Limited",
        "summary": "SpiceJet Limited provides air transportation services. It operates through Air Transport, and Freighter and Logistics Services segments. The company offers passengers and cargo air transportation services under the SpiceJet brand name. As of October 31, 2020, it operated 105 fleets covering 57 routes, which include 47 domestic and 10 international destinations. SpiceJet Limited was incorporated in 1984 and is headquartered in Gurugram, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Airlines",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gurugram"
    }
}