{
  "GLOBALVECT.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Airports & Air Services",
    "long_name": "Global Vectra Helicorp Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "GLOBAL VECTRA HELI",
    "state": null,
    "summary": "Global Vectra Helicorp Limited provides helicopter charter services for offshore and onshore transportation in the oil and gas exploration and production sector in India. It also offers its services to religious tourism, geophysical survey, corporate and VVIP flying, election flying, remote location freight, emergency services, underslung operations, and aerial photography and filming, as well as powerline inspection, construction, and maintenance. In addition, the company provides aircraft maintenance, repair, and overhaul services. It operates a fleet of approximately 25 helicopters. Global Vectra Helicorp Limited was incorporated in 1998 and is based in Mumbai, India.",
    "website": "http://www.globalhelicorp.com",
    "zipcode": "400056"
  },
  "GMRINFRA.NS": {
    "city": "New Delhi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Airports & Air Services",
    "long_name": "GMR Infrastructure Limited",
    "market": "in_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "GMR INFRASTRUCTURE",
    "state": null,
    "summary": "GMR Infrastructure Limited engages in engineering, procurement, and construction (EPC) contracting activities in India and internationally. The company operates through Airports, Power, Roads, EPC, and Others segments. It is involved in the development, maintenance, and operation of airport infrastructure and special economic zones; and modernization, maintenance, and operation of international airports on build, own, operate, and transfer basis. The company also engages in the generation and sale of power; coal mining and exploration activities; and energy and coal trading activities. In addition, it develops highways on build, operate, and transfer model on annuity or toll basis; and handles EPC solutions in the infrastructure sector. Further, it operates hotels; invests in the airport, energy and transportation, and urban infrastructure sectors; and provides management/technical consultancy services. The company was formerly known as GMR Vasavi Infrastructure Finance Limited and changed its name to GMR Infrastructure Limited in April 2000. GMR Infrastructure Limited was incorporated in 1996 and is based in New Delhi, India. GMR Infrastructure Limited is a subsidiary of GMR Enterprises Private Limited.",
    "website": "http://www.gmrgroup.in/home/#our-journey/slide11",
    "zipcode": "110 037"
  },
  "GVKPIL.NS": {
    "city": "Secunderabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Airports & Air Services",
    "long_name": "GVK Power & Infrastructure Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "GVK POWER & INFRAS",
    "state": null,
    "summary": "GVK Power & Infrastructure Limited, together with its subsidiaries, provides operation and maintenance, manpower and consultancy, and incidental services to the owners of power plants, airports, and infrastructure companies in India and internationally. It operates through Roads, Power, Airport, and Others segments. The company constructs and operates power plants, highway projects, and airports; explores coal mines; and invests in SEZ and other assets, as well as generates power, and offers hospitality and life science services. GVK Power & Infrastructure Limited was incorporated in 2005 and is headquartered in Secunderabad, India.",
    "website": "http://www.gvk.com",
    "zipcode": "500003"
  }
}
