{
    "CENTEXT.NS": {
        "short_name": "CENTURY EXTRUSIONS",
        "long_name": "Century Extrusions Limited",
        "summary": "Century Extrusions Limited manufactures and sells aluminum extruded and value added products in India. It provides profiles for architectural applications, such as building systems, structural glazing, curtain walls, aluminum rolling shutters, windows, doors, partitions, false ceilings, tower bolts, hand rails, door handles, hinges, drapery rods, modular furniture, etc.; aluminum form works; road transport sections; rail coach windows and doors; manufacture of automobile components; and heat transfer in electronics and electrical gadgets. The company also offers profiles for electrical applications, including tubes and flats for bus bars; transmission line hardware, such as P.G. clamps; and H-connectors, repair sleeves, lugs, solar panels, etc. In addition, it provides profiles for engineering applications comprising motor housings, gear pump casings, ferrules, A.C. louvers, machinery parts, elevators, pneumatic actuators, pneumatic cylinders, valve bodies, etc.; and various defense applications and others. Further, the company offers extruded and cold drawn round bars, and hexagonal bars for various engineering applications; and extruded and cold drawn rods/wires in coil form for use as armor rods, lamp pin stock, metalizing wire, rivet stock, welding filler wire, etc. Additionally, it manufactures power transmission and distribution line hardware. The company markets its products under the Century brand. Century Extrusions Limited was incorporated in 1988 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700016",
        "website": "http://www.centuryextrusions.com",
        "market_cap": "Small Cap"
    },
    "HINDALCO.NS": {
        "short_name": "HINDALCO INDS",
        "long_name": "Hindalco Industries Limited",
        "summary": "Hindalco Industries Limited, together with its subsidiaries, produces and sells aluminum and copper products in India and internationally. It operates through Aluminium, Copper, Novelis, and All Other Segments. The company offers alumina; primary aluminum in the form of ingots, billets, and wire rods; aluminum flat rolled products (FRP); aluminum extrusions; and aluminum foil and packaging solutions for use in the automotive and transport, building and construction, defense, electrical and electronics, pharmaceuticals and packaging, and white goods industries, as well as industrial applications. It also provides coarse alumina hydrate for use in alum, poly aluminum chloride, aluminum fluoride, sodium aluminate, catalysts, glass, and aluminum hydroxide gel; and fine alumina hydrates, as well as flame retardants and smoke suppressants in cables, rubbers, plastics, etc.; and calcined alumina for use in ceramics, refractories, polishing, and glass. In addition, the company offers copper products, including copper cathodes and continuous cast copper rods that are used in the agrochemical, automotive and transport, consumer durable, electrical equipment, railway, and wire and cable industries. Further, it operates an all-weather jetty in the Gulf of Khambhat on the west coast of India; produces di-ammonium phosphate and nitrogen phosphorus potassium complexes; and phosphoric acid, phosphogypsum, sulfuric acid, copper slag, and aluminum fluoride, as well as gold, silver, selenium. The company offers its aluminum extrusion products under the Hindalco extrusions, Maxloader, and Eternia brands; aluminum FRP under the Everlast brand; aluminum foils under the Freshwrapp and Superwrap brands; and copper products under the Birla Balwan brand. Hindalco Industries Limited was founded in 1958 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400030",
        "website": "http://www.hindalco.com",
        "market_cap": "Large Cap"
    },
    "MAANALU.NS": {
        "short_name": "MAAN ALUMINIUM LTD",
        "long_name": "Maan Aluminium Limited",
        "summary": "Maan Aluminium Limited manufactures and trades in aluminum profiles, ingots, billets, and other related products in India. The company offers geometrical shapes; architectural structures, such as doors and windows, curtain walls, structural glazing products, and others; AC grills and equipment; architectural hardware; industrial products; and solar panels. It also trades in ingots and billets, and non-ferrous scrap. The company serves automobiles, agriculture, rail and road transport, building and construction, heavy engineering, architecture, electronics, solar energy, and defense industries. It also exports its products. The company was formerly known as Man Aluminium Limited. Maan Aluminium Limited was founded in 1989 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110002",
        "website": "http://www.maanaluminium.com",
        "market_cap": "Small Cap"
    },
    "MANAKALUCO.NS": {
        "short_name": "MANAKSIA ALUMINIUM",
        "long_name": "Manaksia Aluminium Company Limited",
        "summary": "Manaksia Aluminium Company Limited manufactures and sells aluminum products primarily in India. The company offers aluminum sheets and coils, aluminum flooring sheets, aluminum pattern sheets, aluminum roofing sheets, aluminum closure coils and sheets, aluminum color coated coils, aluminum color coated roofing or building sheets, and aluminum alloy ingots. It exports its products to approximately 20 countries in Europe, North America, the Middle East, Africa, Latin America, and other continents. Manaksia Aluminium Company Limited was incorporated in 2010 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700001",
        "website": "http://www.manaksiaaluminium.com",
        "market_cap": "Small Cap"
    },
    "MMP.NS": {
        "short_name": "MMP Industries Limited",
        "long_name": "MMP Industries Limited",
        "summary": "MMP Industries Limited manufactures and sells aluminum products in India. It operates through Aluminium Powder and Pastes, Aluminium Conductor, and Others segments. The company offers pyro, flake, and atomized aluminum powders primarily for use in various sectors, including construction and mining, agriculture, defense, fire crackers, railways, etc.; aluminum pastes for use in automotive, decorative, and industrial paints; and aluminum conductors used by the power sector. It also provides manganese oxide/dioxide, washers, circlips, and coal products. It also exports its products to countries in Europe, the Middle-East, Africa, and the Asia Pacific. The company was formerly known as Maharashtra Metal Powders Limited and changed its name to MMP Industries Limited in June 2012. MMP Industries Limited was incorporated in 1973 and is based in Nagpur, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Nagpur",
        "zipcode": "440016",
        "website": "http://www.mmpil.com",
        "market_cap": "Small Cap"
    },
    "NATIONALUM.NS": {
        "short_name": "NATIONAL ALUMINUM",
        "long_name": "National Aluminium Company Limited",
        "summary": "National Aluminium Company Limited manufactures and sells alumina and aluminum products in India and internationally. It operates through Chemicals and Aluminium segments. It offers aluminum metal products, such as ingots, alloy ingots, T-ingots, sows, billets, and wire rods; alumina and hydrate products, including calcined alumina and alumina hydrate; zeolite-A products; specialty alumina and hydrate products; and aluminum rolled products and aluminum chequered sheets. The company also owns and operates an opencast mine covering an area of 16 square kilometers on Panchpatmali hills of Koraput district in Odisha; a wind power plant with 50.4 MW of generation capacity in Gandikota, Andhra Pradesh; a wind power plant with 47.6 MW of generation capacity at Jaisalmer, Rajasthan; a wind power plant with 50 MW of generation capacity at Devikot, Rajasthan; a wind power plant with 50.4 MW of generation capacity at Jath, Maharashtra; and a solar power plant in Bhubaneswar. In addition, it owns and operates mechanized storage and ship handling facilities for exporting alumina and importing caustic soda. The company also exports its products. National Aluminium Company Limited was founded in 1981 and is based in Bhubaneswar, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bhubaneswar",
        "zipcode": "751013",
        "website": "http://www.nalcoindia.com",
        "market_cap": "Small Cap"
    }
}