{
  "HARITASEAT.NS": {
    "city": "Chennai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Harita Seating Systems Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Goods",
    "short_name": "HARITA SEATING SYS",
    "state": null,
    "summary": "Harita Seating Systems Limited provides seating solutions for automotive industry in India. It offers driver and cabin seating solutions for commercial vehicles, tractors, off-road vehicles, original equipment manufacturers, and construction equipment; and passenger seats for buses. The company also manufactures and sells seat foams. It also exports its products. Harita Seating Systems Limited was founded in 1988 and is based in Chennai, India.",
    "website": "http://www.haritaseating.com",
    "zipcode": "600006"
  },
  "HINDCOMPOS.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Hindustan Composites Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "HINDUSTAN COMPOSIT",
    "state": null,
    "summary": "Hindustan Composites Limited develops, manufactures, and markets fiber based friction materials in India. The company offers friction materials, including automotive brake linings, automotive and industrial roll linings, automotive clutch facings and ceramic buttons, automotive disc brake pads, railway brake blocks, and friction sheets. It also provides industrial thrust bearing and insulation products comprising millboard sheets, millboard discs, compestos, and compestos rings. The company serves various industries, such as automotive, railways, engineering, mining, aerospace, steel, chemical, oil exploration, etc. Hindustan Composites Limited was incorporated in 1964 and is based in Mumbai, India.",
    "website": "http://www.hindcompo.com",
    "zipcode": "400013"
  },
  "HITECHGEAR.NS": {
    "city": "Gurugram",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "The Hi-Tech Gears Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "THE HI-TECH GEARS",
    "state": null,
    "summary": "The Hi-Tech Gears Limited manufactures and sells auto components to automobile manufacturers and Tier 1 and 2 suppliers in India, the United States, and internationally. It offers transmission and engine components, driveline components, gears, shafts, power take off units, and engineering design services for two wheelers, light vehicles, commercial vehicles, and off highway vehicles, as well as engine gears. The company also provides parts and accessories for motor vehicles, such as brakes, gearboxes, axles, road wheels, suspension shock absorbers, radiators, silencers, exhaust pipes, catalyzers, clutches, steering wheels, steering columns and steering boxes, etc. In addition, it develops products and services in the field of robotics, artificial intelligence, automotive embedded systems, and computer vision and biometrics. The Hi-Tech Gears Limited was incorporated in 1986 and is based in Gurugram, India.",
    "website": "http://www.thehitechgears.com",
    "zipcode": "122009"
  },
  "IGARASHI.NS": {
    "city": "Chennai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Igarashi Motors India Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "IGARASHI MOTORS IN",
    "state": null,
    "summary": "Igarashi Motors India Limited manufactures and sells micro motors and its accessories for the automotive sector in India. The company's products include electric DC micro motors, and stamping and motor components. It also operates in the United States, Japan, Germany, Hong Kong, and internationally. The company was formerly known as CG Igarashi Motors Limited and changed its name to Igarashi Motors India Limited in July 2003. Igarashi Motors India Limited was incorporated in 1992 and is based in Chennai, India.",
    "website": "http://www.igarashimotors.com",
    "zipcode": "600045"
  },
  "IMPAL.NS": {
    "city": "Chennai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "India Motor Parts & Accessories Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "INDIA MOTOR PARTS",
    "state": null,
    "summary": "India Motor Parts & Accessories Limited, together with its subsidiary, sells and distributes automobile spare parts and accessories in India. It primarily offers engine group components; brake parts, fluid, and systems; steering parts and linkages; and hex, sockets, fasteners, radiators, suspensions, axles, auto electricals, wheels, instrument clusters, etc. The company was incorporated in 1954 and is based in Chennai, India.",
    "website": "http://www.impal.net",
    "zipcode": "600014"
  },
  "INDNIPPON.NS": {
    "city": "Chennai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "India Nippon Electricals Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "INDIA NIPPON ELECT",
    "state": null,
    "summary": "India Nippon Electricals Limited designs, manufactures, and sells electronic ignition systems for auto industry in India and internationally. The company offers AC generator products, such as flywheel magneto, stator, and rotor products, as well as CDI and TCI products, regulator and rectifier units, ignition coils, exhaust gas recirculation controllers, engine controller units, auto choke-generation purpose engines, dual output ignition products, non-contact and contact type throttle position sensors, and PM alternators. Its products have applications in two-wheelers, three wheelers, and portable engines. India Nippon Electricals Limited was incorporated in 1984 and is based in Chennai, India.",
    "website": "http://www.indianippon.com",
    "zipcode": "600002"
  },
  "JAMNAAUTO.NS": {
    "city": "New Delhi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Jamna Auto Industries Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "JAMNA AUTO IND",
    "state": null,
    "summary": "Jamna Auto Industries Limited manufactures and sells tapered leafs and parabolic springs under the JAI brand in India and internationally. It offers tapered multileaf springs that are used in commercial and special application vehicles. The company also provides rear air suspensions used in city and intercity buses; steerable/non steerable lift axles; and bogie suspensions that are used in on-off highway applications. Jamna Auto Industries Limited was founded in 1954 and is based in New Delhi, India.",
    "website": "http://www.jaispring.com",
    "zipcode": "110070"
  },
  "JAYBARMARU.NS": {
    "city": "Gurugram",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Jay Bharat Maruti Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "JAY BHARAT MARUTI",
    "state": null,
    "summary": "Jay Bharat Maruti Limited manufactures and sells auto components and assemblies in India. It offers sheet metal components, welded assemblies, exhaust systems, fuel fillers, rear axles, muffler assemblies, fuel necks, tools and dies, spare parts, components, BIW parts, and suspension parts for motor vehicles. The company was founded in 1986 and is based in Gurugram, India.",
    "website": "http://www.jbmgroup.com/Jay-Bharat-Maruti-Ltd.php",
    "zipcode": "122003"
  },
  "JBMA.NS": {
    "city": "Gurugram",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "JBM Auto Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "JBM AUTO LTD",
    "state": null,
    "summary": "JBM Auto Limited manufactures and sells auto components, tools, and buses in India and internationally. It operates through three segments: Sheet Metal Components, Assemblies & Sub-assemblies; Tool, Dies & Moulds; and OEM Division. The company offers chassis and suspension systems, such as axles, twist beams, lower control arms, sub-frames, exhaust systems, air and fuel tanks, complete cowl assemblies, and pedal boxes; skin panels, including doors, roofs, rear and front panels, and bumpers; and BIW parts and assemblies comprising floor and upper body parts, roof headers, cross car and truck beams, oil pan assemblies, and others, as well as tools and dies for turnkey projects. It also designs, develops, manufactures, assembles, and sells CNG, diesel, and electric buses, as well as related parts, accessories, and maintenance contracts. The company was incorporated in 1996 and is based in Gurugram, India.",
    "website": "http://www.jbm-group.com/JBM-Auto-Ltd.php",
    "zipcode": "122003"
  },
  "JKTYRE.NS": {
    "city": "New Delhi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "JK Tyre & Industries Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "JK TYRE&INDUSTRIES",
    "state": null,
    "summary": "JK Tyre & Industries Limited develops, manufactures, markets, and distributes tyres, tubes, and flaps in India, Mexico, and internationally. The company offers truck/bus bias and radial, light and small commercial vehicle, farm, passenger car radial, off the road, two- and three-wheeler, motorcycle and scooter, and racing car tyres under the JK Tyre, Vikrant, and Tornel brand names. It also operates tyre care centers that are involved in the repair, inflation pressure check, rotation, and servicing of tyres. The company markets its products and services through a network of approximately 550 Steel Wheels, Xpress Wheels, Truck Wheels and Retread centers, as well as approximately 500 brand shops. JK Tyre & Industries Limited was incorporated in 1951 and is headquartered in New Delhi, India.",
    "website": "http://www.jktyre.com",
    "zipcode": "110002"
  },
  "JMA.NS": {
    "city": "New Delhi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Jullundur Motor Agency (Delhi) Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "JULLUNDUR MOTOR AG",
    "state": null,
    "summary": "Jullundur Motor Agency (Delhi) Limited trades and distributes automobile parts, accessories, and petroleum products primarily in India. The company offers automotive components; fly wheel rings; gaskets and radiators; thin wall engine bearings, bushings, and thrust washers; hydraulic brake parts, fluids, and coolants; fan belts; suspension, drive shafts, and filters; automotive air springs; engine oil and grease; window balancers; water pump assy products; rear axles shafts; and air, oil, and fuel filters. It also provides head and tail lightings; clutch plates; cover assy products; silencers; brake linings, disc pads, and clutch facings; engine valves, guides, and tappets; steering linkages and steering assy products; power steering assy products and pumps; crank shafts; bearings taper rollers; engine mountings and rubber parts; various types of fasteners and sockets; UJ kits and crown wheel pinions; automotive bearings; air brake equipment and spares; and other related products. The company was founded in 1927 and is based in New Delhi, India.",
    "website": "http://www.jmaindia.com",
    "zipcode": "110055"
  },
  "JMTAUTOLTD.NS": {
    "city": "Jamshedpur",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "JMT Auto Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "JMT AUTO LTD",
    "state": null,
    "summary": "JMT Auto Limited manufactures, sells, and exports motor vehicle parts and accessories in India. It offers engine components, such as cam and crank shaft gears, FIP, gear 2W, gear Acc drives, GHear 2W, and assembly rocker levers; gear components, including speed, over drive, reverse, and reverse idler gears; and axle components comprising assembly coupling flanges, input shafts, helical gears, RA shafts, and shifter forks. The company also provides excavator components consisting of bodies, spindles, carriers, bearings, drums, gear casings, gear rings, housings, pin assembly, planet wheels, covers, axle/assembly pins, and body center joints; and other components, such as seat and frac valves, retainer guide bushes, E pins, inserts, companion flanges, drive shafts, motor and pump drive shafts, oil pump gears, shaft accessory drive idlers, shafts, and assembly flywheels. Its products are used in light, medium, and heavy commercial vehicles, as well as tractors and diesel engines. The company was formerly known as Jamshedpur Metal Treat Limited. The company was founded in 1987 and is based in Jamshedpur, India. JMT Auto Limited is a subsidiary of Amtek Auto Limited.",
    "website": "http://www.jmtauto.com",
    "zipcode": "832109"
  },
  "JTEKTINDIA.NS": {
    "city": "Gurugram",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "JTEKT India Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "JTEKT INDIA LTD",
    "state": null,
    "summary": "JTEKT India Limited manufactures and sells steering systems and other auto components for the passenger car and utility vehicle manufacturers in the automobile sector in India and internationally. The company offers steering gears, columns and RPS assemblies, axle assemblies, and other auto ancillaries. It also exports its products to the United States, Europe, and Japan. The company was formerly known as Sona Koyo Steering Systems Limited and changed its name to JTEKT India Limited in April 2018. The company was founded in 1984 and is headquartered in Gurugram, India. JTEKT India Limited is a subsidiary of JTEKT Corporation.",
    "website": "http://www.jtekt.co.in",
    "zipcode": "122002"
  },
  "KALYANIFRG.NS": {
    "city": "Pune",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Kalyani Forge Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "KALYANI FORGE",
    "state": null,
    "summary": "Kalyani Forge Limited, an engineering company, engages in the manufacture and sale of forged, machined, and assembled products for the automotive, construction, power generation, marine, industrial good, agriculture, and railway industries in India. The company offers engine parts, including connecting rods, crank shafts, cam shafts, retainer valves, cross head valves, injector clamps, rocker arms, balance weights, and cam lobes; and chassis systems, such as idler arms, control arms, steering knuckles, FS arms, and brackets. It also provides turbocharger parts comprising nozzle rings and pipe cast flanges; warm and cold forged parts for fluid flywheels, and wet double clutch; and driveline products consisting of tulips, inner races, tripods, spiders, outer races, yoke shafts, and double yokes. In addition, the company provides steering and suspension products, including stub axles, tie-rod ends, suspension ball joints, universal joints, and pitman arms; and various cold and hot forged parts for industrial applications, such as power tools, conveyors, and compressors. It also exports its products. The company was founded in 1979 and is based in Pune, India.",
    "website": "http://www.kalyaniforge.co.in",
    "zipcode": "411001"
  },
  "LGBBROSLTD.NS": {
    "city": "Coimbatore",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "L.G. Balakrishnan & Bros Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "LG BALAKRISHNA & B",
    "state": null,
    "summary": "L.G. Balakrishnan & Bros Limited manufactures and sells chains, sprockets, and metal formed parts for automotive applications in India and internationally. It operates through Transmission, Metal Forming, and Others segments. The company offers transmission products comprising motorcycle and moped drive chains, timing chains/engine mechanism chains, and automotive kits; sprockets; tensioners; belts; and brake shoes. It also provides metal forming products consisting of fine blanking for precision sheet metal parts; and machined components, as well as wire drawing products for other chain manufacturing plants, spring steel suppliers, umbrella manufacturers, etc. The company markets its products under the Rolon brand name. L.G. Balakrishnan & Bros Limited also exports its products to the United States, European countries, Australia, New Zealand, South Africa, Japan, and the Far and Middle East countries. The company was founded in 1937 and is based in Coimbatore, India.",
    "website": "http://www.lgb.co.in",
    "zipcode": "641006"
  },
  "LUMAXIND.NS": {
    "city": "Gurugram",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Lumax Industries Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "LUMAX INDUSTRIES",
    "state": null,
    "summary": "Lumax Industries Limited manufactures, trades in, and supplies auto components for two and three wheelers, four wheelers, commercial vehicles, and tractors/farm equipment in India and internationally. The company offers automotive lamps, including head and tail lamps, LED lamps, and sundry and other auxiliary lamps. It serves automotive original equipment manufacturers. The company was founded in 1945 and is based in Gurugram, India.",
    "website": "http://www.lumaxworld.in/lumaxindustries/index.html",
    "zipcode": "122016"
  },
  "LUMAXTECH.NS": {
    "city": "New Delhi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Lumax Auto Technologies Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "LUMAX AUTO TECHNOL",
    "state": null,
    "summary": "Lumax Auto Technologies Limited, together with its subsidiaries, manufactures and sells in automotive components for the two, three, and four wheeler industries in India. It offers intake systems, integrated plastic modules, two wheeler chassis and lighting products, gear shifters, seat structures and mechanisms, oxygen sensors, and telematics products and services, as well as electrical and electronics components, and aftermarket products. The company serves original equipment manufacturers and the aftermarket segments. It also exports its products. The company was formerly known as Dhanesh Auto Electricals Limited and changed its name to Lumax Auto Technologies Limited in 2006. Lumax Auto Technologies Limited was founded in 1981 and is based in New Delhi, India.",
    "website": "http://www.lumaxworld.in/lumaxautotech",
    "zipcode": "110046"
  },
  "MAHINDCIE.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Mahindra CIE Automotive Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MAHINDRA CIE AUTO",
    "state": null,
    "summary": "Mahindra CIE Automotive Limited manufactures and supplies automotive components to original equipment manufacturers and other customers in India and Europe. The company offers forging products, such as crankshafts, steering components, and other forged products; stampings, including body systems, chassis systems, and assembly; gears, shafts, and bevel set gears; axle and transmission parts, engine parts, and other products; magnetic products comprise permanent magnet, soft ferrite cores, impeder cores, and magnetic induction lightings; sheet and dough molding compounds; and auto parts, medical equipment covers, and windmill parts. It also provides oil sumps, turbo housings, connecting rods, exhaust mainfolds, passive entry antenna components, synchro hubs, and differential, planetary, and carrier housing products; knuckles/stub axles, brake calipers, spring saddles, hoods, fenders, bonnets, foot plates, front grills, and stamped cabin components; and lift arms, rocker arms, trunion brackets, and toppling cranks. The company offers its products for use in cars, utility vehicles, commercial vehicles, agriculture and off road vehicles, and two-wheelers. The company was formerly known as Mahindra Forgings Limited and changed its name to Mahindra CIE Automotive Limited in November 2013. The company was incorporated in 1999 and is based in Mumbai, India. Mahindra CIE Automotive Limited is a subsidiary of Participaciones Internacionales Autometal Dos S.L.",
    "website": "http://www.mahindracie.com",
    "zipcode": "400055"
  },
  "MAHSCOOTER.NS": {
    "city": "Pune",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Maharashtra Scooters Ltd.",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MAHARASHTRA SCOOT",
    "state": null,
    "summary": "Maharashtra Scooters Ltd. manufactures and sells pressure die casting dies, jigs, fixtures, and components primarily for the two and three wheeler industry in India. It operates through two segments, Manufacturing and Investments. The company also engages in treasury operation business, which manages surplus funds invested by the company. Maharashtra Scooters Ltd. was founded in 1975 and is based in Pune, India. Maharashtra Scooters Ltd. operates as a subsidiary of Bajaj Holdings & Investment Limited.",
    "website": "http://www.mahascooters.com",
    "zipcode": "411035"
  },
  "MENONBE.NS": {
    "city": "Kolhapur",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Menon Bearings Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MENON BEARINGS LTD",
    "state": null,
    "summary": "Menon Bearings Limited manufactures auto components. The company's products include bi-metal engine bearings; bushes and thrust washers for light and heavy automobile engines, and two wheeler engines; and compressors for refrigerators, air conditioners, etc. It also provides high pressure aluminum die cast and machined components, such as motor end shields, compressor bearing connecting rods, engine components, gear case covers, and clutch assemblies; cylinder heads and brake parts; and engine parts, portable tools, fuel pump parts, pressure transmitter parts, temperature transmitter parts, explosion proof parts, etc. The company's products are used in various applications, which include automotive engines, compressors, generators, stationary and marine engines, and agricultural earthmovers and tillers. It also exports its products. Menon Bearings Limited was incorporated in 1991 and is based in Kolhapur, India.",
    "website": "http://www.menonbearings.in",
    "zipcode": "416234"
  },
  "MINDACORP.NS": {
    "city": "Gurugram",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Minda Corporation Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MINDA CORP LTD",
    "state": null,
    "summary": "Minda Corporation Limited manufactures and sells automobile components and parts. It offers electronic and mechanical security systems, including ignition switch cum steering locks, smart key systems, mechatronic handles, and immobilizers systems; die casting components, such as aluminum high pressure die casting and compressor housing products; and starter motors and alternators. The company also provides information and connected systems comprising instrument clusters; wiring harnesses, steering roll connectors, and junction boxes; speed and exhaust gas temperature sensors; and various technology and IoT solutions. In addition, it offers plastics and interiors, which comprise side air vents, center consoles, console air vents, round louvers, center air vents, nozzle defrosters, door sashes, side air vents, oil pans, valve covers, and battery trays, as well as designs and develops related products; and aftermarket products, including filters, clutch plates, bearings, wiper blades, brake shoes, and cables. The company offers its products for two and three wheelers, passenger vehicles, commercial vehicles, and off roaders. It operates India, the rest of Asia, Europe, North America, and South America. The company was formerly known as Minda Switch Auto Pvt. Ltd. and changed its name to Minda Corporation Limited in 2007. Minda Corporation Limited was founded in 1958 and is headquartered in Gurugram, India.",
    "website": "http://sparkminda.com",
    "zipcode": "122016"
  },
  "MINDAIND.NS": {
    "city": "Gurugram",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Minda Industries Limited",
    "market": "in_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MINDA INDUSTRIES",
    "state": null,
    "summary": "Minda Industries Limited, together with its subsidiaries, designs, develops, manufactures, and sells auto components in India and internationally. It provides auto electrical parts, including switches, horns, and lighting products. The company's products include switching systems and handle bar solutions for two/three-wheelers and off-road vehicles; sensors, actuators, and controllers, including start-stop sensors, contact and non-contact type speed sensors, HID ballasts, tire pressure monitoring systems, electronic accelerator pedal modules, DC-DC converters, head lamp levelling motors, and others; and lights for two, three, and four-wheelers, as well as off-road vehicles. It also provides automotive horns for two/four-wheelers, and off-road and commercial vehicles; trumpet and disc horns; alloy wheels; fuel caps; and LPG/CNG kits. In addition, the company offers batteries; lamps; general aluminum castings; 2W and 4W switches; HVAC products; wheel covers; car infotainment systems; air filters and canisters; spoilers; EA pads; air ducts; washer bottles; reverse parking sensors and ADAS products; speakers; air bags; steering wheels; body sealing products; hoses; blow moldings; telematics and connected car solutions; alternate fuel systems; cigarette lighter and socket assemblies; seat belts; shifters; and cameras. It sells its products to original equipment manufacturers. The company was founded in 1958 and is based in Gurugram, India.",
    "website": "http://www.unominda.com",
    "zipcode": "122004"
  },
  "MOTHERSUMI.NS": {
    "city": "Noida",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Motherson Sumi Systems Limited",
    "market": "in_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MOTHERSON SUMI SYS",
    "state": null,
    "summary": "Motherson Sumi Systems Limited engages in the manufacture and sale of components to automotive original equipment manufacturers in India and internationally. It operates in MSSL Standalone, SMR, SMP, PKC, and Others segments. The company provides cutting edge electrical and electronics distribution systems, related components, and associated design services; cockpits, instrument-panel and door-trim modules, decorative interior and exterior parts, bumper fascias, front-end modules, door handles, roof rails, lighting products, and plastic body parts; and basic full plastic types and high value exterior and interior mirrors with various integrated electronic features and aesthetic surfaces, as well as high-performance rearview camera monitoring systems. It also offers a range of products in precision metal-machined parts, metal turning, and plastic metal combined parts for the automotive industry and other industries, including scientific and engineering applications. In addition, the company designs, manufactures, and integrates electrical distribution systems, electronics, and related components for commercial vehicle industries, rolling stock manufacturers, and other related segments. The company was founded in 1986 and is headquartered in Noida, India.",
    "website": "http://www.motherson.com",
    "zipcode": "201301"
  },
  "MRF.NS": {
    "city": "Chennai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "MRF Limited",
    "market": "in_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MRF LTD",
    "state": null,
    "summary": "MRF Limited, together with its subsidiaries, manufactures, distributes, and sells rubber products in India and internationally. The company offers rubber products, such as tyres, tubes, flaps, and tread rubber. It also engages in the paints and coats, toys, motorsports, and cricket training businesses. The company offers tyres for trucks, farm services, LCVs, SCVs, three wheelers, pick up, two wheelers, passenger cars, and OTRs. In addition, it operates MRF TireTok, MRF Tyredrome, MRF FASST, MRF Musclezone, and shops that offer computerized nitrogen inflation, tubeless repair, wheel alignment, wheel balancing and tyre changing, robotic wheel alignment, vehicle safety test lane, diagnostic wheel balancing, A/C recovery and recharging, electronic headlight alignment, nitrogen generation, special two-wheeler tyre changing, credit card facility, wheels removal and refitment, and tyre mounting and de-mounting services. The company sells its products through approximately 4,000 dealer networks. MRF Limited was founded in 1946 and is based in Chennai, India.",
    "website": "http://www.mrftyres.com",
    "zipcode": "600006"
  },
  "MUNJALAU.NS": {
    "city": "Gurugram",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Munjal Auto Industries Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MUNJAL AUTO INDUST",
    "state": null,
    "summary": "Munjal Auto Industries Limited manufactures and sells various parts and accessories for motor vehicles in India. The company operates through Auto Components and Composite Products & Moulds. It offers exhaust systems, steel wheel rims, and spoke wheel rims for two-three wheelers, three-wheelers, and passenger cars; and fuel tank assemblies, seat structure systems, and other products for four-wheelers, as well as sheet metal and tubular welded components. The company serves automotive, renewable energy, aerospace, defense, space, railways, and other engineering sectors. The company was incorporated in 1985 and is based in Gurugram, India. Munjal Auto Industries Limited is a subsidiary of Thakurdevi Investments Private Limited.",
    "website": "http://www.munjalauto.com",
    "zipcode": "122011"
  },
  "MUNJALSHOW.NS": {
    "city": "Gurugram",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Munjal Showa Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MUNJAL SHOWA",
    "state": null,
    "summary": "Munjal Showa Limited designs, manufactures, and sells auto components for the two-wheeler and four-wheeler industry in India and internationally. Its products comprise front forks, rear cushions, shock absorbers, struts, gas springs/rear door lifters, and window balancers. The company was founded in 1985 and is based in Gurugram, India.",
    "website": "http://www.munjalshowa.net",
    "zipcode": "122015"
  },
  "NDRAUTO.NS": {
    "city": "Gurugram",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "NDR Auto Components Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "NDR Auto Components Ltd",
    "state": null,
    "summary": "NDR Auto Components Limited engages in the manufacturing, fabricating, assembling, selling, and trading of automotive components for passenger and utility vehicles in India. It provides seat frames and seat trims for two-wheeler and four wheeler vehicles, as well as spare parts and components for seats. The company was incorporated in 2019 and is based in Gurugram, India.",
    "website": "http://www.ndrauto.com",
    "zipcode": "122015"
  },
  "NRBBEARING.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "NRB Bearings Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "NRB BEARINGS",
    "state": null,
    "summary": "NRB Bearings Limited engages in the manufacture and sale of ball and roller bearings to original equipment manufacturers in India and internationally. The company offers a range of high-precision friction solutions, such as drawn cup needle and cylindrical roller bearings, polyamide and steel needle bearing cages, full-complement needle bearings, formed strip cages for heavy gear boxes, special ball bearings, tapered and spherical roller bearings, planetary shafts and other special pins, crank pins, thrust bearings, and rocker arm bearings. It primarily serves automotive and mobility industries. The company was formerly known as Needle Roller Bearing Company Limited and changed its name to NRB Bearings Limited in 1990. NRB Bearings Limited was founded in 1965 and is based in Mumbai, India.",
    "website": "http://www.nrbbearings.com",
    "zipcode": "400001"
  },
  "OLECTRA.NS": {
    "city": "Secunderabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Olectra Greentech Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "OLECTRA GREENTECH",
    "state": null,
    "summary": "Olectra Greentech Limited manufactures and supplies composite polymer insulators in India. The company operates through Composite Polymer Insulators and Electric Buses segments. It manufactures 1200kV, 330-420kV, 220-245kV, 110-132kV, 52-77kV, 33-36kV, 22-28kV, and 10-15kV insulators for transmission and distribution; and tonne, bracket tube, and stay arm insulators for railways. The also manufactures, markets, and sells electrical buses. In addition, it provides distribution transformers, as well as data analysis and IT consulting services. The company was formerly known as Goldstone Infratech Limited and changed its name to Olectra Greentech Limited in July 2018. Olectra Greentech Limited was founded in 1992 and is headquartered in Secunderabad, India.",
    "website": "http://www.olectra.com",
    "zipcode": "500016"
  },
  "OMAXAUTO.NS": {
    "city": "Gurugram",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Omax Autos Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "OMAX AUTOS LTD",
    "state": null,
    "summary": "Omax Autos Limited engages in the manufacture and sale of auto and non-auto components in India. The company offers various products for commercial vehicle, including chassis assembly, cross member, bumper, cross car beam sub assembly, fender support bracket, holding brackets for number plate and rear tail light, rear cross member, frames and side rail, and sub structure; and products for passenger cars, such as steering and axle shafts, trunk and hood hinges, piston rod, air cleaner mounting bracket, and oil pan. It also provides products for railways and heavy fabrication comprising roof, side wall, underframe, bogie frame, vertical and horizontal dampers, stainless steel benches, Indian and western bio-toilets, electric loco shell, and diesel locomotive. The company exports its products. Omax Autos Limited was founded in 1983 and is headquartered in Gurugram, India.",
    "website": "http://www.omaxauto.com",
    "zipcode": "122001"
  },
  "PPAP.NS": {
    "city": "Noida",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "PPAP Automotive Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PPAP AUTOMOTIVE LT",
    "state": null,
    "summary": "PPAP Automotive Limited manufactures and sells automotive sealing systems, and interior and exterior automotive parts in India. Its automotive sealing systems include weather strip outers, weather strip inner molding roofs, molding windshields, air spoilers, trim door openings, rail component side doors, cowl top seals, sun roof drain hoses, trim door openings, back door openings, weather strip trunk lids, door seals, secondary seals, hood seals, air DAMs, seat liners, roof mouldings, door partitions, CTR uppers, glass run channels, slide rails, door sub seals, door seals, DAM windshields, and waist seal outers. The company's interior and exterior injection molded products comprise door trims, pillar garnishes, lining rear panels, rear trays, trunk sides, tail gates, weather strip partitions, instrument panels, cover engine upper/under, ECU covers, box batteries, molding hoods, fender inners, splash guards, duct cooling products, fuel pipes, cover steering joints, center console with boot components, bumpers, fender linings, fog lamps garnish products, radiator grill garnish products, body side moldings, rear bumper garnish products, wheel covers, door sashes, corner covers, door mouldings, rear pillars, trunk linings, LNG rear panels, CTR pillar lowers, and front pillars. It also exports its products to Japan, Brazil, Mexico, Venezuela, Thailand, the United Kingdom, South Africa, Argentina, and the United States. The company primarily serves automotive manufacturers. The company was formerly known as Precision Pipes and Profiles Co. Ltd. and changed its name to PPAP Automotive Limited in May 2014. PPAP Automotive Limited was founded in 1978 and is based in Noida, India.",
    "website": "http://www.ppapco.in",
    "zipcode": "201305"
  },
  "PRECAM.NS": {
    "city": "Solapur",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Precision Camshafts Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PRECISION CAMSHAF",
    "state": null,
    "summary": "Precision Camshafts Limited manufactures and sells parts of motor vehicle for original equipment manufacturers in India, Asia, China, Europe, and internationally. It offers chilled cast iron, ductile iron, hybrid, and assembled camshafts for the automotive industry; fuel injector components for conventional and DRDi diesel engines; stainless steel components for instrumentation and equipment; prismatic components, such as powertrain, brakes, and chassis components; and balancer shafts and assemblies, as well as electric trucks and buses, and drivelines. The company provides approximately 150 varieties of camshafts for passenger vehicles. The company was founded in 1992 and is based in Solapur, India.",
    "website": "http://www.pclindia.in",
    "zipcode": "413255"
  },
  "PRICOLLTD.NS": {
    "city": "Coimbatore",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Pricol Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PRICOL LTD",
    "state": null,
    "summary": "Pricol Limited, together with its subsidiaries, manufactures and sells instrument clusters and other allied automobile components to original equipment manufacturers and replacement markets primarily in India. The company provides driver information systems and sensors, including fuel level sensors, speed and position sensors, pressure sensors and switches, temperature sensors and switches, body control modules, and oxygen sensors; and pumps and allied products, such as auto decompression units, auto fuel cocks, chain tensioners, fuel feed pumps, fuel pump modules, oil pumps, pressure relief valves, exhaust gas recirculation valves, water pumps, electric water pumps, cabin tilt systems, and automated lubrication systems. In addition, it offers telematics solutions comprising OBD II telematics products, intelligent transportation systems, and off-road equipment construction solutions; and wiping systems, including front wiper motors, rear wiper motors, compact front wiper motors, new concept rear wiper motors, and heavy duty wiper systems. The company provides its products for two wheelers, three wheelers, four wheelers, commercial vehicles, tractors, and off-road vehicles, as well as for heavy duty industrial and construction equipment applications. It also exports its products. The company was formerly known as Pricol Pune Limited and changed its name to Pricol Limited in November 2016. Pricol Limited was founded in 1975 and is based in Coimbatore, India.",
    "website": "http://www.pricol.com",
    "zipcode": "641018"
  },
  "RANEENGINE.NS": {
    "city": "Chennai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Rane Engine Valve Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "RANE ENGINE VALVES",
    "state": null,
    "summary": "Rane Engine Valve Limited, together with its subsidiaries, manufactures and supplies auto components for the internal combustion engine industry. The company offers engine valves, valve guides, and tappets for passenger cars, commercial vehicles, farm tractors, stationary engines, railway/marine engines, and two/three wheelers. The company was founded in 1959 and is headquartered in Chennai, India. It serves original equipment manufacturer and aftermarkets in India and internationally. Rane Engine Valve Limited is a subsidiary of Rane Holdings Limited.",
    "website": "http://www.ranegroup.com/revl",
    "zipcode": "600032"
  },
  "RANEHOLDIN.NS": {
    "city": "Chennai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Rane Holdings Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "RANE HOLDINGS LTD",
    "state": null,
    "summary": "Rane Holdings Limited, together with its subsidiaries, manufactures and markets automotive components for the transportation industry in India and internationally. It offers steering and suspension systems comprising manual steering gears, steering linkages, suspension components, hydraulic products, power steering fluid- power cruises, intermediate shafts, and universal joint assemblies; hydraulic power rack and pinion steering gear, power steering gear, and power steering pump assemblies; and electric power steering, solid steering, energy absorbing and collapsible, and tilt and telescopic steering columns. The company also provides valve train components, including engine valves, and valve guides and mechanical tappets, as well as large engine valves for power generation, marine, and special applications; friction material products, such as brake linings, disc pads, railways brake blocks, clutch facings, and brake pads; and seat belts and air bags. In addition, it offers light metal casting products comprising hydraulic pinion housings, pump housings, EPAS outboard and pinion housings, luminaries, timing case covers, engine oil sumps, gear cases, brake and transmission housings, and valve and battery housings; telematics solutions; and aftermarket products consisting of chassis and engine parts. It primarily serves passenger and commercial vehicles, farm tractors, two and three wheelers, and railways and stationary engines industry segments. The company was formerly known as Rane (Madras) Limited and changed its name to Rane Holdings Limited in July 2004. Rane Holdings Limited was founded in 1929 and is headquartered in Chennai, India.",
    "website": "http://www.ranegroup.com",
    "zipcode": "600086"
  },
  "RBL.NS": {
    "city": "Chennai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Rane Brake Lining Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "RANE BRAKE LINING",
    "state": null,
    "summary": "Rane Brake Lining Limited manufactures and markets auto components to original equipment manufacturers and aftermarket customers in India and internationally. It offers friction material products, such as linings, disc pads, clutch facings, clutch buttons, and brake shoes and blocks for passenger vehicles, utility vehicles, commercial vehicles, two wheelers, and railways. It also exports its products. The company was formerly known as Rane Brake Products Limited and changed its name to Rane Brake Lining Limited in February 2008. The company was founded in 1964 and is headquartered in Chennai, India.",
    "website": "http://ranegroup.com/rane-brake-lining-limited/",
    "zipcode": "600086"
  },
  "REMSONSIND.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Remsons Industries Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "REMSONS INDS",
    "state": null,
    "summary": "Remsons Industries Limited manufactures and sells automotive components parts and its products in India. The company offers clutch, accelerator/throttle/gasoline, front and rear parking brake, shift and reverse gear, choke, engine stop, speedometer, fare meter, de-compressor, body, HVAC, door, pull-to-stop, drive change, and seat cables for use in two, three, and four wheelers; and light, medium, and heavy commercial vehicles, as well as in construction, mining, and farm equipment. It also provides flexible shafts that are used in speedometers, tachometers, power tools/machineries, power seats, and farm and earth moving equipment; gear shift systems and push pull cables, which are used in passenger cars and rear engine buses, as well as in light, medium, and heavy commercial vehicles. The company exports its products to Sri Lanka, Bangladesh, Russia, Kenya, France, Italy, Singapore, Spain, the United Kingdom, Nepal, the United States, and the United Arab Emirates. Remsons Industries Limited was founded in 1959 and is headquartered in Mumbai, India.",
    "website": "http://www.remsons.com",
    "zipcode": "400057"
  },
  "RICOAUTO.NS": {
    "city": "Gurugram",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Rico Auto Industries Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "RICO AUTO INDS",
    "state": null,
    "summary": "Rico Auto Industries Limited, an engineering company, manufactures and supplies high precision fully machined aluminum, and ferrous components and assemblies to automotive original equipment manufacturers worldwide. Its integrated services include the design, development, tooling, casting, machining, assembly, and research and development of aluminum and ferrous products. The company offers oil pump assemblies, fuel system parts, lube oil filter heads, exhaust manifolds, turbine housings, center housings, back plates, crank cases and covers, cylinder head covers, oil pans, intake manifold covers, front covers, valve covers, side covers, balance shafts assemblies, gear housings, and main bearing caps, as well as water, air connections, and pressure plates. It also provides flywheels, timing cases, oil filter adaptors, engine brackets, cylinder blocks, cylinder heads, clutch assemblies, automatic transmission bracket assemblies, differential case housings, gear shifts forks, wheel hubs assemblies, brake panel assemblies, brake discs, drums, and steering knuckles. In addition, the company offers tank track shoe, fuze body, and fuze assembly products. It serves two wheeler, three wheeler, passenger car, and commercial vehicle customers, as well as system suppliers. Rico Auto Industries Limited was incorporated in 1983 and is based in Gurugram, India.",
    "website": "http://www.ricoauto.com",
    "zipcode": "122001"
  },
  "RML.NS": {
    "city": "Chennai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Rane (Madras) Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "RANE(MADRAS)LTD",
    "state": null,
    "summary": "Rane (Madras) Limited manufactures and sells auto components in India. It offers mechanical steering gears, hydrostatic steering systems, and steering and suspension linkage products; low porosity and high-quality aluminum die castings, such as steering housings and engine case covers; and high-pressure aluminum die-casting components. The company markets and sells its products to the manufacturers of passenger cars, utility vehicles, and farm tractors. It also exports its products. The company was founded in 1960 and is headquartered in Chennai, India. Rane (Madras) Limited is a subsidiary of Rane Holdings Limited.",
    "website": "http://ranegroup.com/rane-madras-limited",
    "zipcode": "600042"
  },
  "SANDHAR.NS": {
    "city": "Gurugram",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Sandhar Technologies Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SANDHAR TECHNOLOGI",
    "state": null,
    "summary": "Sandhar Technologies Limited, together with its subsidiaries, designs, manufactures, assembles, and sells automotive components in India and Europe. It offers locking systems, hinges and latches, and door handles, as well as vision systems; sheet metal components; zinc, aluminum, and magnesium die casting products; plastic injection moulded components; and commercial tooling products, such as plastic molds, and zinc and aluminum PDC dies, as well as painting, plating, and coating solutions. The company also provides operator cabins and structural parts, such as canopies, housings, panels, switchboards, control cabinets, and various type of hi-precision sheet metal components; automotive optoelectronic products, including AVN panels, keyless entry systems, reverse park assist systems, blind spot detection systems, and tire pressure monitoring systems and others; and fuel pumps, starter motors, ACG, oil filters, and wiper blades. In addition, it offers wheel rims and assemblies, clutches, fender assemblies, brakes, helmets, and electric vehicle components. The company supplies components to original equipment manufacturers in two wheelers, four wheelers, and passenger and commercial vehicle industries. The company was founded in 1987 and is based in Gurugram, India.",
    "website": "http://www.sandhargroup.com",
    "zipcode": "122002"
  },
  "SETCO.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Setco Automotive Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SETCO AUTOMOTIVE",
    "state": null,
    "summary": "Setco Automotive Limited manufactures and sells clutches for commercial vehicles in India and internationally. It offers clutch products and systems, pressure converters, and precision components. The company primarily offers its products under the LIPE and Lava Cast brand names. It serves commercial and military trucks, heavy-medium-light-duty trucks, marine, off highway, and agricultural equipment sectors. The company was formerly known as Gujrat Setco Clutch Limited and changed its name to Setco Automotive Limited in November 2005. SETCO Automotive Limited was founded in 1982 and is headquartered in Mumbai, India.",
    "website": "http://www.setcoauto.com",
    "zipcode": "400034"
  },
  "SHARDAMOTR.NS": {
    "city": "New Delhi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Sharda Motor Industries Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SHARDA MOTOR INDUS",
    "state": null,
    "summary": "Sharda Motor Industries Limited manufactures, assembles, and sells auto components and white goods components to automobiles and electronics original equipment manufacturers in India. It offers exhaust systems for passenger vehicles, commercial vehicles, and tractors; suspensions systems, such as arm lower control comp, arm and axle assy, and rear and front suspensions; and canopies, seat trim and seat assembly, rear seats, front cushion, hinge assly rear back, frame comp rear back, and riser, as well as catalytic converters, seat covers for two wheelers and four wheelers, and pressed part white goods products. The company also exports its products. Sharda Motor Industries Limited was founded in 1986 and is based in New Delhi, India.",
    "website": "http://www.shardamotor.com",
    "zipcode": "110020"
  },
  "SHIVAMAUTO.NS": {
    "city": "Gurugram",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Shivam Autotech Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SHIVAM AUTOTECH LT",
    "state": null,
    "summary": "Shivam Autotech Limited manufactures and sells auto transmission components primarily for original equipment manufacturers in India and internationally. It offers transmission gears and shafts; spline shafts; plungers; and power train, alternator, starter motor, magneto, and steering components, as well as various precision engineering components. The company was founded in 1999 and is headquartered in Gurugram, India. Shivam Autotech Limited is a subsidiary of Dayanand Munjal Investments Private Limited.",
    "website": "http://www.shivamautotech.com",
    "zipcode": "122102"
  },
  "SHRIPISTON.NS": {
    "city": "New Delhi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Shriram Pistons & Rings Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SHRIRAM PISTONS &",
    "state": null,
    "summary": "Shriram Pistons & Rings Limited manufactures and sells automotive components in India. It offers pistons, piston pins, piston rings, and engine valves. The company also exports its products. It serves OEMs operating in the passenger vehicle, two/three wheeler, commercial vehicle, tractor, and industrial engine markets. The company was incorporated in 1963 and is headquartered in New Delhi, India.",
    "website": "http://www.shrirampistons.com",
    "zipcode": "110001"
  },
  "SINTERCOM.NS": {
    "city": "Pune",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Sintercom India Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Sintercom India Limited",
    "state": null,
    "summary": "Sintercom India Limited manufactures and sells sintered metal components and auto components for various automobile applications primarily in India. The company offers engine components, including drive gears, chain sprockets, belt pulleys, and engine shaft bearing caps; transmissions components, such as synchroniser hubs, dog rings, and drive-train gears for 2-wheeler and 4-wheeler automobile platforms; and components of exhaust systems, sensor bosses, and sensor parts for various vehicle platforms. It also provides components in automotive auxiliary applications, helical pulleys for electric power steering applications, and high precision components for actuators; soft magnetic composite components and assemblies for applications in electric motors; and powder metal components for sensors. In addition, the company offers crankshaft bearing journals, transmission gears, and synchro hubs, as well as ABS rings and sensor hego bosses and flanges. It primarily serves original equipment manufacturers. Sintercom India Limited was founded in 2007 and is based in Pune, India.",
    "website": "http://www.sintercom.co.in",
    "zipcode": "410507"
  },
  "SPTL.NS": {
    "city": "Kalol",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Sintex Plastics Technology Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SINTEX PLASTICS TE",
    "state": null,
    "summary": "Sintex Plastics Technology Limited, together with its subsidiaries, manufactures and sells plastic products in India, the United States, and Europe. The company operates in two segments, Custom Moulding Business; and Infra, Prefab & Other Business. It offers water storage, interior, electrical and SMC, environmental and green, and industrial plastic products; prefabs for various applications; and automobile parts, such as trims and pillars, exterior trims, radiator grills, instrument panel, integrated design and engineering, small precision parts, under the hood and assembly parts, two-wheeler parts, and other products. The company is also involved in the trading of custom moulded plastics products. It serves aerospace and defense, transportation, renewable energy, water storage and transportation, building construction, and electrical power distribution industries. The company was formerly known as NEEV Educare Limited. The company was founded in 1931 and is headquartered in Kalol, India.",
    "website": "http://www.sintexplastics.com",
    "zipcode": "382721"
  },
  "SSWL.NS": {
    "city": "Chandigarh",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Steel Strips Wheels Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "STEEL STRIPS WHEEL",
    "state": null,
    "summary": "Steel Strips Wheels Limited designs, manufactures, and sells automotive steel wheel rims and alloy wheel rims in India and internationally. It offers wheels for two and three wheelers, passenger cars, multi utility vehicles, tractors, off road vehicles, and light and heavy commercial vehicles, as well as provides alloy wheels rims for passenger cars, and MUV's and caravan vehicles. Steel Strips Wheels Limited was incorporated in 1985 and is headquartered in Chandigarh, India.",
    "website": "http://www.sswlindia.com",
    "zipcode": "160019"
  },
  "SUBROS.NS": {
    "city": "New Delhi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Subros Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SUBROS LTD",
    "state": null,
    "summary": "Subros Limited manufactures and sells thermal products for automotive applications in India. The company offers compressors; automotive condensers; heating, ventilating, and air conditioning (AC) systems, such as heaters, evaporators, and blower units; tubes and hoses; bus ACs; driver cabin ACs for railway engines; commercial and residential ACs; water dispensers; transport refrigeration systems; truck cabin AC systems; and off-roader AC systems. It also exports its products. Subros Limited was founded in 1985 and is headquartered in New Delhi, India.",
    "website": "http://www.subros.com",
    "zipcode": "110001"
  },
  "SUNCLAYLTD.NS": {
    "city": "Chennai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Sundaram-Clayton Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SUNDARAM CLAYTON",
    "state": null,
    "summary": "Sundaram-Clayton Limited manufactures and markets machined and sub-assembled aluminum castings in India. It operates through Automotive Vehicles and Parts, Automotive Components, Financial Services, and Others segments. The company also offers automotive vehicles and components, as well as spare parts and accessories; and housing development and financial services. It serves heavy and medium commercial vehicle, passenger car, and two-wheeler markets. The company exports its products internationally. Sundaram-Clayton Limited was founded in 1962 and is based in Chennai, India.",
    "website": "http://www.sundaram-clayton.com",
    "zipcode": "600006"
  },
  "SUNDRMBRAK.NS": {
    "city": "Chennai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Sundaram Brake Linings Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SUNDARAM BRAKE LIN",
    "state": null,
    "summary": "Sundaram Brake Linings Limited manufactures and sells asbestos free friction materials in India. The company's products include brake linings, brake pads, clutch facings, and PV linings and pads. Its products are used in commercial vehicles, passenger cars, agricultural tractors, railways, and two wheelers. The company also exports its products to approximately 54 countries worldwide. Sundaram Brake Linings Limited was incorporated in 1974 and is headquartered in Chennai, India.",
    "website": "http://www.tvsbrakelinings.com",
    "zipcode": "600050"
  },
  "SUNDRMFAST.NS": {
    "city": "Chennai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Sundram Fasteners Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SUNDRAM FASTNERS",
    "state": null,
    "summary": "Sundram Fasteners Limited manufactures and sells precision components for the automotive, infrastructure, windmill, and aviation sectors in India, China, Germany, the United States, the United Kingdom, Italy, France, and Brazil. Its products include high tensile fasteners comprising wind energy, automotive, and aerospace and aviation fasteners; cold extruded parts, including gear blanks, transmission shafts, cams, starter sleeves and pinions, CV join parts, and fan hubs; and hot forged parts consisting of bevel gears and pinions, hub rings, clutch hubs, crankshafts sprockets, turbocharger parts, and connecting rods. It also provides powertrain components, such as turbine and output shafts, sungear shafts, and slip yokes; metal and nylon radiator caps radiator caps; and powder metallurgy parts, as well as offers pumps and assemblies for passenger cars, heavy and light commercial vehicles, off-road vehicles, tractors, combines, harvesters, forklifts, marine engines, power generation engines and two- wheelers. In addition, the company engages in the generation of power using non-conventional sources; and manufacture of parts for aerospace and defense. Further, it provides financial and software services; bearing houings; and spokes and nipples, automobile kits, dowels and rollers, small screws, and tools. The company was incorporated in 1962 and is headquartered in Chennai, India.",
    "website": "http://www.sundram.com",
    "zipcode": "600004"
  },
  "SUPRAJIT.NS": {
    "city": "Bengaluru",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Suprajit Engineering Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SUPRAJIT ENG LTD",
    "state": null,
    "summary": "Suprajit Engineering Limited manufactures, sells, and exports automotive cables and components to original equipment manufacturers in India, the United States, the United Kingdom, Germany, Luxembourg, and internationally. It provides control cables, speedo cables, auto and halogen lamps, non-automotive cables, and other components for automobiles. The company was incorporated in 1985 and is based in Bengaluru, India.",
    "website": "http://www.suprajit.com/suprajit-group/suprajit-engineering",
    "zipcode": "560099"
  },
  "SWARAJENG.NS": {
    "city": "Mohali",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Swaraj Engines Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SWARAJ ENGINES",
    "state": null,
    "summary": "Swaraj Engines Limited manufactures and sells diesel engines, diesel engine components, and spare parts for tractors in India. The company was incorporated in 1985 and is based in Mohali, India.",
    "website": "http://www.swarajenterprise.com",
    "zipcode": "160055"
  },
  "TALBROAUTO.NS": {
    "city": "Gurugram",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Talbros Automotive Components Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "TALBROS AUTO",
    "state": null,
    "summary": "Talbros Automotive Components Limited manufactures and sells auto components and parts in India and internationally. It offers cylinder head, multi-layer steel, exhaust manifold, rubber molded, edge molded, secondary, new technology, and hot gaskets, as well as heat shields; and forgings, such as kingpins, gear blanks, housings and yoke shafts, companion flanges, bevel pinions, hubs, assembly products, tube yokes, connecting rods and caps, and integral connecting rods. The company also provides suspension systems comprising control arms, steering knuckles, front cross members, twist beam rear axles, and wheel group and semi corner module assemblies; and anti-vibration products comprising mufflers and hangers, suspension bushes, rubber bushes, strut mounts, engine mounts, and hoses, as well as chassis systems. It offers its products for use in two and three wheelers, passenger and commercial vehicles, and farm equipment, as well as serves original equipment manufacturers. The company also exports its products. Talbros Automotive Components Limited was founded in 1956 and is based in Gurugram, India.",
    "website": "http://www.talbros.com",
    "zipcode": "122016"
  },
  "TIINDIA.NS": {
    "city": "Chennai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Tube Investments of India Limited",
    "market": "in_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "TUBE INVESTMENTS O",
    "state": null,
    "summary": "Tube Investments of India Limited manufactures and sells cycles and accessories, steel strips and tubes, and metal formed products in India. It operates through three segments: Cycles and Accessories, Engineering, and Metal Formed Products. The Cycles and Accessories segment offers standard bi-cycles; special bi-cycles, such as alloy bikes; specialty performance bikes; and fitness equipment. The Engineering segment provides cold rolled steel strips and precision steel tubes, including cold drawn welded tubes and electric resistance welded tubes. The Metal Formed Products segment offers automotive and industrial chains, fine blanked and stamped products, roll-formed car doorframes, and cold rolled formed sections for railway wagons and passenger coaches. It also provides power transmission products, which include gears, gearboxes, geared motors, and gear assemblies. The company operates Track & Trail Urban, Track & Trail Sport, and BSA Hercules Rural outlets, as well as www.trackandtrail.in. It serves kids, adolescent boys and girls, and urban adults. In addition, the company exports its bicycles, tubes, and industrial chains to other countries in Asia, Europe, and the Americas. Tube Investments of India Limited was incorporated in 2008 and is based in Chennai, India.",
    "website": "http://www.tiindia.com",
    "zipcode": "600001"
  },
  "TVSSRICHAK.NS": {
    "city": "Chennai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "TVS Srichakra Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "TVS SRICHAKRA LTD",
    "state": null,
    "summary": "TVS Srichakra Limited manufactures and sells two-wheeler, three-wheeler, and other industrial tires and tubes to original equipment and vehicle manufacturers in India. It offers motorcycle, scooter, moped, industrial pneumatic, loader service, skid steer, tractor, lawn and garden, farm, agro industrial, farm and implement, flotation, multipurpose, motor grader, compactor, road grader, earthmover, solid resilient, light truck, and sand tires. The company also exports its products. TVS Srichakra Limited was incorporated in 1982 and is based in Chennai, India.",
    "website": "http://www.tvseurogrip.com",
    "zipcode": "600018"
  },
  "UCALFUEL.NS": {
    "city": "Chennai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Ucal Fuel Systems Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "UCAL FUEL SYSTEMS",
    "state": null,
    "summary": "Ucal Fuel Systems Limited provides fuel management systems for the automotive sector in India. The company offers multi point fuel injection parts, including throttle body assemblies, fuel rail assemblies, high pressure fuel filters, pressure regulators, and pulsation dampers; carburetors; and emission control products, such as positive crankcase ventilation valves and intake manifolds for four wheelers. It also provides carburetors; emission control products comprising secondary air valves; and EMS system products that include throttle bodies, fuel pumps, air compressors, and fuel rail assemblies for two/three wheelers. In addition, the company offers carburetors and electronic solenoid fuel pumps for gensets; oil, vacuum, and water pump assemblies, as well as fuel pumps; high pressure die casting products, which comprise air intake and steering systems, turbochargers, and emission control and other products; and precision machined products, such as shaft second clutches, housing spring and body injectors, and transmission and rocker arm shafts. It also exports its products. Ucal Fuel Systems Limited was founded in 1985 and is headquartered in Chennai, India.",
    "website": "http://www.ucalfuel.com",
    "zipcode": "600002"
  },
  "VARROC.NS": {
    "city": "Aurangabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Varroc Engineering Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "VARROC ENGINEERING",
    "state": null,
    "summary": "Varroc Engineering Limited designs, manufactures, and supplies exterior lighting systems, plastic and polymer components, electrical and electronics components, and precision metallic components worldwide. It operates through Automotive and Others segments. The company offers unpainted and painted body parts; exterior and interior systems; seating systems; mirror systems; air filters; automotive accessories; lighting systems; instrument clusters; catalytic converters; switches; motors and magnetos; electronics; traction motors and controllers; DC-DC converters; and engine valves. It also provides precision-forged and machined parts for engine and transmissions to two-wheelers; four-cylinder crankshafts for commercial vehicles and stationary engines; and crank pins, connecting rods, flanges, ring gears, crankshafts, camshafts, knuckles, front axle beams, and hydraulic components, as well as head and signal lamps. The company serves passenger car, commercial vehicle, two-wheeler, three-wheeler, and off-highway vehicle original equipment manufacturers. Varroc Engineering Limited was founded in 1988 and is headquartered in Aurangabad, India.",
    "website": "http://www.varroc.com",
    "zipcode": "431136"
  },
  "WABCOINDIA.NS": {
    "city": "Chennai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "WABCO India Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "WABCO INDIA LTD",
    "state": null,
    "summary": "WABCO India Limited designs, develops, manufactures, and sells air brake actuation systems for commercial vehicles in India and internationally. Its conventional products include automatic slack adjusters; spring brake actuators and double diaphragm spring brake actuators; brake chambers; valves, such as relay emergency, trailer control, graduated hand control, automatic load sensing, relay, and dual brake valves; drying and distribution units; and air compressors. The company also provides advanced braking systems comprising anti-lock braking systems and electronic braking systems; air suspension products, such as electronically controlled air suspension products and lift axle control valves; and driveline controls, such as clutch controls and integrated pedal units, as well as OptiDrive, a modular automated transmission system. In addition, it offers aftermarket services, including original parts, repair, diagnostics, and services through a network of approximately 7,000 outlets and 280 service centers; and software development and other services. The company was formerly known as WABCO-TVS (INDIA) Limited and changed its name to WABCO India Limited in August 2011. The company was formerly known as WABCO-TVS (INDIA) Limited and changed its name to WABCO India Limited in August 2011. WABCO India Limited was founded in 1962 and is headquartered in Chennai, India. WABCO India Limited is a subsidiary of WABCO Asia Private Limited.",
    "website": "http://www.wabco-auto.com/en/wabcoindia",
    "zipcode": "600058"
  },
  "WHEELS.NS": {
    "city": "Chennai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Auto Parts",
    "long_name": "Wheels India Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "WHEELS INDIA LTD",
    "state": null,
    "summary": "Wheels India Limited manufactures and sells automotive and industrial components in India and internationally. The company offers steel wheels for use in heavy and light vehicles, as well as for agricultural applications; off-road construction wheels, wire wheels, and forged aluminum wheels; air suspension systems for buses, trucks and trailers, control and specialty products, and other vehicle applications; and wind turbines and machined components for various other applications. It also provides beams, boxes, columns, auto welded and manually welded plates, and rolled sections; and fabrication services for construction and mining equipment sector. Wheels India Limited was incorporated in 1960 and is based in Chennai, India.",
    "website": "http://www.wheelsindia.com",
    "zipcode": "600050"
  }
}
