{
    "ASHOKLEY.NS": {
        "short_name": "ASHOK LEYLAND",
        "long_name": "Ashok Leyland Limited",
        "summary": "Ashok Leyland Limited, together with its subsidiaries, manufactures and sells commercial vehicles in India and internationally. The company offers city, inter-city, school and college, staff, tourist, stage carrier, and airport buses; haulage and ICV distribution trucks, as well as tractors and tippers; light and small commercial vehicles, goods carriers, and passenger vehicles; and defense vehicles comprising logistics, high mobility, armored, light tactical, tracked, and simulator vehicles. It also provides power solutions, such as diesel generators, agriculture engines, industrial engines, and marine engines; spare parts, trailer axle and suspension kits, repair kits, and retro fitment kits; and vehicle and housing financing services. In addition, the company trades in commercial vehicles; offers manpower supply services and air chartering services; and driver training services. Further, it operates retail stores; and LeyKart, an e-commerce store for spare parts. The company was founded in 1948 and is based in Chennai, India. Ashok Leyland Limited is a subsidiary of Hinduja Automotive Limited.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600032",
        "website": "http://www.ashokleyland.com",
        "full_time_employees": 12005
    },
    "ATULAUTO.NS": {
        "short_name": "ATUL AUTO LTD",
        "long_name": "Atul Auto Limited",
        "summary": "Atul Auto Limited manufactures and sells three wheeler automobiles in India. The company offers passenger and cargo carriers, and pickup and delivery vans, as well as automotive parts and accessories. Its products are diesel, petrol, CNG, LPG, and electric fueled vehicles. The company offers its products under the Atul Shakti, Atul Gem, Atul Gemini, and Atul Elite brand names. Atul Auto Limited also exports its products to Mexico, Madagascar, Nepal, Honduras, Nigeria, South Africa, Bangladesh, Kenya, the Democratic Republic of the Congo, Egypt, Ecuador, the United Kingdom, Ethiopia, Peru, Guatemala, etc. The company was incorporated in 1986 and is headquartered in Rajkot, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Rajkot",
        "zipcode": "360024",
        "website": "http://www.atulauto.co.in",
        "full_time_employees": 993
    },
    "BAJAJ-AUTO.NS": {
        "short_name": "BAJAJ AUTO LTD",
        "long_name": "Bajaj Auto Limited",
        "summary": "Bajaj Auto Limited, together with its subsidiaries, develops, manufactures, and distributes automobiles in India. It operates through two segments, Automotive and Investments. The company offers motorcycles, and three and four wheeler commercial vehicles, as well as spare parts. It also exports its products to approximately 79 countries in Latin America, Africa, South Asia, the Middle East, Europe, and the Asia Pacific. The company was founded in 1945 and is based in Pune, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411035",
        "website": "http://www.bajajauto.com",
        "full_time_employees": null
    },
    "EICHERMOT.NS": {
        "short_name": "EICHER MOTORS",
        "long_name": "Eicher Motors Limited",
        "summary": "Eicher Motors Limited manufactures and sells motorcycles and commercial vehicles in India and internationally. The company owns the Royal Enfield motorcycle brand that offers Classic, Bullet, Himalayan, Interceptor INT 650, Continental GT 650, and Thunderbird models. It designs, develops, manufactures, assembles, and sells two-wheelers, as well as sells related parts and accessories. The company, through its joint venture, Volvo Eicher Commercial Vehicles Limited, manufactures and sells light and medium duty trucks, heavy duty trucks, and buses under the Eicher brand; Volvo trucks; and engineering components and aggregates. Eicher Motors Limited was founded in 1948 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122001",
        "website": "http://www.eichermotors.com",
        "full_time_employees": 4899
    },
    "FORCEMOT.NS": {
        "short_name": "FORCE MOTORS LTD",
        "long_name": "Force Motors Limited",
        "summary": "Force Motors Limited, an integrated automobile company, designs, develops, manufactures, and sells a range of vehicles, automotive components, and aggregates in India. It offers light commercial vehicles, including passanger carrier, school bus, ambulance, and goods carrier; multi-utility vehicles; small commercial vehicles; special vehicles; and agricultural tractors. The company offers its products under the Traveller Monobus, Traveller, TRAX, Gurkha, Balwan, and Kargo King brands. Force Motors Limited also exports its products to various countries in the Middle East, Asia, Latin America, and Africa. The company was founded in 1958 and is based in Pune, India. Force Motors Limited is a subsidiary of Jaya Hind Industries Limited.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411035",
        "website": "http://www.forcemotors.com",
        "full_time_employees": 4737
    },
    "HEROMOTOCO.NS": {
        "short_name": "HERO MOTOCORP LTD",
        "long_name": "Hero MotoCorp Limited",
        "summary": "Hero MotoCorp Limited designs, develops, manufactures, assembles, and sells vehicles in India. It offers motorcycles and scooters. The company also provides engines, as well as related parts and accessories. It also exports its products to countries in Asia, Africa, the Middle East, and the South and Central America. Hero MotoCorp Limited has a strategic partnership with Gogoro Inc. to enhance the shift to sustainable electric mobility in India. The company was formerly known as Hero Honda Motors Ltd. and changed its name to Hero MotoCorp Limited in July 2011. Hero MotoCorp Limited was incorporated in 1984 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110070",
        "website": "http://www.heromotocorp.com",
        "full_time_employees": 8599
    },
    "HINDMOTORS.NS": {
        "short_name": "HINDUSTAN MOTORS",
        "long_name": "Hindustan Motors Limited",
        "summary": "Hindustan Motors Limited manufactures and sells vehicles and related spare parts, and steel products and components in India. The company offers passenger cars under the Ambassador name; and light commercial vehicles under the Winner name. It also provides grey iron, SG iron, steel, and aluminum pressure die castings for passenger cars, LCVs, HCV, and tractor segments; and intricate castings, such as 3-cylinder and 4-cylinder blocks, heads, gear box housings, manifolds, SG iron casings, covers, wheel hubs, aluminum gear box extensions, steering arms, etc. In addition, the company offers profile forgings for passenger car, LCV, HCV, and tractor segments; and intricate forgings, such as 2-cylinder, 3-cylinder, and 4-cylinder crankshafts, as well as camshafts, stub axles, spindles, draw hooks, and various types of gears and shafts. Further, it is involved in the trading of spare parts of vehicles. The company was founded in 1942 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700001",
        "website": "http://www.hindmotor.com",
        "full_time_employees": 360
    },
    "M&M.NS": {
        "short_name": "MAHINDRA &MAHINDRA",
        "long_name": "Mahindra & Mahindra Limited",
        "summary": "Mahindra & Mahindra Limited engages in the automotive and farm equipment businesses in India and internationally. The company operates through Automotive, Farm Equipment, Financial Services, Hospitality, Real Estate, and Others segments. It offers aircrafts, and airframe parts and assemblies; passenger and commercial vehicles, trucks, buses, vans, cars, utility vehicles, and electric vehicles; personal and commercial watercrafts; motorcycles and scooters; construction equipment, such as backhoe loaders under the Mahindra EarthMaster brand name; road construction equipment comprising motor graders under the Mahindra RoadMaster brand. The company also provides land systems, naval systems, defense electronics, and security consulting services for defense industry; pre-owned car and car services; and farm equipment, including tractors, farm machineries, spare parts, and related services. In addition, it operates M2All, an e-commerce platform for various portfolio of products; approximately 46 resorts; and solar PV projects. Further, the company offers financial products and services comprising retail and other loans, SME finance, housing finance, mutual funds, vehicle and equipment finance, and life and non-life insurance broking services; logistics services; consulting services; and information technology services, as well as power back up solutions, such as diesel generators and gas powered gensets. Additionally, it engages in the project development, management, operation, and leasing of commercial and residential complexes; sale of timeshare and vacation ownership; making, processing, and trading of steel for automotive, non-automotive, and power industries. The company has a strategic alliance with Ford Motor Company. The company was founded in 1945 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400018",
        "website": "http://www.mahindra.com",
        "full_time_employees": 256000
    },
    "MAHMF": {
        "short_name": "MAHINDRA & MAHINDRA",
        "long_name": "Mahindra & Mahindra Limited",
        "summary": "Mahindra & Mahindra Limited engages in the automotive and farm equipment businesses in India and internationally. The company operates through Automotive, Farm Equipment, Financial Services, Hospitality, Real Estate, and Others segments. It offers aircrafts, and airframe parts and assemblies; passenger and commercial vehicles, trucks, buses, vans, cars, utility vehicles, and electric vehicles; personal and commercial watercrafts; motorcycles and scooters; construction equipment, such as backhoe loaders under the Mahindra EarthMaster brand name; road construction equipment comprising motor graders under the Mahindra RoadMaster brand. The company also provides land systems, naval systems, defense electronics, and security consulting services for defense industry; pre-owned car and car services; and farm equipment, including tractors, farm machineries, spare parts, and related services. In addition, it operates M2All, an e-commerce platform for various portfolio of products; approximately 46 resorts; and solar PV projects. Further, the company offers financial products and services comprising retail and other loans, SME finance, housing finance, mutual funds, vehicle and equipment finance, and life and non-life insurance broking services; logistics services; consulting services; and information technology services, as well as power back up solutions, such as diesel generators and gas powered gensets. Additionally, it engages in the project development, management, operation, and leasing of commercial and residential complexes; sale of timeshare and vacation ownership; making, processing, and trading of steel for automotive, non-automotive, and power industries. The company has a strategic alliance with Ford Motor Company. The company was founded in 1945 and is headquartered in Mumbai, India.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400018",
        "website": "http://www.mahindra.com",
        "full_time_employees": 256000
    },
    "MARUTI.NS": {
        "short_name": "MARUTI SUZUKI IND",
        "long_name": "Maruti Suzuki India Limited",
        "summary": "Maruti Suzuki India Limited manufactures, purchases, and sells motor vehicles, components, and spare parts primarily in India, rest of Asia, Europe, Africa, Oceania, and Latin America. The company offers passenger vehicles, multi utility vehicles, and multi-purpose vehicles. It is also involved in the facilitation of pre-owned car sales, fleet management, and car financing. In addition, the company offers driving school, accessories, insurance, auto card, pre-owned car, and financing products and services. As of May 28, 2020, it had a network of 3,086 showrooms across 1,964 towns and cities. The company was formerly known as Maruti Udyog Limited and changed its name to Maruti Suzuki India Limited in September 2007. The company was founded in 1981 and is headquartered in New Delhi, India. Maruti Suzuki India Limited is a subsidiary of Suzuki Motor Corporation.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110070",
        "website": "http://www.marutisuzuki.com",
        "full_time_employees": null
    },
    "MOM.F": {
        "short_name": "MAHINDRA+MAHIN.GDR/REG.S",
        "long_name": "Mahindra & Mahindra Limited",
        "summary": "Mahindra & Mahindra Limited engages in the automotive and farm equipment businesses in India and internationally. The company operates through Automotive, Farm Equipment, Financial Services, Hospitality, Real Estate, and Others segments. It offers aircrafts, and airframe parts and assemblies; passenger and commercial vehicles, trucks, buses, vans, cars, utility vehicles, and electric vehicles; personal and commercial watercrafts; motorcycles and scooters; construction equipment, such as backhoe loaders under the Mahindra EarthMaster brand name; road construction equipment comprising motor graders under the Mahindra RoadMaster brand. The company also provides land systems, naval systems, defense electronics, and security consulting services for defense industry; pre-owned car and car services; and farm equipment, including tractors, farm machineries, spare parts, and related services. In addition, it operates M2All, an e-commerce platform for various portfolio of products; approximately 46 resorts; and solar PV projects. Further, the company offers financial products and services comprising retail and other loans, SME finance, housing finance, mutual funds, vehicle and equipment finance, and life and non-life insurance broking services; logistics services; consulting services; and information technology services, as well as power back up solutions, such as diesel generators and gas powered gensets. Additionally, it engages in the project development, management, operation, and leasing of commercial and residential complexes; sale of timeshare and vacation ownership; making, processing, and trading of steel for automotive, non-automotive, and power industries. The company has a strategic alliance with Ford Motor Company. The company was founded in 1945 and is headquartered in Mumbai, India.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400018",
        "website": "http://www.mahindra.com",
        "full_time_employees": 256000
    },
    "SMLISUZU.NS": {
        "short_name": "SML ISUZU LTD",
        "long_name": "SML Isuzu Limited",
        "summary": "SML Isuzu Limited manufactures and sells commercial vehicles and related parts primarily in India and internationally. The company's products include trucks and buses. It also provides special applications, cargo, and passenger vehicles. The company offers its products through dealers. The company was formerly known as Swaraj Mazda Ltd. and changed its name to SML Isuzu Limited in 2011. SML Isuzu Limited was incorporated in 1983 and is based in Chandigarh, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chandigarh",
        "zipcode": "160135",
        "website": "http://www.smlisuzu.com",
        "full_time_employees": 1003
    },
    "TATAMOTORS.NS": {
        "short_name": "TATA MOTORS LTD.",
        "long_name": "Tata Motors Limited",
        "summary": "Tata Motors Limited designs, develops, manufactures, and sells a range of automotive vehicles. It offers passenger cars; sports utility vehicles; small commercial vehicles and pickup trucks; buses; and intermediate, light, medium, and heavy commercial vehicles, including trucks, tractors, tippers, multi-axle vehicles, pickups, dump trucks, tractor-trailers, mixers, and cargo vehicles, as well as related spare parts and accessories. The company also provides fully built solutions for applications, such as garbage compactors, containers, tankers, reefers, and diesel bowser, as well as electric vehicles. In addition, it offers information technology services, machine tools, and factory automation solutions; vehicle financing services; and engines for industrial and marine applications. The company provides its products under the Tata, Daewoo, Fiat, Jaguar, and Land Rover brands. It operates in India, China, the United States, the United Kingdom, rest of Europe, and internationally. The company was formerly known as Tata Engineering and Locomotive Company Limited and changed its name to Tata Motors Limited in July 2003. Tata Motors Limited was founded in 1945 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400093",
        "website": "http://www.tatamotors.com",
        "full_time_employees": 78906
    },
    "TATAMTRDVR.NS": {
        "short_name": "TATA MOTORS LTD.",
        "long_name": "Tata Motors Limited",
        "summary": "Tata Motors Limited designs, develops, manufactures, and sells a range of automotive vehicles. It offers passenger cars; sports utility vehicles; small commercial vehicles and pickup trucks; buses; and intermediate, light, medium, and heavy commercial vehicles, including trucks, tractors, tippers, multi-axle vehicles, pickups, dump trucks, tractor-trailers, mixers, and cargo vehicles, as well as related spare parts and accessories. The company also provides fully built solutions for applications, such as garbage compactors, containers, tankers, reefers, and diesel bowser, as well as electric vehicles. In addition, it offers information technology services, machine tools, and factory automation solutions; vehicle financing services; and engines for industrial and marine applications. The company provides its products under the Tata, Daewoo, Fiat, Jaguar, and Land Rover brands. It operates in India, China, the United States, the United Kingdom, rest of Europe, and internationally. The company was formerly known as Tata Engineering and Locomotive Company Limited and changed its name to Tata Motors Limited in July 2003. Tata Motors Limited was founded in 1945 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400093",
        "website": "http://www.tatamotors.com",
        "full_time_employees": 78906
    },
    "TATB.F": {
        "short_name": "TATA MTRS LTD ADR/5 IR 2",
        "long_name": "Tata Motors Limited",
        "summary": "Tata Motors Limited designs, develops, manufactures, and sells a range of automotive vehicles. It offers passenger cars; sports utility vehicles; small commercial vehicles and pickup trucks; buses; and intermediate, light, medium, and heavy commercial vehicles, including trucks, tractors, tippers, multi-axle vehicles, pickups, dump trucks, tractor-trailers, mixers, and cargo vehicles, as well as related spare parts and accessories. The company also provides fully built solutions for applications, such as garbage compactors, containers, tankers, reefers, and diesel bowser, as well as electric vehicles. In addition, it offers information technology services, machine tools, and factory automation solutions; vehicle financing services; and engines for industrial and marine applications. The company provides its products under the Tata, Daewoo, Fiat, Jaguar, and Land Rover brands. It operates in India, China, the United States, the United Kingdom, rest of Europe, and internationally. The company was formerly known as Tata Engineering and Locomotive Company Limited and changed its name to Tata Motors Limited in July 2003. Tata Motors Limited was founded in 1945 and is headquartered in Mumbai, India.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400093",
        "website": "http://www.tatamotors.com",
        "full_time_employees": 78906
    },
    "TATB.VI": {
        "short_name": "TATA MOTORS LTD-SPON ADR",
        "long_name": "Tata Motors Limited",
        "summary": "Tata Motors Limited designs, develops, manufactures, and sells a range of automotive vehicles. It offers passenger cars; sports utility vehicles; small commercial vehicles and pickup trucks; buses; and intermediate, light, medium, and heavy commercial vehicles, including trucks, tractors, tippers, multi-axle vehicles, pickups, dump trucks, tractor-trailers, mixers, and cargo vehicles, as well as related spare parts and accessories. The company also provides fully built solutions for applications, such as garbage compactors, containers, tankers, reefers, and diesel bowser, as well as electric vehicles. In addition, it offers information technology services, machine tools, and factory automation solutions; vehicle financing services; and engines for industrial and marine applications. The company provides its products under the Tata, Daewoo, Fiat, Jaguar, and Land Rover brands. It operates in India, China, the United States, the United Kingdom, rest of Europe, and internationally. The company was formerly known as Tata Engineering and Locomotive Company Limited and changed its name to Tata Motors Limited in July 2003. Tata Motors Limited was founded in 1945 and is headquartered in Mumbai, India.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "VIE",
        "market": "at_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400093",
        "website": "http://www.tatamotors.com",
        "full_time_employees": 78906
    },
    "TTM": {
        "short_name": "Tata Motors Ltd Tata Motors Lim",
        "long_name": "Tata Motors Limited",
        "summary": "Tata Motors Limited designs, develops, manufactures, and sells a range of automotive vehicles. It offers passenger cars; sports utility vehicles; small commercial vehicles and pickup trucks; buses; and intermediate, light, medium, and heavy commercial vehicles, including trucks, tractors, tippers, multi-axle vehicles, pickups, dump trucks, tractor-trailers, mixers, and cargo vehicles, as well as related spare parts and accessories. The company also provides fully built solutions for applications, such as garbage compactors, containers, tankers, reefers, and diesel bowser, as well as electric vehicles. In addition, it offers information technology services, machine tools, and factory automation solutions; vehicle financing services; and engines for industrial and marine applications. The company provides its products under the Tata, Daewoo, Fiat, Jaguar, and Land Rover brands. It operates in India, China, the United States, the United Kingdom, rest of Europe, and internationally. The company was formerly known as Tata Engineering and Locomotive Company Limited and changed its name to Tata Motors Limited in July 2003. Tata Motors Limited was founded in 1945 and is headquartered in Mumbai, India.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400093",
        "website": "http://www.tatamotors.com",
        "full_time_employees": 78906
    },
    "TVSMOTOR.NS": {
        "short_name": "TVS MOTOR CO",
        "long_name": "TVS Motor Company Limited",
        "summary": "TVS Motor Company Limited, together with its subsidiaries, manufactures and sells automotive vehicles and components, spare parts, and accessories in India. It operates through Automotive Vehicles and Parts, Automotive Components, Financial Services, and Others segments. The company offers motorcycles under the Apache, Radeon, Victor, StaR City+, and Sport names; scooters under the Ntorq, Jupiter, Jupiter Grande, Scooty Zest 110, and Scooty Pep + names; mopeds under the XL 100, XL 100 Comfort, and XL i-Touch start names; electric vehicles under the TVS iQUBE brand; and three wheelers under the TVS King brand name. It also develops residential projects; and provides financing for two-wheelers. The company also exports its products. TVS Motor Company Limited distributes its products through a network of authorized dealers. The company was incorporated in 1992 and is based in Chennai, India. TVS Motor Company Limited is a subsidiary of Sundaram-Clayton Limited.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600034",
        "website": "http://www.tvsmotor.com",
        "full_time_employees": null
    }
}