{
    "AUBANK.NS": {
        "short_name": "AU SMALL FINANCE B",
        "long_name": "AU Small Finance Bank Limited",
        "summary": "AU Small Finance Bank Limited provides various banking and financial services in India. It operates through Treasury, Retail Banking, Wholesale Banking, and Other Banking Operations segments. The company offers savings and current accounts; fixed and recurring deposits; locker services; point of sale machines; mutual funds; general, fire, life, and health insurance products; and investment products. It also provides vehicle, commercial vehicle, tractor, two-wheeler, home, consumer finance and personal, gold, secured business, and agri-SME loans, as well as NBFC/HFC/MFI lending; business banking, trade finance and forex; and construction and builder finances. In addition, the company offers bank guarantee, letters of credit, discounting of letter of credit, clean bill discounting, import and export bill collections, and inward and outward remittance services; digital banking services, such as Internet, missed call and mobile banking; unified payment interface and Bharat bill payment systems; and EMI payment and other payments services; and government banking services to central government, states governments, central and state public sector undertakings, boards, defense, urban local bodies, and other government departments. As of March 31, 2020, it operated 406 bank branches, 122 banking outlets, 88 business correspondents, 31 asset centers, 13 offices, and 356 ATMs. The company was formerly known as AU Financiers (India) Limited and changed its name to AU Small Finance Bank Limited in May 2017. AU Small Finance Bank Limited was founded in 1996 and is headquartered in Jaipur, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Jaipur",
        "zipcode": "302001",
        "website": "http://www.aubank.in",
        "market_cap": "Large Cap"
    },
    "AXISBANK.NS": {
        "short_name": "AXIS BANK",
        "long_name": "Axis Bank Limited",
        "summary": "Axis Bank Limited provides corporate and retail banking products and services in India and internationally. The company's deposit products include savings, salary, and current accounts, as well as fixed, recurring, tax saver fixed, and flexi deposits. It also provides home, personal, holiday, car, business, gold, two wheeler, working capital, and education loans, as well as loans against properties, securities, and fixed deposits; and commercial vehicle and construction equipment loans. In addition, the company offers safe deposit locker, safe custodian, and pension system services; foreign exchange services; investment products; and life, general, home, health, travel, motor, and business guard insurance products. Further, it provides cash management, trade, treasury, capital market, corresponding banking and financial institutions, pension, and bullion services; debit and credit cards; mutual funds, public provident funds, demat accounts, and systematic investment plan; products and services for non-resident Indians; agricultural and rural banking products and services; and burgundy and priority banking products and services. Additionally, the company offers corporate, online, mobile, and phone banking; trade finance; and risk management solutions. Axis Bank Limited operates approximately 4,528 domestic branches with 12,044 ATMs and 5,433 cash recyclers; 11 overseas offices with branches at Singapore, Hong Kong, Dubai, Colombo, Shanghai, and Gift City-IBU; and representative offices at Dhaka, Dubai, Abu Dhabi, and Sharjah. The company was formerly known as UTI Bank Limited and changed its name to Axis Bank Limited in July 2007. Axis Bank Limited was incorporated in 1993 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400025",
        "website": "http://www.axisbank.com",
        "market_cap": "Large Cap"
    },
    "BANDHANBNK.NS": {
        "short_name": "BANDHAN BANK LTD",
        "long_name": "Bandhan Bank Limited",
        "summary": "Bandhan Bank Limited provides commercial banking services in India. It operates through Treasury, Retail Banking, Corporate/Wholesale Banking, and Other Banking Business segments. The company offers savings, current, fixed deposit, and corporate salary accounts. It also provides retail loans, such as home loans, two wheeler loans, and loans against property and term deposits, as well as personal and gold loans; MSME loans, including business, equipment, commercial vehicle, working capital, and term loans; small enterprise loans; microloans for home-based businesses; and agriculture loans. In addition, the company invests in sovereign securities; offers liability products, card services, Internet and mobile banking, ATM, trading, and NRI services; and distributes third party products. As of March 31, 2020, it operated 1,018 branches, 3,346 banking units, 195 home loan centers, and 485 ATMs. The company was founded in 2015 and is headquartered in Kolkata, India. Bandhan Bank Limited is a subsidiary of Bandhan Financial Holdings Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700091",
        "website": "http://www.bandhanbank.com",
        "market_cap": "Large Cap"
    },
    "BANKBARODA.NS": {
        "short_name": "BK OF BARODA",
        "long_name": "Bank of Baroda",
        "summary": "Bank of Baroda provides various banking products and services to individual, government departments, and corporate customers. The company operates through Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Operations segments. It offers fixed, current, recurring, and savings deposit products, as well as NRI account and foreign currency deposits. The company also provides loans, such as home, education, vehicle, personal, mortgage, commission agents, and traders loans, as well as advances against securities and gold ornaments/jewelries, and loans for public issues/initial public offers; professional, composite, small business borrower, capital expenditure, bridge, and short term corporate loans, as well as loans for micro, small, and medium enterprises; working capital finance, term finance, commercial vehicle finance, export and import finance, bill finance, lines of credit, loans against rent receivables, term finance, project finance, infrastructure finance, loans for takeover of accounts, foreign currency credit, supply chain finance, and non-fund based services; and debit, prepaid, and credit cards. In addition, it offers loans and advances, and pensions and government schemes to rural and agricultural customers; life insurance, general insurance, and health insurance products, as well as mutual funds; appraisal, merchant banking, cash management, remittance, collection, electronic clearing, correspondent banking, treasury, trade finance, investment, lockers, and capital market services; and digital banking services, including mobile banking, internet payment gateway, Bharat bill payment system, Baroda FASTag, self-service passbook printer, and Baroda TabiT. Further, the company offers banking solutions for start-ups. As of March 31, 2020, it operated a network of 9,482 branches; 101 overseas branches; 13,193 ATMs; and 1,252 e-lobbies. Bank of Baroda was founded in 1908 and is headquartered in Vadodara, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Vadodara",
        "zipcode": "390007",
        "website": "http://www.bankofbaroda.in",
        "market_cap": "Large Cap"
    },
    "BANKINDIA.NS": {
        "short_name": "BK OF INDIA",
        "long_name": "Bank of India Limited",
        "summary": "Bank of India Limited provides various banking products and services. It operates through Treasury Operations, Wholesale Banking, and Retail Banking segments. The company accepts various deposit products, such as savings, current, salary, term, and tax saving deposits. It also offers home, education, vehicle, personal, pensioner, holiday, top-up, and demand/term loans, as well as loan for Pradhan Mantri Awas Yojana and against property; housing loans to NRIs/PIOs; overdraft against securities; loans against FCNR deposits; and loans for corporate and MSME customers. In addition, the company provides cash management services; trade finance; online share trading services; insurance products and services; mutual fund products; portfolio management services; credit, debit, and prepaid cards; and remittance, online banking and payment, online income tax return, and ATM and other kiosk services, as well as cards, loans, and services to rural customers. As of March 31, 2020, it operated 5,083 branches in India; and 24 branches and 1 representative office internationally. The company was founded in 1906 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.bankofindia.co.in",
        "market_cap": "Large Cap"
    },
    "CANBK.NS": {
        "short_name": "CANARA BANK",
        "long_name": "Canara Bank",
        "summary": "Canara Bank provides various banking products and services in India and internationally. It offers personal banking services, such as savings and deposits comprising savings accounts, current accounts, recurring deposits, fixed deposits, unclaimed deposits, deposit schemes for senior citizens, re-investment plans, and others; loan products, such as housing, home improvement, vehicle, site, teachers, gold, mortgage, housing-cum-solar, consumer, and other loans; life, general, and health insurance products; consultancy services, which cover personal tax assistance and investment counselling, estate and wills services, private and charitable trustee services, debenture and security trusteeship, and attorneyship; foreign exchange and international banking services; mutual funds; and safe deposit lockers, depository, safe custody, and card services. The company also provides corporate banking products and services, including accounts and deposits, such as current, fixed, and recurring deposits; supply chain finance management; loans and advances comprising working capital finance, term loans, infrastructure financing, and export finance; syndication services; IPO monitoring services; and merchant and commercial banking, escrow bankers/ASBA, underwriting, and investments services. In addition, it offers NRI banking products and services, such as remittance facilities; loans and advances, such as home, home improvement, vehicle, rent, mortgage, and site loans; and investment and online trading facilities. As of March 31, 2020, the company operated 6,329 branches, including 291 specialized branches and 5 overseas branches and 8,850 ATMs. Canara Bank was founded in 1906 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560002",
        "website": "http://www.canarabank.com",
        "market_cap": "Large Cap"
    },
    "CENTRALBK.NS": {
        "short_name": "CENTRAL BANK OF IN",
        "long_name": "Central Bank of India",
        "summary": "Central Bank of India operates as a commercial bank in India. It offers deposit products, which include savings and current accounts, time deposits, fixed deposits, and recurring deposit schemes; and loans, including housing, vehicle, property, personal, senior citizens, education, corporate mortgage and rental, and agricultural, as well as micro small and medium enterprises loans. The company also provides credit, debit, and prepaid/gift cards, as well as cash management, mutual funds, depository, payments, mobile and Internet banking, and ATM services, as well as remittance services. In addition, it offers investment banking services, such as debt syndication, financial modeling and valuation, merger and acquisition advisory, corporate restructuring, equity products, equity research, and wealth and portfolio management, as well as trusteeship services. Further, the company sells and distributes life, general, and health insurance products, including unit linked, whole life, children, money back, endowment, pension, health, property, personal, fire, burglary, engineering, motor, package, travel, and group insurance products, as well as protection and retirement solutions. As of March 31, 2020, it operated through a network of 4,651 branches; 3,642 ATMs; 10 satellite offices; and 1 extension counter. The company was founded in 1911 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.centralbankofindia.co.in",
        "market_cap": "Large Cap"
    },
    "CSBBANK.NS": {
        "short_name": "CSB Bank Limited",
        "long_name": "CSB Bank Limited",
        "summary": "CSB Bank Limited provides various banking products and services for small and medium enterprises, retail, and NRI customers in India. It operates in four segments: Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Operations. The company accepts various deposits products include current accounts, savings bank accounts, corporate salary savings accounts, term deposit accounts, cumulative deposit accounts, and other deposit products, as well as products for NRI customers. It also offers term, working capital, commercial vehicle, personal, home, vehicle, education, agricultural, corporate, and gold loans; loans against properties; and export finance, import finance, bill finance, letters of credit, buyers'/suppliers' credit, bank guarantee, inland bill discounting, bills discounted under domestic letters of credit, cash management, treasury, and trade receivables discounting system bill discounting services. In addition, the company invests in sovereign and corporate debt instruments, undertakes proprietary trading in equity and fixed income securities and foreign exchange, and invests in certificate of deposits and mutual funds. Further, it provides money transfer and remittance, utility and bill payments, Internet and mobile banking, foreign exchange, insurance products distribution, safe deposit locker, and institutional fee collection services. It operates through a network of approximately 411 branches and 300 ATMs. The company was formerly known as The Catholic Syrian Bank Limited and changed its name to CSB Bank Limited in June 2019. CSB Bank Limited was incorporated in 1920 and is headquartered in Thrissur, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Thrissur",
        "zipcode": "680020",
        "website": "http://www.csb.co.in",
        "market_cap": "Large Cap"
    },
    "CUB.NS": {
        "short_name": "CITY UNION BANK",
        "long_name": "City Union Bank Ltd.",
        "summary": "City Union Bank Ltd. provides various banking products and services to personal and corporate clients in India. The company operates through four segments: Corporate/Wholesale Banking, Retail Banking, Treasury, and Other Banking Operations. It offers savings and current accounts; salary and NRI accounts; and fixed deposits, flexi fix, recurring, and tax saver deposits. The company also provides four and two wheeler, educational, housing, consumer, jewel, agricultural, working capital, small road transport operator, and foreign currency loans; micro credit, cash credits, bank guarantees, letters of credit, bills finance, and overdrafts services; and international business services, including export, import, remittances, deposits, correspondent banks, and treasury risk management services. In addition, it offers locker facilities, cards, automated teller machines (ATMs), and point of sales services, as well as demat and insurance services; and real time gross settlement, immediate payment service, national automatic clearing house, and national electronic fund transfer services. Further, the company provides cash management, electronic payment, digital and other tech, and payment to government services. As of March 31, 2020, it operated through a network of 700 branches and 1,793 ATMs. The company was formerly known as The Kumbakonam City Union Bank Limited and changed its name to City Union Bank Ltd. in November 1987. City Union Bank Ltd. was incorporated in 1904 and is based in Kumbakonam, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kumbakonam",
        "zipcode": "612001",
        "website": "http://www.cityunionbank.com",
        "market_cap": "Large Cap"
    },
    "DCBBANK.NS": {
        "short_name": "DCB BANK LIMITED",
        "long_name": "DCB Bank Limited",
        "summary": "DCB Bank Limited provides various banking and financial products and services in India. It operates through Treasury Operations, Wholesale Banking, Retail Banking, and Other Banking Operations segments. The Treasury Operations segment engages in various financial markets activities undertaken on behalf of the company's customers, proprietary trading, maintenance of reserve requirements, and resource mobilization from other banks and financial institutions. The Wholesale Banking segment's activities include lending, deposit taking, and other services offered to corporate customers. The Retail Banking segment's activities comprise lending, deposit taking, and other services offered to retail customers. The Other Banking Operations segment provides para banking services, such as third-party product distribution, merchant banking, etc. As of March 31, 2021, it operated through a network of 352 branches across 19 states and 3 union territories. The company was formerly known as Development Credit Bank Limited and changed its name to DCB Bank Limited in October 2013. DCB Bank Limited was founded in 1930 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.dcbbank.com",
        "market_cap": "Large Cap"
    },
    "DHANBANK.NS": {
        "short_name": "DHANLAXMI BANK LTD",
        "long_name": "Dhanlaxmi Bank Limited",
        "summary": "Dhanlaxmi Bank Limited provides various banking and financial services in India. It operates through Treasury Operations, Corporate/Wholesale Banking, Retail Banking, and Other Banking Business Operations segments. The company offers deposit products, such as savings and current accounts, and term deposits; loans, including property, car, commercial, personal, education, and business loans, as well as loans against securities; and foreign exchange services comprising foreign currency cash, cheque deposits, foreign currency demand drafts, remittances, and foreign exchange cards. It also provides export and import services; credit products comprising industrial and trade advance, import export assistance, and agricultural assistance; corporate salary accounts; and cash management services, as well as life, health, and car insurance products. In addition, the company offers non-resident Indians (NRI) banking services, such as non-residential external accounts, non-resident ordinary accounts, recurring and term deposits, foreign currency non-resident fixed deposits, and resident foreign currency accounts, as well as money transfer services and NRI property loans; and micro and agricultural banking, and financial planning services. Further, it provides SME banking services, including working capital facilities, trade facilities, and capacity expansion services; credit, debit, and gift cards; and investment, depository, and online banking services, as well as locker facilities. As of March 31, 2020, it had 247 branches and 254 ATMs across 14 States and 1 Union Territory. The company was founded in 1927 and is based in Thrissur, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Thrissur",
        "zipcode": "680002",
        "website": "http://www.dhanbank.com",
        "market_cap": "Mid Cap"
    },
    "EQUITASBNK.NS": {
        "short_name": "Equitas Small Fin Bnk Ltd",
        "long_name": "Equitas Small Finance Bank Limited",
        "summary": "Equitas Small Finance Bank Limited provides banking and financial services in India. It operates through Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Operations segments. The company offers current, savings, and salary accounts; and term, bulk, and certificates of deposits. It also provides small business loans comprising secured business, self employed and salaried, agri, and housing loans; group loans to microentrepreneurial women; vehicle finance for used and new commercial vehicles, and used passenger cars; micro and small enterprise finance, such as working capital loans, and fund based and non-fund based products; and loans to financial institutions and corporates. In addition, the company offers insurance, FASTag, and asset management services; ATM and debit cards/point of sale services; call centre services; and mobile, phone, and internet banking services. It has 854 banking outlets and 322 ATMs. The company was formerly known as Equitas Finance Limited and changed its name to Equitas Small Finance Bank Limited in September 2016. Equitas Small Finance Bank Limited was incorporated in 1993 and is headquartered in Chennai, India. Equitas Small Finance Bank Limited operates as a subsidiary of Equitas Holdings Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600002",
        "website": "http://www.equitasbank.com",
        "market_cap": "Large Cap"
    },
    "FEDERALBNK.NS": {
        "short_name": "FED BANK",
        "long_name": "The Federal Bank Limited",
        "summary": "The Federal Bank Limited engages in commercial banking activities in India. It operates through four segments: Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Operations. The company's deposit products include savings accounts, current accounts, demat accounts, salary accounts, fixed deposits, cash certificates, recurring deposits, exchange earner's foreign currency accounts, gilt accounts, and NRI deposit schemes. Its loan portfolio comprises gold, housing, car, property, educational or career, cash, instant digital, business, and agriculture and agricultural allied loans; travel, gift, debit, and credit cards; and loans against fixed deposits. The company also provides life, health, and general insurance products; mutual funds, online trading, and national pension system, as well as term loans, project finance, bill discounting, working capital loans, bank guarantees, letter of credit, packing credit limit, rediscounting of export bills, Internet banking, mobile banking, ATM, telephone banking services. As of March 31, 2019, it operated through a network of 1,251 branches and 1,669 ATMs. The company was formerly known as Travancore Federal Bank Limited and changed its name to The Federal Bank Limited in March 1947. The Federal Bank Limited was incorporated in 1931 and is headquartered in Aluva, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Aluva",
        "zipcode": "683101",
        "website": "http://www.federalbank.co.in",
        "market_cap": "Large Cap"
    },
    "HDB": {
        "short_name": "HDFC Bank Limited",
        "long_name": "HDFC Bank Limited",
        "summary": "HDFC Bank Limited provides various banking and financial services to individuals and businesses in India, Bahrain, Hong Kong, and Dubai. It operates in Treasury, Retail Banking, Wholesale Banking, Other Banking Business, and Unallocated segments. The company accepts savings, salary, current, and Demat accounts; fixed and recurring deposits; and safe deposit lockers, and rural and pension accounts, as well as offshore accounts and deposits, overdrafts against fixed deposits and salaries, and sweep-in facilities. It also provides personal, home, car, two wheeler, three wheeler, business, educational, gold, rural, and term loans; loans against properties, assets, and securities; loans for professionals; government sponsored programs; and loans on credit card, as well as working capital and commercial/construction equipment finance, term and professional loans, healthcare/medical equipment and commercial vehicle finance, and dealer finance. In addition, the company offers credit, debit, prepaid, and forex cards; payment and collection, export, import, remittance, bank guarantee, letter of credit, trade, hedging, loan syndication, and merchant and cash management services; and insurance and investment products. Further, it provides short term finance, bill discounting, structured finance, export credit, documents collection, Internet and wholesale banking, mobile banking, real time gross settlement, channel financing, vendor financing, reimbursement account, money market, derivatives, employee trusts, cash surplus corporates, tax payment, and bankers to rights/public issue services, as well as financial solutions for supply chain partners and agricultural customers. As of March 31, 2020, it had 5,416 branches and 13,640 automated teller machines in 2,803 cities/towns. HDFC Bank Limited was founded in 1994 and is based in Mumbai, India.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.hdfcbank.com",
        "market_cap": "Large Cap"
    },
    "HDFA.F": {
        "short_name": "HDFC BANK LTD ADR/3 IR 10",
        "long_name": "HDFC Bank Limited",
        "summary": "HDFC Bank Limited provides various banking and financial services to individuals and businesses in India, Bahrain, Hong Kong, and Dubai. It operates in Treasury, Retail Banking, Wholesale Banking, Other Banking Business, and Unallocated segments. The company accepts savings, salary, current, and Demat accounts; fixed and recurring deposits; and safe deposit lockers, and rural and pension accounts, as well as offshore accounts and deposits, overdrafts against fixed deposits and salaries, and sweep-in facilities. It also provides personal, home, car, two wheeler, three wheeler, business, educational, gold, rural, and term loans; loans against properties, assets, and securities; loans for professionals; government sponsored programs; and loans on credit card, as well as working capital and commercial/construction equipment finance, term and professional loans, healthcare/medical equipment and commercial vehicle finance, and dealer finance. In addition, the company offers credit, debit, prepaid, and forex cards; payment and collection, export, import, remittance, bank guarantee, letter of credit, trade, hedging, loan syndication, and merchant and cash management services; and insurance and investment products. Further, it provides short term finance, bill discounting, structured finance, export credit, documents collection, Internet and wholesale banking, mobile banking, real time gross settlement, channel financing, vendor financing, reimbursement account, money market, derivatives, employee trusts, cash surplus corporates, tax payment, and bankers to rights/public issue services, as well as financial solutions for supply chain partners and agricultural customers. As of March 31, 2020, it had 5,416 branches and 13,640 automated teller machines in 2,803 cities/towns. HDFC Bank Limited was founded in 1994 and is based in Mumbai, India.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.hdfcbank.com",
        "market_cap": "Large Cap"
    },
    "HDFCBANK.NS": {
        "short_name": "HDFC BANK",
        "long_name": "HDFC Bank Limited",
        "summary": "HDFC Bank Limited provides various banking and financial services to individuals and businesses in India, Bahrain, Hong Kong, and Dubai. It operates in Treasury, Retail Banking, Wholesale Banking, Other Banking Business, and Unallocated segments. The company accepts savings, salary, current, and Demat accounts; fixed and recurring deposits; and safe deposit lockers, and rural and pension accounts, as well as offshore accounts and deposits, overdrafts against fixed deposits and salaries, and sweep-in facilities. It also provides personal, home, car, two wheeler, three wheeler, business, educational, gold, rural, and term loans; loans against properties, assets, and securities; loans for professionals; government sponsored programs; and loans on credit card, as well as working capital and commercial/construction equipment finance, term and professional loans, healthcare/medical equipment and commercial vehicle finance, and dealer finance. In addition, the company offers credit, debit, prepaid, and forex cards; payment and collection, export, import, remittance, bank guarantee, letter of credit, trade, hedging, loan syndication, and merchant and cash management services; and insurance and investment products. Further, it provides short term finance, bill discounting, structured finance, export credit, documents collection, Internet and wholesale banking, mobile banking, real time gross settlement, channel financing, vendor financing, reimbursement account, money market, derivatives, employee trusts, cash surplus corporates, tax payment, and bankers to rights/public issue services, as well as financial solutions for supply chain partners and agricultural customers. As of March 31, 2020, it had 5,416 branches and 13,640 automated teller machines in 2,803 cities/towns. HDFC Bank Limited was founded in 1994 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.hdfcbank.com",
        "market_cap": "Large Cap"
    },
    "IBN.BA": {
        "short_name": "ICICI BANK",
        "long_name": "ICICI Bank Limited",
        "summary": "ICICI Bank Limited provides various banking products and financial services in India and internationally. It operates in Retail Banking, Wholesale Banking, Treasury, and Others Banking segments. The company offers savings, salary, pension, current, and other accounts; and fixed, recurring, and security deposits. It also provides home, car, two wheeler, personal, gold, and commercial business loans, as well as loans against securities and other loans; business loans, such as working capital finance, term loans, collateral free loans, loans without financials, finance for importers and exporters, and secured loans for credit card swipes, as well as loans for new entities, and schools and colleges; and credit, debit, prepaid, travel, and corporate cards. In addition, the company offers insurance products; pockets wallet; fixed income products; investment products, such as mutual funds, gold monetization schemes, and initial public offerings, as well as other online investment services; and farmer finance, tractor loans, and micro banking services, as well as other services to agri traders and processors, and agri corporates. Further, it provides portfolio management, trade, foreign exchange, locker, private and NRI banking, and cash management services; family wealth and demat accounts; commercial and investment banking, capital market, custodial, project and technology finance, and institutional banking services, as well as Internet, mobile, and phone banking services. Additionally, the company offers securities investment, broking, trading, and underwriting services; and merchant banking, trusteeship, housing finance, and pension fund management services. As of March 31, 2020, it had a network of 5,324 branches, 15,688 ATMs, 1,638 insta-banking kiosks, 483,538 POS terminals, and 1,791 cash acceptance machines. ICICI Bank Limited was founded in 1955 and is headquartered in Mumbai, India.",
        "currency": "ARS",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.icicibank.com",
        "market_cap": "Large Cap"
    },
    "IBN": {
        "short_name": "ICICI Bank Limited",
        "long_name": "ICICI Bank Limited",
        "summary": "ICICI Bank Limited provides various banking products and financial services in India and internationally. It operates in Retail Banking, Wholesale Banking, Treasury, and Others Banking segments. The company offers savings, salary, pension, current, and other accounts; and fixed, recurring, and security deposits. It also provides home, car, two wheeler, personal, gold, and commercial business loans, as well as loans against securities and other loans; business loans, such as working capital finance, term loans, collateral free loans, loans without financials, finance for importers and exporters, and secured loans for credit card swipes, as well as loans for new entities, and schools and colleges; and credit, debit, prepaid, travel, and corporate cards. In addition, the company offers insurance products; pockets wallet; fixed income products; investment products, such as mutual funds, gold monetization schemes, and initial public offerings, as well as other online investment services; and farmer finance, tractor loans, and micro banking services, as well as other services to agri traders and processors, and agri corporates. Further, it provides portfolio management, trade, foreign exchange, locker, private and NRI banking, and cash management services; family wealth and demat accounts; commercial and investment banking, capital market, custodial, project and technology finance, and institutional banking services, as well as Internet, mobile, and phone banking services. Additionally, the company offers securities investment, broking, trading, and underwriting services; and merchant banking, trusteeship, housing finance, and pension fund management services. As of March 31, 2020, it had a network of 5,324 branches, 15,688 ATMs, 1,638 insta-banking kiosks, 483,538 POS terminals, and 1,791 cash acceptance machines. ICICI Bank Limited was founded in 1955 and is headquartered in Mumbai, India.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.icicibank.com",
        "market_cap": "Large Cap"
    },
    "ICBA.F": {
        "short_name": "ICICI BANK LTD ADR/2",
        "long_name": "ICICI Bank Limited",
        "summary": "ICICI Bank Limited provides various banking products and financial services in India and internationally. It operates in Retail Banking, Wholesale Banking, Treasury, and Others Banking segments. The company offers savings, salary, pension, current, and other accounts; and fixed, recurring, and security deposits. It also provides home, car, two wheeler, personal, gold, and commercial business loans, as well as loans against securities and other loans; business loans, such as working capital finance, term loans, collateral free loans, loans without financials, finance for importers and exporters, and secured loans for credit card swipes, as well as loans for new entities, and schools and colleges; and credit, debit, prepaid, travel, and corporate cards. In addition, the company offers insurance products; pockets wallet; fixed income products; investment products, such as mutual funds, gold monetization schemes, and initial public offerings, as well as other online investment services; and farmer finance, tractor loans, and micro banking services, as well as other services to agri traders and processors, and agri corporates. Further, it provides portfolio management, trade, foreign exchange, locker, private and NRI banking, and cash management services; family wealth and demat accounts; commercial and investment banking, capital market, custodial, project and technology finance, and institutional banking services, as well as Internet, mobile, and phone banking services. Additionally, the company offers securities investment, broking, trading, and underwriting services; and merchant banking, trusteeship, housing finance, and pension fund management services. As of March 31, 2020, it had a network of 5,324 branches, 15,688 ATMs, 1,638 insta-banking kiosks, 483,538 POS terminals, and 1,791 cash acceptance machines. ICICI Bank Limited was founded in 1955 and is headquartered in Mumbai, India.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.icicibank.com",
        "market_cap": "Large Cap"
    },
    "ICICIBANK.NS": {
        "short_name": "ICICI BANK",
        "long_name": "ICICI Bank Limited",
        "summary": "ICICI Bank Limited provides various banking products and financial services in India and internationally. It operates in Retail Banking, Wholesale Banking, Treasury, and Others Banking segments. The company offers savings, salary, pension, current, and other accounts; and fixed, recurring, and security deposits. It also provides home, car, two wheeler, personal, gold, and commercial business loans, as well as loans against securities and other loans; business loans, such as working capital finance, term loans, collateral free loans, loans without financials, finance for importers and exporters, and secured loans for credit card swipes, as well as loans for new entities, and schools and colleges; and credit, debit, prepaid, travel, and corporate cards. In addition, the company offers insurance products; pockets wallet; fixed income products; investment products, such as mutual funds, gold monetization schemes, and initial public offerings, as well as other online investment services; and farmer finance, tractor loans, and micro banking services, as well as other services to agri traders and processors, and agri corporates. Further, it provides portfolio management, trade, foreign exchange, locker, private and NRI banking, and cash management services; family wealth and demat accounts; commercial and investment banking, capital market, custodial, project and technology finance, and institutional banking services, as well as Internet, mobile, and phone banking services. Additionally, the company offers securities investment, broking, trading, and underwriting services; and merchant banking, trusteeship, housing finance, and pension fund management services. As of March 31, 2020, it had a network of 5,324 branches, 15,688 ATMs, 1,638 insta-banking kiosks, 483,538 POS terminals, and 1,791 cash acceptance machines. ICICI Bank Limited was founded in 1955 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.icicibank.com",
        "market_cap": "Large Cap"
    },
    "IDBI.NS": {
        "short_name": "IDBI BANK LTD",
        "long_name": "IDBI Bank Limited",
        "summary": "IDBI Bank Limited provides banking and financial solutions to retail and corporate clients in India. The company offers savings and current accounts, corporate payroll accounts, and fixed deposits; home, auto, education, and personal loans, as well as loans against properties and securities; debit, credit, and prepaid cards; phone, mobile, and Internet banking services; and investment advisory and capital market services, as well as lockers. The company also provides fund based assistance, including term loans; working capital; packing credit to exporters; receivable buyout with recourse; channel financing for dealers of corporates; scheme for financing automated teller machines (ATM)/cash dispense vendors; bill discounting; technology upgrading fund scheme for textile and jute industries; and lending to non-banking finance companies/housing finance companies and commercial real estate sector. In addition, it offers bank and performance guarantees, letters of credit, and buyers credit; cash management, treasury, trade finance, and foreign currency services; and debt syndication and advisory services. Further, the company provides finance to micro, small, and medium enterprises; agriculture finance; and products and services for non-resident Indians, as well as equity, debt and gold products. Additionally, it offers information technology and security, and contact center services; and mutual fund, security trusteeship assignments, share pledge trustee, venture capital fund, safe keeping, escrow agency, and other trusteeship services, as well as acts as a trustee to securitization transactions and bond/debentures. As of March 31, 2020, the company operated 1,892 branches, 3,683 ATMs, and 58 e-lounges. The company was formerly known as IDBI Ltd. and changed its name to IDBI Bank Limited in May 2008. The company was founded in 1964 and is headquartered in Mumbai, India. IDBI Bank Limited is a subsidiary of Life Insurance Corporation of India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400 005",
        "website": "http://www.idbibank.in",
        "market_cap": "Large Cap"
    },
    "IDFCFIRSTB.NS": {
        "short_name": "IDFC FIRST BANK",
        "long_name": "IDFC First Bank Limited",
        "summary": "IDFC First Bank Limited provides various banking and financial products and services to corporates, individuals, multi-national companies, SMEs/entrepreneurs, financial institutions, and the government in India. It operates through four segments: Treasury, Corporate and Wholesale Banking, Retail Banking, and Other Banking Business. The company offers savings, corporate salary, and current accounts; fixed, recurring, and travel deposits; debit and prepaid cards; and payment services. It also provides personal, consumer durable, home, car, two wheeler, commercial vehicle, equipment hypothecation, business, working capital, business, and micro enterprise loans, as well as loan against property and loan for women; investment services covering mutual funds, gold bonds, and investment linked insurance solutions; term, health, motor, home, investment linked, travel, and pradhan mantri insurance; and mobile and Internet banking services. In addition, the company offers cash management and forex services; wholesale banking services, such as investment banking services; and investment management solutions. As of May 27, 2020, it operated 464 branches and 356 ATMs across 20 states and 66 districts. The company was formerly known as IDFC Bank Limited and changed its name to IDFC First Bank Limited in January 2019. The company was incorporated in 2014 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.idfcfirstbank.com",
        "market_cap": "Large Cap"
    },
    "INDIANB.NS": {
        "short_name": "INDIAN BANK",
        "long_name": "Indian Bank",
        "summary": "Indian Bank provides various banking product and services. The company provides deposit products, including savings and current accounts, term deposits, and Non Resident Indian (NRI) accounts. It also offers agriculture, group, personal/individual, micro small and medium enterprises, education, and NRI loans. In addition, the company provides Internet and mobile banking, as well as Ministry of Corporate Affairs payment, money gram, money transfer, remittance, and multicity check facility services; debit and credit cards; insurance services; direct and indirect tax payment services; debenture trustee services; and merchant banking and housing finance services. As of March 31, 2020, it operated 2,887 branches comprising 740 rural, 833 semi urban, 637 urban, and 677 metropolitan branches in India; 3 foreign branches in Singapore, Colombo, and Jaffna; and 4059 automated teller machines. Indian Bank was founded in 1907 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600014",
        "website": "http://www.indianbank.in",
        "market_cap": "Large Cap"
    },
    "INDUSINDBK.NS": {
        "short_name": "INDUSIND BANK LTD",
        "long_name": "IndusInd Bank Limited",
        "summary": "IndusInd Bank Limited provides various banking products and services to individuals, NRIs, business owners, corporates, and government and financial institutions. It operates through Treasury Operations, Corporate/Wholesale Banking, Retail Banking, and Other Banking business segments. The company offers current, savings, defense and corporate salary, and RFC accounts; and fixed and FCNR, sweep in/out deposits, senior citizen schemes, young saver deposits, and recurring and RFC deposits, as well as Rupee multiplier products. It also provides home, personal, car, two wheeler, gold, agricultural, and medical equipment loans, as well as loans against property and securities; business loans; and loan on credit cards. In addition, the company offers transaction banking services, including letters of credit/guarantees, structured trade and export finance, and import finance solutions, as well as cash management and remittance services; investment products, such as demat account, mutual fund, gold bond, national pension system, and equity trading; project finance, debt underwriting and placement, advisory related to M&A and equity raise, structured credit products, etc.; and health, general, life, and card protection insurance. Further, it provides debit, credit, forex, and commercial cards; individual outward remittances, foreign currency bank notes and demand drafts, and travelers cheque; financial inclusion products; trade and foreign exchange accounts; real estate developer financing and bullion services; correspondent banking services; and forex and derivative desk, information and advisory, and remittances through forex channel services. As of December 31, 2020, the company had 1,915 branches and 2,835 ATMs in India, as well as representative offices in London, Dubai, and Abu Dhabi. IndusInd Bank Limited was founded in 1994 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.indusind.com",
        "market_cap": "Large Cap"
    },
    "IOB.NS": {
        "short_name": "INDIAN OVERSEAS BK",
        "long_name": "Indian Overseas Bank",
        "summary": "Indian Overseas Bank provides various banking products and services. The company operates through Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Operations segments. It offers saving bank and current accounts, term deposits, retail loans, debit and credit cards, NRI accounts, agricultural and rural banking products, MSME loans, and merchant banking services. The company operates through 3270 branches and 3032 ATMs in India. It also operates through branches located in Singapore, Hong Kong, Bangkok, and Sri Lanka. Indian Overseas Bank was founded in 1937 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600002",
        "website": "http://www.iob.in",
        "market_cap": "Large Cap"
    },
    "J&KBANK.BO": {
        "short_name": "JAMMU & KASHMIR BANK LTD.",
        "long_name": "The Jammu and Kashmir Bank Limited",
        "summary": "The Jammu and Kashmir Bank Limited provides various banking products and services for household, and small and medium enterprises in India. It operates through Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Business segments. The company offers various accounts, such as savings, salary, pension, and current accounts; and term deposits. It also offers housing, consumer, education, term, car, coaching fee, and skill loans; and Saholiat/Saral, laptop/PC, smartphone, primary education, modular kitchen, and two-wheeler finance, as well as festival advance and cash credit schemes, and loan against gold. In addition, the company provides finance for commercial vehicles, school buses, passenger buses/mini buses, craft development, craftsmen livelihood, handicrafts, commercial premises, contractor, mini sheep farm establishment, construction equipment, small businessmen, and tourism; mortgage loans for trade and service sector, loans against mortgage of immovable property, fair price shop scheme, and all-terrain vehicles/snowmobile finance scheme; and agricultural loans. Further, it offers mutual funds, life and non-life insurance products, and nonresident banking services; and Internet and mobile banking, ATM, as well as debit, credit, and prepaid cards. As of March 31, 2020, The Jammu and Kashmir Bank Limited operated 955 branches in 17 states and 4 union territories; and 1354 ATM's. The company was founded in 1938 and is headquartered in Srinagar, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "BSE",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Srinagar",
        "zipcode": "190001",
        "website": "http://www.jkbank.com",
        "market_cap": "Large Cap"
    },
    "J&KBANK.NS": {
        "short_name": "JAMMU & KASHMIR BA",
        "long_name": "The Jammu and Kashmir Bank Limited",
        "summary": "The Jammu and Kashmir Bank Limited provides various banking products and services for household, and small and medium enterprises in India. It operates through Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Business segments. The company offers various accounts, such as savings, salary, pension, and current accounts; and term deposits. It also offers housing, consumer, education, term, car, coaching fee, and skill loans; and Saholiat/Saral, laptop/PC, smartphone, primary education, modular kitchen, and two-wheeler finance, as well as festival advance and cash credit schemes, and loan against gold. In addition, the company provides finance for commercial vehicles, school buses, passenger buses/mini buses, craft development, craftsmen livelihood, handicrafts, commercial premises, contractor, mini sheep farm establishment, construction equipment, small businessmen, and tourism; mortgage loans for trade and service sector, loans against mortgage of immovable property, fair price shop scheme, and all-terrain vehicles/snowmobile finance scheme; and agricultural loans. Further, it offers mutual funds, life and non-life insurance products, and nonresident banking services; and Internet and mobile banking, ATM, as well as debit, credit, and prepaid cards. As of March 31, 2020, The Jammu and Kashmir Bank Limited operated 955 branches in 17 states and 4 union territories; and 1354 ATM's. The company was founded in 1938 and is headquartered in Srinagar, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Srinagar",
        "zipcode": "190001",
        "website": "http://www.jkbank.com",
        "market_cap": "Large Cap"
    },
    "KARURVYSYA.NS": {
        "short_name": "KARUR VYSYA BANK",
        "long_name": "The Karur Vysya Bank Limited",
        "summary": "The Karur Vysya Bank Limited provides various banking and financial services for personal and corporate customers in India. It operates through Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Operations segments. The company offers savings and current accounts; recurring and tax saving deposits; personal, home, vehicle, educational, and mortgage loans; debit and credit cards; prepaid instruments, including gift, forex travel, and re-loadable cards, as well as cards for senior citizens; life, non-life, and health insurance products; demat, trading, and mutual fund services, as well as sovereign gold bond schemes; digital products; locker facilities; and government schemes. It also provides loans for micro, small, and medium enterprises, as well as commercial loans; payment collection and transaction banking services; FCNR, NRE, and NRO deposits; jewel loans and loans against deposits; bancassurance services; treasury and remittance services; and Internet and mobile banking services, as well as a range of products for the agricultural sector. As of March 31, 2020, the company operated 779 branches and 1,659 automated teller machines. The Karur Vysya Bank Limited was founded in 1916 and is based in Karur, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Karur",
        "zipcode": "639002",
        "website": "http://www.kvb.co.in",
        "market_cap": "Large Cap"
    },
    "KOTAKBANK.NS": {
        "short_name": "KOTAK MAHINDRA BAN",
        "long_name": "Kotak Mahindra Bank Limited",
        "summary": "Kotak Mahindra Bank Limited, provides banking and financial services to corporate and individual customers in India. It operates through Treasury, BMU, and Corporate Centre; Retail Banking; Corporate/Wholesale Banking; Vehicle Financing; Other Lending Activities; Broking; Advisory and Transactional Services; Asset Management; and Insurance segments. The Treasury, BMU and Corporate Centre segment engages in dealing in debt, equity, money and forex market, derivatives, and investments; and the primary dealership of government securities and balance sheet management unit (BMU) responsible for asset liability management. The Retail Banking segment offers commercial vehicle finance, personal, home, and other loans/services, and agriculture finance services. This segment also provides savings, current, and term deposit accounts; branch banking network and services, including distribution of financial products; and credit cards. The Corporate/Wholesale Banking segment offers wholesale borrowings and lending, and other related services to the corporate sector. Its Vehicle Financing segment provides retail vehicle and wholesale trade finance to auto dealers. The Other Lending Activities segment offers financing against securities, securitization, and other loans/services. Its Broking segment provides brokerage income on market transactions and delayed payments interest; and distributes financial products. The Advisory and Transactional Services segment offers mergers and acquisition advice, and equity/debt issue management services. Its Asset Management segment engages in the management of funds and investments on behalf of clients and funds. The Insurance segment provides life insurance and general insurance products. As of March 31, 2020, it had a network of 1,600 branches and 2,519 ATMs; and branches in GIFT City and DIFC, Dubai. Kotak Mahindra Bank Limited was founded in 1985 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.kotak.com",
        "market_cap": "Large Cap"
    },
    "KTKBANK.NS": {
        "short_name": "KARNATAKA BANK",
        "long_name": "The Karnataka Bank Limited",
        "summary": "The Karnataka Bank Limited provides personal and business banking products and services in India. It operates through four segments: Treasury Operations, Corporate/Wholesale Banking, Retail Banking, and Other Banking Operations. The company offers savings and current accounts; fixed, cash certificate, and recurring deposits; and non-resident rupee, ordinary non-resident, foreign currency, and resident foreign currency accounts, as well as NRI priority banking services. It also provides loan products, including vehicle, home, education, personal, MSME, mortgage, women entrepreneur, gold, and other loans, as well as loans against property. In addition, the company offers debit, credit, gift, deposit only, and image cards; life, general, and health insurance products; investment products; remittance and other services; and forex services comprising pre and post-shipment, export collection bills, export LC advising, inward remittance facility, import letter of credit, import bill collection, buyer's credit, and outward remittances. Further, it provides point of sale service for merchant's payment solutions; and KBL e-COLLECT, a fee payment processing platform, which enables the institution to offer parents and students a way to pay their fees through a range of payment options. Additionally, the company offers various loans for agriculture; and other services, such as Internet and mobile banking, mutual funds, demat and online trading services, locker facility, and funds transfer services. As of March 31, 2020, it operated through a network of 848 branches, 1,480 ATMs, and 2,329 service outlets. The company was founded in 1924 and is headquartered in Mangalore, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mangalore",
        "zipcode": "575002",
        "website": "http://karnatakabank.com",
        "market_cap": "Large Cap"
    },
    "MAHABANK.NS": {
        "short_name": "BK OF MAHARASHTRA",
        "long_name": "Bank of Maharashtra",
        "summary": "Bank of Maharashtra provides various banking products and services in India. The company operates through Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking segments. It accepts savings, current, and term deposits, as well as capital gain account schemes. The company also provides term loans, overdrafts, letters of credit, guarantees, and other products, as well as loans for exporters, agriculturists, corporates, entrepreneurs, professionals, and individuals; housing, skill, educational, vehicle, gold, top up, personal, and consumer loans, as well as micro, small, and medium enterprise loans; schemes for solar water heating and lighting systems, and salary gains; and loans against properties. In addition, it offers mobile-point of sale, ATM, DEMAT, real time gross settlement, national electronic funds transfer, executors and trustee, e-SBTR, e-payment, online shopping/utility payment, online share investment and trading, unified payments interface, internet and mobile banking, payroll, and door step banking services, as well as ASBA services for corporate houses/institutional investors, such as LIC/GIC/mutual fund companies; and credit and debit cards, bancassurance products, mutual funds, and pension schemes. Further, the company provides non-resident ordinary and external, foreign currency non-resident, and resident foreign currency accounts, as well as inward and outward remittance services; and documentary credits and collections, import and export financing, guarantees, travel related forex, non-resident Indians, and risk management services, as well as collects direct taxes. As of March 31, 2020, it operated 1833 branches and 1851 ATMs. Bank of Maharashtra was founded in 1935 and is headquartered in Pune, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411005",
        "website": "http://www.bankofmaharashtra.in",
        "market_cap": "Large Cap"
    },
    "PNB.NS": {
        "short_name": "PUNJAB NATL BANK",
        "long_name": "Punjab National Bank",
        "summary": "Punjab National Bank provides various banking and financial products and services in India. The company operates through Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Operations. It offers personal banking products and services, including saving fund accounts, current accounts, fixed deposit, and capital gain account and gold monetization schemes; housing, vehicle, education, personal, and mortgage loans; and cards. The company also provides various micro, small, and medium enterprises schemes; banking products for government customers; agricultural banking services; corporate banking products and services consisting of loans against future lease rentals, working capital financing, and term loans; EXIM finance and cash management services, as well as gold card schemes for exporters; and international banking products and services. In addition, it offers insurance services, such as life, fire, motor vehicle, marine, theft/burglary, fidelity guarantee, personal accident, health, travel, house hold goods, etc.; and depository, mutual fund, merchant banking, and application supported by blocked amount services. Further, the company provides mobile banking, SMS banking, missed call, e-statement, ATM, cash deposit machine, passbook updation machine, and electronic cheque deposit machine services. As of March 31, 2020, it operated a network of 7,041 branches and 9,168 ATMs in India; and 2 branches internationally. The company was founded in 1895 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110075",
        "website": "http://www.pnbindia.in",
        "market_cap": "Large Cap"
    },
    "PSB.NS": {
        "short_name": "PUNJAB & SIND BANK",
        "long_name": "Punjab & Sind Bank",
        "summary": "Punjab & Sind Bank provides various banking and financial products and services in India. It operates through Treasury Operations, Corporate/Wholesale Banking, Retail Banking, and Other Banking Operations segment. The company offers deposit products, including saving accounts, current accounts, recurring deposit accounts, and fixed deposits; and loans, such as housing, auto, education, skill, commercial vehicle, personal, doctor, mortgage, business, gold, and other loans, as well as sukhmoney scheme for senior citizens, and SB OD schemes. It also provides non fund based products, such as letter of credit, LC advising/confirming, bank guarantee, letter of comfort for availing the buyers credit, co-acceptance facility, solvency certificate, and credit report products and services, as well as priority sector schemes and debt restructuring services. In addition, the company offers locker facility, government schemes, and life and general insurance; digital banking services, including internet and mobile banking, SMS banking, Aadhaar seeding, point of sale, unified payment interface, real time gross settlement (RTGS), NEFT, ATM/debit cards, and online payment; international banking services comprising NRI schemes, export/import services, forex treasury, and resident facility, as well as products for micro and small enterprises. Punjab & Sind Bank was founded in 1908 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110008",
        "website": "http://www.psbindia.com",
        "market_cap": "Large Cap"
    },
    "RBLBANK.NS": {
        "short_name": "RBL BANK LIMITED",
        "long_name": "RBL Bank Limited",
        "summary": "RBL Bank Limited operates as a scheduled commercial bank in India. It operates through Corporate/Wholesale Banking, Retail Banking, Treasury, and Other Banking Operations segments. The company's deposit products include savings accounts, current accounts, institution accounts, and fixed deposits. It also offers business, home, personal, car, and education loans, as well as loans against property, overdraft against property, loans against gold and deposits, working capital finance, and unsecured and secured small business loans; life, general, and health insurance products; investments services, such as wealth management, e-ASBA, and national pension system; and demat account. In addition, the company provides online tax and bill payment, debit and prepaid cards, online banking, bank by phone, digital and net banking, and merchant payment services. Further, it offers mergers and acquisitions advisory, private equity capital advisory, project and infrastructure finance, real estate financing, cash management, supply chain finance, and trade and remittance services; and financial markets and treasury products, such as capital markets, and forex and bullion. Additionally, the company provides agribusiness, NRI, and signature banking services, as well as safe deposit lockers. As of March 31, 2020, it operated a network of approximately 386 bank branches; 1,245 business correspondent branches; 263 banking outlets; and 596 ATMs in 28 Indian states and Union Territories. The company was formerly known as The Ratnakar Bank Limited and changed its name to RBL Bank Limited in August 2014. RBL Bank Limited was founded in 1943 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.rblbank.com",
        "market_cap": "Large Cap"
    },
    "SBIN.NS": {
        "short_name": "STATE BK OF INDIA",
        "long_name": "State Bank of India",
        "summary": "State Bank of India provides various banking products and services to individuals, commercial enterprises, corporates, public bodies, and institutional customers in India and internationally. The company operates through Treasury, Corporate/Wholesale Banking, Retail Banking, Insurance Business, and Other Banking Business segments. It offers personal banking services, including current accounts, savings accounts, term deposits, and recurring deposits; home, auto, education, gold, and personal loans, as well as loans against property and securities; and wealth management, mobile and Internet banking, demat, ATM, foreign inward remittance, safe deposit locker, public provident fund, money transfer, pension policy, and mobile wallet services, as well as cards and inflation indexed national savings securities cumulative bonds. The company also provides corporate banking services comprising corporate accounts, working capital and project finance, term loans, deferred payment guarantees, corporate loans, structured finance, dealer and channel financing, equipment leasing, loan syndication, construction equipment loans, financing Indian firms overseas subsidiaries or JVs, and cash management, as well as export and cash, and letters of credit products. In addition, it offers NRI services, including accounts and deposits, remittances, investments, and loans; agricultural banking and micro credit to agriculturists and farmers; supply chain finance, and deposits and transaction banking services for SME customers; and international banking services. Further, the company provides treasury, broking, bill payment, and MICR services; and credit cards, life and non-life insurance, mutual funds, merchant banking, trustee business, factoring, security trading, pension fund management, and custody services. It operates 22,141 branches and 58,555 ATMs. The company was founded in 1806 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.sbi.co.in",
        "market_cap": "Large Cap"
    },
    "SBKFF": {
        "short_name": "STATE BANK OF INDIA",
        "long_name": "State Bank of India",
        "summary": "State Bank of India provides various banking products and services to individuals, commercial enterprises, corporates, public bodies, and institutional customers in India and internationally. The company operates through Treasury, Corporate/Wholesale Banking, Retail Banking, Insurance Business, and Other Banking Business segments. It offers personal banking services, including current accounts, savings accounts, term deposits, and recurring deposits; home, auto, education, gold, and personal loans, as well as loans against property and securities; and wealth management, mobile and Internet banking, demat, ATM, foreign inward remittance, safe deposit locker, public provident fund, money transfer, pension policy, and mobile wallet services, as well as cards and inflation indexed national savings securities cumulative bonds. The company also provides corporate banking services comprising corporate accounts, working capital and project finance, term loans, deferred payment guarantees, corporate loans, structured finance, dealer and channel financing, equipment leasing, loan syndication, construction equipment loans, financing Indian firms overseas subsidiaries or JVs, and cash management, as well as export and cash, and letters of credit products. In addition, it offers NRI services, including accounts and deposits, remittances, investments, and loans; agricultural banking and micro credit to agriculturists and farmers; supply chain finance, and deposits and transaction banking services for SME customers; and international banking services. Further, the company provides treasury, broking, bill payment, and MICR services; and credit cards, life and non-life insurance, mutual funds, merchant banking, trustee business, factoring, security trading, pension fund management, and custody services. It operates 22,141 branches and 58,555 ATMs. The company was founded in 1806 and is headquartered in Mumbai, India.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.sbi.co.in",
        "market_cap": "Large Cap"
    },
    "SID.F": {
        "short_name": "STATE BANK OF IND.GDR S/2",
        "long_name": "State Bank of India",
        "summary": "State Bank of India provides various banking products and services to individuals, commercial enterprises, corporates, public bodies, and institutional customers in India and internationally. The company operates through Treasury, Corporate/Wholesale Banking, Retail Banking, Insurance Business, and Other Banking Business segments. It offers personal banking services, including current accounts, savings accounts, term deposits, and recurring deposits; home, auto, education, gold, and personal loans, as well as loans against property and securities; and wealth management, mobile and Internet banking, demat, ATM, foreign inward remittance, safe deposit locker, public provident fund, money transfer, pension policy, and mobile wallet services, as well as cards and inflation indexed national savings securities cumulative bonds. The company also provides corporate banking services comprising corporate accounts, working capital and project finance, term loans, deferred payment guarantees, corporate loans, structured finance, dealer and channel financing, equipment leasing, loan syndication, construction equipment loans, financing Indian firms overseas subsidiaries or JVs, and cash management, as well as export and cash, and letters of credit products. In addition, it offers NRI services, including accounts and deposits, remittances, investments, and loans; agricultural banking and micro credit to agriculturists and farmers; supply chain finance, and deposits and transaction banking services for SME customers; and international banking services. Further, the company provides treasury, broking, bill payment, and MICR services; and credit cards, life and non-life insurance, mutual funds, merchant banking, trustee business, factoring, security trading, pension fund management, and custody services. It operates 22,141 branches and 58,555 ATMs. The company was founded in 1806 and is headquartered in Mumbai, India.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.sbi.co.in",
        "market_cap": "Large Cap"
    },
    "SOUTHBANK.NS": {
        "short_name": "SOUTH INDIA BANK",
        "long_name": "The South Indian Bank Limited",
        "summary": "The South Indian Bank Limited provides banking products and services in India. The company operates through Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Operations segments. Its personal banking products and services include savings accounts, term deposits, and unclaimed deposits/inoperative accounts; personal, car, home, gold, educational, property, and other loans, as well as one time settlement scheme for micro and small enterprises sector; and mutual funds. The company also offers insurance products, such as life insurance, health insurance, and various credit risk insurance, as well as general insurance products, such as fire, liability, marine, motor, and travel insurance products. In addition, it offers money transfer services; various cards; and value added services consisting of SIB rewards, education fee collection, 3-in-one trading KIT, green pin, SIB feebook, branch banking, FX-retail, NETC FASTag, sovereign gold bonds, credit and debit cards, ATM cum shopping card, mobile and Internet banking, demat, pension system, online trading, SIB collect, PAN service agency, cash management, travel card, tax payment, tax savings investments, direct debit, and safe deposit locker services, as well as distributes capital gain bonds and tax free bonds. Further, the company's NRI banking services comprise NRE and NRO rupee accounts, and foreign currency deposits, as well as personal, home, car, property, SIB dÃ©cor, and education loans; and portfolio investment schemes. Additionally, its business banking services consist of normal and premium accounts, and trader smart current account; working capital, long term, non-fund based, supply chain, and international finance; mortgage and business loans; and merchant acquiring services. As of March 31, 2020, the company had a network of 935 branches and 1,424 ATMs/CRMs. The South Indian Bank Limited was incorporated in 1929 and is headquartered in Thrissur, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Thrissur",
        "zipcode": "680001",
        "website": "http://www.southindianbank.com",
        "market_cap": "Large Cap"
    },
    "SURYODAY.NS": {
        "short_name": "Suryoday Small Fin Bk Ltd",
        "long_name": "Suryoday Small Finance Bank Limited",
        "summary": "Suryoday Small Finance Bank Limited operates as a small finance bank primarily serving the unserved and underserved with a focus on financial inclusion in India. The company operates through Treasury, Retail Banking, Wholesale Banking, and Other Banking Operations segments. The company accepts savings and current accounts, term and fixed deposits, recurring deposits, and certificates of deposit. It also provides finance for mortgage and commercial vehicles; and loans to micro, small, and medium enterprises, as well as loans to non-banking finance companies. In addition, the company offers home loans, secured business loans against property, joint liability group loans, and emergency credit line guarantee schemes. Further, it provides life, general, and group health insurance, as well as national pension and social security schemes. Additionally, the company offers debit cards and NRI banking services; safe deposit locker facilities and bill and UPI payment services; and internet, phone, tab, and mobile banking services. As of July 31, 2020, it operated 482 banking outlets across 12 states and union territories. The company was formerly known as Suryoday Micro Finance Limited and changed its name to Suryoday Small Finance Bank Limited in January 2017. Suryoday Small Finance Bank Limited was founded in 2008 and is based in Navi Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Navi Mumbai",
        "zipcode": "400614",
        "website": "http://www.suryodaybank.com",
        "market_cap": "Large Cap"
    },
    "UCOBANK.NS": {
        "short_name": "UCO BANK",
        "long_name": "UCO Bank",
        "summary": "UCO Bank operates as a commercial bank in India. It accepts deposit products, such as current accounts, saving accounts, fixed deposits, recurring deposits, accounts in foreign currency, salary accounts, and fee collection accounts. The company also provides home, vehicle, mortgage, education, and personal loans; working capital financing; term loans; infrastructure finance; foreign currency loans; finance to exporters and importers; agriculture credit; and finance to micro and small enterprises. In addition, it offers debit cards and mobile banking services; and international banking services, including NRI banking, remittances, forex and treasury services, resident foreign currency deposits, and correspondent banking services to Indian customers, corporates, NRIs, overseas corporate bodies, foreign companies/individuals, and foreign banks. Further, the company provides government deposit schemes/bonds, pension payments/schemes, and tax collection services; and bancassurance products, mutual funds, and money transfer services. As of March 31, 2020, it operated 42 zones and 3086 domestic branches, as well as 2 overseas branches, including 1 each in Singapore and Hong Kong. The company was formerly known as The United Commercial Bank Ltd. and changed its name to UCO Bank in December 1985. UCO Bank was founded in 1943 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700001",
        "website": "http://www.ucobank.com",
        "market_cap": "Large Cap"
    },
    "UJJIVANSFB.NS": {
        "short_name": "Ujjivan Small Financ Bank",
        "long_name": "Ujjivan Small Finance Bank Limited",
        "summary": "Ujjivan Small Finance Bank Limited provides various banking products and services in India. The company operates through Treasury, Retail Banking, and Corporate/Wholesale Banking segments. It offers current, savings, salary, and NRI accounts; and fixed, recurring, TASC fixed, and tax saver fixed deposits. The company's loan products include group loans, such as business, family, agriculture and allied, education, business top-up, emergency, and loyalty loans; individual loans comprising individual business, bazar, agriculture, and livestock loans, as well as home improvement and open market livestock loans; housing loans; and loan against properties. Its loan products also consists of micro and small enterprise loans, which include secured enterprise and business loans, overdraft facilities, and business edge term loans; personal loans; financial institutions group loans; and vehicle loans. The company also offers mobile, phone, net, SMS, and missed call banking services; debit cards; and insurance products, such as credit life, endowment, term, POS, ULIP, motor, property, home content, health, and personal accident insurance. As of March 31, 2020, it operated 575 banking outlets and 475 ATMs. The company was incorporated in 2016 and is headquartered in Bengaluru, India. Ujjivan Small Finance Bank Limited is a subsidiary of Ujjivan Financial Services Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560095",
        "website": "http://www.ujjivansfb.in",
        "market_cap": "Large Cap"
    },
    "UNIONBANK.NS": {
        "short_name": "UNION BK OF INDIA",
        "long_name": "Union Bank of India",
        "summary": "Union Bank of India provides various banking products and services. It operates through four segments: Treasury Operation, Retail Banking Operation, Corporate/Wholesale Banking, and Other Banking Operations. The company offers savings and current accounts; term and recurring deposits; and demat and online trading accounts. It also provides retail loans, including home, vehicle, education, and personal loans; loans against property; and loans for pensioners, as well as products and loans for micro, small, and medium enterprises. In addition, the company offers mutual funds, life, non-life, and general insurance products, and tax saving deposits; government saving schemes, tax collection services, pension products, and departmentalized ministries accounts; short term, long term, and other credit for agricultural/SSI/tertiary sectors; and safe deposit locker and cheque collection services. Further, it provides merchant banking services; corporate loans comprising Covid emergency line of credit, trade finance, working capital, lines of credit, project financing, and channel finance; debt structuring/restructuring, loan syndication, structured finance, mergers and acquisition advisory, and private equity services; cash management, ECGC cover, and foreign exchange services, as well as derivatives; export and import finance services; NRI banking services; and treasury and other products, and remittance services. Additionally, the company offers app, Internet, self-service, ATM, and SMS banking services; point of sale terminal and immediate payment services; and combo, debit, credit, gift, prepaid, and payroll cards. As of March 31, 2020, it operated 4,281 branches in India; 3 overseas branches at Sydney, Hong Kong, and Dubai; and 6,895 ATMs and 5,586 micro ATMs. The company was founded in 1919 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.unionbankofindia.co.in",
        "market_cap": "Large Cap"
    },
    "UZC.F": {
        "short_name": "AXIS BANK LTD. GDR REGS 5",
        "long_name": "Axis Bank Limited",
        "summary": "Axis Bank Limited provides corporate and retail banking products and services in India and internationally. The company's deposit products include savings, salary, and current accounts, as well as fixed, recurring, tax saver fixed, and flexi deposits. It also provides home, personal, holiday, car, business, gold, two wheeler, working capital, and education loans, as well as loans against properties, securities, and fixed deposits; and commercial vehicle and construction equipment loans. In addition, the company offers safe deposit locker, safe custodian, and pension system services; foreign exchange services; investment products; and life, general, home, health, travel, motor, and business guard insurance products. Further, it provides cash management, trade, treasury, capital market, corresponding banking and financial institutions, pension, and bullion services; debit and credit cards; mutual funds, public provident funds, demat accounts, and systematic investment plan; products and services for non-resident Indians; agricultural and rural banking products and services; and burgundy and priority banking products and services. Additionally, the company offers corporate, online, mobile, and phone banking; trade finance; and risk management solutions. Axis Bank Limited operates approximately 4,528 domestic branches with 12,044 ATMs and 5,433 cash recyclers; 11 overseas offices with branches at Singapore, Hong Kong, Dubai, Colombo, Shanghai, and Gift City-IBU; and representative offices at Dhaka, Dubai, Abu Dhabi, and Sharjah. The company was formerly known as UTI Bank Limited and changed its name to Axis Bank Limited in July 2007. Axis Bank Limited was incorporated in 1993 and is based in Mumbai, India.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400025",
        "website": "http://www.axisbank.com",
        "market_cap": "Large Cap"
    },
    "YESBANK.NS": {
        "short_name": "YES BANK",
        "long_name": "Yes Bank Limited",
        "summary": "Yes Bank Limited provides banking and financial services primarily in India. It operates through Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Operations segments. The company offers corporate banking services, such as working capital finance, term loans, corporate finance, trade finance and cash management services, debt capital markets, treasury, liquidity management, and other services. It also provides retail banking products, including secured business, home, car, super bike, commercial vehicle, construction equipment, gold, and personal loans, as well as loans against securities; health care and printing equipment finance; and business banking services to micro, small, and medium enterprises. In addition, the company offers financial and advisory services to ministries under the union and state governments, central and state public sector undertakings, boards, and other affiliates; and banking solutions to banks, non-banking finance and housing finance companies, asset finance companies, insurance intermediaries, small finance and payment banks, mutual funds, financial institutions, private equity funds, cooperative and regional rural banks, capital market participants, primary dealers, depositories, AD II license holders, money changers, PPI operators, and payment aggregators. Further, it provides debit and credit cards, current and savings accounts, and mobile banking services; and transaction banking services comprising escrow, trade finance, supply chain finance, foreign exchange, and bullion trading. Additionally, the company offers loan syndication services; investment banking services, including mergers and acquisition advisory, and capital advisory services; and micro-credit, micro saving, micro-insurance, and remittance services. As of March 31, 2020, it operated 1,135 branches; 2 national operating centers; and 1,423 ATMs and bunch note acceptors. The company was incorporated in 2003 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.yesbank.in",
        "market_cap": "Large Cap"
    }
}