{
    "SDBL.NS": {
        "short_name": "SOM DIST & BREW LTD",
        "long_name": "Som Distilleries & Breweries Limited",
        "summary": "Som Distilleries & Breweries Limited manufactures and sells beer and Indian made foreign liquor (IMFL) products in India and internationally. It offers beer under the Hunter, Black Fort, Power Cool, and Woodpecker brands; whisky under the Pentagon, Milestone, and Legend brand names; Vodka under the White Fox brand; rum under the Black Fort brand name; Brandy under the Legend brand; ready to drink under the Naughty Orange, Cosmo Cranberry, and Tangy Lemon brand names; and other IMFL products under the Genius, Sunny, Gypsy, and Blue Chip brands. The company was founded in 1993 and is based in Bhopal, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Beverages - Brewers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bhopal",
        "zipcode": "462011",
        "website": "http://somindia.com",
        "market_cap": "Nano Cap"
    },
    "UBL.NS": {
        "short_name": "UNITED BREWERIES L",
        "long_name": "United Breweries Limited",
        "summary": "United Breweries Limited manufactures, purchases, and sells beer and non-alcoholic beverages in India and internationally. It offers its products under the Kingfisher Premium, Kingfisher Strong, Kingfisher Ultra, Kingfisher Ultra Witbier, Kingfisher Ultra Max, Kingfisher Storm, and Kingfisher Blue, as well as Heineken, Amstel Bier, Sol, Affligem, Edelweiss, Desperados, Bullet, Cannon 10000, Zingaro, Kalyani Black Label, UB Export, UB Export Strong, London Pilsner Strong, and London Pilsner brand names. The company also exports its products; licenses its brands; and provides contract manufacturing services. United Breweries Limited was founded in 1915 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Beverages - Brewers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560001",
        "website": "http://www.unitedbreweries.com",
        "market_cap": "Mid Cap"
    }
}