{
    "BIOCON.NS": {
        "short_name": "BIOCON LTD",
        "long_name": "Biocon Limited",
        "summary": "Biocon Limited, a biopharmaceutical company, manufactures pharmaceuticals, and medicinal chemical and botanical products. The company operates through Small Molecules, Biologics, Branded Formulations, and Research Services segments. It focuses in the areas of diabetes, oncology, immunology, dermatology, ophthalmology, neurology, rheumatology, and inflammatory diseases. The company provides biosimilars comprising recombinant human insulin, insulin glargine, biosimilar trastuzumab, and other biopharmaceuticals; small molecules, such as active pharmaceutical ingredients and generic formulations; and branded formulation products under the Insugen, Basalog, BIOMAb EGFR, CANMAb, and ALZUMAb brands. It is also involved in the integrated discovery, development, and manufacturing services for small and large molecules, antibody-drug conjugates, and oligonucleotides. The company serves customers in approximately 120 countries. Biocon Limited was founded in 1978 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560100",
        "website": "http://www.biocon.com",
        "full_time_employees": null
    },
    "DCAL.NS": {
        "short_name": "DISHMAN CARBOGEN",
        "long_name": "Dishman Carbogen Amcis Limited",
        "summary": "Dishman Carbogen Amcis Limited provides contract research and manufacturing services to the pharmaceutical industry worldwide. It also manufactures and supplies marketable molecules, such as bulk drugs, intermediates, quaternary ammonium compounds, specialty chemicals, vitamins and chemicals, and disinfectants. The company was incorporated in 1983 and is headquartered in Ahmedabad, India. Dishman Carbogen Amcis Limited is a subsidiary of Adimans Technologies LLP.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380058",
        "website": "http://imdcal.com",
        "full_time_employees": null
    },
    "JUBLINGREA.NS": {
        "short_name": "Jubilant Ingrevia Limited",
        "long_name": "Jubilant Ingrevia Limited",
        "summary": "Jubilant Ingrevia Limited provides life science products and solutions in India and internationally. It operates in three segments: Specialty Chemicals, Nutrition & Health Solutions, and Life Science Chemicals. The Specialty Chemicals segment offers specialty ingredients, fine chemicals, crop protection chemicals, and contract development and manufacturing services. The Nutrition & Health Solutions segment provides nutrition and health ingredients, animal nutrition and health solutions, and human nutrition and health solutions. The Life Science Chemicals offers life science ingredients and specialty ethanol. The company also offers pyridine and picolines, cyanopyridines, piperidines, acetyl pyridines, amino pyridines, halo pyridines, pyridine aldehydes, metal complexes, amino pyridines, halogenated pyridines, quaternary salts, alkyl pyridines, vitamin B3 and picolinates, riboflavin phosphate sodium, nutritional premixes, antioxidants, straight ingredients, acetic anhydride, acetic acid, ethyl acetate, propionic anhydride, absolute alcohol, ethanol, biocompost, CO2 and ETO mixtures. In addition, it provides route design, process development, process optimization, and scale-up and commercial manufacturing of intermediates. Further, the company offers vitamins, mineral premixes, stress regulator, amino acid, herbal choline, herbal non-antibiotic growth promoter and egg quality enhancer, toxin binder, acidifiers, and enzymes and emulsifiers. It serves pharmaceutical, nutrition, agrochemical, consumer, and industrial customers. The company was formerly known as Jubilant LSI Limited and changed its name to Jubilant Ingrevia Limited in October 2020. Jubilant Ingrevia Limited was incorporated in 2019 and based in Noida, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201301",
        "website": "http://jubilantingrevia.com",
        "full_time_employees": null
    },
    "LYKALABS.NS": {
        "short_name": "LYKA LABORATORIES",
        "long_name": "Lyka Labs Limited",
        "summary": "Lyka Labs Limited engages in manufacturing pharmaceutical formulations and active pharmaceutical ingredients various therapeutic segments in India. It manufactures and sells various formulations, including emollient, topical steroid, antifungal agent, topical anti-bacterial, acne management, dermatological formulation, pain killer, anti-aging, cleansing lotion, hair care, anti-dandruff shampoo, sunscreen, anti-acne, cosmeceutical, anti-oxidant, proton pump inhibitor, anti-malarial, anti-bacterial, corticosteroid hormones, cephalosporin, dry powder injection, muscle relaxant, bone resorption inhibitor, anti-oxidant/liver disease, antibiotic, and lyophilized products. The company also provides contracted manufacturing services to various large pharmaceutical companies; and medical and technical assistance in the areas of manufacturing know how and manufacturing facilities, as well as technical data, such as molecule stability testing data, impurity profile, BA/BE clinical study data, etc. In addition, it provides products and services in therapeutic categories, such as intensive care, gastroenterology, anti-infective, anti-fungal, surgery care, cosmetologist, urology, wound care, and anesthesia, as well as deals in pharmaceutical products. Lyka Labs Limited offers its products in various formulations, including injections, creams, ointments, foams, gels, and lotions. Further, the company exports its products to Bangladesh, Combodia, Congo, Costa Rica, Peru, Romania, Russia, Sri Lanka, Sudan, Ukraine, Venezuela, and Vietnam. Lyka Labs Limited was incorporated in 1976 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400036",
        "website": "http://www.lykalabs.com",
        "full_time_employees": 106
    },
    "PANACEABIO.NS": {
        "short_name": "PANACEA BIOTEC LTD",
        "long_name": "Panacea Biotec Limited",
        "summary": "Panacea Biotec Limited, a biotechnology company, engages in the research, development, manufacture, and marketing of pharmaceuticals, vaccines, and biosimilar in India. The company operates through Vaccines, Formulations, and Real Estate segments. Its product portfolio includes prescription products in various therapeutic areas, including pain management, diabetes and cardiovascular management, oncology, renal disease management, osteoporosis management, anti-tubercular, and gastro-intestinal care; and vaccines for anthrax, dengue, Japanese encephalitis, and others. The company also engages in the real estate business. In addition, it exports its products to approximately 30 countries worldwide. The company has a collaboration agreement with Refana Inc. for the development, manufacturing, and distribution of the Covid-19 vaccine. Panacea Biotec Limited was founded in 1984 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110044",
        "website": "http://www.panaceabiotec.com",
        "full_time_employees": 2338
    },
    "SMSLIFE.NS": {
        "short_name": "SMS LIFESCIENCES",
        "long_name": "SMS Lifesciences India Limited",
        "summary": "SMS Lifesciences India Limited researches, develops, manufactures, buys, imports, and sells active pharmaceutical ingredients (API) and its intermediates, organic and inorganic chemicals, and pharmaceuticals in India and internationally. The company offers APIs in various therapeutic areas, such as antiulcer, antifungal, and erectile dysfunction. It also provides consultancy services; and contract manufacturing services for APIs and intermediates. In addition, the company exports its products. The company was founded in 1990 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500096",
        "website": "http://www.smslife.in",
        "full_time_employees": 422
    },
    "SYNGENE.NS": {
        "short_name": "SYNGENE INTERNATIO",
        "long_name": "Syngene International Limited",
        "summary": "Syngene International Limited, a contract research and manufacturing company, provides drug discovery and development services in India and internationally. The company offers discovery chemistry services, such as medicinal and synthetic chemistry, library and peptide synthesis, biomolecules, organic electronic materials, and computational and discovery analytical chemistry; and discovery biology services in the areas of recombinant DNA engineering, cell line development, hybridoma technology, sequencing, protein sciences, screening and assay biology, DMPK, in vivo pharmacology, toxicology, and biologicals. It also provides development services in biologics; and carries out exploratory/discovery, In Vitro and Genetic toxicology, and developmental and reproductive, as well as acute, sub-chronic, and chronic toxicity studies. In addition, the company offers chemical and formulation development, polymer research, and analytical services. Further, it provides target identification and validation, lead generation and optimization, lead selection, preclinical development, API, and drug product development services. Additionally, the company offers clinical trial management, PK analysis/bioanalytical, central lab, biometrics and clinical data management, regulatory, medical monitoring, pharmacovigilance, and medical writing services. It also provides bioinformatics research, antibody drug conjugate discovery and development, and oligonucleotide synthesis services. The company serves start-up companies, pharma/biotech, agrochemical, chemical, nutrition, and animal health companies. It has partnerships with Bristol-Myers Squibb Co.; Baxter International Inc.; Amgen Inc.; Zoetis Inc.; GSK; Merck KGaA; Artelo Biosciences, Inc.; PharmAust Limited; HiMedia Laboratories; and Zumutor Biologics. The company was incorporated in 1993 and is based in Bengaluru, India. Syngene International Limited is a subsidiary of Biocon Limited.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560099",
        "website": "http://www.syngeneintl.com",
        "full_time_employees": null
    },
    "TAKE.NS": {
        "short_name": "TAKE SOLUTIONS",
        "long_name": "TAKE Solutions Limited",
        "summary": "TAKE Solutions Limited, together with its subsidiaries, provides domain-intensive services and solutions in life sciences and supply chain management in the United States, Asia Pacific, and Europe. It offers IP-driven and technology backed solutions, consulting, technology, and functional services across clinical, regulatory, and safety for life sciences industry. The company also provides software solutions related to enterprise mobility, material tracking, value chain collaboration, business services sourcing, trade management, and engineering design for the technology, consumer packaged goods, oil and gas, and automotive sectors. It offers its supply chain management services through a cloud platform, on premise, and through hand-held devices; and engineering services, including engineering, sourcing, and technology services. The company's IP-led approach enables its clients to automate supply chain processes; track, trace, and control at item level; mandate supplier compliance; and streamline material and shipment movement. The company was founded in 2000 and is headquartered in Chennai, India. TAKE Solutions Limited is a subsidiary of TAKE Solutions Pte Ltd.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600034",
        "website": "http://www.takesolutions.com",
        "full_time_employees": 1297
    },
    "ZOTA.NS": {
        "short_name": "Zota Health Care Limited",
        "long_name": "Zota Health Care Limited",
        "summary": "Zota Health Care Limited manufactures and markets pharmaceutical products in India. The company offers generic drugs, OTC pharmaceutical products, ayurvedic products, and nutraceutical products. As of December 30, 2020, it operated 491 retail stores under the DAVAINDIA name in 21 states of India. The company was founded in 1995 and is headquartered in Surat, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Surat",
        "zipcode": "395002",
        "website": "http://www.zotahealthcare.com",
        "full_time_employees": 348
    }
}