{
    "AHLADA.NS": {
        "short_name": "Ahlada Engineers Limited",
        "long_name": "Ahlada Engineers Limited",
        "summary": "Ahlada Engineers Limited manufactures and sells steel doors and windows in India. It offers steel doors, including residential and commercial doors; and steel windows, such as single and double rebate windows. The company also manufactures and sells cleanroom equipment comprising pass box, horizontal and vertical air flow units, air showers, mobile LAF trolleys, bio-safety cabinets, dispensing and sampling booths, and sanitizing tunnels; clean room furniture, such as double sink cabinet, cupboards, die cabinets, cages, cage trolleys, table with keyboard slots and lockers, cross over benches, dust bins, enclosures, flat pallets, chairs, school benches, office tables, recycle cabinets, gown dispensers, steps, steps ladder, material trolleys, pallet shelves, pigeon cupboards, tool box cabinets, work shop carts, stools, and storage tanks; and water purifying systems. It serves the pharmaceutical, biotechnology, food, healthcare, entertainment, real estate, and other industries. The company also exports its products. Ahlada Engineers Limited was founded in 2005 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "APOLLOPIPE.NS": {
        "short_name": "Apollo Pipes Limited",
        "long_name": "Apollo Pipes Limited",
        "summary": "Apollo Pipes Limited engages in the manufacturing and trading of polyvinyl chloride (PVC) pipes and fittings under the APL Apollo brand name in India and internationally. The company offers cPVC, uPVC, HDPE, and UPVC pipes and fittings; sprinkler and drainage systems; bath fittings, including faucets, cisterns, showers, seat covers, and other accessories; and solvent cement. Its products are used in agriculture, water management, construction, infrastructure, and telecom ducting applications. The company was formerly known as Amulya Leasing and Finance Limited and changed its name to Apollo Pipes Limited in December 2017. Apollo Pipes Limited was incorporated in 1985 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "AROGRANITE.NS": {
        "short_name": "ARO GRANITE INDUS",
        "long_name": "Aro Granite Industries Limited",
        "summary": "Aro Granite Industries Limited engages in the manufacturing, processing, and selling of polished/flamed granite tiles and slabs primarily in India. The company also exports its products to North America, South America, Europe, and the Far East markets. Aro Granite Industries Limited was incorporated in 1988 and is based in Hosur, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hosur"
    },
    "ASIANTILES.NS": {
        "short_name": "ASIAN GRANITO INDI",
        "long_name": "Asian Granito India Limited",
        "summary": "Asian Granito India Limited, together with its subsidiaries, manufactures and sells tiles, marbles, and quartz products in India and internationally. The company offers ceramic wall and floor tiles, glazed vitrified tiles, polished glazed vitrified tiles, and composite marble and quartz stone products. It also provides bath ware products, such as water closet, basin, EWC and Orissa pan, cistern, bathroom furniture, and faucets. The company distributes its products through a network of dealers and sub-dealers, display centers, and exclusive showrooms. It also exports its products. The company was incorporated in 1995 and is headquartered in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Ahmedabad"
    },
    "ASTRAL.NS": {
        "short_name": "ASTRAL LTD",
        "long_name": "Astral Limited",
        "summary": "Astral Limited, together with its subsidiaries, manufactures and markets pipes, fittings, and adhesive products in India and internationally. The company operates through Plastic Products and Adhesives segments. It offers chlorinated poly vinyl chloride (CPVC) and PVC plumbing systems for residential and industrial applications. The company offers pipes and fittings under the Astral CPVC Pro, Astral Pex-a PRO, and Astral Aquarius names; and surface drainage systems. It also provides ASTRAL SILENCIO low noise system; Astral DrainMaster, a drainage system for soil, waste, and rain water; ASTRAL Foamcore pipes for underground drainage systems; ASTRAL DrainHulk manhole chambers; ASTRAL underground drainage systems; and D-Rex double walled corrugated pipes. In addition, the company offers ASTRAL Chem PRO industrial piping systems for industrial applications; and Aquarius Plus lead-free ASTM PVC solvent weld industrial piping systems. Further, it provides Pre-StiRex and Plus + StiRex ducts for post-tensioning of bridges; Bore-Well column pipes, Case-Well uPVC casing pipes, Aquasafe pressure pipes, AquaRex drain belts, and GeoRex single wall corrugated perforated pipes; and Astral Fire Pro, a CPVC piping system for automatic fire sprinklers. Additionally, the company offers ASTRAL XLPE Insu PRO insulation tubes; Astral Wire Guard conduit pipes for protection of wires and cables; and TeleRex pipes for underground cable ducting. Additionally, the company offers ancillary products, including clamps and hangers for pipes and cables; and alcohol base sanitizer under the RESI SHIELD brand name. The company was formerly known as Astral Poly Technik Limited and changed its name to Astral Limited in April 2021. Astral Limited was founded in 1996 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Ahmedabad"
    },
    "BEARDSELL.NS": {
        "short_name": "BEARDSELL LTD",
        "long_name": "Beardsell Limited",
        "summary": "Beardsell Limited manufactures and supplies expanded polystyrene (EPS) products and prefabricated buildings for various industrial applications in India. It operates through two segments, Insulation and Trading. The company offers turnkey solutions for clean rooms that are used in pharma, electronics, and specialty applications; and pre-fabricated structures, including panel-based cold storages, site offices, affordable and modular housing systems, doors and insulated partitions, and roof-top structures. It also provides process and building insulation materials, as well as acoustic absorption panels and high density PUF slabs; packaging solutions comprising EPS, anti-static, and composite packaging; and portable and fabricated mini-shelters used by the police or private guards. In addition, the company markets textiles and electric motors; exports fabrics, telemedicine equipment, information technology products, etc. Further, it undertakes erection, commissioning, and maintenance works in the field of hot and cold insulation solutions. The company was incorporated in 1936 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "BIGBLOC.NS": {
        "short_name": "BIGBLOC CONSTRUCTI",
        "long_name": "Bigbloc Construction Limited",
        "summary": "Bigbloc Construction Limited manufactures and sells aerated autoclave concrete (AAC) blocks in India. The company offers building blocks and AAC bricks. It markets its AAC blocks under the NXTBLOC brand name. Bigbloc Construction Limited was incorporated in 2015 and is headquartered in Surat, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Surat"
    },
    "CERA.NS": {
        "short_name": "CERA SANITARYWARE",
        "long_name": "Cera Sanitaryware Limited",
        "summary": "Cera Sanitaryware Limited manufactures, sells, trades in, and outsources sanitary ware and faucet ware products in India. It offers sanitary ware products, including EWC's, wash basins, cisterns, seat covers, urinals, electronic flushing systems, water saving products, bath accessories, and kids range products, as well as special needs products. The company also provides faucets comprising single lever faucets, quarter and half turn faucets, sensor and touch faucets, showers, health faucets, bathroom allied products and accessories, and other auxiliary products; and wellness products consisting of steam shower rooms, shower cubicles and partitions, bath tubs and whirlpool, fillers, shower panels, indoor swimming pools, and pressure pumps. In addition, it offers kitchen sinks; mirrors, and wall and floor tiles. The company also exports its products. The company was formerly known as Madhusudan Oils and Fats Limited and changed its name to Cera Sanitaryware Limited in November 2002. Cera Sanitaryware Limited was founded in 1980 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Ahmedabad"
    },
    "EVERESTIND.NS": {
        "short_name": "EVEREST INDUSTRIES",
        "long_name": "Everest Industries Limited",
        "summary": "Everest Industries Limited manufactures and trades in building products for residential, commercial, and industrial applications in India. The company operates through Building Products and Steel Buildings segments. It offers building products, such as fiber cement roofing sheets, Durasteel colored metal roofing sheets, polycarbonate roofing sheets, EPDM washers, fiber cement boards, cement wood planks, ceilings, stone claddings, and heavy duty boards and readymade walls, as well as Rapicon walls. Everest Industries Limited also provides pre-engineered buildings, smart steel buildings, and industrial roofing and cladding, as well as accessories. The company exports its products to approximately 35 countries. Everest Industries Limited was founded in 1934 and is based in Noida, India. Everest Industries Limited is a subsidiary of Falak Investment Private Limited.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    },
    "FINPIPE.NS": {
        "short_name": "FINOLEX INDUSTRIES",
        "long_name": "Finolex Industries Limited",
        "summary": "Finolex Industries Limited manufactures and sells polyvinyl chloride (PVC) pipes and fittings, and PVC resins in India. It operates in two segments, PVC Resin and PVC Pipes and Fittings. The company offers agriculture pipes and fittings; column pipes; casting pipes; solvent cement and lubricant; ASTM plumbing pipes and fittings; CPVC pipes and fittings; underground sewerage pipes; and SWR pipes and fittings. Its PVC resins has applications in various areas, such as manufacturing of pipes, insulation of cables, window profiles, flooring, blister packaging, etc. The company also generates and sells power. It distributes its products through dealers, warehouses, and retail outlets. Finolex Industries Limited was founded in 1956 and is headquartered in Pune, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Pune"
    },
    "GRINDWELL.NS": {
        "short_name": "GRINDWELL NORTON",
        "long_name": "Grindwell Norton Limited",
        "summary": "Grindwell Norton Limited manufactures and sells abrasives, ceramics, and plastic products in India. The company offers bonded abrasives in the form of wheels and other shapes, such as segments, sticks, etc. for various applications, including lapping, honing, super-finishing, race grinding, thread grinding, fluting, OD grinding, ID grinding, surface grinding, etc., as well as for rough applications comprising snagging, cutting-off, burr removal, weld preparation, etc. It also provides coated abrasives products in various shapes, such as discs, belts, rolls, etc. for material removal and surface preparation; non-woven abrasives; super abrasives for precision applications, including diamond and cubic born nitride; and cutting-edge abrasive products. In addition, the company offers silicon carbide grains primarily for use as raw material in the manufacture of abrasives and refractories, as well as for stone polishing; and performance ceramics and refractories for use in processing ferrous and non-ferrous metals, kiln furniture, and fire porcelain wares, as well as used as filtering media, wear resistance material, and body and vehicular ballistic protection plates. Further, it produces and markets performance plastics comprising bearings, seals, tubing and hoses, films, fabrics, and foams for use in the automotive, oil and gas, life sciences, construction, energy, and general industrial applications. The company also exports its products. The company was founded in 1941 and is based in Mumbai, India. Grindwell Norton Limited is a subsidiary of Compagnie de Saint-Gobain.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "HIL.NS": {
        "short_name": "HIL LIMITED",
        "long_name": "HIL Limited",
        "summary": "HIL Limited produces and distributes building products, thermal insulation products, and wind power products in India and internationally. It operates through Roofing Solutions, Building Solutions, Polymer Solutions, Flooring Solutions, and Others segments. The Roofing Solutions segment provides fiber cement sheets, colored steel and cement sheets, and non-asbestos corrugated roofing sheets under the Charminar and Charminar Fortune brands. The Building Solutions segment offers wet walling and dry walling solutions, including block jointing mortar, cement sandwich panels, fly ash blocks, fiber cement boards, designer boards, tile adhesives, and ready mix plaster under the Birla Aerocon brand. The Polymer Solutions segment offers UPVC, CPVC, SWR pipes and fittings, column and pressure pipes under the Birla HIL Pipes brand, as well as wall putty under the Birla HIL Putty brand. The Flooring Solutions segment provides laminate flooring, engineered wood flooring, and resilient floor covering/vinyl flooring products, as well as skirtings and wall panel products under the Parador brand. The Others segments generates electricity through wind power; and manufactures material handling, and processing plant and equipment. The company was formerly known as Hyderabad Industries Limited and changed its name to HIL Limited in July 2012. HIL Limited was founded in 1946 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "KAJARIACER.NS": {
        "short_name": "KAJARIA CERAMICS",
        "long_name": "Kajaria Ceramics Limited",
        "summary": "Kajaria Ceramics Limited manufactures and sells ceramic and vitrified tiles under the Kajaria Eternity brand in India. The company's products include ceramic wall and floor tiles, polished vitrified tiles, glazed vitrified tiles, sanitary ware and faucets, adhesives for ceramic and vitrified tiles, epoxy and unsanded grout, and tiles cleaner. It also exports its products to approximately 35 countries. The company was incorporated in 1985 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "MADHAV.NS": {
        "short_name": "MADHAV MARB & GRAN",
        "long_name": "Madhav Marbles and Granites Limited",
        "summary": "Madhav Marbles and Granites Limited manufactures, processes, and trades in granite and marble slabs and tiles in India. It also provides sandstone, quartz, and tile products. The company exports its products to the United States, Canada, Europe, Australia, South Africa, Russia, and the Far East. It is also involved in the windmill power generation and real estate businesses. The company was founded in 1989 and is based in Udaipur, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Udaipur"
    },
    "MURUDCERA.NS": {
        "short_name": "MURUDESHWAR CERAMI",
        "long_name": "Murudeshwar Ceramics Ltd.",
        "summary": "Murudeshwar Ceramics Ltd. manufactures and sells ceramic and Vitrified floor and wall tiles in India, the Americas, South America, Europe, and internationally. It offers wall tiles, such as bathroom, kitchen, and outdoor tiles; and floor tiles, such as glazed and polished glazed vitrified, double charge, soluble salt, full body, and exteriors tiles, as well as wooden strips under the Naveen Ceramic Tiles and Naveen Diamontile brand names. The company also involved in the construction and maintenance of water main line connection; and water reservoirs including irrigation system and earth work. Murudeshwar Ceramics Ltd. was founded in 1983 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "NITCO.NS": {
        "short_name": "NITCO LIMITED",
        "long_name": "NITCO Limited",
        "summary": "NITCO Limited, together with its subsidiaries, manufactures and sells floor and wall solutions in India. The company operates through two segments, Tiles and Other Related Products; and Real Estate segments. It offers ceramic wall and floor tiles; polished and glazed vitrified tiles; and vitrified DCH, heavy duty, and SST tiles. The company sells its products through approximately 2,000 sub dealers and 500 direct dealers; and operates 11 display centers under the Le Studio brand name, as well as 95 showrooms as franchisees under the Le Studio Express and Nitco Look names. In addition, NITCO Limited exports its products to Nepal, South Africa, the United Arab Emirates, Belgium, Ireland, Thailand, Bahrain, Uganda, Seychelles, Botswana, Zambia, Maldives, Poland, Qatar, Australia, Bhutan, Kenya, Ethiopia, Singapore, Kuwait, Taiwan, Tanzania, Fiji, Canada, and internationally. Further, the company develops real estate projects. NITCO Limited was founded in 1953 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "ORIENTALTL.NS": {
        "short_name": "ORIENTAL TRIMEX",
        "long_name": "Oriental Trimex Limited",
        "summary": "Oriental Trimex Limited imports, processes, and supplies marble products in India. The company offers a range of marble, travertine, and onyx products. It is also involved in the mining and processing of granite. The company serves architects, building and construction industry, hotels, hospitals, and shopping malls, as well as commercial, retail, and residential projects. The company was incorporated in 1996 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "ORIENTBELL.NS": {
        "short_name": "ORIENT BELL LTD",
        "long_name": "Orient Bell Limited",
        "summary": "Orient Bell Limited manufactures, trades in, and sells ceramic tiles in India and internationally. It offers vitrified, ceramic, porcelain, anti-skid, digital, double charge, cool, Nano, glazed vitrified, designer, polished glazed vitrified, forever, printed double charge, germ free, stain resistant, non-digital, highlighter, polished vitrified, double glazed vitrified, full body vitrified, and wood tiles. The company provides tiles for various applications, including floor, walls, bathrooms, kitchens, rooms, outdoors, swimming pools, parking, terrace, balcony, commercial, office, restaurant, pathway, hospitals, schools, automotive, and pavers. It sells its products through channel partners. Orient Bell Limited was founded in 1977 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "POKARNA.NS": {
        "short_name": "POKARNA LTD",
        "long_name": "Pokarna Limited",
        "summary": "Pokarna Limited manufactures, processes, and sells granites and quartz surface countertops in India, the United States, China, and internationally. It offers granite products in various colors, such as acacia, black galaxy, coffee brown, flash blue, Pokarna green, sapphire blue, seaweed green, silver pearl, and vizag blue. The company also provides random slabs and tiles, as well as cut-to-size products. In addition, it manufactures and retails apparel under the Stanza brand name. The company exports granites to approximately 12 countries across Europe, the Middle East, and North America. Pokarna Limited was founded in 1991 and is headquartered in Secunderabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Secunderabad"
    },
    "PPL.NS": {
        "short_name": "PRAKASH PIPES LTD",
        "long_name": "Prakash Pipes Limited",
        "summary": "Prakash Pipes Limited manufactures and supplies PVC pipes and fittings, and packaging products in India. The company offers unplasticised PVC (uPVC) pipes; casing pipes; plumbing uPVC pipes; column pipes; soil waste rain pipes; and uPVC fittings, as well as flexible packaging products, such as barrier films and laminates. Its PVC products are used for irrigation, drainage, housing, and sanitation applications; and flexible packaging products are used in the packaging of fast-moving consumer goods, food, beverages, oil, personal care, infrastructure, and pharmaceutical products. The company offers its products under the Prakash brand name. Prakash Pipes Limited was founded in 1981 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "RAMCOIND.NS": {
        "short_name": "RAMCO INDUSTRIES",
        "long_name": "Ramco Industries Limited",
        "summary": "Ramco Industries Limited engages in the building product, textile, and power generation businesses in India. It offers fiber cement roofing sheets and calcium silicate boards; and various accessories and metal framing products. The company also provides design and material consultancy, project execution, site quality assurance, and dry construction methods training services; and invests in securities. In addition, it operates 15 wind mills with an installed capacity of 16.73 MW in Tirunelveli and Coimbatore Districts of Tamil Nadu; Chitradurga and Hassan Districts in Karnataka; and Kutch District in Gujarat. Ramco Industries Limited was incorporated in 1965 and is headquartered in Chennai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "REGENCERAM.NS": {
        "short_name": "REGENCY CERAMICS",
        "long_name": "Regency Ceramics Limited",
        "summary": "Regency Ceramics Limited manufactures and sells glazed and unglazed ceramic floor and wall tiles in India and internationally. It offers glazed vitrified, parking, and heavy-duty tiles for high traffic areas, as well as imported and duro tiles, and tile highlighters. The company also exports its products. Regency Ceramics Limited was founded in 1983 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "SEZAL.NS": {
        "short_name": "SEZAL GLASS",
        "long_name": "Sejal Glass Limited",
        "summary": "Sejal Glass Limited manufactures and sells value added glass in India and internationally. It offers solid glass, insulating glass units, laminated glass, decor glass, and body tinted and pyrolytic coated solar control glass products. The company was formerly known as Sezal Glass Limited and changed its name to Sejal Glass Limited in March 2014. Sejal Glass Limited was founded in 1998 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "SOMANYCERA.NS": {
        "short_name": "SOMANY CERAMICS LD",
        "long_name": "Somany Ceramics Limited",
        "summary": "Somany Ceramics Limited manufactures and sells ceramic tiles and related products in India. It offers ceramic wall and floor tiles, polished vitrified tiles, glazed vitrified tiles, sanitaryware, and bath fittings, as well as tile laying solutions. It provides its products under the Somany Duragress, Somany Durastone, Somany Glostra, Somany Vistoso, Somany Vitro, Somany Slipshield, Somany VC Shield, Somany Signature, and Somany French Collection brands. The company also exports its products. It operates through a network of 8,000 touch-points, which comprises 2,000 active dealers, 6,000 sub-dealers, and 328 showrooms/display centers. The company was founded in 1968 and is headquartered in Noida, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    },
    "TEXMOPIPES.NS": {
        "short_name": "TEXMO PIPES & PROD",
        "long_name": "Texmo Pipes and Products Limited",
        "summary": "Texmo Pipes and Products Limited engages in the manufacture and trading of plastic products in India and internationally. It provides CPVC, SWR, and plumbing pipes and fittings; submersible column pipes; rigid PVC pipes and agricultural fittings; casing pipes for tube wells; HDPE coils; PLB HDPE ducts; and HDPE sprinkler pipes and fittings. The company also offers drip irrigation systems; suction hoses; garden and conduit pipes; and solvent cement products for joining RPVC pipes and fittings under the TEXMO brand. It serves customers in government and semi government organizations, and private sector. The company was formerly known as Shree Mohit Industries and changed its name to Texmo Pipes and Products Limited in July 2008. Texmo Pipes and Products Limited was founded in 1999 and is headquartered in Burhanpur, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Burhanpur"
    },
    "TIJARIA.NS": {
        "short_name": "TIJARIA POLYPIPES",
        "long_name": "Tijaria Polypipes Limited",
        "summary": "Tijaria Polypipes Limited manufactures and sells pipes, sprinkle systems, conduit pipes, etc. under the Tijaria and Vikas brand names in India and internationally. It operates in two segments, Pipes and Textiles. The company offers high density poly ethylene (HDPE) pipes and coils, permanently lubricated HDPE ducts, HDPE double wall corrugated structured-wall pipes, HDPE sprinkler systems, micro/drip irrigation systems, medium density poly ethylene pipes, unplasticised ploy vinyl chloride (uPVC) rigid pipes and blue casings, uPVC elastomeric seal ring fit pipes, unplasticised non-pressure polyvinyl chloride underground drainage and sewerage pipes, SWR pipes and fittings, polyvinylchloride electrical conduit pipes, and CPVC hot and cold water piping systems. It also provides polyester mink blankets, polyester partially oriented yarns, and polyester drawn textured yarns, as well as face masks. The company was incorporated in 2006 and is based in Jaipur, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Jaipur"
    },
    "VISAKAIND.NS": {
        "short_name": "VISAKA IND",
        "long_name": "Visaka Industries Limited",
        "summary": "Visaka Industries Limited manufactures and sells corrugated cement fiber sheets in India. The company operates in two segments, Building Products and Synthetic Yarn. It offers cement asbestos, such as close fitting adjustable ridges, apron pieces, cladding/walling, north light ridges, barge boards, north light curves, serrated adjustable ridges, roof lights, and ridge finials. The company also provides VNext Board, VNext Premium, VNext Plank, VNext Infill, VNext Designer, and VNext Panel for various applications, such as wall paneling, dry walls, partitions, false ceilings, mezzanine flooring, roof underlay, kitchen cabinets, shelves, external cladding, sidings, faÃ§ades, gates cladding, and soffits; and ATUM, an integrated solar roo?ng system. In addition, it offers cotton-touch air-jet-spun polyester yarns; melange yarns; twist yarns; and specialty yarns. The company markets its building products directly to retailers. The company also exports its products to the Middle East, Africa, South-East Asian countries, and the United States. Visaka Industries Limited was founded in 1981 and is based in Secunderabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Secunderabad"
    }
}