{
    "CONTROLPR.NS": {
        "short_name": "CONTROL PRINT LTD",
        "long_name": "Control Print Limited",
        "summary": "Control Print Limited manufactures and sells coding and marking machines and consumables in India and internationally. It offers continuous inkjet printers, high-resolution printers, thermal inkjet printers, thermal transfer over printers, large character printers, laser printers, and hot quick coders, as well as consumables, including inkjet fluids, ribbons, and ink rolls. The company also provides surgical face masks. It serves the agrochemicals and seeds, automotive, beverages, building and construction material, cable and wire, cement, chemicals and lubricants, electronics, food, fast moving consumer goods, healthcare, packaging and packaging materials, pipes and extruded plastics, plywood, rubber and tires, steel and metal, and textile industries. The company was founded in 1991 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400059",
        "website": "http://www.controlprint.com",
        "full_time_employees": null
    },
    "KOKUYOCMLN.NS": {
        "short_name": "KOKUYO CAMLIN LTD",
        "long_name": "Kokuyo Camlin Limited",
        "summary": "Kokuyo Camlin Limited manufactures and trades in stationery products, hobby art materials, and scholastic products in India. It provides adhesives, brush pens, clay and dough products, color pencils, color pen pencils, drawing books, fountain pens and ink products, gel crayons, geometry boxes and accessories, gift sets and kits, mechanical pencils and leads, notebooks, oil pastels, pencils and pals, pens, plastic crayons, sketch pens, student poster colors, students' water color cakes, students' water color tubes, technical instruments, washable crayons, and wax crayons for students and parents. The company also offers correction pens, gum and paste products, markers and marker inks, and office products accessories for office professionals; and acrylic sprays, art materials, artist's pastels, artist's water colors, artist's acrylic colors, artist's oil colors, brushes, canvas, drawing inks, drawing pencils/charcoals, other art materials, painting mediums, premium color and bi-color pencils, premium poster colors, students' oil colors, and water color pencils for artists and designers. In addition, it provides 3D glitters, colors, cone-liners, fluid acrylic colors, hobby brushes, hobby mediums, and sparkle colors for hobbyists. The company markets its products under the Camel and Camlin brands. It also exports its products primarily to SAARC countries, the Middle East, and Japan. The company was formerly known as Camlin Limited and changed its name to Kokuyo Camlin Limited in 2012. The company was founded in 1931 and is based in Mumbai, India. Kokuyo Camlin Limited operates as a subsidiary of Kokuyo Co., Ltd.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400093",
        "website": "http://www.kokuyocamlin.com",
        "full_time_employees": 1211
    },
    "LINCPEN.NS": {
        "short_name": "LINC PEN & PLASTIC",
        "long_name": "Linc Pen & Plastics Limited",
        "summary": "Linc Pen & Plastics Limited manufactures and markets writing instruments and stationery products in India and internationally. The company offers gel, ball, retractable ball, and fountain pens; whiteboard, permanent board, and DVD/CD/OHP markers/hi-lighters; pencils; and files and folders under the Linc brand. It also imports, markets, and distributes Uniball products. Linc Pen & Plastics Limited was founded in 1976 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700027",
        "website": "http://www.lincpen.com",
        "full_time_employees": 918
    }
}