{
  "AKSHOPTFBR.NS": {
    "city": "New Delhi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Communication Equipment",
    "long_name": "Aksh Optifibre Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "AKSH OPTIFIBRE",
    "state": null,
    "summary": "Aksh Optifibre Limited designs, manufactures, and sells optical fiber cables in India. It operates through Manufacturing, Services, and Trading of Goods segments. The company offers optical fibers, including single mode and multimode; and a range of optical fiber cables, such as duct, steel and glass armored, fiber to the home (FTTH), aerial, indoor, and special application cables for various applications in telecommunication networks. It also provides cable reinforcement solutions comprising fiber and aramid reinforcement plastic rods, Teleglass water blocking yarns, and non-water blocking yarns/Teleglass SS; ophthalmic lens; network connectivity products consisting of work area outlet, patching, cross connect, and optical fiber systems, as well as patch cords, cable and cable assemblies, and support structures; and LED bulbs. In addition, the company offers various services, such as Internet protocol television services under the iControl brand; voice over Internet protocol services under the Pigeon brand name; and FTTH solutions for home owners, business owners, and property developers, as well as an integrated set of components, systems, engineering, and installations for turn-key projects. Further, it provides e-governance services under the 1 Stopaksh brand name. The company also exports its products to the United States, Europe, South America, CIS, Africa, the Middle East, and Asia. Aksh Optifibre Limited was founded in 1986 and is based in New Delhi, India.",
    "website": "http://www.akshoptifibre.com",
    "zipcode": "110044"
  },
  "ASTRAMICRO.NS": {
    "city": "Hyderabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Communication Equipment",
    "long_name": "Astra Microwave Products Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "ASTRA MICROWAVE PR",
    "state": null,
    "summary": "Astra Microwave Products Limited designs, develops, and manufactures sub-systems for radio frequency and microwave systems used in defense, space, meteorology, and telecommunication applications in India. It offers radar electronics, including active antenna array units, TR modules, wideband TR modules, solid state power amplifiers, receiver exciters, central units, antenna beam forming units, all receiver subsystems, array group and monopulse receivers, waveform generators, and MMIC; electronic warfare comprising antennas, EDLVA and BLI super components, EW simulators, DIFM receivers, front end receivers, up/down convertors, and homodyne receivers; and strategic electronics and telemetry, such as command guidance units, radio proximity fuze, phased array based telemetry tracking system, sub-systems for gimbal based and AESA seeker, ground and air-borne data link systems, data and video telemetry transmitters, transponders, encoders and decoders, and telemetry receivers, as well as L, S, C, and X-Band transponders. The company also provides ground-based systems consisting of sub-systems for multi-object, tracking radar, coherent frequency generators, L-band modulators, 8x8 switchable routers for earth station, V/UHF T/R modules for ST radar, and Ka-band indoor/outdoor units; S-level (on-board) / flight model systems, which includes sub-systems for SAR payloads, geostationary satellites, and remote sensing satellites; water level measurement, agromet meteorological stations, automatic rain gauge, automatic weather stations, mini boundary layer masts, 50m tower masts, and agro met towers; and perimeter surveillance system and non-linear junction detector. In addition, it offers MMIC testing and assembly, and contract manufacturing services, as well as products for homeland security. It also exports its products. Astra Microwave Products Limited was incorporated in 1991 and is based in Hyderabad, India.",
    "website": "http://www.astramwp.com",
    "zipcode": "500084"
  },
  "BIRLACABLE.NS": {
    "city": "Rewa",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Communication Equipment",
    "long_name": "Birla Cable Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "BIRLA CABLE LTD",
    "state": null,
    "summary": "Birla Cable Limited manufactures and sells optical fiber cables, copper telecommunication cables, structured copper cables, specialty cables, and related accessories in India. The company provides fiber optical cables, including armored and unarmored, multi-tube ribbon type, di-electric rodent protected, di-electric self-supporting aerial, figure-8 type aerial, drop, central and multi tube micro, and interconnect cables. It also offers specialty cables, such as stainless steel wire armored tactical, fiber to antenna, coaxial, data communication, switchboard, drop, screened PCM, and CAT cables, as well as automobile wires. In addition, the company provides telecom fiber accessories comprising connectors, adapters, pigtails, patch cords, rackmounts, wall mounts, and cable accessories. It also exports its products. The company was formerly known as Birla Ericsson Optical Limited and changed its name to Birla Cable Limited in September 2016. The company was incorporated in 1992 and is based in Rewa, India.",
    "website": "http://www.birlacable.com",
    "zipcode": "486006"
  },
  "DLINKINDIA.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Communication Equipment",
    "long_name": "D-Link (India) Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "D-LINK (INDIA)LTD",
    "state": null,
    "summary": "D-Link (India) Limited markets and distributes D-Link branded networking products for consumers, small businesses, medium to large-sized enterprises, and service providers in India and internationally. The company offers home networking products, such as Wi-Fi systems, routers, range extenders, adapters, switches, DSL modems and routers, and mobile Wi-Fi hotspots; home cameras, CCTV solutions, smart plugs, and sensors; USB hubs; smart home eco systems; and cloud services. It also provides core and edge routers; chassis, cloud managed, unmanaged, smart managed, fully managed, and industrial switches, as well as switch accessories; and cameras, network video recorders, video management software, and related accessories. In addition, the company offers point-to-point/multipoint, software managed, and controller managed access points, as well as wireless controllers; VPN routers; copper, fiber, and structured cabling solutions; and optical transport network accessories and switches. Further, it provides nuclias cloud, a cloud based networking solution; nuclias connect, a network management solution; D-ViewCam, a video management software; and central Wi-Fi manager. The company was formerly known as Smartlink Network Systems Limited. D-Link (India) Limited was incorporated in 2008 and is headquartered in Mumbai, India. D-Link (India) Limited is a subsidiary of D-Link Holding Mauritius Inc.",
    "website": "http://in.dlink.com",
    "zipcode": "400059"
  },
  "GTLINFRA.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Communication Equipment",
    "long_name": "GTL Infrastructure Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "GTL INFRASTRUCTURE",
    "state": null,
    "summary": "GTL Infrastructure Limited, an independent and neutral telecom tower company, builds, owns, operates, and maintains shared passive telecom infrastructure sites. The company provides telecom towers on a shared basis to various telecom operators to host their active equipment; and delivers uninterrupted power on towers. It operates a portfolio of approximately 28,000 telecom towers across 22 telecom circles in India. The company was formerly known as GTL Infras Engineering & Managed Network Services Limited and changed its name to GTL Infrastructure Limited in February 2005. GTL Infrastructure Limited was founded in 2004 and is headquartered in Mumbai, India.",
    "website": "http://www.gtlinfra.com",
    "zipcode": "400001"
  },
  "HFCL.NS": {
    "city": "New Delhi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Communication Equipment",
    "long_name": "HFCL Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "HFCL LTD",
    "state": null,
    "summary": "HFCL Limited manufactures and sells telecom products in India and internationally. It offers a range of optical fiber cables for telecommunication, NLD, access, and FTT-x networks, as well as addresses applications through offerings, such as fire survival cables, tactical cables, etc. The company also provides microwave solutions, including packet microwave, hybrid microwave, and small cell radio solutions, as well as network management systems; and gigabit passive optical network system, which enables multi services access network for high bandwidth applications, such as video conferencing, remote education, tele-medicine, etc. In addition, it offers power electronic solutions, including AC and DC power, network integrated control and monitoring, integrated power racks, and network management systems for passive telecom infrastructure; and battery management systems, as well as renewable energy solutions using hybrid solar PV, wind, geothermal, and fuel cell energy sources. Further, the company provides telecom network solutions, including feasibility studies, choice of media survey, design, planning, engineering supply, laying of optical fiber cables, installation, integration, commissioning, and network operations and maintenance services. Additionally, it offers network design, equipment supply, installation and commissioning, network integration, and post deployment warranty and AMC support for metro lines and mainline railways, as well as dedicated railway freight corridors. The company also offers various solutions, including communication/IT/telecom infrastructure, data center, disaster recovery and management, security, surveillance, traffic management, and citizen/mobile applications, as well as power, water, waste, and other utility managements. The company was formerly known as Himachal Futuristic Communications Limited and changed its name to HFCL Limited in October 2019. HFCL Limited was founded in 1987 and is based in New Delhi, India.",
    "website": "http://www.hfcl.com",
    "zipcode": "110048"
  },
  "ITI.NS": {
    "city": "Bengaluru",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Communication Equipment",
    "long_name": "ITI Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "INDIAN TEL IND(ITI",
    "state": null,
    "summary": "ITI Limited engages in the manufacture, sale, and servicing of telecommunication equipment primarily in India. Its telecom products and solutions include switching, transmission, access, and subscriber premises equipment. The company also offers energy meters, mini personal computers, 3D printing products, bank automation products, gigabit passive optical network OLT and ONT products, PCM multiplexers, ruggedized telephones for defense forces, smart and banking cards, set top boxes, hand held terminals for smart card authentication, and Wi-Fi equipment. In addition, it provides encryption devices for defense, solar power modules, switched mode power supply systems, Internet of Things products, radio modems, and AN rack hardware products, as well as HDPE ducts, OFC cables, solar panels, smart energy meters, and payment cards. Further, the company trades in optical transport network products, such as DWDM; managed leased line network products; signaling point network products; IP/MPLS routers and switches; network management system solutions; microwave and satellite communication equipment; next generation network equipment; and information technology products and solutions. Additionally, it offers installation, commissioning, operation, and maintenance services; electronic contract manufacturing services; mechanical fabrication services; printed circuit board manufacturing services; data center hosting services; EMI/EMC and environmental testing of electronic products; three dimensional printing services; mechanical fabrication services; and component screening services. ITI Limited was founded in 1948 and is based in Bengaluru, India.",
    "website": "http://www.itiltd.in",
    "zipcode": "560016"
  },
  "KAVVERITEL.NS": {
    "city": "Bengaluru",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Communication Equipment",
    "long_name": "Kavveri Telecom Products Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "KAVVERI TELECOM PR",
    "state": null,
    "summary": "Kavveri Telecom Products Limited designs, develops, manufactures, and sells radio frequency (RF) products and antennas for telecom, defense, and space applications in India and internationally. The company provides base station, microwave, broadband in-building, and other customized design antennas; RF components, including co-location interference filters, duplexers, combiners, diplexers, and triplexers; and capacity enhancers consisting of tower mount amplifiers and boosters, and multi-carrier power amplifiers. It also offers coverage products, such as multi-band antennas, power splitters, couplers, and repeaters; coverage solutions, including neutral host BOL and repeater based solutions for home, office, hospital buildings, and shopping malls; and RF line products comprising feeder cables, connectors, jumper cables, lightning arrestors, feeder clamps, grounding kits, etc. In addition, the company provides defense and space products, such as MIL grade channelizers; coax and WG components; broadband transceivers, LNBs, and PAs; standard and wideband antennas; filters, duplexers, and diplexers; passive components; and NATO band high gain military antennas. Further, Kavveri Telecom Products Limited offers contract-manufacturing services. It provides solutions for telecom manufacturers, service providers, and users. The company was formerly known as Kaveri Telecoms Limited and changed its name to Kavveri Telecom Products Limited in August 2003. Kavveri Telecom Products Limited was founded in 1991 and is headquartered in Bengaluru, India.",
    "website": "http://www.kavveritelecoms.com",
    "zipcode": "560076"
  },
  "NELCO.NS": {
    "city": "Navi Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Communication Equipment",
    "long_name": "Nelco Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "NELCO",
    "state": null,
    "summary": "Nelco Limited provides systems and solutions in the areas of very small aperture terminals (VSAT) connectivity, and integrated security and surveillance. It offers VSAT satellite communication services for renewable energy, enterprise, oil, energy, and gas sectors, as well as to bank ATM and branches. The company is also involved in the design, supply, installation, and maintenance of integrated security and surveillance solutions for application in industrial plants, power stations, broadcasting stations, telecommunications stations, airports, railways, seaports, and borders. It serves businesses and government institutions. The company was founded in 1940 and is based in Navi Mumbai, India.",
    "website": "http://www.nelco.in",
    "zipcode": "400710"
  },
  "PANACHE.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Communication Equipment",
    "long_name": "Panache Digilife Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Panache Digilife Limited",
    "state": null,
    "summary": "Panache Digilife Limited manufactures, distributes, sells, and services information, communication and technology, and internet of thing devices in India and internationally. The company provides smart compute devices, such as squair, clair, flair AIO, air, desair, and desktop PCs, as well as laptops and NUCs; and POS terminals, thermal printers, cash drawers, and touch monitors, as well as consumer light-emitting diode televisions, commercial signage displays, and AV solutions. It also offers smart education solutions, such as OPS, IFPD, AI4YOUTH, and squair PCs for classroom learning and teaching; healthy living solutions, including Aquatatva that provides healthy water, and IoT ready smart metering solution to monitor water consumption patterns remotely; and electronic signature solutions, such as signature pads, pen displays, multi authentication devices, and pen tablets. In addition, the company provides queue management system, a branch of automation system that dynamically manages the customer queues in real time. The company was formerly known as Vardhaman Technology Limited and changed its name to Panache Digilife Limited in February 2017. Panache Digilife Limited was incorporated in 2007 and is based in Mumbai, India.",
    "website": "http://www.panachedigilife.com",
    "zipcode": "400086"
  },
  "PARACABLES.NS": {
    "city": "New Delhi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Communication Equipment",
    "long_name": "Paramount Communications Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "PARAMOUNT COMMUNIC",
    "state": null,
    "summary": "Paramount Communications Limited, together with its subsidiaries, manufactures and sells wire and cables to public and private sector organizations in India and internationally. The company provides power cables, including high tension and low tension power and aerial bunch cables; screened and unscreened type control cables; instrumentation cables for process control, A/D converters, and other microprocessor based instrumentation circuits; and thermocouple extension and compensating cables for connecting thermocouples to control and measurement devices. It also offers telecom cables comprising optical fiber, jelly filled, switched board, fiber to the home, and installation cables, as well as buried service and jumper wires. In addition, the company provides underground railway signaling and quad axle counter cables, and specialized instrumentation cables for underground and elevated metro projects; fire survival, XLPE, multicore round, solar, PTFE, and special cables; and building and PVC wires. Further, it offers turnkey services for construction, design, supply, engineering, and installation testing and commissioning. The company serves power, railways, telecom, IT and communications, construction, defense, space research, electronics, export, specialized EPC, renewable, and oil and gas sectors. Paramount Communications Limited was founded in 1955 and is based in New Delhi, India.",
    "website": "http://www.paramountcables.com",
    "zipcode": "110028"
  },
  "SHYAMTEL.NS": {
    "city": "New Delhi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Communication Equipment",
    "long_name": "Shyam Telecom Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "SHYAM TELECOM",
    "state": null,
    "summary": "Shyam Telecom Limited trades in telephone, mobile phone, and communication equipment and parts in India. It also distributes home appliances. The company was founded in 1976 and is based in New Delhi, India.",
    "website": "http://www.shyamtelecom.com",
    "zipcode": "110028"
  },
  "SMARTLINK.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Communication Equipment",
    "long_name": "Smartlink Holdings Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "SMARTLINK HOLDINGS",
    "state": null,
    "summary": "Smartlink Holdings Limited, together with its subsidiaries, develops, manufactures, markets, distributes, and services networking products in India. The company operates in two segments, Investment and Networking Products. It offers networking products, such as switches, broadband routers, wireless LANs, and GPON and GePON under the DIGISOL brand name. The company also develops and manufactures copper and fiber range of cabling products, which include cabling solutions, patch panels, patch cords, fiber cables and connectors, couplers, etc.; manufactures electronic products for the IT, networking, and telecom industries; and provides technical assistance center services. In addition, it offers real estate services. Smartlink Holdings Limited also exports its products to other countries internationally. The company was formerly known as Smartlink Network Systems Limited and changed its name to Smartlink Holdings Limited in April 2018. Smartlink Holdings Limited was founded in 1993 and is based in Mumbai, India.",
    "website": "http://www.smartlinkholdings.com",
    "zipcode": "400093"
  },
  "STLTECH.NS": {
    "city": "Pune",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Communication Equipment",
    "long_name": "Sterlite Technologies Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "STERLITE TECHNOLOGIES LTD",
    "state": null,
    "summary": "Sterlite Technologies Limited manufactures and sells telecom products and solutions in India and internationally. It offers fiber optical cables, optical fibers, and copper telecom cables; and fibre optical cable laying services. The company also designs and deploys high-capacity converged fibre, cable, and wireless networks; and designs, builds, and manages cloud-native software-defined networks. In addition, it exports its products and services. The company was formerly known as Sterlite Optical Technologies Limited and changed its name to Sterlite Technologies Limited in 2007. Sterlite Technologies Limited was founded in 1988 and is based in Pune, India. Sterlite Technologies Limited is a subsidiary of Twin Star Overseas Limited.",
    "website": "http://www.stl.tech",
    "zipcode": "411001"
  },
  "TEJASNET.NS": {
    "city": "Bengaluru",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Communication Equipment",
    "long_name": "Tejas Networks Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "TEJAS NETWORKS LTD",
    "state": null,
    "summary": "Tejas Networks Limited designs, develops, and sells optical and data networking products to telecommunications service providers, internet service providers, web-scale internet companies, utility companies, defense companies, and government entities in India, the Americas, and internationally. The company offers converged packet optical products, including TJ1400, an ultra-converged broadband designed for cost-optimized delivery of mobile backhaul, broadband access, enterprise, and network modernization; and TJ1600, an optical product that balances packet and circuit transport. It also provides enterprise Ethernet switches, such as TJ1400P-M4 series of switches designed for data center and cloud deployments; TJ1400P M3 and TJ1400P M2 switching products optimized for LAN and metro applications; and TJ1400P-M1 portfolio of Layer2+ switches for enterprise, campus, and industrial networks. In addition, the company offers TJ1600, a high-density metro core platform comprising TDM, OTN, carrier Ethernet, and DWDM technologies; and TJ1270, an ultra-compact and dense customer premise bandwidth provisioning equipment designed to scale from STM-1 to STM-16 capacity to accommodate surging bandwidth demands in the access. Further, it provides TJ1602W, a LTE Macro eNodeB solution on the TJ1600-2 platform; TJ6003W, a LTE packet core EPC solution; TJ1400, a series of aggregation and core service routers; TJ1270 MSPP, a multi-service provisioning platform; TJ5500 Network Management System, an integrated management application; and TJ1400 OLT, a series of advanced GPON elements designed for optical access networks deployed fibre-to-the-home and fibre-to-the-building formats. The company was formerly known as Tejas Networks India Limited and changed its name to Tejas Networks Limited in March 2008. Tejas Networks Limited was incorporated in 2000 and is headquartered in Bengaluru, India.",
    "website": "http://www.tejasnetworks.com",
    "zipcode": "560100"
  },
  "TNTELE.NS": {
    "city": "Maraimalai Nagar",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Communication Equipment",
    "long_name": "Tamilnadu Telecommunications Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "TAMILNADU TELECOMM",
    "state": null,
    "summary": "Tamilnadu Telecommunications Limited manufactures and sells optical fiber cables for telecommunications in India. Its products include nylon jacketed metal-free optical fiber cables for use in saline atmosphere in coastal areas; armored optical fiber cables for direct burial application; self-supporting aerial optical fiber cables; composite cables; and ribbon cables. The company was founded in 1988 and is based in Maraimalai Nagar, India.",
    "website": "http://www.ttlofc.in",
    "zipcode": "603209"
  }
}
