{
    "CEREBRAINT.NS": {
        "short_name": "CEREBRA INTEGRATED",
        "long_name": "Cerebra Integrated Technologies Limited",
        "summary": "Cerebra Integrated Technologies Limited engages in the trading of refurbished computer products and accessories in India and internationally. It offers personal computers, servers, laptops, and workstations. The company also provides electronics manufacturing services for motherboards, memory modules, graphic cards, and networking products; and designs, plans, and implements IT hardware and software infrastructure, such as security, networking, server, storage, endpoint, operating system, and application software products. In addition, the company offers infrastructure management solutions, including IT asset management that consists of software and hardware asset management; and remote infrastructure monitoring services comprising server management and monitoring, network management and monitoring, network performance management, desktop and devices management, asset tracking and inventory management, operating system management, workstations, security management, and helpdesk services. Further, it provides e-waste recycling services, consisting of repair, refurbishment, and reuse services for electronic and electrical equipment; integrated EHS system; salvaging services for components; web-based trading services; e-waste management and base-metal recycling; logistics and warehousing facilities; waste management at source; training services; support services for scrap handling, collection, transport, documentation, shipping, and other related areas; market support services; and security systems, as well as data destruction services. Additionally, the company offers IT training and consulting services; and IT solutions, such as LPO, BPO and KPO services. Cerebra Integrated Technologies Limited was founded in 1992 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560058",
        "website": "http://www.cerebracomputers.com",
        "market_cap": 7566464000
    },
    "TVSELECT.NS": {
        "short_name": "TVS ELECTRONICS",
        "long_name": "TVS Electronics Limited",
        "summary": "TVS Electronics Limited, through its subsidiaries, designs, manufactures, assembles, markets, sells, and services various transaction automation products in India and internationally. The company operates through Products & Solutions, Customer Support Services, and Fulfillment & Distribution Services segments. Its products include dot matrix printers, mechanical keyboards, thermal printers, label printers, barcode scanners, electronic cash registers, membrane keyboards, mouse products, and currency counting machines. The company also provides repair engineering, installation and demo, remote tech support, call center, and parts management services. It serves governance and back office, oil, mining, manufacturing, BFSI, food and beverage, retail, hospitality, and ticketing industries. The company was founded in 1986 and is headquartered in Chennai, India. TVS Electronics Limited is a subsidiary of TVS Investments Private Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600020",
        "website": "http://www.tvs-e.in",
        "market_cap": 3086008576
    }
}