{
    "AVADHSUGAR.NS": {
        "short_name": "AVADH SUGAR ENERGY",
        "long_name": "Avadh Sugar & Energy Limited",
        "summary": "Avadh Sugar & Energy Limited manufactures and sells sugar, molasses, bagasse, and press-mud in India. It operates through Sugar, Distillery, Co-generation, and Others segments. The company also manufactures and sells industrial spirits, such as ethanol, as well as fusel oil and bio-compost; and generates and transmits power. In addition, it trades in petroleum products. Avadh Sugar & Energy Limited was incorporated in 2015 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700001",
        "website": "http://www.birla-sugar.com/Our-Companies/About-Us-Avadh",
        "market_cap": "Mid Cap"
    },
    "BAJAJHIND.NS": {
        "short_name": "BAJAJ HINDUSTHAN S",
        "long_name": "Bajaj Hindusthan Sugar Limited",
        "summary": "Bajaj Hindusthan Sugar Limited, together with its subsidiaries, manufactures and sells sugar and ethanol in India. The company operates through Sugar, Distillery, and Power segments. It offers sugar by-products, such as bagasse, molasses, fly ash, and press mud; and bio-compost/bio-manure. The company also generates and sells bagasse-based power to the Uttar Pradesh state grid. It serves customers in alcohol-based chemical plants and oil companies. The company was formerly known as Bajaj Hindusthan Limited and changed its name to Bajaj Hindusthan Sugar Limited in January 2015. Bajaj Hindusthan Sugar Limited was incorporated in 1931 and is based in Noida, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201301",
        "website": "http://www.bajajhindusthan.com",
        "market_cap": "Large Cap"
    },
    "BALRAMCHIN.NS": {
        "short_name": "BALRAMPUR CHINI MI",
        "long_name": "Balrampur Chini Mills Limited",
        "summary": "Balrampur Chini Mills Limited, an integrated sugar manufacturing company, manufactures and sells sugar from sugarcane in India. The company operates through three segments: Sugar, Co-generation, and Distillery. It also offers molasses, pressmud, industrial alcohol, ethanol, and bagasse; and manufactures and sells agricultural fertilizers, such as soil conditioner, granulated potash, etc. In addition, the company is involved in the generation and sale of electricity. Balrampur Chini Mills Limited was founded in 1975 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700020",
        "website": "http://www.chini.com",
        "market_cap": "Large Cap"
    },
    "BANARISUG.NS": {
        "short_name": "BANNARI AMMAN SUG",
        "long_name": "Bannari Amman Sugars Limited",
        "summary": "Bannari Amman Sugars Limited primarily produces and sells sugar in India. It operates through Sugar, Power, Distillery, and Granite Products segments. The company manufactures and sells cane crush; industrial alcohol and extra neutral spirits; and granite blocks, and polished granite slabs and tiles. It also generates power through co-generation power plants and wind mills. The company was incorporated in 1983 and is based in Coimbatore, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Coimbatore",
        "zipcode": "641018",
        "website": "http://www.bannari.com",
        "market_cap": "Large Cap"
    },
    "DALMIASUG.NS": {
        "short_name": "DALMIA BHARAT SUGA",
        "long_name": "Dalmia Bharat Sugar and Industries Limited",
        "summary": "Dalmia Bharat Sugar and Industries Limited engages in the sugar business in India and internationally. It operates through Own Manufactured Sugar, Power, Distillery, and Others segments. The company manufactures and sells sugar to institutional buyers; and by-products, such as bagasse and molasses to generate power. It also produces and sells alcohol, including rectified spirits, extra neutral alcohol, denatured spirits, and ethanol or power alcohol. In addition, the company generates and sells bagasse-based power through integrated plants with a capacity of 102 MW. Further, it engages in the magnesite, travel, and electronics businesses; and production and sale of organic manure to farmers and tea estates. The company was incorporated in 1951 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.dalmiasugar.com",
        "market_cap": "Large Cap"
    },
    "DHAMPURSUG.NS": {
        "short_name": "DHAMPUR SUGAR MILL",
        "long_name": "Dhampur Sugar Mills Limited",
        "summary": "Dhampur Sugar Mills Limited, together with its subsidiaries, operates as an integrated sugarcane processing company in India. The company operates through three segments: Sugar, Chemicals/Distillery, and Power. It manufactures and sells refined, white, retail, and raw sugar; ethanol, rectified spirit ethyl acetate, extra neutral alcohol, ethyl acetate, and other allied products; industrial gases; and bio-fertilizers. The company also generates power using bagasse. It operates cogeneration facilities with a total installed capacity of approximately 220.5 megawatts. The company was founded in 1933 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110020",
        "website": "http://www.dhampur.com",
        "market_cap": "Large Cap"
    },
    "DHARSUGAR.NS": {
        "short_name": "DHARANI SUGAR & CH",
        "long_name": "Dharani Sugars and Chemicals Limited",
        "summary": "Dharani Sugars and Chemicals Limited engages in the manufacture and sale of white sugar in India. It is also involved in the generation of electricity; and production of industrial alcohol, including ethanol. In addition, it produces molasses and other by products. The company was founded in 1987 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600034",
        "website": "http://www.dharanisugars.in",
        "market_cap": "Small Cap"
    },
    "DWARKESH.NS": {
        "short_name": "DWARIKESH SUGAR IN",
        "long_name": "Dwarikesh Sugar Industries Limited",
        "summary": "Dwarikesh Sugar Industries Limited, an integrated conglomerate, manufactures and sells sugar and allied products in India and internationally. It is also involved in the co-generation of power, and manufacture of industrial alcohol and ethanol. The company was formerly known as Dwarka Sugar Limited and changed its name to Dwarikesh Sugar Industries Limited in 1994. Dwarikesh Sugar Industries Limited was founded in 1993 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.dwarikesh.com",
        "market_cap": "Large Cap"
    },
    "EIDPARRY.NS": {
        "short_name": "E.I.D.-PARRY(INDIA",
        "long_name": "E.I.D.- Parry (India) Limited",
        "summary": "E.I.D.- Parry (India) Limited manufactures and sells sugar, biopesticides, and nutraceuticals in India, North America, Europe, and internationally. It operates through Sugar, Cogeneration, Distillery, and Nutraceuticals segments. The company offers sugar for use in food, bakery, confectioneries, beverage, and pharmaceutical industries. It also produces ethanol, as well as alcohol from molasses; and co-generates power from bagasse with a capacity of 160 megawatts. In addition, the company provides Azadirachtin based bio-pesticides. Further, it manufactures a range of nutraceuticals based on micro algae technology comprising organic spirulina, organic chlorella, beta carotene from dunaliella salina, astaxanthin form haematococcus pluvialis, and algae omega-3 complex. E.I.D.- Parry (India) Limited was founded in 1788 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600001",
        "website": "http://www.eidparry.com",
        "market_cap": "Large Cap"
    },
    "KCPSUGIND.NS": {
        "short_name": "KCP SUGAR & INDUST",
        "long_name": "K.C.P. Sugar and Industries Corporation Limited",
        "summary": "K.C.P. Sugar and Industries Corporation Limited, together with its subsidiaries, manufactures and sells sugar and allied products in India and internationally. It also provides bio fertilizers; chemicals comprising industrial alcohol, carbon dioxide, and calcium lactate, as well as organic manure and mycorrhiza vam products; and rectified spirit, extra neutral alcohol, and ethanol. In addition, the company manufactures liquidÂ\u0096solid separation equipment for industrial and environmental applications; and offers research services related to agriculture. Further, it operates cogeneration plants in Vuyyuru and Lakshmipuram, Krishna District, Andhra Pradesh. K.C.P. Sugar and Industries Corporation Limited was incorporated in 1995 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600006",
        "website": "http://www.kcpsugar.com",
        "market_cap": "Mid Cap"
    },
    "KMSUGAR.NS": {
        "short_name": "KM SUGAR MILLS LTD",
        "long_name": "K.M. Sugar Mills Limited",
        "summary": "K.M. Sugar Mills Limited manufactures and trades in sugar and industrial alcohol in India. The company operates through three segments: Sugar, Distillery, and Power Generation. It produces and sells various grades of sugar in jute bags and PP bags; rectified spirit, ethanol, and extra neutral alcohol; and bio fertilizers under the name Moti Super. The company also generates and supplies power through its bagasse based co-generation power plant with a capacity of 25 MW located in Motinagar, Faizabad, as well as supplies country liquor in pet bottles. K.M. Sugar Mills Limited was founded in 1942 and is based in Lucknow, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Lucknow",
        "zipcode": "226010",
        "website": "http://www.kmsugar.com",
        "market_cap": "Mid Cap"
    },
    "KOTARISUG.NS": {
        "short_name": "KOTHARI SUGAR&CHEM",
        "long_name": "Kothari Sugars and Chemicals Limited",
        "summary": "Kothari Sugars and Chemicals Limited manufactures and sells sugar and its by-products in India and rest of Asia. The company operates in the Sugar, Cogeneration, and Distillery segments. It also engages in the co-generation of power from bagasse and coal; production of industrial alcohol from molasses; and bio-compost from press mud and distillery effluents. In addition, the company provides liquid hand sanitizers; polyisobutylene products; and packaged drinking water, as well as rents safe deposit lockers. The company was incorporated in 1960 and is headquartered in Chennai, India. Kothari Sugars and Chemicals Limited is a subsidiary of Parvathi Trading & Finance Co. Pvt. Ltd.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600034",
        "website": "http://www.hckotharigroup.com/kscl",
        "market_cap": "Mid Cap"
    },
    "MAGADSUGAR.NS": {
        "short_name": "MAGADH SUGAR & ENE",
        "long_name": "Magadh Sugar & Energy Limited",
        "summary": "Magadh Sugar & Energy Limited manufactures and sells of sugar, molasses, and bagasse in India. The company operates through three segments: Sugar, Distillery, and Co-Generation. It also manufactures and sells industrial spirits, including ethanol, as well as fusel oil and bio-compost products; and generates and transmits power. The company was incorporated in 2015 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700001",
        "website": "http://www.birla-sugar.com/Our-Companies/About-Us-MAGADH-SUGAR-AND-ENERGY-LIMITED",
        "market_cap": "Mid Cap"
    },
    "MAWANASUG.NS": {
        "short_name": "MAWANA SUGARS LTD",
        "long_name": "Mawana Sugars Limited",
        "summary": "Mawana Sugars Limited manufactures and markets sugar under the Mawana brand in India. The company operates through Sugar, Power, Chemicals, and Distillery segments. It produces plantation white, refined, and specialty sugars, as well as IP grade sugar for pharmaceutical use. The company also offers chemical products, such as caustic soda, chlorine, stable bleaching powder, hydrogen, and hydrochloric acid. In addition, it is involved in the cogeneration of power from bagasse; and manufacture and sale of anhydrous and hydrous ethanol, including rectified spirit, denatured spirit, fuel ethanol, organic manure, and fusel oil to oil marketing companies. The company was formerly known as Siel Limited and changed its name to Mawana Sugars Limited in January 2008. Mawana Sugars Limited was incorporated in 1961 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122001",
        "website": "http://www.mawanasugars.com",
        "market_cap": "Mid Cap"
    },
    "PONNIERODE.NS": {
        "short_name": "PONNI SUGARS ERODE",
        "long_name": "Ponni Sugars (Erode) Limited",
        "summary": "Ponni Sugars (Erode) Limited manufactures sugar and its by-products in India. It operates in two segments, Sugar and Cogeneration. The company also engages in the cogeneration of power. Ponni Sugars (Erode) Limited also exports its products. The company was formerly known as SPB Sugars and Chemicals Limited and changed its name to Ponni Sugars (Erode) Limited in January 2000. Ponni Sugars (Erode) Limited was incorporated in 1996 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600096",
        "website": "http://www.ponnisugars.com",
        "market_cap": "Small Cap"
    },
    "RAJSREESUG.NS": {
        "short_name": "RAJSHREE SUG &CHEM",
        "long_name": "Rajshree Sugars and Chemicals Limited",
        "summary": "Rajshree Sugars and Chemicals Limited engages in the sugar, power, distillery, and biotechnology businesses in India. It provides white crystal sugar, demerara sugar, white sugar sachets, and demerara sugar sachets. The company also offers distillery products, such as rectified spirit, anhydrous alcohol, and extra neutral alcohol; and organic manure. In addition, it generates power through cogeneration plants. The company was incorporated in 1985 and is based in Coimbatore, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Coimbatore",
        "zipcode": "641004",
        "website": "http://www.rajshreesugars.com",
        "market_cap": "Small Cap"
    },
    "RANASUG.NS": {
        "short_name": "RANA SUGARS LTD",
        "long_name": "Rana Sugars Limited",
        "summary": "Rana Sugars Limited manufactures and sells sugar, molasses, and bagasse in India. It operates through three segments: Sugar Manufacturing, Ethanol Manufacturing, and Power Generation. The company offers double refined white sulphurless, plantation white, and raw sugar, as well as sugar from sugar beet. It also produces power from bagasse; manufactures various grades of alcohol, such as rectified spirit and potable grade extra neutral alcohol, as well as liquor; and offers sugar beet pulp as cattle feed. The company was incorporated in 1991 and is headquartered in Chandigarh, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chandigarh",
        "zipcode": "160009",
        "website": "http://www.ranagroup.com",
        "market_cap": "Mid Cap"
    },
    "RENUKA.NS": {
        "short_name": "SHREE RENUKA SUGAR",
        "long_name": "Shree Renuka Sugars Limited",
        "summary": "Shree Renuka Sugars Limited manufactures and refines sugar in India and internationally. The company provides white/refined sugar, as well as by-products, including molasses, bagasse, press mud, and organic manure; and ethyl alcohol from molasses and fuel grade ethanol from sugarcane juice. It also produces power from bagasse, a sugarcane byproduct for state grids. The company was founded in 1995 and is headquartered in Belgaum, India. Shree Renuka Sugars Limited is a subsidiary of Wilmar Sugar Holdings Pte. Ltd.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Belgaum",
        "zipcode": "590010",
        "website": "http://www.renukasugars.com",
        "market_cap": "Large Cap"
    },
    "SAKHTISUG.NS": {
        "short_name": "SAKTHI SUGAR",
        "long_name": "Sakthi Sugars Limited",
        "summary": "Sakthi Sugars Limited manufactures and sells sugar in India, Korea, Malaysia, the Philippines, and Vietnam. It operates through Sugar, Industrial Alcohol, Soya Products, and Power segments. The company offers white and refined sugar; industrial alcohol, including rectified spirit, extra neutral alcohol/neutral spirit, and ethanol manufactured from molasses; sugar by-products, such as molasses, bagasse, and press mud; bio earth products for use as an organic fertilizer and soil improver; and soya products. It also operates three cogeneration power plants with a power generation capacity of 92 megawatts. The company was founded in 1961 and is headquartered in Coimbatore, India. Sakthi Sugars Limited is a subsidiary of ABT Investments (India) Private Limited.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Coimbatore",
        "zipcode": "641018",
        "website": "http://www.sakthisugars.com",
        "market_cap": "Small Cap"
    },
    "SIMBHALS.NS": {
        "short_name": "SIMBHAOLI SUGARS L",
        "long_name": "Simbhaoli Sugars Limited",
        "summary": "Simbhaoli Sugars Limited primarily manufactures and sells sugar in India and internationally. The company operates through Sugar and Alcohol segments. It offers double refined white crystal, white, icing, and diamond shaped crystal sugar, as well as sugar sachets and cubes under the TRUST brand name; brown mineral, coffee, jaggery, and jaggery powder under the Sunehra brand name; and lower glycemic index sugar under the G-Low brand. The company also provides instant fruit drink mixes and coconut water under the SIPP brand; hand sanitizers and multi surface disinfectants under the TRUST brand; and organic bio-manures, bio-compost, plant nutrients, plant growth regulators, and herbicides under the SOM brand name. In addition, it offers logistics and transport services; agriculture advisory services; and technology and engineering consulting services, as well as produces ethanol. Further, the company is involved in the biomass-based co-generation with a generation capacity of approximately 100 MWH. Simbhaoli Sugars Limited was founded in 1933 and is based in Noida, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201307",
        "website": "http://www.simbhaolisugars.com",
        "market_cap": "Small Cap"
    },
    "THIRUSUGAR.NS": {
        "short_name": "THIRU AROORAN SUGARS LTD",
        "long_name": "Thiru Arooran Sugars Limited",
        "summary": "Thiru Arooran Sugars Limited, together with its subsidiary, manufactures and sells sugar and potable/industrial alcohol in India. The company also offers by-products, including bagasse, molasses, and pressmud. In addition, it provides rectified spirits (RS); extra neutral alcohol (ENA) for bottling units to produce IMFL; and ethanol. Further, the company offers impure materials removed during the production of RS and ENA to the producers of chemicals, such as acetaldehyde, acetic acid, acetic anhydride, ethyl acetate, etc. It also exports its products. Additionally, the company operates two cogeneration power plants. Thiru Arooran Sugars Limited was incorporated in 1954 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600034",
        "website": "http://www.tasugars.in",
        "market_cap": "Small Cap"
    },
    "TRIVENI.NS": {
        "short_name": "TRIVENI ENGINEERIN",
        "long_name": "Triveni Engineering & Industries Limited",
        "summary": "Triveni Engineering & Industries Limited engages in the sugar and engineering businesses in India and internationally. The company manufactures and sells white crystal sugar for multinational beverage, food, and fast moving consumer goods (FMCG) companies; pharmaceutical companies; and confectionery producers, as well as offers sugar under the Shagun brand. It also sells surplus molasses and bagasse produced as a by-product in the manufacture of sugar; produces ethanol, extra neutral alcohol, rectified spirit, and denatured spirit; and operates 104.5 MW grid connected co-generation capacity. In addition, the company manufactures and sells high-speed gears and gearboxes for gas and steam turbines, water turbines, compressors, pumps, blowers, and test rigs; and low-speed gearboxes for hydro turbines, reciprocating pumps and compressors, mills and extruder drives for metal, sugar, rubber and plastic industries, and marine applications. Further, it provides services and solutions, such as emergency breakdown support comprising rush delivery of parts, diagnostics and troubleshooting support, reverse engineering, and dimensioning expertise at site or in-house; refurbishment solutions; health monitoring and maintenance of inventory of dimension-ready sites for immediate solutions; and drop in replacements of gearboxes and gear internals, replacements/development of spare white metal bearings, etc. Additionally, the company offers engineered to order process equipment and solutions in the water and wastewater management, as well as recycles water; trades in various FMCG; retails diesel/petrol; and produces hand sanitizers. It also develops and manufactures propulsion gearboxes, auxiliary power gas turbines generators, steam turbines and turbo auxiliaries, water jets and its components, turbo and motor driven pumps, and fin stabilizers for the Indian defense forces; and steering systems/stabilizers. The company was incorporated in 1932 and is headquartered in Noida, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201301",
        "website": "http://www.trivenigroup.com",
        "market_cap": "Large Cap"
    },
    "UGARSUGAR.NS": {
        "short_name": "UGAR SUGAR WORKS",
        "long_name": "The Ugar Sugar Works Limited",
        "summary": "The Ugar Sugar Works Limited manufactures and sells sugar, and industrial and potable alcohol primarily in India. The company offers white crystal sugar and its byproducts, including bagasse, filter cake, and final molasses. It also provides various distillery products, such as Indian made liquor products under the Old Castle Premium Whisky, U.S. Whisky, U.S. Brandy, U.S. Gin, Ugar XXX Rum, Gokak Falls Whisky, Milan Whisky, Hawk Gin, and Gagarin Vodka brands; ethanol; rectified spirit; malt spirit; and extra neutral alcohol. In addition, the company offers distillery byproducts comprising fermentation sludge, which is used in poultry feeds; fusel oil that is used in amyl alcohols/perfumes; and carbon dioxide for industrial purpose, as well as low grade potash, which is used in crops primarily sugarcane crop. Further, it operates a 44 megawatt bagasse based cogeneration power plant and distributes electricity; and provides confectionery products. The company also exports its products. The Ugar Sugar Works Limited was founded in 1939 and is based in Belgaum, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Belgaum",
        "zipcode": "591316",
        "website": "http://web.ugarsugar.com",
        "market_cap": "Mid Cap"
    },
    "UTTAMSUGAR.NS": {
        "short_name": "UTTAM SUGAR MILLS",
        "long_name": "Uttam Sugar Mills Limited",
        "summary": "Uttam Sugar Mills Limited, together with its subsidiaries, manufactures and sells sugar products under the Uttam brand name in India. It operates through Sugar, Cogeneration, and Distillery segments. The company also produces industrial alcohol; and engages in the power generation business. It serves pharma, food and beverages, bakery, distillery, honey replacement, and tobacco industries. The company was formerly known as Associated Sugar Mills Limited and changed its name to Uttam Sugar Mills Limited in November 1998. Uttam Sugar Mills Limited was incorporated in 1960 and is based in Noida, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201301",
        "website": "http://www.uttamsugar.in",
        "market_cap": "Mid Cap"
    },
    "VISHWARAJ.NS": {
        "short_name": "Vishwaraj Sugar Ind Ltd",
        "long_name": "Vishwaraj Sugar Industries Limited",
        "summary": "Vishwaraj Sugar Industries Limited manufactures and sells sugar and other related products in India. The company operates through five segments: Sugar, Co-Generation, Distillery, Indian Made Liquor, and Vinegar. It also produces distillery products, including ethanol, and rectified and extra-neutral spirits; and bagasse, molasses, brewed vinegar, compost, press-mud, carbon dioxide, etc., as well as blends and bottles Indian made liquor. In addition, the company is involved in the co-generation of electricity with an installed capacity of 36.4 MW. It sells its whiskey products under the Our Choice, Your Choice, District-1, and VSL Black brand names. The company was formerly known as Vishwanath Sugar and Steel Industries Limited and changed its name to Vishwaraj Sugar Industries Limited in December 2012. Vishwaraj Sugar Industries Limited was incorporated in 1995 and is based in Belgaum, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Belgaum",
        "zipcode": "591305",
        "website": "http://www.vsil.co.in",
        "market_cap": "Mid Cap"
    }
}