{
    "AMBER.NS": {
        "short_name": "AMBER ENTERPRISES",
        "long_name": "Amber Enterprises India Limited",
        "summary": "Amber Enterprises India Limited provides solutions to air conditioner OEM/ODM industries in India. It designs and manufactures a range of room air conditioners (RACs), including window air conditioners, indoor units, and outdoor units of split air conditioners; and inverter RACs. The company also offers functional components of RACs, such as heat exchangers, motors, and multi-flow condensers and invertor printed circuit boards; and other RAC components comprising sheet metal components, copper tubing, plastic extrusion, vacuum forming, and injection molding components. In addition, it manufactures components for other consumer durables and automobiles, such as case liners for refrigerators; plastic extrusion sheets for consumer durables and automobile industry; sheet metal components for microwave; and washing machine tub assemblies, as well as products for automobiles and metal ceiling industries. Further, the company provides mobile air conditioners for railway, metro, bus, and defense and telecommunication industries. The company also exports its products. Amber Enterprises India Limited was incorporated in 1990 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122018",
        "website": "http://www.ambergroupindia.com",
        "market_cap": "Small Cap"
    },
    "BPL.NS": {
        "short_name": "BPL",
        "long_name": "BPL Limited",
        "summary": "BPL Limited manufactures and sells electronic products primarily in India. It offers televisions, washing machines, refrigerators, microwave ovens, air conditioners, dish washers, and soundbars, as well as printed circuit boards. The company provides its products under the BPL brand name. BPL Limited was founded in 1963 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560001",
        "website": "http://www.bpl.in",
        "market_cap": "Small Cap"
    },
    "DIXON.NS": {
        "short_name": "DIXON TECHNOLOGIES",
        "long_name": "Dixon Technologies (India) Limited",
        "summary": "Dixon Technologies (India) Limited operates in the electronic manufacturing services space in India. The company offers consumer electronics, including LED TVs; home appliances, such as washing machines; lighting products comprising LED bulbs, battens, indoor and outdoor LED drivers, electronics lamp drivers, and down lighters; mobile phones; and security surveillance systems. It also provides solutions in reverse logistics, such as repair and refurbishment services of set top boxes, LED TVs, mobile phones, CCTVs, modems, and computer peripherals; medical electronics; and set top boxes. The company was incorporated in 1993 and is headquartered in Noida, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201305",
        "website": "http://www.dixoninfo.com",
        "market_cap": "Mid Cap"
    },
    "IFBIND.NS": {
        "short_name": "IFB INDUSTRIES LTD",
        "long_name": "IFB Industries Limited",
        "summary": "IFB Industries Limited, together with its subsidiaries, manufactures and trades in home appliances primarily in India. It offers domestic washing machines, microwave ovens, domestic and industrial dishwashers, clothes dryers, and modular kitchens; kitchen appliances, such as hobs, chimneys, and built-in ovens; air conditioners; and industrial washing systems, including dry cleaning and other finishing equipment. The company also provides a range of parts and accessories for motor vehicles, etc.; and fine blanked components and cold rolled steel sheets, as well as tools and related machine tools, such as straighteners, decoilers, strip loaders, and others. In addition, it exports its products. The company was formerly known as Indian Fine Blanks Limited. IFB Industries Limited was founded in 1974 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700107",
        "website": "http://www.ifbindustries.com",
        "market_cap": "Small Cap"
    },
    "JCHAC.NS": {
        "short_name": "JOHNSON CONTROLS-H",
        "long_name": "Johnson Controls-Hitachi Air Conditioning India Limited",
        "summary": "Johnson Controls-Hitachi Air Conditioning India Limited manufactures and trades in various window and split air conditioners, chillers, refrigerators, air purifiers, and variable refrigerant flow systems in India. It offers inverter and fixed speed split, packaged, and window air conditioners; ducted and ductless air conditioners; water and air cooled screw chillers, and centrifugal chillers; space makers; and side by side and slim line refrigerators. The company also provides accessories and spare parts for its products, as well as undertakes after sales services, including repair and maintenance. It offers its products under the Hitachi brand. The company's distribution network consists of 5 regional offices, 21 branch offices, and approximately 10,000 sales points and 1,400 after sales service providing partners. It also exports its products to Nepal, Bhutan, Sri Lanka, Maldives, Indonesia, Vietnam, the United Arab Emirates, Qatar, Oman, Bahrain, Iraq, Kuwait, and Saudi Arabia. The company was formerly known as Hitachi Home & Life Solutions (India) Limited and changed its name to Johnson Controls-Hitachi Air Conditioning India Limited in September 2016. The company was founded in 1984 and is headquartered in Kadi, India. Johnson Controls-Hitachi Air Conditioning India Limited is a subsidiary of JCHAC India Holdco Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kadi",
        "zipcode": "382727",
        "website": "http://www.hitachiaircon.in",
        "market_cap": "Small Cap"
    },
    "VISESHINFO.NS": {
        "short_name": "VISESH INFOTECNICS",
        "long_name": "MPS Infotecnics Limited",
        "summary": "MPS Infotecnics Limited provides information technology (IT) solutions to organizations worldwide. The company operates through three segments: Telecommunication, IT Solutions & Products, and IT Enabled Services. It provides BusinesSoft, a solution for service, pharmaceutical, manufacturing, chemical, and trading companies; BusinessPro, which automates the functions of an organization and deploys enterprise wide applications; and domain name registration and Web hosting services in cloud infrastructure. The company also offers system integration and networking solutions, enterprise software, value added services and IT enabled services, e-business applications, and election cards printing services. In addition, it supplies servers, desktop and notebook computers, peripherals, and power correction equipment; data communication equipment, such as routers, switches, and remote access servers; structured cabling systems; and wireless connectivity products, as well as provides maintenance support services. Further, the company offers networking services, including network planning and designing, hardware and software procurement, network installation, user personnel training, and long-term support, as well as biometrics services. Additionally, it exports mobile phones to Taiwan and Hong Kong. MPS Infotecnics Limited serves customers operating in the government, telecom, manufacturing, MNC and overseas, financial, IT, transport and tourism, and other sectors. The company was formerly known as Visesh Infotecnics Limited and changed its name to MPS Infotecnics Limited in January 2016. MPS Infotecnics Limited was founded in 1989 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.mpsinfotec.com",
        "market_cap": "Small Cap"
    },
    "WHIRLPOOL.NS": {
        "short_name": "WHIRLPOOL OF INDIA",
        "long_name": "Whirlpool of India Limited",
        "summary": "Whirlpool of India Limited manufactures and trades in home appliances under the Whirlpool brand in India and internationally. The company primarily offers refrigerators, washing machines, air conditioners, microwave ovens, and small appliances, as well as air and water purifiers. It also provides built-in appliances, including built-in ovens, coffee machines, microwave ovens, cooker hoods, hobs, dishwashers, wine coolers, and washers and dryers, as well as commercial appliances and accessories. It also exports its products to Afghanistan, China, and Sri Lanka. The company was incorporated in 1960 and is headquartered in Gurugram, India. Whirlpool of India Limited is a subsidiary of Whirlpool Mauritius Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122002",
        "website": "http://www.whirlpoolindia.com",
        "market_cap": "Mid Cap"
    }
}