{
    "BHAGYANGR.NS": {
        "short_name": "BHAGYANAGAR INDIA",
        "long_name": "Bhagyanagar India Limited",
        "summary": "Bhagyanagar India Limited manufactures copper products in India. It operates through Manufacturing of Copper Products and Wind Power segments. The company offers copper bus bars, wires and rods, foils and sheets, paper covered strips, nuggets, and tubes and pipes, as well paper insulated copper conductors. It also provides solar flat plate collectors, commutators, solar fins, field coils and armature pins, submersible wires, and heating elements/thermostats/immersion heaters. The company primarily serves original equipment manufacturers in the auto and electrical component, solar, and electrical engineering industries. In addition, it operates a wind power project with an installed capacity of 9 megawatts at Kapatigudda, Karnataka. Bhagyanagar India Limited was founded in 1985 and is based in Secunderabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Secunderabad",
        "zipcode": "500003",
        "website": "http://www.bhagyanagarindia.com",
        "market_cap": "Small Cap"
    },
    "CUBEXTUB.NS": {
        "short_name": "CUBEX TUBINGS",
        "long_name": "Cubex Tubings Limited",
        "summary": "Cubex Tubings Limited produces and sells copper and copper based alloy products in India and internationally. It offers seamless solid drawn tubes, rods, bus bars, and wires of copper and copper based alloys, such as cupronickel, admiralty and aluminum brass, etc. The company serves power plants, power plants manufacturers, switchgears, refineries, furnace manufacturers, sugar plants, automobiles, and electrical equipment and ship building industries. Cubex Tubings Limited was incorporated in 1979 and is based in Secunderabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Secunderabad",
        "zipcode": "500003",
        "website": "http://www.cubextubings.com",
        "market_cap": "Small Cap"
    },
    "HINDCOPPER.NS": {
        "short_name": "HINDUSTAN COPPER",
        "long_name": "Hindustan Copper Limited",
        "summary": "Hindustan Copper Limited manufactures and sells copper products in India. Its activities include exploration, exploitation, mining, beneficiation, smelting, refining, and casting of refined copper metal. The company offers continuous cast copper wire rod, continuous cast copper rods, copper cathodes, copper concentrates, copper sulfate, sulphuric acid, copper reverts, anode slime, and nickel cathodes. It also exports its products. The company was founded in 1967 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700019",
        "website": "http://www.hindustancopper.com",
        "market_cap": "Large Cap"
    },
    "MCL.NS": {
        "short_name": "Madhav Copper Limited",
        "long_name": "Madhav Copper Limited",
        "summary": "Madhav Copper Limited manufactures and sells copper products in India. The company offers copper fabricated products, enameled copper wires, paper covered copper conductors, poly wrap submersible winding wires, fiberglass copper conductors, tapped insulated copper conductors, and bare copper wires, as well as copper bus bars, strips, rods, and profiles. Its products are used in pumps, motors, transformers, generators, hydro generators, alternators, wind generators, panels, and switch gears; automatic coil winding machines; and to fabricate in automatic CNC machines. Madhav Copper Limited was incorporated in 2012 and is based in Bhavnagar, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bhavnagar",
        "zipcode": "364001",
        "website": "http://www.madhavcopper.com",
        "market_cap": "Mid Cap"
    },
    "SAGARDEEP.NS": {
        "short_name": "SAGARDEEP ALLOYS L",
        "long_name": "Sagardeep Alloys Limited",
        "summary": "Sagardeep Alloys Limited manufactures and sells basic precious and non-ferrous alloys in India. The company supplies copper pipes and tubes, flats, coils, rods, anodes/nuggets, and plates, as well as oxygen free copper; red, yellow, cartridge, and low brass; gilding metals, commercial bronzes, and muntz metals; cupro nickel tubes, pipes, and rods; and stainless steel scrap grades, pipes, tubes, sheets/plates, coils, and bars. It is also involved in the wholesale of metals and metal ores. The company also exports its products to the United States, the United Kingdom, Korea, etc. Sagardeep Alloys Limited was founded in 1972 and is based in Gandhinagar, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gandhinagar",
        "zipcode": "382721",
        "website": "http://www.sdalloys.com",
        "market_cap": "Small Cap"
    }
}