{
    "APTECHT.NS": {
        "short_name": "APTECH LTD",
        "long_name": "Aptech Limited",
        "summary": "Aptech Limited operates as a learning solutions company worldwide. The company operates through two segments, Retail and Institutional. It provides basic and advanced career courses in animation, VFX, gaming, augmented and virtual reality, Web and graphics, UI-UX, digital design and marketing, broadcast, multimedia, and fast track courses; and IT education programs, including computer education, as well as pro-career, professional, and short-term courses for engineers, engineering students, 12th pass students, and working people. The company also offers courses in aviation and hospitality management, tourism management, ground staff, retail, airport management and customer care, ground staff, cabin crew, event management, airport terminal operations and management, and personality development services; hardware and networking; banking and finance; and English learning and language programs. In addition, it provides courses in cosmetology, hair and skin care, make-up, and personal grooming; preschools programs; and courses in the areas of networking, e-commerce, software development, and software engineering. Further, the company offers corporate training solutions in the areas of customer interface skills, product/process training, managerial development training, and other soft skills; and assessment and testing solutions for universities and corporates. It has a strategic partnership with Vancouver Centre for Entertainment Arts at Langara College, Vancouver. Aptech Limited was founded in 1986 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400093",
        "website": "http://www.aptech-worldwide.com",
        "market_cap": 10082787328
    },
    "CAREERP.NS": {
        "short_name": "CAREER POINT LTD",
        "long_name": "Career Point Limited",
        "summary": "Career Point Limited, an education company, provides education consultancy, management, tutorial, and residential hostel services in India. It offers tutorial services to students for school curriculum and various competitive examinations in the areas of engineering and medical entrance, NTSE, KVPY, and Science Olympiad. The company provides its tutorial services through various delivery platforms, such as owned branches, franchisee training centers, technology enabled live classrooms, online courses, synchro-school programs, and distance learning solutions. It also offers education consultancy and management services for the administration of schools; infrastructural services to higher education institutions, including technical campuses and universities; and online platforms and technology based learning solutions. In addition, the company operates Career Point Gurukul, a residential coaching and school campus; Career Point University, a higher education institution; Career Point World School, a day school and hostel; Global Public School; Global Kids, a pre-school and K12; and Career Point Institute of Skill Development that provides employability skills aligned to industry needs. The company was formerly known as Career Point Infosystems Limited and changed its name to Career Point Limited in September 2011. Career Point Limited was founded in 1993 and is based in Kota, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kota",
        "zipcode": "324005",
        "website": "http://www.cpil.in",
        "market_cap": 2578732288
    },
    "CLEDUCATE.NS": {
        "short_name": "CL EDUCATE LTD",
        "long_name": "CL Educate Limited",
        "summary": "CL Educate Limited operates as a technology-enabled provider of education products, services, content, and infrastructure in India and internationally. It operates through Consumer Test Prep, Consumer Publishing, Enterprise Corporate, and Enterprise Institutional segments. The company offers coaching for higher education entrance exams, such as MBA, Law, BBA, RBI Grade-B, GRE, and GMAT under the Career Launcher brand; GATE coaching; non-test preparation courses, such as data science, as well as financial upskilling courses, including CFA, FRM, and NISM. It also publishes and sells educational books to related and third parties, such as test preparation guides, books, and other academic materials under the GK Publications brand; offers experiential marketing and event management, digital and marcomm, and manpower management and traing services, as well as customized engagement programs and strategic business solutions under the Kestone Integrated Marketing Services brand; provides integrated solutions, including business advisory and outreach support services to educational institutions and universities under the CL Media brand; and offers student recruitment services, and research and incubation services, as well as operates a career development center. As of March 31, 2020, the company operated a network of approximately 211 physical study centers across 94 cities in India and the Middle East. CL Educate Limited was founded in 1996 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110044",
        "website": "http://www.cleducate.com",
        "market_cap": 1662530944
    },
    "COMPUSOFT.NS": {
        "short_name": "COMPUCOM SOFTWARE",
        "long_name": "Compucom Software Limited",
        "summary": "Compucom Software Limited operates as a software and education company in India and the United States. It operates through Software Development, Wind Power Generation, and Learning Solutions segments. The company offers IT services, such as enterprise application development, customer relationship management, business process management, supply chain management, and customized learning solutions; as well as grievance redressal systems and mobile solutions. It also provides ICT-enabled education service for computer education, computer literacy, and computer-aided learning projects in government schools, as well as undertakes e-governance projects. In addition, the company provides software design and development; electronic media; IT and media training, and learning; testing and maintenance; and customer support services. Further, it operates JAN TV, a satellite TV channel that provides education, news, employment, skill development, agriculture, tourism, healthcare, religious, sports, entertainment, and current affairs based programs. It also operates wind power generation plants with a total power generation capacity of 3.2 MW. The company was incorporated in 1995 and is based in Jaipur, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Jaipur",
        "zipcode": "302022",
        "website": "http://www.compucom.co.in",
        "market_cap": 1005187712
    },
    "EDUCOMP.NS": {
        "short_name": "EDUCOMP SOLUTIONS",
        "long_name": "Educomp Solutions Limited",
        "summary": "Educomp Solutions Limited provides education solutions primarily in India. It operates through four segments: Higher Learning Solutions; School Learning Solutions; K-12 Schools; and Online, Supplemental & Global Business. The company offers Educomp smartclass, a repository of digital content across subjects from kindergarten to grade 12; English Mentor, a solution for English language learning and improvement; 3D lab for virtual learning; Educomp Insight, a solution for students' counseling, evaluation, and assessment; and Educomp SmartSchool, a SmartLearning suite of products for schools, as well as smartclassonline, an e-learning platform, and E-DAC books. It also provides Educomp UniClass, a repository of digital curriculum; smartclassPro, a digital learning solution; and Educomp smartstem, a teaching tool that focuses on mathematics, physics, chemistry, and biology, as well as League INDIA practices for school operations. In addition, the company offers Genius Box, a library of activity kits with educational toys, games, and learning tools for children of two to eight years; Vidyamandir Classes for teaching and guiding students for IITs exams; and Mathguru, a repository of math problems and their solutions. Further, it provides Edureach educational programs that involve education infrastructure implementation, teacher training, and content development projects, as well as conducts employment linked vocational courses in partnership with government entities in schools. Additionally, the company operates 350 Little Millennium pre-schools, 45 brick and mortar K12 schools, and 63 Test Prep centers. It operates chains of Schools under the brands of The Millennium Schools, Takshila Schools, and Universal Academy Schools. The company was founded in 1994 and is based in Gurgaon, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurgaon",
        "zipcode": "122001",
        "website": "http://www.educomp.com",
        "market_cap": 432716384
    },
    "GLOBAL.NS": {
        "short_name": "Global Education Limited",
        "long_name": "Global Education Limited",
        "summary": "Global Education Limited provides educational and consultancy services in India and internationally. It operates through two segments, Educational Training and Development Activities; and Educational Business Support Activities. The company provides professional training and skill development to corporates, teachers, and students, as well as other various business support services to education institutions, corporates, and banks. It also offers operations and management consultancy services; financial management advisory services; IT advisory services; marketing and branding services; infrastructure facility services; and skill development and training, as well as conducts online exams. In addition, the company supplies computer hardware and accessories, tools, and printed materials, such as prospectus, journals, books, and stationery items for educational institutions. Global Education Limited was founded in 2011 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400099",
        "website": "http://www.globaledu.net.in",
        "market_cap": 541082944
    },
    "KEERTI.NS": {
        "short_name": "Keerti Know & Skill Ltd.",
        "long_name": "Keerti Knowledge and Skills Limited",
        "summary": "Keerti Knowledge and Skills Limited provides information technology (IT) education and training services in India. It is involved in the training of basic to advance computer knowledge in various IT services, including Microsoft office; industrial computerized accounting; inventory management; statutory capabilities using tally; various programming languages, such as C++, .Net, Java, and Oracle; designing courses; hardware and networking courses; and communication and soft skills, etc. The company was formerly known as Keerti Software & Hardware Infotech Private Limited. Keerti Knowledge and Skills Limited was incorporated in 1999 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.keerti.org",
        "market_cap": 220594016
    },
    "LCCINFOTEC.NS": {
        "short_name": "LCC INFOTECH",
        "long_name": "LCC Infotech Limited",
        "summary": "LCC Infotech Limited, through its subsidiary, eLCC Info.com Limited, engages in the business of computer training and education, English training, etc. in India. It provides certificate courses, diploma courses, and advance diploma in the areas of software, financial accounts, hardware and networking, and graphic designing and multimedia; skill courses in the areas of beauty and wellness, electronics, and retail, as well as apparel, made-up, and home furnishing; and competitive courses. The company was founded in 1985 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700020",
        "website": "http://www.lccinfotech.in",
        "market_cap": 200770192
    },
    "MTEDUCARE.NS": {
        "short_name": "MT EDUCARE LIMITED",
        "long_name": "MT Educare Limited",
        "summary": "MT Educare Limited, together with its subsidiaries, provides education support and coaching services in India. The company offers courses for school, science, and commerce education, as well as management entrance test preparations under the Robomate+, Lakshya, Mahesh Tutorials School Section, Mahesh Tutorials Science, Mahesh Tutorials Commerce, and CPLC brand names. It also operates college under Mahesh PU College brand name. Further, the company engages in the business of acquiring and leasing properties. The company was founded in 1988 and is headquartered in Mumbai, India. MT Educare Limited is a subsidiary of Zee Learn Limited.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400080",
        "website": "http://www.mteducare.com",
        "market_cap": 753900032
    },
    "NIITLTD.NS": {
        "short_name": "NIIT",
        "long_name": "NIIT Limited",
        "summary": "NIIT Limited provides training and development solutions to individuals, corporations, and institutions worldwide. The company offers managed training services, such as custom curriculum design and content development, learning administration and technology, learning delivery, strategic sourcing, and advisory services; and learning and talent development programs in banking, finance and insurance, retail sales enablement, management education, multi-sectoral vocational skills, digital media marketing, and programs in digital transformation technologies. Its brands portfolio comprises the training.com, a learning platform for career programs; Talent Pipeline as a Service, a just-in-time job ready talent for organization; NIIT.tv, a digital learning platform; NIIT international of finance banking and insurance training limited designed for banking, insurance, and financial services; NIIT Imperia, which provides management programs in marketing, sales, finance, operations, HR, law, brand and advertising, international and digital marketing and business, strategy, general management, taxation, and IT areas; and NIIT UNIQUA that offers outsourcing of training solutions for the BPM industry. The company's brands portfolio also includes NIIT NGuru that offers various learning solutions for schools comprising interactive classrooms for teachers, as well as math lab, mobile science labs, IT wizard programs, and learning labs for students; and Practice Plus, a platform for assessment solution of learning, as well as Quick School, an education resource planning solution. In addition, it provides StackRoute, which focuses on creating programmers; and DigiNxt that addresses the opportunities for digital transformation needs of the IT industry. The company was founded in 1981 and is headquartered in Gurugram, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122001",
        "website": "http://www.niit.com",
        "market_cap": 39230492672
    },
    "TREEHOUSE.NS": {
        "short_name": "TREE HOUSE EDUCATI",
        "long_name": "Tree House Education & Accessories Limited",
        "summary": "Tree House Education & Accessories Limited, an educational services provider, operates pre-schools in India. The company offers a range of programs for children, including play group, nursery, junior kindergarten (KG), senior KG, day care services, teacher training courses, summer camps, and hobby classes. It also franchises its schools, as well as leases education infrastructure to K12 schools. The company was founded in 2003 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400056",
        "website": "http://www.treehouseplaygroup.net",
        "market_cap": 348350176
    },
    "UMESLTD.NS": {
        "short_name": "USHA MARTIN EDU",
        "long_name": "Usha Martin Education & Solutions Limited",
        "summary": "Usha Martin Education & Solutions Limited provides educational support services in India. It operates training centers for various higher education courses under the Usha Martin Academy brand name. The company also offers education services related to Hybris omni-channel and commerce solutions, and courses on big data analytics; and provides SAP global certification courses, as well as career development programs. The company was formerly known as Usha Martin Infotech Limited and changed its name to Usha Martin Education & Solutions Limited in 2009. Usha Martin Education & Solutions Limited was incorporated in 1997 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700091",
        "website": "http://www.umesl.co.in",
        "market_cap": 129840496
    },
    "ZEELEARN.NS": {
        "short_name": "ZEE LEARN LTD",
        "long_name": "Zee Learn Limited",
        "summary": "Zee Learn Limited, together with its subsidiaries, operates in the education industry in India. The company operates through Educational, Construction and Leasing for Education, and Training Manpower and Related Activities segments. It operates Kidzee, a chain of approximately 1900 preschools in approximately 750 cities; Mount Litera World Preschool, an international standard preschool; Mount Litera Zee Schools, a chain of schools in the private-unaided category with approximately 120 schools in approximately 110 cities; and Mount Litera School International, a co-educational day school. The company also operates Zee Institute of Creative Art, a classical and digital animation training academy that trains youth in classical 2D, modern 3D animation, VFX, visual effect, graphic design, and web design; and Zee Institute of Media Arts, a TV and film training institute that offers professional courses in direction, acting, sound, editing, production, cinematography, and film animation, as well as training of other software, such as Autodesk, Smoke, and Flame. In addition, it provides consultancy and advisory services in the area of human resources, such as manpower placement, recruitment, selection, business process, and others; and e-learning online education and testing services. Further, the company is involved in the construction and leasing of properties for commercial use. Zee Learn Limited was incorporated in 2010 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400070",
        "website": "http://zeelearn.com",
        "market_cap": 4982388224
    }
}