{
  "BALAJITELE.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "Balaji Telefilms Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "BALAJI TELEFILMS",
    "state": null,
    "summary": "Balaji Telefilms Limited engages in the entertainment business in India and internationally. It operates through Commissioned Programmes, Films, and Digital segments. The company produces and distributes television content and films primarily in Hindi under the Balaji Telefilms brand name; and produces reality shows, events, and Bengali contents. It is also involved in the B2C digital content business under the brand name of ALT Balaji; and creates intellectual property rights. In addition, the company sells Indian ethnic wear and jewelry under the EK brand name; and operates Hoonur, a platform for media professionals and entertainment consumers. Balaji Telefilms Limited was founded in 1994 and is based in Mumbai, India.",
    "website": "http://www.balajitelefilms.com",
    "zipcode": "400053"
  },
  "CINEVISTA.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "Cinevista Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "CINEVISTA LIMITED",
    "state": null,
    "summary": "Cinevista Limited produces serials, films, and ad films in India and internationally. It offers commercial television content in the areas of action, adventure, kids programming, drama, and soap; produces and distributes movies; and produces advertising commercials for various clients and advertisers. The company also owns and operates a five-acre property that is a one-stop shop for shooting needs; creates television software; and provides post production services, as well as rents equipment, such as recorders, cameras, digital triax set ups, and SEG video switchers. It offers its programming in various channels, including Sony TV, Sahara One, Zee TV, and MTV. The company was formerly known as Cinevistaas Limited and changed its name to Cinevista Limited in October 2012. Cinevista Limited was founded in 1982 and is based in Mumbai, India.",
    "website": "http://www.cinevistaas.com",
    "zipcode": "400078"
  },
  "CREATIVEYE.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "Creative Eye Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "CREATIVE EYE LTD",
    "state": null,
    "summary": "Creative Eye Limited engages in the television content production business in India. It produces television serials and movies. The company was founded in 1986 and is based in Mumbai, India.",
    "website": "http://www.creativeeye.com",
    "zipcode": "400053"
  },
  "DEN.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "DEN Networks Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "DEN NETWORKS LTD",
    "state": null,
    "summary": "DEN Networks Limited distributes and promotes television channels through digital cable distribution network in India and internationally. It also offers cable TV, over-the-top entertainment, and broadband services. The company serves approximately 13 million households primarily in 13 states in India, including Delhi, Uttar Pradesh, Karnataka, Maharashtra, Gujarat, Rajasthan, Haryana, Kerala, West Bengal, Jharkhand, Bihar, Madhya Pradesh, and Uttarakhand. The company was formerly known as DEN Digital Entertainment Networks Limited and changed its name to DEN Networks Limited in June 2008. DEN Networks Limited was founded in 2007 and is headquartered in New Delhi, India.",
    "website": "http://www.dennetworks.com",
    "zipcode": "400079"
  },
  "DISHTV.NS": {
    "city": "Noida",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "Dish TV India Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "DISH TV INDIA LTD",
    "state": null,
    "summary": "Dish TV India Limited, together with its subsidiaries, provides direct to home and teleport services primarily in India. It distributes its products and services through a network of distributors and dealers. As of December 30, 2020, the company offered approximately 719 channels and services, including 31 audio channels, and 76 high definition channels and services under the Dish TV, Zing, and d2h brands. The company has strategic partnership and collaboration with Amazon Prime Video, Amazon Alexa, ShortsTV, Zee5, Hungama Play, Voot, Sony Liv, and Alt Balaji to provide services to its Dish TV and d2h subscribers. Dish TV India Limited was incorporated in 1988 and is based in Noida, India.",
    "website": "http://www.dishd2h.com",
    "zipcode": "201301"
  },
  "DQE.NS": {
    "city": "Hyderabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "DQ Entertainment (International) Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "DQ ENTERTAINMENT I",
    "state": null,
    "summary": "DQ Entertainment (International) Limited provides animation production services for television, feature films, home video, online game art, and mobile and next generation console games worldwide. The company operates through Animation and Distribution segments. It provides training services for the production of animation television series and movies; and licensing and distribution for various markets, platforms, and product categories, such as international home video distribution, publishing, licensing and merchandising. The company also produces animation and visual effects content for feature films, television, video in 2D and 3D, and digital animation; and produces assets and full motion video creations for next generation consoles, PC, mobile, and online games. In addition, it produces and distributes live-action and feature films. The company was incorporated in 2007 and is based in Hyderabad, India. DQ Entertainment (International) Limited is a subsidiary of DQ Entertainment (Mauritius) Limited.",
    "website": "http://www.dqentertainment.com",
    "zipcode": "500034"
  },
  "DT0.SG": {
    "city": "Noida",
    "country": "India",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Entertainment",
    "long_name": "Dish TV India Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "DISH TV India Ltd. Reg. Sh. (GD",
    "state": null,
    "summary": "Dish TV India Limited, together with its subsidiaries, provides direct to home and teleport services primarily in India. It distributes its products and services through a network of distributors and dealers. As of December 30, 2020, the company offered approximately 719 channels and services, including 31 audio channels, and 76 high definition channels and services under the Dish TV, Zing, and d2h brands. The company has strategic partnership and collaboration with Amazon Prime Video, Amazon Alexa, ShortsTV, Zee5, Hungama Play, Voot, Sony Liv, and Alt Balaji to provide services to its Dish TV and d2h subscribers. Dish TV India Limited was incorporated in 1988 and is based in Noida, India.",
    "website": "http://www.dishd2h.com",
    "zipcode": "201301"
  },
  "EROSMEDIA.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "Eros International Media Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "EROS INTL MEDIA",
    "state": null,
    "summary": "Eros International Media Limited, together with its subsidiaries, engages in the production, exploitation, and distribution of films in India, the United Arab Emirates, and internationally. The company operates on a vertically integrated studio model controlling content, as well as provides distribution and exploitation across various formats, including cinema, digital, home entertainment, and television syndication. It also engages in the sourcing of Indian film content through acquisition, co-production, or production; exploiting and distributing films through music release, theatrical distribution, DVD and VCD release, television licensing, and cable or DTH licensing; and trading and exporting international rights. The company was founded in 1977 and is based in Mumbai, India. Eros International Media Limited is a subsidiary of Eros International Plc.",
    "website": "http://www.erosstx.com",
    "zipcode": "400053"
  },
  "GFLLIMITED.NS": {
    "city": "Noida",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "GFL Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "GFL LIMITED",
    "state": null,
    "summary": "GFL Limited operates and manages multiplex cinema theatres in India. It operates through Wind Energy Business, Power, and Theatrical Exhibition segments. The company operates and manages 147 multiplexes and 626 screens in 68 cities with a total seating capacity of 144,467 seats under the INOX brand name. It also manufactures wind turbine generators (WTGs), as well as provides engineering, procurement, and commissioning; operations and maintenance; and common infrastructure facilities to WTGs. In addition, the company is involved in the development of wind farms; real estate and property development; and generation and sale of wind energy, as well as services for the erection, procurement, and commissioning (EPC) of wind farms. The company was formerly known as Gujarat Fluorochemicals Limited and changed its name to GFL Limited in July 2019. The company was incorporated in 1987 and is based in Noida, India. GFL Limited is a subsidiary of Inox Leasing and Finance Limited.",
    "website": "http://www.gfl.co.in",
    "zipcode": "201301"
  },
  "GTPL.NS": {
    "city": "Ahmedabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "GTPL Hathway Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "GTPL HATHWAY LTD",
    "state": null,
    "summary": "GTPL Hathway Limited, through its subsidiaries, provides cable television and broadband services. It operates through three segments: Cable Television, Internet, and EPC Project. The company engages in the distribution of television channels through digital cable distribution network. It has a network of approximately 40,000 kilometers of optical fiber cable. The company serves its customers in approximately 800 cities across 12 states in India, including Gujarat, Rajasthan, Maharashtra, Goa, Jharkhand, Bihar, Assam, West Bengal, Andhra Pradesh, Telangana, Uttar Pradesh, and Tamil Nadu. It also acts as an Internet service provider. The company was incorporated in 2006 and is headquartered in Ahmedabad, India.",
    "website": "http://www.gtpl.net",
    "zipcode": "380059"
  },
  "HATHWAY.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "Hathway Cable and Datacom Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "HATHWAY CABLE & DA",
    "state": null,
    "summary": "Hathway Cable and Datacom Limited provides cable television network, Internet, and allied services. It operates through Broadband Business and Cable Television Segments. The company offers digital cable TV services; standard definition (SD) and high definition (HD) cable TV channel services; and SD and HD set-top boxes. It also provides home and business broadband services. In addition, the company operates H-tube, a channel for broadcasting videos; CCC  Cine Channel, a 24 hours movie channel; HMART, a shopping channel; and HFLICKS1 and HFLICKS2, which are entertainment channels. The company offers its cable TV services in approximately 350 cities and towns in India. Hathway Cable and Datacom Limited was incorporated in 1959 and is based in Mumbai, India.",
    "website": "http://www.hathway.com",
    "zipcode": "400098"
  },
  "IMAGICAA.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "Imagicaaworld Entertainment Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "IMAGICAAWORLD ENT LTD",
    "state": null,
    "summary": "Imagicaaworld Entertainment Limited develops and operates theme-based entertainment destinations in India. It operates through Tickets, Food and Beverage, Merchandise, Rooms, and Other Operations segments. The company operates theme, water, and snow parks under the Imagicaa brand; and a hotel comprising 287 rooms under the Novotel Imagicaa brand. It also owns and operates a range of food and beverage outlets, restaurants, and candy stores under the Roberto's Food Court, The Imagica Capital, Red Bonnet American Diner, Arrmada, Sunbeatz Pizzeria & Bar, Red Bonnet Express, Ammos, Cones, and Sandy Sipss names; and stores that sell T-shirts, crop tops, formal shirts, sweatshirts, handbags, backpacks, and tote bags, as well as soft toys and pillows, sipper bottles, coffee mugs, and cocktail glasses. In addition, the company develops and leases real estate properties. The company was formerly known as Adlabs Entertainment Limited and changed its name to Imagicaaworld Entertainment Limited in April 2020. Imagicaaworld Entertainment Limited was incorporated in 2010 and is based in Mumbai, India.",
    "website": "http://www.imagicaaworld.com",
    "zipcode": "400053"
  },
  "INOXLEISUR.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "INOX Leisure Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "INOX LEISURE LTD",
    "state": null,
    "summary": "INOX Leisure Limited operates and manages multiplexes and cinema theatres under the INOX brand name in India. As of February 20, 2021, it operated 152 multiplexes and 643 screens in 69 cities. The company was founded in 1999 and is based in Mumbai, India. INOX Leisure Limited is a subsidiary of Gujarat Fluorochemicals Limited.",
    "website": "http://www.inoxmovies.com",
    "zipcode": "400093"
  },
  "KSERASERA.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "KSS Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "KSS LTD",
    "state": null,
    "summary": "KSS Limited, a diversified media company, engages in the processing and content distribution of movies and advertisements primarily in India. The company operates through Movie Digitization, Miniplex Theater, Retail Gold Jewellery, Film Production & Distribution, and Others segments. It offers high definition cinema projection technology under the Sky Cinex Prime name. The company is also involved in the operation of cine restaurant and cine cafe under the CHHOTU MAHARAJ brand name; movable theatre to showcase movies under the Filmy Carvan brand name; provision of Knowledge Kampus education packages; and operation of Cherishgold.com, an e-commerce portal/virtual jewelry mall that offers a collection of gold, diamond, and gemstone jewelry. In addition, it engages in the distribution and retail of branded jewelry, jewelry products, and life style products. The company was formerly known as K Sera Sera Limited and changed its name to KSS Limited in December 2012. KSS Limited was incorporated in 1995 and is headquartered in Mumbai, India.",
    "website": "http://www.kserasera.com",
    "zipcode": "400053"
  },
  "MUKTAARTS.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "Mukta Arts Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "MUKTA ARTS",
    "state": null,
    "summary": "Mukta Arts Limited engages in the production, distribution, and exhibition of films in India. It operates through five segments: Software Division, Equipment Division, Education, Theatrical Exhibition Division, and Others. The Software Division segment is involved in film/TV production and distribution operations. This segment produces/co-produces movies and television content, as well as offers related services; and acquires movie rights for overseas and Indian distribution. The Equipment Division segment provides production equipment to other production houses and independent producers on hire. The Education segment operates an education, research, and training institute that offer training in various skills related to films, television, and the media industry. The Theatrical Exhibition Division segment comprise of various services offered at theatres, including sale of tickets, catering of food and beverages, and providing advertising services at theatres, as well as related services. The Others segment engages in the facility rental business. Mukta Arts Limited was founded in 1982 and is based in Mumbai, India.",
    "website": "http://www.muktaarts.com",
    "zipcode": "400065"
  },
  "NXTDIGITAL.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "Nxtdigital Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "NXTDIGITAL LIMITED",
    "state": null,
    "summary": "Nxtdigital Limited, through its subsidiaries, engages in the media and communications business in India. The company operates through Media and Communications and Real Estate segments. It distributes TV signals through a dual delivery platform consisting of the traditional terrestrial fiber route and the head end in the sky (HITS) satellite platform under the INDigital and NXTDIGITAL brand names. The company also provides broadband and internet services under the ONE Broadband brand name; and sells set top boxes. In addition, it operates land acquired for future development. The company was formerly known as Hinduja Ventures Limited and changed its name to Nxtdigital Limited in October 2019. Nxtdigital Limited was incorporated in 1985 and is based in Mumbai, India.",
    "website": "http://www.nxtdigital.co.in",
    "zipcode": "400093"
  },
  "ORTEL.NS": {
    "city": "New Delhi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "Ortel Communications Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "ORTEL COMMUNICATIO",
    "state": null,
    "summary": "Ortel Communications Limited, a regional cable television service provider, engages in the distribution of analog and digital cable television, high speed broadband, and voice over Internet protocol services. It operates through Cable TV, Broadband Service, Infrastructure Leasing, and Others segments. The company offers digital cable television services; and other value added services, such as high definition (HD), near video on demand, electronic program guide, and gaming and local content services. It also provides broadband services that enable home subscribers to access the broadband services by using DOCSIS technology; and SMEs and corporate subscribers to access high-speed Internet by using fiber to their premises. In addition, the company engages in leasing fiber infrastructure for telecommunication and Internet companies; and the provision of signal up linking services. It serves customers located in the states of Odisha, Andhra Pradesh, Telangana, Chhattisgarh, West Bengal, and Madhya Pradesh, India. The company operates approximately 14 HD channels. The company was founded in 1995 and is headquartered in New Delhi, India. Ortel Communications Limited is under Corporate Insolvency Resolution Process of the Insolvency and Bankruptcy Code 2016.",
    "website": "http://www.ortelcom.com",
    "zipcode": "110029"
  },
  "PFOCUS.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "Prime Focus Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "PRIME FOCUS",
    "state": null,
    "summary": "Prime Focus Limited, together with its subsidiaries, engages in the motion picture, video, and television program post-production activities primarily in India, the United Kingdom, the United States, and Canada. It offers creative services, including visual effects, advertising, stereo 3D conversion, and feature and TV animation; equipment rental services; and post production services, such as digital intermediate/color grading, sound, and picture post services to the media and entertainment industry. The company also provides technology products comprising CLEAR, a hybrid cloud-enabled media enterprise resource planning suite that includes cloud MAM, operations cloud, broadcast cloud, production cloud, securescreener, and vision cloud modules, as well as cloud media services for broadcasters, studios, brands, and service providers; View-D, a stereoscopic 2D to 3D conversion; and Primetime Emmy, a DAX digital dailies. In addition, it is involved in the media and other investment activities; and provision of digital asset management, restoration, and visual special effects services, as well as operates a training institute. The company provides its services to Hollywood studios, OTT players, broadcasters, advertisers, production houses, and media companies. The company was founded in 1997 and is based in Mumbai, India.",
    "website": "http://www.primefocus.com",
    "zipcode": "400052"
  },
  "PNC.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "Pritish Nandy Communications Ltd",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "PRITISH NANDY COMM",
    "state": null,
    "summary": "Pritish Nandy Communications Ltd, a media and entertainment company, engages in the production and exploitation of content in India. The company operates in Content and Wellness segments. It produces movies, documentaries, corporate films, TV serials, and digital series. The company is also involved in the wellness business, as well as owns Moksh, Power Yoga, Passion Yoga, Cool Yoga, and Couple Yoga brands. Pritish Nandy Communications Ltd was founded in 1993 and is based in Mumbai, India.",
    "website": "http://www.pritishnandycom.com",
    "zipcode": "400021"
  },
  "PVR.NS": {
    "city": "Gurugram",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "PVR Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "PVR LTD",
    "state": null,
    "summary": "PVR Limited, a theatrical exhibition company, engages in the exhibition, distribution, and production of movies. The company is also involved in the in-house advertisement, sale of food and beverages, gaming, and restaurant businesses. As of March 05, 2021, it operated a network of 844 screens at 177 properties in India and Sri Lanka. The company was incorporated in 1995 and is based in Gurugram, India.",
    "website": "http://www.pvrcinemas.com",
    "zipcode": "122002"
  },
  "RADAAN.NS": {
    "city": "Chennai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "Radaan Mediaworks India Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "RADAAN MEDIAWORKS",
    "state": null,
    "summary": "Radaan Mediaworks India Limited operates in the media and entertainment industry in India. The company is involved in the production of content for tele-serials/films, digital content, events, game shows, etc.; distribution of films; theatrical play activities; and setting up of training courses, such as acting, dance, martial arts, yoga, etc. It produces serials in Tamil, Telugu, Malayalam, Hindi, Gujarati and Kannada languages. Radaan Mediaworks India Limited was founded in 1994 and is based in Chennai, India.",
    "website": "http://www.radaan.tv",
    "zipcode": "600018"
  },
  "SAREGAMA.NS": {
    "city": "Kolkata",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "Saregama India Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "SAREGAMA INDIA LTD",
    "state": null,
    "summary": "Saregama India Limited engages in the sound recording and publishing business in India and internationally. The company operates through Music, Films/TV Serials, and Publication segments. The Music segment manufactures and sells music storage devices, such as carvaan, mini carvaan, music cards, audio compact discs, digital versatile discs, etc., as well as deals with related music rights. The Films/TV Serials segment produces, sells, telecasts, and broadcasts films, TV serials, and pre-recorded programs, as well as deals in film rights. The Publication segment publishes OPEN, a weekly current affairs magazine. It also offers television software. The company was formerly known as Gramophone Company of India Ltd. The company was founded in 1901 and is headquartered in Kolkata, India. Saregama India Limited is as a subsidiary of Composure Services Private Limited.",
    "website": "http://www.saregama.com",
    "zipcode": "700028"
  },
  "SHEMAROO.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "Shemaroo Entertainment Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "SHEMAROO ENTERTAIN",
    "state": null,
    "summary": "Shemaroo Entertainment Limited engages in the motion picture, video, and television programme distribution activities in India. The company is involved in the movie production; and syndication business that distributes its content to satellite, cable, and terrestrial networks, as well as distributes videos, CRBT, live streaming, etc. through operator and own branded portals. It also deals in curating and providing content to DTH services on DTH platforms; and provides inflight eclectic mix of content service. In addition, the company offers Bollywood theme products, such as t-shirts, mugs and coasters, etc. through online and offline platforms. Further, it provides studio services comprising digital intermediate, digital restoration, VFX, telecine, film scanning, film grading, etc. to various content owners and distributors; brand solutions; and home entertainment products; and media industry courses, as well as offers mobile applications. Additionally, the company offers pre-loaded devotional speakers. Shemaroo Entertainment Limited was founded in 1962 and is based in Mumbai, India.",
    "website": "http://www.shemarooent.com",
    "zipcode": "400059"
  },
  "SILLYMONKS.NS": {
    "city": "Hyderabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "Silly Monks Entertainment Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "Silly Monks Entertain Ltd",
    "state": null,
    "summary": "Silly Monks Entertainment Limited operates as an entertainment and media company in India. It is involved in the digital media publishing; movie/series/music/other creator content production; celebrity digital management; marketing and promotion on digital and traditional mediums; content distribution and syndication on satellite channels, cinema theatres, airborne, and other offline platforms; and online/digital advertising with Google AdWords. The company was founded in 2013 and is headquartered in Hyderabad, India.",
    "website": "http://www.sillymonks.com",
    "zipcode": "500084"
  },
  "SITINET.NS": {
    "city": "Noida",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "SITI Networks Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "SITI NETWORKS LTD",
    "state": null,
    "summary": "SITI Networks Limited, a multi-system operator, provides cable television network, Internet, and allied services in India. Its product includes digital and analogue cable television, and broadband and local television channels. The company offers cable services through set top boxes. It also provides broadband Internet services. The company markets its products under the SITI brand. It serves approximately 11.3 million digital customers through 15 digital head ends, as well as a network of approximately 33,000 kilometers of optical fiber and coaxial cable in approximately 580 locations. The company was formerly known as SITI Cable Network Limited and changed its name to SITI Networks Limited in August 2016. SITI Networks Limited was founded in 1994 and is based in Noida, India.",
    "website": "http://www.sitinetworks.com",
    "zipcode": "201301"
  },
  "TIPSINDLTD.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "Tips Industries Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "TIPS INDUSTRIES",
    "state": null,
    "summary": "Tips Industries Limited engages in the production and distribution of motion pictures; and acquisition and exploitation of music rights in India and internationally. The company operates in two segments, Music (Audio/Video) and Film Production/Distribution. It has a music library of approximately 29,000 songs across various languages and genres; and holds soundtrack copyrights of approximately 50 Hindi movies. The company also produces Hindi and Punjabi films. It operates through an owned distribution system. The company was founded in 1975 and is based in Mumbai, India.",
    "website": "http://www.tips.in",
    "zipcode": "400052"
  },
  "UFO.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Entertainment",
    "long_name": "UFO Moviez India Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "UFO MOVIEZ INDIA",
    "state": null,
    "summary": "UFO Moviez India Limited operates a digital cinema distribution network and in-cinema advertising platform in India, the Middle East, Nepal, and internationally. The company delivers movies through its satellite-based digital cinema distribution network using its UFO-M4 platform; and Hollywood and Indian studio content through its D-Cinema network. It also sells and leases digital cinema equipment comprising digital projectors and industrial grade digital cinema servers to cinema theatres and franchisees, as well as sells lamps and spares; sells and leases projector consumables, 3D equipment, and 3D equipment peripherals; and offers digital mastering services. In addition, the company is involved in the caravan talkies, framez, club cinema, and NOVA cinema activities; and marketing an electronic ticketing platform. As of March 31, 2020, its network consisted of 5,508 screens, including 5,298 screens in India; and 210 screens in Mexico and the United States. The company also had advertising rights to 3,792 screens, with an aggregate seating capacity of approximately 2.1 billion viewers and a reach of approximately 1,231 cities and towns in India. UFO Moviez India Limited was incorporated in 2004 and is headquartered in Mumbai, India.",
    "website": "http://www.ufomoviez.com",
    "zipcode": "400093"
  }
}
