{
    "AGRITECH.NS": {
        "short_name": "AGRI-TECH (INDIA)",
        "long_name": "Agri-tech (India) Limited",
        "summary": "Agri-Tech (India) Limited engages horticulture business in India. The company was incorporated in 1993 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400020",
        "website": "http://www.agri-tech.in",
        "full_time_employees": null
    },
    "APEX.NS": {
        "short_name": "APEX FROZEN FOODS",
        "long_name": "Apex Frozen Foods Limited",
        "summary": "Apex Frozen Foods Limited produces and exports aquaculture products. It provides ready-to-cook white leg and black tiger shrimps. The company offers its products under Bay Fresh, Bay Harvest, and Bay Premium brand names to food companies, retail chains, restaurants, club stores, and distributors in the United States, European Union, and China. Apex Frozen Foods Limited was founded in 1995 and is based in Kakinada, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kakinada",
        "zipcode": "533005",
        "website": "http://www.apexfrozenfoods.in",
        "full_time_employees": 2858
    },
    "ASPINWALL.NS": {
        "short_name": "ASPINWALL AND COMP",
        "long_name": "Aspinwall and Company Limited",
        "summary": "Aspinwall and Company Limited, a multi-line business organization, engages in coffee processing and trading, rubber plantation, natural fiber, and shipping and logistics businesses worldwide. Its Coffee segment is involved in the plantation, processing, trading, and export of coffee. The company's Plantation segment owns and manages approximately 2,000 acres of rubber plantations, as well as produces centrifuged latex and technically specified natural rubber. Its Natural Fibre segment produces entrance and corridor mats, carpets, mattings, rugs, runners, and mesh mattings; PVC and rubber-backed natural fiber products, and jute floor-coverings and furnishings, as well as supplies natural fiber geotextiles, which are used in environment engineering to prevent soil erosion; and coir pith, which is used in horticulture to grow plants. The company's Logistics segment provides liner, custom house agency, freight forwarding, air and bulk cargo, ship agency, stevedoring, warehousing, and project and over-dimensional cargo handling services. Aspinwall and Company Limited was founded in 1867 and is headquartered in Mangalore, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mangalore",
        "zipcode": "575005",
        "website": "http://www.aspinwall.in",
        "full_time_employees": 747
    },
    "GODREJAGRO.NS": {
        "short_name": "GODREJ AGROVET LTD",
        "long_name": "Godrej Agrovet Limited",
        "summary": "Godrej Agrovet Limited, an agri-business company, provides products and services that enhance crop and livestock yields. It operates through Animal Feed, Vegetable Oil, Crop Protection, Dairy, Poultry & Processed Food, Real Estate, and Other Business segments. The company offers animal feed, such as cattle, poultry, aqua, and specialty feed, as well as on-farm technical support services. It also engages in the oil palm cultivation with approximately 61,700 hectares of plantations across Andhra Pradesh, Telangana, Tamil Nadu, Goa, Maharashtra, and Mizoram producing crude palm oil, crude palm kernel oil, and palm kernel cake. In addition, the company produces and markets plant growth regulators and bio-stimulants under the Vipul, Double, and Combine brands in India, as well as exports to the United States, Kenya, and Mauritius; herbicides; insecticides; fungicides; and soil conditioners and organic manures. Further, it manufactures and markets poultry and meat products under the Real Good Chicken brand; vegetarian and non-vegetarian ready-to-cook products under the Real Good Yummiez name; and processes and sells milk and milk-based products under the Jersey brand. Additionally, the company produces agrochemical active ingredients, intermediates, and pharmaceutical intermediates, as well as offers off-patented chemistries to domestic agrochemical marketers and also for exports to the United States, Europe, West Asia, South East Asia, and Latin America. It is also involved in the seed and real estate businesses, as well as energy generation through windmill. The company was incorporated in 1991 and is based in Mumbai, India. Godrej Agrovet Limited is a subsidiary of Godrej Industries Limited.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400079",
        "website": "http://www.godrejagrovet.com",
        "full_time_employees": null
    },
    "GROBTEA.NS": {
        "short_name": "THE GROB TEA COMPA",
        "long_name": "The Grob Tea Company Limited",
        "summary": "The Grob Tea Company Limited cultivates, manufactures, and sells tea in India. The company owns five tea gardens under the names of Doyang, Dessoie, Kanu, and Teen Ali tea estates located in the belt of Assam; and Pathemara tea estate in the Cachar district of Assam. Its gardens comprise an area of 4236.07 hectares and 2332.71 hectares of tea plantation. The company was incorporated in 1895 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700046",
        "website": "http://www.grobtea.com",
        "full_time_employees": 4015
    },
    "HARRMALAYA.NS": {
        "short_name": "HARRISONS MALAYALA",
        "long_name": "Harrisons Malayalam Limited",
        "summary": "Harrisons Malayalam Limited primarily engages in the plantation and selling of tea, rubber, and pineapples in India and internationally. It operates through three segments: Tea, Rubber, and Others. The company offers CTC and orthodox, custom blended, and organic teas; and rubber products, including latex, smoked sheets, crepes, and crumb/block rubber products. It also produces cardamom, malabar pepper, cloves, nutmeg, cocoa, vanilla, arecanut, coconut, and banana, as well as coffee. In addition, the company trades in and exports its products, as well as products from other growers. Harrisons Malayalam Limited was incorporated in 1978 and is based in Kochi, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kochi",
        "zipcode": "682003",
        "website": "http://www.harrisonsmalayalam.com",
        "full_time_employees": 8704
    },
    "JAYSREETEA.NS": {
        "short_name": "JAYSHREE TEA",
        "long_name": "Jay Shree Tea & Industries Limited",
        "summary": "Jay Shree Tea & Industries Limited manufactures and sells tea in India and internationally. It operates through Tea, Chemical & Fertilizer, and Sugar segments. It has 21 tea estates in India. The company also manufactures and markets sugar; and chemicals and fertilizers comprising single super phosphate, sulphuric acid, and oleum. In addition, it offers warehousing services, as well as engages in the investment and non-banking financial activities. The company was founded in 1945 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700017",
        "website": "http://www.jayshreetea.com",
        "full_time_employees": 21363
    },
    "KGL.NS": {
        "short_name": "KARUTURI GLOBAL",
        "long_name": "Karuturi Global Limited",
        "summary": "Karuturi Global Limited, together with its subsidiaries, produces, sells, and exports cut roses in India and internationally. The company processes and produces pulses, oil seeds, maize, rice, sugar, gherkins, baby corn, jalapenos, and bottled pickles, as well as produces and distributes plants. The company was formerly known as Karuturi Networks Limited and changed its name to Karuturi Global Limited in May 2008. Karuturi Global Limited was founded in 1994 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560001",
        "website": "http://karuturi.com",
        "full_time_employees": null
    },
    "KSCL.NS": {
        "short_name": "KAVERI SEED COMPAN",
        "long_name": "Kaveri Seed Company Limited",
        "summary": "Kaveri Seed Company Limited researches, produces, processes, and markets hybrid seeds of field and vegetable crops. It provides seeds of field crops, such as maize, paddy, cotton, sunflower, mustard, sorghum, pulses, bajra, and wheat; and vegetables comprising tomatoes, okra, chilies, watermelon, gourds, and brinjal. The company sells its products through distributors and dealers in India. It also exports its products to Egypt, Pakistan, Bangladesh, Nepal, Myanmar, and Sri Lanka. Kaveri Seed Company Limited was founded in 1976 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500003",
        "website": "http://www.kaveriseeds.in",
        "full_time_employees": 1073
    },
    "MGEL.NS": {
        "short_name": "Mangalam Global Ent Ltd",
        "long_name": "Mangalam Global Enterprise Limited",
        "summary": "Mangalam Global Enterprise Limited manufactures and sells refined castor oil first stage grades, castor de oiled cakes, and high protein castor de oiled cakes in India. It also manufactures and sells cotton bales and delineate cotton seeds. Mangalam Global Enterprise Limited was formerly known as Mangalam Global Enterprise Private Limited and changed its name to Mangalam Global Enterprise Limited on September, 2019. Mangalam Global Enterprise Limited was founded in 1942 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380006",
        "website": "http://www.groupmangalam.com",
        "full_time_employees": 169
    },
    "NKIND.NS": {
        "short_name": "NK INDUSTRIES",
        "long_name": "N.K Industries Limited",
        "summary": "N.K Industries Limited manufactures, sells, and trades in castor oil and its derivatives in India. Its products include commercial grade castor oil, cold pressed castor oil, castor oil British Pharma 93 grade, castor Hi protein, first pressed degummed castor oil, pale pressed grade, sodium sulphate anhydrous, refined castor oil, crude glycerin, de oiled cakes-castor meals, 12-hydroxy stearic acid, ricinoleic acid, hydrogenated castor oil flakes/powder, and high protein castor meal. The company also serves customers in Asia, Africa, Europe, the United States, and South America. N.K Industries Limited was incorporated in 1987 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380009",
        "website": "http://www.nkindustriesltd.com",
        "full_time_employees": 221
    },
    "NORBTEAEXP.NS": {
        "short_name": "NORBEN TEA & EXPOR",
        "long_name": "Norben Tea & Exports Limited",
        "summary": "Norben Tea & Exports Limited engages in the growing, manufacturing, and selling of tea in India. It offers Indian teas, flavor teas, green teas, and teabags. The company also exports its products. Norben Tea & Exports Limited was incorporated in 1990 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700001",
        "website": "http://www.norbentea.com",
        "full_time_employees": 91
    },
    "PKTEA.NS": {
        "short_name": "PERIA KARAMALAI TE",
        "long_name": "The Peria Karamalai Tea and Produce Company Limited",
        "summary": "The Peria Karamalai Tea and Produce Company Limited engages in the production and distribution of tea in India. The company operates through Tea, Investment, and Power segments. Its plantations cover approximately 6,000 acres of land located in the Anamalai Hills, Coimbatore District in Tamil Nadu. The company also generates and distributes power through solar and wind energy. In addition, it invests in financial instruments. The company was incorporated in 1913 and is headquartered in Coimbatore, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Coimbatore",
        "zipcode": "641018",
        "website": "http://www.periatea.com",
        "full_time_employees": 1547
    },
    "PRABHAT.NS": {
        "short_name": "PRABHAT DAIRY LTD",
        "long_name": "Prabhat Dairy Limited",
        "summary": "Prabhat Dairy Limited manufactures and trades in cattle feed and animal nutrition products in India. It sells its products under the Annapurna brand name. The company was founded in 1998 and is based in Ahmednagar, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmednagar",
        "zipcode": "413720",
        "website": "http://www.prabhat-india.in",
        "full_time_employees": 56
    },
    "RUCHINFRA.NS": {
        "short_name": "RUCHI INFRASTRUCTU",
        "long_name": "Ruchi Infrastructure Limited",
        "summary": "Ruchi Infrastructure Limited engages in trading of various commodities in India. It operates through Trading, Infrastructure, and Others segments. The company also engages in handling bulk storage of liquid commodities, including edible oils, petroleum products, liquid bulk chemicals, etc.; and operates warehousing facilities for storing agricultural commodities, such as wheat, maize, soybean etc. In addition, it generates power from wind energy; and manufactures and sells soaps, Vanaspati, and lubricants, as well as refines edible oils. The company operates through a network of storage terminals located at 7 ports and 5 railway siding terminals for handling and transporting edible oils, fatty acid, caustic soda lye, phosphoric acid, sulphuric acid, carbon black feed stock, 2- ethyl hexanol, molasses, etc.; and a jetty at Rosy pier in Jamnagar, Gujarat for handling liquid and dry cargo. Further, it is involved in the township, commercial, and residential premises development. The company was formerly known as Ruchi Infrastructure and Finance Ltd and changed its name to Ruchi Infrastructure Limited in June 1995. Ruchi Infrastructure Limited was incorporated in 1984 and is based in Indore, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Indore",
        "zipcode": "452001",
        "website": "http://www.ruchiinfrastructure.com",
        "full_time_employees": 126
    },
    "SAKUMA.NS": {
        "short_name": "SAKUMA EXPORTS LTD",
        "long_name": "Sakuma Exports Limited",
        "summary": "Sakuma Exports Limited engages in the trading of agro commodities in India. The company act as a buyer, processor, marketer, exporter, and importer of agricultural commodities, such as sugar and by-products; sesame seeds, groundnut kernels, sunflower seeds, safflower seeds, etc.; rice, wheat, corn, barley, millet, and sorghum; pulses and beans; coriander seeds, cumin seeds, turmeric, kalonji, fenugreek seeds, fennel, ajwain, nutmeg, mustard, cardamom, black pepper, dill seeds, ginger, various grounded spices, and curry powder; animal feed products, such as de-oiled cakes including soya bean meal , rapeseed meal, ground nut meal, castor meal etc.; and cotton. It also offers financial structured products that are linked to physical commodities. The company also exports its products to the Middle East, South and South East Asia, the Far East, Australia, Europe, and Africa. Sakuma Exports Limited was founded in 1998 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.sakumaexportsltd.com",
        "full_time_employees": 53
    },
    "SANWARIA.NS": {
        "short_name": "SANWARIA CONSUMER",
        "long_name": "Sanwaria Consumer Limited",
        "summary": "Sanwaria Consumer Limited operates as an integrated agro food processor in India. The company manufactures and sells basmati rice; pulses, poha, sugar, soya chunks, and wheat flour; other food grain products, including soya meal and edible oil, as well as refined and crude oil; rice flour, salt, suji, maida, besan, and daliya; rice bran and its products; and de-oiled cake. It operates retail stores under the Sanwaria Kirana brand name, as well as sells its products online. The company sells its products under the SULABH, SANWARIA SETH, NARMADA, and NASHIRA brand names. It also exports its products. The company was formerly known as Sanwaria Agro Oils Limited and changed its name to Sanwaria Consumer Limited in August 2017. Sanwaria Consumer Limited was founded in 1991 and is based in Bhopal, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bhopal",
        "zipcode": "462016",
        "website": "http://www.sanwariaconsumer.com",
        "full_time_employees": null
    },
    "SRPL.NS": {
        "short_name": "Shree Ram Proteins Ltd.",
        "long_name": "Shree Ram Proteins Limited",
        "summary": "Shree Ram Proteins Limited engages in pressing and crushing of cotton seeds in India. Its products include cotton linter, seed meal, seed hull, seed wash oil, and seed refine oil; and soybean meal, rapeseed meal, groundnut meal, and raw cotton bales. The company also exports its products. Shree Ram Proteins Limited was incorporated in 2008 and is based in Rajkot, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Rajkot",
        "zipcode": "360005",
        "website": "http://www.shreeramproteins.com",
        "full_time_employees": 24
    },
    "STEL.NS": {
        "short_name": "STEL HOLDINGS LTD",
        "long_name": "STEL Holdings Limited",
        "summary": "STEL Holdings Limited engages in the investment activities in India. The company was formerly known as Sentinel Tea and Exports Limited and changed its name to STEL Holdings Limited in July 2011. STEL Holdings Limited was incorporated in 1990 and is based in Kochi, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kochi",
        "zipcode": "682003",
        "website": "http://www.stelholdings.com",
        "full_time_employees": 3
    },
    "UNITEDTEA.NS": {
        "short_name": "UNITED NILGIRI TEA",
        "long_name": "The United Nilgiri Tea Estates Company Limited",
        "summary": "The United Nilgiri Tea Estates Company Limited engages in growing, manufacturing, and selling teas in India. The company offers black, special, green, herbal, and gift teas. It is also involved in letting-out of properties. The company also exports its products to Australia, Congo, Canada, Germany, the Netherlands, Denmark, Finland, Japan, the United States, and the United Kingdom. The United Nilgiri Tea Estates Company Limited was founded in 1922 and is based in Coimbatore, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Coimbatore",
        "zipcode": "641018",
        "website": "http://www.unitednilgiritea.com",
        "full_time_employees": 1029
    },
    "VENKEYS.NS": {
        "short_name": "VENKY'S (INDIA)",
        "long_name": "Venky's (India) Limited",
        "summary": "Venky's (India) Limited engages in the production and sale of poultry products in India. It operates through three segments: Poultry and Poultry Products, Animal Health Products, and Oilseed. The Poultry and Poultry Products segment produces and sells day old broiler and layer chicks, specific pathogen free eggs, processed chicken products, poultry feeds, and other miscellaneous poultry products. The Animal Health Products segment produces and sells medicines and other health products for birds. The Oilseed segment produces and sells edible refined soya oil and soya de-oiled cake. It also operates quick service restaurant under the Venky's XPRS name. The company was formerly known as Western Hatcheries Limited and changed its name to Venky's (India) Limited. The company was incorporated in 1976 and is based in Pune, India. Venky's (India) Limited is a subsidiary of Venkateshwara Hatcheries Private Limited.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411030",
        "website": "http://www.venkys.com",
        "full_time_employees": 5776
    }
}