{
    "ACE.NS": {
        "short_name": "ACTION CONSTRUCT",
        "long_name": "Action Construction Equipment Limited",
        "summary": "Action Construction Equipment Limited manufactures and sells material handling and construction equipment primarily in India. The company operates through four segments: Cranes, Construction Equipment, Material Handling, and Agri Equipment. It offers concrete placing booms, crawler cranes, wheel and chain dozers, forklift trucks, backhoes and wheeled loaders, pick and carry cranes, mobile tower cranes, piling rigs, motor graders, tower cranes, truck mounted cranes, vibratory rollers, and warehousing equipment; and agriculture equipment, such as tractors, harvesters, rotavators, etc., as well as other construction equipment. The company also rents tower cranes, motor graders, soil compacters, and tandem rollers. The company serves various infrastructure construction, power projects, ports and shipyards, dams, metro rail, roads, mining, steel industry, engineering industry, railways, cement, petroleum, defense, chemicals and fertilizer plants, warehousing, logistics, and building construction sectors. Action Construction Equipment Limited was founded in 1995 and is headquartered in Palwal, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Palwal",
        "zipcode": "121102",
        "website": "http://www.ace-cranes.com",
        "market_cap": "Small Cap"
    },
    "EIMCOELECO.NS": {
        "short_name": "EIMCO ELECON INDIA",
        "long_name": "Eimco Elecon (India) Limited",
        "summary": "Eimco Elecon (India) Limited manufactures and sells equipment for mining and construction sector in India. It offers side dump loaders, load haul dumpers, coal haulers, universal drill machines, articulated wheel loaders, foundation equipment, low profile dump trucks, rocker shovel loaders, and underground transport systems. The company also exports its products. Eimco Elecon (India) Limited was incorporated in 1974 and is headquartered in Vallabh Vidyanagar, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Vallabh Vidyanagar",
        "zipcode": "388120",
        "website": "http://eimcoelecon.in",
        "market_cap": "Small Cap"
    },
    "ESCORTS.NS": {
        "short_name": "ESCORTS",
        "long_name": "Escorts Limited",
        "summary": "Escorts Limited manufactures and sells agri machinery, construction equipment, and railway equipment in India and internationally. The company offers agricultural tractors under the Farmtrac, Powertrac, and Steeltrac brands; crop solutions; engines; spare parts; lubricants; and sprayers, harvesters, implements, planters, and gensets. It also provides construction, earth moving and material handling equipment, round and flat tubes, heating elements, double acting hydraulic shock absorbers for railways coaches, center buffer couplers, automobile shock absorbers, telescopic front fork and Mcpherson struts, brake blocks, internal combustion engines, and friction and rubber products, as well as various brake for use in railways. In addition, the company trades in oils and lubricants, implements, trailers, tractors, compressor accessories and spares, construction equipment, earth moving and material handling equipment. Further, it is involved in the aero business. Escorts Limited was founded in 1944 and is based in Faridabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Faridabad",
        "zipcode": "121003",
        "website": "http://www.escortsgroup.com",
        "market_cap": "Mid Cap"
    },
    "HMT.NS": {
        "short_name": "HMT LTD (INDIA)",
        "long_name": "HMT Limited",
        "summary": "HMT Limited manufactures and sells food processing machines in India and internationally. The company offers machine tools, including turning machines, grinding machines, gear manufacturing machines, machining centers, special application machines, die casting and plastic injection molding machines, precision ball screws, presses, CNC systems, and other GPMs. Its food processing machines comprise butter making and packing machines, plate heat exchangers, centrifugal pumps and separators, oil purification and clarification systems, and homogenizers. In addition, the company provides printing machinery, watches, tractors, and bearings. Further, the company offers various services, including refurbishing, testing and inspection services, precision tooling solutions, and project and consultancy services. HMT Limited was founded in 1949 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560032",
        "website": "http://www.hmtindia.com",
        "market_cap": "Small Cap"
    },
    "JISLDVREQS.NS": {
        "short_name": "JAIN IRRIGATION",
        "long_name": "Jain Irrigation Systems Limited",
        "summary": "Jain Irrigation Systems Limited operates as a micro-irrigation company in India, Europe, North America, and internationally. The company operates through Hi-Tech Agri Input Products, Plastic, Agro Processing, and Other Business divisions. It provides drip irrigation, sprinkler irrigation, PE piping, and plumbing systems; and polyvinyl chloride pipes and pipe fittings, and EX-CEL plastic sheets. The company also offers protected cultivation products, including greenhouses, poly houses and tunnels, and net houses; tissue culture plants for bananas, pomegranates, and strawberries; and solar photovoltaic modules, solar pumping systems and appliances, solar PV power plants, module mounting solutions, and water heating systems. In addition, it provides Jain Logic, a monitoring and control solution, as well as bio-fertilizers; and generates power through solar and biogas power plants. Further, the company is involved in the fruits, onion, vegetable, and spice processing activities; and operates vegetable and horticulture nurseries. Jain Irrigation Systems Limited was founded in 1963 and is headquartered in Jalgaon, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Jalgaon",
        "zipcode": "425001",
        "website": "http://www.jains.com",
        "market_cap": "Small Cap"
    },
    "JISLJALEQS.NS": {
        "short_name": "JAIN IRRIGATION",
        "long_name": "Jain Irrigation Systems Limited",
        "summary": "Jain Irrigation Systems Limited operates as a micro-irrigation company in India, Europe, North America, and internationally. The company operates through Hi-Tech Agri Input Products, Plastic, Agro Processing, and Other Business divisions. It provides drip irrigation, sprinkler irrigation, PE piping, and plumbing systems; and polyvinyl chloride pipes and pipe fittings, and EX-CEL plastic sheets. The company also offers protected cultivation products, including greenhouses, poly houses and tunnels, and net houses; tissue culture plants for bananas, pomegranates, and strawberries; and solar photovoltaic modules, solar pumping systems and appliances, solar PV power plants, module mounting solutions, and water heating systems. In addition, it provides Jain Logic, a monitoring and control solution, as well as bio-fertilizers; and generates power through solar and biogas power plants. Further, the company is involved in the fruits, onion, vegetable, and spice processing activities; and operates vegetable and horticulture nurseries. Jain Irrigation Systems Limited was founded in 1963 and is headquartered in Jalgaon, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Jalgaon",
        "zipcode": "425001",
        "website": "http://www.jains.com",
        "market_cap": "Small Cap"
    },
    "MAHEPC.NS": {
        "short_name": "Mahindra EPC Irrig Ltd",
        "long_name": "Mahindra EPC Irrigation Limited",
        "summary": "Mahindra EPC Irrigation Limited manufactures and sells micro irrigation systems in India. The company's drip irrigation products include online drip irrigation products, such as drippers and plain lateral products; inline drip irrigation products comprising non PC cylindrical inline, PC cylindrical inline, flat inline, PC flat inline, and thin wall flat inline products; and drip irrigation components consisting of hydrocylone, sand, screen, and disc filters, as well as header assemblies. Its sprinkler irrigation products comprise sprinkler heads, quick pipe coupling pipes, and rain guns; and pumps consist of bore well, monoblock, and open well submersible pumps. The company also offers HDPE pipes and pipe coils; and landscape and turf irrigation products comprising valves, nozzles, rotors, and spray bodies. In addition, it provides agronomy support, and crop and farm advisory services. Further, it offers automation products under Smartflo brand name and various pumps for agriculture and domestic use, as well as manufactures specialized pipes for water and gas distribution. The company was formerly known as EPC Industrie Limited and changed its name to Mahindra EPC Irrigation Limited in February 2019. Mahindra EPC Irrigation Limited was founded in 1981 and is based in Nashik, India. Mahindra EPC Irrigation Limited is a subsidiary of Mahindra and Mahindra Limited.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Nashik",
        "zipcode": "422010",
        "website": "http://www.epcmahindra.com",
        "market_cap": "Small Cap"
    },
    "REVATHI.NS": {
        "short_name": "REVATHI EQUIPMENT",
        "long_name": "Revathi Equipment Limited",
        "summary": "Revathi Equipment Limited manufactures and sells drilling equipment in India and internationally. The company offers blast hole drills for mining applications; jackless drills for construction and mining applications; water well drills; hydro-fracturing units; and exploratory drills. It provides spares and after sales services. The company was founded in 1977 and is based in Coimbatore, India. Revathi Equipment Limited is a subsidiary of Renaissance Advanced Consultancy Limited.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Coimbatore",
        "zipcode": "641050",
        "website": "http://www.revathi.in",
        "market_cap": "Small Cap"
    },
    "TIL.NS": {
        "short_name": "TIL",
        "long_name": "TIL Limited",
        "summary": "TIL Limited manufactures and markets a range of material handling, lifting, port, and road construction equipment in India and internationally. Its products include rough terrain cranes, truck and truck mounted cranes, pick and carry cranes, Manitowoc crawler cranes and grove cranes, reach stackers, forklift trucks, container handlers, crushing and screening stationary plant solutions, crushing and screening wheel mounted solutions, and crushing and screening track mounted solutions, as well as unit equipment, such as feeders, crushers, and high frequency screens. The company also deals in spares; and provides services to related equipment. TIL Limited was founded in 1944 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700024",
        "website": "http://www.tilindia.in",
        "market_cap": "Small Cap"
    },
    "VSTTILLERS.NS": {
        "short_name": "VST TILLERS TRACT",
        "long_name": "V.S.T. Tillers Tractors Limited",
        "summary": "V.S.T. Tillers Tractors Limited engages in the manufacture and trading of agriculture machinery primarily in India. The company provides power tillers, tractors, rice transplanters, power reapers, rotary tillers, attachments, and engines. It also offers diesel engine components, such as case covers, transmission and crank cases, camshafts, crank shafts, and connecting rods; and light engineering components comprising fuel pump clamps, balancer weights, hydraulic actuators, brake shoes and yokes, suspension links, and caliper levers. The company markets its products through a network of dealers and vendors. V.S.T. Tillers Tractors Limited also exports its products to Africa, Russia, and Myanmar; and component parts to the United Kingdom and Europe. The company was founded in 1967 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560048",
        "website": "http://www.vsttillers.com",
        "market_cap": "Small Cap"
    }
}