{
    "ANIKINDS.NS": {
        "short_name": "ANIK INDUSTRIES",
        "long_name": "Anik Industries Limited",
        "summary": "Anik Industries Limited trades in agri-commodities, edible oils, and coal in India and internationally. The company operates through Wind Power, Real Estate, and Others segments. It trades in and merchandises agri-commodities, such as cotton, oilseeds, grains, pulses, spices, and various agro based products; and offers integrated ferro alloys for use in steel making. The company also operates wind power projects located at Nagda Hills, Dewas in Madhya Pradesh and Jaisalmer in Rajasthan. In addition, it is involved in construction and development of housing projects and properties; the mining of natural resources and manganese; and the development of phosphate rock deposits. The company was formerly known as Madhya Pradesh Glychem Industries Limited and changed its name to Anik Industries Limited in September 2006. Anik Industries Limited was incorporated in 1976 and is based in Indore, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Indore",
        "zipcode": "452001",
        "website": "http://www.anikgroup.com",
        "market_cap": "Small Cap"
    },
    "FCONSUMER.NS": {
        "short_name": "FUTURE CONSUMER LT",
        "long_name": "Future Consumer Limited",
        "summary": "Future Consumer Limited engages in the sourcing, manufacture, branding, marketing, and distribution of fast-moving consumer goods (FCMG), and food and processed food products in India and internationally. The company offers branded packaged food products, including groceries, dairy products, beverages, bakery products, snacks and munch products, and other food products; home care products; and personal hygiene care products. It provides food products under the Desi Atta Company, Golden Harvest, Golden Harvest Premium, Karmiq, Ektaa, Mother Earth, Tasty Treat, Sunkist, Fresh & Pure, Sangi's Kitchen, Nilgiris, Veg Affaire, Terra, Sensiblr Portions, and Dreamery. The company offers home and personal care products under the CleanMate, CareMate, Pratha, Prim, Voom, Mysst, Think Skin, Kara, TS, and Swiss Tempelle brands. It also operates convenience stores in South India; and trades in fruits and vegetables. The company was formerly known as Future Consumer Enterprise Limited and changed its name to Future Consumer Limited in October 2016. Future Consumer Limited was incorporated in 1996 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400083",
        "website": "http://www.futureconsumer.in",
        "market_cap": "Large Cap"
    }
}