{
    "BANARBEADS.NS": {
        "short_name": "BANARAS BEADS LTD",
        "long_name": "Banaras Beads Limited",
        "summary": "Banaras Beads Limited manufactures and exports glass beads, necklaces, imitation jewelry, and other related products in India, the United States, South Africa, the United Kingdom, Ireland, Germany, Europe, the Middle East, and Africa. The company also offers beads made from clay, brass, aluminum, copper, resin, ceramics, horn, bone, semiprecious stones, agate, lac, hand painted beads, spray painted beads, etc.; and trades in leather and cotton wax cords, and miscellaneous handicraft products. It serves wholesalers and retailers, companies dealing in craft business, craft stores/large retail chain stores, and online business companies. Banaras Beads Limited was founded in 1940 and is headquartered in Varanasi, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Varanasi"
    },
    "BATAINDIA.NS": {
        "short_name": "BATA INDIA",
        "long_name": "Bata India Limited",
        "summary": "Bata India Limited manufactures and trades in footwear and accessories through its retail and wholesale network in India. The company offers footwear in the categories of women, men, and kids; and accessories, such as belts, clutches, handbags, masks, and shoe care products. It sells its products primarily under the Bata, Disney, Footin, Hush Puppies, Marie Claire, Naturalizer, North Star, Power, Scholl, CAT, Weinbrenner, and Bubblegummers brands. The company operates through approximately 1,558 retail stores, including franchisee stores. It also exports its products. The company was formerly known as Bata Shoe Company Private Limited and changed its name to Bata India Limited in 1973. The company was incorporated in 1931 and is based in Gurugram, India. Bata India Limited is a subsidiary of Bata (BN) B.V.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gurugram"
    },
    "BIL.NS": {
        "short_name": "BHARATIYA INTL LTD",
        "long_name": "Bhartiya International Limited",
        "summary": "Bhartiya International Limited manufactures and sells leather and textile products in India. It offers leather outerwear, bags and accessories, belts, wallets, and other small leather goods, as well as leather finishing services. The company also engages in the development of real estate and industrial parks. In addition, it exports its products. Bhartiya International Limited was founded in 1987 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gurugram"
    },
    "KHADIM.NS": {
        "short_name": "KHADIM INDIA LTD",
        "long_name": "Khadim India Limited",
        "summary": "Khadim India Limited manufactures, wholesales, and retails footwear primarily under the Khadim's brand. It also provides footwear and leather accessories for men, women, and children under the British Walkers, Lazard, Turk, Adrianna, Bonito, Pro, Softouch, Sharon, and Cleo brands. As of March 31, 2019, the company operated 799 Khadim's branded retail stores, as well as a network of 544 distributors selling to multi brand outlets in 23 states and 1 Union territory in India. It also exports its products. The company was formerly known as Khadim Chain Stores Limited and changed its name to Khadim India Limited in August 2005. Khadim India Limited was founded in 1981 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    },
    "LIBERTSHOE.NS": {
        "short_name": "LIBERTY SHOES",
        "long_name": "Liberty Shoes Limited",
        "summary": "Liberty Shoes Limited manufactures and trades in footwear, accessories, and lifestyle products in India and internationally. The company offers footwear products, such as casual, formal, sports, fashion, women, kids, and men footwear under the AHA, Coolers, Footfun, Force 10, Fortune, Gliders, Healers, Leap7X, Perfect, and Senorita brands. It operates through 100 distributors and 425 exclusive showrooms, as well as online. Liberty Shoes Limited was founded in 1954 and is headquartered in Karnal, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Karnal"
    },
    "MIRZAINT.NS": {
        "short_name": "MIRZA INTERNATIONA",
        "long_name": "Mirza International Limited",
        "summary": "Mirza International Limited manufactures and markets leather footwear and finished leather products in India and internationally. It operates through three segments: Tannery Division, Shoe Division, and Garments/Accessories Division. The company offers men's and women's footwear; and formal, semi-formal, and casual footwear. It also provides men's casual and semi-formal wear, including shirts, T-shirts, trousers, denims, sweaters, and jackets, as well as accessories, such as belts, socks, hankies, and wallets; and women's clothing. The company sells its products under the REDTAPE, REDTAPE Athleisure, Bond Street, Oaktrak, YEZDI, and MODE brands through multi-brand outlets, chain stores, exclusive brand outlets, and e-commerce platforms, as well as online stores. Mirza International Limited also exports its products. The company was formerly known as Mirza Tanners Limited. Mirza International Limited was founded in 1979 and is headquartered in Kanpur, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kanpur"
    },
    "RELAXO.NS": {
        "short_name": "RELAXO FOOTWEARS",
        "long_name": "Relaxo Footwears Limited",
        "summary": "Relaxo Footwears Limited manufactures and sells footwear for men, women, and children worldwide. It offers footwear, which includes slippers, canvas shoes, rubber flip flops, EVA injected flip flops, PVC DIP shoes, sport shoes, sandals, and PVC DIP casuals. The company operates a portfolio of brands, such as Relaxo, Bahamas, Flite, Sparx, and Schoolmate. It sells its products through distributors and retail stores; and e-commerce platforms. The company also exports its products. Relaxo Footwears Limited was founded in 1976 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "SAFARI.NS": {
        "short_name": "Safari Ind (India) Ltd",
        "long_name": "Safari Industries (India) Limited",
        "summary": "Safari Industries (India) Limited manufactures and markets luggage and luggage related accessories in India. Its products include hard, soft, lightweight, and TSA luggage bags; casual, laptop, and concept backpacks; rucksucks; and overnighters. It sells its products under the Safari, Magnum, Genius, and Genie brands through stores, as well as through online. Safari Industries (India) Limited was incorporated in 1980 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "SREEL.NS": {
        "short_name": "SREELEATHERS LTD",
        "long_name": "Sreeleathers Limited",
        "summary": "Sreeleathers Limited engages in the wholesale and retail of footwear, and leather goods and accessories in India. It offers formal, canvas, and casual, as well as school shoes; chappals; sandals; and accessories, such as belts, wallets, bags, socks, and jewelry and watch boxes for men, women, and kids, as well as disposable PPE kits and masks. Sreeleathers Limited sells its products through its online shopping website. The company was formerly known as CAT Financial Services Ltd and changed its name to Sreeleathers Limited in October 2010. Sreeleathers Limited was incorporated in 1991 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    },
    "VIPIND.NS": {
        "short_name": "VIP INDUSTRIES",
        "long_name": "VIP Industries Limited",
        "summary": "VIP Industries Limited manufactures and sells luggage bags and accessories in India. It offers hard and soft luggage, including ladies handbags, printed polycarbonate luggage products, soft uprights, vanity cases, hard suitcases, briefcases, trolleys, rucksacks, backpacks, duffel-bags, laptop bags, school bags, everyday travel accessories, and short haul products. The company provides its products primarily under the VIP, Caprese, Carlton, Skybags, Alfa, and Aristocrat brands. It exports its products to 31 international locations, including the United Arab Emirates, the United States, Qatar, Kuwait, and Sweden. VIP Industries Limited was incorporated in 1968 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    }
}