{
    "3IINFOTECH.NS": {
        "short_name": "3I INFOTECH LTD",
        "long_name": "3i Infotech Limited",
        "summary": "3i Infotech Limited provides IP based software solutions and information technology services in India and internationally. The company offers Kastle Universal Lending System, a centralized database and browser based application to integrate and streamline the loan processing cycle; Kastle Treasury, a treasury management solution; Kastle Core Banking that provides banking operations for commercial and consumer banking; Kastle Transaction Banking that enables cash and securities movement; Factor/SQL, a factoring software solution; Kastle Integrated Risk Management solution; AMLOCK, an anti-money laundering, and financial crime detection and management solution; Kastle Digital Banking solutions suite to cater the trends of banking and lending practices; and Kastle Business Intelligence, an enterprise analytics platform. It also provides general, life, and health insurance products under the PREMIA brands; PREMIA Blogs; PREMIA Pension; MFund Plus WMS, a wealth management platform technology solution; MFund Plus Suite, an investment/fund management solution; MFund Investor Services System; and PREMIA e-portal, an insurance-specific web portal solution. In addition, the company offers enterprise resource planning solutions, including ORION enterprise suite, a solution that provides industry-specific solutions; ORION financial management solution, which streamlines and unifies financial management process; ORION HRMS and payroll to enhance employee productivity and organizational efficiency; and ORION Mobile ERP, a mobile application to integrate various business processes and modules. Further, it provides customer relationship management and B2C solutions under ORION brand. It serves customers in banking, insurance, capital markets, asset and wealth management, government, manufacturing, retail, distribution, telecom, and healthcare industry verticals. The company was founded in 1993 and is headquartered in Navi Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Navi Mumbai",
        "zipcode": "400 703",
        "website": "http://www.3i-infotech.com",
        "market_cap": "Large Cap"
    },
    "543282.BO": {
        "short_name": "Niks Technology Ltd",
        "long_name": "Niks Technology Limited",
        "summary": "Niks Technology Limited, an IT solution services enabling company, provides software development and educational services in India and internationally. The company offers school, hospital, real estate, hotel, retail point of sale, and tour and travel management system software solutions, as well as provides pharmacy, gym, matrimonial, food ordering, inventory saloon, and bus reservation management software solutions. It also provides IT and IT security services; and digital marketing services, such as search engine optimization and marketing, content and Influencer marketing, content automation, campaign and e-commerce marketing, email direct marketing, pay per click, online reputation management, display advertising, e-books, optical disks and games, and other forms of digital media. In addition, the company offers online and offline courses, including ethical hacking and cyber security, embedded system and robotics, digital marketing, android application development, Internet of things, machine learning, artificial intelligence, data science , PLC-SCADA, web development, software development, programming language, server administrator, VLSI designing, networking, and software testing. Further, it provides web development services, such as website design, custom web design, responsive website design, SEO friendly web design, PHP design and application development, website hosting, e-commerce web design, website support and maintenance, and website redesigning; and mobile app development services. Niks Technology Limited was incorporated in 2014 and is headquartered in Patna, India.",
        "currency": null,
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "BSE",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Patna",
        "zipcode": "800020",
        "website": "http://www.nikstech.com",
        "market_cap": null
    },
    "ACCELYA.NS": {
        "short_name": "ACCELYA SOLUTIONS",
        "long_name": "Accelya Solutions India Limited",
        "summary": "Accelya Solutions India Limited, together with its subsidiaries, provides software solutions to the airline and travel industry in the Asia Pacific, the Middle East, Africa, the Americas, and Europe. It offers software products, managed processes, technology, and hosting services. The company also provides airline financial solutions, which include airline revenue accounting, airline payments management, airline cost and billing management, and airline revenue assurance solutions, as well as airline refund management, early warning system, and agency debit memo management solutions. In addition, it offers airline commercial solutions, such as revenue management, agency incentive management, CRM and loyalty management, and sales intelligence and analytics solutions; and BSP processing, simplified invoicing and settlement, and neutral fare proration engine solutions, as well as BSP Link, a distribution platform for the BSP community, which include agents, airline users, agent group users, GDS users, and third-party users. Further, the company provides air cargo solutions, such as offer and order management, warehouse management, revenue management, regulatory broker, service management, logistics, and analytics. Additionally, it offers implementation, analytics and consulting, business process re-engineering, and technology audit and analysis services. The company was founded in 1986 and is based in Pune, India. Accelya Solutions India Limited is a subsidiary of Accelya Holding World S.L.U.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411037",
        "website": "http://w3.accelya.com",
        "market_cap": "Large Cap"
    },
    "ADROITINFO.NS": {
        "short_name": "ADROIT INFOTECH LT",
        "long_name": "Adroit Infotech Limited",
        "summary": "Adroit Infotech Limited operates as a SAP consulting company in India and internationally. It offers a range of business solutions, including business and technology consulting, enterprise solutions, systems integration, custom application development, application maintenance and production support, infrastructure management, cloud ecosystem integration, product engineering and lifecycle solutions, business process management, and business platforms and solutions, as well as software products. The company was formerly known as Sphere Global Services Limited and changed its name to Adroit Infotech Limited in February 2018. Adroit Infotech Limited was incorporated in 1990 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500034",
        "website": "http://www.adroitinfotech.com",
        "market_cap": "Small Cap"
    },
    "ADSL.NS": {
        "short_name": "ALLIED DIGITAL SER",
        "long_name": "Allied Digital Services Limited",
        "summary": "Allied Digital Services Limited designs, develops, deploys, and delivers IT infrastructure management services in India and internationally. The company offers IT-as-a-Service, such as IT transformation consulting, IT optimization and modernization, and disaster recovery hosting services, as well as datacenter hosting, migration, and management; and infrastructure services, such as Infrastructure-as-a-Service, infrastructure management, managed security, and professional services. It also provides end user IT support services, including service desk management, remote device management, virtual desktop infrastructure, enterprise mobility management, desk-side support, and professional services; and IT asset lifecycle services comprising deployment, maintenance, and disposal services, as well as install, move, add, and change services. In addition, the company offers enterprise applications consisting of custom application development, product engineering, ERP and CRM development and support, and business monitoring and management services; helpdesk/service desk management and work order management system solutions; and integrated solutions, such as security command and control center, video surveillance, access control, IoT, and RFID and smart card integrated solutions. Further, it provides perimeter intrusion detection, fire alarm, building management, public address, baggage scanning/explosive detection, and toll plaza and highway traffic management systems; and dispatch and depot services, including installation, datacenter smart hand, VOIP/PBX, datacenter transformation, maintenance and warranty, end user device, site survey, and satellite AV services. The company offers its services in 35 countries across 5 continents. Allied Digital Services Limited was incorporated in 1995 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.allieddigital.net",
        "market_cap": "Mid Cap"
    },
    "AIRAN.NS": {
        "short_name": "AIRAN LTD",
        "long_name": "Airan Limited",
        "summary": "Airan Limited, together with its subsidiaries, provides consulting, technology, outsourcing, and digital and software services in India. It offers information technology (IT) and IT-enabled services, including banking transaction processing services and document management services for telecommunication companies, internet services providers, and payment banks. The company offers cash management, door step banking and pickup, CTS clearing processing, bank account opening forms processing, e-stamping certificate/e-registration fee collection, records management, address and credit verification, contact center, back office management, and software development services, as well as manages collection counters. It provides its services for banking, telecom, software development, field operations, and back-office and front-office management sectors. Airan Limited was founded in 1989 and is headquartered in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380006",
        "website": "http://www.airanlimited.in",
        "market_cap": "Mid Cap"
    },
    "ALANKIT.NS": {
        "short_name": "ALANKIT LIMITED",
        "long_name": "Alankit Limited",
        "summary": "Alankit Limited provides in e-governance services and products in India. The company accepts permanent account number (PAN) card applications; change in PAN particulars applications; and e-TDS/e-TCS/AIR/e-TBAF returns in electronic mode from corporate and non-corporate assesses, as well as digitizes paper returns filed with income tax department. The company is also involved in the resident enrolment, uploading of details, correction/ updation in Aadhaar, a unique identification number; and development of National Skills Registry, a fact sheet of credible, permanent and accessible information about each registered person. In addition, it offers GST Suvidha Provider, an end to end goods and services tax (GST) compliance solution provider; manpower consultancy services; business correspondent services; National InsuranceÂ\u0096Policy Repository services to store insurance policies electronically; GST Billing Software that creates e-way bills, tax invoices, quotes, and others; online GST registration services; kiosk banking services; and PAN card correction services, as well as provides services to apply for new and duplicate PAN card. Further, the company engages in the distribution of card printers and accessories; and implementation and management of Paper to Follow Process for the cheque truncation system. Additionally, it operates Atal Pension Yojana to encourage people to save small amounts during their productive years, which will enable them to draw pension in the old age; and Recordxpert.com, a web-based health and wellness portal for scanning and digitization of medical records. The company was formerly known as Euro Finmart Limited and changed its name to Alankit Limited in September 2014. Alankit Limited was incorporated in 1989 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110055",
        "website": "http://www.alankit.in",
        "market_cap": "Mid Cap"
    },
    "BARTRONICS.NS": {
        "short_name": "BARTRONICS INDIA L",
        "long_name": "Bartronics India Limited",
        "summary": "Bartronics India Limited provides automatic identification and data capture solutions in India and internationally. The company offers smart cards, including memory, crypto memory, GSM, contactless, biometric, and national cards; radio frequency identification equipment; enterprise mobility solutions; and e-government solutions, such as financial inclusion, public distribution, and pilgrim management systems, as well as health insurance projects, and smart card based driving license and vehicle registration. It also provides track and trace solutions, such as MRO tools, weapon, vehicle, surgical set, patient, and document tracking, as well as infant protection/monitoring and animal identification technology solutions; warehouse and fleet management systems; inventory and asset, library, visitor, contract labor, and pilgrim management solutions; and time and attendance, and access control systems. In addition, the company offers application development services; application management services, such as application modernization, application operation and support, middleware support, and database; enterprise solutions, including enterprise resource planning, enterprise application integration, business process management, business intelligence, services oriented architecture, enterprise portal and content management, and enterprise mobility; IT infrastructure management services, such as data center, end user computing, enterprise network and security, remote infrastructure management, and IT service desk; and strategic sourcing services. It serves banking and financial services, education, government, health care, law enforcement and public safety, manufacturing, telecom, transport and logistics, and aerospace industries. The company was formerly known as Super Bartronics Limited and changed its name to Bartronics India Limited in January 1996. Bartronics India Limited was incorporated in 1990 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500033",
        "website": "http://www.bartronics.com",
        "market_cap": "Small Cap"
    },
    "BSOFT.NS": {
        "short_name": "BIRLASOFT (INDIA)",
        "long_name": "Birlasoft Limited",
        "summary": "Birlasoft Limited provides enterprise digital IT services in the United States, the United Kingdom and rest of Europe, and internationally. It offers digital transformation services, including data analytics, connected products, intelligent automation, cloud, transformation, and blockchain services; and enterprise technologies and services in the areas of Oracle and JD Edwards, SAP, Infor, Microsoft, customer relationship management, manufacturing execution systems, product lifecycle management, supply chain management, IT transformation, applications management, testing, and infrastructure and cloud technology. The company also offers solutions, such as intelliOpen, an intelligent system for contactless screening of people, social distancing monitoring, and contact tracing; intelliAsset, a platform for asset visualization, analytics, and actions; TruView CLM, a cloud based contract lifecycle management solution; TruServ FSM, a cloud based touchless automation solution for field services; TruLens, a tool that provides insights into the existing Salesforce implementation; iLink, a solution for the integration of PLM applications and ERP systems; Supplier Risk Radar, an AI-powered preventive risk mitigation solution in the areas of supply chains; Akoya, an engineering analytics solution; Producer Workspace, an insurance brokerage solution; Submission Automation, an insurance broker submission solution; and ZeROTechDebt, a solution that provides structured framework for capturing and analyzing IT asset information. It serves automotive, banking, high tech, manufacturing, insurance, media and entertainment, energy and resources, life sciences and healthcare, and utility industries, as well as capital markets. The company has a strategic cloud alliance partnership with Microsoft Corporation. Birlasoft Limited was incorporated in 1990 and is based in Pune, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411057",
        "website": "http://www.birlasoft.com",
        "market_cap": "Large Cap"
    },
    "CIGNITITEC.NS": {
        "short_name": "CIGNITI TECHNOLOGI",
        "long_name": "Cigniti Technologies Limited",
        "summary": "Cigniti Technologies Limited provides software testing services worldwide. It offers quality assurance services, such as test automation, security testing, regression testing, performance testing, mobile testing, functional testing, crowdsourced testing, and compatibility testing. The company also provides quality engineering services, including agile testing, DevOps testing, service virtualization, and test data management; and digital assurance services comprising robotic process automation, medical device testing, ERP testing, big data and analytics testing, and digital assurance and testing; and test advisory and transformation services, as well as artificial intelligence testing, Internet of Things testing, and blockchain testing services. It serves the airlines, banking, communications, energy and utilities, financial services, healthcare and life sciences, insurance, logistics, manufacturing, media and entertainment, retail and ecommerce, and travel and hospitality industries. The company was formerly known as Chakkilam Infotech Limited. Cigniti Technologies Limited was incorporated in 1998 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500082",
        "website": "http://www.cigniti.com",
        "market_cap": "Large Cap"
    },
    "COFORGE.NS": {
        "short_name": "COFORGE LIMITED",
        "long_name": "COFORGE Limited",
        "summary": "COFORGE Limited provides information technology (IT) and IT enabled Services in Americas, India, Europe, the Middle East and Africa, and the Asia Pacific. The company offers Tron intelligent automation services, including business process automation, IT operations automation, robotic process automation, development automation, and cognitive services; and business process services, such as back office operations, contact center operations, KPO, process re-engineering, consulting, and automation. It also provides cyber security services comprising security controls and technology management, threat and vulnerability management, and security crisis and incident response services; data and analytics services that include machine learning, data management, data modernization, and data monetization services; and digital process transformation services. In addition, the company offers infrastructure management services, which comprise data center, DevOps and automation, digital workplace, IT operations management, and services management services; and digital services, including digital experience and integration services. Further, it provides application services, such as application management, quality engineering, business agility and simplification, and salesforce services; and cloud services comprising cloud advisory, migration, operation, management, security, and testing services, as well as CloudPixy, a multi-cloud provisioning and orchestration solution. The company serves the travel and transportation, insurance, banking and financial services, enterprise services, manufacturing, media, and other industries. The company was formerly known as NIIT Technologies Limited and changed its name to COFORGE Limited in August 2020. COFORGE Limited was incorporated in 1992 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110019",
        "website": "http://www.coforgetech.com",
        "market_cap": "Large Cap"
    },
    "CTE.NS": {
        "short_name": "CAMBRIDGE TECH ENT",
        "long_name": "Cambridge Technology Enterprises Limited",
        "summary": "Cambridge Technology Enterprises Limited, a business and technology services company, provides service oriented architecture-based enterprise transformation and integration solutions, and services in India, the United States, Qatar, and the Philippines. The company offers artificial intelligence (AI) services, including AI advisory, AI solutions, and AI as a Service; and big data services, such as data potential, warehouse, analytics and visualization, and value services. It also provides cloud services comprising cloud strategy, transformation and migration, and Software as a Service, as well as managed services; and application services that include application development, migration and transformation, management, application testing, and enterprise mobility. In addition, the company offers DevOps services, which comprise DevOps advisory, implementation, and support; and identity access and management (IAM) consulting solutions, including IAM strategy, implementation, and managed services. Further, it provides infrastructure management services, such as IaaS and PaaS solutions, database and middleware management services, and operating system management. The company serves the midsize market enterprises and the midsize units of Global 2000 enterprises across a range of industries. Cambridge Technology Enterprises Limited was founded in 1999 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500081",
        "website": "http://www.ctepl.com",
        "market_cap": "Small Cap"
    },
    "CYBERTECH.NS": {
        "short_name": "CYBERTECH SYSTEMS",
        "long_name": "CyberTech Systems and Software Limited",
        "summary": "CyberTech Systems and Software Limited, together with its subsidiaries, provides information technology solutions to the government, education, utilities, public safety and homeland defense, technology, telecom, retail, healthcare, and manufacturing industries in India and the United States. The company offers GeoShield, a public safety solution; and GeoCivic. It also provides Spatialitics Health, a spatial analytics; and Spatialitics Utilities, a spatial analytics suite using SAP business suite or SAP S/4HANA. In addition, the company offers CyberSupport, an on demand IT support platform; and CyberServe, a healthcare analytics platform for population health. Further, it provides SAP S/4HANA, SAP cloud and analytics, SAP spatial enablement, digital supply chain, Spatial apps on SAP HANA, intelligent asset management, and geodata management services. The company was founded in 1990 and is based in Thane, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Thane",
        "zipcode": "400604",
        "website": "http://www.cybertech.com",
        "market_cap": "Mid Cap"
    },
    "DATAMATICS.NS": {
        "short_name": "DATAMATICS GLOBAL",
        "long_name": "Datamatics Global Services Limited",
        "summary": "Datamatics Global Services Limited provides consulting and advisory, information technology, business process management, engineering, and big data and analytic solutions in the United States, Europe, and internationally. The company operates through IT Services and Business Process Management segments. It offers TruBot for robotic process automation; TruCap+ for intelligent data capture; iPM for end-to-end workflow management; TruBI for business intelligence and data visualization; TruFare for automated fare collection; Trade Finance, a solution that automates trade lifecycle; True Test for test automation; and TrueAI, a text analytics and pattern detection platform. The company serves banking and finance, publishing, healthcare, transportation, insurance, manufacturing and logistics, travel and hospitality, retail and e-commerce, market research, education technology, and international organizations. It has a strategic partnership with BizXL Solutions to offer end-to-end digital transformation and lean automation capability to enterprises in North America. The company was formerly known as Datamatics Technologies Limited and changed its name to Datamatics Global Services Limited in January 2009. The company was founded in 1975 and is based in Mumbai, India. Datamatics Global Services Limited is a subsidiary of Delta Infosolutions Private Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400093",
        "website": "http://www.datamatics.com",
        "market_cap": "Mid Cap"
    },
    "DIGISPICE.NS": {
        "short_name": "DIGISPICE TECHNOLOGIES LT",
        "long_name": "DiGiSPICE Technologies Limited",
        "summary": "DiGiSPICE Technologies Limited operates as an information and communication technology company in India and internationally. It operates through two segments, Digital Technology Services and Financial Technology Services. The company provides value added and mobile content services to the telecom operators, as well as develops and sells telecom related software. It offers Horizon, an enabling platform for network operators, and acts as a gateway for their content and service partners; Mziiki, a music app and mobisite that provides African music experience; CNema, a video on demand mobile app; My Studio, a music service app; and NextGen CRBT platform for 4G and LTE networks that helps to provide video RBT, HD Audio RBT, Live Streaming RBT, and Social RBT to end users. The company also provides UNIGOV, a digital government solution, which offers citizen-centric services; Spice Money, a merchant-only mobile wallet; and DiGiMoney, a mobile wallet. In addition, it offers robotic process automation solutions; pView, an enterprise platform, which simplifies operations by capturing, processing, and reporting data; Cognitive Engagement Platform for telecom operators; and DiGi Identifier, an AI driven remote biometric digital authentication on boarding technology platform that helps enterprises speed up customer on-boarding through automated document collection, authentication, and verification process. The company was formerly known as Spice Mobility Limited and changed its name to DiGiSPICE Technologies Limited in August 2019. DiGiSPICE Technologies Limited was incorporated in 1986 and is based in Noida, India. DiGiSPICE Technologies Limited is a subsidiary of Spice Connect Private Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201301",
        "website": "http://www.digispice.com",
        "market_cap": "Large Cap"
    },
    "DRCSYSTEMS.NS": {
        "short_name": "DRC Systems India Limited",
        "long_name": "DRC Systems India Limited",
        "summary": "DRC Systems India Limited, a software development company, offers IT business solutions worldwide. It provides consultancy and discovery workshop services, and dedicated developers; UI/UX, wireframe, and frontend design services; web, mobile app, development content management system, digital commerce/e-commerce, and eLearning services; blockchain, big data, engineering, and IOT services; and cyber security, manual testing, automation testing, and performance testing services. It also offers DevOps and cloud, salesforce, and support and maintenance services; data analytics, and AI & automation transformation services; and enterprise resource planning, enterprise, digital marketing, and digital process automation solutions. The company was founded in 2012 and is based in Gandhinagar, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gandhinagar",
        "zipcode": "382355",
        "website": "http://www.drcsystems.com",
        "market_cap": "Small Cap"
    },
    "DSSL.NS": {
        "short_name": "DYNACONS SYS SOLUT",
        "long_name": "Dynacons Systems & Solutions Limited",
        "summary": "Dynacons Systems & Solutions Limited operates as an IT solutions provider in India. It offers system integration services, such as architecture, integration, and management of custom application and information infrastructures; and datacenter solutions, comprising hyper converged infrastructure, server virtualization, software defined storage, enterprise backup and recovery solutions, data replication, DR automation, power and cooling, fire and safety, electrical and civil works, and physical access control solutions. The company also provides workplace solutions consisting of design and develop mobility strategies, BYOD implementation integration and migration, monitoring management and end user support, MS infra management tools, IT asset management services, secure virtual desktop, print services, unified communication, and workforce optimization; and network monitoring and management solutions comprising network monitoring of bandwidth utilization, network errors/collisions, network troubleshooting, day-to-day network operations, network performance monitoring, and tuning network operating systems. In addition, it offers project management and execution solutions; and managed services, such as data center and network management, service desk, managed security, cloud, infrastructure management, IT staff augmentation, and vendor management services. It serves BFSI, healthcare/pharmaceuticals, and other enterprises, as well as governments and PSUs. Dynacons Systems & Solutions Limited was founded in 1995 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400057",
        "website": "http://www.dynacons.com",
        "market_cap": "Small Cap"
    },
    "ECLERX.NS": {
        "short_name": "ECLERX SERVICES",
        "long_name": "eClerx Services Limited",
        "summary": "eClerx Services Limited provides data management, analytics, and process outsourcing services in the United States, the United Kingdom, Europe, and the Asia Pacific. The company offers customer experience solutions for business process optimization and customer interaction monitoring; field technical operations services for avoidable truck roll, dispatch services, connected homes, return merchandise authorization, and revenue assurance; omnichannel customer support services; advanced and digital analytics, and enterprise business intelligence solutions; and robotic process automation, Q-clips, workforce manager solutions, as well as chatbots and QA testing with test assure. It also provides digital solutions, such as A/B testing and optimization, campaign operations, computer generated imagery, creative services, data management, digital analytics, digital asset management, forecasting solutions, intelligent automation, personalization, pricing and competitive intelligence, replatforming, search engine optimization, social media services, tag management, and Website search optimization. In addition, the company offers derivative trade support, cash securities operations, regulatory compliance and data, document management, and analytics solutions, as well as technology products. It serves financial services, cable and telecommunications, retail, fashion, media and entertainment, manufacturing, travel and leisure, software, and high-tech industries. The company was founded in 2000 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.eclerx.com",
        "market_cap": "Large Cap"
    },
    "EXPLEOSOL.NS": {
        "short_name": "EXPLEO SOLUTIONS",
        "long_name": "Expleo Solutions Limited",
        "summary": "Expleo Solutions Limited, together with its subsidiaries, primarily provides software validation and verification services worldwide. The company offers consultancy services, such as business agility, digital business, and transformation delivery; engineering services, including design, production, and in-service support; quality engineering, testing, and management services; and training services. It serves aeronautics, automotive, banking and financial services, energy and utilities, gaming, industrial, public sector, telecoms and media, space and defense, insurance, rail transportation, healthcare and pharmaceutical, naval, and retail and logistics industries. The company was formerly known as SQS India BFSI Limited and changed its name to Expleo Solutions Limited in April 2019. Expleo Solutions Limited was founded in 1993 and is based in Chennai, India. SQS India BFSI Limited is a subsidiary of Expleo Technology Germany GmbH.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600096",
        "website": "http://expleogroup.com/expleo-solutions",
        "market_cap": "Mid Cap"
    },
    "FCSSOFT.NS": {
        "short_name": "FCS SOFTWARE SOLUT",
        "long_name": "FCS Software Solutions Limited",
        "summary": "FCS Software Solutions Limited engages in the provision of software development and marketing, and support services to corporate business entities in the BPO, software development, and e-learning service sector in India and the United States. The company offers IT consulting services, including application development and maintenance, portals, mobile apps, product development, SaaS, open source platforms and applications, predictive data sciences, big data analytics, and automation services; IT infra management services, such as colocation data centers, virtualization, system and networks support, plug and play infrastructure provisioning, WAN, IP based voice, and cyber security; and IT enabled services comprising multilingual helpdesk for technical and user support, business process outsourcing, and surveys, as well as learning solutions, such as content aggregation, learning management systems, portals, and assessments. It also provides consulting; and incubator services for startups. FCS Software Solutions Limited was incorporated in 1993 and is based in Noida, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201305",
        "website": "http://www.fcsltd.com",
        "market_cap": "Mid Cap"
    },
    "FSL.NS": {
        "short_name": "FIRSTSOURCE SOLUTI",
        "long_name": "Firstsource Solutions Limited",
        "summary": "Firstsource Solutions Limited provides customized business process management services in India, the United States, the United Kingdom, the Philippines, and internationally. The company offers various services across the customer lifecycle, Including acquisition, account servicing, collection, and retentions; sales ledger administration and collection, cash management and administration, payroll, VAT, and tax management services; credit and bank cards, private label retail cards, automotive and personal loans, overdraft accounts, and mortgage collection services; healthcare collection services; and default management, prevention, and recovery solutions. It also provides contact center and back-office processing services; claims processing and adjudication, digital mailroom and document, enterprise claim, Omni channel contact center, provider data management and credentialing, quality assurance, and telehealth support services, as well as member enrollment, billing, and eligibility services; and MedAssist, a revenue cycle product suite to enhance the revenue for hospitals and patient experience. In addition, the company manages claims handling transactions, including claims management, adjudication, remediation, and fulfillment; origination, home equity, routine and default servicing, title, and closing and escrow underwriting services; invoice factoring and discounting, payroll finance, debtor protection, deal management and pay-outs, cash allocation, sales ledger management, account servicing, complaints handling, credit control, and payment recovery; and business process consulting services. It serves the banking and financial services, healthcare, telecom and media, insurance, mortgage, and utilities sectors. The company was formerly known as ICICI Onesource Limited and changed its name to Firstsource Solutions Limited in 2006. The company was founded in 2001 and is based in Mumbai, India. Firstsource Solutions Limited is a subsidiary of CESC Ventures Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400064",
        "website": "http://www.firstsource.com",
        "market_cap": "Large Cap"
    },
    "GSS.NS": {
        "short_name": "GSS INFOTECH LTD",
        "long_name": "GSS Infotech Limited",
        "summary": "GSS Infotech Limited provides information technology (IT) services and solutions in India, Bangladesh, and the United States. The company provides consulting services in the areas of digital transformation, professional, application management, and managed services. It also offers applied intelligence solutions, such as artificial intelligence, data science and machine learning, Internet of Things, and automation; enterprise security solutions, including digital identity governance, application security, and cyber security services; cloud infrastructure, cloud migration, and hybrid cloud management services; and remote infrastructure management services. In addition, the company offers TruVu, a data visualization and simplification platform; UniDesk, a cloud based managed service desk; and ibStream, a mobile marketing solution, as well as IT service support management tools, including enterprise identity and data management, unified cloud platform (UCP), and UCP Software Interfaces. It serves government, telecom, cloud, and healthcare sectors, as well as small, medium, and large businesses. The company was formerly known as GSS America Infotech Limited and changed its name to GSS Infotech Limited in March 2011. GSS Infotech Limited was founded in 1999 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500081",
        "website": "http://www.gssinfotech.com",
        "market_cap": "Small Cap"
    },
    "HAPPSTMNDS.NS": {
        "short_name": "Happiest Minds Techno Ltd",
        "long_name": "Happiest Minds Technologies Limited",
        "summary": "Happiest Minds Technologies Limited offers IT solutions and services in India, the United States, Canada, the United Kingdom, Australia, the Netherlands, and the Middle East. The company operates through three segments: Infrastructure Management & Security Services (IMSS); Digital Business Solutions (DBS); and Product Engineering Services (PES). The IMSS segment provides security services, including cyber and infrastructure security, governance, risk and compliance, data privacy and security, identity and access management, and threat and vulnerability management; and infrastructure services comprises of DC and hybrid cloud services, workspace services, service automation, database and middleware services, and software defined infrastructure services. The DBS segment offers enterprise applications and customized solutions, comprising of advisory, design and architecture, custom-app development, package implementation, and testing and on-going support services to IT initiatives. The PES segment assists software product companies in building products and services that integrates mobile, cloud, and social technologies. It also provides Internet of Things (IoT) solutions, consisting of digital strategy creation consultation, device/edge/platform engineering, end-to-end system integration on IoT platforms, IoT security and managed services, implementation of IoT roadmap, derivation of insights from connecting assets, connecting manufacturing, and supply chain. In addition, the company offers analytics/artificial intelligence solutions, including implementation of advanced analytics using artificial intelligence, machine learning and statistical models, and engineering big data platforms; and digital process automation solutions, such as robotic process automation, intelligent business process management, and cognitive automation using AI and machine learning based models. Happiest Minds Technologies Limited was founded in 2011 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560 068",
        "website": "http://www.happiestminds.com",
        "market_cap": "Large Cap"
    },
    "HCLTECH.NS": {
        "short_name": "HCL TECHNOLOGIES",
        "long_name": "HCL Technologies Limited",
        "summary": "HCL Technologies Limited offers software development, business process outsourcing, and infrastructure management services worldwide. It provides application development and maintenance services; SAP landscape transformation, system conversion, and implementation services; Microsoft customer relationship management services; Oracle business consulting, implementation, upgrade, managed, and migration services; and quality assurance and testing services, as well as autonomics and orchestration services, products, and platforms. The company also offers data center, workplace, network, mainframe, and service integration and management services. In addition, it provides embedded, software, digital, mechanical, and system and hardware engineering services, as well as product lifecycle management, product testing, and VLSI design services. Further, the company offers supply chain management, finance and accounting, digital and content, and automation services. It serves financial services, consumer services, life science and healthcare, manufacturing, and public services industries. HCL Technologies Limited has a strategic alliance with Alteryx, Inc. to enhance analytics automation and digital transformation for Global 2000 enterprises. The company was founded in 1976 and is headquartered in Noida, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201304",
        "website": "http://www.hcltech.com",
        "market_cap": "Large Cap"
    },
    "HOVS.NS": {
        "short_name": "HOV SERVICES LTD",
        "long_name": "HOV Services Limited",
        "summary": "HOV Services Limited, together with its subsidiaries, provides software and information technology enabled services in India and internationally. It offers software development, maintenance, and support services; BPO services; and data entry services. The company was founded in 1989 and is headquartered in Pune, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411037",
        "website": "http://www.hovsltd.com",
        "market_cap": "Small Cap"
    },
    "INFY.NS": {
        "short_name": "INFOSYS LTD",
        "long_name": "Infosys Limited",
        "summary": "Infosys Limited, together with its subsidiaries, provides consulting, technology, outsourcing, and next-generation digital services in North America, Europe, India, and internationally. It provides application development and management, independent validation, product engineering and management, infrastructure management, enterprise application management, and support and integration services. The company's products and platforms include Finacle, a core banking solution; Edge suite of products; Infosys Nia, an artificial intelligence platform; Infosys McCamish - an insurance platform; Wingspan, a customizable learning platform; Stater mortgage servicing platform; Panaya automation suite; and Skava, an e-commerce suite. The company serves clients in the financial services and insurance, life sciences and healthcare, manufacturing, retail, consumer packaged goods and logistics, hi-tech, communications, telecom OEM, media, energy, utilities, resources, services, and other industries. Infosys has strategic partnership with Rolls-Royce for aerospace engineering. The company was formerly known as Infosys Technologies Limited and changed its name to Infosys Limited in June 2011. Infosys Limited was founded in 1981 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560100",
        "website": "http://www.infosys.com",
        "market_cap": "Large Cap"
    },
    "INFY": {
        "short_name": "Infosys Limited",
        "long_name": "Infosys Limited",
        "summary": "Infosys Limited, together with its subsidiaries, provides consulting, technology, outsourcing, and next-generation digital services in North America, Europe, India, and internationally. It provides application development and management, independent validation, product engineering and management, infrastructure management, enterprise application management, and support and integration services. The company's products and platforms include Finacle, a core banking solution; Edge suite of products; Infosys Nia, an artificial intelligence platform; Infosys McCamish - an insurance platform; Wingspan, a customizable learning platform; Stater mortgage servicing platform; Panaya automation suite; and Skava, an e-commerce suite. The company serves clients in the financial services and insurance, life sciences and healthcare, manufacturing, retail, consumer packaged goods and logistics, hi-tech, communications, telecom OEM, media, energy, utilities, resources, services, and other industries. Infosys has strategic partnership with Rolls-Royce for aerospace engineering. The company was formerly known as Infosys Technologies Limited and changed its name to Infosys Limited in June 2011. Infosys Limited was founded in 1981 and is headquartered in Bengaluru, India.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560100",
        "website": "http://www.infosys.com",
        "market_cap": "Large Cap"
    },
    "INFYN.MX": {
        "short_name": "INFOSYS LTD",
        "long_name": "Infosys Limited",
        "summary": "Infosys Limited, together with its subsidiaries, provides consulting, technology, outsourcing, and next-generation digital services in North America, Europe, India, and internationally. It provides application development and management, independent validation, product engineering and management, infrastructure management, enterprise application management, and support and integration services. The company's products and platforms include Finacle, a core banking solution; Edge suite of products; Infosys Nia, an artificial intelligence platform; Infosys McCamish - an insurance platform; Wingspan, a customizable learning platform; Stater mortgage servicing platform; Panaya automation suite; and Skava, an e-commerce suite. The company serves clients in the financial services and insurance, life sciences and healthcare, manufacturing, retail, consumer packaged goods and logistics, hi-tech, communications, telecom OEM, media, energy, utilities, resources, services, and other industries. Infosys has strategic partnership with Rolls-Royce for aerospace engineering. The company was formerly known as Infosys Technologies Limited and changed its name to Infosys Limited in June 2011. Infosys Limited was founded in 1981 and is headquartered in Bengaluru, India.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560100",
        "website": "http://www.infosys.com",
        "market_cap": null
    },
    "INSPIRISYS.NS": {
        "short_name": "INSPIRISYS SOLUTIO",
        "long_name": "Inspirisys Solutions Limited",
        "summary": "Inspirisys Solutions Limited operates as an information technology services and consulting company in India and internationally. The company provides endpoint, network, application, data, and mobile security services; and risk and compliance, malware defense, and consulting services. It also offers cloud solutions, including infrastructure as a service, platform as a service, application services, and management services; and Internet of Things (IoT) solutions, such as research and development (R&D) services, IoT system integration, outsourced support of IoT system development, custom IoT solution design and development, support of IoT applications/systems, and digital transformation services. In addition, the company provides infrastructure solutions comprising data center, network, workplace transformation, tools and services automation, managed services, staff augmentation services, and digital kiosk, as well as audit, consulting, and professional services. Further, it offers product engineering and development solutions, such as banking solutions, payment suite for government, business intelligence solutions, artificial intelligence solutions, robotic process automation solutions, multi-function banking kiosks, and application development and maintenance services. Additionally, the company offers warranty management services, including onsite warranty support, return to bench, repairs and refurbishments, logistics, customized CRM software solution, extended warranty program, data recovery, and warehouse support services. It serves BFSI, telecom, government/PSU, manufacturing, and healthcare industries. The company was formerly known as Accel Frontline Limited and changed its name to Inspirisys Solutions Limited in September 2018. The company was founded in 1991 and is based in Chennai, India. Inspirisys Solutions Limited is a subsidiary of CAC Holdings Corporation.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600010",
        "website": "http://www.inspirisys.com",
        "market_cap": "Small Cap"
    },
    "INTELLECT.NS": {
        "short_name": "INTELLECT DESIGN A",
        "long_name": "Intellect Design Arena Limited",
        "summary": "Intellect Design Arena Limited provides software development and related services for banking, insurance, and other financial services in India and internationally. The company offers platforms and products, such as iGTB, a digital transaction banking platform that provides digital payment, liquidity, supply chain finance, and trade products; iGCB, a full-spectrum suite of consumer banking products comprising digital core, digital lending, digital wealth, and quantum central banking; iRTM, a risk, treasury, and markets platform that supports straight-through processing (STP) and various asset classes over a configurable and scalable platform; Intellect SEEC, an insurance solution; and Intellect Wealth Qube, a digital wealth management solution with STP from front and mid to back office for private and commercial banks, wealth and asset management firms, advisory firms, brokers/dealers, trusts, and IFAs to service various client segments. It also develops, sells, and licenses products, as well as implements customization support based on the contracts with its customers. The company was formerly known as Fin Tech Grid Limited. Intellect Design Arena Limited was incorporated in 2011 and is headquartered in Chennai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600130",
        "website": "http://www.intellectdesign.com",
        "market_cap": "Large Cap"
    },
    "IOY.F": {
        "short_name": "INFOSYS LTD. ADR/1 IR5",
        "long_name": "Infosys Limited",
        "summary": "Infosys Limited, together with its subsidiaries, provides consulting, technology, outsourcing, and next-generation digital services in North America, Europe, India, and internationally. It provides application development and management, independent validation, product engineering and management, infrastructure management, enterprise application management, and support and integration services. The company's products and platforms include Finacle, a core banking solution; Edge suite of products; Infosys Nia, an artificial intelligence platform; Infosys McCamish - an insurance platform; Wingspan, a customizable learning platform; Stater mortgage servicing platform; Panaya automation suite; and Skava, an e-commerce suite. The company serves clients in the financial services and insurance, life sciences and healthcare, manufacturing, retail, consumer packaged goods and logistics, hi-tech, communications, telecom OEM, media, energy, utilities, resources, services, and other industries. Infosys has strategic partnership with Rolls-Royce for aerospace engineering. The company was formerly known as Infosys Technologies Limited and changed its name to Infosys Limited in June 2011. Infosys Limited was founded in 1981 and is headquartered in Bengaluru, India.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560100",
        "website": "http://www.infosys.com",
        "market_cap": "Large Cap"
    },
    "IOY.VI": {
        "short_name": "INFOSYS LTD-SP ADR",
        "long_name": "Infosys Limited",
        "summary": "Infosys Limited, together with its subsidiaries, provides consulting, technology, outsourcing, and next-generation digital services in North America, Europe, India, and internationally. It provides application development and management, independent validation, product engineering and management, infrastructure management, enterprise application management, and support and integration services. The company's products and platforms include Finacle, a core banking solution; Edge suite of products; Infosys Nia, an artificial intelligence platform; Infosys McCamish - an insurance platform; Wingspan, a customizable learning platform; Stater mortgage servicing platform; Panaya automation suite; and Skava, an e-commerce suite. The company serves clients in the financial services and insurance, life sciences and healthcare, manufacturing, retail, consumer packaged goods and logistics, hi-tech, communications, telecom OEM, media, energy, utilities, resources, services, and other industries. Infosys has strategic partnership with Rolls-Royce for aerospace engineering. The company was formerly known as Infosys Technologies Limited and changed its name to Infosys Limited in June 2011. Infosys Limited was founded in 1981 and is headquartered in Bengaluru, India.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "VIE",
        "market": "at_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560100",
        "website": "http://www.infosys.com",
        "market_cap": "Large Cap"
    },
    "KPITTECH.NS": {
        "short_name": "KPIT TECHNOLOGIES",
        "long_name": "KPIT Technologies Limited",
        "summary": "KPIT Technologies Limited, a technology company, provides engineering, embedded software, artificial intelligence, and digital solutions for automobile and mobility industries in the Americas, the United Kingdom, Europe, and internationally. The company offers autonomous driving and ADAS solutions, including system engineering, functional safety, multicore engineering, feature development, annotation and labeling, semantic segmentation, multi sensor, data analytics, feature validation, and virtual and closed loop simulation solutions; and electric and conventional powertrain solutions comprising production software/function development, model based system engineering, and verification and validation solutions. It also operates vehicle infotainment platform and infotainment connectivity platform for connected vehicles; and K-DCP engineering toolchain and K-DCP aftersales suite to provide vehicle diagnostic solutions, as well as K-DCP connected diagnostics solutions. In addition, the company offers integration, and verification and validation services; MCAL and complex device driver development services; and micro controllers supported services, as well as operates AUTOSAR platform. Further, it provides mechatronics solutions, including new product development for NDP/sub systems ownerships, wiring harness, and mechatronics/smart interiors; epowertain solutions for battery packaging, thermal management, and E&E packaging; and knowledge based engineering solutions for design automation-mechanical and electrical, and digital process automation. The company was formerly known as KPIT Engineering Limited and changed its name to KPIT Technologies Limited in March 2019. The company was incorporated in 2018 and is headquartered in Pune, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411057",
        "website": "http://www.kpit.com",
        "market_cap": "Large Cap"
    },
    "LTI.NS": {
        "short_name": "LARSEN AND TOUBRO",
        "long_name": "Larsen & Toubro Infotech Limited",
        "summary": "Larsen & Toubro Infotech Limited, a technology consulting and digital solutions company, provides information technology services and solutions in India, North America, Europe, the Asia Pacific, and internationally. The company operates through Banking, Financial Services & Insurance; Manufacturing; Energy & Utilities; HighÂ\u0096Tech, Media & Entertainment; and CPG, Retail, Pharma & Others segments. It offers application development, maintenance and outsourcing, enterprise solution, infrastructure management, testing, digital solution, and platform-based solution services. Larsen & Toubro Infotech Limited has an alliance with IBM to help businesses transform their operations through hybrid cloud adoption. The company was formerly known as L&T Information Technology Limited and changed its name to Larsen & Toubro Infotech Limited in June 2001. The company was incorporated in 1996 and is based in Mumbai, India. Larsen & Toubro Infotech Limited is a subsidiary of Larsen & Toubro Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400072",
        "website": "http://www.lntinfotech.com",
        "market_cap": "Large Cap"
    },
    "LTTS.NS": {
        "short_name": "L&T TECHNOLOGY SER",
        "long_name": "L&T Technology Services Limited",
        "summary": "L&T Technology Services Limited provides engineering, research, and development (ER&D) services in North America, Europe, India, and internationally. Its Transportation segment offers engineering services and solutions to transportation industry that includes original equipment manufacturers (OEM) and Tier 1 suppliers in automotive, trucks and off-highway vehicles, aerospace, and rail industries. Its Industrial Products segment helps OEM customers in building automation, home and office products, energy, process control, and machinery sectors. This segment offers product development counsel, software expertise, electronics, connectivity, mechanical engineering, industrial networking protocols, user interface/user experience, test frameworks, and enterprise control solutions. Its Telecom & Hi-Tech segment provides digital engineering services, such as the cloud, Internet of Things (IoT), artificial intelligence, data analytics, and others. The company's Plant Engineering segment provides engineering services in E/EPCM, engineering reapplication and global rollouts, plant sustenance and management, and regulatory compliance engineering, as well as to chemical, consumer packaged goods, and energy and utility sector clients. The company's Medical Devices segment delivers solutions in diagnostics, patient mobility services, musculoskeletal services, life sciences, surgical services, cardiovascular, home healthcare, and general medical to medical device OEMs. L&T Technology Services Limited has a strategic partnership with Exponential-e Ltd. to jointly offer workplace transformation solutions. The company was formerly known as L&T Technology and Engineering Services Company Limited and changed its name to L&T Technology Services Limited in July 2012. L&T Technology Services Limited was incorporated in 2012 and is headquartered in Vadodara, India. L&T Technology Services Limited is a subsidiary of Larsen & Toubro Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Vadodara",
        "zipcode": "390019",
        "website": "http://www.ltts.com",
        "market_cap": "Large Cap"
    },
    "MAJESCO.NS": {
        "short_name": "MAJESCO LIMITED",
        "long_name": "Majesco Limited",
        "summary": "Majesco Limited, together with its subsidiaries, provides cloud-based software solutions for the insurance industry in North America, Europe, and internationally. The company offers Property & Casualty Core Suite that provides core system capabilities, including policy, billing, and claims for property and casualty personal, commercial, workers' compensation, and specialty insurance; and L&A and Group Core Suite insurance software for individual, group, and voluntary benefits insurance. It also provides LifePlus Solutions for individual life, pensions, and wealth management; insurance distribution management software; Data and Analytics Platform, a business intelligence and analytics tool for claims, underwriting, policy, and billing functions; and Digital Insurance platform, a digital and micro-services based cloud-only platform solution. Majesco Limited offers software solutions for property, casualty and life, and annuity providers. In addition, it provides cloud implementation, cloud subscription, professional, and support and maintenance services. The company was formerly known as Minefields Computers Limited and changed its name to Majesco Limited in June 2015. Majesco Limited was incorporated in 2013 and is based in Navi Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Navi Mumbai",
        "zipcode": "400710",
        "website": "http://www.majesco.com",
        "market_cap": "Mid Cap"
    },
    "MASTEK.NS": {
        "short_name": "MASTEK",
        "long_name": "Mastek Limited",
        "summary": "Mastek Limited, together with its subsidiaries, provides enterprise technology solutions. The company offers business and technology services comprising application development, ERP and cloud migration, digital commerce, application support and maintenance, business intelligence and analytics, agile consulting, testing and assurance, and legacy modernization. It also provides data warehousing and enterprise digital transformation services. The company serves customers spanning government, healthcare, defense, retail, and financial services sectors in India, the United Kingdom, the Middle East, the Asia Pacific, the United States, and internationally. Mastek Limited was founded in 1982 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400096",
        "website": "http://www.mastek.com",
        "market_cap": "Large Cap"
    },
    "MINDTECK.NS": {
        "short_name": "MINDTECK(INDIA)",
        "long_name": "Mindteck (India) Limited",
        "summary": "Mindteck (India) Limited provides product engineering and information technology (IT) services in the United States, India, and internationally. The company offers smart grid communication services, OEM solutions, data center and in-premises energy management services, and IT application solutions; embedded design services, embedded verification and validation services, and system solutions; product lifecycle management (PLM) consulting, advisory, system implementation and administration, system validation/testing, program management, and system integration/data migration services; and SAP-based solutions. It also provides mobile strategy consulting, user experience, design and development, and mobility testing services; hybrid cloud appliance, interoperable cloud storage, and business data analytics services; business intelligence, data/information management, and big data services, as well as advanced analytics and analytics on unstructured data; and IT security services. In addition, it offers system and integration, specialized, software product, and cloud based testing services, as well as test strategy, automation, and infrastructure services; product engineering, re-engineering, and sustenance services; data center transformation and IT infrastructure management services; custom application development, application maintenance and management, legacy modernization, and performance engineering and enhancement services; application and enterprise systems integration, business process management, packaged application, and service oriented architecture services; and smart city solutions. Further, it sources and deploys IT talent. It serves start-ups, universities, and government entities. The company was formerly known as Hinditron Informatics Limited and changed its name to Mindteck (India) Limited in September 1999. The company was founded in 1991 and is headquartered in Bengaluru, India. Mindteck (India) Limited is a subsidiary of Embtech Holdings Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560068",
        "website": "http://www.mindteck.com",
        "market_cap": "Small Cap"
    },
    "MINDTREE.NS": {
        "short_name": "MINDTREE LTD",
        "long_name": "Mindtree Limited",
        "summary": "Mindtree Limited provides digital transformation and technology services in India, the United States, Canada, Continental Europe, the United Kingdom, and internationally. It operates in four segments: Retail, Consumer Packaged Goods and Manufacturing; Banking, Financial Services and Insurance; Technology, Media and Services; and Travel and Hospitality. The company offers services in the areas of agile, analytics and information management, application development and maintenance, business process management, business technology consulting, cloud, digital business, independent testing, infrastructure management, mobility, product engineering, and SAP services. It also provides Gladius connected buildings platform, an Internet of Things platform; and ShotClasses, a mobile based micro-learning platform for enterprises. The company serves the banking, capital market, consumer packaged goods, consumer technology, education, enterprise technology, insurance, manufacturing, media and entertainment, retail, transportation and logistics, and travel and hospitality industries. The company was formerly known as Mindtree Consulting Limited and changed its name to Mindtree Limited in March 2008. Mindtree Limited was founded in 1999 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560059",
        "website": "http://www.mindtree.com",
        "market_cap": "Large Cap"
    },
    "MPHASIS.NS": {
        "short_name": "MPHASIS LTD",
        "long_name": "Mphasis Limited",
        "summary": "Mphasis Limited operates as an information technology solutions provider that specializes in cloud and cognitive services worldwide. The company operates through Banking and Capital Market, Insurance, Information Technology, Communication and Entertainment, and Emerging Industries segments. It offers application, blockchain, business process, cloud, cognitive, cyber security, DevOps, digital, product engineering, infrastructure, and enterprise automation, as well as governance, risk, and compliance services. The company serves customers operating in the banking and capital, insurance, and payment markets, as well as other industries, including communications, energy and utilities, healthcare, life sciences, logistics, manufacturing, and travel and transportation. It has a partnership agreement with R3 to develop a blockchain-enabled payment solutions. Mphasis Limited was incorporated in 1992 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560093",
        "website": "http://www.mphasis.com",
        "market_cap": "Large Cap"
    },
    "ONWARDTEC.NS": {
        "short_name": "ONWARD TECHNO",
        "long_name": "Onward Technologies Limited",
        "summary": "Onward Technologies Limited provides mechanical engineering design and IT consulting services in India and internationally. The company offers product engineering, manufacturing engineering, mechanical engineering, simulation engineering, and engineering change management services; electronics and embedded systems; electrical and electronics solutions; and technical publications. It also provides IT consulting services comprising software product engineering, big data and analytics, application development and maintenance, and infrastructure support services; and enterprise software, enterprise mobility, and digital transformation solutions, as well as social, mobile, analytics, and cloud solutions. In addition, the company offers product sales and support services; staffing services, such as contract-to-hire; and robotic business process automation and enterprise managed services for infrastructure, applications, and databases. It primarily serves automotive; aerospace; off highway and agri equipment; industrial equipment and machinery; medical equipment and healthcare; banking and financial services; e-governance and education; aerospace; and insurance industries. The company was founded in 1991 and is based in Mumbai, India. Onward Technologies Limited is a subsidiary of Onward Network Technologies Private Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400018",
        "website": "http://www.onwardgroup.com",
        "market_cap": "Mid Cap"
    },
    "PALREDTEC.NS": {
        "short_name": "PALRED TECHNOLOGIE",
        "long_name": "Palred Technologies Limited",
        "summary": "Palred Technologies Limited engages in the e-commerce, information technology, and media and entertainment businesses in India. It offers middleware and master data management services. The company also operates LatestOne.com, an e-commerce Website which sells tech and mobile accessories such as Bluetooth speakers and headsets, cables, power banks, headsets, smart watches, fashion accessories, etc.; Saverable.com for banking accounts, insurance schemes, loan offers, and various other products; and Great indian t.com, an online entertainment site for uploading videos. In addition, it offers system and process solutions for media and entertainment businesses. The company was formerly known as Four Soft Technologies Limited and changed its name to Palred Technologies Limited in January 2014. Palred Technologies Limited was founded in 1999 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500034",
        "website": "http://www.palred.com",
        "market_cap": "Small Cap"
    },
    "PERSISTENT.NS": {
        "short_name": "PERSISTENT SYSTEMS",
        "long_name": "Persistent Systems Limited",
        "summary": "Persistent Systems Limited provides software products, services, and technology solutions. The company operates through three segments: Banking, Financial Services and Insurance (BFSI), Healthcare & Life Sciences, and Technology Companies and Emerging Verticals. It provides Persistent Digital Banking and Credit Union Solution, and Loan Originating Solution; Digital Insurance Solutions, comprising claims lifecycle management automation, CX transformation for insurance, and integrated wellness and care solution for insurance; and Persistent trade finance automation. The company also offers Persistent Patient Mobile App for enhanced efficiency, patient experience, and care co-ordination; digital care pathways; Denials Management for measuring performance reimbursement, identifying payment errors, and streamlining collections; and digital device and diagnostics, digital lab, and research collaboration. Additionally, it provides product life management and systems engineering solutions; and digital manufacturing solutions comprising Dassault Planning and Optimization Software and Dassault manufacturing and operations software. Further, the company offers Network Assurance and Performance Management, and 5G AI Operations and Management solutions; and Mobile Edge Cloud Accelerators, Network API Optimization, and digital product engineering service, as well as provides software innovation and engineering services. It serves customers in the banking, financial services, insurance, health care and life science, software and hi-tech, and telecom and media sectors. It has operations in India, South Africa, Japan, Israel, Malaysia, Singapore, Sri Lanka, Australia, England, France, Germany, Ireland, the Netherlands, Switzerland, Canada, Mexico, and the United States. The company was incorporated in 1990 and is based in Pune, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411016",
        "website": "http://www.persistent.com",
        "market_cap": "Large Cap"
    },
    "QUINTEGRA.NS": {
        "short_name": "QUINTEGRA SOLUTION",
        "long_name": "Quintegra Solutions Limited",
        "summary": "Quintegra Solutions Limited does not have significant operations. Previously, it was engaged in the design and development services of software applications. The company was founded in 1994 and is headquartered in Chennai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600018",
        "website": "http://www.quintegrasolutions.com",
        "market_cap": "Small Cap"
    },
    "REDINGTON.NS": {
        "short_name": "REDINGTON INDIA LT",
        "long_name": "Redington (India) Limited",
        "summary": "Redington (India) Limited provides supply chain solutions for information technology products, telecom, lifestyle, healthcare, and solar products in India and internationally. The company distributes IT hardware and software products, including consumer and commercial PCs, desktops, laptops, and MacBooks; tablets and phablets; deskjets, laserjets, and related consumables and accessories; smartphones and augmented reality/virtual reality-powered wearables; and networking, enterprise server and storage, and security products, as well as software solutions, and licensing and subscription support services. It also offers cloud consulting, migration, DevOps, integration, and security products, as well as managed services; and develops, manufactures, and markets digital printing solutions comprising printing presses, proprietary consumables, and workflow. The company is also involved in the on demand part manufacturing business that consists of SLA, SLS, multi jet printing, color jet printing, vacuum casting, direct metal printing, metal die casting, CNC machines plastic and metals, and investment casting patterns; medical technologies and solar products distribution. In addition, it provides enterprise solutions and services, such as SOC and NOC services, converged network solutions, ICT and physical security solutions, and cloud services and solutions, as well as IT consulting, storage, data center, and virtualization solutions; and infrastructure managed services, including annual maintenance contracts, facility management services, managed print services, and IT outsourcing and helpdesk services. Further, the company offers spare part management; professional services comprising RBT and onsite repair, one time implementation projects, vendor managed support, and migrations and upgrades, as well as DOA validations, pats, and product screening; and logistics services. Redington (India) Limited was founded in 1961 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600032",
        "website": "http://redingtongroup.com/india/",
        "market_cap": "Large Cap"
    },
    "ROLTA.NS": {
        "short_name": "ROLTA INDIA",
        "long_name": "Rolta India Limited",
        "summary": "Rolta India Limited, together with its subsidiaries, provides various information technology (IT) solutions and services in India and internationally. The company operates in two segments, Enterprise Geospatial and Engineering Solutions; and System Integration and Enterprise IT Solutions. Its solutions include BI and big data analytics, smart city, cloud security and IT transformation, geospatial fusion, enterprise application, e-Governance, financial analytics, defense, safety and security, and engineering AIM solutions. The company also provides application development and maintenance, managed, Rolta adviser, business consulting, enterprise performance management, geospatial, and engineering services. Its products include Rolta OneView, a BI and big data analytics solution; Rolta IT-OT Fusion, a middleware integration solution; ROLTA iPerspective, an enterprise suite for SOA needs; Rolta SmartMigrate solution; Rolta OnPoint, a spatial integration application; Rolta GeoCAD, an emergency response management solution; Rolta Command and Control Solution; Rolta Photogrammetry Suite, a solution to publish GIS data; Rolta Image Processing Suite; Rolta 3D Analysis and Visualization Suite; and Rolta Battlefield Management Systems. The company serves defense, homeland and maritime security, government, infrastructure and natural resources, oil and gas, chemicals, discrete manufacturing, transportation, banking and financial services, and retail and healthcare industries, as well as utilities comprising power, water, gas, and telecom. Rolta India Limited was incorporated in 1989 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400093",
        "website": "http://www.rolta.com",
        "market_cap": "Small Cap"
    },
    "RSSOFTWARE.NS": {
        "short_name": "RS SOFTWARE (I)",
        "long_name": "R S Software (India) Limited",
        "summary": "R S Software (India) Limited provides software solutions to the electronic payment industry in India, the United States, and the United Kingdom. The company engages in the development, testing, and maintenance of software products. Its solutions cover merchant acquiring, QA and testing, data analytics, digital payments, security and compliance, and payment processing solutions, as well as Payabbhi, a payment platform. The company serves consumers, merchants, banks, and payment networks. R S Software (India) Limited was incorporates in 1987 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700020",
        "website": "http://www.rssoftware.com",
        "market_cap": "Small Cap"
    },
    "RSYSTEMS.NS": {
        "short_name": "R SYSTEMS INTERNAT",
        "long_name": "R Systems International Limited",
        "summary": "R Systems International Limited provides information technology and business process outsourcing (BPO) services worldwide. The company offers AWS powered, campaign to closure, customer experience analytics, and TOP testing suite solutions. It also provides technology solutions, such as cloud enablement, digital platforms and solutions, Internet of Things, product engineering, and QA testing; automation and AI data and analytics services, including advanced analytics, AI machine learning, business analytics, business automation, data monetization and modernization, and modern data management; and design services, including re-engineering, UX engineering, mobile user experience, and visual design services. The company serves finance and insurance, healthcare and life science, telecom, technology, and retail and e-commerce sectors. R Systems International Limited was incorporated in 1993 and is headquartered in Noida, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201307",
        "website": "http://www.rsystems.com",
        "market_cap": "Large Cap"
    },
    "SAKSOFT.NS": {
        "short_name": "SAKSOFT LTD",
        "long_name": "Saksoft Limited",
        "summary": "Saksoft Limited, an information technology company, provides digital transformation solutions in Europe, the United States, the Asia Pacific, and internationally. The company offers application services in the areas of custom application development, Internet of Things, mobile application development, cloud, and block chain. It also provides information management services, including big data solutions comprising data management, multi-dimensional aggregation and allocation, data tagging and standardization, extract-transfer-load process, centralized repositories or data warehouse, real-time reporting with analytical alerts, data mart, key performance indicators optimization, version control and process management, and risk management and insights; business intelligence (BI) solutions, such as data warehousing, data discovery and visualization, master data/data quality management, data integration, data governance, and data warehouse modernization, as well as self-service BI solutions; and data analytics solutions. In addition, the company offers testing, robotic process automation, cloud, and mobility services. It serves transportation and logistics, fintech, healthcare, retail e-commerce, telecommunication, and public sectors. The company was founded in 1999 and is headquartered in Chennai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600096",
        "website": "http://www.saksoft.com",
        "market_cap": "Mid Cap"
    },
    "SONATSOFTW.NS": {
        "short_name": "SONATA SOFTWARE",
        "long_name": "Sonata Software Limited",
        "summary": "Sonata Software Limited, together with its subsidiaries, provides information technology services and solutions in India, the United States, Europe, Australia, and the Middle East. It also offers software development, technical, and product marketing services, as well as consulting services. In addition, the company delivers solutions for customers in travel, retail, manufacturing, distribution, transportation, and services and software industries through IP-led platform solutions, such as Rezopia, Brick & Click Retail, Kartopia, Modern Distribution, Halosys, commodity trading and risk management (CTRM), and KODO. Further, it resells product licenses of software companies. Sonata Software Limited has alliances with SAP and Microsoft. The company was incorporated in 1994 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560004",
        "website": "http://www.sonata-software.com",
        "market_cap": "Large Cap"
    },
    "SUVIDHAA.NS": {
        "short_name": "Suvidhaa Infoserve Ltd",
        "long_name": "Suvidhaa Infoserve Limited",
        "summary": "Suvidhaa Infoserve Limited offers payment services. The company provides its payment services for domestic remittance, individual and business loans, mutual fund and other investment products, ATM, utility bill payments, recharges, travel ticketing, general and life insurance, E-Commerce, bank account opening, pre-paid/gift card issuance, and cash collection and bank account deposit services through S-Commerce Platform. It serves customers through Suvidhaa Centres, a financial services hub; Suvidhaa Points; and sPAY, a POS based transaction acquiring platform. The company was incorporated in 2007 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400 093",
        "website": "http://www.suvidhaa.com",
        "market_cap": "Mid Cap"
    },
    "TCS.NS": {
        "short_name": "TATA CONSULTANCY S",
        "long_name": "Tata Consultancy Services Limited",
        "summary": "Tata Consultancy Services Limited provides information technology (IT) and IT enabled services worldwide. It operates through Banking, Financial Services and Insurance; Manufacturing; Retail and Consumer Business; Communication, Media and Technology; and Others segments. The company offers CHROMA, a cloud-based talent management solution; ignio, a cognitive automation software product; iON, an assessment platform; TAP, a procurement offering; TCS MasterCraft, a platform to automate and manage IT processes; and Quartz, a blockchain solution. It also provides customer intelligence and insight solutions to deliver retail, banking, and communications experiences; Intelligent Urban Exchange, an integrated software to accelerate smart city programs; OPTUMERA, a digital merchandising suite; TCS BaNCS, a financial platform; and Jile, an agile DevOps product. In addition, the company offers advanced drug development and connected intelligent platforms; ERP on cloud, an enterprise solution that offers hosted ERP applications and services; HOBS, a platform for subscription based digital business. Further, it provides cognitive business, consulting, analytics, automation and artificial intelligence, Internet of Things, cloud applications, blockchain, cloud infrastructure, cyber security, interactive, industrial engineering, quality engineering, and enterprise services. The company serves banking, financial, and public services; consumer goods and distribution, insurance, life sciences and healthcare, manufacturing, retail, hi-tech, travel, transportation, and hospitality industries; communications, media, and technology industries; and energy, resource, and utility industries. It has strategic partnerships with Posten Norge AS and the University of Tokyo; Zendesk, Inc.; IBM; and PagerDuty, Inc. The company was founded in 1968 and is based in Mumbai, India. Tata Consultancy Services Limited is a subsidiary of Tata Sons Private Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400001",
        "website": "http://www.tcs.com",
        "market_cap": "Large Cap"
    },
    "TECHM.NS": {
        "short_name": "TECH MAHINDRA",
        "long_name": "Tech Mahindra Limited",
        "summary": "Tech Mahindra Limited provides information technology (IT) services and solutions in the Americas, Europe, India, and internationally. The company operates through IT Business and Business Processing Outsourcing (BPO) segments. It offers IT outsourcing, consulting, application outsourcing, network, infrastructure outsourcing, integrated engineering, BPO, platform, and mobile value added services. The company also provides consulting-led integrated portfolio services to telecom equipment manufacturers and service providers, IT infrastructure service providers, and business process outsourcing service providers; and IT and IT-enabled enterprise solutions. In addition, it offers IT enabled, application development and maintenance, consulting and enterprise business solutions, extended engineering solutions, and infrastructure management services. Further, the company provides data and analytics; IT infrastructure and cloud services; customer experience solutions; enterprise platforms; and enterprise business solutions. Additionally, it offers testing, telecom product engineering, digital supply chain, performance engineering, and enterprise security and risk management services. The company serves insurance, banking and financial, manufacturing, telecommunication, transportation and logistics, engineering, entertainment, and public and government sectors; and retail and consumer goods industries. Tech Mahindra Limited has strategic partnerships with Openet, ChampTrax, Lucideus, and eNate Limited. The company was founded in 1986 and is based in Pune, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411057",
        "website": "http://www.techmahindra.com",
        "market_cap": "Large Cap"
    },
    "TERASOFT.NS": {
        "short_name": "TERA SOFTWARE",
        "long_name": "Tera Software Limited",
        "summary": "Tera Software Limited provides IT and integrated related products and services worldwide. It operates through Integrated Solutions Division, Technical Division, and Projects Division segments. The company offers its services in various categories, such as system integration and networking, and software development and consultancy, as well as GST billing, invoicing, and filing software. Its services include internet of things, human capital management, experience design, enterprise risk and security, engineering and manufacturing, customer relationship management, and consulting. The company also provides services for Aadhaar; creation of national population register; sales tax automation; electricity billing system; RTA project; ration cards; computer education in schools; and socio economic and caste census. It serves banking and financial services, communications, consumer goods, education, and energy and utilities industries. The company was founded in 1994 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500033",
        "website": "http://www.terasoftware.com",
        "market_cap": "Small Cap"
    },
    "TRIGYN.NS": {
        "short_name": "TRIGYN TECHNOLOGIE",
        "long_name": "Trigyn Technologies Limited",
        "summary": "Trigyn Technologies Limited provides communications and information technology staffing support services in India and internationally. The company offers system integration services covering custom application development and maintenance, enterprise content management, legacy modernization/application reengineering, mobile application development and enablement, business intelligence and reporting, user experience consulting/design, independent testing, business process outsourcing, and 24X7 helpdesk and support. It also provides managed services consisting of project management and business analysis, helpdesk and network support, network and infrastructure design, ERP technical and functional, and UX/UI and usability, as well as architecture, design, development, and quality assurance. In addition, the company offers development and maintenance, SAP, and IT solutions. It serves international organizations, non-governmental organizations, and state and local governments, as well as the commercial sector comprising financial services, pharmaceutical, manufacturing, and distribution. The company was formerly known as Leading Edge Systems Ltd and changed its name to Trigyn Technologies Limited in July 2000. Trigyn Technologies Limited was incorporated in 1986 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400096",
        "website": "http://www.trigyn.com",
        "market_cap": "Mid Cap"
    },
    "WIOA.F": {
        "short_name": "WIPRO LTD ADR /1 IR 2",
        "long_name": "Wipro Limited",
        "summary": "Wipro Limited operates as an information technology (IT), consulting, and business process services (BPS) company worldwide. It operates in three segments: IT Services, IT Products, and India State Run Enterprise Services (ISRE). The IT Services segment offers IT and IT-enabled services, including digital strategy advisory, customer-centric design, technology consulting, IT consulting, custom application design, development, re-engineering and maintenance, systems integration, package implementation, infrastructure, analytics, business process, research and development, and hardware and software design services to enterprises. It serves customers in various industry verticals, such as banking, financial services, and insurance; health business; consumer business; energy, natural resources, and utilities; manufacturing; technology; and communications. The IT Products segment provides a range of third-party IT products comprising enterprise platforms, networking solutions, software and data storage products, contact center infrastructure, enterprise security, IT optimization technologies, video solutions, and end-user computing solutions. It serves enterprises in various industries primarily in the India market, which comprise the government, defense, IT and IT-enabled services, telecommunications, manufacturing, utilities, education, and financial services sectors. The ISRE segment offers IT services to entities and/or departments owned or controlled by the Government of India and/or various Indian State Governments. The company has research collaboration agreements with the University of Texas at Austin; Tel Aviv University, Israel; Swinburne University, Melbourne; IIT Kharagpur; IIT Madras; IISc Bangalore; and University of Agricultural Sciences, Bangalore; and strategic relationship with Amazon Web Services in the area of DevOps. Wipro Limited was founded in 1945 and is based in Bengaluru, India.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560035",
        "website": "http://www.wipro.com",
        "market_cap": "Large Cap"
    },
    "WIOA.VI": {
        "short_name": "WIPRO LTD-ADR",
        "long_name": "Wipro Limited",
        "summary": "Wipro Limited operates as an information technology (IT), consulting, and business process services (BPS) company worldwide. It operates in three segments: IT Services, IT Products, and India State Run Enterprise Services (ISRE). The IT Services segment offers IT and IT-enabled services, including digital strategy advisory, customer-centric design, technology consulting, IT consulting, custom application design, development, re-engineering and maintenance, systems integration, package implementation, infrastructure, analytics, business process, research and development, and hardware and software design services to enterprises. It serves customers in various industry verticals, such as banking, financial services, and insurance; health business; consumer business; energy, natural resources, and utilities; manufacturing; technology; and communications. The IT Products segment provides a range of third-party IT products comprising enterprise platforms, networking solutions, software and data storage products, contact center infrastructure, enterprise security, IT optimization technologies, video solutions, and end-user computing solutions. It serves enterprises in various industries primarily in the India market, which comprise the government, defense, IT and IT-enabled services, telecommunications, manufacturing, utilities, education, and financial services sectors. The ISRE segment offers IT services to entities and/or departments owned or controlled by the Government of India and/or various Indian State Governments. The company has research collaboration agreements with the University of Texas at Austin; Tel Aviv University, Israel; Swinburne University, Melbourne; IIT Kharagpur; IIT Madras; IISc Bangalore; and University of Agricultural Sciences, Bangalore; and strategic relationship with Amazon Web Services in the area of DevOps. Wipro Limited was founded in 1945 and is based in Bengaluru, India.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "VIE",
        "market": "at_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560035",
        "website": "http://www.wipro.com",
        "market_cap": "Large Cap"
    },
    "WIPRO.NS": {
        "short_name": "WIPRO LTD",
        "long_name": "Wipro Limited",
        "summary": "Wipro Limited operates as an information technology (IT), consulting, and business process services (BPS) company worldwide. It operates in three segments: IT Services, IT Products, and India State Run Enterprise Services (ISRE). The IT Services segment offers IT and IT-enabled services, including digital strategy advisory, customer-centric design, technology consulting, IT consulting, custom application design, development, re-engineering and maintenance, systems integration, package implementation, infrastructure, analytics, business process, research and development, and hardware and software design services to enterprises. It serves customers in various industry verticals, such as banking, financial services, and insurance; health business; consumer business; energy, natural resources, and utilities; manufacturing; technology; and communications. The IT Products segment provides a range of third-party IT products comprising enterprise platforms, networking solutions, software and data storage products, contact center infrastructure, enterprise security, IT optimization technologies, video solutions, and end-user computing solutions. It serves enterprises in various industries primarily in the India market, which comprise the government, defense, IT and IT-enabled services, telecommunications, manufacturing, utilities, education, and financial services sectors. The ISRE segment offers IT services to entities and/or departments owned or controlled by the Government of India and/or various Indian State Governments. The company has research collaboration agreements with the University of Texas at Austin; Tel Aviv University, Israel; Swinburne University, Melbourne; IIT Kharagpur; IIT Madras; IISc Bangalore; and University of Agricultural Sciences, Bangalore; and strategic relationship with Amazon Web Services in the area of DevOps. Wipro Limited was founded in 1945 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560035",
        "website": "http://www.wipro.com",
        "market_cap": "Large Cap"
    },
    "WIT": {
        "short_name": "Wipro Limited",
        "long_name": "Wipro Limited",
        "summary": "Wipro Limited operates as an information technology (IT), consulting, and business process services (BPS) company worldwide. It operates in three segments: IT Services, IT Products, and India State Run Enterprise Services (ISRE). The IT Services segment offers IT and IT-enabled services, including digital strategy advisory, customer-centric design, technology consulting, IT consulting, custom application design, development, re-engineering and maintenance, systems integration, package implementation, infrastructure, analytics, business process, research and development, and hardware and software design services to enterprises. It serves customers in various industry verticals, such as banking, financial services, and insurance; health business; consumer business; energy, natural resources, and utilities; manufacturing; technology; and communications. The IT Products segment provides a range of third-party IT products comprising enterprise platforms, networking solutions, software and data storage products, contact center infrastructure, enterprise security, IT optimization technologies, video solutions, and end-user computing solutions. It serves enterprises in various industries primarily in the India market, which comprise the government, defense, IT and IT-enabled services, telecommunications, manufacturing, utilities, education, and financial services sectors. The ISRE segment offers IT services to entities and/or departments owned or controlled by the Government of India and/or various Indian State Governments. The company has research collaboration agreements with the University of Texas at Austin; Tel Aviv University, Israel; Swinburne University, Melbourne; IIT Kharagpur; IIT Madras; IISc Bangalore; and University of Agricultural Sciences, Bangalore; and strategic relationship with Amazon Web Services in the area of DevOps. Wipro Limited was founded in 1945 and is based in Bengaluru, India.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560035",
        "website": "http://www.wipro.com",
        "market_cap": "Large Cap"
    },
    "WITN.MX": {
        "short_name": "WIPRO LTD",
        "long_name": "Wipro Limited",
        "summary": "Wipro Limited operates as an information technology (IT), consulting, and business process services (BPS) company worldwide. It operates in three segments: IT Services, IT Products, and India State Run Enterprise Services (ISRE). The IT Services segment offers IT and IT-enabled services, including digital strategy advisory, customer-centric design, technology consulting, IT consulting, custom application design, development, re-engineering and maintenance, systems integration, package implementation, infrastructure, analytics, business process, research and development, and hardware and software design services to enterprises. It serves customers in various industry verticals, such as banking, financial services, and insurance; health business; consumer business; energy, natural resources, and utilities; manufacturing; technology; and communications. The IT Products segment provides a range of third-party IT products comprising enterprise platforms, networking solutions, software and data storage products, contact center infrastructure, enterprise security, IT optimization technologies, video solutions, and end-user computing solutions. It serves enterprises in various industries primarily in the India market, which comprise the government, defense, IT and IT-enabled services, telecommunications, manufacturing, utilities, education, and financial services sectors. The ISRE segment offers IT services to entities and/or departments owned or controlled by the Government of India and/or various Indian State Governments. The company has research collaboration agreements with the University of Texas at Austin; Tel Aviv University, Israel; Swinburne University, Melbourne; IIT Kharagpur; IIT Madras; IISc Bangalore; and University of Agricultural Sciences, Bangalore; and strategic relationship with Amazon Web Services in the area of DevOps. Wipro Limited was founded in 1945 and is based in Bengaluru, India.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560035",
        "website": "http://www.wipro.com",
        "market_cap": "Large Cap"
    },
    "XCHANGING.NS": {
        "short_name": "XCHANGING SOLUTION",
        "long_name": "Xchanging Solutions Limited",
        "summary": "Xchanging Solutions Limited provides information technology services in India, Europe, the United States, and internationally. The company was formerly known as Cambridge Solutions Limited and changed its name to Xchanging Solutions Limited in June 2012. Xchanging Solutions Limited was incorporated in 2002 and is based in Bengaluru, India. Xchanging Solutions Limited operates as a subsidiary of Xchanging (Mauritius) Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560066",
        "website": "http://www.xchanging.com/investor-relations/xsl-content",
        "market_cap": "Mid Cap"
    },
    "XELPMOC.NS": {
        "short_name": "XELPMOC DESIGN AND",
        "long_name": "Xelpmoc Design and Tech Limited",
        "summary": null,
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560095",
        "website": "http://www.xelpmoc.in",
        "market_cap": "Mid Cap"
    },
    "ZENSARTECH.NS": {
        "short_name": "ZENSAR TECHNOLOGIE",
        "long_name": "Zensar Technologies Limited",
        "summary": "Zensar Technologies Limited, a digital solutions and technology services company, provides information technology (IT) services and solutions in the United states, Europe, and internationally. It operates through Application Management Services and Infrastructure Management Services segments. The company offers digital supply chain, enterprise analytics, customer experience transformation, agile IT modernization, and digital solutions. It also provides advanced analytics and data warehousing, big data, and enterprise data management services. In addition, the company offers CRM, digital channel, digital marketing, experience, and front end development services; digital foundation, workplace, infrastructure, operations, and enterprise security services; enterprise applications, such as Oracle, SAP, SFDC, and Pega Alliance solutions; and agile, application development, DevOps, enterprise architecture consulting, outcome based managed, and robotic process automation services. Further, it provides testing services; and digital commerce consulting, digital commerce development, digital fulfilment, and managed commerce services. The company serves manufacturing, retail, media, banking, insurance, healthcare, and utilities industries. Zensar Technologies Limited was incorporated in 1963 and is headquartered in Pune, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411014",
        "website": "http://www.zensar.com",
        "market_cap": "Large Cap"
    }
}