{
    "ACCURACY.NS": {
        "short_name": "Accuracy Shipping Limited",
        "long_name": "Accuracy Shipping Limited",
        "summary": "Accuracy Shipping Limited provides third party logistics solutions worldwide. The company offers logistics services, including transportation, distribution, freight forwarding, clearing and forwarding, custom house clearance, warehousing, and other services. Its services include air cargo services, such as import customs, brokerage, insurance, consolidation, packing, and logistics; sea cargo services consisting of shipment tracking, purchase order management, and space protection; project cargo comprising freight management, cargo handling, and cargo movement; land cargo services; and custom broking services. The company was incorporated in 2000 and is headquartered in Anjar, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Anjar"
    },
    "ALLCARGO.NS": {
        "short_name": "ALLCARGO LOGISTICS",
        "long_name": "Allcargo Logistics Limited",
        "summary": "Allcargo Logistics Limited provides integrated logistics solutions in India, the United States, the Far East, Europe, and internationally. The company operates in four segments: Multimodal Transport Operations, Container Freight Stations, Project and Engineering Solutions, and Logistics Park. The Multimodal Transport Operations segment is involved in non-vessel owning common carrier operations related to less than container load (LCL) consolidation and full container load forwarding activities. The Container Freight Stations segment offers import/export cargo stuffing, de-stuffing, custom clearance, and other related ancillary services to importers and exporters. The Project and Engineering Solutions segment provides integrated end-to-end project, engineering, and logistic services through a fleet of special equipment, as well as project engineering solutions across various sectors. The Logistics Park segment offers warehousing and industrial real-estate solutions. The company was formerly known as Allcargo Global Logistics Limited and changed its name to Allcargo Logistics Limited in July 2011. Allcargo Logistics Limited was founded in 1993 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "ARSHIYA.NS": {
        "short_name": "ARSHIYA LIMITED",
        "long_name": "Arshiya Limited",
        "summary": "Arshiya Limited provides integrated supply chain and logistics infrastructure solutions in India. It offers third-party logistics and other value optimization services, such as handling and transportation, packaging, consolidation, palletization, labelling, kitting, bagging, bottling, cutting-slitting, survey, quality assurance, refurbishment, repairs and maintenance, washing, etc. to its clients. The company also offers information technology enabled services; warehousing solutions; private freight and container rail terminal services; inland container depot, and port connectivity services; and rail infrastructure and transportation services. It serves e-commerce, telecom, pharmaceuticals, and chemical industries. The company was formerly known as Arshiya International Limited and changed its name to Arshiya Limited in September 2013. Arshiya Limited was incorporated in 1981 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "BLUEDART.NS": {
        "short_name": "BLUE DART EXPRESS",
        "long_name": "Blue Dart Express Limited",
        "summary": "Blue Dart Express Limited provides courier and express services. It provides day-definite and time-definite delivery schedules across air and ground network under the Domestic Priority, Dart Apex, Dart Surfaceline, and Dart Plus name; door-to-door ground distribution service to approximately 35,000 locations for shipments weighing 10 kgs and above under the Dart Surfaceline name; and industry-specific services. The company also offers air freight services between the airports of Kolkata, Delhi, Mumbai, Bengaluru, Chennai, Hyderabad, and Ahmedabad; air and ground express packaging services under the Smart Box name; wood-free palletized packaging; transportation for freight of 100kgs, 75kgs, or 50kgs; door-to-door express deliveries for documents and packages; international services; and temperature controlled logistics solutions, as well as operates domestic express airline charter. Its infrastructure includes a fleet of 6 Boeing 757-200 freighters with a capacity of 500 tonnes per night; and a flotilla of approximately 22,336 vehicles. The company was founded in 1983 and is headquartered in Mumbai, India. Blue Dart Express Limited is a subsidiary of DHL Express (Singapore) Pte. Ltd.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "GATI.NS": {
        "short_name": "GATI LTD",
        "long_name": "Gati Limited",
        "summary": "Gati Limited, together with its subsidiaries, provides distribution and supply chain solutions in India and internationally. The company operates through two segments, Express Distribution and Fuel Stations. It offers road, rail, and air transportation services; express distribution services; managed, re-engineering, upstream supply chain management, and warehousing services; cargo management and parcel train services; and e-commerce logistic solutions. The company also provides air and ocean freight forwarding services, as well as related freight management solutions; road and air movement to SAARC nations; warehousing solutions; customs clearance services; project logistics; and in-bound and out-bound courier services. In addition, it provides truck load services for long haul transportation; reefer fleet services for the food chain business; customized cold chain solutions; and organized retail services. Further, the company offers customs clearance, goods importation, and last-mile delivery services to the end-customer; and GST solutions to address regulations, place-of-supply rules, tax impact assessments, accounting and technology, input credit setoffs, vendor rationalizations, and management, as well as operates fuel stations, which deals in petrol, diesel, lubricants, etc. It serves the e-commerce, hospitality, healthcare, and electronics sectors. Gati Limited was founded in 1989 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "JITFINFRA.NS": {
        "short_name": "JITF INFRALOGISTIC",
        "long_name": "JITF Infralogistics Limited",
        "summary": "JITF Infralogistics Limited, through its subsidiaries, engages in water infrastructure, municipal solid waste processing and power generation, and rail wagon manufacturing businesses in India. It operates through Railway Freight Wagons, Water Infrastructure, Urban Infrastructure, and Trading Activity segments. The company is involved in the waste to power, railway rolling stock and freight wagons manufacturing, and water and waste water EPC business. It undertakes projects in the areas of water, wastewater, solid waste management, logistics, and transportation equipment fabrication. The company was incorporated in 2008 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "MAHESHWARI.NS": {
        "short_name": "MAHESHWARI LOGISTI",
        "long_name": "Maheshwari Logistics Limited",
        "summary": "Maheshwari Logistics Limited provides logistics services in India. The company operates through three segments: Trading, Transportation & Port Service, and Manufacturing Kraft Paper. It offers bulk cargo transportation services for a range of sectors, including cement, paper, textiles, fertilizers, and other industries. The company also deals in coal, lignite, pet coke, diesel, waste paper, writing paper, kraft paper, and other papers; and manufactures recycled kraft papers. As of March 31, 2020, it had a fleet of approximately 100 trucks and trailers, and affiliation with approximately 10,000 third party truck owners. Maheshwari Logistics Limited was incorporated in 2006 and is based in Valsad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Valsad"
    },
    "MAHLOG.NS": {
        "short_name": "MAHINDRA LOGISTICS",
        "long_name": "Mahindra Logistics Limited",
        "summary": "Mahindra Logistics Limited provides third party logistic services in India and internationally. It operates through two segments, Supply Chain Management (SCM) and Enterprise Mobility Services (EMS). The SCM segment offers customized and end-to-end logistics solutions and services, including transportation and distribution, warehousing, in-factory logistics, and value added services. The segment serves domestic and multinational companies operating in various industry verticals, including automotive, engineering, consumer goods, pharmaceuticals, e-commerce, bulk, banking, IT, financial services, insurance, and consulting businesses. The EMS segment provides technology-enabled people transportation solutions and services for domestic and multinational companies operating in the information technology, information technology-enabled service, business process outsourcing, financial services, consulting, and manufacturing industries. The company also provides freight forwarding services for exports and imports, customs brokerage operations, project cargo services, and charters. Mahindra Logistics Limited was founded in 2000 and is headquartered in Mumbai, India. Mahindra Logistics Limited is a subsidiary of Mahindra & Mahindra Limited.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "NAVKARCORP.NS": {
        "short_name": "NAVKAR CORPORATION",
        "long_name": "Navkar Corporation Limited",
        "summary": "Navkar Corporation Limited provides container freight station, inland container depot, and other related services in India. The company operates a private railway freight terminal, which loads and unloads cargo/containers; and owns and operates trailers for the transportation of cargo. It also operates a buffer yard and warehouses for storage of various export and import related cargoes, such as bagged, unpacked, heavy lifts, grains, chemicals, steel, metals, project cargoes, etc., as well as provides consolidation of cargoes. In addition, the company handles various refrigerated containers, and over-dimensional cargoes and out-of-gauge cargoes; manages temperature-controlled chambers; stores and handles hazardous cargoes; and operates customs facility for examining and clearance of cargoes. In addition, it offers bonded warehousing and empty container storage services; palletizing, shrink-wrapping, packing and re-packing, surveying, fumigation and pest control, bar-coding and labeling, and other related services for cargoes or processes; and maintenance and repair services for various containers as per the requirements of shipping lines. Navkar Corporation Limited was incorporated in 2008 and is based in Navi Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Navi Mumbai"
    },
    "PATINTLOG.NS": {
        "short_name": "PATEL INTEGRATED L",
        "long_name": "Patel Integrated Logistics Limited",
        "summary": "Patel Integrated Logistics Limited provides logistics services in India. The company engages in the co-loading of airfreight; and provision of warehousing and air cargo consolidation services. Patel Integrated Logistics Limited was founded in 1959 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "SICAL.NS": {
        "short_name": "SICAL LOGISTICS",
        "long_name": "Sical Logistics Limited",
        "summary": "Sical Logistics Limited provides integrated logistics solutions in India. The company handles dry and liquid bulk cargo at various ports, as well as containers at Tuticorin container terminal; and operates container freight stations at Chennai, Vizag, and Tuticorin and ICD at Melpakkam. It also offers customs house agency, shipping agency, and stevedoring services; road logistics services for transporting dry and liquid bulk, project cargo, over dimensional cargo, fertilizers, metals, and packaged goods; cold chain, warehousing, and dry logistics services for hospitality, pharma, and FMCG industries; and end to end integrated logistics solutions for bulk and containerized cargo. In addition, the company operates coal berth and coal cum iron ore terminal at Kamarajar Port; and container trains for the movement of edible oils, glasses, pipes, scraps, cereals, granite, marbles, tiles, and copper concentrates. Further, it offers surface mining services; and bulk handling solutions at mines, as well as develops and operates mines. The company was founded in 1955 and is based in Bengaluru, India. Sical Logistics Limited is a subsidiary of Tanglin Retail Reality Developments Private Limited.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "SNOWMAN.NS": {
        "short_name": "SNOWMAN LOGISTICS",
        "long_name": "Snowman Logistics Limited",
        "summary": "Snowman Logistics Limited provides integrated temperature-controlled logistics services in India. The company operates through three segments: Warehousing Services, Transportation Services, and Consignment Agency Services. It offers warehousing solutions that cover ambient, chilled, frozen, and blast freezing facilities. The company also provides primary transportation services, such as door-to-door, customized milk run, and part cargo consolidation service; and secondary transportation services comprising last mile distribution to QSRs, retail outlets, restaurants and hotels, and others. It operates a fleet of approximately 293 refrigerated vehicles. In addition, the company offers retail distribution through a consignment agency services; and value added services, such as kitting, labelling, sorting, stuffing, and de-stuffing of containers, repacking, and bulk breaking. Further, the company sorts, grades, packs, and washes selected fruits and vegetables. The company was formerly known as Snowman Frozen Foods Limited and changed its name to Snowman Logistics Limited in March 2011. Snowman Logistics Limited was founded in 1993 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "TCIEXP.NS": {
        "short_name": "TCI EXPRESS LTD",
        "long_name": "TCI Express Limited",
        "summary": "TCI Express Limited provides express delivery solutions in India and internationally. The company provides services, including surface express; reverse express; domestic and international air express; and e-commerce express for the automotive, pharmaceutical, retail, engineering, apparel, e-commerce, and other industries. It has approximately 40,000 pickup and delivery points with approximately 5,000 containerized vehicles. The company was formerly known as TCI Properties (Pune) Limited. TCI Express Limited was founded in 1996 and is headquartered in Gurugram, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gurugram"
    }
}