{
    "ADVANIHOTR.NS": {
        "short_name": "ADVANI HOTELS & RE",
        "long_name": "Advani Hotels & Resorts (India) Limited",
        "summary": "Advani Hotels & Resorts (India) Limited engages in the hotel business in India. The company operates Caravela Beach Resort, a five-star deluxe resort with 198 rooms located on the white sands of Varca Beach, Goa. It also provides short term accommodation facilities; and restaurant and mobile food services. The company was formerly known as Ramada Hotels (India) Limited and changed its name to Advani Hotels & Resorts (India) Limited in 1999. The company was incorporated in 1987 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.caravelabeachresortgoa.com",
        "market_cap": "Nano Cap"
    },
    "AHLEAST.NS": {
        "short_name": "ASIAN HOTELS (EAST",
        "long_name": "Asian Hotels (East) Limited",
        "summary": "Asian Hotels (East) Limited engages in the hotel business in India. It operates Hyatt Regency Kolkata, a five-star hotel located in the city of Kolkata; and Hyatt Regency Chennai, a hotel situated in the city of Chennai. The company was formerly known as Vardhman Hotels Limited and changed its name to Asian Hotels (East) Limited in February 2010. Asian Hotels (East) Limited was incorporated in 2007 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700098",
        "website": "http://www.ahleast.com",
        "market_cap": "Nano Cap"
    },
    "AHLWEST.NS": {
        "short_name": "ASIAN HOTELS (WEST",
        "long_name": "Asian Hotels (West) Limited",
        "summary": "Asian Hotels (West) Limited, together with its subsidiaries, engages in the hotel business in India. It owns and operates the Hotel Hyatt Regency in Mumbai; and the JW Marriott Hotel, a five-star deluxe hotel with 523 rooms in New Delhi. The company was formerly known as Chillwinds Hotels Limited and changed its name to Asian Hotels (West) Limited in February 2010. Asian Hotels (West) Limited was incorporated in 2007 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110037",
        "website": "http://www.asianhotelswest.com",
        "market_cap": "Nano Cap"
    },
    "APOLSINHOT.NS": {
        "short_name": "APOLLO SINDOORI HO",
        "long_name": "Apollo Sindoori Hotels Limited",
        "summary": "Apollo Sindoori Hotels Limited operates as a hospitality service management and support services company in India. It provides catering services to corporates, institutions, hospitals, and industries; and kitchen planning and management services. The company also operates hotels in Chennai and Bengaluru. Apollo Sindoori Hotels Limited was incorporated in 1998 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600006",
        "website": "http://www.apollosindoori.com",
        "market_cap": "Nano Cap"
    },
    "ASIANHOTNR.NS": {
        "short_name": "ASIAN HOTELS(NORTH",
        "long_name": "Asian Hotels (North) Limited",
        "summary": "Asian Hotels (North) Limited engages in hospitality/hotel business in India. The company owns and operates Hyatt Regency Delhi, a five-star deluxe hotel, which includes 507 rooms and suites, spa, unisex salon, fitness center, restaurant, bar, and outdoor swimming pool in New Delhi. It also operates two wind turbine generators in Maharashtra. In addition, the company provides offshore project consultancy services; and develops villa hotel complex, including residential villas and golf course in Goa. Asian Hotels (North) Limited was incorporated in 1980 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110066",
        "website": "http://www.asianhotelsnorth.com",
        "market_cap": "Nano Cap"
    },
    "BLUECOAST.NS": {
        "short_name": "BLUE COAST HOTELS",
        "long_name": "Blue Coast Hotels Limited",
        "summary": "Blue Coast Hotels Limited does not have significant operations. Previously, the company was engaged in the hotel business. The company was formerly known as Blue Coast Hotels and Resorts Ltd. and changed its name to Blue Coast Hotels Limited in October 2009. Blue Coast Hotels Limited was incorporated in 1992 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.bluecoast.in",
        "market_cap": "Nano Cap"
    },
    "BYKE.NS": {
        "short_name": "THE BYKE HOSPITALI",
        "long_name": "The Byke Hospitality Limited",
        "summary": "The Byke Hospitality Limited owns, operates, and manages hotels and resorts in India. It operates 20 properties with a capacity of 1,190 rooms and 145 rooms under management contract under the The Byke brand. The company was founded in 1990 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400099",
        "website": "http://www.thebyke.com",
        "market_cap": "Nano Cap"
    },
    "CCHHL.NS": {
        "short_name": "COUNTRY CLUB HOSPI",
        "long_name": "Country Club Hospitality & Holidays Limited",
        "summary": "Country Club Hospitality & Holidays Limited provides leisure hospitality membership services in India. The company sells vacation ownership and other related services. It also provides clubbing hub, holiday destination, fitness center, and entertainment event services. The company has approximately 50 clubs, resorts, and hotels in India, the Middle East, Bangkok, and Sri Lanka. The company was formerly known as Country Club (India) Limited and changed its name to Country Club Hospitality & Holidays Limited in December 2014. Country Club Hospitality & Holidays Limited was founded in 1989 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500016",
        "website": "http://www.countryclubindia.net",
        "market_cap": "Nano Cap"
    },
    "CHALET.NS": {
        "short_name": "CHALET HOTELS LTD",
        "long_name": "Chalet Hotels Limited",
        "summary": "Chalet Hotels Limited develops, owns, and manages hotels in India. Its hotel platform comprises six operating hotels, including a hotel with a co-located serviced residence, located in Mumbai, Hyderabad, Pune, and Bengaluru representing 2,554 keys under the JW Marriott, Westin, Marriott, Marriott Executive Apartments, Renaissance, Four Points by Sheraton, and Novotel brands. The company is also involved in the commercial and retail operations, and real estate development. The company was formerly known as Chalet Hotels Pvt. Ltd and changed its name to Chalet Hotels Limited in June 2018. Chalet Hotels Limited was incorporated in 1986 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.chalethotels.com",
        "market_cap": "Small Cap"
    },
    "EIHAHOTELS.NS": {
        "short_name": "EIH ASSOC HOTELS",
        "long_name": "EIH Associated Hotels Limited",
        "summary": "EIH Associated Hotels Limited engages in the ownership, management, and operation of five star deluxe and five star hotels in India. It operates The Oberoi Cecil at Shimla and The Oberoi Rajvilas at Jaipur; and hotels under the Trident name in Agra, Bhubaneswar, Chennai, Cochin, Jaipur, and Udaipur. The company was formerly known as Oberoi Associated Hotels Limited and changed its name to EIH Associated Hotels Limited in November 1996. EIH Associated Hotels Limited was incorporated in 1983 and is based in Delhi, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Delhi",
        "zipcode": "110054",
        "website": "http://www.eihassociatedhotels.in",
        "market_cap": "Micro Cap"
    },
    "EIHOTEL.NS": {
        "short_name": "EIH LTD",
        "long_name": "EIH Limited",
        "summary": "EIH Limited engages in the ownership, development, management, and operation of hotels and cruisers in India and internationally. It owns a 100% equity interest in the six Â\u0091The Oberoi Hotels' located in Mumbai, New Delhi, Kolkata, Bengaluru, Udaipur, and Ranthambhore, as well as in Agra, Jaipur, and Shimla. The company also has a 100% equity interest in and manages the Trident, Nariman Point and Trident, and Bandra-Kurla Complex in Mumbai; and 36% equity interest in the Trident Hotels located in Agra, Bhubaneswar, Chennai, Cochin, Jaipur, and Udaipur, as well as manages the Trident in Gurugram. Further, it owns and operates Oberoi Flight Services and Oberoi Airport Services, which provide catering and other services to international airlines; operates restaurants and lounges in various airports; operates a commercial printing press; and provides air charter, car rental, and project management services, as well as operates the Maidens Hotel in Delhi. EIH Limited was incorporated in 1949 and is based in Delhi, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Delhi",
        "zipcode": "110054",
        "website": "http://www.eihltd.com",
        "market_cap": "Small Cap"
    },
    "HAVISHA.NS": {
        "short_name": "SRI HAVISHA HOSP A",
        "long_name": "Sri Havisha Hospitality and Infrastructure Limited",
        "summary": "Sri Havisha Hospitality and Infrastructure Limited does not have significant operations. The company intends to acquire or merge with other company, which is in hospitality/tourism business. Previously, it was engaged in bottling liquid petroleum gas. The company was formerly known as Shri Matre Power & Infrastructure Limited and changed its name to Sri Havisha Hospitality and Infrastructure Limited in November 2016. Sri Havisha Hospitality and Infrastructure Limited was incorporated in 1993 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500016",
        "website": "http://www.shrishakti.com",
        "market_cap": "Nano Cap"
    },
    "HLVLTD.NS": {
        "short_name": "HLV LIMITED",
        "long_name": "HLV Limited",
        "summary": "HLV Limited owns, operates, and manages hotel in Mumbai, India. It operates The Leela hotel with 391 guest rooms. The company was formerly known as Hotel Leelaventure Limited and changed its name to HLV Limited in December 2019. HLV Limited was incorporated in 1981 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400059",
        "website": "http://www.hlvltd.com",
        "market_cap": "Micro Cap"
    },
    "INDHOTEL.NS": {
        "short_name": "INDIAN HOTELS",
        "long_name": "The Indian Hotels Company Limited",
        "summary": "The Indian Hotels Company Limited, together with its subsidiaries, owns, operates, and manages hotels, palaces, and resorts in India and internationally. The company operates hotels under the Taj, SeleQtions, Vivanta, and Ginger brand names. It also operates salons, wellness spas, and boutiques, as well as provides ayurvedic services. As of March 31, 2020, the company operated approximately 200 hotels with 25,168 rooms in 100 locations. The Indian Hotels Company Limited was founded in 1899 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.ihcltata.com",
        "market_cap": "Mid Cap"
    },
    "ITDC.NS": {
        "short_name": "INDIA TOURISM DEV",
        "long_name": "India Tourism Development Corporation Limited",
        "summary": "India Tourism Development Corporation Limited, together with its subsidiaries, acquires, constructs, and operates hotels, beach resorts, and lodges/restaurants for tourists in India. The company also provides transport, entertainment, and shopping facilities; produces, distributes, and sells tourist publicity literature; and offers tourism and hospitality related training and education services, full-fledged money changer services, engineering related consultancy services, etc. In addition, it provides engineering technical services; management consultancy and advisory services; and consultancy services for adventure tourism sector, as well as prepares techno-economic feasibility reports. Further, the company manages events, conferences, and exhibitions; offers advertising and catering services; operates sound and light shows. As of March 31, 2020, it operated 4 Ashok Group of Hotels, 4 joint venture hotels, a restaurant, 14 duty free shops, 1 sound and light shows, 1 managed unit, and 4 catering establishments. India Tourism Development Corporation Limited was incorporated in 1965 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110003",
        "website": "http://itdc.co.in",
        "market_cap": "Small Cap"
    },
    "KAMATHOTEL.NS": {
        "short_name": "KAMAT HOTELS (IND)",
        "long_name": "Kamat Hotels (India) Limited",
        "summary": "Kamat Hotels (India) Limited, through its subsidiaries, engages in the hospitality business in India. It operates hotels and resorts under the brands, such as The Orchid, Fort Jadhavgadh, and Lotus Konark Resorts, as well as Mahodadhi Palace. The company also operates restaurants; and provides hotel consultancy, setups, and other related services. Kamat Hotels (India) Limited was founded in 1986 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400099",
        "website": "http://www.khil.com",
        "market_cap": "Nano Cap"
    },
    "LEMONTREE.NS": {
        "short_name": "LEMON TREE HOTELS",
        "long_name": "Lemon Tree Hotels Limited",
        "summary": "Lemon Tree Hotels Limited owns and operates a chain of business and leisure hotels. As of January 14, 2021, it operated 83 hotels with approximately 8,200 rooms across 50 destinations in India and internationally under various brands, including Aurika Hotels & Resorts, Lemon Tree Premier, Lemon Tree Hotels, Red Fox Hotels, Keys Prima, Keys Select and Keys Lite. The company also provides project design and management, as well as housing rental services. Lemon Tree Hotels Limited was founded in 1992 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110037",
        "website": "http://www.lemontreehotels.com",
        "market_cap": "Small Cap"
    },
    "ORIENTHOT.NS": {
        "short_name": "ORIENTAL HOTELS",
        "long_name": "Oriental Hotels Limited",
        "summary": "Oriental Hotels Limited owns, operates, and manages hotels, palaces, and resorts primarily in India. The company's hotel portfolio includes the Taj Coromandel, Chennai; Taj Fisherman's Cove Resort & Spa, Chennai; Taj Malabar Resort & Spa, Cochin; Vivanta, Coimbatore; The Gateway Hotel, Pasumalai, Madurai; Gateway, Coonoor; and The Gateway Hotel, Old Port Road, Mangalore. It also provides accommodation, restaurant, and catering services. The company was founded in 1970 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600034",
        "website": "http://www.orientalhotels.co.in",
        "market_cap": "Micro Cap"
    },
    "ROHLTD.NS": {
        "short_name": "ROYAL ORCHID HOTEL",
        "long_name": "Royal Orchid Hotels Limited",
        "summary": "Royal Orchid Hotels Limited operates and manages hotels and resorts in India. The company also provides restaurants and mobile food services. It operates 58 hotels and resorts with approximately 3,920 guest rooms, as well as 110 restaurants and bars in 39 cities. The company was formerly known as Universal Resorts Limited and changed its name to Royal Orchid Hotels Limited in 1997. Royal Orchid Hotels Limited was founded in 1973 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560008",
        "website": "http://www.royalorchidhotels.com",
        "market_cap": "Nano Cap"
    },
    "TAJGVK.NS": {
        "short_name": "TAJ GVK HOTELS",
        "long_name": "TAJGVK Hotels & Resorts Limited",
        "summary": "TAJGVK Hotels & Resorts Limited owns, operates, and manages hotels, palaces, and resorts under the Taj brand in India. It operates Taj Krishna, a 5-star hotel with 260 rooms, Taj Banjara with 122 rooms, Taj Deccan with 151 rooms, and Vivanta by Taj, a five star hotel with 181 rooms in Hyderabad. The company also operates Taj Chandigarh with 149 rooms in Chandigarh; Taj Club House with 220 rooms in Chennai; and Taj Santacruz with 279 rooms in Mumbai. The company was incorporated in 1995 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500034",
        "website": "http://www.tajgvk.in",
        "market_cap": "Micro Cap"
    },
    "TGBHOTELS.NS": {
        "short_name": "TGB BANQUETS AND H",
        "long_name": "TGB Banquets and Hotels Limited",
        "summary": "TGB Banquets and Hotels Limited provides restaurant, banquet, and hotel services in India and internationally. It operates hotels under The Grand Bhagwati name in Ahmedabad. The company also offers dining under the CafÃ© Piano and Mr. & Mrs. Somani name; and catering services. In addition, it operates convention centers under The Grand Bhagwati name, as well as clubs and events. The company was formerly known as Bhagwati Banquets and Hotels Limited and changed its name to TGB Banquets and Hotels Limited in April 2013. TGB Banquets and Hotels Limited was founded in 1989 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380054",
        "website": "http://www.thegrandbhagwati.com",
        "market_cap": "Nano Cap"
    },
    "VICEROY.NS": {
        "short_name": "VICEROY HOTELS LTD",
        "long_name": "Viceroy Hotels Limited",
        "summary": "Viceroy Hotels Limited engages in the hoteliering business in India. The company owns, operates, franchises, and markets a 297 room hotel with restaurants and a convention center under the Marriott name; a 120 room hotel with banquet halls and fine dine restaurant under the Courtyard Marriott name; a 56 room budget hotel under the Minerva name; restaurants under the Minerva Coffee Shop name; and fine dine bars under the Bluefox name in Hyderabad and Vijayawada. It also operates Eat Street, a food court with Minerva Coffee Shop and other kiosks, as well as Waterfront fine dine restaurant. Viceroy Hotels Limited was founded in 1965 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500081",
        "website": "http://www.viceroyhotels.in",
        "market_cap": "Nano Cap"
    }
}