{
    "ARCHIDPLY.NS": {
        "short_name": "ARCHIDPLY IND LTD",
        "long_name": "Archidply Industries Limited",
        "summary": "Archidply Industries Limited manufactures and sells wood and paper based products in India. It offers decorative laminates; archidply, monarchply, silvi, and ojus plywoods; and PVC boards, WPC board, and hybrid WPC board. The company also manufactures tea under the Bordhumsa Tea brand name. It sells its products to banks and insurance, educational institutes, airports, government projects, hospitals, hotels, multiplexes, corporates, apartment complexes, retails, universities, and builders. The company also exports its products to 20 countries. Archidply Industries Limited was founded in 1976 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "GREENPLY.NS": {
        "short_name": "GREENPLY INDUSTRIE",
        "long_name": "Greenply Industries Limited",
        "summary": "Greenply Industries Limited, an interior infrastructure company, manufactures, markets, trades in, and distributes plywood and allied products in India and internationally. The company provides plywood and block boards, decorative veneers, flush doors, wood floors, and PVC foam boards and sheets. It markets its products through a network of distributors, dealers, and retailers. The company was formerly known as Mittal Laminates Private Limited and changed its name to Greenply Industries Limited in 1995. Greenply Industries Limited was founded in 1990 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    },
    "MANGTIMBER.NS": {
        "short_name": "MANGALAM TIMBER",
        "long_name": "Mangalam Timber Products Limited",
        "summary": "Mangalam Timber Products Limited engages in the manufacture and sale of medium density fiberboards (MDF) in India. The company offers plain interior and exterior, as well as pre-laminated interior and exterior grade MDFs; and high density fiber boards. Its products are used in computer tables and workstations, TV tables, audio cabinets, beds and sofas, shop counters and shelves, wardrobes and cupboards, kitchen cabinets and suites, decorative doors and panels, sculptures and moldings, tables and desktops, packing boxes, toys and slates, photo laminations, and whiteboards. The company markets its products primarily under Duratuff brand. Mangalam Timber Products Limited was incorporated in 1982 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    },
    "UNIPLY.NS": {
        "short_name": "UNIPLY INDUSTRIES",
        "long_name": "Uniply Industries Limited",
        "summary": "Uniply Industries Limited manufactures and sells plywood and related products in India and internationally. The company also offers blockboards, doors, decorative veneers, laminates, liners, flooring, adhesives, and furniture and furnishing products. It also provides architecture and design; civil development; mechanical, electrical, and plumbing; interior solutions for commercial and residential spaces; and furniture and furnishing services. The company was incorporated in 1996 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "WIPL.NS": {
        "short_name": "THE WESTERN INDIA",
        "long_name": "The Western India Plywoods Limited",
        "summary": "The Western India Plywoods Limited manufactures and sells plywood, hard boards, densified wood, and other wood products in India. The company offers fire retardant and resin surfaced shuttering plywood for applications in industrial filters, and paneling and ceiling substrates in hotels, hospitals, theatres, etc.; marine plywood for boat building, and load and stress bearing industrial applications; and boiling water resistant plywood for use in furniture, structural work in interior design, auto motive coach building, and match-plates in foundries. It also provides standard hardboards for applications in automotive interior trims, shoe heel manufacture, fiber drum lid manufacture, clock backing, photo frame backing, furniture elements, partitions, etc.; oil tempered hardboards for shoe heel manufacture, automobile interior trims, and improving resistance to weathering; and perforated hardboards. In addition, the company offers densified wood laminates for specific heavy duty applications in various industries; pre-compressed pressboards for the high voltage and extra high voltage transformer industry; molded plywood furniture; and wooden floorings. It also exports its products. The Western India Plywoods Limited was founded in 1945 and is based in Kannur, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kannur"
    }
}