{
    "POLYMED.NS": {
        "short_name": "POLY MEDICURE LTD",
        "long_name": "Poly Medicure Limited",
        "summary": "Poly Medicure Limited manufactures and sells medical devices in India. It offers infusion devices, such as I.V. cannulas, mid line catheters, needle free connectors, three way stop cocks, I.V. infusion sets, extension lines, T-type extension sets, stylet/mandrin with luer locks, and safety winged infusion sets; and central venous catheters, vial access spikes, measured volume fluid administration sets, and CVP manometers. The company also provides anesthesia devices, including endotracheal tubes, tracheostomy tubes, mucus extractors, ventilator circuits, bain circuits, catheter mounts, spinal needles, HME filters, and laryngeal mask airways; and gastroenterology products, such as nasogastric feeding tubes, infant feeding tubes, gastro-duodenal feeding tubes, and umbilical catheters. In addition, it offers blood administration sets, blood collection tubes, safety blood collection sets, and blood collection needles; blood bag systems; oncology products; urology products, such as urine collection bags, foley balloon catheters, irrigation sets, urine drainage catheters, and urine collection bags with measured volume meters; and endo bronchial suction catheters, oxygen catheters, respiratory exercisers, nasal oxygen cannulas, variable concentration masks, oro- pharyngeal airways, oxygen mask with reservoirs, fixed concentration masks, and aerosol therapy masks. Further, it provides dialysis products, including fistula needles, haemodialysis catheters, peritoneal dialysis and transfusion sets, dialyzers, and blood lines; closed wound suction units, under water seal drainage systems, high pressure vacuum bottles, yankauer suction sets, and thoracic drainage catheters; and insulin syringes, sputum collectors, dry brushes, umbilical cord clamps, luer locks, cannula fixators, injection stoppers, luer lock injection sites, and universal caps. The company also exports its products. Poly Medicure Limited was founded in 1995 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    }
}