{
    "APOLLOHOSP.NS": {
        "short_name": "APOLLO HOSPITALS.",
        "long_name": "Apollo Hospitals Enterprise Limited",
        "summary": "Apollo Hospitals Enterprise Limited, together with its subsidiaries, provides healthcare services in India and internationally. The company's healthcare facilities comprise primary, secondary, and tertiary care facilities. Its tertiary care hospitals provide care in approximately 55 specialties, including cardiac sciences, oncology, critical care, neurosciences, orthopedics, gastroenterology, and transplants. The company also provides other services, such as project consultancy, health insurance, and research services. In addition, it operates pharmacies, primary care clinics, birthing centers, specialized birthing centers, single specialty clinics, primary health centers and diagnostic chains, dental clinics, and daycare and home healthcare centers. The company's footprint includes 10,167 beds, 3,428 pharmacies, and 765 retail healthcare centers. Apollo Hospitals Enterprise Limited was founded in 1979 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600006",
        "website": "http://www.apollohospitals.com",
        "market_cap": "Large Cap"
    },
    "FORTIS.NS": {
        "short_name": "FORTIS HLTH (INDIA",
        "long_name": "Fortis Healthcare Limited",
        "summary": "Fortis Healthcare Limited, an integrated healthcare delivery service provider, offers secondary, tertiary, and quaternary care in India, the United Arab Emirates, Sri Lanka, and internationally. Its healthcare verticals comprise hospitals, diagnostics, and day care specialty facilities. The company offers services in the areas of cardiac care, orthopedics, neurosciences, oncology, renal care, metabolic diseases, and mother and child care. As of February 5, 2021, it operated a network of 36 healthcare facilities with approximately 4,000 operational beds. The company also operates approximately 400 diagnostics centers and laboratories; and 1,400 collection centers. The company was founded in 1995 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122001",
        "website": "http://www.fortishealthcare.com",
        "market_cap": "Large Cap"
    },
    "HCG.NS": {
        "short_name": "HEALTHCARE GLOBAL",
        "long_name": "HealthCare Global Enterprises Limited",
        "summary": "HealthCare Global Enterprises Limited, together with its subsidiaries, provides healthcare services focusing on cancer. The company offers cancer diagnosis and treatment services through radiation therapy, medical oncology, and surgery; and fertility treatment services, as well as reproductive medicine services, including assisted reproduction, gynecological endoscopy, and fertility preservation under the Milann brand. It also operates four multi-specialty hospitals, including three under the HCG brand in Ahmedabad, Bhavnagar, and Rajkot in the state of Gujarat, as well as one under operations and management contract in Hubli in the state of Karnataka that primarily provide cardiology, neurology, orthopedics, gastroenterology, urology, internal medicine, and pulmonary and critical care. In addition, the company offers medical diagnostic services, including scientific testing and consultancy services in the pharmaceutical and medical sector. As of March 31, 2020, it operated 22 cancer centers, including 1 center of excellence in Bengaluru, 3 freestanding diagnostic centers, and 1 day care chemotherapy center across India, as well as 1 center in Africa. The company was founded in 1989 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560027",
        "website": "http://www.hcgel.com",
        "market_cap": "Large Cap"
    },
    "INDRAMEDCO.NS": {
        "short_name": "INDRAPRASTHS MEDIC",
        "long_name": "Indraprastha Medical Corporation Limited",
        "summary": "Indraprastha Medical Corporation Limited provides hospital services in India. It offers services primarily in the areas of anesthesiology, advanced pediatrics, bone marrow transplant, cosmetic and plastic surgery, dental clinic, dermatology, elder care department, neonatology, general and advance laparoscopic surgery, pediatric urology and pediatric surgery, endocrinology, ear, nose, throat, fetal medicine, gastroenterology and GI surgery, gynecology and obstetrics, heart institutes, infertility care, critical care, bariatric, cancer, emergency, nephrology, neurosciences, orthopedics, robotic surgery, spine, transplant, internal medicine, nuclear medicine, ophthalmology, psychiatry and clinical psychology, radiology/radio diagnosis, rheumatology, urology and andrology, and vascular and endovascular surgery. The company also operates cosmetic and pain clinic, and wellness center, as well as Apollo 24/7 app; and offers services in the areas of sugar, dietetics and clinical nutrition, hyperbaric oxygen therapy, laboratory services, physiotherapy and rehabilitation, and transfusion medicine. Indraprastha Medical Corporation Limited was incorporated in 1988 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110076",
        "website": "http://www.delhi.apollohospitals.com",
        "market_cap": "Mid Cap"
    },
    "LOTUSEYE.NS": {
        "short_name": "LOTUS EYE HOSPITA",
        "long_name": "Lotus Eye Hospital and Institute Limited",
        "summary": "Lotus Eye Hospital and Institute Limited, an eye hospital, provides eye care services in India. It offers services in the areas of refractive surgery, retina and uvea, cornea, glaucoma, paediatric and squint, orbit and oculoplasty, and neuro ophthalmology, as well as binocular vision. The company also provides cataract and intraocular lenses, as well as operates an eye bank. In addition, it offers ophthalmic fellowship training courses in cornea, glaucoma, retina, and anterior segments, as well as DNB teaching and training services. The company was formerly known as Lotus Eye Care Hospital Limited and changed its name to Lotus Eye Hospital and Institute Limited in April 2013. Lotus Eye Hospital and Institute Limited was incorporated in 1997 and is based in Coimbatore, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Coimbatore",
        "zipcode": "641014",
        "website": "http://www.lotuseye.org",
        "market_cap": "Small Cap"
    },
    "MAXHEALTH.NS": {
        "short_name": "Max Healthcare Ins Ltd",
        "long_name": "Max Healthcare Institute Limited",
        "summary": "Max Healthcare Institute Limited provides healthcare services in India. It offers services in various specialties, including cancer care/oncology, liver transplant and biliary sciences, cardiac sciences, neuro sciences, orthopaedics, bariatric/weight loss surgery, minimal access/laparoscopic surgery, bone marrow transplant, kidney transplant, nephrology, and aesthetic and reconstructive surgery. As of August 31, 2020, the company operated a network of 17 healthcare facilities, including 11 state-of-the-art tertiary and quaternary care hospitals, one secondary care hospital, and five OPD and day care centers. The company is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122002",
        "website": "http://www.maxhealthcare.in",
        "market_cap": "Large Cap"
    },
    "MAXIND.NS": {
        "short_name": "Max India Limited",
        "long_name": "Max India Limited",
        "summary": "Max India Limited operates in the senior care and skilling industry. The company operates residential communities for seniors; and provides assisted care services. It is also involved in the learning and development activities; and distribution of insurance and other financial products. The company, formerly known as Advaita Allied Health Services Limited, was incorporated in 2019 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400018",
        "website": "http://www.maxindia.com",
        "market_cap": "Mid Cap"
    },
    "NH.NS": {
        "short_name": "NARAYANA HRUDAYALA",
        "long_name": "Narayana Hrudayalaya Limited",
        "summary": "Narayana Hrudayalaya Limited provides healthcare services. The company operates a chain of multispecialty, tertiary, and primary healthcare facilities. It offers services in approximately 30 specialties, including cardiology and cardiac surgery, cancer care, neurology and neurosurgery, endocrinology, orthopedics, nephrology and urology, obstetrics, pediatrics, neonatology, gynecology, oncology, and gastroenterology. The company operates through a network of 24 hospitals, 7 heart centers, and 19 primary care facilities in India, as well as an international hospital in the Cayman Islands with approximately 6,200 operational beds. Narayana Hrudayalaya Limited was founded in 2000 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560099",
        "website": "http://www.narayanahealth.org",
        "market_cap": "Large Cap"
    },
    "SHALBY.NS": {
        "short_name": "SHALBY LTD",
        "long_name": "Shalby Limited",
        "summary": "Shalby Limited operates multi-specialty hospitals primarily in India. The company offers arthroscopy, arthroplasty, cardiology, cardiothoracic and vascular surgery, cosmetic and aesthetic, dental cosmetic and implant ology, emergency medicine, endocrinology, endoscopy and laparoscopy, ENT surgery, gastroentero surgery, gastroenterology, general medicine and surgery, hair transplant, liver disease and transplant, and hip and knee joint replacement services. It also provides infectious disease, infertility and IVF, intensive and critical care, maxillofacial surgery, nephrology, neuro surgery, neurology, obesity surgery, obstetrics and gynecology, oncology, oncosurgery, ophthalmology and glaucoma, orthopedic and trauma, pediatric orthopedic, pathology and microbiology, pediatrics and neonatology, plastic surgery, pulmonology and chest, radiology and imaging, rheumatology, trauma, organ donation, and urosurgery services. The company operates 11 hospitals comprising aggregate capacity of 2,012 beds. In addition, it offers outpatient services through 37 outpatient clinics and shared surgery centers within third party hospitals, as well as provides hospital management contract services; educational programs and fellowships for paramedical students and other healthcare professionals; and homecare health services, such as attendants, doctors, nursing, physiotherapy, pathology, pharmacy, and medical equipment, as well as conducts clinical research trials. It also operates in Kenya, Tanzania, Rwanda, Uganda, the United Arab Emirates, Bangladesh, Cambodia, Jakarta, Oman, Uzbekistan, Nepal, and internationally. The company was formerly known as Shalby Hospitals Limited and changed its name to Shalby Limited in February 2008. Shalby Limited was founded in 1994 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380015",
        "website": "http://www.shalby.org",
        "market_cap": "Large Cap"
    }
}