{
    "ALICON.NS": {
        "short_name": "ALICON CASTALLOY L",
        "long_name": "Alicon Castalloy Limited",
        "summary": "Alicon Castalloy Limited, together with its subsidiaries, engages in the prototyping, design, manufacture, engineering, casting, machining and assembly, painting, and surface treatment of aluminum components worldwide. It manufactures aluminum alloy die castings, such as sand, gravity die, and low pressure die castings. The company offers cylinder heads, battery and bell housings, water pump and compressor housings, intake manifolds, F2A and inverter housings, coolant collectors, and CNC tanks, as well as suspension parts, wheel hubs, bridge fork tops, outer tubes, and inlet pipes. Its products are used in various sectors, such as automobiles, agriculture, aero and marine, locomotive, infrastructure, e-mobility, energy, defense, and medical and health. The company was formerly known as Enkei Castalloy Limited. Alicon Castalloy Limited was incorporated in 1990 and is based in Pune, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "412208",
        "website": "http://www.alicongroup.co.in",
        "market_cap": 7544192000
    },
    "ARCOTECH.NS": {
        "short_name": "ARCOTECH LTD",
        "long_name": "Arcotech Limited",
        "summary": "Arcotech Limited manufactures and supplies non-ferrous engineering products primarily in India. The company offers non-ferrous alloy products, including copper, brass, phosphor bronze, nickel silver, nickel brass, cupro nickel, aluminum bronze, tin bearing copper, silver bearing copper, etc. in the form of semis, such as ingots, strips, sheets, plates, foils, bus bars, and rods, as well as coin blanks, lugs, key blanks, terminals, connectors, etc. It also offers HSS, carbide, and graphite tools; and value-added services, including welding, riveting, tapping, and mechanical assembly services. The company serves various manufacturers of electronic, electrical/power transmission, switchgear, HT cables, auto components, radiators, keys and locks, zippers, sanitary fittings, torches, and coins. Arcotech Limited also exports its products to approximately 21 countries in Asia, Africa, North America, South America, Australia, and Europe. The company was incorporated in 1981 and is based in Haryana, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bawal",
        "zipcode": "123501",
        "website": "http://www.arcotech.in",
        "market_cap": 137177408
    },
    "BILENERGY.NS": {
        "short_name": "BIL ENERGY SYSTEMS",
        "long_name": "Bil Energy Systems Limited",
        "summary": "Bil Energy Systems Limited manufactures and sells electrical steel products and other steel products primarily in India. Its products include stampings for rotating machines and electrical laminations for transformer. The company offers tailor-made circular stampings and segmental stampings for alternators, motors, wind mill generators, hydro generators, turbo generators, compressors for air conditioners and refrigerators, AC/DC motors of agriculture pumps, fans, computer transformers, and ballasts, as well as a range of IEC frame tools to manufacture circular stampings. It also provides CRGO slit coils, transformer core laminations of various shapes and sizes, and built-up cores for transformer and locomotive jobs; and other stamping products. Bil Energy Systems Limited was incorporated in 2010 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400064",
        "website": "http://www.bilenergy.com",
        "market_cap": 158562000
    },
    "DCM.NS": {
        "short_name": "D.C.M",
        "long_name": "DCM Limited",
        "summary": "DCM Limited, together with its subsidiaries, primarily engages in the grey iron casting and real estate businesses in India and internationally. The company manufactures and supplies grey iron castings for automotive market, such as cars, multi-utility vehicles, tractors, light commercial vehicles, heavy commercial vehicles, and earth moving equipment; and develops a real estate site located at Bara Hindu Rao/Kishan Ganj, Delhi. It is also involved in the yarn manufacturing and IT infrastructure services. The company was formerly known as Delhi Cloth & General Mills Co. Limited and changed its name to DCM Limited in October 1983. DCM Limited was founded in 1889 and is based in Delhi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Delhi",
        "zipcode": "110006",
        "website": "http://www.dcm.in",
        "market_cap": 776966144
    },
    "DPWIRES.NS": {
        "short_name": "D P Wires Limited",
        "long_name": "D.P. Wires Limited",
        "summary": "D.P. Wires Limited manufactures and supplies steel wires, plastic pipes, and plastic films for oil and gas, power, environment, civil, energy, automobile, infrastructure, and other industries worldwide. The company offers LRPC and PC strand wires; HDPE and heavy duty geomembrane sheets, geomembrane and construction polythene films, HDPE geomembrane films, and geomembrane and pond liners; plastic film sheets; and spring steel wires, PC single wire stress bars, PC single wires, intended PC wires, and PC steel wires. It is also involved in the wind power generation business. The company was founded in 1998 and is headquartered in Ratlam, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ratlam",
        "zipcode": "457001",
        "website": "http://www.dpwires.co.in",
        "market_cap": 2379827200
    },
    "ELECTHERM.NS": {
        "short_name": "ELECTROTHERM (INDI",
        "long_name": "Electrotherm (India) Limited",
        "summary": "Electrotherm (India) Limited manufactures and markets induction furnace, casting machines, transformers, sponge and pig iron, ferrous and non-ferrous billets/bars/ingots, ductile iron pipes, transmission line towers, and battery operated vehicles in India and internationally. It operates through Engineering & Project, Special Steel, and Electric Vehicle divisions. The company offers induction melting furnaces, electric arc furnaces, metal refining converters, refining furnaces, high speed continuous casting machines, power distribution and furnace transformers, induction heating and hardening equipment for heat treatment, and other equipment for steel plants and foundries; and turnkey solutions. It also provides corrosion resistant steel bars, cut and bend TMT bars, epoxy coated TMT bars, and other steel products; structures for transmission line towers, power sub-stations, solar power plants, and other engineering structures; and ductile iron pipes. In addition, the company offers electric bikes and scooters under the Yo Bykes brand name; battery operated two-wheelers; and motors, chargers, controllers, and converters. Further, it provides solar water heating systems under the eleCtra brand name. Additionally, the company offers services for steel melting and other capital equipment. Electrotherm (India) Limited was founded in 1983 and is headquartered in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "382115",
        "website": "http://www.electrotherm.com",
        "market_cap": 1830728960
    },
    "GANDHITUBE.NS": {
        "short_name": "GANDHI SPECIAL TUB",
        "long_name": "Gandhi Special Tubes Limited",
        "summary": "Gandhi Special Tubes Limited manufactures and markets welded and seamless steel tubes in India. The company offers cold drawn bright annealed seamless steel tubes; precision electric resistance welded steel tubes; cold formed coupling nuts; and high pressure diesel fuel injection tubes. It supplies its products primarily to the original equipment manufacturers of the automotive sector, farm equipment manufacturers, construction equipment manufacturers, and other engineering industries. The company is also involved in the wind power generation activities in Maharashtra and Gujarat. It exports its products to Germany, the United Kingdom, South East Asian countries, etc. The company was formerly known as Gandhi Special 07 Tubes Ltd. Gandhi Special Tubes Limited was incorporated in 1985 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400007",
        "website": "http://www.gandhispecialtubes.com",
        "market_cap": 3935141888
    },
    "GOODLUCK.NS": {
        "short_name": "GOODLUCK INDIA LTD",
        "long_name": "Goodluck India Limited",
        "summary": "Goodluck India Limited manufactures and exports a range of galvanized sheets and coils, towers, hollow sections, cold rolled coils, and pipes and tubes worldwide. The company provides galvanized pipes, including welded tubes and pipes, hot dip galvanized pipes, black pipes, grooved pipes, pre galvanized pipes, and casing and screen pipes; square and rectangular pipes, such as square, rectangular, and round hollow sections; and cold rolled coils and sheets, galvanized coils, galvanized sheets, cold rolled close annealed, and pickling and oiling of HR coils. It also offers cold drawn welded (CDW) tubes comprising CDW/DOM, seamless, precision, bicycle frame, engineering, boiler, heat exchanger, propeller shaft, transformer, fuel and air, furniture, structural, and telescopic front fork tubes, as well as bobbin tubes for textile machines, automotive shock absorbers, and steel tubes for automobiles. In addition, the company provides forgings; and substation structures, support structures for boiler and other equipment, infrastructure project structures, ducting support structures, solar module mounting structures, and fabricated equipment, as well as transmission and telecom towers. It serves clients from public sector, private sector OEMs, and central and state government departments. The company was formerly known as Good Luck Steel Tubes Limited and changed its name to Goodluck India Limited in June 2016. Goodluck India Limited was founded in 1986 and is based in Ghaziabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ghaziabad",
        "zipcode": "201001",
        "website": "http://www.goodluckindia.com",
        "market_cap": 2782951936
    },
    "GRAVITA.NS": {
        "short_name": "GRAVITA INDIA LTD",
        "long_name": "Gravita India Limited",
        "summary": "Gravita India Limited manufactures and recycles aluminum, lead, and lead products in India and internationally. It operates through Lead Processing, Aluminium Processing, Turn-Key Solutions, and Plastic Manufacturing segments. The company manufactures lead metal products, including pure lead/refined lead ingots and remelted lead ingots, as well as lead alloys, such as lead-antimony, lead-selenium, lead-calcium, lead-copper, lead-tin solder alloys, etc. It also provides lead products comprising sheets, powder, plates, balls, wires, bricks, wool, foils, cames, flanges, blankets, weights, sheaths, pipes, anodes, and lead coolants in nuclear power. In addition, the company offers lead chemicals and oxides consisting of lead sub oxide, red lead, lead nitrate, litharge, and lead mono silicate products; and radiation protection products for a range of radiation shielding applications. Further, it manufactures aluminium alloy ingots; and plastic products, such as polypropylene granules and PET bottle flakes, as well as provides turn-key solutions for lead acid battery recycling processes and plants. The company was founded in 1992 and is based in Jaipur, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Jaipur",
        "zipcode": "302004",
        "website": "http://www.gravitaindia.com",
        "market_cap": 7437320704
    },
    "HILTON.NS": {
        "short_name": "HILTON METAL FORGI",
        "long_name": "Hilton Metal Forging Limited",
        "summary": "Hilton Metal Forging Limited manufactures and sells iron and steel forgings for oil and gas, refinery, and pharmaceutical industries in India. The company offers stainless steel, high pressure, threaded, blind, weld neck, and socket welded flanges; and forged and hydraulic fittings. It also provides engineered parts; crank shafts; body bonnets; stub ends; forged components; top deck covers; and Christmas tree components, such as high pressure valve bodies, bonnets, choke bodies, crosses, casing spools, casing heads, and studs. The company also exports its products. Hilton Metal Forging Limited was founded in 2005 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400064",
        "website": "http://www.hiltonmetal.com",
        "market_cap": 157415232
    },
    "KIRLFER.NS": {
        "short_name": "Kirloskar Ferrous Ind Ltd",
        "long_name": "Kirloskar Ferrous Industries Limited",
        "summary": "Kirloskar Ferrous Industries Limited manufactures and sells iron castings in India. The company supplies pig iron, including foundry, spherodized graphite, and basic grade pig iron to foundries serving the auto, engines and compressors, textile, pumps, pipes, fittings, fans, etc. through agent, dealer, and branch offices. It also produces grey iron and spherodized graphite iron castings for various applications, such as cylinder blocks, cylinder heads, and housings for automobile, tractor, and diesel engine industries. The company was founded in 1991 and is based in Pune, India. Kirloskar Ferrous Industries Limited is a subsidiary of Kirloskar Industries Limited.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411003",
        "website": "http://www.kirloskarferrous.com",
        "market_cap": 32678758400
    },
    "KIRLOSIND.NS": {
        "short_name": "KIRLOSKAR IND LTD",
        "long_name": "Kirloskar Industries Limited",
        "summary": "Kirloskar Industries Limited manufactures and sells iron castings in India. It generates and sells wind-power electricity through seven windmills with total installed capacity of 5.6 megawatts in Maharashtra; owns lands and building, and apartments and offices; and invests in properties and securities. The company was formerly known as Kirloskar Oil Engines Limited and changed its name to Kirloskar Industries Limited in March 2010. The company was incorporated in 1978 and is based in Pune, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411005",
        "website": "http://www.kil.net.in",
        "market_cap": 16747012096
    },
    "LGBFORGE.NS": {
        "short_name": "LGB FORGE LTD",
        "long_name": "LGB Forge Limited",
        "summary": "LGB Forge Limited manufactures and sells forged and machined components in India. The company offers auto, electrical, and transmission forged components to automobiles and non-automotive segments. Its products include hot forging products, such as sring seedle bottoms, VWH connecting rods, valve bonnets, brake flange forgings, rocker arms, sonalika and differential bevel pinions, and bucket tooths; and hot and warm forging products comprising bells, body starter clutches, tulips, and claws. The company also provides cold forging products, including ball pins, ball rods, boss rotors, fuel pump components, shafts, pinions, sleeves, and sockets, as well as pulleys, pleungers, and two wheeler gears. It also exports its products. The company was incorporated in 2006 and is based in Coimbatore, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Coimbatore",
        "zipcode": "641006",
        "website": "http://www.lgbforge.co.in",
        "market_cap": 1149566464
    },
    "MANAKCOAT.NS": {
        "short_name": "MANAKSIA COATED ME",
        "long_name": "Manaksia Coated Metals & Industries Limited",
        "summary": "Manaksia Coated Metals & Industries Limited manufactures and sells metal and household products in India and internationally. The company offers color coated pre painted galvanized steel, aluminum-zinc steel, and aluminum coils; and color coated (pre-painted) steel and aluminum sheets, as well as manufacture ultramarine blue powder used for improving whiteness of clothes and white washing/painting of walls. It also provides carbon steel, low alloy steel, high alloy steel, manganese steel, heat resistant, and grey iron/cast iron castings, as well as S G iron products to petrochemical, oil, gas, power, mining, steel, cement, OEM, transport, and engineering industries. In addition, the company offers mosquito repellent coils, liquid vaporizers, incense, and paper cards, as well as aerosol for mosquitoes and other crawling insects; and pre-coated sheets. The company was incorporated in 2010 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500034",
        "website": "http://www.manaksiacoatedmetals.com",
        "market_cap": 1048484416
    },
    "MANAKSIA.NS": {
        "short_name": "MANAKSIA LTD",
        "long_name": "Manaksia Limited",
        "summary": "Manaksia Limited, together with its subsidiaries, manufactures and sells metal products in India and internationally. The company offers sponge iron and value added steel products comprising cold rolled sheets used in interior and exterior panels of automobiles, buses, and commercial vehicles; galvanised corrugated sheets used in the rural housing sector and factory buildings; galvanised plain sheets used in the manufacture of containers and water tanks; and colour coated (pre-painted) coils and sheets for sale to construction, housing, consumer durable, and other industries. It also provides aluminium rolled products in coil and sheet form used in closures, bus bodies, flooring, and general engineering purposes; colour coated (pre-painted) coils and sheets for the manufacture of heat exchanger fins for air conditioners in the HVAC sector; and aluminium alloy ingots used in the steel and automotive industry. In addition, the company offers roll on pilfer proof closures for liquor and pharmaceutical sectors, as well as crown closures for beer and carbonated soft drink sectors; and kraft, brown, and fluting paper, as well as engages in the sale of other machinery and equipment. The company was formerly known as Hindusthan Seals Ltd. Manaksia Limited was incorporated in 1984 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700001",
        "website": "http://www.manaksia.com",
        "market_cap": 4640704512
    },
    "METALFORGE.NS": {
        "short_name": "METALYST FORGINGS",
        "long_name": "Metalyst Forgings Limited",
        "summary": "Metalyst Forgings Limited manufactures and sells forged automotive components primarily in India. It has a product portfolio with a range of engineered components, including camshafts, connecting rods, crankshaft, crown wheel pinions, and front axle beams. The company provides components for two/three wheelers, passenger cars, tractors, light commercial vehicles (LCV), heavy commercial vehicles (HCV), and stationary engines. In addition, it exports its products. The company was formerly known as Ahmednagar Forgings Limited and changed its name to Metalyst Forgings Limited in May 2015. Metalyst Forgings Limited was founded in 1977 and is based in Pune, India. Metalyst Forgings Limited operates as a subsidiary of Amtek Auto Ltd.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "410501",
        "website": "http://www.amtek.com/mfl.php",
        "market_cap": 325640576
    },
    "MMFL.NS": {
        "short_name": "M.M. FORGINGS",
        "long_name": "M M Forgings Limited",
        "summary": "M M Forgings Limited, together with its subsidiaries, manufactures and sells steel forgings in India. The company offers steel forgings in raw, semi-machined, and fully machined stages in various grades of carbon, alloy, micro-alloy, and stainless steels. It also produces green energy from its solar and wind farms. The company also exports its products. The company was formerly known as The Madras Motors Ltd and changed its name to M M Forgings Limited in 1993. M M Forgings Limited was incorporated in 1945 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600032",
        "website": "http://www.mmforgings.com",
        "market_cap": 14142055424
    },
    "MTARTECH.NS": {
        "short_name": "MTAR Technologies Limited",
        "long_name": "MTAR Technologies Limited",
        "summary": "MTAR Technologies Limited, a precision engineering solutions company, develops, manufactures, and sells high precision components and equipment in India and internationally. The company offers fuel machining heads, transfer magazine bridges, coolant channel and columns, standpipe thimble assembly, liner tube, ball screws, sealing plugs, shielding plugs, fuel locator assembly adjustor rod mechanisms, shut off rod drive mechanisms calendria, PFBR assemblies, grid plate, control plug, grid plates, control plug, end fittings, drive mechanisms, top hatch cover beams and deck plate assemblies, CHAS products, and ball screws and water lubricated bearings for use in nuclear sector. It also provides base shroud assemblies and air frames, actuator assembly components, LCA components, missile parts, valves, electro-pneumatic modules electro-pneumatic modules, liquid propulsion engines, cryogenic engines, ball screws, and water lubricated bearings for use in space and defense sectors; and power units for clean energy sector. The company was founded in 1970 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500037",
        "website": "http://www.mtar.in",
        "market_cap": 31629778944
    },
    "NELCAST.NS": {
        "short_name": "NELCAST LTD",
        "long_name": "Nelcast Limited",
        "summary": "Nelcast Limited manufactures and sells ductile and grey iron castings in India and internationally. The company provides commercial components, including bogie suspension brackets, conventional suspension/engine/steering/cab mounting brackets, rear and forward differential carriers, flanged and plain half products, wheel hubs, bearing caps, brake drums, and brake disc rotors; and tractor/farm components comprising hydraulic lift covers, and front engine support, as well as axle, four-wheel drive front axle, transmission clutch, and center/differential housing products. It also offers off highway/army components consisting of transmission and differential cases, converter and axle housing, and planetary carriers; railway products, such as brake discs and base plates for ballastless track systems; SUV/car components that include case bodies and caps, and drive heads; and powertrain components comprising gearbox and flywheel housing, and exhaust manifold products. The company serves automotive, tractor, construction, mining, railways, and general engineering sectors. Nelcast Limited was incorporated in 1982 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600018",
        "website": "http://nelcast.com",
        "market_cap": 6768441856
    },
    "ORIENTREF.NS": {
        "short_name": "ORIENT REFRACTORIE",
        "long_name": "Orient Refractories Limited",
        "summary": "Orient Refractories Limited manufactures and trades in refractories, monolithics, and ceramic paper for the iron and steel industry primarily in India. The company offers isostatically pressed continuous casting refractories; slide gate plate; nozzles and well blocks; tundish nozzles for controlling the flow of steel; and bottom purging refractories and top purging lances, including porus plugs, PP housing blocks, and porus plug sleeves for a range of systems comprising GP II, GP III, and IPV with systems. It also provides slag arresting darts for use in converters; basic spray mass for tundish working linings; and conventional and low cement castables. It also exports its products to approximately 35 countries worldwide, including Germany, France, Spain, Turkey, Egypt, Indonesia, Saudi Arabia, Thailand, the United Arab Emirates, and Greece. The company was incorporated in 2010 and is based in Mumbai, India. Orient Refractories Limited is a subsidiary of Dutch US Holding B.V.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400086",
        "website": "http://www.orientrefractories.com",
        "market_cap": 37391925248
    },
    "PITTIENG.NS": {
        "short_name": "PITTI ENGINEERING",
        "long_name": "Pitti Engineering Limited",
        "summary": "Pitti Engineering Limited manufactures and sells electrical steel laminations, stampings, motor cores, sub-assemblies, die-cast rotors, and press tools in India and internationally. The company manufactures laminations for use in home appliances, aerospace, railways, power generation, medical equipment, consumer motors, industrial motors, special purpose motors, etc., as well as rotor aluminum die-casting and rotor shaft insertion products. It also offers jigs and fixtures, and pressure die casting products, as well as metal scraps. In addition, the company offers windmills castings, assembled laminations stacks, compressor castings, stator frames, transmission housings, and parts for off highway vehicles; and ductile iron, grey iron, and plain carbon steel grades, as well as components for various industries, including railways off highway vehicles, earthmoving equipment, compressors, windmills, power sector, transmission parts, oil and gas, etc. It also exports its products. The company was formerly known as Pitti Laminations Limited and changed its name to Pitti Engineering Limited in May 2018. Pitti Engineering Limited was founded in 1983 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500082",
        "website": "http://www.pitti.in",
        "market_cap": 3346865920
    },
    "SANGHVIFOR.NS": {
        "short_name": "SANGHVI FORGING &",
        "long_name": "Sanghvi Forging & Engineering Limited",
        "summary": "Sanghvi Forging & Engineering Limited engages in the manufacture and sale of open and closed die forging products in India. The company offers heavy forging products, such as forged bars, shaft and step shafts, tube sheets, shell forgings, forged pipes and hollow shaft forgings, rings, die blocks and rounds, BOP and valve bodies, and heavy machine products. It also provides forged flanges and components, including forged and open die flanges, instrument and ball forgings, and components. The company serves power, oil and gas, iron and steel, ship building, offshore and marine, tool and die steels, high pressure flanges, and mechanical industries. It also exports its products to Australia, Brazil, Colombia, Canada, France, Germany, Italy, Japan, Kuwait, the Netherlands, Russia, the Kingdom of Saudi Arabia, the United States, the United Arab Emirates, and internationally. Sanghvi Forging & Engineering Limited was founded in 1989 and is headquartered in Vadodara, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Vadodara",
        "zipcode": "390004",
        "website": "http://www.sanghviforge.com",
        "market_cap": 245722832
    },
    "SRIPIPES.NS": {
        "short_name": "SRIKALAHASTHI PIPE",
        "long_name": "Srikalahasthi Pipes Limited",
        "summary": "Srikalahasthi Pipes Limited manufactures and sells ductile iron (DI) pipes in India. The company offers DI socket and spigot, spun, and flanged pipes under the SRIPIPES brand name to water boards, municipal corporations, and turnkey contractors for use in water infrastructure development projects. It also provides low ash metallurgical coke; pig iron for applications, such as engine blocks, crankshafts, steel mills, pump housing, machine tools, etc.; and Portland slag cement under the SPL Gold name. The company was formerly known as Lanco Industries Limited and changed its name to Srikalahasthi Pipes Limited in September 2014. Srikalahasthi Pipes Limited was founded in 1991 and is based in Chittoor, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chittoor",
        "zipcode": "517641",
        "website": "http://www.srikalahasthipipes.com",
        "market_cap": 8847011840
    },
    "TEMBO.NS": {
        "short_name": "Tembo Global Ind Ltd",
        "long_name": "Tembo Global Industries Limited",
        "summary": "Tembo Global Industries Limited manufactures and fabricates various steel products in India and internationally. It offers various products, such as pipe hangers; anti-vibration systems; floor drains; fasteners; dielectric fittings; cable trays; conduits; earthing accessories; and ERW pipes. The company also trades in textile products. It markets its products through dealers under the Tembo Seven Star and Etalia brands. The company's products have applications in pipe hangers, support systems, HVAC systems, anti-vibration systems and equipment for construction, industrial, commercial, utility, and OEM Installations. The company was formerly known as Saketh Exim Limited. Tembo Global Industries Limited was founded in 2010 and is based in Navi Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Navi Mumbai",
        "zipcode": "400705",
        "website": "http://www.nut-clamps.com",
        "market_cap": 1385845632
    },
    "TIRUPATIFL.NS": {
        "short_name": "Tirupati Forge Limited",
        "long_name": "Tirupati Forge Limited",
        "summary": "Tirupati Forge Limited manufactures and sells carbon steel forged flanges, and forged and other automotive components in India. The company provides slip-on, weld-neck, blind, lap-joint, threaded, and socket weld flanges; and din, conical, and plate flanges. It also offers auto parts, bearings, gears, crank shafts, hammer unions, forged pipe fittings, and seamless rolled rings. The company offers its products under the Tirupati brand name. It exports its forging products to the United States, Canada, Malaysia, Morocco, Brazil, etc. The company was incorporated in 2012 and is based in Rajkot, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Rajkot",
        "zipcode": "360311",
        "website": "http://www.tirupatiforge.com",
        "market_cap": 314760000
    }
}