{
    "GEEC.L": {
        "short_name": "GREAT EASTERN ENERGY CORPORATIO",
        "long_name": "Great Eastern Energy Corporation Limited",
        "summary": "Great Eastern Energy Corporation Limited engages in exploring, developing, extracting, distributing, and marketing coal bed methane and compressed natural gas in India. It owns interests in the Raniganj (South) block that covers an area of approximately 210 square kilometers located in West Bengal; and Mannargudi block, which covers an area of approximately 667 square kilometers situated in Mannargudi, Tamil Nadu. The company was incorporated in 1992 and is based in Gurugram, India.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "India",
        "city": "Gurugram"
    },
    "HINDOILEXP.NS": {
        "short_name": "HINDUSTAN OIL EXPL",
        "long_name": "Hindustan Oil Exploration Company Limited",
        "summary": "Hindustan Oil Exploration Company Limited engages in the exploration, development, and production of onshore and offshore crude oil and natural gas in India. It holds interests in various oil and gas blocks/fields. The company's oil and gas assets portfolio consist of operated and non-operated acreages in Assam, Cauvery, and Cambay basins. As of March 31, 2020, its estimated proved and probable reserves on working interest basis were 26.65 million barrels of oil equivalent. The company, through its subsidiary, Hindage Oilfield Services Limited, focuses on oil field equipment and service sector. Hindustan Oil Exploration Company Limited was incorporated in 1983 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "SELAN.NS": {
        "short_name": "SELAN EXPLORATION",
        "long_name": "Selan Exploration Technology Limited",
        "summary": "Selan Exploration Technology Limited explores for and produces crude oil and natural gas in India. It holds rights to develop oilfields situated in Bakrol and Lohar, Gujarat; and Ognaj oil field and Karjisan gas field in Gujarat. Selan Exploration Technology Limited was founded in 1985 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gurugram"
    }
}