{
    "CYBERMEDIA.NS": {
        "short_name": "CYBER MEDIA (INDIA",
        "long_name": "Cyber Media (India) Limited",
        "summary": "Cyber Media (India) Limited engages in the print media business in India. It publishes various magazines, such as Dataquest, PCQuest, Voice&Data, DQ Channels, DQ Week, and Global Services. The company conducts events in the areas of IT, telecom, biotechnology, innovation, and entrepreneurship industries. It also operates ciol.com, a technology business website; and offers market research, consulting, and advisory services for information technology, telecommunications, semiconductor and electronics, government, infrastructure, energy and utilities, and healthcare and life sciences industries, as well as enterprise, SMB, and consumer user segments. In addition, the company provides content syndication services; marketing programs and custom publications for enterprises; and content management, editorial, and production services for publishers. Cyber Media (India) Limited was founded in 1982 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122001",
        "website": "http://www.cybermedia.co.in",
        "full_time_employees": 128
    },
    "DALALSTCOM.NS": {
        "short_name": "DSJ COMMUNICATION",
        "long_name": "DSJ Communications Limited",
        "summary": "DSJ Communications Limited prints and publishes newspapers and magazines in India. It is also involved in disseminating news and information through print, television, radio, and internet. The company was incorporated in 1989 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400034",
        "website": "http://www.dsjcommunication.com",
        "full_time_employees": 3
    },
    "DBCORP.NS": {
        "short_name": "D B CORP LTD",
        "long_name": "D. B. Corp Limited",
        "summary": "D. B. Corp Limited engages in newspaper printing and publishing, radio broadcasting, event management, and integrated internet and mobile interactive service businesses in India and internationally. The company operates through Printing/Publishing and Allied Businesses, and Radio segments. It publishes Dainik Bhaskar, Divya Bhaskar, Divya Marathi, Saurashtra Samachar, and DB Star newspapers in 3 languages, such as Hindi, Gujarati, and Marathi. The company also publishes Aha Zindagi, Bal Bhaskar, Young Bhaskar, Madhurima, Navrang, Kalash, Dharmdarshan, Rasik, and Lakshya magazines. In addition, it operates a network of 30 radio stations in 7 states under the 94.3 My FM brand name; 8 digital portals, such as dainikbhaskar.com, divyabhaskar.com, divyamarathi.com, jeevanmantra.in, homeonline.com, bollywoodbhaskar.com, moneybhaskar.com, and bhaskareducation.com; and 4 mobile applications comprising Dainik Bhaskar, Divya Bhaskar, Divya Marathi, and home online. D. B. Corp Limited was incorporated in 1995 and is headquartered in Bhopal, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bhopal",
        "zipcode": "462011",
        "website": "http://www.dbcorpltd.com",
        "full_time_employees": 9120
    },
    "DNAMEDIA.NS": {
        "short_name": "DILIGENT MEDIA COR",
        "long_name": "Diligent Media Corporation Limited",
        "summary": "Diligent Media Corporation Limited engages in the online news distribution business in India. It operates an e-paper edition through epaper.dnaindia.com. The company also offers content through dna Syndication. Diligent Media Corporation Limited was founded in 2005 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400 013",
        "website": "http://www.dnaindia.com",
        "full_time_employees": 52
    },
    "HMVL.NS": {
        "short_name": "HINDUSTAN MEDIA VE",
        "long_name": "Hindustan Media Ventures Limited",
        "summary": "Hindustan Media Ventures Limited engages in the printing and publication of newspapers and periodicals in India. The company's product line includes Hindustan, a daily newspaper that provides news relating to politics, business, entertainment, sports, and other general interests; and LiveHindustan.com, a Hindi news Website. It also provides Nandan, a monthly children's magazine that offers traditional and modern stories, poems, interactive columns and facts, and various educative columns; and Kadambini, a monthly socio-cultural magazine, which covers various subjects, including literature, art, culture, health, technology, fashion, travel, beauty, etc. The company was formerly known as Searchlight Publishing House Limited and changed its name to Hindustan Media Ventures Limited in November 2008. The company was founded in 1918 and is based in New Delhi, India. Hindustan Media Ventures Limited is a subsidiary of HT Media Limited.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.hmvl.in",
        "full_time_employees": 1281
    },
    "HTMEDIA.NS": {
        "short_name": "HT MEDIA LTD",
        "long_name": "HT Media Limited",
        "summary": "HT Media Limited, together with its subsidiaries, engages in the printing and publication of newspapers and periodicals in India. The company operates through three segments: Printing and Publishing of Newspapers and Periodicals, Radio Broadcast and Entertainment, and Digital. It publishes Hindustan Times, an English daily newspaper; Mint, a business daily newspaper; Brunch, a weekly lifestyle magazine; Hindustan, a Hindi daily newspaper; Hindustan Jobs, an employment weekly; Jaano English, an English learning supplement; Nandan, a monthly children's magazine; and Kadambini, a monthly women's magazine, as well as newspaper supplements. The company is also involved in FM radio broadcast and other related activities through its radio stations operating under the Fever 104, Fever, Radio One, and Radio Nasha brands in Delhi, Mumbai, Kolkata, Bengaluru, Hyderabad, Kanpur, Lucknow, Agra, Allahabad, Aligarh, Bareilly, and Gorakhpur, as well as Fever FM brand in Chennai. In addition, it operates Shine.com, a job portal; HT Campus.com, an education portal; Hindustantimes.com, a general news web portal; livemint.com, a business news web portal; Livehindustan.com, a Hindi news website; Desimartini.com, a movie review website; and HT Smartcast, a podcast platform. Further, the company operates Studymate learning centers; Bridge School of Management; and provides payroll processing and consultancy, mobile marketing, social media marketing, advertising, mobile CRM and loyalty campaigns, and business and management consultancy services, as well as mobile music content and ring tones. Additionally, it engages in the coaching/ tutorial classes conducting business, as well as sets up training centers. The company was founded in 1924 and is based in New Delhi, India. HT Media Limited is a subsidiary of The Hindustan Times Limited.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.htmedia.in",
        "full_time_employees": 1891
    },
    "JAGRAN.NS": {
        "short_name": "JAGRAN PRAKASHAN L",
        "long_name": "Jagran Prakashan Limited",
        "summary": "Jagran Prakashan Limited engages in the printing and publication of newspapers and magazines in India. The company operates through Printing, Publishing and Digital; FM Radio Business; and Others segments. It offers Dainik Jagran, a daily newspaper; Nai Dunia & Nav Dunia, the Hindi newspapers; Inquilab, an Urdu daily newspaper; Sakhi, a Hindi magazine; Khet Khalihaan, a monthly agricultural magazine; Dainik Jagran Inext, an online Hindi newspaper; mid-day, a compact newspaper; mid-day Gujarati, a Gujarati newspaper; and Punjabi Jagran, a Punjabi daily newspaper. The company also provides web and text/voice-based value-added services and products in genres, such as news, education, blogging, health, classifieds, youth, and videos through the Jagran New Media portals. In addition, it offers a portfolio of out of home marketing services through hoardings and billboards, street furniture, railway stations and bus stands, metro network, ambient media, and retail signages, as well as innovative and clutter-breaking solutions. Further, the company provides marketing solutions, such as brand activations; events, conferences, and exhibitions; shopper and retail marketing; integrated media campaigns; rural marketing; creative services; and public health programs. It publishes 10 publications in 5 languages with approximately 400 editions/sub-editions; and operates 39 radio stations under the Radio City brand name. The company was founded in 1942 and is based in Kanpur, India. Jagran Prakashan Limited is a subsidiary of Jagran Media Network Investment Private Limited.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kanpur",
        "zipcode": "208005",
        "website": "http://jplcorp.in",
        "full_time_employees": 5808
    },
    "MPSLTD.NS": {
        "short_name": "MPS LTD",
        "long_name": "MPS Limited",
        "summary": "MPS Limited provides platforms and services for content creation, full-service production, and distribution to the publishers, learning companies, corporate institutions, libraries, and content aggregators in India, Europe, the United States, and internationally. It operates through three segments: Content Solutions, Platform Solutions, and eLearning Solutions. The company offers content authoring and development solutions from PreKÂ\u009612 through higher education and professional development; publishing solutions; interactive systems; digital transformation and accessibility solutions; new media solutions; content assembly and transformation solutions; content fulfillment solutions; and marketing and customer support solutions. It also provides platforms, such as Digicore, a cloud-based digital publishing platform; MPSTrak, a cloud-based workflow and content management platform for books, journals, reference works, and media; mag+, which publishes content to mobile app; THINK360, an end-to-end order management and delivery platform; ScholarStor, a content hosting and delivery platform for publishers; SCHOLARLYStats, a cloud-based platform to empower librarians and institutions; MPSInsight, a cloud-based usage analytics platform that empowers publishers to access and analyze content usage analytics based on COUNTER standards; and TOPSIM solutions. In addition, the company offers eLearning solutions, including custom development, managed learning, mobile and micro learning, simulation, and gaming solutions, as well as augmented, virtual, and extended reality solutions; and operates experience centers and learning platforms. The company was formerly known as Macmillan India Limited and changed its name to MPS Limited in June 2009. The company was founded in 1892 and is based in Noida, India. MPS Limited is a subsidiary of ADI BPO Services Limited.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201307",
        "website": "http://www.mpslimited.com",
        "full_time_employees": null
    },
    "NAVNETEDUL.NS": {
        "short_name": "NAVNEET EDUCATION",
        "long_name": "Navneet Education Limited",
        "summary": "Navneet Education Limited publishes state board publication books and stationary products. The company operates through three segments: Publication, Stationery, and Others. The Publishing segment consists of supplementary books, such as workbooks, guides, and question banks, which are based on the latest prescribed syllabus by state education boards under the Vikas and Gala brand names. The Stationery segment offers paper based and non-paper based stationery under the Navneet and Youva brand names. Its stationery products include long books, notebooks, drawing books, scrap books, and office stationery, as well as pendrives and tablets. The Others segment engages in the generation of power by windmill; trading items; etc. It is involved in the school management business; and offers e-learning products and services under the Study Buddy brand. The company markets and sells its products under the Navneet, Vikas, Gala, Rise, Grafalco, Indiannica, YOUVA, Top Scorer, Top Class, and Touch brand names. It has operations in India, North and Central America, Africa, Europe, and internationally. The company was formerly known as Navneet Publications (India) Limited and changed its name to Navneet Education Limited in August 2013. Navneet Education Limited was founded in 1959 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400 028",
        "website": "http://www.navneet.com",
        "full_time_employees": 2750
    },
    "SABEVENTS.NS": {
        "short_name": "SAB EVENTS & GOV N",
        "long_name": "SAB Events & Governance Now Media Limited",
        "summary": "SAB Events & Governance Now Media Limited engages in the operation of digital media websites. The company operates Governance Now that provides participatory reportage and analysis related to governance of various institutions and processes through governancenow.com portal and YouTube video channel, as well as a fortnightly print magazine. It is also involved in the organization of various Virtual Conferences, Technology Masterclasses, and Visionary Talk series for government and public sector; and meetings, incentives, conferences, and exhibitions events. SAB Events & Governance Now Media Limited was incorporated in 2014 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400053",
        "website": "http://www.governancenow.com",
        "full_time_employees": null
    },
    "SAMBHAAV.NS": {
        "short_name": "SAMBHAAV MEDIA LTD",
        "long_name": "Sambhaav Media Limited",
        "summary": "Sambhaav Media Limited engages in the publishing of newspapers, magazines, and audio video media in India. The company offers Sambhaav Metro, an afternoon-daily; Abhiyyan, a Gujarati magazine; and VTVGujarati, a digital publication of news and entertainment. It also operates VTV News, a Gujarati news channel; Wise TV, an in-transit TV channel; and 13 stations, including FM radio stations in Jammu & Kashmir, as well as implements integrated vehicle tracking and passenger information systems for buses. In addition, the company is involved in the supply, installation, testing, integration and commissioning, and training for electrical smart power fence works in Pathankot. Further, it operates www.sambhaav.com, www.abhiyaanmagazine.com, and www.topfm.in web portals for news, entertainment, gaming, and knowledge sharing activities; and web applications. The company was formerly known as Pearl Energy and Infrastructures Limited. Sambhaav Media Limited was incorporated in 1990 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380015",
        "website": "http://www.sambhaav.com",
        "full_time_employees": 11
    },
    "SANDESH.NS": {
        "short_name": "SANDESH",
        "long_name": "The Sandesh Limited",
        "summary": "The Sandesh Limited engages in editing, printing, and publishing newspapers and periodicals in India. It publishes SANDESH, a premier Gujarati daily newspaper; and Sandesh Pratyaksha Panchang, a periodical. The company also operates Sandesh News, a Gujarati news channel; Spotlight, an out of home media solution; and a Gujarati news app. The Sandesh Limited was founded in 1923 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380054",
        "website": "http://sandesh.com",
        "full_time_employees": 491
    },
    "SCHAND.NS": {
        "short_name": "S CHAND AND COMPAN",
        "long_name": "S Chand and Company Limited",
        "summary": "S Chand and Company Limited, an education content company, develops and delivers content, solutions, and services for the early learning, K-12, and higher education segments in India. The company provides instructional resources to students from ages 4 through 18 years; test preparation, and college and university/technical and professional content; early learning content for 0-4 years of age; and digital and interactive content, as well as service offerings under the S Chand, Vikas, Madhubun, Saraswati, Chhaya Prakashani, mylestone, BPI, Smartivity, Risekids, Mystudygear, Intellitab, Ignitor, and Destination Success brands. It also offers Flipclass, a marketplace for tutoring. The company also exports its printed content to approximately 15 countries and digital content to countries in Asia, the Middle East, Africa, and internationally. S Chand and Company Limited was founded in 1970 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Publishing",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110044",
        "website": "http://schandgroup.com",
        "full_time_employees": 1900
    }
}