{
    "DLF.NS": {
        "short_name": "DLF LIMITED",
        "long_name": "DLF Limited",
        "summary": "DLF Limited, together with its subsidiaries, engages in the business of colonization and real estate development in India. Its activities include identification and acquisition of land; and planning, execution, construction, and marketing of projects. The company develops and sells residential properties, such as plotted developments, houses, and villas and apartments; and commercial and retail properties. It also engages in the lease of developed office space, ITes, and retail properties. In addition, the company owns and operates The Lodhi hotel and the Hilton Garden Inn in New Delhi; and golf and country clubs. Further, it engages in the provision of maintenance services; generation and sale of power; and recreational activities. DLF Limited was founded in 1946 and is based in Gurugram, India. DLF Limited operates as a subsidiary of Rajdhani Investments & Agencies Private Limited.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122002",
        "website": "http://www.dlf.in",
        "full_time_employees": 1661
    },
    "GODREJPROP.NS": {
        "short_name": "GODREJ PROPERTIES",
        "long_name": "Godrej Properties Limited",
        "summary": "Godrej Properties Limited, together with its subsidiaries, primarily engages in the real estate construction, development, and other related activities in India. It develops residential, commercial, and township projects. Godrej Properties Limited was incorporated in 1985 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400079",
        "website": "http://www.godrejproperties.com",
        "full_time_employees": null
    },
    "HDIL.NS": {
        "short_name": "HOUSING DEVELOPMEN",
        "long_name": "Housing Development and Infrastructure Limited",
        "summary": "Housing Development and Infrastructure Limited engages in the real estate construction, development, and other related activities in India. Its residential projects include apartment complexes, towers, and townships; commercial projects comprise office spaces and multiplex cinemas; and retail projects consists of shopping malls. The company also develops slum rehabilitation projects. Housing Development and Infrastructure Limited was incorporated in 1996 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400050",
        "website": "http://www.hdil.in",
        "full_time_employees": 286
    },
    "HEMIPROP.NS": {
        "short_name": "Hemisphere Prop Ind Ltd",
        "long_name": "Hemisphere Properties India Limited",
        "summary": "Hemisphere Properties India Limited operates as a real estate company in India. It owns or leases various properties, as well as has access to 739.69 acres of land. The company was incorporated in 2005 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://hpil.co.in",
        "full_time_employees": null
    },
    "MOTOGENFIN.NS": {
        "short_name": "MOTOR & GEN FINANC",
        "long_name": "The Motor & General Finance Limited",
        "summary": "The Motor & General Finance Limited engages in leasing and developing real estate properties in India. The company was incorporated in 1930 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110002",
        "website": "http://www.mgfltd.com",
        "full_time_employees": 21
    },
    "PHOENIXLTD.NS": {
        "short_name": "PHOENIX MILLS",
        "long_name": "The Phoenix Mills Limited",
        "summary": "The Phoenix Mills Limited constructs, operates, and manages malls, and commercial and residential property in India. The company operates in two segments, Property and Related Services, and Hospitality. Its real estate asset portfolio comprises retail malls, commercial office, residential, and hospitality projects located in Mumbai, Chennai, Bengaluru, Pune, Lucknow, Bareilly, Agra, Ahmedabad, and Indore. As of June 30, 2020, the company owns and operates hotels under The St. Regis name with 395 keys, serviced apartments, ten food and beverage venues, six ball rooms and prefunction areas, and eleven meeting rooms and business centers, as well as health club and a spa in Mumbai; and Courtyard by Marriott brand name with 193 keys, four restaurants and a bar, and a banquet hall in Agra. It operates malls under the Phoenix MarketCity, Palladium, Phoenix United, and Phoenix Palassio brand names. The Phoenix Mills Limited was founded in 1905 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400011",
        "website": "http://www.thephoenixmills.com",
        "full_time_employees": 1845
    },
    "PRESTIGE.NS": {
        "short_name": "PRESTIGE ESTATES P",
        "long_name": "Prestige Estates Projects Limited",
        "summary": "Prestige Estates Projects Limited, together with its subsidiaries, engages in the development, construction, and leasing of real estate properties in India. The company develops a range of residential projects, including townships, apartments, luxury villas, mansions, row houses, town homes and golf developments; commercial projects comprising office spaces, built-to-suit campuses, special economic zones, and IT parks; and retail properties, such as malls. It also develops and owns hospitality properties, which include resorts, convention centers and serviced apartments, and hotels. In addition, Prestige Estates Projects Limited provides real estate services that comprise fit-out services, interior design and execution, facilities and property management, and project and construction management services. The company was founded in 1986 and is headquartered in Bengaluru, India. Prestige Estates Projects Limited is a subsidiary of Razack Family Trust.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560025",
        "website": "http://www.prestigeconstructions.com",
        "full_time_employees": 8766
    },
    "PROZONINTU.NS": {
        "short_name": "PROZONE INTU PROPE",
        "long_name": "Prozone Intu Properties Limited",
        "summary": "Prozone Intu Properties Limited designs, develops, owns, and operates shopping malls, and commercial and residential premises in India. The company operates through Leasing and Outright Sales segments. It develops regional shopping and entertainment centers; and mixed-use residential townships and commercial office blocks, as well as provides related management consultancy services. The company was formerly known as Prozone Capital Shopping Centres Limited and changed its name to Prozone Intu Properties Limited in July 2014. Prozone Intu Properties Limited was incorporated in 2007 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400053",
        "website": "http://www.prozoneintu.com",
        "full_time_employees": 17
    },
    "UNITECH.NS": {
        "short_name": "UNITECH LIMITED",
        "long_name": "Unitech Limited",
        "summary": "Unitech Limited develops and leases real estate properties in India. The company develops commercial complexes, IT/ITes parks, SEZs, schools, hotels, malls, golf courses, and amusement parks. It also develops integrated residential projects, which include villas, apartments, offices, retail spaces, schools, clubs, floors, plots, and townships. In addition, the company leases IT/ITes and commercial office spaces; and provides property management and consultancy services. Further, it engages in the power transmission and hospitality businesses. Unitech Limited was incorporated in 1971 and is headquartered in Gurugram, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122007",
        "website": "http://www.unitechgroup.com",
        "full_time_employees": null
    },
    "VIPULLTD.NS": {
        "short_name": "VIPUL LTD",
        "long_name": "Vipul Limited",
        "summary": "Vipul Limited engages in real estate development and services business in India. Its project portfolio includes residential, commercial, and retail projects, as well as integrated townships and lifestyle gated communities. The company was incorporated in 1991 and is headquartered in Gurugram, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122009",
        "website": "http://www.vipulgroup.in",
        "full_time_employees": 124
    }
}