{
    "AURIONPRO.NS": {
        "short_name": "AURIONPRO SOLUTION",
        "long_name": "Aurionpro Solutions Limited",
        "summary": "Aurionpro Solutions Limited provides technology solutions and consultancy services in India, the Asia-Pacific regions, and internationally. The company offers digital payments solutions comprising Aurionpro payments framework, a platform that delivers payments gateways with pre built-in risk and fraud controls; remittance platform that enable remittance and money transfer services; and commerce platform to deliver tailor-made payment solutions to payment processors, merchants, and consumers. It also provides enterprise security solutions, including Isla, a Web malware isolation platform that prevents cyber-attacks; and identity and access management solutions that delivers identity, risk management, and security solutions. In addition, the company offers digital content solutions portfolio that connect people, process, and information. Further, it provides product engineering, enterprise portal and content, enterprise customer relationship management, and mobile application development services; iCashPro, an integrated transaction banking suite; FXConnect, a real time FX branch transaction platform for forex business; and loan origination system, a credit risk management system. Additionally, the company engages in sale of equipment; and software licensing activities. Aurionpro Solutions Limited provides solutions in the areas of banking and financial services, telecommunications, logistics, government organizations, and PSU sectors. The company was founded in 1997 and is headquartered in Navi Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Navi Mumbai"
    },
    "INFIBEAM.NS": {
        "short_name": "INFIBEAM AVENUES L",
        "long_name": "Infibeam Avenues Limited",
        "summary": "Infibeam Avenues Limited, a digital payment and e-commerce technology company, provides digital payment solutions, data center infrastructure, and software platforms for businesses and governments to execute e-commerce transactions. The company offers CCAvenue, an online payment gateway to merchants to accept payments through net-banking, credit cards, debit cards, digital wallets, and UPI. It also provides BillAvenue, an online bill payment platform; ResAven, a central reservation system that offers hotel reservation services; and Government eMarketplace, which is the national public procurement portal of the Government of India. The company also operates Infibeam BuildaBazaar, an e-commerce marketplace that provides plug-and-play online storefront and e-commerce gateway services, including online e-commerce site creation, digital product catalogue, and promotion handling and fulfilment services. It has a collaboration with IBM India to develop, implement, and promote blockchain capabilities on LinuxONE in India. The company operates in India, the United Arab Emirates, and internationally. The company was formerly known as Infibeam Incorporation Limited and changed its name to Infibeam Avenues Limited in July 2018. Infibeam Avenues Limited was incorporated in 2010 and is based in Gandhinagar, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gandhinagar"
    },
    "INTENTECH.NS": {
        "short_name": "INTENSE TECHNOLOGI",
        "long_name": "Intense Technologies Limited",
        "summary": "Intense Technologies Limited, together with its subsidiaries, engages in the development of software products for data analytics in India and internationally. The company develops UniServe NXT, a rapid enterprise application production platform that enhances customer experience. Its platform includes solutions, such as digitalization of customer onboarding; customer communications management solution; customer engagement solution; customer identity management solution that eliminates data redundancy and creates a single identity for each customer; B2B customer experience management solution; order management modernization solution; and omni-channel customer experience solution. The company serves communications and media, telecom, banking and financial services, insurance, energy and utilities, and manufacturing sectors, as well as governments. Intense Technologies Limited was incorporated in 1990 and is headquartered in Secunderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Secunderabad"
    },
    "OFSS.NS": {
        "short_name": "ORACLE FIN SERVICE",
        "long_name": "Oracle Financial Services Software Limited",
        "summary": "Oracle Financial Services Software Limited provides information technology (IT) solutions and business processing services to the financial services industry worldwide. It operates through three segments: Product Licenses and Related Activities, IT Solutions and Consulting Services, and Business Processing Outsourcing Services. The company offers Oracle FLEXCUBE, a banking platform for retail, corporate and investment banking, consumer lending, asset management, and investor servicing with payments; Oracle Banking Digital Experience, a digital transformation providing digital account and loan origination, digital wallet, and mobile payments; Oracle Banking APIs that enables banks to build partnerships with third-party technology organizations; and Oracle Banking Platform, a suite of business applications for banks; It also provides Oracle Banking Enterprise Product Manufacturing, a suite of Product master data management capability for the banking domain; Oracle Banking Enterprise Collections platform; Oracle Banking Enterprise Originations platform; Oracle Banking Corporate Lending, an end-to-end digitally enabled lending solution; and Oracle Financial Services Analytical Applications Infrastructure, Oracle Banking Liquidity Management, and Oracle Banking Virtual Account Management solutions. In addition, the company offers Oracle Banking Corporate Lending Process Management, Oracle Banking Credit Facilities Process Management, Oracle Banking Enterprise Limits and Collateral Management, Oracle Banking Trade Finance Process Management, Oracle Banking Payments, Oracle Financial Services Lending and Leasing, and Oracle FLEXCUBE Investor Servicing solutions. Further, it provides end-to-end consulting partnership, and business and technology solutions; and business process outsourcing services. The company was incorporated in 1989 and is based in Mumbai, India. Oracle Financial Services Software Limited is a subsidiary of Oracle Global (Mauritius) Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    }
}