{
    "AARON.NS": {
        "short_name": "Aaron Industries Limited",
        "long_name": "Aaron Industries Limited",
        "summary": "Aaron Industries Limited engages in manufacturing and trading of elevator products and other elevator parts for elevator industry in India. It offers various elevator products and parts, including elevators, elevator cabins, elevator doors, elevator kits, and complete kits, as well as auto door systems, door operators, swing doors, manual doors, and gearless machines. The company also provides electrical equipment and accessories, such as bus bars, MCB D.B., boxes, switch and accessories, and z perline. In addition, it engages in polishing, processing, designing, and finishing of stainless steel sheets, PVD coated colored sheets, and designer sheets for food storage, architectural and construction, appliances, and other sectors. Further, the company trades in traction machine, elevators kit parts, boom barriers, sensors, and other products. Aaron Industries Limited was founded in 2013 and is based in Surat, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Surat",
        "zipcode": "394210",
        "website": "http://aaronindustries.net",
        "market_cap": "Small Cap"
    },
    "ABB.NS": {
        "short_name": "ABB INDIA LTD",
        "long_name": "ABB India Limited",
        "summary": "ABB India Limited develops and sells products and system solutions to utilities, industries, channel partners, and original equipment manufacturers worldwide. The company operates through Motion, Robotics and Discrete Automation, Electrification, and Industrial Automation segments. The Motion segment produces and provides motors, generators, and drives that provide power, motion, and control for a range of automation applications; and offers solutions and related services. The Robotics and Discrete Automation segment provides value-added solutions in robotics, machine, and factory automation. The Electrification segment offers a range of digital and connected solutions for low- and medium-voltage applications, which include EV infrastructure, solar inverters, modular substations, distribution automation, power protection, wiring accessories, switchgear, enclosures, cabling, sensing, and control products. The Industrial Automation segment provides products, systems, and services, including turnkey engineering, control systems, measurement products, life cycle services, outsourced maintenance, and industry specific products for the optimization of the productivity of industrial processes in oil and gas, power, chemicals and pharmaceuticals, pulp and paper, metals and minerals, marine, and turbocharging industries. The company was formerly known as ABB Limited and changed its name to ABB India Limited in June 2013. The company was incorporated in 1949 and is based in Bengaluru, India. ABB India Limited is a subsidiary of ABB Asea Brown Boveri Ltd.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560058",
        "website": "http://new.abb.com/indian-subcontinent",
        "market_cap": "Mid Cap"
    },
    "ADORWELD.NS": {
        "short_name": "ADOR WELDING",
        "long_name": "Ador Welding Limited",
        "summary": "Ador Welding Limited manufactures and supplies welding and cutting consumables, power sources, and accessories in India and internationally. The company operates in two segments, Consumables, and Equipments and Project Engineering Business. It provides welding electrodes, including mild steel general purpose, mild steel special, low alloy high tensile, cellulosic, hard facing, stainless steel and heat resistant steel, cast iron, and non-ferrous electrodes; and continuous welding consumables products comprising submerged arc welding fluxes and wires, and flux cored arc welding products, as well as metal cored wire, gas metal arc welding (GMAW), and gas tungsten arc welding (GTAW) products. The company also offers welding and cutting equipment, such as air plasma cutting GTAW, submerged arc welding, GMAW, shielded metal arc welding, and resistance and spot welding equipment, as well as manual plasma cutting machines and welding accessories; gas cutting products, gas cutting-welding accessories, and personal protective equipment; and CNC cutting machines. In addition, it designs, engineers, fabricates, and supplies flare systems, process packages, process equipment, and furnaces/incinerators, as well as undertakes various EPC contracts. Further, the company provides welding automation products consisting of robotic systems, columns and booms, positioners, rotators, and special purpose machines; and offers skill development services. It serves pipeline, oil and gas, pharma, shipbuilding, railway, construction and infrastructure, nuclear energy, power, automotive, and defense sectors. The company was formerly known as Advani-Oerlikon Ltd. The company was founded in 1951 and is headquartered in Mumbai, India. Ador Welding Limited is a subsidiary of J. B. Advani & Company Private Limited.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400001",
        "website": "http://www.adorwelding.com",
        "market_cap": "Small Cap"
    },
    "AIAENG.NS": {
        "short_name": "AIA ENGINEERING",
        "long_name": "AIA Engineering Limited",
        "summary": "AIA Engineering Limited designs, develops, manufactures, installs, and servicing high chromium wear, corrosion, and abrasion resistant castings in India and internationally. The company offers grinding media; shell liners; and diaphragms, such as partition walls, discharge diaphragms, drying chamber diaphragms, inlet/outlet head liners, and dopple rotator diaphragms for tube mill applications; and grinding tables and rolls for vertical mill applications. It also provides castings for pre heaters, kilns, and coolers; and wear parts for cone crushers, hammer crushers, impellor crushers, and vertical shaft impact crushers. In addition, the company offers rod mill internal products; and wear components for mining applications. Further, it provides tube mill internals, vertical mill parts, and high performance milling systems; and installation and commissioning supervision, and mill optimization technical services for the power industry, as well as wear components for the aggregates industry. Additionally, the company offers mill audit, turnkey installation and commissioning, stock assessment and management, and performance monitoring services. Its products are used in cement, mining, and thermal power generation industries. AIA Engineering Limited was founded in 1979 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380058",
        "website": "http://www.aiaengineering.com",
        "market_cap": "Mid Cap"
    },
    "ANUP.NS": {
        "short_name": "THE ANUP ENGINEERI",
        "long_name": "The Anup Engineering Limited",
        "summary": "The Anup Engineering Limited engages in the manufacture and fabrication of process equipment for chemicals, petrochemicals, pharmaceuticals, fertilizers, drugs, oil and gas, power, water, aerospace, and other industries in India and internationally. The company provides static process equipment, including heat exchangers, reactors, pressure vessels, columns and towers, and custom fabrication products; technology products; dished ends; and industrial centrifuges, as well as pre-fabrication engineering services for static process equipment to its customers. The company was formerly known as Anveshan Heavy Engineering Limited and changed its name to The Anup Engineering Limited in January 2019. The Anup Engineering Limited was incorporated in 2017 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "382415",
        "website": "http://www.anupengg.com",
        "market_cap": "Small Cap"
    },
    "BEML.NS": {
        "short_name": "BEML LTD",
        "long_name": "BEML Limited",
        "summary": "BEML Limited provides products and services to the mining and construction, rail and metro, and defense and aerospace sectors in India. The company offers mining machinery for opencast and underground mines; dozers, excavators, backhoe loaders, front end loaders, and motor graders; hydraulic pumps and cylinders, hydro-pneumatic suspensions, and control valves; transmission, axle, and bevel gear powerline systems; diesel engines and generator sets; backhoe dredgers and dredger spares; and dump trucks, shovels, pipe layers, tire handlers, and water sprinklers. It also provides passenger coaches, electrical multiple units, inspection cars, track laying equipment, rail buses, spoil disposal units, treasury vans, mil rail coaches, wagons, utility track vehicle, and metro cars. In addition, the company offers armored recovery and repair vehicles, engineering mine ploughs, and surface mine clearance systems; BMP transmission and final drives, BMP refurbishing products, assembly hydrogas suspension units, and transmission products; wagons and milrail coaches, and ejectors and air cleaners; and aircraft towing tractors, ground handling and ground support equipment, crash fire tenders, aircraft weapon loaders, jigs and fixtures, and gears. Further, it provides mobility vehicles, all-terrain vehicles, command post vehicles, pinaka launchers, pontoon bridge systems, sarvatra bridge systems, heavy recovery vehicles, and trailers, as well as snow cutters and aircraft weapon loading trolleys. The company also exports its products to approximately 68 countries worldwide. The company was formerly known as Bharat Earth Movers Limited. BEML Limited was founded in 1964 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560027",
        "website": "http://www.bemlindia.in",
        "market_cap": "Small Cap"
    },
    "BHEL.NS": {
        "short_name": "BHARAT HEAVY ELECT",
        "long_name": "Bharat Heavy Electricals Limited",
        "summary": "Bharat Heavy Electricals Limited operates as an engineering and manufacturing enterprise in the energy and infrastructure sectors, and a power equipment manufacturer worldwide. The company operates through Power and Industry segments. It offers thermal power plants, nuclear power plants, gas-based power plants, hydro power plants, solar power systems, DG power plants, desalination and water treatment plants, systems and services, industrial systems, boilers, boiler auxiliaries, soot blowers, valves, piping systems, seamless steel tubes, steam turbines, turbogenerators, industrial sets, castings and forgings, condenser and heat exchangers, pumps, compressors, solar photovoltaics, and automation and control systems. The company also provides transmission systems control, software system solutions, medium voltage vacuum switchgears, on load tap changers, LT switchgear and bus ducts, transformers and reactors, capacitors, bushings, control gears, insulators, electrical machines, rail transportation systems, defense and aerospace products, transportation equipment, energy storage systems and e-mobility, oil field equipment, and fabricated equipment and mechanical packages. It serves customers in power, transmission, transportation, renewables, water, oil and gas, defense and aerospace, and other industries. Bharat Heavy Electricals Limited was founded in 1964 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110049",
        "website": "http://www.bhel.com",
        "market_cap": "Mid Cap"
    },
    "BLUESTARCO.NS": {
        "short_name": "BLUE STAR",
        "long_name": "Blue Star Limited",
        "summary": "Blue Star Limited operates as a central air conditioning and commercial refrigeration company in India. The company operates in three segments: Electro-Mechanical Projects and Commercial Air Conditioning Systems, Unitary Products, and Professional Electronics and Industrial Systems. The Electro-Mechanical Projects and Commercial Air Conditioning Systems segment designs, manufactures, installs, commissions, and maintains central air conditioning plants, packaged/ducted systems, and variable refrigerant flow systems; and provides contracting services in electrification, plumbing, and fire-fighting, as well as after-sales services, such as revamp, retrofit, and upgrade services. The Unitary Products segment offers room air conditioners for residential and commercial applications, water purifiers, air purifiers, and air coolers; and manufactures and markets a range of commercial refrigeration products and cold chain equipment. The Professional Electronics and Industrial Systems segment trades in and services testing machines, medical, analytical, test and measuring, data communications, and industrial products and systems. The company operates 6,000 stores. It also exports its products to 18 countries in the Middle East, African, SAARC, and ASEAN regions. Blue Star Limited was founded in 1943 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400020",
        "website": "http://www.bluestarindia.com",
        "market_cap": "Small Cap"
    },
    "CUMMINSIND.NS": {
        "short_name": "CUMMINS INDIA",
        "long_name": "Cummins India Limited",
        "summary": "Cummins India Limited designs, manufactures, distributes, and services engines, generator sets, and related technologies in India. The company operates through three business units: Engine Business, Power Systems Business, and Distribution Business. The Engine Business manufactures and markets diesel and natural gas engines ranging from 50 HP to 600 HP for the low, medium, and heavy-duty on-highway commercial vehicle markets, as well as the off-highway commercial equipment industry comprising construction and compressor. The Power Systems Business provides power generation systems in standby and distributed power generation for individual and institutional customers in various segments, such as infrastructure, data centers, realty, healthcare, and hospitality; and high horsepower engines ranging from 700 HP to 4500 HP for mining, marine, railways, oil and gas, and defense applications, as well as manufactures and exports low kilowatt generator sets; and power generation systems including, integrated generator sets ranging from 7.5 kVA to 3750 kVA consisting of transfer switches, paralleling switchgear, and controls. The Distribution Business offers products, services, and solutions for equipment and engines; and provides after-market support services to customers in India, Nepal, and Bhutan. It also exports its products to the United States, Europe, Mexico, Africa, the Middle East, and China. The company was founded in 1962 and is headquartered in Pune, India. Cummins India Limited is a subsidiary of Cummins Inc.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411045",
        "website": "http://www.cumminsindia.com",
        "market_cap": "Mid Cap"
    },
    "DELTAMAGNT.NS": {
        "short_name": "DELTA MFG LTD",
        "long_name": "Delta Manufacturing Limited",
        "summary": "Delta Manufacturing Limited, together with its subsidiaries, manufactures and sells hard ferrite magnets in India and internationally. It offers sector magnets for use in automotive magneto's and alternators; motor magnets for starter motors of automotive and motor cycles; ferrofluid-liquid magnets for applications in loudspeakers, electronic devices, mechanical engineering, aerospace, analytical instrumentation, biomedical, heat transfer-cooling, and display and education kits; and ring magnets for loud speakers/lifting devices, etc. The company also provides isotropic magnets for toys games and micro motors; low energy embedding powder magnets for use in bonded applications; and rare earth magnets that are used in electric vehicle drive motors, solar pumps, and drone motors. In addition, it manufactures soft ferrites; and textile woven labels, fabric printed labels, and elastic/woven tapes, as well as processes metal powders and specialized lubricants. The company was formerly known as Delta Magnets Limited and changed its name to Delta Manufacturing Limited in October 2008. Delta Manufacturing Limited was incorporated in 1982 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400034",
        "website": "http://www.deltamagnetsgroup.com",
        "market_cap": "Small Cap"
    },
    "DIAPOWER.NS": {
        "short_name": "DIAMOND POWER INFR",
        "long_name": "Diamond Power Infrastructure Limited",
        "summary": "Diamond Power Infrastructure Limited manufactures and sells power transmission equipment. The company provides wires and cables, transmission and distribution conductors, power and distribution transformers, transmission towers, control and relay panels, and isolators. It also engages in planning, designing, and commissioning of turnkey transmission and distribution projects. Diamond Power Infrastructure Limited offers its products through distributors in India, as well as exports its products and solutions to approximately 20 countries worldwide under the Dicabs brand. The company was formerly known as Diamond Cables Limited. Diamond Power Infrastructure Limited was founded in 1970 and is headquartered in Vadodara, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Vadodara",
        "zipcode": "390016",
        "website": "http://www.dicabs.com",
        "market_cap": "Small Cap"
    },
    "DUCON.NS": {
        "short_name": "DUCON INFRATECHNOL",
        "long_name": "Ducon Infratechnolgies Limited",
        "summary": "Ducon Infratechnolgies Limited provides technology solutions to the digital and infrastructure business sectors in India. The company offers distribution, marketing, and logistics services for the information technology (IT) industries. It also provides servers, storages, desktops, laptops, PDAs, tablets, security and surveillance products, and energy management systems, as well as procurement and sourcing solutions. In addition, the company installs flue gas desulfurization systems. Further, it engages in installation of industrial machinery and equipment. The company was formerly known as Dynacons Technologies Limited and changed its name to Ducon Infratechnolgies Limited May 2016. Ducon Infratechnolgies Limited was incorporated in 2009 and is based in Thane, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Thane",
        "zipcode": "400604",
        "website": "http://www.duconinfra.co.in",
        "market_cap": "Small Cap"
    },
    "EASUNREYRL.NS": {
        "short_name": "EASUN REYROLLE LTD",
        "long_name": "Easun Reyrolle Limited",
        "summary": "Easun Reyrolle Limited, together with its subsidiaries, provides a range of power transmission and distribution products, systems, solutions, and services in India and internationally. The company offers protection, control, and automation products, including protective relays, control and protection systems, automation products, power system recorders, phaser measurement units, wide area monitoring solutions, substation automation systems for EHV/HV/MV substations, network management products, and power distribution automation products for industries. It also provides measurement and metering solutions, such as GPRS modems, data concentrator units, device management and data acquisition systems, and meter data management systems; and medium voltage switchgears comprising air and solid insulated vacuum switchgear, ring main units, and cycloalipathic CTs and PTs, as well as MV vacuum contacting and MV switchgear retrofitting services. In addition, the company undertakes turnkey substation projects consisting of green field substation, substations augmentation and modernization, transmission line, and rural electrification projects. It serves utilities, public sector companies, power generation companies, state transmission utilities, and DISCOMS, as well as various industries, such as petrochemicals, metals, paper, chemicals, cement, automotive, pharma, etc. Easun Reyrolle Limited was incorporated in 1974 and is based in Hosur, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hosur",
        "zipcode": "635126",
        "website": "http://www.easunreyrolle.com",
        "market_cap": "Small Cap"
    },
    "EKC.NS": {
        "short_name": "EVEREST KANTO CYLI",
        "long_name": "Everest Kanto Cylinder Limited",
        "summary": "Everest Kanto Cylinder Limited, together with its subsidiaries, manufactures and sells cylinders primarily in India. The company offers compressed natural gas steel, industrial gas, fire extinguisher, fire suppression system, medical application, hydrogen, breathing air, aluminum, jumbo, and type-4 cylinders. It also provides equipment, appliances, and tanks, as well as parts and accessories used for containing and storage of gas, liquids, and air. In addition, the company trades in fire equipment and castor oil; and generates power. Further, it exports its products to approximately 25 countries, including countries in South East Asia, the Middle East, Africa, the United States, Europe, South America, and the Commonwealth of Independent States. The company was founded in 1978 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.everestkanto.com",
        "market_cap": "Small Cap"
    },
    "ELECON.NS": {
        "short_name": "ELECON ENGINEERING",
        "long_name": "Elecon Engineering Company Limited",
        "summary": "Elecon Engineering Company Limited manufactures and sells power transmission and material handling equipment in India and internationally. The company operates in two segments, Material Handling Equipment and Transmission Equipment. It offers helical and bevel helical, planetary, worm, high speed, wind mill, and marine gear boxes, as well as elevator traction machines/lift gears; customized gear boxes; vertical roller mill drives; and elign geared, elflex flexible, fluid, scoop controlled variable speed controlled fluid, and torsion shaft couplings. The company also provides material handling equipment, such as raw material handling systems, stackers, reclaimers, bagging and weighing machines, wagon and truck loaders, crushers, wagon tipplers, feeders, idlers and pulleys, magnates/weighers/detectors, and port equipment. In addition, it produces and installs wind turbines and wind farms; and engages in the steel and non-ferrous material foundry business. Further, the company offers gearbox repair and refurbish services; and material handling equipment support services. It serves cement, sugar, steel, power, plastic, material handling, chemical, palm oil, cane, elevator, rubber, marine, mining, and fertilizer industries, as well as ports. The company was founded in 1951 and is based in Vallabh Vidyanagar, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Vallabh Vidyanagar",
        "zipcode": "388120",
        "website": "http://www.elecon.com",
        "market_cap": "Small Cap"
    },
    "ELGIEQUIP.NS": {
        "short_name": "ELGI EQUIPMENT LTD",
        "long_name": "ELGI Equipments Limited",
        "summary": "ELGI Equipments Limited manufactures and sells air compressors and related parts in India and internationally. It operates in two segments, Air Compressors and Automotive Equipments. The company offers oil lubricated screw compressors, oil free piston air compressors, oil free screw compressors, oil lubricated piston compressors, diesel portable air compressors, electric portable compressors, railway air compressors, heat recovery systems, and medical air compressors and vacuum pumps, as well as accessories. In addition, it is involved in the trading of air compressors, hammers, rampi cars, nitrogen systems, and altitude training systems; manufacture and trading of automotive garage equipment; marketing and sale of vacuum pumps for medical applications; provision of design services; and rental of properties. ELGI Equipments Limited was founded in 1960 and is based in Coimbatore, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Coimbatore",
        "zipcode": "641005",
        "website": "http://www.elgi.com",
        "market_cap": "Small Cap"
    },
    "EMCO.NS": {
        "short_name": "EMCO LTD",
        "long_name": "EMCO Limited",
        "summary": "EMCO Limited provides products and solutions for power generation, transmission, and distribution utilities and industries in India. It offers distribution, power, furnace, rectifier, traction power, and locomotive transformers to power utilities, steel mills, cement plants, petro chemical complexes, fertilizer plants, independent power plants, etc.; and static energy meters and metering solutions that support communication through various media for use in residential, commercial, industrial, and special purpose applications. The company also undertakes turnkey EPC projects ranging from concept to commissioning in substations, including GIS, industrial switchyards, and power distribution systems, as well as up-gradation and revamping of existing distribution systems and power evacuation system for power projects. In addition, it offers EPC solutions that include conceptualization and commissioning of EHV transmission line packages on turnkey basis. Further, the company provides repair, overhauling, erection, testing, commissioning, maintenance contract, and diagnosis and failure analysis report services for transformers, as well as supplies spares of transformers. Additionally, it is involved in solar power generation business. EMCO Limited serves power utilities, oil and gas companies, and mining and EPC companies. The company also exports its products and solutions to approximately 50 countries in Africa, the Americas, Europe, the Middle-East, and the Asia Pacific. EMCO Limited was founded in 1964 and is headquartered in Thane, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Thane",
        "zipcode": "400604",
        "website": "http://www.emco.co.in",
        "market_cap": "Small Cap"
    },
    "GMMPFAUDLR.NS": {
        "short_name": "GMM PFAUDLER LTD",
        "long_name": "GMM Pfaudler Limited",
        "summary": "GMM Pfaudler Limited manufactures and sells corrosion resistant glass-lined equipment used primarily in the chemical, pharmaceutical, and allied industries in India and internationally. The company operates through five segments: Glass Lined Equipment, Heavy Engineering, Mixing Systems, Engineered Systems, and Filtration & Drying. The company's products include glass lined equipment comprising glass lined reactors, columns and vessels, conical dryer-blenders, pipes and fittings, glass steel, and polytetrafluoroethylene lined pipes and fittings, as well as accessories under the Glasteel name; and filtration and drying equipment, such as agitated nutsche filters and filter dryers, centrifugal disc filters, spherical dryers, and vacuum paddle dryers under the Mavazwag, Funda, Mavasphere, and Mavapad names. It also offers mixing systems; and heavy engineering products comprising heat exchangers, as well as pressure vessels, which include Cr-Mo reactors, agitated reactors, column towers with internals, digesters, and scrubbers. In addition, the company provides engineered systems, such as wiped film evaporators for use in the food processing, pharmaceutical, fine chemicals, polymers and resins, fats and oils, and petrochemical industries; and temperature control units for heating and cooling applications for the pharmaceutical, chemical, biotech, food, flavor and fragrance, and nutraceutical industries. Further, it offers glass thickness measurement, glass integrity checks, and high voltage spark and conductivity tests, as well as preventive maintenance services; and operates acid concentration plants to recover the acid for further use. The company was formerly known as Gujarat Machinery Manufacturers Limited and changed its name to GMM Pfaudler Limited in 1999. The company was founded in 1962 and is based in Mumbai, India. GMM Pfaudler Limited is a subsidiary of Pfaudler Inc.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400022",
        "website": "http://www.gmmpfaudler.com",
        "market_cap": "Small Cap"
    },
    "GREAVESCOT.NS": {
        "short_name": "GREAVES COTTON LTD",
        "long_name": "Greaves Cotton Limited",
        "summary": "Greaves Cotton Limited manufactures and sells engines and engine application products in India. It offers lightweight diesel/gasoline engines for automotive engine applications, such as 3-wheelers and small 4-wheeled commercial vehicles; non-automotive small engines for agriculture, construction, marine, and other industries; and industrial and firefighting engines. The company also provides generator sets; petrol kerosene, diesel, electric, OHV pumpsets; power tillers; light agri equipment; and drip and sprinklers irrigation systems. In addition, it manufactures spares, such as engine and electrical parts, lubricants, amsoil, batteries, construction products, tires, and 2 wheeler spares; and trades in power tillers, spares related to engines, electric vehicles and infrastructure equipment, etc. It also exports its products to the Middle East, Africa, and the South East Asia region. Greaves Cotton Limited was founded in 1859 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400070",
        "website": "http://www.greavescotton.com",
        "market_cap": "Small Cap"
    },
    "GUJAPOLLO.NS": {
        "short_name": "GUJARAT APOLLO IND",
        "long_name": "Gujarat Apollo Industries Limited",
        "summary": "Gujarat Apollo Industries Limited, together with its subsidiaries, manufactures and sells crushing and screening equipment for quarry, mining, construction, and recycling industries in India. The company offers jaw and cone crushers; primary and secondary impact crushers; vertical shaft impact crushers; vibrating screens; mobile crushing plants; crushing and screening plants; bucket crushers; and coal sampling units, as well as spare management service. It also exports its products. The company was formerly known as Gujarat Apollo Equipments Limited and changed its name to Gujarat Apollo Industries Limited in November 2006. Gujarat Apollo Industries Limited was founded in 1986 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380009",
        "website": "http://www.apollo.co.in",
        "market_cap": "Small Cap"
    },
    "HERCULES.NS": {
        "short_name": "HERCULES HOISTS",
        "long_name": "Hercules Hoists Limited",
        "summary": "Hercules Hoists Limited manufactures and sells material handling equipment primarily in India. The company operates through two segments, Material Handling Equipment and Windmill Power. It provides mechanical hoists comprising chain pulley blocks, ratchet lever hoists, pulling and lifting machines, electric chain hoists, and wire rope hoists; overhead, HOT, EOT, light profile, and jib cranes; storage and retrieval solutions, including floor operated stackers and roll out racks; stackers, and storage and retrieval solutions; and trollies, winches, manipulators, and material handling automation solutions. The company offers its products under the Indef, iStacker, iCrane, Stier, and Hercules brand names. Its products are used in cargo terminals and ports, automotive, cement and construction, steel and metals, chemicals and petro-chemicals, textile, energy and power, engineering and machine, heavy and light engineering, building, food processing, logistics, mining metallurgy and metal processing, nuclear, oil and gas, petrochemicals, paper, rubber and plastics, and wood processing industries. The company also generates power through four wind farms. Hercules Hoists Limited was founded in 1962 and is based in Navi Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Navi Mumbai",
        "zipcode": "400614",
        "website": "http://www.indef.com",
        "market_cap": "Small Cap"
    },
    "HLEGLAS.NS": {
        "short_name": "HLE Glascoat Limited",
        "long_name": "HLE Glascoat Limited",
        "summary": "HLE Glascoat Limited designs and manufactures carbon steel glass lined equipment in India and internationally. It offers reactors, receivers, storage tanks, columns, agitators, valves, pipes and fittings, and other similar equipment and related spares and accessories. The company also provides other engineering equipment, such as agitated filters and dryers, rotary vacuum paddle dryers, other chemical process equipment, and related spares and accessories. It serves pharmaceutical/API, specialty chemicals, dyes/colors, agro chemicals, food processing, and allied industries. The company was formerly known as Swiss Glascoat Equipments Limited and changed its name to HLE Glascoat Limited in December 2019. HLE Glascoat Limited was incorporated in 1991 and is headquartered in Anand, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Anand",
        "zipcode": "388121",
        "website": "http://www.glascoat.com",
        "market_cap": "Small Cap"
    },
    "HONAUT.NS": {
        "short_name": "HONEYWELL AUTO IND",
        "long_name": "Honeywell Automation India Limited",
        "summary": "Honeywell Automation India Limited provides integrated automation and control systems in India and internationally. The company manufactures electronic systems and components; and trades in, repairs, and maintains machinery, equipment, and supplies. It also provides building management systems, fire detection and alarm systems, access control systems, video surveillance systems, and integrated security and building management systems, as well as aftermarket services for various control systems; and utilities' operations and maintenance services for mechanical and electrical systems in buildings. In addition, the company offers project engineering and software development services; engineering, sourcing, manufacturing, testing, project management, and systems design services; lifecycle and technology migration services; and industrial cyber security services. Further, it engages in the sensing and internet of things activities. The company was incorporated in 1984 and is based in Pune, India. Honeywell Automation India Limited is a subsidiary of HAIL Mauritius Limited.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411013",
        "website": "http://www.honeywell.com/en-us/global/en-in/hail",
        "market_cap": "Mid Cap"
    },
    "HONDAPOWER.NS": {
        "short_name": "HONDA INDIA POWER",
        "long_name": "Honda India Power Products Limited",
        "summary": "Honda India Power Products Limited manufactures and markets portable generators, water pumps, general purpose engines, lawn mowers, brush cutters, tillers, and backpack sprayers in India. It also exports its products to North America, Europe, and internationally. The company was formerly known as Honda Siel Power Products Limited and changed its name to Honda India Power Products Limited in July 2020. The company was founded in 1985 and is headquartered in Gautam Buddha Nagar, India. Honda India Power Products Limited is a subsidiary of Honda Motor Co., Ltd.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gautam Budh Nagar",
        "zipcode": "201310",
        "website": "http://www.hondaindiapower.com",
        "market_cap": "Small Cap"
    },
    "ICEMAKE.NS": {
        "short_name": "Ice Make Refrigerat Ltd",
        "long_name": "Ice Make Refrigeration Limited",
        "summary": "Ice Make Refrigeration Limited operates as a refrigeration equipment manufacturer in India and internationally. The company offers its products under the categories of cold rooms and storage, commercial refrigeration, industrial refrigeration, and transport refrigeration products under the Ice Make, Bharat, and Trans Freez brand names. It provides cold room products, including cold room storages, solar cold rooms, glass door display chillers, refrigeration systems, ripening chambers, and blast freezers and chillers. The company also offers commercial refrigeration products, such as curd incubation chamber, ice cream plant, bulk milk chiller, batch pasteurizer, ageing vat, ice candy production machine, ice cream hardener, mini blast freezer and chiller, mortuary chamber, heat pump food dehydrator, and commercial freezer. In addition, it provides industrial refrigeration products comprising water chilling plants, air chillers, and ice building tanks; and transport refrigeration products consisting of refrigerated vehicles/reefer vans, eutectic mobile containers, and dry insulated container, as well as glycol and water chillers. The company offers cooling solutions and accessories to various industries, including dairy, ice cream, food processing, agriculture, pharmaceuticals, cold chains, logistics, hospitals, hospitality, retail, and others. Ice Make Refrigeration Limited was founded in 1989 and is headquartered in Gandhinagar, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gandhinagar",
        "zipcode": "382721",
        "website": "http://www.icemakeindia.com",
        "market_cap": "Small Cap"
    },
    "INGERRAND.NS": {
        "short_name": "INGERSOLL RAND",
        "long_name": "Ingersoll-Rand (India) Limited",
        "summary": "Ingersoll-Rand (India) Limited manufactures and sells industrial air compressors primarily in India. The company offers reciprocating air-cooled and water-cooled, contact cooled and oil free rotary screw, and centrifugal compressors; and cycling and non-cycling refrigerated dryers. It sells its products under the Club Car, Ingersoll Rand, Nash, Thomas, CompAir, and ARO brand names, as well as other brands. The company serves automotive, metals, pharmaceutical, and textile sectors, as well as other various industrial sectors. It also exports its products to the American, Asian, and European countries. The company was founded in 1921 and is based in Bengaluru, India. Ingersoll-Rand (India) Limited is a subsidiary of Ingersoll-Rand Industrial US Inc.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560029",
        "website": "http://www.irco.com",
        "market_cap": "Small Cap"
    },
    "INOXWIND.NS": {
        "short_name": "INOX WIND LTD",
        "long_name": "Inox Wind Limited",
        "summary": "Inox Wind Limited manufactures and sells wind turbine generators and components for independent power producers, utilities, public sector undertakings, and corporate and retail customers in India. It also provides a range of services, such as wind resource assessment, site acquisition to infrastructure development, erection and commissioning, long-term operations and maintenance services for wind power projects. The company was incorporated in 2009 and is headquartered in Noida, India. Inox Wind Limited is a subsidiary of GFL Limited.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201301",
        "website": "http://www.inoxwind.com",
        "market_cap": "Small Cap"
    },
    "JASH.NS": {
        "short_name": "Jash Engineering Limited",
        "long_name": "Jash Engineering Limited",
        "summary": "Jash Engineering Limited manufactures, trades in, and sells various engineering products for general engineering, water and waste water, power plant, and bulk solids handling industries in India. It offers water control gates, such as slide/penstock, open channel, weir, and flap gates, as well as stop logs; screens, including trash rack, J-type trash rack, suspended trash rake, multi-rake, step, rotary drum, filter and travelling band, static, incli-rake, and other screens; and screening conveying equipment comprising flat belt and screw conveyors. The company also provides knife gate valves; water hammer control valves, such as zero velocity and air cushion valves; energy dissipating valves; hydro power equipment; screw pumps; bulk solid handling valves; and treatment process equipment consisting of detritors, clarifiers, slow speed floating and fixed aerators, clarifloculators, and trickling filters. Its equipment are used in water intake systems, water and waste water pumping stations and treatment plants, storm water pumping stations, and water transmission lines, as well as power, steel, cement, paper and pulp, petrochemical, chemical, fertilizer, and other process plants. Jash Engineering Limited also exports its products. The company was founded in 1948 and is headquartered in Indore, India. Jash Engineering Limited is a subsidiary of Jash Group.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Indore",
        "zipcode": "452015",
        "website": "http://www.jashindia.com",
        "market_cap": "Small Cap"
    },
    "JYOTISTRUC.NS": {
        "short_name": "JYOTI STRUCTURES",
        "long_name": "Jyoti Structures Limited",
        "summary": "Jyoti Structures Limited engages in the design, sourcing, manufacturing, supply, construction, and testing of transmission lines, substations, and distribution projects in India and internationally. The company manufactures transmission line, microwave, and wind mill towers; sub-station switchyards; and solar power and rural electrification structures. Jyoti Structures Limited was incorporated in 1974 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400053",
        "website": "http://www.jyotistructures.in",
        "market_cap": "Small Cap"
    },
    "KABRAEXTRU.NS": {
        "short_name": "KABRA EXTRUSIONTEC",
        "long_name": "Kabra Extrusiontechnik Limited",
        "summary": "Kabra Extrusiontechnik Limited manufactures and sells plastic extrusion machinery and allied equipment in India. The company offers pipe extrusion lines, such as twin screw PVC pipe extrusion lines; PE pipe extrusion lines; control and automation systems; and downstream equipment, including vacuum calibrators, water spray baths, pipe haul-off units, pipe cut-off units, and tripping chutes for use in drinking water transportation, irrigation, building construction, infrastructure development, and gas transportation industries. It also provides multilayer and CoEX blown film lines, monolayer and cluster film plants, control and automation systems, non-barrier film production line, and tarpaulin film production lines; inline flat and round drip tube, twin strand PVC conduit, telecom micro-duct extrusion, PVC profile extrusion, PVC pelletizing, and bundled sheathing lines; compounding mixer-coolers; sheet extrusion lines; and compounding lines. In addition, the company offers auto feeding systems; corrugated pipe extrusion lines; belling and socketing machines; and POD multilayer lines. Additionally, it produces green energy systems and solutions. It also exports its products. Kabra Extrusiontechnik Limited was incorporated in 1982 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400053",
        "website": "http://www.kolsite.com",
        "market_cap": "Small Cap"
    },
    "KECL.NS": {
        "short_name": "KIRLOSKAR ELECTRIC",
        "long_name": "Kirloskar Electric Company Limited",
        "summary": "Kirloskar Electric Company Limited manufactures and sells electric products and services in India and internationally. The company operates through Power generation and Distribution, Rotating Machine Group, and Others segments. Its products include AC high and low voltage motors; AC generators; DC motors; diesel generator sets; electronics, such as AC and DC drives, battery chargers, and uninterruptible power supply systems; and switchgears comprising vacuum circuit breakers, unitized package substations, panels, and porcelain clad vacuum circuit breakers. The company also provides traction products that include dynamic breaking resistors, AC and DC traction motors, traction alternators, and radiator cooling fans; and cast resin, distribution, power, energy, and special transformers. In addition, it designs, manufactures, and supplies custom-built systems for various projects. The company serves the power generation, transmission, and distribution, as well as transportation, renewable energy, sugar, steel, cement, agriculture, oil and gas, refinery, and nuclear industries. Kirloskar Electric Company Limited was founded in 1946 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560058",
        "website": "http://kirloskarelectric.com",
        "market_cap": "Small Cap"
    },
    "KIRLOSBROS.NS": {
        "short_name": "KIRLOSKAR BROTHERS",
        "long_name": "Kirloskar Brothers Limited",
        "summary": "Kirloskar Brothers Limited provides fluid management solutions in India and internationally. The company manufactures various pumps, including end suction, split case, multistage, special and engineered, monobloc, vertical turbine, submersible, and sump pumps. It also provides valves, such as butterfly, sluice, non-return, kinetic air, foot, gate, suction diffuser and triple duty, ball, and steam trap, as well as cast steel gate, globe, and check valves; and forged steel gate, globe, and check valves. In addition, the company offers hydro turbines comprising Francis, Kaplan, and Pelton wheel turbines; and mobile pump controllers to assist a pump user to monitor and operate the pump remotely using a mobile. Further, it provides packaged systems, which include pressure boosting hydro-pneumatic, pressure booster, firefighting, condition monitoring, and solar pumping systems, as well as heating, ventilation, air conditioning, and refrigeration systems. Additionally, the company offers steel castings for various industries, such as power, mining, cement, heavy engineering application, sugar, etc.; stators, rotors, and electric motors, as well as installs SPP pumps and systems; manufactures and sells head multi-stage and rubber lined slurry pumps, and white metal lined bearings; and sells centrifugal, fire-fighting, and water and wastewater pumps. In addition, it is involved in the manufacture of API and non-API pump; manufacture and sale of bare shaft and packaged pump sets; provision of solutions for HVAC, fire protection, turf irrigation, etc.; and manufacture of coatings for various equipment. The company serves industry, building and construction, oil and gas, marine and defense, irrigation, power, and water resource management markets through a network of dealers and distributors. Kirloskar Brothers Limited was founded in 1888 and is headquartered in Pune, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411045",
        "website": "http://www.kirloskarpumps.com",
        "market_cap": "Small Cap"
    },
    "KIRLOSENG.NS": {
        "short_name": "KIRLOSKAR OIL ENGI",
        "long_name": "Kirloskar Oil Engines Limited",
        "summary": "Kirloskar Oil Engines Limited manufactures and distributes diesel engines, agricultural pump sets, electric pump sets, power tiller, generating sets, and spares in India. It offers air-cooled and liquid-cooled engines and diesel generating sets; and petrol generators, as well as engines operating on alternative fuels, such as bio-diesel, biogas, straight vegetable oil, and natural gas. The company also provides industrial engines for applications in the sectors, such as earth moving, construction, mining, material handling, fluid handling, marine, and off-shore; diesel engines and pump sets for agriculture applications; diesel generating sets for stationary power plants; and marine main propulsion engines and auxiliary generating sets. It serves service industries, such as telecom, IT/ITES, BPO, shopping malls, hotels, hospitals, and banks; educational and financial institutions; infrastructure projects, including airports, roads, bridges, residential and commercial complexes, townships, high-rise buildings, and others; other industries comprising engineering, manufacturing, FMCG, automobile and auto ancillaries, textile, pharmaceuticals, dairy, and food processing; and defense agencies, such as the air force, army, and navy, as well as the coast guard. The company also exports its products. The company was formerly known as Kirloskar Engines India Limited and changed its name to Kirloskar Oil Engines Limited in March 2010. Kirloskar Oil Engines Limited was founded in 1946 and is headquartered in Pune, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411003",
        "website": "http://koel.kirloskar.com",
        "market_cap": "Small Cap"
    },
    "KSB.NS": {
        "short_name": "KSB LTD",
        "long_name": "KSB Limited",
        "summary": "KSB Limited manufactures and sells power driven pumps and industrial valves in India and internationally. The company operates through Pumps and Valves segments. The Pumps segment manufactures and trades in industrial pumps, submersible pumps, effluent treatment pumps, etc.; and offers related spares and services. The Valves segment manufactures and trades in industrial valves, and related spares and services. It also produces castings for captive consumption. The company was formerly known as KSB Pumps Limited and changed its name to KSB Limited in June 2018. KSB Limited was incorporated in 1960 and is headquartered in Pune, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411018",
        "website": "http://www.ksb.com/ksb-in/ksb-in-india/ksb-limited/",
        "market_cap": "Small Cap"
    },
    "LAXMIMACH.NS": {
        "short_name": "LAKSHMI MACHINE",
        "long_name": "Lakshmi Machine Works Limited",
        "summary": "Lakshmi Machine Works Limited, together with its subsidiaries, manufactures and sells textile spinning machinery, CNC machine tools, and heavy castings in India and internationally. The company operates through three segments: Textile Machinery Division, Machine Tool Division/Foundry, and Advanced Technology Centre. It offers textile machinery products, such as card silver, combining, ring and compact spinning, and mill mounting systems, as well as blending solutions; and machine tools consisting of turning, milling, and turnmill tools. The company also provides foundry products that include locomotive castings/turbocharger parts, marine transmission castings, power and energy products, and pumps and valves; and aero engine, aero structures and structural assemblies, sheet metal and special process components, and aerospace composites. In addition, it is involved in the development and sale of residential apartments. As of March 31, 2020, the company has installed 28 wind energy generators with a total capacity of 36.80 MW, as well as 10 MW of solar power generating facility. It also exports its products. Lakshmi Machine Works Limited was founded in 1962 and is based in Coimbatore, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Coimbatore",
        "zipcode": "641018",
        "website": "http://www.lmwglobal.com",
        "market_cap": "Small Cap"
    },
    "LOKESHMACH.NS": {
        "short_name": "LOKESH MACHINES",
        "long_name": "Lokesh Machines Limited",
        "summary": "Lokesh Machines Limited manufactures and sells machine tools in India. The company operates in two segments, Machine Tool and Component divisions. It offers CNC machines, including CNC lathes, vertical and horizontal machining centers, drill and tap centers, turn mill centers, and vertical turning centers. The company also provides special purpose machines, such as linear transfer lines, rotary transfer machines, simplex milling, duplex milling, triplex milling, gang milling, gun drilling, multiway drilling, line boring, fine boring, and multiway boring machines. In addition, it offers automation products comprising gantry, robotic, and 4th axis automation products, as well as customized standard machines. Further, the company provides auto components consisting of cylinder blocks and heads, and connecting rods. It also exports its products to Japan, Germany, the Netherlands, Italy, Turkey, China, and the Middle East countries. The company was incorporated in 1983 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500037",
        "website": "http://www.lokeshmachines.com",
        "market_cap": "Small Cap"
    },
    "LSIL.NS": {
        "short_name": "LLOYDS STEELS INDU",
        "long_name": "Lloyds Steels Industries Limited",
        "summary": "Lloyds Steels Industries Limited provides engineering products and services in India. It designs, engineers, manufactures, fabricates, supplies, erects, and commissions mechanical, hydraulic, structural, process plants, metallurgical, and chemical plants equipment, including marine loading/unloading arms, truck/wagon loading/unloading arms, columns, pressure vessels, dryers, boilers, power plant, and steel plant and capital equipment. The company also executes turnkey and EPC projects. Lloyds Steels Industries Limited was founded in 1974 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.lloydsengg.in",
        "market_cap": "Small Cap"
    },
    "MACPOWER.NS": {
        "short_name": "Macpower CNC Machines Ltd",
        "long_name": "Macpower CNC Machines Limited",
        "summary": "Macpower CNC Machines Limited operates as a CNC manufacturing company in India. The company offers CNC turning centers for the bearing, valve, pump, tool room, automobile, process plant component, agriculture, textile, and piping industries; and vertical machining centers (VMCs) for tool rooms, die and molds, automobile, pattern, defense, power, and railways. It also provides special purpose component, aeronautics, defense, agriculture, and medical turn mill centers; and vertical turret lathe for valve and motor bodies, engine liners, and railways. In addition, the company offers horizontal machining centers for automobile, die and mold, defense, aeronautics, textile, medical, and railways; drill tap centers for the electronics, automobile, and textile industries; twin head VMCs for the automobile and textile industries; and cylindrical grinders for special purpose components, agriculture, and railway, as well as turn o' mill and twin spindle turning centers. Macpower CNC Machines Limited was founded in 2003 and is based in Rajkot, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Rajkot",
        "zipcode": "360021",
        "website": "http://www.macpowercnc.com",
        "market_cap": "Small Cap"
    },
    "MANUGRAPH.NS": {
        "short_name": "MANUGRAPH INDIA LT",
        "long_name": "Manugraph India Limited",
        "summary": "Manugraph India Limited manufactures and sells printing machines in India. It offers newspaper Web offset, folder, and packaging converting machines. The company also exports its products to Germany, France, the United Kingdom, the United States, and internationally. Manugraph India Limited was founded in 1972 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400005",
        "website": "http://www.manugraph.com",
        "market_cap": "Small Cap"
    },
    "MAZDA.NS": {
        "short_name": "MAZDA LTD",
        "long_name": "Mazda Limited",
        "summary": "Mazda Limited operates as an engineering company in India. It operates in two segments, Engineering Division and Food Division. The company offers vacuum systems, including steam jet boosters and ejectors; steam jet air ejector systems; combination vacuum systems of steam jet ejectors and liquid ring vacuum pumps; combination vacuum systems of steam jet ejectors and liquid jet ejectors; thermocompressors; liquid jet ejectors; air jet ejectors; vapor and gas jet ejectors/systems; steam jet liquid ejectors; liquid jet liquid ejectors; steam jet liquid heaters and mixers; single/double stage liquid ring vacuum pumps; and hotshot mechanical automatic pumps. It also provides evaporators, such as falling/rising film evaporators, forced circulation evaporators, combination type evaporators, OSLO crystallizers, pilot plants, agitated thin film dryers, and stripper systems; and chillers comprising vapor absorption machines/heat pumps and chiller vector systems. In addition, the company offers heat transfer products that include condensing systems, steam surface condensers, steam jet air ejector systems, gland vent condensers, dump condensers, feed water heaters, oil coolers, shell and tube heat exchangers, flash tanks, and pressure vessels. Further, it provides air pollution control equipment, which comprise jet venturi fume, high energy fume, and packed tower scrubbers, as well as food products. The company also exports its products to approximately 40 countries worldwide. It serves the chemicals and pesticides, drugs and pharmaceuticals, dye and intermediates, edible oil refining, ethylene-glycol-motive fluid, fertilizers, petroleum refinery, petro chemicals, power, steel, and vegetable oil industries. The company was incorporated in 1990 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380006",
        "website": "http://mazdalimited.com",
        "market_cap": "Small Cap"
    },
    "PENIND.NS": {
        "short_name": "PENNAR INDUSTRIES",
        "long_name": "Pennar Industries Limited",
        "summary": "Pennar Industries Limited operates as an engineering company in India and internationally. The company offers cold rolled steel strips; electrostatic precipitator electrodes; building components, such as purlins, roofing/cladding sheets, and decking profiles; metal crash barriers for flyovers, bridges, national highways, and other projects; sheet piles for infrastructure projects; and sheet metal products for the automobile industry. It also provides solar module mounting structures to support the solar PV panels; railway wagons, and passenger and metro coaches; and storage solutions, including racking, shelving, and special solutions, as well as storage accessories. In addition, the company offers industrial components, such as hydraulic cylinders, auto components, and white goods components; and precision tubes comprising electric resistance welding, CDW/DOM/CEW, bicycle frame, steel, engineering, boiler, heat exchanger, propeller shaft, transformer, fuel and air, furniture, structural, telescopic front fork, and air pre-heater and Indian boiler regulation tubes, as well as automotive shock absorbers. Further, it designs, fabricates, and erects factory buildings, warehouses, power plants, commercial centers, high-rise buildings, aircraft hangars, defense installations, sports stadiums, industrial racking systems, cold-form structures for low-cost housing, and telecom transmission towers. Additionally, the company provides design and engineering services; and water treatment chemicals, fuel additives, and specialty water treatment chemicals, as well as water and environment infrastructure turnkey solutions. The company was incorporated in 1975 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500084",
        "website": "http://www.pennarindia.com",
        "market_cap": "Small Cap"
    },
    "PREMIER.NS": {
        "short_name": "PREMIER LTD",
        "long_name": "Premier Limited",
        "summary": "Premier Limited engages in the engineering and automotive businesses in India and internationally. It provides manufactures mechanical components for the wind energy, infrastructure, and power generation sectors. The company also offers large and heavy duty CNC machines, such as CNC gear hobbings, shaping and shaving machines, CNC gear tooth chamfering and rounding machines, vertical turnmill centers, vertical and horizontal machining centers, and special purpose machines. In addition, it provides professional and engineering services; SUV vehicle under the RiO name; and LCV under the Roadstar name. The company was formerly known as The Premier Automobiles Ltd. and changed its name to Premier Limited in March 2005. Premier Limited was founded in 1941 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.premier.co.in",
        "market_cap": "Small Cap"
    },
    "SCHAEFFLER.NS": {
        "short_name": "SCHAEFFLER INDIA L",
        "long_name": "Schaeffler India Limited",
        "summary": "Schaeffler India Limited develops, manufactures, and distributes high-precision roller and ball bearings, and related components worldwide. It offers ball, cylindrical, spherical, and tapered roller bearings, as well as wheel bearings. The company also provides engine and transmission components for front accessory drive systems, chain drive systems, valve train components, shift systems, and a range of needle roller bearings and elements; clutch systems and dual mass flywheels for passenger cars, light commercial vehicles, heavy commercial vehicles, and tractors; and concentric slave cylinder, clutch master cylinder, semi slave cylinder, adapter, and high pressure pipe assemblies. In addition, it offers engine oil, transmission oil, grease, coolant, hydraulic oil, and shock absorber oil. The company offers its products under the brand names of Schaeffler, LuK, INA, FAG, and Schaeffler TruPower. It serves the construction machinery, electrical engineering, industrial gear, mining and cement, power generation, agricultural engineering, steel plant, motorcycle, textile machinery, machine tool, wind power, pulp and paper, automotive and tractor, precision equipment, machine tools and material handling, car and truck, railway, two wheelers, renewable energy, power transmission, off highway, automation, and heavy, as well as MRO-steel, raw material, power, paper, and pulp industries. The company was formerly known as FAG Bearings India Limited and changed its name to Schaeffler India Limited in July 2017. Schaeffler India Limited was founded in 1962 and is headquartered in Pune, India. Schaeffler India Limited is a subsidiary of INA Holding Schaeffler GmbH & Co. KG.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411045",
        "website": "http://www.schaeffler.co.in",
        "market_cap": "Mid Cap"
    },
    "SCHNEIDER.NS": {
        "short_name": "SCHNEIDER ELECTR",
        "long_name": "Schneider Electric Infrastructure Limited",
        "summary": "Schneider Electric Infrastructure Limited engages in designing, manufacturing, building, and servicing products and systems for electricity distribution in India and internationally. The company offers distribution, medium power, and special transformers; and substation automation systems, including power management systems, controllers and RTUs, communication elements, graphic user interfaces, engineering tools, SCADA and EMS gateways, and simulation tools. It also provides ring main units; and medium voltage distribution and grid automation products, such as remote terminal units, vacuum circuit breakers, medium voltage switchgears, micro grids, digital substations, and medium and low voltage equipment services, as well as EcoStruxure grid, an IoT-enabled open and interoperable platform. The company serves the utility, metal, minerals and cement, mining, power generation, oil and gas, and smart city industries. The company was formerly known as Smartgrid Automation Distribution and Switchgear Limited and changed its name to Schneider Electric Infrastructure Limited in December 2011. The company was incorporated in 2011 and is based in Gurugram, India. Schneider Electric Infrastructure Limited is a subsidiary of Energy Grid Automation Transformers and Switchgears India Private Limited.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122002",
        "website": "http://infra.schneider-electric.co.in",
        "market_cap": "Small Cap"
    },
    "SHAKTIPUMP.NS": {
        "short_name": "SHAKTI PUMPS INDIA",
        "long_name": "Shakti Pumps (India) Limited",
        "summary": "Shakti Pumps (India) Limited manufactures and sells submersible pumps and motors under the Shakti brand name in India. The company operates through 4 segments: Government Solar, OEM, Exports, and Domestic and Industrials. Its products include submersible, solar, vertical multistage centrifugal, monoblock end suction, pressure booster, waste water, open well, helical, shallow well and slow speed, immersible, single shaft vertical multistage, and micro pumps, as well as submersible, surface, and slip start synchronous motors. The company also provides solar pump controllers, solar drives, starters, inverters, RMS/IoT dongles, DU/DT filters, and hydro-pneumatic booster systems, as well as support services. Its pumps are used for flood and micro irrigation, horticulture, domestic water supply, commercial, and industrial applications. The company also exports its products to approximately 100 countries. Shakti Pumps (India) Limited was founded in 1982 and is headquartered in Pithampur, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pithampur",
        "zipcode": "454774",
        "website": "http://www.shaktipumps.com",
        "market_cap": "Small Cap"
    },
    "SHANTIGEAR.NS": {
        "short_name": "SHANTHI GEARS",
        "long_name": "Shanthi Gears Limited",
        "summary": "Shanthi Gears Limited designs, manufactures, supplies, and services gears and gear boxes in India, the United States, Europe, and internationally. The company offers standard products, such as helical and bevel helical, worm, extruder, and cooling tower gear boxes, as well as geared motors. It also provides custom built loose gears, which include gears and pinions, and special gearboxes; and iron, as well as phosphor bronze, aluminum bronze, leaded bronze, and copper alloy castings. In addition, the company offers installation support, refurbishment, and on site services. Its products are used in steel, cement, sugar, crane and material handling, paper, power, rubber and plastics, off-highway and mining, process, compressor, railway, textile, and aerospace applications. The company was founded in 1960 and is based in Coimbatore, India. Shanthi Gears Limited is a subsidiary of Tube Investments of India Limited.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Coimbatore",
        "zipcode": "641005",
        "website": "http://www.shanthigears.com",
        "market_cap": "Small Cap"
    },
    "SIEMENS.NS": {
        "short_name": "SIEMENS INDIA LTD",
        "long_name": "Siemens Limited",
        "summary": "Siemens Limited manufactures and sells electric motors, generators, transformers, electricity distribution and control apparatus, electric signaling, safety or traffic-control equipment, and general purpose machinery in India and internationally. The company's Energy segment provides integrated products, solutions, and services for oil and gas production, and power generation and transmission. It serves oil and gas, utilities, independent power producers, and engineering, procurement, and construction companies. Its Smart Infrastructure segment supplies products, systems, solutions, and services for transmission and distribution of electrical energy for power utilities, industrial companies, and infrastructure segments. This segment offers systems for low and medium voltage distribution; solutions for smart grids and energy automation; and low voltage power supply systems, as well as intelligent and connected infrastructure for grids and buildings. The company's Mobility segment provides solutions for passenger and freight transportation, including rail vehicles, rail automation systems, rail electrification systems, road traffic technology, and IT solutions. Its Portfolio Companies segment provides products, process solutions, and services across life cycles for wind and industry sectors. The company's Digital Industries segment offers automation, drives, and software technologies covering the complete life cycle from product design and production execution to services for discrete and process industries. The company also engages in the lease rental business. Siemens Limited has a strategic partnership with Salesforce to develop a new workplace technology suite; and Allied Electronics & Automation, Inc. The company was formerly known as Siemens India Limited and changed its name to Siemens Limited in March 1987. Siemens Limited was founded in 1867 and is based in Mumbai, India. Siemens Limited is a subsidiary of Siemens Aktiengesellschaft.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400030",
        "website": "http://www.siemens.co.in",
        "market_cap": "Mid Cap"
    },
    "SKFINDIA.NS": {
        "short_name": "SKF INDIA",
        "long_name": "SKF India Limited",
        "summary": "SKF India Limited manufactures and supplies products, solutions, and services in the area of rolling bearings, seals, mechatronics, and lubrication systems primarily in India. It offers rolling bearings, bearings accessories, engineered products, and track rollers; and mounted bearings and housings, super-precision bearings, slewing bearings, plain bearings, magnetic bearings and systems. The company also provides industrial seals, such as power transmission, hydraulic, fluid handling, and machined seals, as well as engineering services; automotive seals; lubrication management products, such as lubricants, lubricators, and manual lubrication tools; automatic lubrication systems; and lubrication system components, including pumps and pump units, lubricant metering and monitoring devices, control units and software, and accessories. In addition, it offers maintenance products comprises hydraulic, mechanical, and alignment tools, as well as heaters; condition monitoring systems, such as basic and portable monitoring products, surveillance systems, and machine protection products; and power transmission solutions, including belts, pulleys, chains, sprockets, bushings and hubs, couplings, and bolts and tightening systems. Further, the company provides test and measuring equipment consisting of noise and vibration testers, grease test rigs, and waviness, roundness, and form analyzers, as well as services for test and measuring equipment; and supplies replacement parts. Additionally, it offers technical consultancy, numerical simulation and design, and root cause analysis services; asset management; mechanical and condition based maintenance; industrial and railway bearings remanufacturing; and training services in various fields. SKF India Limited also exports its products. The company was formerly known as SKF Bearings India Limited and changed its name to SKF India Limited in 2004. SKF India Limited was founded in 1923 and is based in Pune, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411033",
        "website": "http://www.skf.com/in",
        "market_cap": "Small Cap"
    },
    "SOMICONVEY.NS": {
        "short_name": "SOMI CONVEYOR BELT",
        "long_name": "Somi Conveyor Beltings Limited",
        "summary": "Somi Conveyor Beltings Limited manufactures and sells industrial conveyor belts in India and internationally. It provides general purpose, heat resistant, fire resistant, and oil resistant conveyor belts. The company also offers special purpose conveyor belts, such as bullet proof, chevron, rough top, pipe conveyor, and fusion belts, as well as rubber sheets and mattings, maintenances conveyor belts, and steel cord beltings. It primarily serves the cement, sponge iron, power, and mining sectors. Somi Conveyor Beltings Limited was incorporated in 2000 and is headquartered in Jodhpur, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Jodhpur",
        "zipcode": "342001",
        "website": "http://www.somiconveyor.com",
        "market_cap": "Small Cap"
    },
    "SUZLON.NS": {
        "short_name": "SUZLON ENERGY LTD",
        "long_name": "Suzlon Energy Limited",
        "summary": "Suzlon Energy Limited, together with its subsidiaries, manufactures and sells wind turbine generators and related components in India, the United States, Australia, Spain, South Africa, and Turkey. The company also engages in selling solar systems; and the provision of services, such as operation and maintenance of wind turbine generators, as well as project execution and site infrastructure development services. In addition, it is involved in the sale/sub-lease of land; and sale of foundry and forging components, as well as power generation and solar operations. Suzlon Energy Limited was founded in 1995 and is headquartered in Pune, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411028",
        "website": "http://www.suzlon.com",
        "market_cap": "Small Cap"
    },
    "TARAPUR.NS": {
        "short_name": "TARAPUR TRANSFORME",
        "long_name": "Tarapur Transformers Limited",
        "summary": "Tarapur Transformers Limited engages in the manufacture, repair, refurbishment, and upliftment of transformers in India. The company offers power transformers, such as systems, generator, auto, and furnace transformers, as well as rectifiers, railway duty, etc.; distribution transformers for utilities, boards, and private industries; and instrument transformers, including current and potential transformers. The company was founded in 1988 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400064",
        "website": "http://www.tarapurtransformers.com",
        "market_cap": "Small Cap"
    },
    "TDPOWERSYS.NS": {
        "short_name": "TD POWER SYSTEMS P",
        "long_name": "TD Power Systems Limited",
        "summary": "TD Power Systems Limited, together with its subsidiaries, manufactures and sells AC generators and electric motors in India and internationally. It operates through Manufacturing Business and Project Business segments. The company offers steam turbine generators for thermal, geo thermal, and solar energy applications; hydro turbine generators for Francis, Kaplan, and Pelton turbines; diesel and gas engine generators; gas and wind turbine generators; and generators for special applications, such as motor and transformer testing, etc. It also engages in the business of engineering, procurement, and construction, as well as undertakes boiler-turbine generator island projects for steam turbine power plants. In addition, the company offers support services for erection and commissioning; training for customer field technicians on commissioning, maintenance, and trouble-shooting; trouble-shooting to control generation disruptions; periodic plant health check-ups; overhauling of generators; replacement of generators for existing old machines; and spare parts. TD Power Systems Limited was founded in 1999 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "562111",
        "website": "http://www.tdps.co.in",
        "market_cap": "Small Cap"
    },
    "TEXRAIL.NS": {
        "short_name": "TEXMACO RAIL & ENG",
        "long_name": "Texmaco Rail & Engineering Limited",
        "summary": "Texmaco Rail & Engineering Limited operates as an engineering and infrastructure company in India. It operates through three segments: Heavy Engineering, Steel Foundry, and Rail EPC. It offers payload stainless/high tensile steel freight, commodity-specific, special purpose freight, bottom discharge coal hopper, container flat, tank, defense equipment, and auto car wagons; and coach bogies, loco-shells, components, EMU coaches, under frames, and parcel and brake vans. Its steel foundries produce bogies, couplers, draft gears, draw bars, CMS crossings, high axle load bogie and shroud castings, center plates, and AAR yokes and followers, as well as industrial castings for earth moving equipment and hydro power projects. It also provides various gates; penstocks/pressure shaft liners; bifurcation, trifurcation, transition, expansion joints, manifolds, reducers, dismantling joints, fixed and rocker, and supports and specials; hydraulics, rope drums, hoists, screw hoists, travelling hoists, etc.; knife edge gate/filling-in valves; trashracks/screens; trash rack cleaning machines; goliath/EOT cranes/lifting beams; and refurbishment/replacement and overhauling of HM equipment of old hydro projects/barrages. In addition, it automates dam and barrage equipment; designs, supplies, installs, and commissions railway tracks, buildings, platforms and foot over bridges, railway signaling and telecom structures, bridges and culverts, and automatic fare collection systems; and offers railway overhead and other electrification services. Further, it offers horton spheres, cryogenic vessels, clay filters, gas coolers, cold boxes, and heat exchangers; and industrial structures, steel/concrete flyovers, concrete and steel bridges, and ship hull blocks, as well as fabricates and erects steel bridges in railways and roadways, and bailey bridges. It also exports its products. The company was incorporated in 1998 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700056",
        "website": "http://www.texmaco.in",
        "market_cap": "Small Cap"
    },
    "THERMAX.NS": {
        "short_name": "THERMAX",
        "long_name": "Thermax Limited",
        "summary": "Thermax Limited provides engineering solutions in India and internationally. It operates through three segments: Energy, Environment, and Chemical. The company offers vapor absorption chillers, heat pumps and transformers, and solar-based and process cooling products; waste heat recovery systems, industrial boilers, solar-based heating, and fired heaters; and power plants, balance of plant, and operation and maintenance services. It also provides solar thermal and photovoltaic systems; and steam boilers, thermic fluid heaters, hot water and air heaters/generators, waste HRB, and energy plants. In addition, the company offers steam accessories, such as condensate recovery systems, steam traps, pre-fabricated modules, pressure reducing stations, pressure reducing and desuper heating systems, valves, steam line mountings, boiler house products, and monitoring equipment. Further, it provides electrostatic precipitators, bag filters, particulate and gaseous scrubbers, combo filters, flue gas desulphurization, selective catalytic and non-catalytic reduction, and modular gas coolers; water and waste management systems and solutions, such as water treatment, effluent and sewage treatment and recycling, and incineration; and chemicals, such as water treatment, fireside, green, sugar industry, paper, and oil field chemicals, as well as fuel additives and ion exchange resins. Additionally, it offers energy, retrofit and revamp, utility outsourcing, and specialized services and solutions; and spares. It serves automobiles, cement, chemicals and fertilizers, commercial/construction, dairy, distillery, paper and pulp, pharmaceuticals, plywood, power generation, processed food, refineries and petrochemicals, soft beverages, metals, sugar, textiles, and tire industries. The company was founded in 1966 and is headquartered in Pune, India. Thermax Limited is a subsidiary of RDA Holdings Private Limited.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411003",
        "website": "http://www.thermaxglobal.com",
        "market_cap": "Mid Cap"
    },
    "TIMKEN.NS": {
        "short_name": "TIMKEN INDIA",
        "long_name": "Timken India Limited",
        "summary": "Timken India Limited manufactures and distributes tapered roller bearings, components, and accessories for the automotive sector and railway industry in India and internationally. The company offers cylindrical, plain, spherical roller, tapered roller, thrust, precision, and ball bearing, as well as seals, maintenance tools, housed units, and wheel hub under the Timken brand; and integrated bearing assemblies, driver center support bearings for commercial and light vehicles, and lubrication and lubrication systems. It also provides mechanical power transmission products, as well as maintenance contract and refurbishment services. The company was formerly known as Tata Timken Limited and changed its name to Timken India Limited in July 1999. The company was incorporated in 1987 and is based in Bengaluru, India. Timken India Limited is a subsidiary of Timken Singapore PTE. Limited.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560100",
        "website": "http://www.timken.com/en-in",
        "market_cap": "Small Cap"
    },
    "TRF.NS": {
        "short_name": "TRF LTD",
        "long_name": "TRF Limited",
        "summary": "TRF Limited designs, manufactures, and sells material handling products and systems for infrastructure industries in India and internationally. The company's Bulk Material Handling Equipment division designs and manufactures various material handling equipment used in the infrastructure industries, such as wagon tipplers, stacker reclaimers, traveling wagon loaders, screen, crushers, etc. Its Bulk Material Handling Systems division offers design, engineering, manufacturing, erection, and commissioning solutions for material handling systems for various sectors, including the steel, power, ports, mining, etc.; and coal dust injection systems for blast furnaces and stamping-charging-pushing machines for coke oven applications. The company also provides solutions for coal handling. In addition, it offers port and yard equipment for ports and stockyards; and shuttle conveyors, pulleys, and idlers. TRF Limited was incorporated in 1962 and is headquartered in Jamshedpur, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Jamshedpur",
        "zipcode": "831007",
        "website": "http://www.trf.co.in",
        "market_cap": "Small Cap"
    },
    "TRITURBINE.NS": {
        "short_name": "TRIVENI TURBINE LT",
        "long_name": "Triveni Turbine Limited",
        "summary": "Triveni Turbine Limited manufactures and sells industrial steam turbines in India. The company offers back-pressure and condensing steam turbines for a range of pressure and flow applications, as well as a suite of integrated solutions, such as erection and commissioning, spare parts, operations and maintenance, refurbishing, and other services. It also engages in the trading of steam turbines. The company's turbines are used in various applications, such as co-generation, combined heat and power generation, waste heat recovery and combined cycle power plants, incidental power generation, captive power generation, independent power generation, and non-conventional energy sources. It serves biomass independent power plants (IPPs), municipal solid waste IPPs, district heating, palm oil, paper, sugar, naval, textiles, metals, cement, carbon black, solvent extraction, pharmaceutical, chemicals, petrochemicals, fertilizers, oil and gas municipal solid waste based IPPs, and captive power plants. The company also exports its products. Triveni Turbine Limited was incorporated in 1995 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560058",
        "website": "http://www.triveniturbines.com",
        "market_cap": "Small Cap"
    },
    "VESUVIUS.NS": {
        "short_name": "VESUVIUS INDIA",
        "long_name": "Vesuvius India Limited",
        "summary": "Vesuvius India Limited manufactures and trades in refractory products in India. The company offers shaped refractories, such as shrouds, stoppers, pre-cast products, nozzles, and crucibles; and unshaped refractories, including castables, and taphole clay, as well as repairs and maintenance services. Vesuvius India Limited also exports its products. The company was incorporated in 1991 and is headquartered in Kolkata, India. Vesuvius India Limited is a subsidiary of Vesuvius Group Limited, United Kingdom.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700088",
        "website": "http://www.vesuviusindia.com",
        "market_cap": "Small Cap"
    },
    "VOLTAS.NS": {
        "short_name": "VOLTAS LTD",
        "long_name": "Voltas Limited",
        "summary": "Voltas Limited operates as an air conditioning and engineering company primarily in India, the Middle East, and Singapore. It operates through three segments: Unitary Cooling Products for Comfort and Commercial Use; Electro-Mechanical Projects and Services; and Engineering Products and Services. The company manufactures, sells, and services cooling appliances and cold storage products, such as air conditioners, air coolers, freezers, visi coolers, and water dispensers, and other commercial refrigeration products. It also undertakes electro-mechanical projects, including electrical; heating, ventilation, and air conditioning projects; and plumbing, firefighting, extra low voltage, and specialized services. In addition, the company provides facilities maintenance and hard services, such as operations and maintenance contracts in various sectors, AMCs, retrofits and energy management, etc. Further, it engages in the provision of water treatment solutions for industrial, oil and gas, and sewage segments; sale and service of capital machinery for textile industry; sale of spares and accessories for textile equipment; and sale of mining and construction equipment. Additionally, the company offers operations and maintenance services for mining and construction industry; manufactures ducts and duct accessories; and undertakes engineering, procurement, and construction projects. It also engages in the drilling, irrigation, and landscaping activities; and construction of water treatment plants. Voltas Limited was founded in 1954 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400033",
        "website": "http://www.voltas.com",
        "market_cap": "Mid Cap"
    },
    "WINDMACHIN.NS": {
        "short_name": "WINDSOR MACHINES",
        "long_name": "Windsor Machines Limited",
        "summary": "Windsor Machines Limited engages in the manufacturing and selling of plastic processing machinery in India and internationally. The company operates through Extrusion Machinery and Injection Moulding Machinery segments. It offers injection molding machines, including two platen, toggle, hydro-mechanical, and electric injection molding machines. The company also provides pipe extrusion lines, such as single screw extruders for PE/ PP pipes; in line drip irrigation solutions; and twin screw pipe extruders for RPVC/UPVC pipe extrusion lines, as well as die heads/polyolefin processing (PE/PPR), multiple pipe die head with single downstream equipment, dual pipe head die with dual downstream equipment, calibrating systems/vacuum and pressure equipment, haul-off units, tube cutting units, and coiling units. In addition, it offers blown film lines comprising 7 and 9 layer blown film extrusion lines; five layer polyolefin dedicated line for non-barrier film applications; five layer IBC co-extrusion blown film lines; three layer IBC co-extrusion blown film lines; and three layer non-IBC co-extrusion blown film lines. The company was formerly known as DGP Windsor India limited and changed its name to Windsor Machines Limited in 2005. Windsor Machines Limited was incorporated in 1963 and is based in Ahmedabad, India. Windsor Machines Limited is a subsidiary of Castle Equipments Private Limited.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "382445",
        "website": "http://www.windsormachines.com",
        "market_cap": "Small Cap"
    }
}