{
    "AARVI.NS": {
        "short_name": "Aarvi Encon Limited",
        "long_name": "Aarvi Encon Limited",
        "summary": "Aarvi Encon Limited provides manpower outsourcing and consultancy services in India and the United Arab Emirates. The company offers information technology (IT) staffing, manpower outsourcing/technical staffing, project management, construction supervision, procurement assistance/expediting, inspection, pre-commissioning and commissioning, operation and maintenance, and shutdown, as well as engineering services. It serves the IT, engineering/EPC, oil and gas, LNG, PNG, metal and mineral, fertilizer, telecom, refinery/petrochemical, pipeline, infrastructure, power, renewable energy, cement, automobile, ports and terminals, and CGD/CNG, as well as metro and mono rail/railway industries. The company was founded in 1987 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "QUESS.NS": {
        "short_name": "QUESS CORP LTD",
        "long_name": "Quess Corp Limited",
        "summary": "Quess Corp Limited operates as a business services provider in India, South East Asia, and North America. It operates through Workforce Management, Operating Asset Management, and Tech services segments. The Workforce Management segment provides staffing services and solutions, including general staffing, IT staffing, recruitment and executive search, and recruitment process outsourcing, as well as payroll, compliance and background verification services, training and skill development, and logistic services. The Operating Asset Management segment offers services, such as janitorial services, security services, electro-mechanical services, pest control, food and hospitality services, and industrial operations and maintenance services, as well as related asset record maintenance services. The Tech Services segment provides BPO services, break fix services, and technology solutions and products. The company was formerly known as Ikya Human Capital Solutions Limited and changed its name to Quess Corp Limited in January 2015. Quess Corp Limited was founded in 2007 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "TEAMLEASE.NS": {
        "short_name": "TEAMLEASE SERVICES",
        "long_name": "TeamLease Services Limited",
        "summary": "TeamLease Services Limited provides human resource services to various industries in India. The company offers temporary staffing, permanent recruitment, payroll process outsourcing, regulatory compliance, vocational training/education and assessment, and IT and telecom staffing services; apprenticeship program and property leasing services; and online service for software product engineering. It provides its solutions primarily to consumer goods and durables, chemicals, manufacturing, media and telecom, retail, banking, financial services, insurance, e-commerce, pharmaceuticals and healthcare sectors. The company was incorporated in 2000 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    }
}