{
    "ADHUNIKIND.NS": {
        "short_name": "ADHUNIK INDUSTRIES",
        "long_name": "Adhunik Industries Limited",
        "summary": "Adhunik Industries Limited manufactures and sells iron and steel products in India. It offers steel related rolled products, such as TMT, wire rods, H. B. wire, etc., as well as provides related services. The company is also involved in the generation of electricity through wind power. It also exports its products. The company was formerly known as Bhagwati Resources Limited and changed its name to Adhunik Industries Limited in January 2010. Adhunik Industries Limited was incorporated in 1979 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700020",
        "website": "http://www.adhunikindustries.com",
        "market_cap": "Small Cap"
    },
    "ANKITMETAL.NS": {
        "short_name": "ANKIT METAL & POWE",
        "long_name": "Ankit Metal & Power Limited",
        "summary": "Ankit Metal & Power Limited manufactures and sells iron and steel products in India. The company offers iron ore pillets, sponge iron, M.S. billets, TMT bars, pig iron, and ferro silicon. It serves real estate developers, construction units, forging units, wire drawing units, railways, and engineering industries. The company was founded in 2002 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700026",
        "website": "http://www.ankitmetal.com",
        "market_cap": "Small Cap"
    },
    "APLAPOLLO.NS": {
        "short_name": "APL APOLLO TUBES",
        "long_name": "APL Apollo Tubes Limited",
        "summary": "APL Apollo Tubes Limited manufactures and sells electric resistance welded steel tubes and pipes in India. The company offers MS black pipes for use in liquid transmission, idlers, structural, water and sewage, water well, fire protection, fencing, mechanical and general engineering, and electrical conduit applications; and hollow sections for use in construction, machinery, automotive, furniture, transmission tower, heavy machine equipment, agricultural equipment, and earth moving equipment applications. It also provides pre-galvanized tubes that are used in fencing, cabling and ducting, automotive, greenhouse structures, gates and grills, electrical conduit, and scaffolding applications; and hot dipped galvanized pipes, tubes, and steel pipes used in the underground piping, over ground piping, power, refineries, scaffolding, airports, metro stations, fire-fighting systems, and HVAC applications. In addition, the company offers flat/oval capsule sections, handrails, d-sections, elliptical sections, narrow sections, window sections, and taper sections, as well as modular door solutions. It also exports its products to approximately 20 countries worldwide. The company was formerly known as Bihar Tubes Limited and changed its name to APL Apollo Tubes Limited in 2010. APL Apollo Tubes Limited was founded in 1986 and is headquartered in Ghaziabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ghaziabad",
        "zipcode": "201010",
        "website": "http://www.aplapollo.com",
        "market_cap": "Mid Cap"
    },
    "BEDMUTHA.NS": {
        "short_name": "BEDMUTHA INDUSTRIE",
        "long_name": "Bedmutha Industries Limited",
        "summary": "Bedmutha Industries Limited manufactures and sells steel wire and wire products in India. It operates through Steel, Copper, Consultancy, Windmill, and EPC Projects segments. The company offers galvanized steel and M.S, barbed, stitching, and staple wires, as well as chainlink fencing and wire nails for the retail industry; spring steel wires messenger, high carbon rope, cold heading quality, bead, and patented galvanized and black wires for the automotive industry; and earth, stay, barbed, and 19 strand guy wires, as well as cable armors, single and stranded A.C.S.R. core wires, and distribution boxes for use in power applications. It also provides H.T./P.C. wires, P.C. strands, and annealed/binding wires for the infrastructure sector; copper products comprising rods, wire rods, rectangular strips, bus bars, and foils, as well as sections, profiles, and components; and wire ropes. In addition, the company is involved in the consultancy and wind power generation businesses, as well as in EPC projects. It also exports its products to various countries in Europe, South Korea, Australia, the United States, Africa, and Asia, as well as to GCC Countries, including the Middle East. The company was formerly known as Bedmutha Wire Company Limited and changed its name to Bedmutha Industries Limited in November 2009. Bedmutha Industries Limited was incorporated in 1990 and is based in Nashik, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Nashik",
        "zipcode": "422103",
        "website": "http://www.bedmutha.com",
        "market_cap": "Small Cap"
    },
    "BHARATWIRE.NS": {
        "short_name": "BHARAT WIRE ROPES",
        "long_name": "Bharat Wire Ropes Limited",
        "summary": "Bharat Wire Ropes Limited manufactures and sells steel wire ropes in India. It offers wires, wire ropes, stranded wires, and slings, as well as mechanically spliced slings, hand spliced slings, earth wires, stay wires, guy wires, and spiral strands for use in oil and gas, mining, fishing, ports and marine, elevator, power transmission, railways, construction, infrastructure, defense, crane manufacturing, and other industries. The company serves consumers, private clients, and defense segment clients, as well as for government and semi-government organizations. Bharat Wire Ropes Limited also exports its products to the United States, Singapore, Australia, South Africa, Kuwait, New Zealand, Vietnam, Bangladesh, and Nepal. The company was formerly known as Bharat Ropes Limited and changed its name to Bharat Wire Ropes Limited in July 1996. Bharat Wire Ropes Limited was founded in 1986 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.bharatwireropes.com",
        "market_cap": "Small Cap"
    },
    "ELECTCAST.NS": {
        "short_name": "ELECTROSTEEL CAST",
        "long_name": "Electrosteel Castings Limited",
        "summary": "Electrosteel Castings Limited manufactures and supplies ductile iron (DI) pipes, DI fittings and accessories, and cast iron (CI) pipes in India and internationally. It offers DI pipes, such as DI socket and spigot pipes with push-on joints and DI flanged pipes; and DI fittings, including various socketted DI fittings with push-on joints, various flanged DI fittings, DI fittings with push-on type restrained joints, DI mechanical joint fittings with rubber gaskets and follower glands, and fabricated and custom made DI fittings. The company's DI pipes are used in various applications, including raw and clear water transmission; distribution network of potable water; water supply for industrial/process plants; ash-slurry handling and disposal systems; on-shore and off-shore firefighting systems; desalination plants; sewerage and waste water force mains; gravity sewerage collection and disposal systems; storm water drainage piping; domestic and industrial disposal systems; recycling systems; piping work in water and sewage treatment plants; vertical connection to utilities and reservoirs; piling for ground stabilization; and protective piping under carriage-ways. It also provides technical services and after sales services of laid pipelines, such as pipeline fault diagnosis, rehabilitation, and minor repairs, as well as undertakes turnkey contracts. The company was formerly known as Dalmia Iron and Steel Ltd. Electrosteel Castings Limited was founded in 1955 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700017",
        "website": "http://www.electrosteelcastings.com",
        "market_cap": "Small Cap"
    },
    "GAL.NS": {
        "short_name": "GYSCOAL ALLOYS LTD",
        "long_name": "Gyscoal Alloys Limited",
        "summary": "Gyscoal Alloys Limited manufactures and sells stainless and mild steel long products in India. The company's stainless steel products include equal angle bars, bright round bars, flat bars, flats, and ingots; and mild steel products comprise mild steel angle bars. Its products are primarily used in the construction of chemical plants, pharmaceutical plants, building construction, railways, and other sectors for structural purposes. The company also exports its products to Thailand, Bangladesh, Vietnam, Kenya, Malaysia, Yemen, the United Arab Emirates, the Philippines, Egypt, Indonesia, Ireland, Jordan, Iran, Russia, Morocco, Turkey, Sri Lanka, Taiwan, Belgium, Italy, Spain, Germany, Brazil, Ecuador, Guatemala, Syria, Singapore, and Myanmar. Gyscoal Alloys Limited was incorporated in 1999 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380009",
        "website": "http://www.gyscoal.com",
        "market_cap": "Small Cap"
    },
    "GALLANTT.NS": {
        "short_name": "GALLANTT METAL LTD",
        "long_name": "Gallantt Metal Limited",
        "summary": "Gallantt Metal Limited produces and sells iron, steel, and power in India and internationally. The company operates through Iron and Steel; and Power segments. It offers sponge iron, mild steel billets, and re-rolled products. Gallantt Metal Limited was incorporated in 2005 and is headquartered in Gorakhpur, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gorakhpur",
        "zipcode": "273001",
        "website": "https://gallantt.com/gallantt-metal-limited/",
        "market_cap": "Small Cap"
    },
    "GALLISPAT.NS": {
        "short_name": "GALLANTT ISPAT LTD",
        "long_name": "Gallantt Ispat Limited",
        "summary": "Gallantt Ispat Limited manufactures and sells iron and steel, and agro products under the Gallantt brand name in India. The company operates through Steel, Power, Agro, and Real Estate segments. It offers sponge iron; mild steel billets; re-rolled products, such as TMT bars; and wheat flour products comprising atta, suji, maida, and bran. The company also engages in the real estate business. Gallantt Ispat Limited was incorporated in 2005 and is headquartered in Gorakhpur, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gorakhpur",
        "zipcode": "273001",
        "website": "http://gallantt.com/gallantt-ispat-limited",
        "market_cap": "Small Cap"
    },
    "GFSTEELS.NS": {
        "short_name": "Grand Foundry Ltd",
        "long_name": "Grand Foundry Limited",
        "summary": "Grand Foundry Limited manufactures, markets, and sells stainless steel bright bars and wires in India, the United States, Japan, Singapore, Italy, Australia, and Canada. The company's products are used in various applications in the petrochemical, oil and natural gas, and automotive industries. It also offers pickling and heat treatment line services. Grand Foundry Limited was incorporated in 1973 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400034",
        "website": "http://gfsteel.co.in",
        "market_cap": "Small Cap"
    },
    "GPIL.NS": {
        "short_name": "GODAWARI POWER",
        "long_name": "Godawari Power & Ispat Limited",
        "summary": "Godawari Power & Ispat Limited, together with its subsidiaries, manufactures and sells steel products primarily in India. The company offers various products, such as iron ore pellets, sponge iron, iron and steel billets, MS rounds, steel wires, HB wires, wire rods, silico manganese, fly ash bricks, and ferro alloys. It is also involved in the generation and sale of solar power and iron ore mining activities. The company was formerly known as Ispat Godawari Ltd. Godawari Power & Ispat Limited was incorporated in 1999 and is based in Raipur, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Raipur",
        "zipcode": "492001",
        "website": "http://www.godawaripowerispat.com",
        "market_cap": "Small Cap"
    },
    "HISARMETAL.NS": {
        "short_name": "HISAR METAL INDUST",
        "long_name": "Hisar Metal Industries Limited",
        "summary": "Hisar Metal Industries Limited manufactures and sells cold rolled stainless steel strips, tubes, and pipes in India. The company also exports its products. Hisar Metal Industries Limited was incorporated in 1990 and is based in Hisar, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hisar",
        "zipcode": "125005",
        "website": "http://www.hisarmetal.com",
        "market_cap": "Small Cap"
    },
    "HITECH.NS": {
        "short_name": "HI TECH PIPES LTD",
        "long_name": "Hi-Tech Pipes Limited",
        "summary": "Hi-Tech Pipes Limited manufactures and sells steel products for infrastructure, construction, agriculture, and other industries in India. It offers steel pipes and tubes used in fencing, line pipes, scaffolding, water and gas conveyance, oil country tubular, hand pumps, collieries, thermal powers, telecom, automobiles, and agriculture sector; rectangular and hollow sections; galvanized and pre-galvanized steel pipes and tubes; metal beam crash barriers for applications, such as national highways, expressways, bridges and flyovers, embankments, mines, collieries, motor racing/test drove tracks, village areas along highways, crash test sites, factory areas, traffic safety in airports, plants handling hazardous chemicals, and multi-story parking lots. The company also provides cold rolled sheets and strips used in precision tubes, containers, bicycles, furniture, colour coating, galvanizing and tinning, and automobile industry to produce car body panels; and cold formed sections, as well as solar mounting structures and various other galvanized products. It operates through a network of approximately 390 dealers and distributors. Hi-Tech Pipes Limited also exports its products. The company was formerly known as Ram Lal Harbans Lal Limited and changed its name to Hi-Tech Pipes Limited in October 1986. Hi-Tech Pipes Limited was incorporated in 1985 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110034",
        "website": "http://www.hitechpipes.in",
        "market_cap": "Small Cap"
    },
    "HWHG.F": {
        "short_name": "TATA STEEL GDR REGS IR 10",
        "long_name": "Tata Steel Limited",
        "summary": "Tata Steel Limited manufactures and distributes steel products in India and internationally. It operates in Tata Steel India, Bamnipal Steel (including Tata Steel BSL), Tata Steel Long Products, South-East Asian operations, Other Indian Operations, Tata Steel Europe, Other Trade Related Operations, and Rest of the World segments. The company offers hot-rolled (HR) and cold-rolled (CR) coated steel coils and sheets, precision tubes, tire bead wires, spring wires, and bearings, as well as auto ancillaries for the automotive market; and bearings, galvanized iron wires, agriculture and garden tools, and conveyance tubes, as well as fencing, farming, and irrigation equipment for the agriculture market. It also provides rebars, steel doors and windows, roofing sheets, plumbing pipes, tubes, prefabricated houses, water kiosks, modular toilets, office cabins, rooftop houses, EV charging stations, higher Dia rebars and corrosion-resistance steels, cut and bend bars, PC strands, and ground granulated blast furnace slags for individual house builders, corporate and government bodies, infrastructure companies, and housing and commercial customers in the construction market. In addition, the company offers CR, coated, HR, tube, wire rod, ferro chrome and manganese, boiler tube, pipes, ferroshot, blast furnace slag, coal tar, and metallic products for use in panels and appliances, fabrication and capital goods, furniture, LPG, and welding applications, as well as the process industries, such as cement, power, and steel in the industrial and general engineering markets. Tata Steel Limited was incorporated in 1907 and is based in Mumbai, India.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400001",
        "website": "http://www.tatasteel.com",
        "market_cap": "Large Cap"
    },
    "IMFA.NS": {
        "short_name": "INDIAN METALS & FE",
        "long_name": "Indian Metals and Ferro Alloys Limited",
        "summary": "Indian Metals and Ferro Alloys Limited produces and sells ferro chrome in India. It also offers fly-ash bricks and low density aggregates. The company exports its products to eight countries. The company was founded in 1961 and is headquartered in Bhubaneswar, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bhubaneswar",
        "zipcode": "751010",
        "website": "http://www.imfa.in",
        "market_cap": "Small Cap"
    },
    "ISMTLTD.NS": {
        "short_name": "ISMT LTD",
        "long_name": "ISMT Limited",
        "summary": "ISMT Limited manufactures and supplies seamless tubes and engineering steels for the oil and gas, power, construction equipment, automotive and general engineering, bearing, and other sectors in India. It operates through Tube and Steel segments. The company offers carbon, alloy, and martensitic stainless steel bars, including ultra-clean steels, free machining steels, bearing steels, and other engineered steel grades. It also provides OCTG products, such as high collapse casings; seamless tubes for hydraulic and pneumatic pressure lines; tubes for the mining and drilling industry; hollow bars; tubes for the power generation and energy industry; and auto components. In addition, the company offers bearings, including starter gears and spindle axles for automobiles; cages for constant velocity joints; multi-track sleeves for linear bearings; shaped tubes; OCTG couplings; inner races for bearings; and bearing rings. Further, it provides specialized tubes for the manufacture of hydraulic cylinders; and structural tubes for use in office buildings, industrial structures and bridge construction, sports complexes and stadiums, airport terminals, agricultural and farming equipment, frame structures and body work for locomotives, machine buildings, off-shore installations, and ship building and material handling industries. ISMT Limited was founded in 1977 and is based in Pune, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411014",
        "website": "http://www.ismt.com",
        "market_cap": "Small Cap"
    },
    "JAIBALAJI.NS": {
        "short_name": "JAI BALAJI IND",
        "long_name": "Jai Balaji Industries Limited",
        "summary": "Jai Balaji Industries Limited manufactures and markets iron and steel products primarily in India. It provides sponge iron, pig iron, ductile iron pipe, ferro chrome, TMT, coke, and sinter, as well as ferro alloys, alloy and mild steel billets, and reinforcement steel bars and wire rods. The company offers its TMT bars under the Balaji Shakti brand. Jai Balaji Industries Limited was incorporated in 1999 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700001",
        "website": "http://www.jaibalajigroup.com/jai_balaji_industries_limited.html",
        "market_cap": "Small Cap"
    },
    "JAYNECOIND.NS": {
        "short_name": "JAYASWAL NECO IND",
        "long_name": "Jayaswal Neco Industries Limited",
        "summary": "Jayaswal Neco Industries Limited manufactures and sells steel products, and iron and steel castings primarily in India. It operates through Steel, Iron and Steel Castings, and Other segments. The company offers pig iron, billets, round and square hot rolled bars, sponge iron, pellets, coiled wire rods, and leaf spring flats; automotive products, such as cast iron and spheroidal graphite/ductile iron products; and construction casting products, such as pipes and fittings, and cast iron and ductile iron manhole covers. It also provides engineering products, such as steel plant products, valves, pumps; rolling, sugar, and wind mill products; and earth moving equipment. In addition, the company provides fabrication products, such as hot coke quenching car, scrap charging car, coke pusher beam, pallet car assembly, combustion chamber, elliptical ladle, EOT crane, cupola, heat exchanger, cooler shell, isolation gate for coke oven, and ducting chambers; gate, globe, check, ball, and plug valves in cast steel, stainless steel and alloy steel materials; refractory products, such as castables, bricks, and mortars; and defense equipment. Further, it trades in coal, coke, and PVC pipes. Jayaswal Neco Industries Limited was founded in 1902 and is based in Nagpur, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Nagpur",
        "zipcode": "440016",
        "website": "http://www.necoindia.com",
        "market_cap": "Small Cap"
    },
    "JINDALSAW.NS": {
        "short_name": "JINDAL SAW LTD",
        "long_name": "Jindal Saw Limited",
        "summary": "Jindal Saw Limited, together with its subsidiaries, manufactures and supplies iron and steel pipes and pellets in India and internationally. It operates through Iron and Steel, Waterways Logistics, and Others segments. The company offers submerged arc welded pipes used in the transportation of oil, gas, slurry, water, and structural applications; ductile iron pipes, fittings, and accessories for water and waste-water transportation; carbon and alloy, and stainless steel pipes and tubes primarily used in petroleum, exploration, sugar, steel, bearing, automotive, general engineering, power, and process industries; and operates iron ore mine and pellet plant. It also provides precision stainless steel strips for use in the manufacturing of auto components, clocks, watches, and electrical equipment; drill pipes; soft magnetic nickel alloys; anti corrosion coating of pipes; induction bending of pipes; stainless and carbon steel tubes and welded pipes for the oil and gas, pulp and paper, food, pharmaceuticals, water and sanitation, petrochemical, and boiler and heat exchanger applications, as well as general engineering markets. In addition, the company engages in the transshipment and waterborne transportation businesses; building and repair of barges and ships; inland shipping, business process outsourcing and call center, advisory, helical anchor manufacturing, property holding, tools and fittings, deep-sea transloading, and information technology activities; and trading of pipes. Jindal Saw Limited was founded in 1984 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110066",
        "website": "http://www.jindalsaw.com",
        "market_cap": "Small Cap"
    },
    "JINDALSTEL.NS": {
        "short_name": "JINDAL STEEL & PWR",
        "long_name": "Jindal Steel & Power Limited",
        "summary": "Jindal Steel & Power Limited operates in the steel, power, mining, and infrastructure sectors in Asia, Africa, Australia, and the Middle East. It operates through Iron and Steel Products, Power, and Others segments. The company offers track and crane rails, and flash-butt welded rail panels; and medium and heavy hot rolled parallel flange beams and column sections for use in refineries, metro rail projects, airports, flyovers, power plants, highways, malls, and high rise buildings. It also provides discrete and cut to length plates, and hot rolled coils that are used in general engineering and structural fabrication, railway wagons, pressure vessels and boilers, oil and gas pipelines, bridges and flyovers, shipbuilding, earthmoving equipment, wind mills, and defense equipment; angles and channels for infrastructure, and industrial and light construction segments; TMT rebars; wire rods for various applications; round bars; and fabricated sections. In addition, the company offers suspended concrete flooring systems for use in steel frame structures, RCC frame buildings, poured insitu or precast concrete frames, light gauge steel frames, and conventional structural brick wall constructions; semi-finished products for pipe industries, integrated mills, and rolling facilities; and coal-based sponge iron products. Further, it operates coal and iron ore mines located at various locations in India and internationally; a 3400 MW thermal power plant in Tamnar, Chhattisgarh; and a 258 KM long 400 KV double circuit transmission line to pump the power into the National Grid in India. Additionally, the company produces cement under the Jindal Panther brand; and provides structural steel fabrication and project management services for constructing steel buildings, as well as offers engineering based customized construction solutions. The company was incorporated in 1979 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110066",
        "website": "http://www.jindalsteelpower.com",
        "market_cap": "Mid Cap"
    },
    "JSL.NS": {
        "short_name": "JINDAL STAINLESS",
        "long_name": "Jindal Stainless Limited",
        "summary": "Jindal Stainless Limited manufactures and sells stainless steel products in India and internationally. The company provides ferro alloys, slabs, hot rolled coils, plates and sheets, and cold rolled coils and sheets. Its products are used in automobile, railway, household/durables, building and construction, nuclear, and processing industries. The company was founded in 1970 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110066",
        "website": "http://www.jslstainless.com",
        "market_cap": "Small Cap"
    },
    "JSLHISAR.NS": {
        "short_name": "JINDAL STAINLESS (",
        "long_name": "Jindal Stainless (Hisar) Limited",
        "summary": "Jindal Stainless (Hisar) Limited manufactures and sells stainless steel products in India. The company offers a range of products, including slabs, blooms, hot and cold rolled coils, plates, coin blanks, precision strips, and razor blade steel. It also provides customized stainless steel products; and inventory management, technical value engineering, warehousing, and material testing services. In addition, the company offers stainless steel products for use in modular kitchen, kitchenware, and home and footprint office accessories, as well as cooking utensils under the Arttdinox, Stainless Steel Modular Kitchens, and Krome brands; and operates a network of steel service centers. Its products are used in various applications, such as process and engineering; architecture, building, and construction; automotive, railway, and transport; and consumer durables. The company also exports its products. Jindal Stainless (Hisar) Limited was incorporated in 2013 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110066",
        "website": "http://www.jshlstainless.com",
        "market_cap": "Small Cap"
    },
    "JSWISPL.NS": {
        "short_name": "JSW ISPAT SPE PRO LTD",
        "long_name": "JSW Ispat Special Products Limited",
        "summary": "JSW Ispat Special Products Limited manufactures and markets pellets, sponge iron, ferro alloys, billets, structural steels, and TMT bars in India. It serves infrastructure and construction industries. The company also exports its products. The company was formerly known as Monnet Ispat and Energy Limited and changed its name to JSW Ispat Special Products Limited in September 2020. JSW Ispat Special Products Limited was incorporated in 1990 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.aionjsw.in",
        "market_cap": "Small Cap"
    },
    "JSWSTEEL.NS": {
        "short_name": "JSW STEEL LTD",
        "long_name": "JSW Steel Limited",
        "summary": "JSW Steel Limited engages in the manufacture and sale of iron and steel products in India and internationally. The company provides hot rolled and cold-rolled coils, and electrical steel products, as well as galvanized, galvalume, and color coated products; and TMT bars, wire rods, and special alloy steel products. Its products are used in automotive, general engineering, machinery, and projects and construction applications. The company was formerly known as Jindal Vijayanagar Steel Limited and changed its name to JSW Steel Limited in June 2005. JSW Steel Limited was founded in 1982 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.jsw.in",
        "market_cap": "Large Cap"
    },
    "KAMDHENU.NS": {
        "short_name": "KAMDHENU LTD",
        "long_name": "Kamdhenu Limited",
        "summary": "Kamdhenu Limited manufactures, distributes, and markets steel, and paint and allied products under the Kamdhenu brand name in India. It operates through Steel and Paints segments. The company offers thermo-mechanically-treated bars and rebars; and structural steel, such as angles, channels, beam sections, flats, rounds, and squares. It also provides paint products that comprise exterior and interior emulsions, water based primers, wood finishes, aluminum paints, and textured and designer paints. In addition, the company offers roofing and cladding products, and tile profile roofing sheets comprising pre-painted galvanized steel sheets and pre-painted Alu-Zinc steel sheets; and accessories and rain water systems, such as arch/curved profiles, SDF screws, and fiber sheets, as well as pre-engineered buildings. It offers its products through a network of dealers and distributors. The company was formerly known as Kamdhenu Ispat Limited and changed its name to Kamdhenu Limited in January 2016. Kamdhenu Limited was founded in 1994 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122002",
        "website": "http://www.kamdhenulimited.com",
        "market_cap": "Small Cap"
    },
    "KIOCL.NS": {
        "short_name": "KIOCL LTD",
        "long_name": "KIOCL Limited",
        "summary": "KIOCL Limited manufactures and sells iron oxide pellets for steel plants in India. The company operates in two segments, Pellet and Pig Iron. It produces and sells iron ore pellets; and pig iron. The company also exports its products. KIOCL Limited was founded in 1976 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560034",
        "website": "http://www.kioclltd.in",
        "market_cap": "Mid Cap"
    },
    "KRIDHANINF.NS": {
        "short_name": "KRIDHAN INFRA LIMI",
        "long_name": "Kridhan Infra Limited",
        "summary": "Kridhan Infra Limited manufactures and sells ready to use steel products for the construction and infrastructure sectors in India and internationally. The company offers bridge expansion joints for asphalt and concrete connection; and rebar mechanical couplers. It also provides bored piling, driven piling, micro piling and soil improvement, and soil investigation services. The company was formerly known as Readymade Steel India Limited and changed its name to Kridhan Infra Limited in June 2014. Kridhan Infra Limited was founded in 2006 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400099",
        "website": "http://www.kridhan.com",
        "market_cap": "Small Cap"
    },
    "KSL.NS": {
        "short_name": "KALYANI STEELS",
        "long_name": "Kalyani Steels Limited",
        "summary": "Kalyani Steels Limited manufactures and sells iron and steel products. It provides rolled bars for various automotive applications, including crankshaft, camshaft, connecting rods, gears, transmission shafts, axle beams, steering knuckles, and others; rolled bars for engineering applications comprising alloyed steels for use in energy, railways, defense, fasteners, material handling, etc.; and steel for use in the earthmoving, cement, sugar, steel, coal, ship-building, and oilfield industries, as well as general engineering equipment. The company also offers round cast for seamless tube industry; and machined bars for aluminum smelting industry. It also serves various component manufacturers of commercial vehicles, two wheelers, diesel engines, bearings, tractors, turbines, and rail in India and internationally. The company was founded in 1973 and is based in Pune, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411036",
        "website": "http://www.kalyanisteels.com",
        "market_cap": "Small Cap"
    },
    "MAHASTEEL.NS": {
        "short_name": "MAHAMAYA STEEL IND",
        "long_name": "Mahamaya Steel Industries Limited",
        "summary": "Mahamaya Steel Industries Limited manufactures and sells structural steel products in India. It offers joists, H-beams, channels, angles, billets/blooms, rounds, flats, railway sleepers, etc. The company was formerly known as Rajesh Strips Limited and changed its name to Mahamaya Steel Industries Limited in 2009. Mahamaya Steel Industries Limited was founded in 1988 and is based in Raipur, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Raipur",
        "zipcode": null,
        "website": "http://www.mahamayagroup.in",
        "market_cap": "Small Cap"
    },
    "MAHSEAMLES.NS": {
        "short_name": "MAHARASHTRA SEAML",
        "long_name": "Maharashtra Seamless Limited",
        "summary": "Maharashtra Seamless Limited manufactures and sells seamless steel pipes and tubes in India. It operates in three segments: Steel Pipes & Tubes, Power Â\u0096 Electricity, and RIG. The company offers mild steel and galvanized pipes, API line pipes, oil country tubular goods (OCTG) pipes, and casing and tubing products; and hot finished pipes and tubes, cold drawn and boiler tubes, and OCTG drill pipes. It also provides coated pipes, including 3 layer polyethylene coated pipes, fusion bonded epoxy coated pipes, 3 layer polypropylene coated pipes, and internal epoxy coating pipes, as well as connections and pipe fittings. In addition, the company operates a rig and operates a 5 MW solar power plant in Rajasthan, as well as 7 MW wind power project in Maharashtra. Its products are used in the oil and gas, hydro carbon process, bearing industry, automotive, boiler, heat exchanger, plumbing and firefighting, structural, general engineering, railways, sewage and water well, and hydraulic cylinder sectors. The company was incorporated in 1988 and is based in Gurgaon, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurgaon",
        "zipcode": "122001",
        "website": "http://www.jindal.com/msl",
        "market_cap": "Small Cap"
    },
    "MAITHANALL.NS": {
        "short_name": "MAITHAN ALLOYS LTD",
        "long_name": "Maithan Alloys Limited",
        "summary": "Maithan Alloys Limited manufactures and exports ferro alloys in India and internationally. The company offers ferro silicon, ferro manganese, and silicon manganese products. It is also involved in the generation and supply of wind power. The company serves steel companies. Maithan Alloys Limited was incorporated in 1985 and is based in Burdwan, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Burdwan",
        "zipcode": "713369",
        "website": "http://www.maithanalloys.com",
        "market_cap": "Small Cap"
    },
    "MANAKSTEEL.NS": {
        "short_name": "MANAKSIA STEELS LT",
        "long_name": "Manaksia Steels Limited",
        "summary": "Manaksia Steels Limited manufactures and sells secondary steel products primarily for housing, industry, and infrastructure sectors in India and internationally. The company offers cold rolled sheets used in interior and exterior panels of automobiles, buses, and commercial vehicles; galvanized corrugated sheets for use in the rural housing sector and factory buildings; and galvanized plain sheets used in the manufacture of containers and water tanks. It also provides color coated coils and sheets for sale to construction, housing, consumer durable, and other industries. The company also exports its products. Manaksia Steels Limited was incorporated in 1984 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700001",
        "website": "http://www.manaksia.com/steel_div.php",
        "market_cap": "Small Cap"
    },
    "MANINDS.NS": {
        "short_name": "MAN INDUSTRIES (IN",
        "long_name": "Man Industries (India) Limited",
        "summary": "Man Industries (India) Limited manufactures, processes, and trades in submerged arc welded pipes and steel products in India. The company offers longitudinal submerged arc welded line pipes for use in oil, gas, petrochemicals, fertilizers, and dredging sectors; and helically submerged arc welded line pipes for use in oil transportation, water supply, sewerage, agriculture, and construction, as well as for high pressure applications. It also provides various options of coating systems, which include internal blasting and painting, concrete weight coating, and coaltar enamel coating systems, as well as single layer FBE, 3 Layer PE, and 3 layer PP coating systems. It also exports its products. The company was incorporated in 1988 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400056",
        "website": "http://www.mangroup.com",
        "market_cap": "Small Cap"
    },
    "MIDHANI.NS": {
        "short_name": "MISHRA DHATU NIGAM",
        "long_name": "Mishra Dhatu Nigam Limited",
        "summary": "Mishra Dhatu Nigam Limited manufactures and sells special steels, super alloys, and titanium alloys in India and internationally. The company offers special steels, including martensitic steel, high strength special steel, austenitic steel, and precipitation hardening steel; nickel base, iron base, and cobalt base super alloys used in aeronautics, space, nuclear, chemical, petrochemical, power generation, and furnace industries; and titanium. It also provides soft magnetic and controlled expansion alloys; bars, bright bars, and wire/fine wire; and hot and cold rolled sheets, and strip, as well as open-die forging products. In addition, the company offers special weld consumables, fasteners, biomedical implants, and armour products. The company was founded in 1973 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500058",
        "website": "http://www.midhani-india.in",
        "market_cap": "Small Cap"
    },
    "MSPL.NS": {
        "short_name": "MSP STEEL & POWER",
        "long_name": "MSP Steel & Power Limited",
        "summary": "MSP Steel & Power Limited, together with its subsidiaries, manufactures and sells iron and steel products in India. The company offers TMT bars, billets, sponge iron, pellets, coal washery products, and ferro alloys, as well as structural steel products, such as beams, channels, angles, round bars, and joists for the constructions of bridges, dams, highways, buildings, power plants, etc. It also generates and sells power. The company was incorporated in 1968 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700053",
        "website": "http://www.mspsteel.com",
        "market_cap": "Small Cap"
    },
    "MUKANDLTD.NS": {
        "short_name": "MUKAND",
        "long_name": "Mukand Limited",
        "summary": "Mukand Limited manufactures and sells alloy and stainless steel products in India and internationally. It operates through Steel, Industrial Machinery and Engineering Contracts, and Others segments. The Steel segment offers billets, blooms, rounds, wire rods, bars, rods and sections, bright bars, and wires of special and alloy steel and stainless steel. The Industrial Machinery and Engineering Contracts segment provides EOT and gantry cranes, port and shipyard cranes, bulk material handling equipment, steel structural, processing plant and equipment, etc. for ferrous and non-ferrous industries, as well as rolling mills, power, nuclear, and defense applications; and engineering services. The Others segment in involved in road construction, property development, and non-banking financial activities. It also exports its products. The company was formerly known as Mukand Iron & Steel Works Limited and changed its name to Mukand Limited in March 1989. Mukand Limited was incorporated in 1937 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.mukand.com",
        "market_cap": "Small Cap"
    },
    "NATNLSTEEL.NS": {
        "short_name": "NATIONAL STEEL & A",
        "long_name": "National Steel and Agro Industries Limited",
        "summary": "National Steel and Agro Industries Limited engages in steel, and power businesses primarily in India. The company provides flat steel products, such as cold rolled coil, galvanized corrugated sheets, color coil, pre-painted profile sheets, etc. Its steel products are used for construction, household, transport, and industry/miscellaneous applications. The company also exports its products. National Steel and Agro Industries Limited was incorporated in 1985 and is headquartered in Indore, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Indore",
        "zipcode": "452001",
        "website": "http://www.nsail.com",
        "market_cap": "Small Cap"
    },
    "NMDC.NS": {
        "short_name": "NMDC LTD",
        "long_name": "NMDC Limited",
        "summary": "NMDC Limited, together with its subsidiaries, explores for and produces iron ore in India. The company also explores for a range of minerals, such as copper, rock phosphate, lime stone, dolomite, gypsum, bentonite, magnesite, diamond, tin, tungsten, graphite, beach sands, etc., as well as coal and gold ores. In addition, it produces and sells sponge iron; and generates and sells wind power. The company primarily holds interests in the Bailadila iron ore mines located in Kirandul Complex and Bacheli Complex, Chattisgarh; Donimalai iron ore mines located in various regions, including Kudremukh, Donimalai, Bababudan, Kumaraswamy, and Ramandurg in Karnataka; and a diamond mining project located in Panna, Madhya Pradesh. It also exports its iron ore to Japan and South Korea. The company was formerly known as National Mineral Development Corporation Limited. NMDC Limited was founded in 1958 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500028",
        "website": "http://www.nmdc.co.in",
        "market_cap": "Mid Cap"
    },
    "NTL.NS": {
        "short_name": "NEUEON TOWERS LTD",
        "long_name": "Neueon Towers Limited",
        "summary": "Neueon Towers Limited manufactures and trades in iron and steel products in India and internationally. The company offers galvanized steel products. It also manufactures various telecom/transmission and power towers, as well as TSF products. The company was formerly known as Sujana Towers Limited and changed its name to Neueon Towers Limited in October 2016. Neueon Towers Limited incorporated in 2006 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500038",
        "website": "http://www.sujana.com",
        "market_cap": "Small Cap"
    },
    "OISL.NS": {
        "short_name": "OCL IRON & STEEL L",
        "long_name": "OCL Iron and Steel Limited",
        "summary": "OCL Iron and Steel Limited manufactures and sells iron and steel products in India and internationally. The company offers sponge iron, steel billets, steel coils, and cold rolling and other steel auto components. It also generates power from waste heat recovery boilers and sells it to GRIDCO. The company was incorporated in 2006 and is based in Rajgangpur, India. OCL Iron and Steel Limited is a subsidiary of Garima Buildprop Private Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Rajgangpur",
        "zipcode": "770017",
        "website": "http://www.oclsteel.in",
        "market_cap": "Small Cap"
    },
    "PRAKASH.NS": {
        "short_name": "PRAKASH INDUSTRIES",
        "long_name": "Prakash Industries Limited",
        "summary": "Prakash Industries Limited operates as an integrated steel and power company in India. The company produces sponge iron; steel billets and blooms; ferro alloys; wire rods and HB wire products for use in binding wires, GL wires, fencing barbed wires, armored sealed wires for heavy electrical cables, nut bolts, nails, screws, alpine products, wire ropes, wire mesh products, etc.; and TMT bars for construction and infrastructure projects. It also engages in the generation of wind power with an installed capacity of 15 MW co-generation plant. The company was founded in 1980 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110061",
        "website": "http://www.prakash.com",
        "market_cap": "Small Cap"
    },
    "PRAKASHSTL.NS": {
        "short_name": "PRAKASH STEELAGE",
        "long_name": "Prakash Steelage Limited",
        "summary": "Prakash Steelage Limited engages in the manufacture and sale of stainless steel welded pipes, tubes, and U-tubes in India and internationally. The company also trades in stainless steel products. Its customers include a set of industries, which comprise oil and gas, power, pharmaceutical, petrochemical, sugar, dairy, automobile, desalination, etc. The company was incorporated in 1991 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400004",
        "website": "http://www.prakashsteelage.com",
        "market_cap": "Small Cap"
    },
    "RAJRATAN.NS": {
        "short_name": "Rajratan Global Wire Ltd",
        "long_name": "Rajratan Global Wire Limited",
        "summary": "Rajratan Global Wire Limited manufactures and sells tire bead wires in India and Thailand. The company also offers high carbon steel wires that are used in mechanical springs, high performance springs, mattress springs and lacing wires, hose reinforcements, beddings and seatings, wire ropes and cables, conveyor belts, automotive cables, steel fibers, and cut wire shots for shot blasting and pinning applications. Its tire bead wires are used in various kinds of automobile tires, tires of earth moving equipment, and aircraft. The company also exports its products to Italy, the United States, the Czech Republic, Malaysia, Indonesia, the Philippines, Vietnam, Sri Lanka, the United Arab Emirates, Bangladesh, and other countries. Rajratan Global Wire Limited was incorporated in 1988 and is based in Indore, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Indore",
        "zipcode": "452003",
        "website": "http://www.rajratan.co.in",
        "market_cap": "Small Cap"
    },
    "RAMASTEEL.NS": {
        "short_name": "RAMA STEEL TUBES",
        "long_name": "Rama Steel Tubes Limited",
        "summary": "Rama Steel Tubes Limited manufactures and trades steel pipes and tubes, and rigid poly vinyl chloride and galvanised iron pipes worldwide. It offers ERW galvanized steel pipes and tubes, ERW black steel pipes and tubes, scaffolding pipes and tubes, pre grooved pipes, swaged poles, telecommunication transmission towers and substation structures, hollow sections, cold rolled coils/sheets, galvanized plain coils/sheets, galvanized corrugated sheets, and color coated coils/sheets. The company also exports its products to the United Kingdom, the United Arab Emirates, Sri Lanka, Ethiopia, Kenya, Uganda, Ghana, Kuwait, the Republic of Congo, Yemen, Guyana, Germany, the United States, South Africa, Zambia, Malta, etc. Rama Steel Tubes Limited was founded in 1974 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110096",
        "website": "http://www.ramasteel.com",
        "market_cap": "Small Cap"
    },
    "RAMSARUP.NS": {
        "short_name": "RAMSARUP INDUSTRIE",
        "long_name": "Ramsarup Industries Limited",
        "summary": "Ramsarup Industries Limited produces and distributes iron and steel, wire products, pig iron, sponge iron, TMT bars, and galvanized and black wires in India. It operates through three segments: Wire & Steel Products, Power Generation, and Infrastructure. The company's wire products include hot dipped and electroplated galvanized iron, H.B., cable armour, cable armouring formed, ACSR core single and stranded, P.C. single, P.C. strand 3 ply and 7 ply, bright and galvanized spoke, cycle accessories, shutter spring, spring steel, telegraph, black and galvanized rope, umbrella rib, chain rivet/link, and cotton bailing wires, as well as galvanized steel strands and low relaxation pre-stressed concrete strands/wires. Its wire products are used for various applications in general engineering; I.E. netting, fencing, barbing, and other applications; electrical and transmission lines; re-enforcement of concrete poles and other concrete structures; springs; and rope making and auto cables, as well as in the nail, cable, conductor, prestressed concrete, cycle and two wheeler, telecom, umbrella, chain, and cotton bailing industries. The company also offers TMT bars for use in the railways, power, housing, roads and bridges, water management, and defense sectors. In addition, it generates wind power; and undertakes turnkey projects contracts for various infrastructure projects. The company was incorporated in 1979 is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700001",
        "website": "http://www.ramsarup.com",
        "market_cap": "Small Cap"
    },
    "RATNAMANI.NS": {
        "short_name": "RATNAMANI MET &TBS",
        "long_name": "Ratnamani Metals & Tubes Limited",
        "summary": "Ratnamani Metals & Tubes Limited manufactures and sells stainless steel pipes and tubes, and carbon steel pipes in India and internationally. The company's stainless steel products comprise seamless and welded tubes, and heat exchanger tubes; and instrumentation tubes. It also provides nickel alloy seamless heat exchanger tubes; titanium welded tubes; induction bending; and carbon steel products, such as high frequency electric resistance and submerged arc welded pipes. In addition, the company offers coating solutions comprising external three layer polyethylene/polypropylene coating and dual layer fusion bonded epoxy coating products; and internal coating solutions, such as food grade epoxy / polyurethane / coal tar epoxy / cement lining, and other prevalent coatings. Further, it is also involved in the generation of power by windmills. The company serves oil and gas, thermal power, chemical, fertilizer, sugar, paper, automobile, aeronautics, refinery, nuclear power, petrochemical, water distribution, food and dairy, pharmaceutical, defense, infrastructure, ship building, pumping station, and space industries. Ratnamani Metals & Tubes Limited was founded in 1983 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380013",
        "website": "http://www.ratnamani.com",
        "market_cap": "Small Cap"
    },
    "ROHITFERRO.NS": {
        "short_name": "ROHIT FERRO-TECH",
        "long_name": "Rohit Ferro-Tech Limited",
        "summary": "Rohit Ferro-Tech Limited, together with its subsidiaries, manufactures and sells ferro alloys in India and internationally. The company operates through two segments, Ferro Alloys and Minerals, and Iron and Steel. It offers high carbon ferro manganese, ferro chrome, ferro chrome chips, and ferro chrome fines; silico manganese; and ferro silicon for use in the production of steel. The company also produces stainless steel products, such as cast billets and ingots, rounds/bars, squares and hexagonal bars, and wire rods. Rohit Ferro-Tech Limited was incorporated in 2000 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700026",
        "website": "http://www.rohitferrotech.com",
        "market_cap": "Small Cap"
    },
    "SAIL.NS": {
        "short_name": "STEEL AUTHOR INDIA",
        "long_name": "Steel Authority of India Limited",
        "summary": "Steel Authority of India Limited, a steel-making company, manufactures and sells iron and steel products in India and internationally. It offers rails, long rails, blooms, billets, slabs, channels, joists, angles, TMT rebars, wire rods, crane rails, plates, pig iron, and coal chemicals; and narrow slabs, wheels and axles, plate mill plates, HR plates, HR coils, CR sheets/coils, plain and corrugated galvanized sheets, ERW pipes, spiral weld pipes, and CRNO. The company also provides GP and GC sheets, galvanized steel, HRPO, bars and rebars, Z-bars, MS archs, cold rolled stainless steel, hot rolled carbon and stainless steel products, micro-alloyed carbon steel, and alloy steel squares and rounds. In addition, it offers wear resistant plates, forgings, carne wheels, forged rolls/plates, stainless steel slabs, special steel, and rolled and forged alloy products; and high/medium/low carbon ferro-manganese and silico-manganese products. The company was founded in 1954 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110003",
        "website": "http://sail.co.in",
        "market_cap": "Mid Cap"
    },
    "SALASAR.NS": {
        "short_name": "SALASAR TECHNO ENG",
        "long_name": "Salasar Techno Engineering Limited",
        "summary": "Salasar Techno Engineering Limited manufactures and sells galvanized and non- galvanized steel structures in India and internationally. The company's products include telecommunication towers, power transmission line towers, smart lighting poles, monopoles, guard rails, substation structures, solar module mounting structures, and customized galvanized and non-galvanized steel structures. It also offers engineering, procurement, and control services for rural electrification, power transmission lines, and solar power plant projects. In addition, the company undertakes EPC turnkey projects for power transmission. Salasar Techno Engineering Limited was incorporated in 2001 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110049",
        "website": "http://www.salasartechno.com",
        "market_cap": "Small Cap"
    },
    "SALSTEEL.NS": {
        "short_name": "SAL STEEL LTD",
        "long_name": "S.A.L. Steel Limited",
        "summary": "S.A.L. Steel Limited manufactures and sells sponge iron and ferro alloys in India and internationally. It operates through Iron & Steel and Power segments. The company also offers iron ore pellets and finished steel products. Its products are primarily used in iron and steel industries. In addition, it generates and sells 40 MW power from waste heat recovery boiler and fluidized bed combustion boiler. S.A.L. Steel Limited was incorporated in 2003 and is based in Gandhinagar, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gandhinagar",
        "zipcode": "382721",
        "website": "http://www.salsteel.co.in",
        "market_cap": "Small Cap"
    },
    "SARDAEN.NS": {
        "short_name": "SARDA ENERGY & MIN",
        "long_name": "Sarda Energy & Minerals Limited",
        "summary": "Sarda Energy & Minerals Limited produces and sells steel products in India. The company operates through Steel, Ferro, and Power segments. Its products include sponge iron, billets and wire rods, ferro alloys, eco-bricks, and pellets. The company is also involved in the iron ore mining; and operation of thermal, hydro, and solar power plants. In addition, it exports its products. The company was incorporated in 1973 and is headquartered in Raipur, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Raipur",
        "zipcode": "493111",
        "website": "http://www.seml.co.in",
        "market_cap": "Small Cap"
    },
    "SATHAISPAT.NS": {
        "short_name": "SATHAVAHANA ISPAT",
        "long_name": "Sathavahana Ispat Limited",
        "summary": "Sathavahana Ispat Limited manufactures and sells pig iron, ductile iron pipes, and metallurgical coke primarily in India. The company operates through Ferrous Products and Metallurgical Coke with Co-generation Power segments. It also engages in the co-generation of power with an installed capacity of 50 megawatts. The company was incorporated in 1989 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500016",
        "website": "http://www.sathavahana.com",
        "market_cap": "Small Cap"
    },
    "SHAHALLOYS.NS": {
        "short_name": "SHAH ALLOYS",
        "long_name": "Shah Alloys Limited",
        "summary": "Shah Alloys Limited manufactures and sells flat and long stainless steel, alloy and special steel, carbon/mild steel, and armor steel products in India. It offers hot rolled coils, hot rolled sheets/plates, cold rolled coils and sheets, hot rolled round bars, bright round bars, peeled bars, and hot rolled flat bars, as well as angles, beams, flats, slabs, billets, etc. The company also exports its products to approximately 50 countries. Shah Alloys Limited was founded in 1990 and is based in Gandhinagar, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gandhinagar",
        "zipcode": "382721",
        "website": "http://www.shahalloys.com",
        "market_cap": "Small Cap"
    },
    "SHYAMCENT.NS": {
        "short_name": "SHYAM CENTURY FERR",
        "long_name": "Shyam Century Ferrous Limited",
        "summary": "Shyam Century Ferrous Limited manufactures and sells ferro alloys in India. It provides ferro silicon and silico manganese products. The company also operates 14 MW power generation facility. The company was incorporated in 2011 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700027",
        "website": "http://www.shyamcenturyferrous.com",
        "market_cap": "Small Cap"
    },
    "SMPL.NS": {
        "short_name": "SPLENDID METAL PRO",
        "long_name": "Splendid Metal Products Limited",
        "summary": "Splendid Metal Products Limited manufactures and trades in steel products in India. The company was formerly known as Sujana Metal Products Limited and changed its name to Splendid Metal Products Limited in November 2016. Splendid Metal Products Limited was incorporated in 1988 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500082",
        "website": "http://smpl.sujana.com",
        "market_cap": "Small Cap"
    },
    "STEELXIND.NS": {
        "short_name": "STEEL EXCHANGE IND",
        "long_name": "Steel Exchange India Limited",
        "summary": "Steel Exchange India Limited manufactures and sells steel and related products in India. It produces ingots using sponge iron and scrap/pig iron; TMT bars; sponge iron products, including lumps, fines, and briquettes; and steel billets. The company also trades in various products ranging from finished steel products to semis, coal, scrap, sponge iron, etc. It sells TMT bars under the Simhadri TMT Bars brand. In addition, the company generates power from waste heat. Steel Exchange India Limited was incorporated in 1999 and is based in Visakhapatnam, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Visakhapatnam",
        "zipcode": "530049",
        "website": "http://www.seil.co.in",
        "market_cap": "Small Cap"
    },
    "SUNFLAG.NS": {
        "short_name": "SUNFLAG IRON & STE",
        "long_name": "Sunflag Iron and Steel Company Limited",
        "summary": "Sunflag Iron and Steel Company Limited manufactures and sells steel rolled products in India. The company offers bearing, cold forging, engine valve, micro alloyed, forging, free cutting, stainless, spring, and tool steels, as well as carbon, valve, alloy, free and semi free cutting, cold heading, and high strength steel; and forging ingots, super alloys, magnetic flux leakage testing systems, and automatic phased array ultrasonic machines. It also provides round bars, round cornered squares in straight bars, round and hexagonal wire rods, and hexagonal and flat sections straight bars, as well as bright bars, such as peeled/drawn/ground bars. The company's products are used for the manufacture of automotive transmission gears, drive shafts, steering systems, bearings, exhaust systems, engine components, suspension systems, gear boxes, drive trains, and steering systems. It serves railways, ordnance factories, power sectors, and other general engineering areas. The company exports its products to South East Asia, the Middle East, Europe, and the United States. Sunflag Iron and Steel Company Limited was incorporated in 1984 and is headquartered in Nagpur, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Nagpur",
        "zipcode": "440001",
        "website": "http://www.sunflagsteel.com",
        "market_cap": "Small Cap"
    },
    "SUPREMEENG.NS": {
        "short_name": "Supreme Engineering Ltd",
        "long_name": "Supreme Engineering Limited",
        "summary": "Supreme Engineering Limited manufactures and sells special alloys and special wire products. Its Special Steels division manufactures special alloys, such as super alloys, precipitation hardening steels, martensitic stainless steel, austenitic stainless steel, high strength steel, and high speed steels for use in sectors, such as aerospace, space, defense, nuclear power, thermal power, oil and gas, and heavy engineering. The company's Wire division provides wires, bright bars, fine wires, and profiles for use in automotive, oil and gas, industrial machinery, and hand tools industries. Supreme Engineering Limited was founded in 1987 and is based in Navi Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Navi Mumbai",
        "zipcode": "400701",
        "website": "http://www.supremesteels.com",
        "market_cap": "Small Cap"
    },
    "SURYAROSNI.NS": {
        "short_name": "SURYA ROSHNI",
        "long_name": "Surya Roshni Limited",
        "summary": "Surya Roshni Limited manufactures and markets steel pipes and tubes, lighting products, fans, home appliances, and PVC pipes in India. The company operates through Steel Pipe and Strips; and Lighting and Consumer Durables segments. It offers ERW pipes for agriculture industry and construction activities, such as scaffolding and casing in bore wells; hollow section pipes; spiral welded pipes for transportation of oil, gas, and water, as well as structural and industrial applications; and cold rolled strips and sheets. The company also provides various LED lamps, fittings, down lighters, and power drivers/strips; FTL fittings, starters/ballasts, CFLs, FTL, and GLS lamps; extension board, holder, and immersion heater; irons, torches, and lanterns; indoor commercial, industrial, roadway, flood, landscape, and solar lightening products; and accessories, HID lamps, light sources, and high masts and poles. In addition, it offers celling, table/pedestal/wall, and domestic and industrial exhaust fans; and home appliances, including mixer grinders, juicer mixer grinders, dry and steam irons, induction cooktops, sandwich makers, pop-up toasters, storage and instant water heaters, immersion water heaters, air cooler, oil filled radiators, heat convectors, halogen and quartz heaters, and electric kettles. Further, the company provides CPVC, and uPVC plumbing and SWR pipes, as well as related fittings; and uPVC pressure piping systems. It exports its products to approximately 50 countries worldwide. Surya Roshni Limited was founded in 1973 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110008",
        "website": "http://www.surya.co.in",
        "market_cap": "Small Cap"
    },
    "TATAMETALI.NS": {
        "short_name": "TATA METALIKS",
        "long_name": "Tata Metaliks Limited",
        "summary": "Tata Metaliks Limited manufactures and sells pig iron and ductile iron pipes in India and internationally. The company operates through Pig Iron and Ductile Iron (DI) Pipes segments. It offers pig iron under the Tata eFee brand for various kinds of castings in industries, such as automobile, agriculture and tractor, engineering and industrial, power generation, DI pipes and fittings, sanitary and decorative, railways and other castings, and aluminum smelters. The company provides DI pipes with diameter ranging from 80 mm to 800 mm under the Tata Ductura brand for use in various applications, such as transportation of potable water, sewage, waste water, irrigation, and industrial usage in power plants. In addition, it provides by-products, including granulated blast furnace slag for cement plants; potted pig iron, which is used by foundries as scrap; pig iron scrap; and low fe and high fe iron sweepings. The company was founded in 1990 and is headquartered in Kolkata, India. Tata Metaliks Limited operates as a subsidiary of Tata Steel Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700071",
        "website": "http://www.tatametaliks.com",
        "market_cap": "Small Cap"
    },
    "TATASTEEL.NS": {
        "short_name": "TATA STEEL LTD",
        "long_name": "Tata Steel Limited",
        "summary": "Tata Steel Limited manufactures and distributes steel products in India and internationally. It operates in Tata Steel India, Bamnipal Steel (including Tata Steel BSL), Other Indian Operations, Tata Steel Europe, Other Trade Related Operations, and Rest of the World segments. The company offers hot-rolled (HR) and cold-rolled (CR) coated steel coils and sheets, precision tubes, tire bead wires, spring wires, and bearings, as well as auto ancillaries for the automotive market; and bearings, galvanized iron wires, agriculture and garden tools, and conveyance tubes, as well as fencing, farming, and irrigation equipment for the agriculture market. It also provides rebars, steel doors and windows, roofing sheets, plumbing pipes, tubes, prefabricated houses, water kiosks, modular toilets, office cabins, rooftop houses, EV charging stations, higher Dia rebars and corrosion-resistance steels, cut and bend bars, PC strands, and ground granulated blast furnace slags for individual house builders, corporate and government bodies, infrastructure companies, and housing and commercial customers in the construction market. In addition, the company offers CR, coated, HR, tube, wire rod, ferro chrome and manganese, boiler tube, pipes, ferroshot, blast furnace slag, and metallic products for use in panels and appliances, fabrication and capital goods, furniture, LPG, and welding applications, as well as the process industries, such as cement, power, and steel in the industrial and general engineering markets. Tata Steel Limited was founded in 1907 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400001",
        "website": "http://www.tatasteel.com",
        "market_cap": "Large Cap"
    },
    "TATASTLBSL.NS": {
        "short_name": "TATA STEEL BSL LTD",
        "long_name": "Tata Steel BSL Limited",
        "summary": "Tata Steel BSL Limited operates as a secondary steel producing company in India. It offers hot rolled coils, cold rolled coil and sheets, galvanized plain coils and sheets, galume coils and sheets, color coated coils and tiles, color coated tiles, high tensile steel strips, and hardened and tempered steel strips, as well as CRCAs, CRFHs, precision tubes, HFW/ERW pipes, 3LP coated pipes, billets, and sponge iron. The company serves automobile, white goods/domestic appliances, and general engineering industries. The company was formerly known as Bhushan Steel Limited and changed its name to Tata Steel BSL Limited in November 2018. Tata Steel BSL Limited was incorporated in 1983 and is based in Ghaziabad, India. Tata Steel BSL Limited is a subsidiary of Bamnipal Steel Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ghaziabad",
        "zipcode": "201010",
        "website": "http://www.tatasteelbsl.co.in",
        "market_cap": "Small Cap"
    },
    "TATASTLLP.NS": {
        "short_name": "TATA STEEL LONG PRO LTD",
        "long_name": "Tata Steel Long Products Limited",
        "summary": "Tata Steel Long Products Limited manufactures and sells sponge iron in India. The company offers sponge iron to secondary steel sector for the production of steel. It also operates two power plants with a combined generation capacity of 26 MW that generate power from waste heat. In addition, the company exports sponge iron. The company was formerly known as Tata Sponge Iron Limited and changed its name to Tata Steel Long Products Limited in August 2019. Tata Steel Long Products Limited was incorporated in 1982 and is based in Keonjhar, India. Tata Steel Long Products Limited is a subsidiary of Tata Steel Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Keonjhar",
        "zipcode": "758034",
        "website": "http://www.tatasteellp.com",
        "market_cap": "Small Cap"
    },
    "TINPLATE.NS": {
        "short_name": "TINPLATE CO INDIA",
        "long_name": "The Tinplate Company of India Limited",
        "summary": "The Tinplate Company of India Limited manufactures and supplies tin coated and tin free steel sheets in India. It offers electrolytic tinplates, tin-free steel sheets, lacquered/coated electrolytic tinplate sheets, and printed electrolytic tinplate sheets. Its products are used in packaging edible oil, processed foods, paints, pesticides, battery jackets, aerosol cans, and crown corks, as well as sprays and beverages. The company also exports its products. The company was founded in 1920 and is headquartered in Kolkata, India. The Tinplate Company of India Limited is a subsidiary of Tata Steel Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700001",
        "website": "http://www.tatatinplate.com",
        "market_cap": "Small Cap"
    },
    "USHAMART.NS": {
        "short_name": "USHA MARTIN",
        "long_name": "Usha Martin Limited",
        "summary": "Usha Martin Limited, together with its subsidiaries, manufactures and sells wires, wire ropes, and strands products in India and internationally. The company offers wire ropes, including oil and offshore, crane, mining, elevator, fishing, and general engineering ropes, as well as ropes for conveyor cords, aerial haulage, and structural systems. It also manufactures a range of industrial machines, including wire drawing machines, stranding machines, wire rope closing machines, steel plant equipment, and material handling equipment; machines for manufacturing bright bars; machines for armoring and rewinding; and copper coating lines for CO2 welding wire manufacture. Further, it provides pre-stressing products and services comprising anchorage, sheathing, multipull and single pulling hydraulic jacks and pumps, and grout pumps and agitators; and grips, wire jacks, and hand and power-operated pumps, as well as installation services. Additionally, the company offers spring, ACSR, cold heading quality, auto spoke, brush, needle, cycle, and profile based wires, as well as steel wires for pre-stressed concrete and wires for fasteners; and bright low relaxation (LRPC), normal relaxation, galvanized LRPC, polymer coated galvanized/bright LRPC, grease/wax filled un-bonded, bonded LRPC strands, as well as plain, indented, and ribbed high tensile steel wire for prestressed concrete. It also provides aerial copper, underground optical fiber, optical fiber, and armored / duct jelly filled copper cables. The company was founded in 1960 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700071",
        "website": "http://www.ushamartin.com",
        "market_cap": "Small Cap"
    },
    "UTTAMSTL.NS": {
        "short_name": "UTTAM GALVA STEELS",
        "long_name": "Uttam Galva Steels Limited",
        "summary": "Uttam Galva Steels Limited manufactures and sells steel products in India. The company manufactures cold rolled steel; and galvanized products comprising galvanized plain, galvanized corrugated, and color coated products. It also offers cold rolled closed annealed coils, cut to length sheets, and full hard cold rolled steel. The company's products are used in various applications, such as construction, household appliances, and transportation, as well as in containers, packaging, furniture, light fixtures, and computer peripherals. It also exports its products to approximately 132 countries, including the United States, Canada, Italy, Belgium, Greece, Germany, France, the United Kingdom, Spain, Australia, Japan, China, etc., as well as Africa, South America, and the Far East Asian countries. The company was founded in 1985 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400009",
        "website": "http://www.uttamgalva.com",
        "market_cap": "Small Cap"
    },
    "VASWANI.NS": {
        "short_name": "VASWANI INDUSTRIES",
        "long_name": "Vaswani Industries Limited",
        "summary": "Vaswani Industries Limited manufactures and trades in iron ore pellets, sponge iron, steel billets, HB wires, and ingots in India. The company operates through Iron & Steel, and Power segments. It also generates power through waste heat recovery boilers with an installed capacity of 11.5 megawatts. Vaswani Industries Limited was incorporated in 2003 and is based in Raipur, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Raipur",
        "zipcode": "493221",
        "website": "http://www.vaswaniindustries.com/Vaswani_Industries_Ltd",
        "market_cap": "Small Cap"
    },
    "VISASTEEL.NS": {
        "short_name": "VISA STEEL LTD",
        "long_name": "VISA Steel Limited",
        "summary": "VISA Steel Limited, together with its subsidiaries, manufactures and sells iron and steel products in India. The company operates in two segments, Special Steel and Ferro Alloys. It offers high carbon ferro chrome for use in stainless steel and special steel manufacturing. The company also exports its products. VISA Steel Limited was incorporated in 1996 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700027",
        "website": "http://www.visasteel.com",
        "market_cap": "Small Cap"
    },
    "VSSL.NS": {
        "short_name": "VARDHMAN SPECIAL S",
        "long_name": "Vardhman Special Steels Limited",
        "summary": "Vardhman Special Steels Limited manufactures and sells billets, steel bars, and bright bars of various categories of special and alloy steels in India and internationally. The company serves engineering, automotive, tractor, bearing, and allied industries. Vardhman Special Steels Limited was founded in 1973 and is headquartered in Ludhiana, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ludhiana",
        "zipcode": "141010",
        "website": "http://www.vardhmansteel.com",
        "market_cap": "Small Cap"
    },
    "WELCORP.NS": {
        "short_name": "WELSPUN CORP LTD",
        "long_name": "Welspun Corp Limited",
        "summary": "Welspun Corp Limited, together with its subsidiaries, manufactures and sells steel pipes, plates, and coils in the United States, Saudi Arabia, and India. The company offers helically submerged arc welded line pipes, longitudinally welded pipes, HFW/ERW pipes, as well as provides coating systems, pipe bending, double jointing, and dump site and inventory management services. Its products are used in onshore oil, gas, and water transmission industries. The company was formerly known as Welspun Gujarat Stahl Rohren Limited and changed its name to Welspun Corp Limited in April 2010. Welspun Corp Limited was founded in 1995 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.welspuncorp.com",
        "market_cap": "Small Cap"
    },
    "ZENITHSTL.NS": {
        "short_name": "ZENITH STEEL PIP IND LTD",
        "long_name": "Zenith Steel Pipes & Industries Limited",
        "summary": "Zenith Steel Pipes & Industries Limited manufactures and sells steel pipes worldwide. The company offers electric resistance welded black, galvanized, and helical submerged arc welded pipes. Its products are used for various applications, such as agriculture and irrigation water distribution, bore-well, chilled water systems, green house, electricity conduits, sprinklers, construction water distribution, structural scaffolding and props, industrial general engineering, oil sector distribution of gas, poles, drill rods, fire-fighting systems, space frames, fences, container making, crude, and transmission towers, as well as the auto industry. The company was formerly known as Zenith Birla (India) Limited and changed its name to Zenith Steel Pipes & Industries Limited in July 2020. Zenith Steel Pipes & Industries Limited was incorporated in 1960 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.zenithsteelpipes.com",
        "market_cap": "Small Cap"
    }
}