{
    "BHARTIARTL.NS": {
        "short_name": "BHARTI AIRTEL LTD",
        "long_name": "Bharti Airtel Limited",
        "summary": "Bharti Airtel Limited operates as a telecommunications company in 18 countries across Asia and Africa. It operates through Mobile Services India, Mobile Services Africa, Mobile Services South Asia, Airtel Business, Tower Infrastructure Services, Homes Services, Digital TV Services, and Others segments. The company's product offerings include 2G, 3G, and 4G wireless services, as well as mobile commerce, fixed line services, high speed home broadband, DTH, and enterprise services, including national and international long distance services to carriers. It also provides voice, data, video, network integration, data center, and managed services, as well as enterprise mobility applications and digital media solutions. In addition, the company operates submarine cable system; and provides telecom towers and related infrastructure for various mobile operators. As of March 31, 2020, it had approximately 423 million customers across its operations. The company was formerly known as Bharti Tele-Ventures Limited and changed its name to Bharti Airtel Limited in April 2006. Bharti Airtel Limited has collaboration with Qualcomm Technologies, Inc. for accelerating 5G. The company was founded in 1995 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110070",
        "website": "http://www.airtel.in",
        "market_cap": "Large Cap"
    },
    "GTL.NS": {
        "short_name": "GTL LTD",
        "long_name": "GTL Limited",
        "summary": "GTL Limited operates as an infrastructure services company in India. The company offers services and solutions to address the network life cycle requirements of telecom operators, technology providers, and tower companies. The company provides network operation and maintenance services, such as network monitoring and operation, network field maintenance, technical support and process management, logistics and vendor management, and transition management services. It also offers energy management solutions in the areas of energy audits of telecom infrastructure, process improvement, technology upgradation, and alternate sources of energy. GTL Limited was founded in 1987 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400038",
        "website": "http://www.gtllimited.com",
        "market_cap": "Small Cap"
    },
    "IDEA.NS": {
        "short_name": "VODAFONE IDEA LTD",
        "long_name": "Vodafone Idea Limited",
        "summary": "Vodafone Idea Limited operates mobile telecommunications in India. The company offers 2G, 3G, and 4G services; prepaid, postpaid, and roaming services, as well as interconnect and long distance services; voice, data, and enterprise services, as well as various other value added services, including short messaging services, digital services, Internet of Things, etc. It also trades in handsets, data cards, and related accessories; and provides internet, mobile advertisement, toll free services, etc. Vodafone Idea Limited has approximately 293.7 million mobile subscribers. The company was formerly known as Idea Cellular Limited and changed its name to Vodafone Idea Limited in August 2018. Vodafone Idea Limited was incorporated in 1995 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400030",
        "website": "http://www.vodafoneidea.com",
        "market_cap": "Mid Cap"
    },
    "INDUSTOWER.NS": {
        "short_name": "INDUS TOWERS LIMITED",
        "long_name": "Indus Towers Limited",
        "summary": "Indus Towers Limited provides telecom tower infrastructure sharing services. The company acquires, builds, deploys, owns, operates, and manages telecom towers and communication structures for various mobile operators. As of March 31, 2020, it owned and operated 42,053 towers with 75,715 co-locations in 11 telecommunications circles in India. The company was founded in 2006 and is headquartered in Gurugram, India. Indus Towers Limited is a subsidiary of Bharti Airtel Limited.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122002",
        "website": "http://www.industowers.com",
        "market_cap": "Mid Cap"
    },
    "IWY1.F": {
        "short_name": "SIFY TECHNO.LTD.ADR IR 10",
        "long_name": "Sify Technologies Limited",
        "summary": "Sify Technologies Limited provides integrated ICT solutions and services in India and internationally. The company operates in five segments: Telecom Services, Data Center Services, Cloud and Managed Services, Technology Integration Services, and Applications Integration Services. The Telecom Services segment offers internet protocol based virtual private network services, including intranets, extranets, and remote access applications; and last mile connectivity services. The Data Center Services segment provides co-location, regular backup, server load balancing, and remote backup solutions; shared hosting, network, and security services; storage and virtualization services; and managed voice services to resident enterprises. The Cloud and Managed Services segment offers on-demand hosting services; and remote and onsite infrastructure management services that manages and supports customer operating systems, applications, and database layers, as well as utility-based on-demand storage services. The Technology Integration Services segment provides data center build, network integration, information security, end user computing, and collaborative tools and solutions. The Applications Integration Services segment offers online assessment, web development, supply chain solutions, content management, sale of digital certificates; sale, implementation, and maintenance of industry specific application; and operates online portfolio, including sify.com and samachar.com, gateway to the Internet by offering communication and search tools. The company was formerly known as Sify Limited and changed its name to Sify Technologies Limited in October 2007. The company was founded in 1995 and is headquartered in Chennai, India.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600113",
        "website": "http://www.sifytechnologies.com",
        "market_cap": "Small Cap"
    },
    "MTENY": {
        "short_name": "MAHANAGAR TELEPHONE NIGAM",
        "long_name": "Mahanagar Telephone Nigam Limited",
        "summary": "Mahanagar Telephone Nigam Limited provides fixed-line telecommunication services in Delhi and Mumbai. It offers GSM and CDMA based mobile services; and Internet, broadband, ISDN, and leased line services, as well as telecom consultancy and engineering services, project management services, Wi-Fi solutions, e-governance projects, managed services, turnkey ICT solutions, GIS based services, capacity building and skill development services, etc. In addition, it provides mobile, international long distance, and Internet services in Mauritius. The company was incorporated in 1986 and is based in New Delhi, India.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110003",
        "website": "http://www.mtnl.in",
        "market_cap": "Small Cap"
    },
    "MTNL.NS": {
        "short_name": "MAHANAGAR TELEP NI",
        "long_name": "Mahanagar Telephone Nigam Limited",
        "summary": "Mahanagar Telephone Nigam Limited provides fixed-line telecommunication services in Delhi and Mumbai. It offers GSM and CDMA based mobile services; and Internet, broadband, ISDN, and leased line services, as well as telecom consultancy and engineering services, project management services, Wi-Fi solutions, e-governance projects, managed services, turnkey ICT solutions, GIS based services, capacity building and skill development services, etc. In addition, it provides mobile, international long distance, and Internet services in Mauritius. The company was incorporated in 1986 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110003",
        "website": "http://www.mtnl.in",
        "market_cap": "Small Cap"
    },
    "ONMOBILE.NS": {
        "short_name": "ONMOBILE GLOBAL LT",
        "long_name": "OnMobile Global Limited",
        "summary": "OnMobile Global Limited provides telecom value added services in India and internationally. It offers apps and services under the ONMO brand name; and carrier services, such as ring back tones, videos, contests, and games. The company was formerly known as OnMobile Asia Pacific Private limited and changed its name to OnMobile Global Limited in August 2007. OnMobile Global Limited was founded in 2000 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560100",
        "website": "http://www.onmobile.com",
        "market_cap": "Small Cap"
    },
    "RAILTEL.NS": {
        "short_name": "Railtel Corp of Ind Ltd",
        "long_name": "RailTel Corporation of India Limited",
        "summary": "RailTel Corporation of India Limited provides broadband telecom and multimedia networks and services in India and internationally. The company operates through Telecom Services and Project Work Services segments. It offers E-office, HD video conferencing, data center, RailWire broadband, leased line, virtual private network, internet leased line, consultancy, signaling, rack and space collocation, tower collocation, NLD voice carriage, and aadhaar based services. The company also provides project services, including station Wi-Fi, content on demand, railway display network, national optical fiber network, and national knowledge network services, as well as NE-I AND NE-II services under USOF. It serves telecom operators, Internet service providers, MSOs, enterprises, banks, government institutions/ departments, educational institutions/universities, etc. The company was founded in 2000 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110023",
        "website": "http://www.railtelindia.com",
        "market_cap": "Small Cap"
    },
    "RCOM.NS": {
        "short_name": "RELIANCE COMM LTD",
        "long_name": "Reliance Communications Limited",
        "summary": "Reliance Communications Limited provides enterprise voice, data, video, and IT infrastructure solutions to enterprises, over-the-top (OTT) players, and network operators in India and internationally. It offers business Internet, network, cloud networking, data center, enterprise voice, cloud telephony, and access number services; and collaboration services, which include audio and Web conferencing, as well as voice and various value-added wholesaling services for carriers and service providers. The company also builds, owns, and operates telecommunication towers, optic fiber cable assets, and related assets. In addition, it offers infrastructure and connectivity, and managed services. The company was formerly known as Reliance Communication Ventures Limited and changed its name to Reliance Communications Limited in June 2006. Reliance Communications Limited was incorporated in 2004 and is based in Navi Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Navi Mumbai",
        "zipcode": "400710",
        "website": "http://www.rcom.co.in",
        "market_cap": "Small Cap"
    },
    "ROUTE.NS": {
        "short_name": "ROUTE MOBILE LIMITED",
        "long_name": "Route Mobile Limited",
        "summary": "Route Mobile Limited provides cloud-communication platform services to enterprises, over-the-top players, and mobile network operators in Africa, the Asia Pacific, Europe, the Middle East, and North America. It offers messaging, voice, and email, as well as short messaging service (SMS) filtering, analytics, and monetization; and firewall, SMS hubbing, and instant virtual number solutions. The company provides its cloud-communication services to clients in the social media, banking and financial services, aviation, retail, Internet/e-commerce, logistics, healthcare, hospitality, media and entertainment, pharmaceuticals, and telecom sectors. Route Mobile Limited was founded in 2004 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400064",
        "website": "http://www.routemobile.com",
        "market_cap": "Small Cap"
    },
    "SIFY": {
        "short_name": "Sify Technologies Limited - Ame",
        "long_name": "Sify Technologies Limited",
        "summary": "Sify Technologies Limited provides integrated ICT solutions and services in India and internationally. The company operates in five segments: Telecom Services, Data Center Services, Cloud and Managed Services, Technology Integration Services, and Applications Integration Services. The Telecom Services segment offers internet protocol based virtual private network services, including intranets, extranets, and remote access applications; and last mile connectivity services. The Data Center Services segment provides co-location, regular backup, server load balancing, and remote backup solutions; shared hosting, network, and security services; storage and virtualization services; and managed voice services to resident enterprises. The Cloud and Managed Services segment offers on-demand hosting services; and remote and onsite infrastructure management services that manages and supports customer operating systems, applications, and database layers, as well as utility-based on-demand storage services. The Technology Integration Services segment provides data center build, network integration, information security, end user computing, and collaborative tools and solutions. The Applications Integration Services segment offers online assessment, web development, supply chain solutions, content management, sale of digital certificates; sale, implementation, and maintenance of industry specific application; and operates online portfolio, including sify.com and samachar.com, gateway to the Internet by offering communication and search tools. The company was formerly known as Sify Limited and changed its name to Sify Technologies Limited in October 2007. The company was founded in 1995 and is headquartered in Chennai, India.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600113",
        "website": "http://www.sifytechnologies.com",
        "market_cap": "Small Cap"
    },
    "TATACOMM.NS": {
        "short_name": "TATA COMMUNICATION",
        "long_name": "Tata Communications Limited",
        "summary": "Tata Communications Limited provides telecommunications services worldwide. The company operates through Voice Solutions, Data and Managed Services, and Real Estate segments. It offers voice and data transmission services; Internet connectivity services; and other value-added services, such as unified conferencing and collaboration, managed hosting, mobile global roaming and signaling, transponder lease, and television up-linking, and other managed services, as well as sells and leases bandwidth on undersea cable systems. The company also provides network services, such as virtual private network, WAN Ethernet, Internet access, Internet with MDDoS, private line, and content delivery network services; application aware networking services; and cloud and data center services comprising managed hosting, managed storage and back-up, managed database, and co-location services. In addition, it offers managed security services, such as content security and privacy, secure application and access, network and infrastructure security, threat management, and risk and compliance; and mobility and Internet of Things services. Further, the company provides media and entertainment services, including video connect network, OTT platform as a service, live VDN, teleport, cloud master control, and workflow automation services; and leases premises. It serves service providers and enterprises. The company was formerly known as Videsh Sanchar Nigam Limited and changed its name to Tata Communications Limited in 2008. Tata Communications Limited was founded in 1986 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400098",
        "website": "http://www.tatacommunications.com",
        "market_cap": "Mid Cap"
    },
    "TTML.NS": {
        "short_name": "TATA TELESERVICES",
        "long_name": "Tata Teleservices (Maharashtra) Limited",
        "summary": "Tata Teleservices (Maharashtra) Limited provides wireline voice, data, and managed telecom services to enterprise customers in Maharashtra and Goa, India. The company provides its wireline and broadband services under the Tata Tele Business Services brand name. It offers cloud and software as a services comprising content delivery network, digital survey, document management, cloud CRM, endpoint security, fee collection, and live chat services; collaboration services, such as audio and web conferencing, international bridging, and webcasting services; and connectivity services, including business broadband, centrex, Internet lease line connection, L2 multicast, leased line, PRI, SIP trunk, smart VPN, and SmartOffice, a business connectivity solution. The company also provides Internet of Things solutions comprising asset management, fleet management tracking, school bus tracking, and workforce management solutions; and marketing solutions, such as call register, digital survey, hosted OBD and IVR, SMS solutions, and toll free services. As of December 31, 2019, it provided products and services to approximately 0.8 million direct exchange lines and had 17,000 kilometers of optical fiber transmission network. The company was incorporated in 1995 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400033",
        "website": "http://www.tatateleservices.com",
        "market_cap": "Small Cap"
    }
}