{
  "AARVEEDEN.NS": {
    "city": "Ahmedabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Aarvee Denims and Exports Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "AARVEE DENIMS & EX",
    "state": null,
    "summary": "Aarvee Denims and Exports Limited engages in manufacturing and selling of fabrics in India and internationally. It operates in two segments, Textile and Windmill. The company offers cotton fibers; cotton and texturized yarns; ring, shirting, printed, stretch, satin, flat finish, special blend, LYCRA, and other denims; and non-denim fabrics. It is also involved in the wind power generation activities. The company was founded in 1988 and is headquartered in Ahmedabad, India.",
    "website": "http://www.aarveedenims.com",
    "zipcode": "382405"
  },
  "ALOKINDS.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Alok Industries Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Alok Industries Limited",
    "state": null,
    "summary": "Alok Industries Limited is under corporate insolvency resolution process. Previously, it was engaged in the manufacture and sale of textile products in India and internationally. The company was founded in 1986 and is based in Mumbai, India.",
    "website": "http://www.alokind.com",
    "zipcode": "400013"
  },
  "ALPSINDUS.NS": {
    "city": "Ghaziabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Alps Industries Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ALPS INDS",
    "state": null,
    "summary": "Alps Industries Limited manufactures and sells home furnishings, fashion accessories, and yarns in India and internationally. The company offers various yarn products, including open end, carded and combed grey single, compact, organic cotton, fair trade cotton, contamination free, slub, core spun lycra, reverse and zero twist, dyed, organic dyed, recycled cotton, and recycled polyester yarns. It also provides home textiles, such as drapery, upholstery, blackouts, duvet sets, bed covers and sheets, quilts, pillows, cushion covers, curtains, and table linens; cashmere, sheer, and aromatic shawls, scarves, mufflers, stoles, wraps, and other fashion accessories; and fabrics for upholstery, including office furniture and automobile seats. In addition, the company offers automotive/technical textiles; and bedding, windows dressings, decorative pillows and accents, table linen, and kitchen linen products. It sells its fashion accessories under the Le-Pashmina brand name. Alps Industries Limited was founded in 1962 and is based in Ghaziabad, India.",
    "website": "http://www.alpsindustries.com",
    "zipcode": "201010"
  },
  "AMBIKCO.NS": {
    "city": "Coimbatore",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Ambika Cotton Mills Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "AMBIKA COTTON MILL",
    "state": null,
    "summary": "Ambika Cotton Mills Limited manufactures and sells specialty cotton yarns, waste cotton, and knitted fabrics in India, other Asian countries, Europe, and North America. The company operates in two segments, Textiles and Windmills. It also operates wind mills with an installed capacity of 27.4 MW in Tirunelveli, Dharapuram, and Theni in the State of Tamilnadu. The company serves the manufacturers of branded shirts and T-shirts. Ambika Cotton Mills Limited was incorporated in 1988 and is headquartered in Coimbatore, India.",
    "website": "http://www.acmills.in",
    "zipcode": "641012"
  },
  "ARVIND.NS": {
    "city": "Ahmedabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Arvind Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ARVIND LTD",
    "state": null,
    "summary": "Arvind Limited, together with its subsidiaries, manufactures, supplies, and exports textiles worldwide. It operates through Textiles, Advanced Material, and Others segments. The company offers denim fabrics, shirting fabrics, woven and knitted fabrics, and voiles and garments products. It also provides a range of specialized clothing and accessories for factory workers, fire-fighters, construction crews, soldiers, and healthcare and security personnel; hot-gas and liquid filtration products; interiors and seating solutions; and composites and coated fabrics. In addition, the company supplies water and waste water treatment plants for industrial process, and waste water and zero liquid discharge solutions. Further, it is involved in the e-commerce, technical textiles, agriculture produce, telecommunication, and other businesses, as well as offers EPABX and one to many radio solutions. The company was founded in 1931 and is headquartered in Ahmedabad, India.",
    "website": "http://www.arvind.com",
    "zipcode": "380025"
  },
  "ASHIMASYN.NS": {
    "city": "Ahmedabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Ashima Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ASHIMA",
    "state": null,
    "summary": "Ashima Limited manufactures and sells textile and related products in India. It offers basic denim; ring/slub denim; pigment/discharged print; polyester denim; and various yarn dyed fabrics, such as stripes, chambrays, twills, oxford, herringbones, indigo checks, pique, satin, dobbies, fusible woven interlinings, etc. The company also offers a range of shirts and jeans for men and women, as well as provides ready-to-stitch trouser and shirt fabric packs for men. It sells its products under the Frank Jefferson and ICON brands. The company also exports its products to approximately 45 countries. Ashima Limited was founded in 1982 and is based in Ahmedabad, India.",
    "website": "http://www.ashima.in",
    "zipcode": "380021"
  },
  "AYMSYNTEX.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "AYM Syntex Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "AYM SYNTEX LIMITED",
    "state": null,
    "summary": "AYM Syntex Limited manufactures and sells synthetic yarns in India. It offers bulk continuous filament yarns used in residential wall to wall, contract/hospitality, outdoor, handmade, and automotive carpets, as well as rugs, bath mats, and carpet tiles; industrial yarns that are used in sewing threads, coated fabrics, wet filtration, and ropes and nets; and automotive yarn used in bolsters, inserts, door panels, and headliners. The company also provides textile yarn and packaged dyed yarns for various applications, such as apparel and fashion, sarees and dress materials, hosiery and socks, home textiles, medical textiles, narrow fabrics, and sportswear. The company sells its products under the Comfeel, Elior, Polycycle, Articool, Spinovate, Silque, Ultraflex, Assura, Novacore, 100% Ployster Textile, Sorenyl, Rezilia, Ecose, Sparkle, Polymagic, Polywonder, Wonderfeel, greenova, and Silkenza brand names. AYM Syntex Limited also exports its products. The company was formerly known as Welspun Syntex Limited and changed its name to AYM Syntex Limited in December 2015. The company was incorporated in 1983 and is headquartered in Mumbai, India. AYM Syntex Limited is a subsidiary of Mandawewala Enterprises Limited.",
    "website": "http://www.aymsyntex.com",
    "zipcode": "400013"
  },
  "BANSWRAS.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Banswara Syntex Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "BANSWARA SYNTEX",
    "state": null,
    "summary": "Banswara Syntex Limited engages in the manufacture, market, and sale of textile products in India. The company offers spun synthetic blended, wool, and wool mix yarns; and spun synthetic and worsted, and cotton and linen fabrics, as well as readymade garments, such as trousers, jackets, and waistcoats. It also provides shirting and technical, jacquard, and knitted fabrics; polyester, viscose, acrylic, wool, lycra, linen, and high twists yarns; yarn and piece dyeing solutions; and fabrics for men's and women's wear, and home textile furnishing fabrics in various blends. In addition, the company offers performance finish; technical fabrics used for high altitude weather and sports wear; and automotive fabrics for trimming interiors of automobile seats and doors. Further, it provides fire retardant fabrics for that can be used as curtains, upholstery, drapes, wall paneling, cushion covers, and sheets, as well as lining for tents for use in furnishing auditoriums, multiplexes, cinema halls, hotels, railway coaches, airlines, ships and cruise, and buses and coaches. Additionally, the company owns thermal power plant that generates approximately 30 MW of captive power. The company also exports its products to Vietnam, South Korea, Turkey, the United States, the United Kingdom, Bangladesh, South Africa, Mexico, and internationally. Banswara Syntex Limited was founded in 1976 and is headquartered in Mumbai, India.",
    "website": "http://www.banswarasyntex.com",
    "zipcode": "400002"
  },
  "BASML.NS": {
    "city": "Coimbatore",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Bannari Amman Spinning Mills Ltd",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "BANNARI AMMAN SPIN",
    "state": null,
    "summary": "Bannari Amman Spinning Mills Ltd engages in textile business in India. It manufactures and markets cotton yarns; woven and knitted fabrics; home textiles; and knitted garments, as well as processes fabrics. The company is also involved in the retail of inner wear and active wear for men, women, and kids under the Bitz brand. In addition, it engages in the wind power generation activities. The company also exports its products. The company was incorporated in 1989 and is based in Coimbatore, India. As of November 19, 2020, Bannari Amman Spinning Mills Ltd operates as a subsidiary of Murugan Enterprise Private Limited.",
    "website": "http://www.bannarimills.com",
    "zipcode": "641043"
  },
  "BRFL.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Bombay Rayon Fashions Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "BOMBAY RAYON FASHIONS LTD",
    "state": null,
    "summary": "Bombay Rayon Fashions Limited, an integrated textile company, manufactures and sells yarn, fabrics, and garments in India. The company also manufactures apparel; and polyester buttons for shirts, coats, outer wear, and trousers, as well as fancy buttons. In addition, it engages in the wholesale, retail, marketing, and distribution of clothing products. Bombay Rayon Fashions Limited also exports its products. The company was founded in 1986 and is headquartered in Mumbai, India.",
    "website": "http://www.bombayrayon.com",
    "zipcode": "400054"
  },
  "BSL.NS": {
    "city": "Noida",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "BSL Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "BSL",
    "state": null,
    "summary": "BSL Limited, a textile company, manufactures and sells fabrics and yarns in India and internationally. The company operates through Textile and Wind Power segments. It produces a range of polyester viscose fabrics, including suiting, shirting, safari, and corduroy blends; worsted fabrics, such as wool, wool rich, lycra blended poly wool, poly viscose, mohair polyester wool, and polyester silk wool fabrics. The company also offers wool, wool-blended, and premium lightweight fabrics; wool modal, Trevira wool, and other specialized fabrics blended with lycra, silk, linen, tencel, etc.; and furnishing and fashion fabrics. In addition, it is involved in the generation of wind power at Jaisalmer. The company also offers its products online under the BSL, GEOFFREY HAMMONDS, LINFAB, and Belfast brands. BSL Limited was incorporated in 1970 and is based in Noida, India.",
    "website": "http://www.bslltd.com",
    "zipcode": "201301"
  },
  "CENTENKA.NS": {
    "city": "Pune",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Century Enka Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "CENTURY ENKA",
    "state": null,
    "summary": "Century Enka Limited manufactures and sells synthetic yarns in India and internationally. The company offers nylon industrial yarns and tire cord fabrics, including yarn, greige fabrics, and dipped fabrics for reinforcement of tires, which are used in motor cycles, scooters, light commercial vehicles, heavy commercial vehicles, and off the road. It also provides nylon filament yarns, such as mono filament, mother, multifilament, and tow yarns for use in the apparel industry. Century Enka Limited was founded in 1965 and is based in Pune, India.",
    "website": "http://www.centuryenka.com",
    "zipcode": "411026"
  },
  "DAMODARIND.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Damodar Industries Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "DAMODAR INDUSTRIES",
    "state": null,
    "summary": "Damodar Industries Limited manufactures and processes cotton and fancy yarns in India. It also exports its products to approximately 40 countries across Europe, South Africa, South America, Australia, Korea, Belgium, Singapore, Italy, Egypt, and the Gulf countries. The company was formerly known as Damodar Threads Limited and changed its name to Damodar Industries Limited in January 2013. Damodar Industries Limited was incorporated in 1987 and is headquartered in Mumbai, India.",
    "website": "http://www.damodargroup.com",
    "zipcode": "400013"
  },
  "DCMNVL.NS": {
    "city": "New Delhi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "DCM Nouvelle Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "DCM Nouvelle Limited",
    "state": null,
    "summary": "DCM Nouvelle Limited manufactures and sells cotton yarns. The company offers better cotton initiative, organic, and SLUB yarns. It also exports its products. The company was founded in 1991 and is based in New Delhi, India.",
    "website": "http://www.dcmnvl.com",
    "zipcode": "110008"
  },
  "DONEAR.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Donear Industries Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "DONEAR INDUSTRIES",
    "state": null,
    "summary": "Donear Industries Limited manufactures and sells suitings, trousers, and shirting fabrics for men and women in India and internationally. The company operates through two segments, Manufacturing and Dealing in Textiles; and Rental Property. Its products include polyester viscose blended fabrics, polyester cotton blended fabrics, polyester fabrics, cotton high value plain and yarn dyed shirting fabrics, and cotton plain and yarn dyed bottomwear, as well as polyester wool, wool rich, and all wool fabrics. The company offers fabrics under the Donear brand name; and garments under the brand name of Dcot. It markets and sells its products through a sales network consisting of 115 agents; 629 wholesalers; and 24,000 over the counter multi brand retail outlets in 29 states and 7 Union Territories of India. The company also exports various blends of fabrics, including wool, polyester/viscose, polyester/wool, polyester/cotton, poly/visc/cotton, poly/visc/lycra, poly/wool/lycra, cotton, linen cotton, linen, and cotton modal to wholesalers, distributors, garment manufacturers, retailers, buying houses, and departmental stores in approximately 37 countries worldwide. Donear Industries Limited was founded in 1977 and is based in Mumbai, India.",
    "website": "http://www.donear.com",
    "zipcode": "400093"
  },
  "EASTSILK.NS": {
    "city": "Kolkata",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Eastern Silk Industries Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "EASTERN SILK IND",
    "state": null,
    "summary": "Eastern Silk Industries Limited manufactures and sells textile and allied products in India. It provides silk yarns, fabrics and made-ups, home furnishings, scarves, laces, and belts, as well as fashion, handloom, embroidered, and double width fabrics. The company also exports its products to the United States, Europe, Australia, the Middle East, Canada, Japan, New Zealand, Scandinavian, and EFFTA countries. Eastern Silk Industries Limited was incorporated in 1946 and is based in Kolkata, India.",
    "website": "http://www.easternsilk.com",
    "zipcode": "700001"
  },
  "FILATEX.NS": {
    "city": "New Delhi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Filatex India Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "FILATEX INDIA",
    "state": null,
    "summary": "Filatex India Limited manufactures and trades in synthetic yarns and textiles primarily in India. The company offers partially oriented yarns, which are used in shirtings and suitings, sarees, ladies' dress materials, and knitwear; polyester textured yarns that are used to produce fabrics and textiles for high-end apparel, high-end sports shoes, sports bags, home furnishings, and zipper tapes; and fully drawn yarns (FDYs) are used in making fabrics and textiles for high-end undergarments, high-end sportswear, and home furnishings. It also provides polypropylene multifilament crimp yarns, which are used in socks, tights, panty hoses, car and furniture upholstery, soccer/sports socks, ribbons, nets, dyeing hoses, filtration fabrics, laces, swimwear, sportswear, under garments, and seamless products, as well as for weaving and knitting applications, etc. In addition, the company offers narrow woven fabrics for the manufacturer of zippers and mattress tape, leashes, elastic tape, ribbon, plain and fancy belts, and other specialized items; monofilament yarns; and polyethylene terephthalate chips for use in making polyester filament yarns, such as partially oriented yarns, FDYs, and staple fibers, which are used in the textile industry. It also exports its products to approximately 45 countries. Filatex India Limited was incorporated in 1990 and is based in New Delhi, India.",
    "website": "http://www.filatex.com",
    "zipcode": "110025"
  },
  "FLEXITUFF.NS": {
    "city": "Pithampur",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Flexituff Ventures International Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "FLEXITUFF VENTURES",
    "state": null,
    "summary": "Flexituff Ventures International Limited manufactures and sells woven and non-woven geo-textiles in India, the United States, Singapore, and internationally. It offers flexible intermediate bulk containers (FIBCs), including four loop and single/two loop bags, builder bags/tunnel lift bags, type C and D specialized bags, baffle bags, UN bags, ventilated bags, and FIBCs with special liners; reverse-printed biaxially oriented polypropylene woven bags; and non-woven floor covering carpets, interlining for apparels, non-woven filter fabrics, and synthetic leather substrates and shoe linings, as well as injection-molded drippers. The company also produces and sells geosynthetics, such as sand-tubular geomattresses, and flexicell products; and geosynthetics-gravity reinforced wall chains comprising inter-connected chambers, geocomposite geobags, and geotextile tubes, as well as geofil mattresses, dewatering geo tubes, and nonwoven geobags. It also exports its products to approximately 60 countries. The company was formerly known as Flexituff International Limited and changed its name to Flexituff Ventures International Limited in September 2018. Flexituff Ventures International Limited was incorporated in 1993 and is based in Pithampur, India.",
    "website": "http://www.flexituff.com",
    "zipcode": "454775"
  },
  "GANECOS.NS": {
    "city": "Kanpur",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Ganesha Ecosphere Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GANESHA ECOSPHERE",
    "state": null,
    "summary": "Ganesha Ecosphere Limited primarily manufactures and sells recycled polyester staple fiber in India and internationally. The company also provides dyed texturized/twisted filament yarns and spun yarns. Its products are used in the manufacture of textiles, such as T-shirts, body warmers, dress material, sarees, rope and cord kinds, etc., as well as suiting, shirting, and furnishing fabrics; functional textiles, including non-woven air filter fabrics, geo textiles, carpets, car upholstery, etc.; and filtration and fillings for pillows, duvets, toys, etc. Ganesha Ecosphere Limited also exports its products. The company was formerly known as Ganesh Polytex Ltd. and changed its name to Ganesha Ecosphere Limited in September 2011. Ganesha Ecosphere Limited was founded in 1987 and is based in Kanpur, India.",
    "website": "http://www.ganeshaecosphere.com",
    "zipcode": "208002"
  },
  "GANGOTRI.NS": {
    "city": "Coimbatore",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Gangotri Textiles Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GANGOTRI TEXTILE",
    "state": null,
    "summary": "Gangotri Textiles Limited trades in cotton yarns and cotton wastes in India. The company was incorporated in 1989 and is based in Coimbatore, India.",
    "website": "http://www.gangotritextiles.co.in",
    "zipcode": "641002"
  },
  "GARFIBRES.NS": {
    "city": "Pune",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Garware Technical Fibres Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GARWARE TECHNICAL",
    "state": null,
    "summary": "Garware Technical Fibres Limited manufactures and sells various technical textile products worldwide. It offers fishing nets, ropes, and twines for the deep sea fishing industry; aquaculture cages and predator systems; synthetic ropes for various applications from power transmission to marine hawsers for shipping, mooring, and towing applications; and yarn and thread solutions under the Garlon brand. The company also provides sports products, including soccer, soccer ball carry, tennis, handball, volleyball, SKI, swimming pool, hockey, ice hockey, basket ball, golf, badminton, and cricket nets, as well as baseball batting cage, rapelling, slithering, and fitness rope/ battle ropes under Sportiva brand name; coated fabric products, such as truck tarpaulins, awnings, tents, hangar covers, inflatable bouncies, bio gas covers, trailer curtains, oil booms, and others; and agricultural products comprising agriculture shade nets, sericulture nets, insect nets, fencing nets, floriculture nets, crop support nets, grape nets, anti-bird nets, and staking cords. In addition, it offers geo-synthetics products in the field of civil engineering and infrastructure development. The company was formerly known as Garware-Wall Ropes Limited and changed its name to Garware Technical Fibres Limited in July 2018. Garware Technical Fibres Limited was founded in 1976 and is headquartered in Pune, India.",
    "website": "http://www.garwarefibres.com",
    "zipcode": "411019"
  },
  "GINNIFILA.NS": {
    "city": "Noida",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Ginni Filaments Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GINNI FILAMENTS",
    "state": null,
    "summary": "Ginni Filaments Limited manufactures and sells cotton yarns, knitted fabrics, non-woven fabrics, garments, wipes, and cosmetics in India. The company operates through Textiles and Others segments. It offers ring spun, open end, and specialty yarns; single and double jersey, and flat knit fabrics; and garments, such as polo's, round necks, rugby's, henley's, sweat shirts, and leggings for men, ladies, and children. The company also provides nonwoven fabrics comprising polyester, viscose, and cotton enriched blends that are used in various applications, including personal hygiene, medical, hospitality, packaging, garments, pultrusion, leather, filtration, automobile, and home furnishing; and filters used for the removal of contaminants from water and other liquids in pharmaceutical, cosmetic, biotechnology, and other industries. In addition, it offers hygiene, cosmetic, medical, home care, and baby care disposable wipes. The company also exports its products. Ginni Filaments Limited was incorporated in 1982 and is based in Noida, India.",
    "website": "http://www.ginnifilaments.com",
    "zipcode": "201307"
  },
  "GLOBE.NS": {
    "city": "Ahmedabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Globe Textiles (India) Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Globe Textiles (I) Ltd.",
    "state": null,
    "summary": "Globe Textiles (India) Limited manufactures and trades in textile and apparel products in India and internationally. The company offers denim and non-denim fabrics; shirting fabrics, such as printed linens, suiting prints, and dyed shirting fabrics; printed fabrics, including polyester print fabrics, chadri voiles, sarongs, scarfs, polyester dyed fabrics, cotton prints, and cotton dyed fabrics; and jeans for men and women under the Afford, INDIGIRL, and INDIGEN brand names. It also provides yarns; and home textiles comprising bedsheets, comforters, fitted and flat sheets, curtains, table linens, and fancy cushions. The company also exports its products. Globe Textiles (India) Limited was founded in 1995 and is based in Ahmedabad, India.",
    "website": "http://globetextiles.net",
    "zipcode": "380008"
  },
  "GTNTEX.NS": {
    "city": "Kochi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "GTN Textiles Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GTN TEXTILES",
    "state": null,
    "summary": "GTN Textiles Limited engages in the manufacture and sale of combed cotton yarn in India. It operates through, Yarn and Realty segments. The company's product includes compact, ring spun, siro compact, and slub yarns, as well as knitted fabrics. It is also involved in real estate business. The company also export its products. GTN Textiles Limited was incorporated in 2005 and is headquartered in Kochi, India.",
    "website": "http://www.gtntextiles.com",
    "zipcode": "682016"
  },
  "HIMATSEIDE.NS": {
    "city": "Bengaluru",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Himatsingka Seide Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "HIMATSINGKA SEIDE",
    "state": null,
    "summary": "Himatsingka Seide Limited manufactures, distributes, and sale of home textile products in North America, India, rest of Asia Pacific, Europe, the Middle East, Africa, and internationally. It offers bed ensembles, including sheet sets, pillowcases, duvets, comforters, decorative pillows, bedskrits, shams, and dust ruffles, as well as a range of quilted products; fabrics for drapery and upholstery applications; and silk and blended yarn products, such as spun silk yarns, and silk yarns blended with wool, tussar, and linen. The company is also involved in the retail and distribution activities under the Calvin Klein Home, Barbara Barry, Divatex, Bellora, and Atmosphere brands. Himatsingka Seide Limited was founded in 1985 and is headquartered in Bengaluru, India.",
    "website": "http://www.himatsingka.com",
    "zipcode": "560001"
  },
  "ICIL.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Indo Count Industries Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "INDO COUNT INDUSTR",
    "state": null,
    "summary": "Indo Count Industries Limited manufactures and sells home textile products in India. It offers bed sheets; fashion bedding products, such as matching and complementary sheets, comforters, duvet covers, quilts, pillows, shams, and skirts; utility bedding products; institutional bedding products, which include matching sheets, comforters, duvet covers, quilts, pillows, shams, euro-shams, and skirts; and bedding products, such as flat sheets, printed bed sheets, fitted sheets, and bed skirt/valance. The company also produces cotton yarns and bed linens. In addition, it operates showrooms in the United Kingdom, the United States, and Australia. The company sells its products under the Boutique Living, Heirlooms of India, Atlas, Revival, The Pure Collection, Haven, Linen Closet, Simply Put, Whole Comfort, True Grip, Purity Home, The Cotton Exchange, Color Sense, Kids Corner, Morris & Co., Harlequin, Sanderson, and Scion brands through multi brand outlets, large format stores, and e-commerce platform. It exports its products to approximately 54 countries. The company was founded in 1988 and is headquartered in Mumbai, India.",
    "website": "http://www.indocount.com",
    "zipcode": "400021"
  },
  "INDIANCARD.NS": {
    "city": "Pune",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "The Indian Card Clothing Company Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "INDIAN CARD CLOTH",
    "state": null,
    "summary": "The Indian Card Clothing Company Limited manufactures and sells card clothing products and accessories in India and internationally. It operates through Card Clothing and Real Estate segments. The company's products include cotton and synthetic products comprising cylinder wires, doffer wires, lickerin wires, and flat tops; metallic wires for non-woven cards; woolen, sundry, and fancy fillets; and rasing fillets and brush sheets for various fibres, yarn rasing fillets, humbugs, and hand cleaning cards. It also provides Accura carding systems for ERM and RSK; Accura carding elements; and XTRAC systems. The company was founded in 1955 and is based in Pune, India. The Indian Card Clothing Company Limited is a subsidiary of Multi Act Industrial Enterprises Limited.",
    "website": "http://www.cardindia.com",
    "zipcode": "411026"
  },
  "INDORAMA.NS": {
    "city": "Gurugram",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Indo Rama Synthetics (India) Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "INDO RAMA SYNTHETC",
    "state": null,
    "summary": "Indo Rama Synthetics (India) Limited manufactures and supplies polyester in India, Indonesia, Thailand, the United States, Nepal, Sri Lanka, and Turkey. The company offers various polyester products, including polyester staple fiber, polyester filament yarn, draw texturized yarn, fully drawn yarn, and textile grade chips. Its products are used in various applications, such as apparel and sportswear, home furnishings and textiles, non-woven, and automotive. The company was incorporated in 1986 and is based in Gurugram, India.",
    "website": "http://www.indoramaindia.com",
    "zipcode": "122002"
  },
  "JBFIND.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "JBF Industries Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "JBF INDUSTRIES",
    "state": null,
    "summary": "JBF Industries Limited, together with its subsidiaries, manufactures and sells polyester products in India and internationally. The company offers textile and film grade polyester chips, bottle grade polyethylene terephthalate, fully draw and partially oriented yarns, and polyester textured yarn/sewing thread products. JBF Industries Limited was founded in 1982 and is based in Mumbai, India.",
    "website": "http://www.jbfindia.com",
    "zipcode": "400021"
  },
  "JINDCOT.NS": {
    "city": "Ludhiana",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Jindal Cotex Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "JINDAL COTEX LTD",
    "state": null,
    "summary": "Jindal Cotex Limited manufactures and sells yarns in India and internationally. It operates in two segments, Textile and Energy Generation. The Textile segment produces and trades in acrylic, polyester, poly/cotton blended, cotton, and other blended yarns and knitted clothes. The Energy Generation segment is involved in the generation and sale of energy from the windmill. Jindal Cotex Limited was incorporated in 1998 and is headquartered in Ludhiana, India.",
    "website": "http://www.jindalcotex.com",
    "zipcode": "141412"
  },
  "JINDWORLD.NS": {
    "city": "Ahmedabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Jindal Worldwide Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "JINDAL WORLDWIDE",
    "state": null,
    "summary": "Jindal Worldwide Limited, together with its subsidiaries, manufactures, sells, and exports textile products in India and internationally. The company offers denim products, bottom weight fabrics, shirting fabrics, yarn dyed fabrics, specialized fabrics, and technical fabrics and intermediates. It also provides bed sheets, such as quilt covers/duvet covers, flat and fitted sheets, pillow covers, valance sheets, and bloster cases. Jindal Worldwide Limited was founded in 1986 and is based in Ahmedabad, India.",
    "website": "http://www.jindaltextiles.com",
    "zipcode": "380015"
  },
  "LAMBODHARA.NS": {
    "city": "Coimbatore",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Lambodhara Textiles Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "LAMBODHARA TEXTILE",
    "state": null,
    "summary": "Lambodhara Textiles Limited manufactures and sells synthetic yarns in India and Internationally. The company operates through Textile, Wind Mills, and Real Estate segments. It offers slub yarns, multi count and multi twist yarns, siro yarns, and neppy yarns. The company also exports its products. In addition, it generates electricity through wind. Lambodhara Textiles Limited was founded in 1994 and is based in Coimbatore, India.",
    "website": "http://www.lambodharatextiles.com",
    "zipcode": "641018"
  },
  "MARALOVER.NS": {
    "city": "Noida",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Maral Overseas Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MARAL OVERSEAS",
    "state": null,
    "summary": "Maral Overseas Limited manufactures and sells cotton yarns, knitted fabrics, and garments in India and internationally. It operates in three segments: Yarn, Fabric, and Textile Made-Ups. The company's products comprise cotton combed Ecru and dyed yarns; and special yarns, including bamboo/cotton, modal/cotton, soya/cotton, organic cotton, fairtrade certified cotton, long staple cotton/pima cotton, slub, core spun lycra, compact, contamination free, reverse and zero twist, recycled cotton, and zero twist yarns used in various applications, such as circular and socks knitting, flat knits, towel weaving, denim and bottom weight fabrics, yarn dyeing, and sweaters. It also offers fabrics in various knits, such as single jersey, rib, interlock, piquet, fleece, French rib, pointelle, and autostriper/engineered stripe products; special fibers and yarns comprising bamboo and blends, soya and blends, organic cotton, fairtrade certified cotton, polyester, slub fabric, modal and blends, and tencel and blends; and special finishes. In addition, the company provides a range of garments consisting of active wear, casual wear, and sleep wear for men and ladies; and fairtrade garments and soft toys for infants and kids. Its knitted products include T-shirts, polo shirts, rugby shirts, henley shirts, hooded shirts, jackets, sweatshirts, tank tops, camisoles, shorts, pyjamas, joggers, etc. for men and ladies. The company markets its products in the United States, Canada, Europe, Japan, Hong Kong, the Middle East, South Africa, and other countries. Maral Overseas Limited was incorporated in 1989 and is based in Noida, India.",
    "website": "http://www.maraloverseas.com",
    "zipcode": "201301"
  },
  "MAYURUNIQ.NS": {
    "city": "Jaipur",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Mayur Uniquoters Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MAYUR UNIQUOTERS L",
    "state": null,
    "summary": "Mayur Uniquoters Limited manufactures and sells coated textile fabrics in India and internationally. The company's products include artificial leather/foam leather and other substitutes of leather. Its products are used in footwear, furnishings, automotive OEM, automotive replacement, and automotive exports markets. Mayur Uniquoters Limited was incorporated in 1992 and is based in Jaipur, India.",
    "website": "http://www.mayuruniquoters.com",
    "zipcode": "303704"
  },
  "MITTAL.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Mittal Life Style Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MITTAL LIFE STYLE",
    "state": null,
    "summary": "Mittal Life Style Limited supplies bottom weight fabrics and denims in India. It offers fashion fabrics, cotton canvas denims, dupion bottom fabrics, polyester fabrics, cotton fabrics, knit fabrics, etc. to textile industry. The company was founded in 2005 and is based in Mumbai, India.",
    "website": "http://www.mittallifestyle.in",
    "zipcode": "400053"
  },
  "MOHITIND.NS": {
    "city": "Surat",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Mohit Industries Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MOHIT INDUSTRIES",
    "state": null,
    "summary": "Mohit Industries Limited manufactures and sells texturized yarn from partially oriented yarn and weaving of yarn to grey cloth in India. The company offers textile products, such as yarns and grey. It also exports its products to South Korea, Thailand, the Czech Republic, Guatemala, Bulgaria, Indonesia, Japan, Vietnam, Malaysia, Mexico, Colombia, and internationally. The company was formerly known as Mohit Fibres Limited and changed its name to Mohit Industries Limited in 1997. Mohit Industries Limited was founded in 1991 and is headquartered in Surat, India.",
    "website": "http://www.mohitindustries.com",
    "zipcode": "395002"
  },
  "MOHOTAIND.NS": {
    "city": "Hinganghat",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Mohota Industries Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MOHOTA INDUSTRIES",
    "state": null,
    "summary": "Mohota Industries Limited manufactures and sells yarn and fabrics primarily in India. The company offers various synthetic/cotton/polycotton ring spun yarns; and cotton, single and double dyed, cross dyed, and grey/RFD, as well as plain, twill, and satin bleached and dyed fabrics. It also exports its products to Europe, South America, the Middle East, and the Far East countries. The company was formerly known as The Rai Saheb Rekhchand Mohota Spinning & Weaving Mills Ltd. and changed its name to Mohota Industries Limited in November 2017. The company was founded in 1898 and is headquartered in Hinganghat, India.",
    "website": "http://www.mohotaindustries.com",
    "zipcode": "442301"
  },
  "MORARJEE.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Morarjee Textiles Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MORARJEE TEXTILES",
    "state": null,
    "summary": "Morarjee Textiles Limited manufactures and sells yarns and fabrics in India and internationally. The company primarily offers premium cotton shirting fabrics. It also provides printed fabrics, including satin, cambric, poplin, lawn, and silk; and yarn dyed shirting, voiles, and white fabrics. The company was founded in 1871 and is based in Mumbai, India. Morarjee Textiles Limited is a subsidiary of Ashok Piramal Group Textiles Trust.",
    "website": "http://www.morarjee.com",
    "zipcode": "400013"
  },
  "NAGREEKEXP.NS": {
    "city": "Kolkata",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Nagreeka Exports Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "NAGREEKA EXPORTS",
    "state": null,
    "summary": "Nagreeka Exports Limited engages in manufacturing and selling cotton yarns and other various merchandise in India and internationally. The company also trades in cotton yarns and various commodities. In addition, it offers specialty yarns, such as organic, slub, normal and reverse twists, core spun, chenille, dyed/gassed/mercerized, high twist, viscose, and polyester spun yarns, as well as poly viscose, polyester cotton, and viscose cotton blends; and raw, printed, and finished fabrics. The company exports its products. Nagreeka Exports Limited was incorporated in 1989 and is headquartered in Mumbai, India.",
    "website": "http://www.nagreeka.com/nagreeka-exports/",
    "zipcode": "700001"
  },
  "NAHARINDUS.NS": {
    "city": "Ludhiana",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Nahar Industrial Enterprises Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "NAHAR IND ENTERPRI",
    "state": null,
    "summary": "Nahar Industrial Enterprises Limited, an integrated textile manufacturer, engages in spinning, weaving, processing, and selling textiles in India. It operates in two segments, Textile and Sugar. The company offers cotton, dyed cotton, compact spun, blended, polyester, industrial, open end, open end slub, TFO, specialized, Eli twist, core spun, and vortex yarns. It also provides various fabrics, including piece dyed, yarn dyed, and printed fabrics, as well as specialty and performance fabrics, and indigo yarn dyed shirting for use in apparels and home furnishings. In addition, the company produces various types and grades of sugar and allied products; and operates biomass/multi-fuel cogeneration power plants at Lalru and Amloh, Punjab. It also exports its products. The company was formerly known as Oswal Fats & Oils Limited and changed its name to Nahar Industrial Enterprises Limited in 1994. Nahar Industrial Enterprises Limited was incorporated in 1983 and is based in Ludhiana, India.",
    "website": "http://www.owmnahar.com/nahar_ie/about.php",
    "zipcode": "141010"
  },
  "NAHARSPING.NS": {
    "city": "Ludhiana",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Nahar Spinning Mills Ltd",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "NAHAR SPINNING",
    "state": null,
    "summary": "Nahar Spinning Mills Ltd manufactures and sells yarns and knitted garments in India. The company offers raw white combed, raw white carded/open end, dyed, organic cotton, fair trade cotton, better cotton initiative, melange, gassed/mercerized, compact spun, blended, synthetic/man-made fiber, and cleaner yarns, as well as grindle, space dyed, slub, core spun, high twist, reverse twist, and elitwist yarns. It also provides woolen/cotton hosiery knit-wears and woolen textiles; and T-shirts. The company also exports its products primarily to the United States, the United Kingdom, France, Brazil, Bangladesh, Mauritius, Honduras, Argentina, Colombia, Peru, Chile, the Netherlands, Japan, Canada, Korea, Taiwan, Hong Kong, Singapore, Egypt, and Russia. Nahar Spinning Mills Ltd was incorporated in 1980 and is based in Ludhiana, India.",
    "website": "http://www.owmnahar.com/spinning/about.php",
    "zipcode": "141003"
  },
  "NDL.NS": {
    "city": "Ahmedabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Nandan Denim Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "NANDAN DENIM LTD",
    "state": null,
    "summary": "Nandan Denim Limited manufactures and sells denims, denim and shirting fabrics, cotton fabrics, and yarns in India. It also exports its products to approximately 27 countries. The company was formerly known as Nandan Exim Limited and changed its name to Nandan Denim Limited in November 2013. Nandan Denim Limited was founded in 1994 and is headquartered in Ahmedabad, India.",
    "website": "http://nandandenim.com",
    "zipcode": "380015"
  },
  "NITINSPIN.NS": {
    "city": "Bhilwara",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Nitin Spinners Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "NITIN SPINNERS LTD",
    "state": null,
    "summary": "Nitin Spinners Limited manufactures and sells cotton yarns and knitted fabrics in India. The company offers open end, multifold open end, ring spun combed, multifold ring spun, compact ring spun combed, multi-fold compact ring spun, fancy slub, compact fancy slub, core spun, compact core Spun, S and Z twist, organic cotton, contamination free, zero and eli twist, and certified yarns, as well as dye able cheese/cones used in woven and knitted apparel, furnishing fabrics, denims, terry towel, medical fabrics, tea bags, and bed linen. It also provides single jersey, pique structured, interlock structured, rib structured, lycra blended, open width, and three thread fleece fabrics used in inner, sports, comfort, winter, and baby wears, as well as masks. In addition, the company offers finished and printed woven fabrics used in fashion and image, industrial and protective, and defense wears, as well as uniforms and health care and hotel apparels. It also exports its products in Europe, North America, South America, Africa, and Asia. The company was founded in 1992 and is headquartered in Bhilwara, India.",
    "website": "http://www.nitinspinners.com",
    "zipcode": "311025"
  },
  "ORBTEXP.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Orbit Exports Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ORBIT EXPORTS LTD",
    "state": null,
    "summary": "Orbit Exports Limited manufactures and sells fabrics, ribbons, and made ups in India. It operates in two segments, Manufacturing of Textile and Renewable Source of Energy. The company offers faux silk fabrics, fashion Jaquards, and Christmas crafts. It also operates in the United States, Latin America, Africa, Europe, and the Far East. The company was founded in 1983 and is headquartered in Mumbai, India.",
    "website": "http://www.orbitexports.com",
    "zipcode": "400020"
  },
  "PATSPINLTD.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Patspin India Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PATSPIN INDIA",
    "state": null,
    "summary": "Patspin India Limited manufactures and sells combed cotton yarns in India. It offers yarns of various counts from NE 20's to NE 100's, as well as value added products. The company also exports its products. Patspin India Limited was incorporated in 1991 and is based in Mumbai, India.",
    "website": "http://www.patspin.com",
    "zipcode": "400021"
  },
  "PIONEEREMB.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Pioneer Embroideries Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PIONEER EMBROID LT",
    "state": null,
    "summary": "Pioneer Embroideries Limited, together with its subsidiaries, manufactures and sells embroideries, torchon/bobbin laces, raschel laces, and other garment accessories in India. Its products include dope dyed polyester yarns; embroidered laces-fabric and guipure, and embroidered dress materials; braided laces; embroidered fabrics, allover fabrics, and laces; and apparel. The company also provides elastics, flat bed knitted laces, and motifs/collars/necks. In addition, the company engages in the retail of embroidered clothing under the Hakoba brand. It also exports its products. Pioneer Embroideries Limited was founded in 1991 and is based in Mumbai, India.",
    "website": "http://www.pelhakoba.com",
    "zipcode": "400062"
  },
  "PRADIP.NS": {
    "city": "Ahmedabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Pradip Overseas Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PRADIP OVERSEAS LT",
    "state": null,
    "summary": "Pradip Overseas Limited manufactures and exports home textiles, home decors, and home furnishings in India and internationally. It offers cushions, towels, comforters, flannels, jerseys, readymade garments, and seersuckers; and home furnishing products, such as table linens, bed spreads, quilts, cushion covers, and curtains, as well as cotton and micro products. The company was founded in 1980 and is based in Ahmedabad, India.",
    "website": "http://www.pradipoverseas.com",
    "zipcode": "380009"
  },
  "PRECOT.NS": {
    "city": "Coimbatore",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Precot Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PRECOT LTD",
    "state": null,
    "summary": "Precot Limited manufactures and sells yarn and technical textile products in India. It offers normal, compact, organic, BCI, slub, doubled, gassed, and open end cotton yarns; polyester cotton blend yarns; cotton dyed yarns; and polyester sewing threads. The company also provides health and hygiene products consisting of finished products in normal, organic, and BCI cotton forms, such as cosmetic make up removal pads, cotton balls, pleat/zig zag products, and cotton wool rolls; roll and absorbent cotton; and fabrics. It also exports its products. The company was formerly known as Precot Meridian Limited and changed its name to Precot Limited in December 2020. Precot Limited was founded in 1962 and is based in Coimbatore, India.",
    "website": "http://www.precot.com",
    "zipcode": "641028"
  },
  "RAJRAYON.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Raj Rayon Industries Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "RAJ RAYON INDUSTRI",
    "state": null,
    "summary": "Raj Rayon Industries Limited engages in the manufacturing and trading of polyester chips, and polyester and processed yarns in India. It offers round, trilobal, and octalobal yarns, as well as full dull, semi dull, bright, cationic, doped dyed, fire retardant, and anti-microbial yarns. Raj Rayon Industries Limited exports its products to Brazil, Chile, Colombia, Mexico, Poland, Spain, Thailand, Iran, Egypt, Syria, Vietnam, Morocco, Peru, Gautemala, and internationally. The company was formerly known as Raj Rayon Limited and changed its name to Raj Rayon Industries Limited in August 2010. Raj Rayon Industries Limited was incorporated in 1993 and is based in Mumbai, India.",
    "website": "http://www.rajrayon.com",
    "zipcode": "400059"
  },
  "RAJVIR.NS": {
    "city": "Secunderabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Rajvir Industries Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "RAJVIR INDUSTRIES",
    "state": null,
    "summary": "Rajvir Industries Limited primarily manufactures, processes, and sells yarns in India. It offers cotton, organic, fair-trade, and combed yarns; blended yarns, including polyester, viscose, modal, spun silk, and flame-retardant; and melange/heather, modal, synthetic, and cheese-dyed yarns. The company also provides fashion yarns, super specialty blends, technical textile products, and eco-friendly and fancy yarns. In addition, it offers dyed products and compact yarns; and supima, silk, wool, cashmere, and angora blends. The company also exports its products to 42 countries. Rajvir Industries Limited was founded in 1962 and is based in Secunderabad, India.",
    "website": "http://www.rajvirindustrieslimited.com",
    "zipcode": "500003"
  },
  "RAYMOND.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Raymond Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "RAYMOND LTD",
    "state": null,
    "summary": "Raymond Limited operates as a textile, lifestyle, and branded apparel company in India and internationally. It operates through Textile, Shirting, Apparel, Garmenting, Tools and Hardware, Auto Components, Real Estate Development, and Others segments. The company offers wool, poly-wool, silk, polyester viscose blended, cotton blended, linen blended, and other blended suiting fabrics; and cotton and linen shirting fabrics under the Raymond Fine Fabrics brand name. It also provides suits, jackets, trousers, and shirts; denim fabrics; menswear under the Raymond Ready-To-Wear, Park Avenue, Color Plus, and Parx brands; and ethnic wear under the Ethnix brands. In addition, the company offers steel files, cutting tools, hand tools, and power tools; and starter gears, water pump bearings, and flex plates. Further, it is involved in the non-scheduled airline operation and real estate property development businesses. It has 1,638 retail stores, including 1,589 stores in approximately 600 towns and cities in India, and 49 overseas stores in 9 countries. The company was founded in 1925 and is based in Mumbai, India.",
    "website": "http://www.raymond.in",
    "zipcode": "400001"
  },
  "RSWM.NS": {
    "city": "Noida",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "RSWM Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "RSWM LTD",
    "state": null,
    "summary": "RSWM Limited operates as a textile manufacturer in India, Europe, the Middle East, Africa, South East and Far East Asia, and the Americas. The company offers greige yarn for weaving, knitting, sewing, and industrial applications under the ULTIMA brand name; and melange yarn that is used for undergarments, shirts, business suits, socks, and sportswear, as well as bed linen, towels, and other home fabric products. It also provides shirting and suiting fabrics under the Mayur brand; denim fabrics; and various functional yarns under the RSWM EDGE brand name. The company was formerly known as Rajasthan Spinning & Weaving Mills Ltd. RSWM Limited was founded in 1960 and is based in Noida, India.",
    "website": "http://www.rswm.in",
    "zipcode": "201301"
  },
  "RUBYMILLS.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "The Ruby Mills Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "RUBY MILLS",
    "state": null,
    "summary": "The Ruby Mills Limited manufactures textile products in India. It operates through two segments, Textiles and Real Estate and Related. The company offers cotton, synthetics yarn, and fabrics, as well as engages in the development of real estate properties; and renting properties. It also exports its products. The company was founded in 1917 and is based in Mumbai, India.",
    "website": "http://www.rubymills.com",
    "zipcode": "400028"
  },
  "SALONA.NS": {
    "city": "Coimbatore",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Salona Cotspin Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SALONA COTSPIN",
    "state": null,
    "summary": "Salona Cotspin Limited produces and sells cotton textile products in India. The company offers cotton, blended, ring spin, open end, slub, hank, and compact yarn products, as well as knitted fabrics and apparels. It also provides grey, dyed, and printed fabrics. The company also exports its yarns and fabrics to Sri Lanka, Bangladesh, Hong Kong, South Korea, Germany, Mexico, South America, Russia, etc. Salona Cotspin Limited was incorporated in 1994 and is based in Coimbatore, India.",
    "website": "http://www.salonagroup.com",
    "zipcode": "641011"
  },
  "SANGAMIND.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Sangam (India) Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SANGAM INDIA",
    "state": null,
    "summary": "Sangam (India) Limited manufactures and sells PV dyed yarns in India and internationally. Its product portfolio includes PV blended dyed/grey yarns, cotton spun and open ended yarns, indigo rope dyed yarns, texturized yarns, PV fabrics and processed fabrics, synthetic blended fabrics, cotton knitted fabrics, and denim fabrics, as well as seamless garments, such as air wear, intimate wear, shape wear, leisure wear, active wear, and casual wear garments for women. The company also produces steel; solar, thermal, and wind power; and develops real estate properties. It markets its products under the C9 Airwear, Sangam Suitings, Sangam Denims, and Sangam Yarns brands through online and offline channels. The company also exports its products. Sangam (India) Limited was founded in 1984 and is headquartered in Mumbai, India.",
    "website": "http://www.sangamgroup.com",
    "zipcode": "400059"
  },
  "SARLAPOLY.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Sarla Performance Fibers Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SARLA PERFORMANCE",
    "state": null,
    "summary": "Sarla Performance Fibers Limited manufactures and sells yarns in India, the United States, and internationally. The company operates through two segments, Manufacturing of Yarn and Generation of Wind Power. It offers textured polyester, textured nylon stretch, high bulk textured polyester, high tenacity, covered, and dyed yarns, as well as textured sewing and specialty sewing threads. The company also owns 14.75 MW of windmills in Maharashtra, Gujarat, and Madhya Pradesh. It exports its products to approximately 40 countries, including European countries, such as Italy, Spain, Romania, Turkey, the United Kingdom, Portugal, etc.; Central and North America; South America comprising Brazil; and Asian countries comprising China, Vietnam, Thailand, Hong Kong, etc., as well as Jordan and Canada. The company was formerly known as Sarla Polyester Limited and changed its name to Sarla Performance Fibers Limited in 2006. Sarla Performance Fibers Limited was founded in 1993 and is headquartered in Mumbai, India.",
    "website": "http://www.sarlafibers.com",
    "zipcode": "400021"
  },
  "SGL.NS": {
    "city": "Faridabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "STL Global Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "STL GLOBAL LTD",
    "state": null,
    "summary": "STL Global Limited manufactures and sells textile products in India. It is involved in knitting, dyeing and processing, yarn dyeing, woven processing, thread sewing, and readymade garments manufacturing businesses. The company also produces and exports men's wear, women's tops, boys and girls wear, kids and infants wear, and knitted and woven bed sheets to the United States, the European Union, Canada, and internationally. In addition, it engages in real estate business. The company was formerly known as Shivalik Global Ltd. STL Global Limited was founded in 1997 and is based in Faridabad, India.",
    "website": "http://www.stl-global.com",
    "zipcode": "121004"
  },
  "SHIVAMILLS.NS": {
    "city": "Coimbatore",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Shiva Mills Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SHIVA MILLS LTD",
    "state": null,
    "summary": "Shiva Mills Limited manufactures and markets cotton yarns and fabric in India and internationally. The company also operates 22 windmills with an installed capacity of 10.65 MW. It also exports its products. The company was formerly known as STYL Textile Ventures Limited and changed its name to Shiva Mills Limited in August 2017. Shiva Mills Limited was incorporated in 2015 and is based in Coimbatore, India.",
    "website": "http://www.shivamills.com",
    "zipcode": "641043"
  },
  "SHIVATEX.NS": {
    "city": "Coimbatore",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Shiva Texyarn Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SHIVA TEXYARN LTD",
    "state": null,
    "summary": "Shiva Texyarn Limited manufactures and markets cotton yarn, and technical and other value added textile products in India and internationally. The company offers combed, carded, and compact yarns; slub and fancy yarns; quick dry products; quick fit products, including mattresses protectors; and baby products. It also provides door, window, and shower curtains, as well as cushion covers; knitwear, light weight shells, seam sealed, multi layered, fleece and pile fabrics, and breathable film laminated garments; and extreme cold weather clothing, super high altitude mountaineering clothing, extreme cold weather combat glove systems, and internal and external frame rucksacks. In addition, the company offers bedding range, such as sheets, duvet covets, and fleece blankets; kitchen articles comprising aprons, pot holders, and table cloths; bath, wipe, and swimming towels; acrylic coated, PU coating products, and art canvas and digital canvas products; and bags, such as sports and school bags, and girls and professional bags for camping and photography under the WULF name. The company was founded in 1980 and is based in Coimbatore, India.",
    "website": "http://www.shivatex.in",
    "zipcode": "641002"
  },
  "SIL.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Standard Industries Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "STANDARD INDS",
    "state": null,
    "summary": "Standard Industries Limited trades in textiles and chemical products primarily in India. It trades in cotton towels, bed sheets, interlining fabrics, cotton and blended dhotis, and cotton/PC blended and poly viscose suiting products; and cotton, PC poplins and shirting products, as well as ready to stitch PC blended and Punjabi suits. Standard Industries Limited also engages in the property business; and manufactures common salt. The company was formerly known as Standard Mills Company Limited and changed its name to Standard Industries Limited in October 1989. Standard Industries Limited was incorporated in 1892 and is based in Mumbai, India.",
    "website": "http://www.standardindustries.co",
    "zipcode": "400026"
  },
  "SINTEX.NS": {
    "city": "Kalol",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Sintex Industries Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SINTEX INDUSTRIES",
    "state": null,
    "summary": "Sintex Industries Limited manufactures and sells textiles and yarns in India and internationally. The company offers fabrics in various blends, including metallic yarn, silk yarn, mlange yarn, linen, modal, nylon-viscose, and cupro, as well as a range of weaves, such as dobbies, jacquards, leno, double beam and double ereel, and others; and men's/women's apparel and furnishings under the BVM brand. It also provides yarns comprising cotton combed and carded, compact, blended, contamination-free, ply, TFO/multi-fold, and ring spun yarns; and specialty yarns that include core spun, slub, neppy, injection, eli-twist, fancy, dyed, melange, linen, linen blended yarns, and other yarns. The company was formerly known as The Bharat Vijay Mills Limited and changed its name to Sintex Industries Limited in 1995. Sintex Industries Limited was founded in 1931 and is based in Kalol, India.",
    "website": "http://www.sintex.in",
    "zipcode": "382721"
  },
  "SIYSIL.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Siyaram Silk Mills Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SIYARAM SILK",
    "state": null,
    "summary": "Siyaram Silk Mills Limited manufactures and sells fabrics, readymade garments, and dyed yarns in India. The company offers fabrics, including polyester viscose, polyester viscose linen and lycra, polyester rayon and cotton, polyester wool, polyester wool lycra, wool lycra and linen, wool, cotton, linen, and cotton linen fabrics; and CVC and PC yarn-dyed shirting. It also provides ready-made formal and casual wear; home furnishing fabrics; and garments, including formal wear, casual attire, corporate uniforms, and home furnishing fabrics, as well as tailoring service under brand name Tailor Fit. In addition, the company operates and franchises a chain of retail stores, which offer menswear fashion fabrics and apparels, and accessories under the Siyaram's Shop name; and exports its products to the United Kingdom, Europe, North America, Latin America, Gulf countries, and South-East Asia. The company sells its products under the Siyaram's Suitings and Shirtings, Mistair, Moretti, Royale Linen, Moretti, Miniature, Unicode, J. Hampstead, Oxemberg, Mozo, Cadini, and Casa Moda brand names. Siyaram Silk Mills Limited was founded in 1978 and is based in Mumbai, India.",
    "website": "http://www.siyaram.com",
    "zipcode": "400013"
  },
  "SOMATEX.NS": {
    "city": "Ahmedabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Soma Textiles & Industries Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SOMA TEXTILE & IND",
    "state": null,
    "summary": "Soma Textiles & Industries Limited manufactures and sells textile fabrics in India. It offers non denim fabrics, garments, and piece dyed fabrics. The company was formerly known as R.B. Rodda & Co. Ltd. and changed its name to Soma Textiles & Industries Limited in January 1992. Soma Textiles & Industries Limited was founded in 1940 and is headquartered in Ahmedabad, India.",
    "website": "http://www.somatextiles.com",
    "zipcode": "380023"
  },
  "SPENTEX.NS": {
    "city": "New Delhi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "CLC Industries Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SPENTEX INDUSTRIES",
    "state": null,
    "summary": "CLC Industries Limited, a textile company, manufactures and trades in synthetic and cotton yarns in India and internationally. It offers hosiery, weaving, carpet, and industrial yarns; sewing threads; and flat knitting products for use in home textiles and garments industry applications. The company was formerly known as Spentex Industries Limited and changed its name to CLC Industries Limited in July 2018. CLC Industries Limited was incorporated in 1991 and is based in New Delhi, India.",
    "website": "http://www.clcindia.com",
    "zipcode": "110020"
  },
  "SPYL.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Shekhawati Poly-Yarn Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SHEKHAWATI POLY",
    "state": null,
    "summary": "Shekhawati Poly-Yarn Limited manufactures and sells polyester texturized yarns and twisted yarns in India. The company offers roto, weft, micro, full dull, catonic, twisted TPM, and dyed yarns, as well as knitted fabrics. Its products are used in the weaving of fabrics to manufacture suiting, shirting, dress materials, saris, hosieries, knitted fabrics, zipper fasteners, curtains, and industrial cloth products, as well as to manufacture fancy yarns for dress materials and upholstery. The company also exports its products to Argentina, Israel, Morocco, Brazil, Jordan, Peru, Canada, Kenya, Thailand, Egypt, Mexico, Turkey, Bangladesh, Belgium, Sri Lanka, Indonesia, Vietnam, Colombia, Venezuela, Ethiopia, and Poland. Shekhawati Poly-Yarn Limited was incorporated in 1990 and is based in Mumbai, India.",
    "website": "http://www.shekhawatiyarn.com",
    "zipcode": "400097"
  },
  "STINDIA.NS": {
    "city": "Indore",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "STI India Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "STI INDIA",
    "state": null,
    "summary": "STI India Limited manufactures and sells spun yarns and knitted grey fabrics in India. Its products include organic cotton and blended, BCI cotton, fairtrade cotton, viscose and blended, linen blended, EliTwist, TFO, neppy, slub, core spun, special fiber, high twist, and fancy yarns; and single jersey, rib, pique, 3-thread fleece, and fancy knitted fabrics. The company was incorporated in 1984 and is based in Indore, India. STI India Limited is a subsidiary of Bombay Rayon Fashions Limited.",
    "website": "http://www.stitextile.net",
    "zipcode": "453332"
  },
  "SUMEETINDS.NS": {
    "city": "Surat",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Sumeet Industries Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SUMEET INDUSTRIES",
    "state": null,
    "summary": "Sumeet Industries Limited manufactures and sells yarns in India. The company provides polyester chips, partially oriented yarns, fully draw yarns, polyester texturized yarns, and carpet yarns. It also exports its products to Egypt, Saudi Arabia, China, Argentina, Poland, Portugal, Morocco, Columbia, Bangladesh, Russia, Ethiopia, Mexico, Nepal, Brazil, Peru, Algeria, Thailand, the United States, Singapore, Turkey, etc. The company was formerly known as Sumeet Synthetics Limited and changed its name to Sumeet Industries Limited in 1996. Sumeet Industries Limited was incorporated in 1988 and is based in Surat, India.",
    "website": "http://www.sumeetindustries.com",
    "zipcode": "395002"
  },
  "SUPERSPIN.NS": {
    "city": "Coimbatore",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Super Spinning Mills Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SUPER SPINNING",
    "state": null,
    "summary": "Super Spinning Mills Limited manufactures and sells cotton yarn for knitting and weaving in India. It offers ring, compact, compact elitwist, TFO doubled, gassed, TFO, organic, and BCI cotton yarns; and specialty yarns, such as modal and micro modal, tencel and micro tencel, cotton blended modal and micro modal, and cotton blended tencel and micro tencel yarns. The company also exports its products. Super Spinning Mills Limited was founded in 1962 and is based in Coimbatore, India.",
    "website": "http://www.superspinning.com",
    "zipcode": "641045"
  },
  "SURYALAXMI.NS": {
    "city": "Secunderabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Suryalakshmi Cotton Mills Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SURYALAKSHMI COTTO",
    "state": null,
    "summary": "Suryalakshmi Cotton Mills Limited manufactures and sells cotton and blended yarns, denim fabrics, and garments in India. The company provides spun polyester, polyester cotton combed/carded blend, polyester viscose blend, cotton OE and ring spun, slub and fancy, core spun elastane, 2 fold, eli-twisted, and compact yarns. The company also offers mercerized, coated, normal finish, cotton/polyester, yarn dyed/over dyed, and mill washed stretch and rigid denims. It serves private labels, fashion brands, and retail chains in 29 countries worldwide. Suryalakshmi Cotton Mills Limited was founded in 1962 and is based in Secunderabad, India.",
    "website": "http://www.suryalakshmi.com",
    "zipcode": "500003"
  },
  "SUTLEJTEX.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Sutlej Textiles and Industries Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SUTLEJ TEXTILES",
    "state": null,
    "summary": "Sutlej Textiles and Industries Limited manufactures and sells yarns and home textiles in India. It operates through two segments, Yarn and Home Textiles. The company offers various yarns, including polyester, viscose, acrylic, modal and tencel, cotton mlange and cone-dyed, polyester/viscose, polyester/cotton, acrylic/cotton, polyester/acrylic, modal/cotton, modal/polyester, viscose/cotton, and bamboo/cotton yarns; and micro-polyester, micro-acrylic, micro-modal, hamel covered, low piling, carpet backing and pile, ready-to-dye package, cationic dyeable, bamboo, and soy milk fiber yarns. It also provides home textiles, such as curtains, cushions, throws, table covers, table mats, runners, duvets, comforters; drapery fabrics; upholstery fabrics; made-ups comprising cushions, throws, curtains, bed scarves, shams, quilts and quilting materials, and chenille items; and finishes consisting of fire retardants, insect repellents, scotchgard protection finishes, aero and decca finishes, soil repellents, and bio and aroma finishes. In addition, the company exports its products to approximately 62 countries. Sutlej Textiles and Industries Limited was incorporated in 2005 and is based in Mumbai, India.",
    "website": "http://www.sutlejtextiles.com",
    "zipcode": "400063"
  },
  "SWANENERGY.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Swan Energy Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SWAN ENERGY LTD",
    "state": null,
    "summary": "Swan Energy Limited engages in the textile, real estate, and energy businesses in India. It manufactures and markets cotton and polyester textile products; and develops commercial and residential real estate properties. The company also constructs and operates LNG Port terminal at Jafrabad port area in the Amreli district of Gujarat with a total capacity of 5 MMTPA. In addition, it engages in the trading of gas commodities, etc.; and mining activities. The company was formerly known as Swan Mills Limited. Swan Energy Limited was incorporated in 1909 and is based in Mumbai, India.",
    "website": "http://www.swan.co.in",
    "zipcode": "400001"
  },
  "THOMASCOTT.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Thomas Scott (India) Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "THOMAS SCOTT (INDI",
    "state": null,
    "summary": "Thomas Scott (India) Limited trades in textiles and fabrics in India. The company also manufactures and trades in garments. It offers men's formal and casual shirts. The company offers its products under the Hammersmith, Bang & Scott, Italian Gold, and Thomas Scott brands. Thomas Scott (India) Limited was incorporated in 2010 and is based in Mumbai, India.",
    "website": "http://www.thomasscott.org",
    "zipcode": "400013"
  },
  "TRIDENT.NS": {
    "city": "Ludhiana",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Trident Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "TRIDENT LTD",
    "state": null,
    "summary": "Trident Limited manufactures, trades in, and sells textiles, papers, and chemicals in the United States, India, and internationally. It provides cotton, blended yarn, special open end yarn, organic cotton, core spun yarns, Eli-twist yarn, compact yarn, slub yarn, and a range of value added yarns, such as melanges, package dyed, gassed mercerized yarn, zero twist, wrapper yarn, bamboo/cotton, modal/cotton, soya/cotton, polyester/cotton, BCI cotton, BMP cotton, and dyed yarns; bath linens, bath mats, and bath rugs; bed linen, such as sheets, duvets, quilts, pillows, and dohars. The company also offers copier, writing and printing, maplitho, bible and offset print, bond, stiffener, cartridge, index, watermark, drawing, digital printing, carry bag, wedding card, sublimation, and virgin unbleached kraft papers; and commercial, battery, and laboratory reagent grade sulphuric acid for detergent manufacturers, iron and steel units, and textile factories, as well as pharmaceuticals, paper, dyes and chemicals, alum, detergent slurry, and ETP industries. It also exports its products. The company was formerly known as Abhishek Industries Limited and changed its name to Trident Limited in April 2011. Trident Limited was founded in 1990 and is headquartered in Ludhiana, India.",
    "website": "http://www.tridentindia.com",
    "zipcode": "141001"
  },
  "TTL.NS": {
    "city": "New Delhi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "T.T. Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "TT LTD",
    "state": null,
    "summary": "T.T. Limited manufactures and sells textiles in India. The company's products include raw cotton; cotton yarn for knitting and weaving; various knitted fabrics; knitted innerwear; garments for men, ladies, and kids; and cotton and polyster sewing threads. It also offers agro commodities, such as poultry and cattle feed, including soybean meal, de oiled rice bran, cotton seed meal, groundnut meal, castor meal, safflower meal, rapeseed meal, and barley; oil seeds, such as groundnut kernels, hulled sesame seeds, natural white and black sesame seeds, and niger seeds; spices consisting of cumin, fennel, ajwain, dill, fenugreek, and coriander seeds, as well as turmeric fingers; grains, including yellow corn/maize, millets, and sorghum; and castor oil and derivatives, such as castor oil and castor seed extraction meal. The company also exports its products. T.T. Limited was incorporated in 1978 and is headquartered in New Delhi, India.",
    "website": "http://www.ttlimited.co.in",
    "zipcode": "110005"
  },
  "VARDHACRLC.NS": {
    "city": "Ludhiana",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Vardhman Acrylics Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "VARDHMAN ACRYLICS",
    "state": null,
    "summary": "Vardhman Acrylics Limited manufactures and supplies acrylic fiber and tow in India. The company markets its products under the VARLAN brand name. Vardhman Acrylics Limited was incorporated in 1990 and is based in Ludhiana, India. Vardhman Acrylics Limited is a subsidiary of Vardhman Textiles Limited.",
    "website": "http://www.vardhmanacrylics.com",
    "zipcode": "141010"
  },
  "VARDMNPOLY.NS": {
    "city": "Ludhiana",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Vardhman Polytex Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "VARDHMAN POLYTEX",
    "state": null,
    "summary": "Vardhman Polytex Limited, through its subsidiaries, manufactures and sells yarns and garments in India and internationally. The company provides carded, combed, organic, and BCI cotton yarns; cotton polyester yarns; and grey and dyed value added yarns. The company was incorporated in 1980 and is based in Ludhiana, India.",
    "website": "http://www.vpl.in",
    "zipcode": "141123"
  },
  "VISHAL.NS": {
    "city": "Ahmedabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Vishal Fabrics Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Vishal Fabrics Limited",
    "state": null,
    "summary": "Vishal Fabrics Limited engages in dyeing, printing, and processing of fabrics and yarns in India. It offers Denim bottom, Denim shirting, and jegging fabrics for men, women, and kids. The company also exports its products. Vishal Fabrics Limited was founded in 1972 and is based in Ahmedabad, India.",
    "website": "http://www.vishalfabricsltd.com",
    "zipcode": "380058"
  },
  "VIVIDHA.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Visagar Polytex Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "VISAGAR POLYTEX",
    "state": null,
    "summary": "Visagar Polytex Limited engages in the design, manufacture, wholesale, retail, and trade of textiles in India. It offers ethnic wear, including sarees, lehangas, and suits; interlining goods; and various fabrics. The company also operates a retail chain that offer designer sarees under the Vividha brand. In addition, it is involved in the contract-based manufacturing activity. The company was incorporated in 1983 and is based in Mumbai, India.",
    "website": "http://vpl.visagar.com",
    "zipcode": "400058"
  },
  "VTL.NS": {
    "city": "Ludhiana",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Vardhman Textiles Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "VARDHMAN TEXTILES",
    "state": null,
    "summary": "Vardhman Textiles Limited, together with its subsidiaries, manufactures and sells textiles and fibre in India, the United States, Europe, rest of Asia, and internationally. The company manufactures yarns, fabrics, fibers, threads, and garments. It offers specialized greige and dyed yarns in cotton, polyester, acrylic, and various blends; and value added products, such as organic cotton, melange, core spun yarns, ultra yarns, gassed mercerized, super fine yarns, slub and cellulose yarns, and fancy yarns for hand knitting. It also engages in lending and investing activities; and manufacture and sale of steel products, including hot rolled bars, and special and alloy steel for automotive, engineering, bearing, and allied industries. The company also exports its products. The company was formerly known as Mahavir Spinning Mills Limited and changed its name to Vardhman Textiles Limited in September 2006. Vardhman Textiles Limited was founded in 1965 and is headquartered in Ludhiana, India.",
    "website": "http://www.vardhman.com",
    "zipcode": "141010"
  },
  "WEIZMANIND.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Weizmann Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "WEIZMANN",
    "state": null,
    "summary": "Weizmann Limited engages in the textile processing business in India. The company provides cotton voiles, pracales, and African prints. Weizmann Limited also exports its products primarily to Africa. The company was formerly known as Weizmann Industries Ltd and changed its name to Weizmann Limited in 1994. Weizmann Limited was incorporated in 1985 and is based in Mumbai, India.",
    "website": "http://www.weizmann.co.in",
    "zipcode": "400001"
  },
  "WELSPUNIND.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Welspun India Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "WELSPUN INDIA",
    "state": null,
    "summary": "Welspun India Limited manufactures and sells home textile products in India and internationally. It offers solid, yarn-dyed, dobby, and jacquard towels and bath robes; bath rugs/mats, such as cotton, nylon, PET, and polyester filament-based Drylon and Resilon yarn rugs; and printed nylon and polyester bath mats. The company also provides utility bedding and bed sheet products comprising pillow fillers, mattress pads, and down-alternative filled comforters; and fashion bedding products for the bedroom. In addition, it offers flooring products, including carpet tiles, broadloom carpets and area rugs, and artificial grasses. The company offers its products under the Christy, Spaces, Welspun, Welspun Health, Welhome, and Spun brands; and Hyrgrocotton and Wel-Trak ingredient brands. Further, it generates power. The company was formerly known as Welspun Winilon Silk Mills Pvt. Ltd. and changed its name to Welspun India Limited in 1995. The company was founded in 1985 and is based in Mumbai, India. Welspun India Limited operates as a subsidiary of Welspun Group Master Trust.",
    "website": "http://www.welspunindia.com",
    "zipcode": "400013"
  },
  "ZENITHEXPO.NS": {
    "city": "Kolkata",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Textile Manufacturing",
    "long_name": "Zenith Exports Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ZENITH EXPORTS LTD",
    "state": null,
    "summary": "Zenith Exports Limited designs, manufactures, and sells fabrics to fashion and home furnishing industries in India and internationally. The company offers a range of silk, velvet, embroidery, and weave, fabrics. It also provides industrial leather hand gloves, silk fabrics, and made-ups. The company also exports its products. Zenith Exports Limited was founded in 1969 and is headquartered in Kolkata, India.",
    "website": "http://www.zenithexportslimited.com",
    "zipcode": "700001"
  }
}
