{
    "ADANIENT.NS": {
        "short_name": "ADANI ENTERPRISES",
        "long_name": "Adani Enterprises Limited",
        "summary": "Adani Enterprises Limited, together with its subsidiaries, engages in the coal trading, coal mining, oil and gas exploration, ports, multi-modal logistics, power generation and transmission, gas distribution, and edible oil and agro commodities businesses in India and internationally. The company trades in coal; offers bunkering and integrated coal management services; imports fruits, apple, pear, kiwi, oranges, and grapes; and markets its apple under the FARM-PIK brand, as well as food grains. It is also involved in the mining, processing, acquisition, exploration, and development of various coal properties, including Parsa East and Kanta Basan coal block, Kente Extension coal block, Parsa coal block, and Jitpur coal block; a coal mining concession in Indonesia; and the Carmichael Coal mine in the Galilee Basin in Queensland, Australia, as well as solar PV manufacturing business. In addition, company offers edible oils, basmati rice, pulses, soya chunks, and besan and atta, as well as lauric and bakery fats, castor oil derivatives, oleo chemicals, and soya value added products under the Fortune, King's, Bullet, Raag, Avsar, Pilaf, Jubilee, Fryola, Alpha, and Aadhar brands. Further, it manufactures fighter aircraft, unmanned aerial systems, and helicopters; develops avionics and systems, aero structures and components, aerospace composites, and radar and electronic warfare systems, as well as constructs rail transit systems; and engages in the mining of minerals and ores activities. The company was founded in 1988 and is based in Ahmedabad, India. Adani Enterprises Limited is a subsidiary of S.B. Adani Family Trust.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "382421",
        "website": "http://www.adanienterprises.com",
        "full_time_employees": 2042
    },
    "COALINDIA.NS": {
        "short_name": "COAL INDIA LTD",
        "long_name": "Coal India Limited",
        "summary": "Coal India Limited, together with its subsidiaries, produces and sells coal worldwide. It offers coking coal primarily for use in steel making and metallurgical industries, and for hard coke manufacturing; and semi coking coal that is used as blend-able coal in steel making, merchant coke manufacturing, and other metallurgical industries. The company also provides non-coking coal for use as thermal grade coal for power generation, as well as for cement, fertilizer, glass, ceramic, paper, chemical, and brick manufacturing, and other heating purposes. In addition, it offers beneficiated and washed non-coking coal for use in power generation; beneficiated non-coking coal, which is used in cement, sponge iron, and other industrial plants; and middling products for use in power generation, domestic fuel plants, brick manufacturing units, cement plants, industrial plants, etc. Further, the company provides rejects for use in fluidized bed combustion boilers for power generation, road repairs, briquette making, land filling, etc.; CIL/LTC coke that is used in furnaces and kilns of industrial units, as well as for use as domestic fuel by halwais, hotels, etc.; and coal/coke fines that are used in industrial furnaces, and for domestic purposes. Additionally, it offers tar/heavy oil/light oil/soft pitches, which are used in furnaces and boilers of industrial plants, as well as power houses, oil, dye, pharmaceutical industries, etc. The company was formerly known as Coal Mines Authority Limited and changed its name to Coal India Limited in November 1975. The company was incorporated in 1973 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700156",
        "website": "http://www.coalindia.in",
        "full_time_employees": 272445
    },
    "GMDCLTD.NS": {
        "short_name": "GUJARAT MINERAL DE",
        "long_name": "Gujarat Mineral Development Corporation Limited",
        "summary": "Gujarat Mineral Development Corporation Limited engages in mining business in India. It operates in two segments, Mining and Power. The company explores for lignite, bauxite, fluorspar, manganese, silica sand, limestone, bentonite, and ball clay. It also generates power using thermal, wind, and solar sources. The company was incorporated in 1963 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380052",
        "website": "http://www.gmdcltd.com",
        "full_time_employees": 1196
    },
    "MERCATOR.NS": {
        "short_name": "MERCATOR LTD",
        "long_name": "Mercator Limited",
        "summary": "Mercator Limited, together with its subsidiaries, engages in shipping, dredging, oil and gas, and coal businesses. It operates in two segments, Shipping; and Coal Mining, Trading and Logistics. The company is involved in coal mining, procurement, and logistics activities. It owns and operates coal mines in Indonesia; and a mining license in Mozambique. The company also explores for petroleum in two blocks located in Cambay basin, Gujarat in India. In addition, it has a fleet of oil tankers and dredgers; and rents and leases water-transport equipment. The company was formerly known as Mercator Lines Limited and changed its name to Mercator Limited in November 2011. Mercator Limited was founded in 1983 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.mercator.in",
        "full_time_employees": 247
    },
    "REFEX.NS": {
        "short_name": "REFEX INDUSTRIES L",
        "long_name": "Refex Industries Limited",
        "summary": "Refex Industries Limited engages in handling and disposal of fly ash from power plants in India. It operates through Coal & Ash Handling Business, Solar Power-Generation and Related Activities, Refrigerant Gases-Manufacturing (Refilling), and Sale of Service segments. The company primarily refills hydrofluorocarbons, which are used in automobile and room air-conditioners, and refrigerating equipment. It also generates and distributes solar power; trades in coal and solar accessories; provides coal crushing and coal yard management services; and consultancy services, such as techo-commercial feasibility study for power evacuation systems, labor services for EPC contracts with respect to the solar business. The company was formerly known as Refex Refrigerants Limited and changed its name to Refex Industries Limited in November 2013. Refex Industries Limited was incorporated in 2002 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600017",
        "website": "http://refex.co.in",
        "full_time_employees": null
    }
}