{
    "GODFRYPHLP.NS": {
        "short_name": "GODFREY PHILLIPS",
        "long_name": "Godfrey Phillips India Limited",
        "summary": "Godfrey Phillips India Limited manufactures and sells cigarettes, chewing products, and tobacco products primarily in India and internationally. It operates through Cigarette, Tobacco, and Related Products; Retail and Related products; and Other segments. The company also manufactures leaf blends and cut tobacco; and trades in and distributes tobacco and other retail products, and vaping devices. Godfrey Phillips India Limited sells its cigarette products under the Four Square, Red & White, Cavanders, Stellar, North Pole and Tipper, Time 7, Originals, Business Kings, Jaisalmer, and Marlboro brands; pan masala under the Pan Vilas and RAAG brands; mouth freshener under the Pan Vilas Silver Dewz brand; and candies under the Funda Goli brand name. In addition, the company grows tobacco; and operates convenience stores under the 24SEVEN name. Further, it is also involved in the real estate business. The company also exports its products. Godfrey Phillips India Limited was incorporated in 1936 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Tobacco",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "ITC.NS": {
        "short_name": "ITC LTD",
        "long_name": "ITC Limited",
        "summary": "ITC Limited engages in the fast moving consumer goods, hotels, paperboards, paper and packaging, agri, and information technology (IT) businesses in India and internationally. The company primarily offers cigarettes and cigars; staples, spices, biscuits, confectionery and gums, snacks, noodles and pasta, beverages, dairy, ready to eat meals, chocolate, coffee, and frozen foods; personal care products; education and stationery products; safety matches; and incense sticks under various brands. It also retails formals and casual wear products, and other lifestyle products under the WLS brand. In addition, the company offers paper boards and specialty paper products; and packaging products, such as carton board, flexible, tobacco, and green packaging products, as well as operates approximately 100 hotels under the ITC Hotel, WelcomHotel, Fortune, and WelcomHeritage brands. Further, it exports feed ingredients, food grains, marine products, processed fruits, coffee products, leaf tobacco products, and spices; and offers IT services and solutions. Additionally, the company offers technology services and solutions for the banking, financial services, consumer packaged goods, manufacturing, travel, hospitality, and healthcare industries. The company also provides property infrastructure and real estate maintenance, business consulting, real estate development, and agro-forestry and other related services; manages and operates golf courses; fabricates and assembles machinery for tube filling, cartoning, wrapping, conveyor solutions, and engineering services; and produces and commercializes seed potato technology products. ITC Limited was incorporated in 1910 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Tobacco",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    },
    "VSTIND.NS": {
        "short_name": "VST INDUSTRIES",
        "long_name": "VST Industries Limited",
        "summary": "VST Industries Limited manufactures and sells tobacco and its related products in India and internationally. It also offers leaf and unmanufactured tobacco, and cigarettes that contain tobacco. The company was formerly known as Vazir Sultan Tobacco Company Limited and changed its name to VST Industries Limited in April 1983. VST Industries Limited was incorporated in 1930 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Consumer Defensive",
        "industry": "Tobacco",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    }
}